{
    "authors": [],
    "date_download": "2024-02-05 15:14:30",
    "date_modify": "None",
    "date_publish": "2024-01-31 00:30:22",
    "description": "White House officials are declining to identify which militant groups are believed to be responsible",
    "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fbiden-jordan-drone-attack-b2487443.html.json",
    "image_url": "https://static.independent.co.uk/2024/01/30/16/AP24030568851613.jpg?quality=75&width=1200&auto=webp",
    "language": "en",
    "localpath": null,
    "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Pentagon has announced that “there will be consequences” for the deadly drone attack on a US base in Jordan that killed three American soldiers over the weekend, just hours after President Joe Biden told reporters that he had decided on a plan to respond to the strike by Iranian-backed militias.\nThe Defense Department press secretary, US Air Force Major General Patrick Ryder, told reporters that the deaths of the three army soldiers and the injury to several dozen more merited a response in kind from the United States.\n“Three US service members were killed, over 40 wounded,” Maj Gen Ryder said, noting that “these service members were deployed into the region to contribute to regional security and stability in support of the international coalition to ensure the lasting defeat of Isis. So there will be consequences, and I’ll just leave it at that”.\nAfter Maj Gen Ryder was asked about a purported message on Telegram from Kata’ib Hezbollah warning its fighters to refrain from attacking US bases or personnel, even in response to an American strike, he replied that the Pentagon was aware of the alleged message but declined to elaborate further.\n“We’ve seen those reports. I don’t have a specific comment to provide other than actions speak louder than words,” he said.\nJoe Biden speaks to the media at the White House on Tuesday (AP)\nThe Pentagon spokesperson told reporters he would not “get into any details” about what form the response to the Sunday attack could take, although he noted that both Mr Biden and defense secretary Lloyd Austin have both promised that the US would response “in a time [and] in a manner of our choosing”.\nUS officials have posited that the drone escaped air defence systems because it was mistaken for a separate, US-owned aircraft that was returning to the base.\nMaj Gen Ryder addressed the drone attack in an initial statement during the briefing on Tuesday saying, “In terms of additional details about the drone attack itself, we know there are still many questions to include how the one-way attack drone could have penetrated the facility’s air defences, its point of origin and which specific Iranian proxy group is responsible”.\nWhile the US has not specifically attributed the attack to any particular group, the president also told reporters that he holds Iran responsible for the attack because that country’s government is “supplying the weapons to the people who did it”, though he declined to say whether a direct link between Tehran and the attacks has been established by US intelligence.\nMaj Gen Ryder echoed Mr Biden’s sentiments in his comments to the Pentagon press corps, though he, too, declined to attribute the attack to a specific group.\n“What we do know is that Iran-backed militias are responsible for these continued attacks on US forces and that we will respond at a time and manner of our choosing. While we do not seek to escalate tensions in the region, we will also take all necessary actions to protect our troops or facilities in our interests,” he added.\nIn the days since the drone attack, some Republicans have been calling for the US to respond by attacking targets within Iran’s borders, while Biden administration officials have been contemplating several different response scenarios, including strikes on Iranian proxies and a strike on an Iranian naval ship in the Persian Gulf.\nBut Mr Biden said he did not want to see the situation escalate into a broader regional conflict. “I don’t think we need a wider war in the Middle East. That’s not what I’m looking for,” he said.\nOver the weekend, Mr Biden had promised a US response to the deadly incident, which is widely believed to be part of a campaign orchestrated by Tehran to escalate tensions and inflict damage on the US and its allies in the Middle East.\nNational Security Council spokesperson John Kirby said on Monday that “there’s a responsibility that appropriately needs to be laid at the feet of leaders in Tehran” for the attacks and noted that the Iranian government “clearly” continues to support militant groups that have been attacking US positions, ships, and international commercial shipping in the Red Sea.\nThe drone attack struck a housing trailer on the small, remote US base, known as Tower 22, and killed the three soldiers occupying it while wounding more than 40 others, with eight of the casualties requiring evacuation to a medical facility in Iraq.\nThe Pentagon on Monday identified the soldiers as Sgt William Jerome Rivers, 46, of Carrollton, Georgia; Specialist Kennedy Ladon Sanders, 24, of Waycross, Georgia; and Specialist Breonna Alexsondria Moffett, 23, of Savannah, Georgia. All three were army reservists assigned to the 718th Engineer Company, 926th Engineer Battalion, 926th Engineer Brigade out of Fort Moore, Georgia.",
    "source_domain": "www.independent.co.uk",
    "text": null,
    "title": "Pentagon warns ‘there will be consequences’ for killing of US soldiers as Biden decides on plan",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-jordan-drone-attack-b2487443.html"
}