{"authors": ["Arthur Parashar"], "date_download": "2024-02-05 15:16:11", "date_modify": "None", "date_publish": "2024-01-23 22:45:09", "description": "British and US strikes against Houthi targets in Yemen were retaliation for 'illegal and reckless' attacks on Red Sea ships, the Government said in a joint statement tonight.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12998527%2FBritain-carry-round-airstrikes-Houthi-rebel-targets-Yemen.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/23/22/80331119-0-image-a-74_1706049825223.jpg", "language": "en", "localpath": null, "maintext": "British and US strikes against Houthi targets in Yemen were retaliation for 'illegal and reckless' attacks on Red Sea ships, the Government said in a joint statement tonight.\nThe two allies launched a second wave of strikes against eight Houthi targets in Yemen last night, which followed the first joint attack on January 11.\n'These strikes were designed to disrupt and degrade the capability of the Houthis to continue their attacks on global trade and innocent mariners from around the world, while avoiding escalation,' the statement said.\nAlbania, Australia, Bahrain, Canada, Croatia, Czech Republic, Denmark, Estonia, Germany, Guinea-Bissau, Hungary, Italy, Kenya, Latvia, Lithuania, Montenegro, the Netherlands, New Zealand, North Macedonia, Poland, Republic of Korea, Romania, the UK and the US issued the joint statement.\nIt continued: 'The 30-plus attacks that the Houthis have launched on commercial and naval vessels since mid-November constitute a threat to all countries that rely on international maritime shipping.\nRoyal Air Force Typhoon aircraft have conducted precision strike operations against Houthi military targets in response to further attacks on shipping in the Red Sea\nA fighter jet takes off from the USS Dwight D Eisenhower on January 12 as the US launches airstrikes against Houthi targets\nAn RAF Typhoon aircraft sits in a hanger after returning from a raid in Houthi-controlled Yemen on January 12\n'We condemn these attacks, and demand an end to them. We also underscore that those who supply the Houthis with the weapons to conduct these attacks are violating UN Security Council Resolution 2216 and international law.\n'The January 22 international response to the continuing Houthi attacks demonstrated shared resolve to uphold navigational rights and freedoms, and to defend the lives of mariners from illegal and unjustifiable attacks.'\nYesterday, warship and submarine-launched Tomahawk missiles, as well as fighter jets, were used to take out Houthi missile storage sites and launchers, according to US defence officials, who spoke on the condition of anonymity.\nREAD MORE HERE: Royal Navy missiles used to shoot down Houthi drones in Red Sea will become even more deadly thanks to £405m upgrade, Ministry of Defence reveals Advertisement\nThe Ministry of Defence said four Typhoon fighter jets, supported by a pair of Voyager refuelling tankers, flew from Cyprus to join US forces in the airstrikes.\nBefore the second round of strikes, Prime Minister Rishi Sunak and US president Joe Biden held a phone call in which they agreed to continue efforts to 'deter and disrupt' ongoing attacks by the Houthis on commercial and military vessels.\nThe two premiers also talked about efforts to secure the release of hostages held by Hamas in Gaza during their conversation.\nThe joint US and UK operation was supported by Australia, Bahrain, Canada, and the Netherlands.\nThe coalition said that 'precision strikes' directed by the UK and US governments 'are intended to disrupt and degrade the capabilities that the Houthis use to threaten global trade and the lives of innocent mariners'.\nThey added that they were 'in response to a series of illegal, dangerous, and destabilising Houthi actions since our coalition strikes on January 11,' when US and UK warships and jets hit more than 60 targets in 28 locations.\nFootage shows flames erupting amid a major bombardment of Yemen by UK and US forces on January 11\nRAF Armourers (Weapon Technicians) preparing a Royal Air Force Typhoon FGR4\nOne of the images the MOD released of a Royal Air Force Typhoon FGR4, the aircraft used in the second round of strikes\nF-18 fighter jets took off from the USS Dwight D. Eisenhower aircraft carrier\nUS Central Command released pictures of jets taking off for the mission over Yemen last night\nThat was the first US military response to what has been a persistent campaign of Houthi drone and missile attacks on commercial ships since the start of the Israel-Hamas war in October.\nIn recent days, the US launched seven rounds of airstrikes on Houthi military sites, targeting air bases under the rebels' control and suspected missile launch sites.\nBoth the Prime Minister and Defence Secretary Grant Shapps had repeatedly declined to comment on, or rule out, the possibility of further military action if Houthi attacks continued.\nBut Mr Sunak had told MPs last week he was 'prepared to back our words with actions'.\nThe Government has insisted that the strikes would not escalate the already tense situation in the Middle East, stressing the need to protect the vital shipping route.\nToday, the US also carried out strikes in Iraq against three facilities linked to Iran-backed militia, the Pentagon said, after a weekend attack on an Iraqi air base that wounded U.S. forces.\nU.S. troops in Iraq and Syria have been attacked about 150 times by Iran-aligned militants since the Israel-Gaza war started in October, creating pressure on President Joe Biden to respond militarily, despite political sensitivities in Baghdad.\nA tribal supporter of Houthi rebels holds a gun during an armed protest against the US in Sanaa on Monday\nHouthi supporters hold their weapons aloft during a demonstration against the US designating the militia a terror group on Monday\nSupporters of the Houthis carry rocket launchers, machine guns and ammunition at a rally against the UK and US in Sanaa on Monday\nOn Saturday, four U.S. personnel suffered traumatic brain injuries after Iraq's Ain al-Asad air base was hit by multiple ballistic missiles and rockets fired by Iranian-backed militants from inside Iraq.\n'U.S. military forces conducted necessary and proportionate strikes on three facilities used by the Iranian-backed Kataib Hezbollah militia group and other Iran-affiliated groups in Iraq,' U.S. Defense Secretary Lloyd Austin said in a statement.\n'These precision strikes are in direct response to a series of escalatory attacks against U.S. and Coalition personnel in Iraq and Syria by Iranian-sponsored militias,' Austin added.\nU.S. Central Command, which carries out operations in the Middle East, said the strikes targeted Kataib Hezbollah 'headquarters, storage, and training locations for rocket, missile' and drone capabilities.\nIn Iraq, a medical source and a militant source said the U.S. strikes killed at least two militants and that four other people were wounded.\nThe attacks against the United States are seen as retaliation for its support of Israel in its war against Iran-backed Palestinian militant group Hamas. The war in Gaza has been spreading, with U.S. forces hitting Houthi targets who have launched attacks on ships in the Red Sea.\nThe U.S. has 900 troops in Syria and 2,500 in Iraq, advising and assisting local forces to prevent a resurgence of Islamic State, which in 2014 seized large parts of both countries before being defeated.\nIraqi Prime Minister Mohammed Shia al-Sudani's office announced moves to evict U.S. forces following a U.S. drone strike in Baghdad earlier this month that was condemned by the government. The Pentagon said that strike killed a militia leader responsible for recent attacks on U.S. personnel.\nSudani has limited control over some Iran-backed factions, whose support he needed to win power a year ago and who now form a powerful bloc in his governing coalition.\nThe Pentagon has said it has not been formally notified of any plans to end the U.S. troop presence in the country, and says its troops are deployed to Iraq at the invitation of the government in Baghdad.\nFollowing the U.S. strike, Abo Alaa al-Walai, a militia commander sanctioned by the U.S. last year for involvement in attacks on U.S. forces, said Iran-backed Iraqi militias operating under the banner of the Islamic Resistance in Iraq should expand operations by 'enforcing a blockade on Zionist maritime navigation in the Mediterranean Sea.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "British and US troops strikes against Houthi targets in Yemen were retaliation for 'illegal and reckless' attacks on Red Sea ships", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12998527/Britain-carry-round-airstrikes-Houthi-rebel-targets-Yemen.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}