{"authors": ["David Alexander"], "date_download": "2024-02-05 15:37:59", "date_modify": "None", "date_publish": "2022-09-23 00:00:00", "description": "Also from the Front Page newsletter: Sacha Baron Cohen attacks TikTok for fostering anti-Semitism. Sign up below.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2023%2F11%2F17%2Ffriday-evening-news-briefing-hamas-military-system-israel%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/news/2022/09/23/TELEMMGLPICT000310354963_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Good evening.\nThe IDF has praised its forces for approaching military work in northern Gaza “successfully”.\nMeanwhile, Sacha Baron Cohen has attacked TikTok for fostering abuse against Jewish people.\nIDF ‘close to dismantling military system’ in northern Gaza\nIsrael’s military says it is close to “dismantling the military system” set up by Hamas in northern Gaza.\nHerzi Halevi, the Israeli Defense Forces (IDF) chief of general staff, told forces in the enclave there “remains work to be completed” but praised them for “approaching it successfully.”\nSacha Baron Cohen accuses TikTok of ‘creating biggest anti-Semitic movement since Nazis’\nSacha Baron Cohen, the actor, has accused TikTok of “creating the biggest anti-Semitic movement since the Nazis” as the video app battles allegations it is fostering a flood of abuse against Jewish people.\nBaron Cohen said TikTok was feeding images to young users encouraging hate, telling TikTok executives: “Shame on you.”\nNo 10 won’t rule out MPs working over Christmas on Sunak’s Rwanda laws\nDowning Street has not ruled out the prospect of MPs working over the Christmas period to get Rishi Sunak’s emergency Rwanda legislation through Parliament.\nThe House of Commons is scheduled to rise for its Christmas break on December 19, with MPs due to return to work on January 8. But No 10 said it was “prepared to do whatever is necessary to ensure that we can get this in place and get flights off the ground”.\nEvening Briefing: Today’s essential headlines\nDavid Cameron | The former prime minDavid Cameron will now be known as Lord Cameron of Chipping Norton after he selected the Cotswolds town for his territorial designation.\nBattle Lines Podcast | Israel hunts for Hamas while Gaza’s hospitals collapse\nIn this episode of Battle Lines, Senior Foreign Correspondent Sophia Yan analyses some of the diplomatic moves made by Middle Eastern states close to the conflict. Telegraph Global Health Reporter Lilia Sebouai updates us on the conditions In Gaza’s hospitals, and Foreign Reporter Verity Bowman talks us through the Israeli assault on the Al-Shifa hospital.\nReaders’ View: ‘C\nome the general election, millions of natural Conservatives will not bother to vote’\nEarlier this week, we asked Front Page readers for their views on David Cameron’s appointment as Foreign Secretary. Thanks to everyone who responded. Read the best of the debate from readers.\nComment and analysis\nWorld news: Controversial project in Vietnam threatens paradise of popular tourist destination Ha Long Bay\nPictures of construction have provoked green concerns for the aquamarine waters of a Unesco World Heritage site.\nBusiness news: Barclay family bid to regain control of The Telegraph with Gulf cash\nThe Barclay family have made an offer to repay in full a £1.2bn debt to Lloyds Banking Group and reassume control of The Telegraph in a potential deal bac\nked by Manchester City owner Sheikh Mansour bin Zayed.\nLive business news: Households dealing with ‘peak’ pain from interest rates, says Bank of England official\nEditor’s choice\nLife | The seven new types of old age – and how to tell which one you are\nFood | How to make your meat go further – delicious recipes which use up every morsel\nFashion | Why leather trousers are the most controversial style a man can wear\nSport briefing: Today’s essential headlines\nSign up to our free Sport Brie\nfing Newsletter to receive the latest sporting news, direct to your inbox every weekday morning.\nThree things for you", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Friday evening news briefing: Hamas military system nearly dismantled in northern Gaza, says Israel", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/news/2023/11/17/friday-evening-news-briefing-hamas-military-system-israel/"}