{"authors": ["Helen Sullivan", "Léonie Chao-Fong", "Mabel Banfield-Nwachi", "Helen Livingstone"], "date_download": "2024-02-05 15:38:01", "date_modify": "None", "date_publish": "2023-11-17 01:29:52", "description": "This blog is now closed. Read our recent coverage at the link below:", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F16%2Fisrael-hamas-war-live-updates-biden-ceasefire-israel-criticises-un-humanitarian-pauses.json", "image_url": "https://i.guim.co.uk/img/media/c92ae32c58b0999adfe7ae5939ad0844ea727e16/0_337_4000_2401/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=b3c6d793c15c81ce737c84bf414bf1be", "language": "en", "localpath": null, "maintext": "From 16 Nov 2023 22.56 CET World Food Programme warns civilians in Gaza 'face immediate possibility of starvation' The UN World Food Programme (WFP) has warned that the Gaza Strip now faces a “massive” food gap and widespread hunger while nearly the entire population of the Palestinian enclave is in “desperate” need of food assistance. In a statement on Thursday, WFP executive director Cindy McCain said food and water supplies are “practically non-existent” in Gaza, and “only a fraction” of aid that is needed is reaching the territory through the borders. She said: With winter fast approaching, unsafe and overcrowded shelters, and the lack of clean water, civilians are facing the immediate possibility of starvation. There is no way to meet current hunger needs with one operational border crossing. The only hope is opening another, safe passage for humanitarian access to bring life-saving food into Gaza. Earlier this week, WFP confirmed the closure of the final bakery operating in partnership with the agency due to lack of fuel. Bread, a staple food for people in Gaza, is scarce or non-existent, it said. The shortage of fuel is also crippling humanitarian distribution and operations, including the delivery of food assistance, it said. The UN agency for Palestinian refugees (UNRWA) has said there will be no aid deliveries into Gaza from the Rafah crossing from tomorrow because of fuel shortages.\nUpdated at 00.06 CET\n17 Nov 2023 02.29 CET This blog is closing. Our live coverage will resume in a few hours’ time. In the meantime, you can find all of our coverage of the Israel-Hamas war here.\n17 Nov 2023 01.51 CET Israeli Prime Minister Benjamin Netanyahu has described Israel’s attempts to minimise casualties in Gaza as “not successful”.\nNetanyahu was asked by US television’s CBS News whether Israel’s killing of thousands of Palestinians as it retaliates for the 7 October attack by Gaza’s ruling Hamas militants would fuel a new generation of hatred.\n“Any civilian death is a tragedy. And we shouldn’t have any because we’re doing everything we can to get the civilians out of harm’s way, while Hamas is doing everything to keep them in harm’s way,” Netanyahu said.\n“So we send leaflets, (we) call them on their cell phones, and we say: ‘leave’. And many have left,” Netanyahu said.\nIsrael has said the goal of its military campaign is to destroy Hamas.\n“The other thing that I can say is that we’ll try to finish that job with minimal civilian casualties. That’s what we’re trying to do: minimal civilian casualties. But unfortunately, we’re not successful.” At least 11,470 Palestinians have been killed in the Gaza Strip since the Israel-Hamas war broke out six weeks ago, according to figures by the Palestinian health authorities. The ministry said 4,707 of the dead were children and minors and that 3,155 were women. The vast majority are civilians killed in Israeli airstrikes.\nUpdated at 02.33 CET\n17 Nov 2023 01.35 CET Syrian state media reports that Syrian forces have shot down Israeli missiles fired from the Golan heights towards the outskirts of Damascus. The Guardian has not verified this independently. We’ll have more on this as it emerges.\n17 Nov 2023 01.16 CET Jem Bartholomew More now on the protests outside the offices of Labour’s MP for Bethnal Green and Bow, Rushanara Ali after she did not back a Gaza ceasefire vote in parliament. About 200 people protested at Ali’s office and some of those present said she had missed an opportunity to use her voice to condemn the violence from Israel – and said they felt resentment that she had chosen to remain on the Labour frontbench rather than signal what she believed. Ali said on social media she had “long supported a ceasefire”, but explained she was abstaining from the vote because “the reality is that this motion does not secure a ceasefire and would not lead towards one”. Eight Labour frontbenchers, including Jess Phillips, defied Starmer’s whip to back the ceasefire amendment. But the reasoning for Ali, and others who decided to abstain, was that they have more influence over Labour’s position – and, ultimately, on the international stage with Israel – if they made the case for a stop to the conflict from within the party’s top team. Ali added: “Leaving the shadow government is something I am always willing to do, which is why I completely respect the decision taken by fellow MPs today. The moment I think my presence is less positively impactful than my absence, I will do so.” Protesters gather outside Labour MP’s London office after Gaza vote Read more\n16 Nov 2023 00.45 CET If you’re just joining us, here is where things stand: Internet and telephone services collapsed across the Gaza Strip on Thursday for lack of fuel, the main Palestinian provider said, bringing a potentially long-term blackout of communications as Israel signaled its offensive against Hamas could next target the south, where most of the population has taken refuge. Israeli troops for a second day searched Shifa Hospital in the north for traces of Hamas. They displayed what they said were a tunnel entrance and weapons found in a truck inside the compound. But the military has yet to release evidence of a central Hamas command centre that Israel has said is concealed beneath the complex. Hamas and staff at the hospital, Gaza’s largest, deny the allegations. View image in fullscreen A girl who fled with her family members from the Israeli bombardment of the northern Gaza Strip, hugs an older woman as they sit outside a makeshift shelter after overnight rainstorms in Khan Yunis in the southern Gaza Strip on 15 November 2023. Photograph: Mahmud Hams/AFP/Getty Images The military said it found the body of one of the hostages abducted by Hamas, 65-year-old Yehudit Weiss, in a building adjacent to Shifa, where it said it also found assault rifles and rocket-propelled grenades. It did not give the cause of her death. The communications breakdown largely cuts off Gaza’s 2.3 million people from each other and the outside world, worsening the severe humanitarian crisis in southern Gaza, even as Israeli airstrikes continue there. The UN’s World Food Program warned of “the immediate possibility of starvation” in Gaza as the food supply has broken down under Israel’s seal and too little is coming from Egypt.v\n16 Nov 2023 00.29 CET US Secretary of State Antony Blinken has also spoken with Israeli war cabinet Minister Benny Gantz and discussed efforts to boost and accelerate the transit of critical humanitarian assistance into Gaza, the State Department said on Thursday.\nThe two men discussed efforts to prevent the conflict widening and to secure the release of hostages. Blinken also stressed the urgent need for affirmative steps to de-escalate tensions in the West Bank, including by confronting rising levels of settler extremist violence, the department said in a statement.\n16 Nov 2023 00.21 CET Jem Bartholomew Crowds gathered outside the constituency office of Labour’s MP for Bethnal Green and Bow, Rushanara Ali, on Thursday, chanting “vote her out” and “Labour party shame on you” after she did not back a Gaza ceasefire vote in parliament. There were protests elsewhere against Labour MPs who backed Keir Starmer in the vote on the Israel-Hamas conflict. Some constituents were angry that Ali, a shadow business minister, did not back an amendment to the king’s speech brought by the SNP calling for a ceasefire. Protesters gather outside Labour MP’s London office after Gaza vote Read more\n16 Nov 2023 00.12 CET US Secretary of State Antony Blinken spoke with his Egyptian counterpart Sameh Shoukry about efforts to increase humanitarian aid to Palestinians in urgent need, the State Department said on Thursday.\nBlinken reaffirmed the importance of concrete steps to minimise harm to Palestinian civilians in all of Gaza, the State Department said, and reaffirmed Washington’s rejection of the forced displacement of Palestinians, the department said in a statement. This is Helen Sullivan taking over the Guardian’s live coverage of the Israel-Hamas war.\n16 Nov 2023 23.47 CET A press freedom group has said it is “highly alarmed” by widespread reports of a communications blackout in Gaza due to a fuel shortage. The complete shutdown of communications services throughout the Gaza Strip poses “an extreme risk” to the lives of journalists reporting in Gaza, the Committee to Protect Journalists (CPJ) said. A statement from Sherif Mansour, CPJ’s Middle East and North Africa programme coordinator, reads: By withholding fuel from Gaza, the Israeli government is preventing journalists in Gaza from providing the world with updates on the war, leaving the international community vulnerable to deadly propaganda, disinformation, and misinformation. The Israeli and Egyptian governments must immediately allow fuel into the Gaza Strip as part of the essential humanitarian assistance needed in the region.\n16 Nov 2023 23.34 CET Death toll in Gaza rises to 11,470, including 4,707 children – health ministry At least 11,470 Palestinians have been killed in the Gaza Strip since the Israel-Hamas war broke out six weeks ago, according to figures by the Palestinian health authorities. The ministry said 4,707 of the dead were children and minors and that 3,155 were women. The vast majority have been killed in Israeli airstrikes. In recent days, the Palestinian health ministry in the West Bank has started updating the Gaza death toll, Associated Press reported. Until last week, the health ministry in Gaza was the main official source for the death toll in the Palestinian enclave, but it stopped publishing updates after key ministry officials based in Gaza City’s al-Shifa hospital lost electricity and connectivity. View image in fullscreen A Palestinian boy stands among the destruction after Israeli strikes on Rafah, Gaza Strip. Photograph: Hatem Ali/AP View image in fullscreen Young Palestinians injured in Israeli raids arrive at Nasser medical hospital in Khan Yunis, Gaza. Photograph: Ahmad Hasaballah/Getty Images\nUpdated at 02.02 CET\n16 Nov 2023 23.19 CET Robert Tait Protesters against Israel’s military offensive in Gaza were locked in a battle of words with Washington police on Thursday after accusing officers of violently breaking up a demonstration on Capitol Hill that organisers insist was peaceful. Leaders of the Ceasefire Now Coalition said 90 of their activists were injured in confrontations that took place after they staged a candlelit vigil outside the Democratic National Committee (DNC) headquarters on Wednesday evening. The coalition said volunteers were pepper-sprayed, kicked, pulled by the hair and dragged down flights of stairs by officers in riot gear, who they accused of ignoring long-standing protocols for non-violent protest by failing to issue dispersal notices or engage with the rally’s specially designated police liaison representative. But in a rebuttal, police said the group was “not peaceful” and said six officers had to be treated for injuries after being pepper-sprayed and punched. One 24-year-old protester was arrested for allegedly slamming an officer into a garage door and punching her in the face, police said in a statement. Organisers said the event – jointly staged by three leftist groups, Jewish Voice for Peace, If Not Now and the Democratic Socialists of America – followed the traditions of non-violence pioneered by the US civil rights movement. But Wednesday’s clashes was one of the most graphic signs yet of the dissension arising from Israel’s military response to last month’s attack by Hamas.\nUpdated at 02.01 CET\n16 Nov 2023 23.15 CET Israeli forces 'advancing to next stage' of war in Gaza, says defence minister Israel’s defensce minister, Yoav Gallant, has announced a “next stage” of the offensive in Gaza during a situational assessment on Thursday. “I arrived today at the headquarters of the division whose special forces also operate inside the Shifa hospital,” i24NEWS reported Gallant saying alongside the Israel Defense Forces (IDF) deputy chief of staff and other senior officers. “There are significant findings. We are working with precision and determination.” His comments came as the Israeli military said it uncovered a Hamas tunnel shaft and a vehicle with weapons at Gaza’s al-Shifa hospital complex. It made videos and photographs of the tunnel shaft and weapons public, but no independent verification was possible. Gallant continued: We have completed taking over and clearing the western part of Gaza City and are now advancing to the next stage of the offensive. He said Israeli forces are working “precisely, determinedly, decisively” and coordinating air, sea and land forces, accompanied by “very strong and encompassing intelligence”. Earlier on Thursday, Israel dropped leaflets into southern Gaza telling Palestinian civilians to leave four towns on the eastern edge of Khan Younis, raising fears that its war against Hamas could spread to areas it previously said were safe. Map\nUpdated at 01.38 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza civilians ‘face immediate possibility of starvation’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/16/israel-hamas-war-live-updates-biden-ceasefire-israel-criticises-un-humanitarian-pauses"}