{"authors": [], "date_download": "2024-02-05 15:38:03", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Despite the steadily mounting death toll in Gaza, western politicians are still calling for a “humanitarian pause” in Israel’s assault on", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274032664%2Ftheres-nothing-humanitarian-about-a-humanitarian-pause-in-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/cvr1699972740.jpg", "language": "en", "localpath": null, "maintext": "Despite the steadily mounting death toll in Gaza, western politicians are still calling for a \"humanitarian pause\" in Israel's assault on Gaza. \"Humanitarian\" is defined as \"seeking to promote human welfare as a primary or pre-eminent good\" - but, in Gaza's case, a \"humanitarian pause\" in the war in Gaza will have little effect when it comes to promoting human welfare.\nAs Malak Benslama-Dabdoub, a lecturer in law at Royal Holloway university, has recently pointed out, there is \"an important difference between a humanitarian pause and a ceasefire\". A pause is a short-term, localised break in the fighting to allow humanitarian assistance to get through to civilians before fighting starts again. A ceasefire, meanwhile, is part of a political process which would hopefully lead to a permanent end to the fighting.\nThis is true, but the differences run much deeper and are much more problematic. The argument put forth by the UK's prime minister, Rishi Sunak, as well as the Labour leader Keir Starmer and others, for a pause rather than a ceasefire is that a ceasefire would allow Hamas to regroup and get stronger while the fighting stopped.\nThe French president Emmanuel Macron, meanwhile, has called for a ceasefire in Gaza and said that there is no justification for bombing civilians in Gaza.\nIndiscriminate kiling\nThe effect of a ceasefire would be to stop Israel's constant bombing and other assaults on the people of Gaza. This would undermine the Israeli government's goal of eradicating Hamas and taking complete control of Gaza.\nWhile the attack by Hamas was horrific, there are limits - both legal and moral - to what Israel can do in response. Those limits have been breached.\nIsrael has been the de facto occupier of Gaza because it has control of all of Gaza's land borders except the Rafah crossing to Egypt. This includes controlling Gaza's access to the Mediterranean and its air space.\nIsraeli prime minister Benjamin Netanyahu's vision would extend this to taking complete control of all security in Gaza, which would necessarily entail an Israeli military presence in Gaza.\nRead more: Israel-Hamas conflict: what Gaza might look like 'the day after' the war\nFailure to call for a ceasefire gives implicit consent for this approach, which could lead to increased radicalisation and violence.\nYet, rejecting calls for a ceasefire also provides implicit consent for other, longer-term goals of the Israelis. Plans have been developed by both the Israeli intelligence ministry and the Misgav Institute for National Security & Zionist Strategy, a think tank with close ties to the Israeli government, to rid Gaza of all Palestinians by pushing them into Egypt. This should be described, at the very least, as ethnic cleansing.\nNetanyahu has previously talked about \"clear[ing] the West Bank\" while recently citing a biblical injunction from the first Book of Samuel, in which God commands King Saul to kill every person in Amalek, a rival nation to ancient Israel. Critics say that this reference \"has long been used by the far right to justify killing Palestinians\". Some have interpreted it as justifying genocide.\nIsrael's president, Isaac Herzog, has said there are no innocent civilians in Gaza, an assertion which erases the distinction between combatants and non-combatants. This effectively justifies collective punishment, which is prohibited under the Geneva conventions.\nIsrael's bombardment of Gaza and the resulting deaths of more than 11,000 people, including 4,500 children, should be a matter for investigation by the International Criminal Court as a possible war crime, as should the attacks by Hamas.\nRead more: Why Palestine joining the International Criminal Court could be a total game changer\nWaiting to die\nThis is why calling for a \"humanitarian pause\" is not really a humanitarian act. As I have noted elsewhere humanitarianism - the provision of food, water, and medical care to those affected by war - frequently amounts to little more than what is know in the medical world as \"palliation\". This is when medical care is oriented towards making the patient as \"comfortable as possible for the time they have left\".\nI have further argued:\nSuch is the case in Gaza. There is quite literally no escape for the people of Gaza. They are at the complete mercy of the Israeli military. While Israel has told people to leave northern Gaza and go to the south, this has not led to safety.\nIsrael still bombs southern Gaza. Men, women, and children are still killed there. Israel has bombed hospitals and rendered them unoperational.\nIt seems clear that Israel has imposed few meaningful restraints on its military that would keep civilians in Gaza safe. As one Israel Defense Forces spokesperson said as Israel's bombardment of Gaza got underway on October 10: \"the emphasis is on damage and not on accuracy\".\nThe people of Gaza are just waiting to die from Israeli bombs and mortars and bullets. A humanitarian pause which allowed in food and water would do little more than create \"well-fed dead\". They would be kept alive a while longer, but many more of them will die at the hands of the Israeli military.\nIsrael has begun to put in place four-hour \"humanitarian pauses\" in fighting in northern Gaza. This will hardly slow the march toward death for those trapped in Gaza. As one observer noted: \"Israeli forces will spend 20 hours a day murdering Gazans. Not 24.\"\nCalls for a humanitarian pause in Gaza are not \"seeking to promote human welfare as a primary or pre-eminent good\". Rather, they ignore Israel's massacre of Gazans and thus undermine the supposed humanitarian outcome its advocates assert.\nAuthor: Kurt Mills - Visiting Scholar, Centre for Global Law and Governance, University of St Andrews", "source_domain": "www.britainnews.net", "text": null, "title": "There's nothing 'humanitarian' about a humanitarian pause in Gaza", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274032664/theres-nothing-humanitarian-about-a-humanitarian-pause-in-gaza"}