{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:38:07", "date_modify": "None", "date_publish": "2023-11-17 08:41:40", "description": "While most men aged 18-60 have been banned from leaving Ukraine, the BBC has revealed many are even prepared to swim across the border to join family, study or work elsewhere.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12761163%2F20-000-Ukrainian-men-fled-country-avoid-drafted-dozens-escaping-daily-swimming-rivers-avoid-going-war.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/17/08/77920277-0-image-a-15_1700210131479.jpg", "language": "en", "localpath": null, "maintext": "Nearly 20,000 men have fled Ukraine to avoid conscription since the beginning of the war last February, data shows.\nBetween February 2022 and August 2023, as many as 19,740 fled Ukraine illegally into Romania, Moldova, Poland, Hungary and Slovakia - with dozens continuing to leave daily.\nMore than 21,000 have also attempted to leave the country since Russia's brutal invasion but have been turned back by Ukrainian authorities, according to Kyiv.\nWhile most men aged 18-60 have been banned from leaving Ukraine, the BBC has revealed some are even prepared to swim across the border to join family, study or work elsewhere.\nOne, who fled across the Tisa River with a friend, said he left because there were no viable work opportunities in Ukraine, and claimed he was aware of others crossing with smugglers via social media platform Telegram.\nHe told the broadcaster that for £3,472, illegal outfits could draw up a medical exemption certificate, allowing Ukrainians to leave and come back as they pleased.\nFedir Venislavskyi, President Zelensky's parliamentary representative, said Ukraine was not overly concerned by people leaving, claiming 'those who try to avoid mobilisation are about 1-5%. They are definitely not critical to the defence of Ukraine.'\nBut he did suggest corrupt military medical commissions were becoming more lenient with exemptions, allowing thousands to get out of serving in the armed forces.\nA resident cleans up fallen leaves near her destroyed house on October 26 in Avdiivka, Ukraine\nA Ukrainian armoured vehicle rides on a road near the front line in Donetsk, November 16\nA Ukrainian serviceman guards his position in Mariupol, Ukraine, March 12, 2022\nIn Ukraine, there are exemptions from conscription given to men with health issues, caring responsibilities or with three or more children.\nBut Ukraine's President has warned that there has been a tenfold increase in exemptions since February last year, blaming corruption among medical military commissions.\nMr Venislavskyi told the BBC: 'The government realises that this phenomenon is not isolated and that it is widespread. But unfortunately, I would emphasise that corruption is very resilient.'\nHe added that the scale of people seeking to leave Ukraine was also not having an impact on the war.\n'I am convinced that the resilience and readiness of Ukrainians to defend their independence, sovereignty and freedom is 95-99%,' Mr Venislavskyi told the BBC.\nBut Ukraine has endured heavy losses in its steady war of attrition with Russia in recent months.\nIn August, the US estimated as many as 70,000 could have been killed - a significant proportion of the 800,000 reported to be in Ukraine's armed forces in September.\nNeither Russia nor Ukraine reports its number of casualties.\nUkraine is currently looking to break the deadlock by establishing a stable landing on the occupied side of the Dnipro river, enabling a stronger line of attack from the south.\nUkraine's Marine Corp said Friday that their forces had carried out a series of attacks on the Russian-occupied east bank near the southern city of Kherson.\nThe waterway is the de facto frontline in the south of the country, but Russia conceded for the first time this week that Ukrainian forces had claimed back some territory on the opposing bank.\n'The Defense Forces of Ukraine conducted a series of successful operations on the left bank of the Dnipro River, along the Kherson front,' the marines said in a statement on social media.\n'In cooperation with other units of the Defense Forces, managed to gain a foothold on several bridgeheads,' the statement added.\nA group of Ukrainian marines sail from the riverbank of Dnipro at the frontline near Kherson, Ukraine, Saturday, October 14, 2023\nUkrainian service members fire a mortar during an exercise in Kyiv region, November 8, 2023\nFirefighters work to put out fire at a house that was hit by shelling in the course of Russia-Ukraine conflict in Donetsk, Russian-controlled Ukraine, October 24, 2023\nRussian and Ukrainian forces have been entrenched on opposite sides of the Dnipro river since Moscow withdrew from the western part of Kherson region last November.\nThe Russian-installed official responsible for occupied Kherson this week conceded that some Ukrainian soldiers were 'blocked' in Krynky, a small village on the Dnipro's eastern bank of the Dnipro river, and were facing a 'fiery hell' from Russian artillery, rockets and drones.\nVlad Şutea, founder and lead analyst at early warning and threatcasting group T-Intelligence, told MailOnline that Ukraine is likely reassessing its intentions in the Dnipro area of operations after the end of its spring counteroffensive.\nIn the past, he said, the aim was to stretch out Russian forces before opening a line of attack in Zaporizhzhia.\nNow, it is likely Ukraine is looking to exploit a manpower gap in the south as Russia moves troops to fuel offensives in Avdivka, near Donetsk city, and Kupyansk, in the northeast.\n'The Russian forces on the left bank of Kherson are also probably the worst-supplied forces throughout the entire frontline.\n'They're the farthest away from the south Ukraine land bridge. And Ukraine has been hammering the Russian supply lines and logistics passing through Crimea with Storm Shadow cruise missiles for the past 4 months.'\nMr Şutea said that Ukraine's landings were 'promising' but that it was too early to call them a major success.\n'It's critical for Ukraine to widen its foothold and actually transform into a bridgehead that could sustain a downpour of equipment and forces into the left bank.\n'The Russians are responding, so we will have to watch how it unfolds. If we hear that \"they are retreating to better positions,\" we will know that Ukraine is gaining momentum.'\nThe challenge for Ukraine is to supply troops without ground lines of communication. 'Everything needs to go by boat - small boards to disperse and evade detection,' said Mr Şutea today.\n'The same issue goes for reinforcement and expansion, as equipment needs to be hauled across the Dnipro. The swamp certainly does not help and makes maneuver even more difficult.'\nRussia will likely continue to try to knock Ukrainian forces off balance as they look to insert themselves in occupied territory with regular crossings.\n'The Russians are defending for prepared positions while the Ukrainians are vulnerable during the crossing. Therefore, Ukraine cannot conduct a major operation across the Dnipro and must rely on small unit infiltrations, like what we are seeing, which are high-risk but high-payoff gambles.\n'Ukraine is definitely speculating well on Kherson. If Ukraine keeps poking holes in Russia's Dnipro defenses, they might eventually crack...'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "20,000 Ukrainian men have fled the country to avoid being drafted, with dozens escaping daily - even swimming across rivers to avoid going to war", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12761163/20-000-Ukrainian-men-fled-country-avoid-drafted-dozens-escaping-daily-swimming-rivers-avoid-going-war.html?ns_mchannel=rssns_campaign=1490ito=1490"}