{"authors": [], "date_download": "2024-02-05 15:16:13", "date_modify": "None", "date_publish": "2024-01-23 03:14:58", "description": null, "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fus-britain-launch-new-joint-strikes-yemens-huthis-1722915.json", "image_url": "https://d.ibtimes.co.uk/en/full/1722527/huthi-fighters-brandish-weapons-they-rally-during-anti-israel-anti-us-rally-yemens.jpg", "language": "en", "localpath": null, "maintext": "The United States and Britain launched new strikes on Yemen's Huthis Monday, saying their second round of joint military action against the Iran-backed rebels was in response to continued attacks on Red Sea shipping.\nAmerican and British forces carried out a first wave of strikes against the rebel group earlier this month, and the United States launched further air raids against missiles that Washington said posed imminent threats to both civilian and military vessels.\nBut the Huthis have vowed to continue their attacks -- just one part of a growing crisis in the Middle East linked to the Israel-Hamas war, which has raised tensions across the region as well as fears of a broader war directly involving Iran.\nThe latest US-UK strikes were against \"eight Huthi targets in Yemen in response to the Huthis' continued attacks against international and commercial shipping as well as naval vessels transiting the Red Sea,\" Washington and London said in a joint statement with other countries that supported the military action.\n\"These precision strikes are intended to disrupt and degrade the capabilities that the Huthis use to threaten global trade and the lives of innocent mariners,\" the statement said.\nThe US Central Command said in a separate statement that the targets of the strikes \"included missile systems and launchers, air defense systems, radars, and deeply buried weapons storage facilities.\"\nA senior US military official said the strikes were carried out using a combination of precision-guided munitions from American and British aircraft, and Tomahawk cruise missiles.\nThere were no concerns about civilian casualties at the sites that were hit, while Huthi losses are unknown at this time, the official told journalists.\n\"The targeting was very specific and ... very deliberate to go after the capability that they are using to attack maritime vessels in the Red Sea, Bab al-Mandab and Gulf of Aden. They were they were not intentionally selected for casualties -- they were going after weapons systems,\" the official added.\nYemen's official Saba news agency said strikes hit the capital Sanaa and several other parts of the country, while Huthi TV outlet Al-Masirah said four strikes targeted the Al-Dailami military base north of the capital, which is under rebel control.\nEarlier on Monday, Huthis claimed they fired on a US military cargo ship off the coast of Yemen, with their spokesman Yahya Saree saying they \"led a military operation targeting the American military cargo ship Ocean Jazz in the Gulf of Aden,\" near the Red Sea, with missiles.\nAsked about the claim, a US defense official told AFP: \"We're not seeing that at all on our end and believe that statement to be untrue.\"\nThe Yemeni rebels began striking Red Sea shipping in November, saying they were hitting Israeli-linked vessels in support of Palestinians in Gaza, which has been ravaged by the Hamas-Israel war.\nThe Huthis have since declared American and British interests to be legitimate targets as well.\nIn addition to military action, Washington is seeking to put diplomatic and financial pressure on the Huthis, re-designating them as a \"terrorist\" entity last week after dropping that label soon after President Joe Biden took office.\nThe rebels reiterated on Monday that they will \"respond to any attack\" on Yemen and continue to \"prevent Israeli ships\" from crossing the Red Sea and Gulf of Aden until the end of the war in Gaza.\nThe latest round of the Israel-Hamas conflict began after an unprecedented October attack by the Palestinian militant group that resulted in the deaths of about 1,140 people in Israel, mostly civilians, according to an AFP tally based on official Israeli figures.\nIsrael responded with relentless bombardment and a ground offensive that has killed at least 25,295 people, around 70 percent of them women, children and adolescents, according to the Gaza health ministry.\nThose deaths have sparked widespread anger across the region and stoked violence involving Iran-backed groups in Lebanon, Iraq, Syria and Yemen.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "US, Britain Launch New Joint Strikes On Yemen's Huthis", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/us-britain-launch-new-joint-strikes-yemens-huthis-1722915"}