{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:38:13", "date_modify": "None", "date_publish": "2023-11-17 18:33:00", "description": "Footage to date fails to prove Gaza complex was nerve centre for attacks on Israel, as military had claimed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F17%2Fidf-evidence-so-far-falls-well-short-of-al-shifa-hospital-being-hamas-hq.json", "image_url": "https://i.guim.co.uk/img/media/5f9afd349f4f090f5fb7ff4e4f19f69cfe62936d/266_0_4591_2756/master/4591.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=368ee0dd2e14a59923a8ffe94893a191", "language": "en", "localpath": null, "maintext": "Prior to their capture of Dar al-Shifa hospital, the Israel Defense Forces went to great lengths to depict the medical complex as a headquarters for Hamas, from where its attacks on Israel were planned.\nThe evidence produced so far falls well short of that. IDF videos have shown only modest collections of small arms, mostly assault rifles, recovered from the extensive medical complex.\nThat suggests an armed presence, but not the sort of elaborate nerve centre depicted in animated graphics presented to the media before al-Shifa was seized, portraying a network of well-equipped subterranean chambers.\nEven the videos produced so far have raised questions under scrutiny. A BBC analysis found the footage of an IDF spokesperson showing the apparent discovery of a bag containing a gun behind an MRI scanning machine, had been taped hours before the arrival of the journalists to whom he was supposedly showing it.\nIn a video shown later, the number of guns in the bag had doubled. The IDF claimed its video of what it found at the hospital was unedited, filmed in a single take, but the BBC analysis found it had been edited.\nIsraeli forces say they are still carefully exploring the site. The video presentation of al-Shifa did show the main facilities lay deep underground, and it is quite possible the Israeli soldiers have not reached them yet, so there could be much more to come. But the attempt to present what has been found so far as significant is bound to fuel scepticism about whatever is presented later.\nThere are questions over how much of its graphic presentation of the network under al-Shifa was based on what Israel knew already; its own architect had built an extensive basement area there the last time Israel directly occupied Gaza, up to 2005.\nAll of this is significant under the Geneva conventions, which forbid military operations against hospitals unless “they are used to commit, outside their humanitarian duties, acts harmful to the enemy”. This exception, spelled out in article 19 of the fourth Geneva convention, states specifically: “… the presence of small arms and ammunition taken from such combatants and not yet handed to the proper service, shall not be considered to be acts harmful to the enemy”.\n00:00:34 Israeli military says it has found Hamas tunnel shaft in hospital – video\nIsrael ratified the Geneva conventions in 1951 and claims to observe the principle of proportionality under international humanitarian law, in which the direct military advantage anticipated from a military operation outweighs the civilian harm that can reasonably be anticipated as a consequence. Its observance of those principles is what is in question.\n“Israel has failed to provide anywhere even close to the level of evidence required to justify the narrow exception under which hospitals can be targeted under the laws of war,” said Mai El-Sadany, a human rights lawyer and the executive director of the Tahrir Institute for Middle East Policy, in Washington.\n“In the rare case that protection is lifted, Israel would have to provide civilians with a meaningful chance to evacuate and even still, any civilians who remain in the hospital following an evacuation order would still be protected by the rules of proportionality,” El-Sadany added. “At every stage of this legal assessment, Israel has fallen abysmally short. It has provided photo and video footage that is far from commensurate with its initial claims.”\nAt some point, these issues could be submitted to formal judgment. Israel does not recognise the international criminal court, but the court recognises Palestine as a member, and has been conducting an investigation into possible war crimes and crimes against humanity in the occupied Palestinian territories since 2021.\nAny such judgment would be years away. More immediately and directly, the details of the Shifa raid have an impact on the international climate in which Israel is conducting its war. Countries such as the UK, Germany and most importantly, the US, have resisted calls for a ceasefire on the grounds that Israel’s actions constitute legitimate self-defence. Every day without convincing evidence from the raid makes that argument harder to pursue.\nThe Biden administration has not only defended Israel’s operations but presented independent claims based on its own intelligence about the hospital. John Kirby, the White House national security spokesperson, framed the alleged Hamas facility there as a command “node” rather than a centre, and a possible weapons store.\nThe absence of evidence so far, is beginning to recall past US intelligence failures, most dramatically those preceding the Iraq invasion. It further isolates Washington on the world stage, and deepens already significant rifts within the administration itself.", "source_domain": "www.theguardian.com", "text": null, "title": "IDF evidence so far falls well short of al-Shifa hospital being Hamas HQ", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/17/idf-evidence-so-far-falls-well-short-of-al-shifa-hospital-being-hamas-hq"}