{"authors": ["Susie Beever", "Image", "Ap", "Idf"], "date_download": "2024-02-05 15:38:14", "date_modify": "None", "date_publish": "2023-11-17 07:21:57", "description": "Israeli Defence Forces swooped on Gaza Citys al-Shifa hospital on Wednesday where patients have run out of oxygen and water, with troops claiming they had found Hamas weapons and a tunnel", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fisrael-shows-weapons-haul-claims-31460598.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31460606.ece/ALTERNATES/s1200/0_Israel-Palestinians-23319817941577.jpg", "language": "en", "localpath": null, "maintext": "Israeli Defence Forces swooped on Gaza Citys al-Shifa hospital on Wednesday where patients have run out of oxygen and water, with troops claiming they had found Hamas weapons and a tunnel\nIsrael's military says it has recovered an arsenal of weapons inside a vehicle at Gaza’s al-Shifa hospital complex.\nThe Israeli Defence Forces (IDF) also claims troops discovered a Hamas tunnel shaft at the site this week, as they shared images and video of the weapons haul. The images have currently not been verifiable, The Guardian and BBC report.\nIt comes after the bodies of two hostages were discovered, including that of a 19-year-old soldier Israeli Noa Marciano who the IDF said was found in a structure next to the hospital. Yehudit Weiss, a 65-year-old Israeli citizen taken from her home in Be'eri by Hamas militants on October 7, was also sadly discovered dead during the raid.\nImage: AP) AP)\nThe forces swooped on the Gaza City hospital on Wednesday. An IDF spokesperson said: “In the Shifa hospital, IDF [Israel Defense Forces] troops found an operational tunnel shaft and a vehicle containing a large number of weapons.” The hospital's director Muhammad Abu Salmiya said the hospital has already run out of oxygen and water. He said: \"Those in the hospital are screaming from thirst.\"\nEarlier this week, horrifying images were released as Gaza doctors at the hospital revealed they had resorted to swaddling newborn premature babies in tinfoil to try and keep them alive. The tiny infants had to be moved from incubators to another part of the hospital after al-Shifa ran out of oxygen.\nThe babies were being wrapped in foil and placed next to hot water to keep them warm Dr Salmiya said. The hospital's head of paediatrics, Dr Mohamed Tabasha, said \"I cannot say how long they can last\". He said: “I can lose another two babies today, or in an hour. I never expected in my life that I would put 39 babies side by side on a bed, each with a different disease, and in this acute shortage of medical staff, of milk.”\nImage: AP) AP)\nMeanwhile Israel dropped thousands of leaflets into southern Gaza on Thursday night, warning civilians to evacuate their homes and head to special shelters. The move signals a possible expansion of Israel's offensive to areas where hundreds of thousands of evacuees who heeded earlier orders are crowded into UN-run shelters and family homes.\nThe leaflets warned people to find safety in Bani Shuhaila, Khuzaa, Abas-san and Qarara - towns home to over 100,000 people, before the south was overwhelmed with displaced people. They read: \"For your safety, evacuate your places of residence immediately and head to known shelters. Anyone near terrorists or their facilities puts their life at risk. Every house used by terrorists will be targeted.\"\nImage: IDF) IDF)\nOperations in the south of the Strip have been widening, with air raids now a daily occurrence. So far, an estimated 11,200 Palestinians have been killed since Hamas carried out attacks near Israel's border, two-thirds of whom are reported to have been women and children. More than 1.5 million people have been internally displaced in Gaza, with most having fled to the south, where food, water and electricity are scarce.\nPhilippe Lazzarini, the commissioner general of the UN agency for Palestinian refugees, has said he believed there has been a deliberate attempt to \"strangle\" its work to support more than 800,000 displaced Palestinians. The UN agency has pleaded for weeks for access to fuel, he said.\nOn Wednesday Israel allowed a truck carrying 6,340 gallons of diesel fuel for UN aid trucks into Gaza for the first time in the war. UN human rights chief Volker Turk called for an \"international investigation\" after allegations of violations of international humanitarian law in the war.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel shows off weapons haul and claims Hamas tunnel discovery after Gaza hospital raid", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/israel-shows-weapons-haul-claims-31460598"}