{"authors": [], "date_download": "2024-02-05 15:38:16", "date_modify": "None", "date_publish": "2023-11-17 04:19:57", "description": "Rescuers in Gaza don’t have the equipment to search properly for the living, let alone the dead", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-hamas-families-israeli-b2448939.html.json", "image_url": "https://static.independent.co.uk/2023/11/17/04/Israel_Palestinians_Buried_In_Rubble_17582.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe wreckage goes on for block after devastated block. The smell is sickening. Every day, hundreds of people claw through tons of rubble with shovels and iron bars and their bare hands.\nThey are looking for the bodies of their children. Their parents. Their neighbors. All of them killed in Israeli missile strikes. The corpses are there, somewhere in the endless acres of destruction.\nMore than five weeks into Israel’s war against Hamas, some streets are now more like graveyards. Officials in Gaza say they don’t have the equipment, manpower or fuel to search properly for the living, let alone the dead.\nHamas, the militant group behind the deadly Oct. 7 attack that killed about 1,200 people in Israel, has many of its bases within Gaza’s crowded neighborhoods. Israel is targeting those strongholds.\nBut the victims are often everyday Palestinians, many of whom have yet to be found.\nOmar al-Darawi and his neighbors have spent weeks searching the ruins of a pair of four-story houses in central Gaza. Forty-five people lived in the homes; 32 were killed. In the first days after the attack, 27 bodies were recovered.\nThe five still missing were al-Darawi’s cousins.\nThey include Amani, a 37-year-old stay-at-home mom who died with her husband and their four children. There’s Aliaa, 28, who was taking care of her aging parents. There’s another Amani, who died with her 14-year-old daughter. Her husband and their five sons survived.\n“The situation has become worse every day,” said the 23-year-old, who was once a college journalism student. The smell has become unbearable.\n“We can’t stop,” he said. “We just want to find and bury them” before their bodies are lost in the rubble forever.\nThe Health Ministry in Hamas-run Gaza says the attacks have killed more than 11,200 people, two-thirds of them women and children. The U.N. humanitarian affairs office estimates that about 2,700 people, including 1,500 children, are missing and believed buried in the ruins.\nThe missing have added layers of pain to Gaza’s families, who are overwhelmingly Muslim. Islam calls for the dead to be buried quickly — within 24 hours if possible — with the shrouded bodies turned to face the holy city of Mecca. Traditionally, the body is washed by family members with soap and scented water, and prayers for forgiveness are said at the gravesite.\nThe search is particularly difficult in northern Gaza, including Gaza City, where Israeli ground forces are battling Hamas militants. Hundreds of thousands of people have fled southward, terrified by the combat and pushed by Israeli warnings to evacuate. But even in the south, continued Israeli airstrikes and shelling mean nowhere is safe in the tiny territory.\nThe Palestinian Civil Defense department, Gaza’s primary search-and-rescue force, has had more than two dozen workers killed and over 100 injured since the war began, said Mahmoud Bassal, the department spokesman.\nMore than half of its vehicles are now either without fuel or have been damaged by strikes, he said.\nIn central Gaza, outside the northern combat zone, the area's civil defense director has no working heavy equipment at all, including bulldozers and cranes.\n“We actually don’t have fuel to keep the sole bulldozer we have operating,\" said Rami Ali al-Aidei.\nAt least five large bulldozers are needed just to search a series of collapsed high-rise buildings in the coastal town of Deir al-Balah, he said.\nThis means that bodies, and the desperate people searching for them, are not the focus.\n“We’re prioritizing areas where we think we will find survivors,” said Bassal.\nAs a result, the search for bodies often falls to relatives, or to volunteers like Bilal Abu Sama, a former freelance journalist.\nHe ticks off a handful of Deir al-Balah’s victims: 10 corpses still lost in what is left of the al-Salam Mosque; two dozen bodies missing in a destroyed home; 10 missing in another mosque attack.\n“Will those bodies remain under the rubble until the war ends? OK, when will the war end?” said Abu Sama, 30, describing how families dig through the wreckage without any tools. “The bodies will be decomposed. Many of them have already decomposed.”\nOn Tuesday, 28 days after an airstrike flattened his home, Izzel-Din al-Moghari found his cousin’s body.\nTwenty-four people from his extended family lived in the home, in the Bureij refugee camp. All but three were killed.\nEight are still missing.\nA civil defense bulldozer came three days after the strike to clear the road, then left quickly for another collapsed building. The bulldozer came again Tuesday and helped find al-Moghari's cousin.\nAfter finding his cousin, al-Moghari went back into the wreckage in search of his father and other relatives.\n\"I am stunned,” he said. “What we lived through is indescribable.”\nGaza has become a place where many families are denied even the comfort of a funeral.\nAl-Darawi, the man searching for his cousins, understands that.\n“Those who found their dead are lucky,\" he said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Thousands of bodies lie buried in rubble in Gaza. Families dig to retrieve them, often by hand", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-hamas-families-israeli-b2448939.html"}