{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:38:17", "date_modify": "None", "date_publish": "2023-11-17 12:59:22", "description": "Hamas says three fighters died, while Israeli military says it killed at least five, as tensions rise", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F17%2Fisrael-kills-hamas-militants-in-jenin-raid-as-violence-surges-in-west-bank.json", "image_url": "https://i.guim.co.uk/img/media/6b60ff896dbe069b75dc2601e2cca0cef2026b47/0_139_4201_2521/master/4201.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=31f21d3bc3681e88d3763272b1dc294c", "language": "en", "localpath": null, "maintext": "Israeli security forces have mounted a major raid in the city of Jenin, destroying roads and killing between three and five Hamas militants in the latest instance of surging violence across the occupied West Bank.\nHamas said three of its fighters died in the overnight raid, which began late on Thursday night and lasted about eight hours. Israeli military officials said their forces had killed at least five.\nThe raid underlined the high tensions in the West Bank since the attacks launched by Hamas into southern Israel last month that prompted a massive Israeli military offensive into Gaza.\nThe mounting death toll in the West Bank has underscored fears that the territory seized by Israel in the 1967 war could spiral out of control amid the conflict in Gaza.\nHamas’s al-Quds Brigades in Jenin said in a statement on Friday they had engaged Israeli forces for several hours, unleashing a “torrent of fire” and laying ambushes with explosives.\nAn Israeli military spokesperson said an armed “terrorist cell that fired at Israeli security forces” was struck by an Israel Defense Forces (IDF) aircraft.\n“Additional terrorists who fired and hurled explosive devices at the security forces were neutralised,” the spokesperson said.\nThe Israeli military said some Hamas militants fled in vehicles and ambulances toward Jenin’s Ibn Sina hospital, and that troops stopped one of the vehicles at the entrance to the hospital. It released video footage of soldiers searching a car at the hospital and finding M-16 rifles and ammunition.\nPalestinian health officials said some hospital workers were ordered to exit the hospital, with a verified video showing them walking out of the building, holding up their hands. The Palestinian Red Crescent Society accused the IDF of detaining and searching ambulance crews.\nLast week, Israeli forces raided Jenin and fought for hours with gunmen in a battle in which 14 people were killed, one of the heaviest clashes in the occupied West Bank in months.\nAt least 191 Palestinians have been killed in the West Bank since the 7 October Hamas attacks on Israel, and as many as 2,000 detained amid a strict clampdown. Israeli officials say the arrests have thwarted several significant attacks.\nLast month’s attacks by Hamas killed 1,200, mostly civilians, with more than 240 taken hostage. Palestinian civilians have borne the brunt of Israel’s weeks-long military campaign in Gaza.\nGaza health authorities say at least 11,500 people have been confirmed killed in an Israeli bombardment and ground invasion – more than 4,700 of them children.\nA senior Israeli military officer told the Guardian last week that the West Bank was a “broad front” where the Israeli army was already deploying significant forces against Hamas and would not hesitate to intensify its efforts if necessary.\nIsraeli security forces also shot dead an attacker near Hebron after he opened fire on soldiers on Friday morning. On Thursday, an Israeli soldier was killed at a checkpoint on the West Bank’s route 60.\nItamar Ben-Gvir, Israel’s national security minister, said Israel needed to deal with Hamas in the West Bank “exactly like we are dealing with Gaza”.\nBen-Gvir, the leader of the far-right party Jewish Power, also said the Palestinian Authority “has similar views to Hamas and its heads identify with Hamas’s massacre” and should be dealt with in the same way.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel kills Hamas militants in Jenin raid as violence surges in West Bank", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/17/israel-kills-hamas-militants-in-jenin-raid-as-violence-surges-in-west-bank"}