{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:38:18", "date_modify": "None", "date_publish": "2023-11-17 16:11:48", "description": "Hamas has claimed 'Zionist' hostages were not held captive in hospitals but taken there 'to save their lives' after Israeli forces recovered the bodies of two prisoners in Gaza's Al-Shifa hospital.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12762555%2FHamas-say-Zionist-hostages-not-held-hospitals-taken-save-lives-Israel-recovers-two-prisoners-bodies-Al-Shifa-search-terror-groups-underground-HQ.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/17/11/77926955-0-image-a-41_1700221366805.jpg", "language": "en", "localpath": null, "maintext": "The bodies of hostages Noa and Yehudit Weiss were found near hospital, with Hamas claiming they had taken hostages there for 'treatment' due to the 'seriousness of their condition' and to 'save lives'\nHeartbroken mother of Noa Marciano broke down in tears at her daughter's funeral in Israel today\nAdvertisement\nHamas has claimed 'Zionist' hostages were not held captive in hospitals but taken there 'to save their lives' after Israeli forces recovered the bodies of two prisoners in Gaza's Al-Shifa hospital complex.\nAs Israeli forces continued their search of the hospital - where they claim Hamas have an underground command centre - the terrorists said they had taken hostages there for 'treatment' due to the 'seriousness of their condition' and to 'save their lives'.\nIsraeli Prime Minister Benjamin Netanyahu claimed earlier today there were 'strong indications' that hostages were held at the hospital - Gaza's largest - but they were no longer there when the facility was raided.\nIt was during this raid that Israeli soldiers found the bodies of Israeli hostages Noa Marciano and Yehudit Weiss, 64, in a building adjacent to Al-Shifa hospital.\nToday, Noa's heartbroken mother Adi Marciano broke down in tears as she placed her hand over her 19-year-old daughter's coffin during an emotional service for the soldier in the central Israeli city of Modiin.\nAdi, crumpling under the weight of her grief, collapsed on top of the wooden coffin where her daughter lay. Noa's friends and fellow comrades sobbed and held each other as they watched the coffin, covered with an Israeli flag, pass through the large crowd of devastated mourners.\nThe heartbroken mother had been told earlier this week that Noa, of the Combat Intelligence Collection Corps, had been killed after Hamas released a horrific video showing what appeared to be the 19-year-old's dead body.\nAdi, who described Noa as a 'girl of light and love' and beloved big sister to her three siblings, had waited in anguish for news that her daughter's body had been found. That news came today, with the IDF confirming they had found the remains of Noa and Weiss, 64, in a building adjacent to the hospital where Israeli soldiers are searching for a Hamas command centre.\nBut Hamas terrorists today claimed, without providing evidence, that they had taken some of the 240 hostages they captured during their horrific rampage that killed 1,2000 people on October 7, to the hospital to 'save their lives'.\nAdi, crumpling under the weight of her grief, collapsed on top of the wooden coffin where her daughter lay\nNoa's friends and fellow comrades sobbed and held each other as they watched the coffin, covered with an Israeli flag, pass through the large crowd of devastated mourners\nNoa's friends and fellow comrades sobbed and held each other as they watched the coffin, covered with an Israeli flag, pass through the large crowd of devastated mourners\nThe body of Israeli soldier Noa Marciano (pictured) was found in a building close to Al-Shifa hospital, the IDF said\nThe body of Yehudit Weiss, 64, (pictured) who was taken captive by Hamas at Kibbutz Be'eri during the Hamas killing spree, has been found\nThe parents of Israeli soldier Corporal Noa Marciano hold each other at their daughter's funeral\nNoa was laid to rest today in an emotionally charged funeral service, with her weeping friends and family consoling each other as they paid tribute to the young soldier\nSoldiers carry the coffin of Noa Marciano, a soldier in the Israel Defence Forces, as they walk near photos of her displayed at her funeral on Friday\nMeanwhile, Noa was laid to rest today in an emotionally charged funeral service, with her weeping friends and family consoling each other as they paid tribute to the young soldier.\nDuring the hospital raid in which Israeli troops found Noa and Yehudit's bodies, the IDF claimed its forces also found a tunnel shaft used by Hamas terrorists.\nThe IDF released a video it said showed a tunnel entrance in an outdoor area of Al-Shifa hospital, two days after Israeli troops entered its grounds to hunt for a Hamas command centre they say is beneath the medical facility.\nNetanyahu claimed there were 'strong indications' that hostages were held at the hospital but they were no longer there when the facility was raided.\n'We had strong indications that they were held in the Shifa Hospital, which is one of the reasons we entered the hospital,' he told CBS Evening News. 'If they were (there), they were taken out.'\nIsraeli troops claimed they found a tunnel entrance and weapons inside a truck located in the compound - but the military has yet to release evidence of a central Hamas command centre that Israel has said is concealed beneath the complex. Hamas and staff at the hospital, Gaza's largest, deny the allegations.\nIDF troops belonging to the Shaldag Unit, the 7th Brigade, and additional special units are continuing to conduct targeted activity in the Al-Shifa Hospital.\nOn Wednesday the IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base, with spokesman Lt Col Jonathan Conricus showing a duffel bag containing an AK47 assault rifle, grenades and ammunition.\nIt comes as the Israeli military said on Friday its troops had recovered the remains of kidnapped soldier Noa, 19, 'from a structure adjacent to Al-Shifa hospital'.\nThe army had confirmed earlier this week the death of Noa, without giving the cause. Hamas had issued a video of the young soldier alive followed by images of what the terrorists said was her body after she was killed by an Israeli strike.\nOvercome with grief, Adi Marciano broke down in tears as she placed her hand on her daughter Noa's coffin during an emotional service for the soldier in the central Israeli city of Modiin\nOvercome with grief, Adi Marciano broke down in tears as she placed her hand on her daughter Noa's coffin during an emotional service for the soldier in the central Israeli city of Modiin\nFriends and family mourn during Israeli soldier Corporal Noa Marciano's funeral after her remains were recovered near the Al Shifa Hospital during the ongoing Israeli ground operation in Gaza, in Modiin, Israel, on Friday\nNoa's friends and fellow comrades sobbed and held each other as they watched the coffin, covered with an Israeli flag, pass through the large crowd of devastated mourners\nNoa's mother and her family walk behind her coffin during her funeral on Friday\nMembers of Israeli military carry the coffin during Israeli soldier Corporal Noa Marciano's funeral after her remains were recovered near the Al Shifa Hospital on Friday\nHamas's tunneling infrastructure has been exposed around Gaza's AI-Shifa hospital\nIn the Hamas video, disseminated on social media on Monday, Noa identified herself on camera.\nShe said she had been held in Gaza for four days, indicating it was taped on October 11 - four days after Hamas's October 7 incursion into southern Israel.\nThe video then shows still pictures of a young woman of similar appearance lying, looking sallow and with her eyes closed, on a blood-stained bedsheet.\nA close-up image shows a bloody head wound.\nA caption over the video clip - which has been shared widely on social media - said Marciano was killed 'in an air strike by the Zionist enemy' last Thursday. MailOnline has chosen not to show the video.\nThe military statement did not comment on the circumstances of Marciano's death.\nMeanwhile, on Thursday the army said soldiers near Al-Shifa had found the body of another hostage - Yehudit Weiss, 65.\nMs Weiss was kidnapped from her home in the border kibbutz community of Beeri, one of the areas worst-hit by the brutal Hamas assault.\nHer husband Shmulik Weiss was found murdered in their safe room.\nMs Weiss's husband Shmulik Weiss was found murdered in the safe room\nThe IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base\nPictured: Israeli troops and military vehicles during ground invasion of Gaza\nTroops of the 7th Armored Brigade's 603rd Battalion found the body, along with Hamas military equipment - including assault rifles and RPGs in a building 'adjacent to Shifa Hospital', according to the IDF.\nThe body was brought back to Israel for identification, after which the military and police notified Ms Weiss's family of her death.\nThree Palestinians die in IDF drone strike in West Bank where 200 people have now been killed by Israel as tensions soar following Hamas's October 7 attack Three Palestinians were killed in an Israeli drone strike early on Friday in the city of Jenin in the occupied West Bank, the head of the Palestinian ambulance service said. The Israeli army confirmed it had carried out an airstrike, saying it had killed at least five militants during fighting in Jenin, a focus of repeated recent clashes as tensions soar against the backdrop of Israel's war against Hamas in Gaza. At least 200 Palestinians have been killed in the West Bank since the Oct. 7 attack on Israel by gunmen of the Islamist movement Hamas operating out of Gaza. 'An armed terrorist cell that fired at Israeli security forces was struck by an IDF (Israel Defense Forces) aircraft. Additional terrorists who fired and hurled explosive devices at the security forces were neutralized,' the military said. Hamas and the smaller militant group Islamic Jihad said they had engaged Israeli forces for several hours in the streets of Jenin, unleashing heavy fire and laying ambushes with explosives. The military said that gunmen then fled in vehicles and ambulances toward Jenin's Ibn Sina Hospital, and that troops stopped one of the vehicles at the entrance to the hospital. It released video footage of them searching a car at the hospital and finding M-16 rifles and ammunition. Palestinian health officials said some hospital workers were ordered to exit the hospital, with a verified video showing them walking out of the building, holding up their hands. Separately, the military said Israeli soldiers had shot dead two gunmen who had opened fire at them from a car near the West Bank city of Hebron. Advertisement\nIsraeli officials say around 240 people were taken hostage during the Hamas attacks which killed some 1,200 people, mostly civilians.\nThe IDF did not provide further details on Ms Weiss's cause of death, or when she was killed. It is believed she was undergoing treatment for cancer when she was seized by the terrorists.\n'The IDF sends its heartfelt condolences to the family,' it said in a statement. 'The national mission… is to locate the missing and return the hostages home.'\n'The IDF is operating alongside and in full coordination with the relevant national and security institutions in order to pursue these tasks. We will not cease from the mission until it will be completed,' the IDF added.\nIsrael's Defence Forces previously suggested it could take 'a few weeks' to uncover 'the extent' of Hamas's command centre beneath Al-Shifa hospital, as hundreds of commandos continue to search through every building and floor of the complex.\nFootage 'relating to hostages seized by Hamas' was found on computers at the hospital, the IDF has said, as well as a cache of weapons belonging to the terrorists.\nThe United Nations is now desperately looking into how it could evacuate the hospital, which is the biggest in the Gaza Strip, but says its options are limited by security and logistical constraints, a senior World Health Organization official said.\nIt comes as Netanyahu admitted efforts to prevent civilian deaths were 'not successful' - but blamed Hamas for stopping people from moving to safer places.\nWhen asked whether Israel's killing of thousands of Palestinians in its almost six week war against Hamas militants would fuel hatred among a new generation, Netanyahu said attempts to minimise civilian casualties were 'not successful'.\n'Any civilian death is a tragedy. And we shouldn't have any because we're doing everything we can to get the civilians out of harm's way, while Hamas is doing everything to keep them in harm's way,' Netanyahu said.\n'So we send leaflets, call them on their cell phones, and we say: 'leave'. And many have left,' he said.\nMeanwhile, Palestinian telecoms provider Paltel said a lack of fuel means all communications services are down across the besieged enclave, which has been subject to a blockade and relentless bombing campaign by Israel for weeks.\nThe communications blackout largely cuts off Gaza's 2.3 million people from one another and the outside world - and paralyzes the coordination of aid, which humanitarian groups were already struggling to deliver because of the fuel shortage.\nSince the war began, Gaza has received only 10 per cent of its required food supplies each day, and dehydration and malnutrition are growing with nearly all residents in need of food, said Abeer Etefa, a Mideast regional spokeswoman for the United Nations' World Food Program.\n'Food production has come to an almost complete halt, markets have collapsed, fishermen cannot access the sea, farmers cannot reach their farms,' she said Thursday from Cairo. 'People are facing the immediate possibility of starvation.'\nThe breakdown of the communications network only worsened the situation. The U.N. agency for Palestinian refugees, or UNRWA, said no aid deliveries would be able to enter from Egypt on Friday because of the difficulties coordinating them without phones or internet.\n'We have seen fuel and food and water and humanitarian assistance being used as a weapon of war,' said agency spokesperson Juliette Touma. It is 'outrageous that humanitarian agencies are reduced to begging for fuel.'\nFuel is needed for electricity generators that run everything from communication systems to water and sewage pumps.\nIDF troops belonging to the Shaldag Unit, the 7th Brigade, and additional special units continue are continuing to conduct targeted activity in the Shifa Hospital\nFootage captured the tunnels, which are surrounded by debris\nIsraeli troops during the ground invasion of the Gaza Strip\nIsraeli troops during the ground invasion of the Gaza Strip\nIsrael has barred fuel shipments into Gaza since the beginning of the war, but permitted a limited shipment to UNRWA earlier this week for trucks delivering food after the agency's fuel reservoir ran dry.\nIsraeli forces, meanwhile, have signaled they could expand their offensive toward Gaza's south even while pressing operations in the north. Troops have been searching the territory's biggest hospital for traces of a Hamas command centre the military alleges was located under the building.\n'We are close to dismantling the military system that was present in the northern Gaza Strip,' Chief of Staff Lt. Gen. Herzl Halevi said Thursday. Israeli forces dropped leaflets Wednesday afternoon telling Palestinians in areas near the southern town of Khan Younis to evacuate.\nHalevi said that while 'there remains work to be completed' in the north, more and more places would be targeted in the fight against Hamas.\nAn Israeli official said yesterday that the mission at Al-Shifa hospital 'is shaped by our understanding that there is well-hidden terrorist infrastructure in the complex'.\n'During the searches, information and footage pertaining to the hostages abducted from Israel were found on computers and other technological equipment,' an official also said.\nAn Israeli soldier contributes in an operation in a location given as the Port of Gaza amid the ongoing conflict\nIDF troops belonging to the Shaldag Unit, the 7th Brigade, are continuing to conduct targeted activity in the Shifa Hospital\nIsraeli soldiers carrying out operations inside Al-Shifa hospital in Gaza City in a picture released by the IDF\nIDF spokesperson Lt. Col. Conricus shows weapons and equipment which he says were found at Al Shifa hospital complex\nThe IDF previously shared what it called an 'intelligence-based illustration' of what the alleged command centre under the hospital might look like\nA laptop the IDF says was found in Shifa Hospital on November 16, 2023, with an image of rescued hostage Pvt. Ori Megidish which was taken before her abduction\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nInside a cabinet for medical equipment was another holdall containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman\nIn this image taken from a video released by the Israeli Defence Forces, on Wednesday, Lt. Col. Jonathan Conricus, an Israeli military spokesman, holds up a bullet proof vest with a Hamas insignia that was found along with weapons the IDF says were found in a medical closet at the MRI center at al-Shifa hospital in Gaza City\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Palestinian Islamist group Hamas\nThe IDF shared a picture of a laptop it said its forces found in the hospital showing a publicly-available image of rescued Israeli hostage Pvt. Ori Megidish, which was taken before her abduction.\nAn official said equipment found in the hospital had been taken for 'further examination and investigation.'\nAfter storming the medical facility, the IDF shared evidence of weaponry, with spokesman Lt Col Jonathan Conricus showing a duffel bag hidden behind a hospital MRI machine containing an AK47 assault rifle, grenades, ammunition and a uniform.\nHe also said a backpack contained 'what appeared to be very important intelligence including a laptop', and added that security cameras in one part of the hospital had been taped over.\nBehind another MRI machine more weapons were said to have been found and in an adjoining room on top of another MRI scanner was a bag containing 'full military kit for one terrorist, including ammunition, a live grenade and AK47 and body armour'.\n'These weapons have no business being in a hospital,' Conricus said as he toured the hospital in a clip released by the IDF.\nInside a cabinet for medical equipment was another holder containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman.\nNews of the IDF hospital raid came around 2am local time on Wednesday.\nDoctors said they were given 30 minutes' notice of the Israeli operation before at least six battle tanks moved in on the complex. Troops entered the hospital a short time afterwards.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hamas say 'Zionist' hostages were not held in hospitals but taken there 'to save their lives' after Israel recovers two prisoners' bodies from Al Shifa during search for terror group's underground HQ", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12762555/Hamas-say-Zionist-hostages-not-held-hospitals-taken-save-lives-Israel-recovers-two-prisoners-bodies-Al-Shifa-search-terror-groups-underground-HQ.html?ns_mchannel=rssns_campaign=1490ito=1490"}