{"authors": ["Gloria Oladipo"], "date_download": "2024-02-05 15:38:20", "date_modify": "None", "date_publish": "2023-11-17 19:57:29", "description": "Pro-ceasefire demonstrators also detained outside investment company accused of helping supply weapons to Israel", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fnov%2F17%2Ffox-news-israel-gaza-ceasfire-protest-new-york.json", "image_url": "https://i.guim.co.uk/img/media/d826d37ad52f5123a824106948c12f1e732e86a9/0_200_6000_3602/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=01175fdbb7326dc17b5820143863121b", "language": "en", "localpath": null, "maintext": "More protests demanding a ceasefire in Gaza were under way in the US on Friday morning, with police breaking up crowds and arresting demonstrators in various locations.\nSuch demonstrations come as recent polling shows that US public support for Israel is dropping, while the Hamas authorities in Gaza reported on Friday that more than 12,000 Palestinians, overwhelmingly civilians and mostly women and children, had now been killed since Israel declared war on Hamas in October.\nNew York police on Friday arrested pro-Palestine supporters who occupied the headquarters of News Corp, the media company that owns the Fox News channel and the Wall Street Journal and New York Post newspapers, according to clips posted on social media.\nDozens of demonstrators gathered in the News Corp lobby, chanting, “Shame” and “Fox News … you can’t hide. Your lies cover up genocide.”\nBREAKING: Pro-Palestine activists are occupying the headquarters of News Corp, the media conglomerate that owns Fox News and the Wall Street Journal.\nActivists have thrown “blood money” onto the floor representing the conglomerate’s promotion of Israeli genocide. pic.twitter.com/6NOsU0OhPR — BreakThrough News (@BTnewsroom) November 17, 2023\nPro-ceasefire demonstrators were also arrested on Friday in New York City after blocking the entrance to the headquarters building for BNY Mellon, a corporate investment company, which they said holds shares in weapons supply for the Israel Defense Forces (IDF).\nMeanwhile, students at Columbia University and New York University (NYU) were expected to hold a sit-in at an unnamed bank that funds NYU’s Tel Aviv campus sites.\nBoth universities have campus extensions in Israel, which student organizers say are built on top of former Palestinian villages.\nThe demonstration is meant to “highlight Columbia and NYU’s roles legitimizing Israeli apartheid” and “massive financial infrastructure … used to fund real estate projects at home and settler colonial expansions abroad”, the student organization said in a press release.\nMore protests are expected on Friday and throughout the weekend in New York, Chicago and other major US cities.\nThe latest demonstration comes after 200 people in San Francisco shut down a portion of the Bay Bridge in a protest calling for a ceasefire. At least 50 people were arrested after demonstrators formed a human chain between vehicles.\nAnd at least 90 protesters were injured during a demonstration on Thursday in Washington DC on Capitol Hill. Organizers with the Ceasefire Now Coalition said that dozens of protesters sustained injuries after police violently broke up the peaceful demonstration.\nDemonstrations against Israel’s airstrikes and military operations in Gaza have continued across the country, with tens of thousands of participants.\nThe latest actions come amid declining US public support for Israel in the past month, Reuters reported, citing an opinion poll.\nAccording to polling from Reuters/Ispos, the majority of Americans believe that Israel should call a ceasefire. About 68% of respondents said they agreed that “Israel should call a ceasefire and try to negotiate”.\nA majority of Democratic voters also believe that Israel’s overwhelming response to the 7 October Hamas attack, in which the Islamist extremists killed more than 1,200 people in southern Israel and took hostages back to Gaza, is “too much”, according to a new NPR/PBS NewsHour/Marist poll.\nAnd 56% of Democrats have said that Israel’s military operations in Gaza have been too much, which is 21 points higher than a similar survey last month.\nPeople of color in the US as well as those under the age of 45 also believe that Israel’s response has been disproportionate, pointing to generational and racial splits around support for Israel.\nMeanwhile, 52% of Republicans viewed Israel’s response as “about right”, an increase from last month’s poll when more Republicans then viewed Israel’s reaction as “too little”.\nOverall, the majority of respondents say they are more sympathetic to Israelis than Palestinians.", "source_domain": "www.theguardian.com", "text": null, "title": "New York police makes arrests at Fox News HQ as Gaza protests spread", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/nov/17/fox-news-israel-gaza-ceasfire-protest-new-york"}