{"authors": ["Source"], "date_download": "2024-02-05 15:38:21", "date_modify": "None", "date_publish": "2023-11-17 01:36:54", "description": "The Indonesian hospital in northern Gaza has been completely shut down", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Fvideo%2F2023%2Fnov%2F17%2Findonesian-hospital-seen-crammed-with-patients-hours-before-shutdown-video.json", "image_url": "https://i.guim.co.uk/img/media/6962831c0f77076cb942a371d1d225d9f2e75d94/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=108444ceb63d28a3d3a52f2d57875ca0", "language": "en", "localpath": null, "maintext": "The Indonesian hospital in northern Gaza has been completely shut down and about 45 patients who urgently need surgery have been left in the reception area, the hospital chief Atef al-Kahlout has said, 'due to our clinical inability to accommodate patients from Gaza and the north, we announce that the hospital has completely stopped operating,' al-Kahlout told Al Jazeera.\nIn central Gaza al-Ahli hospital is currently under siege by Israeli tanks and a “violent attack is underway” at the hospital, the Palestinian Red Crescent Society (PRCS) said on Thursday.\nThe Israeli operation in Shifa hospital continued on Thursday after the Israel Defense Forces (IDF) first entered the sprawling compound in the early hours of Wednesday morning. There were reports of shooting at the hospital. The IDF said it had uncovered a Hamas tunnel shaft and a vehicle with weapons at al-Shifa hospital complex. It made videos and photographs of the tunnel shaft and weapons public, but no independent verification was possible", "source_domain": "www.theguardian.com", "text": null, "title": "Indonesian hospital in Gaza seen crammed with patients hours before shutdown - video", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/video/2023/nov/17/indonesian-hospital-seen-crammed-with-patients-hours-before-shutdown-video"}