{"authors": ["Emma Richter", "Emma Richter For Dailymail.Com"], "date_download": "2024-02-05 15:38:22", "date_modify": "None", "date_publish": "2023-11-17 06:54:39", "description": "A pro-Palestine group has called for 'direct action' to 'globalize intifada' as they shared a map of well-known New York City landmarks on Instagram.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12760395%2FPro-Palestine-group-gives-NYC-map-calling-direct-action-landmarks-city-blasts-hateful-rhetoric-alters-NYPD.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/17/06/77629391-0-image-a-12_1700202903425.jpg", "language": "en", "localpath": null, "maintext": "The post has since been deleted but the NYPD and lawmakers are aware of it\nA pro-Palestine group has called for 'direct action' to 'globalize intifada' as they shared a map of well-known New York City landmarks on Instagram.\nThe graphic specified famous buildings and companies in the Big Apple that have ties to Israel or are media companies.\nThe page that posted the map goes by the name Within Our Lifetime and has described itself as a Palestinian-led community organization that's said, 'We will free Palestine.'\n'Each of the locations on this map reflects the location of an office of an enemy of both the Palestinian people and colonized people all over the world, the group stated, according to the New York Post. 'Today and beyond, these locations will be sites for popular mobilization in defense of our people,' the post read.\nA City Hall spokesman told The New York Post: 'But to be clear, threatening businesses and organizations and referring to them as the \"enemy\" is exactly the kind of hateful rhetoric that seeks to divide New Yorkers, but it won't work, because we are better than that.'\nThe map pinpointed notable targets around the city, such as Grand Central Station. DailyMail.com has decided to blur the map.\nThe map itself, which was posted on Wednesday, has since been deleted.\nThe group that also goes by 'wolpalestine' on Instagram has 121,000 followers and posts protest banners and maps multiple times a day.\nThe map itself was titled 'From Palestine to NYC - Globalize the Intifada.' The term intifada relates directly to the Palestine uprising against Israel when they occupied the West Bank of the Gaza Strip in 1987.\nThe group also posted another map to its social media page on Wednesday that remains on its Instagram page.\nThis map was titled 'Funding Colonization: Tax Exempt Zionist \"Charities\" Funding Settler Organizations in Palestine'. It went on to list and pinpoint specific Israel locations in Manhattan, Brooklyn, Queens, Staten Island, Long Island and New Jersey.\nA pro-Palestine protestor is seen being restrained by NYPD\nProtesters read names of those killed in Gaza from a paper called 'The New York Crimes\nPoliticians across New York City have responded to the threatening 'direct action' map on social media.\nCouncilman Keith Powers took to X (formally known as Twitter) and said: 'This is an unacceptable invitation to senseless violence. I strongly condemn it & have reached out to local NYPD.'\n'Coded calls for violence against Jews are proliferating on social media,' Democratic Representative Ritchie Torres said on X along with a picture of the map.\nRevered Joseph Potasnik, the executive vice president of the NY Board of Rabbis, told The Post: 'Intifadas are targeted attacks on Jews. The hatred of the heart leads to hatred of the hands.'\nWolpalestine also posted a flyer on Thursday about a planned march on Saturday in the Bay Bridge neighborhood of Brooklyn.\nNYPD officers are seen confronting some of the protesters outside Grand Central station\nHundreds of NYC high school students and teachers walked out and marched at Bryant Park\nThey have called it 'Flood Brooklyn for Gaza' and requested that attendees bring flags, keffiyehs and masks.\n'In the meantime, spread this like wildfire,' the post said.\nOn November 9, a pro-Palestine group stormed the New York Times building as they criticized the news outlet's coverage of the war.\nDemonstrators took over the lobby of the building as they waved flags and held up 'Ceasefire now' sings. They then went on to read off names of those killed in Gaza from a paper called 'The New York Crimes.'\nEarlier that day, New York City high school students, parents and teachers participated in a walkout protest calling for a ceasefire.\nOrganized by groups such as Teachers Unite, NYC Educators for Palestine and Palestinian Youth Movement, the students walked out of class and gathered at Bryant Park.\nCrowds chanted, 'From the river to the sea, Palestine will be free,' a phrase used to call for a Palestinian takeover of the land between the Jordan River and the Mediterranean Sea, which includes Israel.\n'We've called on people to walk out of work. We have called on people to walk out of their schools. Many people have responded to that call,' said Munir Marwan of the Palestinian Youth Movement to CBS New York.\nThe group is calling for a ceasefire and an end to what they called Israeli genocide.\nPalestinians search for casualties at the Magazi Refugee Camp in central Gaza\nIsrael military vehicles and heavy smoke inside the Gaza Strip\nIsraeli forces have continued to pound Gaza for weeks\nThe following day, a mob of masked pro-Palestinian protesters attempted to storm Grand Central station as they kicked in the door and cracked the glass.\nThough they failed to make it into the closed station that typically sees 750,000 people pass through daily, the NYPD warned people to avoid the area.\nIt has been just over a month since Hamas launched their surprise attack that killed 1,400 Israelis and seized about 240 hostages in the worst attack in the country's history.\nOn Wednesday, President Biden said he had made it clear to Israeli Prime Minister Benjamin Netanyahu that a two-state solution was the only answer to resolve Israel-Palestinian conflict and said Hamas committed war crimes by storing weapons in a tunnel under a Gaza hospital.\nIsrael has long accused Hamas of hiding its forces among civilian targets. Hamas officials have said more than 10,000 have died in Israel's campaign, although the White House says it cannot verify the figure.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pro-Palestine group gives out NYC map calling for 'direct action' on landmarks as city blasts 'hateful rhetoric' and alerts the NYPD", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12760395/Pro-Palestine-group-gives-NYC-map-calling-direct-action-landmarks-city-blasts-hateful-rhetoric-alters-NYPD.html?ns_mchannel=rssns_campaign=1490ito=1490"}