{"authors": [], "date_download": "2024-02-05 15:38:23", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Tens of thousands of demonstrators gathered Tuesday on the National Mall in Washington in a show of solidarity as Jews across the United States and the w", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274033460%2Ftens-of-thousands-rally-in-washington-to-show-support-for-israel.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700028316.jpg", "language": "en", "localpath": null, "maintext": "Tens of thousands of demonstrators gathered Tuesday on the National Mall in Washington in a show of solidarity as Jews across the United States and the world face a resurgence of antisemitism that activists at the protest compared with the hatred that culminated in the Holocaust.\nThe rally, called Americans March for Israel, was organized by various Jewish organizations and featured speeches by politicians, intellectuals, musicians and relatives of hostages abducted by Hamas.\nSigns reading, 'Free the hostages' and 'Never again is now' bobbed up and down in the audience as speakers, including Israeli President Isaac Herzog and U.S. Senate Majority Leader Chuck Schumer, took their turns.\n'We will continue fighting for the release of all hostages until they return to safety,' Schumer said, affirming U.S. support for Israel.\nEmbed share 'March For Israel' Shows Jewish Americans Are Not a Monolith Embed share The code has been copied to your clipboard. width px height px\nThe URL has been copied to your clipboard\nNo media source currently available\n0:00 0:02:42 0:00\nHerzog delivered his address from Israel.\n'Jews came out of Auschwitz and vowed, 'Never again,'' he said in remarks shown on large TV screens. 'As the blue and white flag was hoisted over our ancient homeland, we vowed, 'Never again.''\nHerzog went on to describe Hamas' terror attack last month, which left 1,200 Israelis dead, and asked the crowd to 'cry out together, 'Never again!''\nRepresentative Mike Johnson, the newly appointed speaker of the U.S. House, also spoke to the crowd.\n'There are few issues in Washington that could so easily bring together leaders of both parties and both chambers,' he said. 'But the survival of the state of Israel and her people unites us together - and it unites all Americans.'\nTens of thousands gather on the National Mall in Washington in support of Israel, Nov. 14, 2023.\nThe march comes just over a week after pro-Palestinian demonstrators held a similarly large gathering on the National Mall, and two days after 180,000 people took to the streets in France to rally against antisemitism.\nSam Markstein, 30, of Washington participated in Tuesday's march. He serves as the political director of the Republican Jewish Coalition, which co-sponsored last week's Republican presidential debate in Miami.\n'The message is, the Republican Party and Jews from across the country stand shoulder-to-shoulder with Israel, and we're going to keep doing that until Hamas is defeated and obliterated,' Markstein told VOA.\nAvi Light, 21, of Rockland Community College in Suffern, New York, said he hopes for a future beyond the bloodshed.\n'I just want peace,' Light said, walking hastily alongside the Mall with his Jewish classmates. 'I just want people to stop dying. I really want the whole war to just end.'\n'I have friends in the [Israel Defense Forces] that I went to school with,' Light continued. 'I just want to be able to go to sleep at night and know they're safe.'\nNoa Friedan, 13, left, and Eila Friedan, 11, of Philadelphia, hoist signs saying 'Pro Israel, Anti Hamas, Pro Peace, Anti Bibi' while rallying on the National Mall in Washington to support Israel, Nov. 14, 2023.\nA few dozen anti-Zionist, ultra-Orthodox Jews led by Rabbi Dovid Feldman, 52, of Monsey, New York, stood behind banners outside the protest - including one with a red slash over the Israeli flag - drawing scorn from several Jewish passersby.\nFeldman and others chanted, 'Judaism, yes! Zionism, no!' One pro-Israel demonstrator came within inches of the counterprotesters, screaming profanities.\nDorit Voda, a British Israeli living in Rockville, Maryland, also confronted Feldman. Voda said she found Feldman's statements to be deeply offensive, saying that Israel was established 'legally and rightfully' in the aftermath of the Holocaust in large part to protect survivors.\nAfter several heated exchanges, U.S. Park Police spread out in a line to shield Feldman's group.\nFeldman told VOA that the March for Israel 'does not represent the Jewish people' and blamed Hamas' brutal October 7 assault entirely on Israel, a claim that most prominent Jewish groups denounce as antisemitic.\nFeldman expressed outrage at the massive loss of life in the Gaza Strip, where more than 11,000 Palestinians have been killed in Israeli military operations since fighting broke out last month, according to the Hamas-run Gaza health authority.\nFeldman repeatedly clarified that he does not condone violence against civilians.\nA woman holds a sign saying 'Free Hostages, Support Israel, Combat Antisemitism' while attending a march to support Israel on the National Mall in Washington, Nov. 14, 2023.\nParked in his van outside VOA headquarters, which is just meters from where the protest took place, Rabbi Yehuda Pevzner, 30, of Brooklyn, New York, struck a less provocative tone.\nPevzner was part of a group of Hasidic Jews who drove what they call a 'synagogue on wheels' to Washington to help Jews carry out mitzvot, or good deeds, such as doing tefillin, an ancient Jewish prayer ritual.\nPevzner said that Jews have an obligation 'to help people in danger,' both in Israel and beyond. He also said, citing the Torah, that Israel is the Jewish homeland, and that Jews must look after one another, particularly in light of recent incidents of antisemitism across the globe.", "source_domain": "www.britainnews.net", "text": null, "title": "Tens of Thousands Rally in Washington to Show Support for Israel", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274033460/tens-of-thousands-rally-in-washington-to-show-support-for-israel"}