{"authors": [], "date_download": "2024-02-05 15:38:25", "date_modify": "None", "date_publish": "2023-11-17 06:07:47", "description": "Israeli forces continue to operate inside hospital complex it alleges Hamas used as a base", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fal-shifa-hospital-patients-screaming-from-thirst-gaza-b2448924.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/07/Israel_Palestinians_39410.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe director of Gaza’s largest hospital said patients were “screaming from thirst” as its water and oxygen supplies have run out.\nMuhammad Abu Salmiya said Israeli forces had blown up the Al Shifa Hospital’s main water line. He described conditions inside the hospital as “tragic”.\nIsrael is still conducting search operations inside Gaza’s largest hospital having sent troops inside on Wednesday. Israel claims Hamas is operating a command centre in tunnels beneath the health facility, allegations which have been denied by doctors and the Gaza health ministry.\n“The conditions are tragic and those in the hospital are screaming from thirst,” Mr Abu Salmiya told the BBC.\n“Sniping operations continue, no one can move from one building to another, and we have lost communication with our colleagues,” said Mr Abu Salmiya.\nIsrael’s military earlier said the body of one of the hostages, kidnapped by Hamas after the group’s 7 October attacks, was found in a building near the hospital.\nLate on Thursday the IDF released videos and photographs of what it described as an “operational tunnel” within the Al Shifa Hospital complex, as well as footage of a vehicle containing weapons. Earlier it released videos of duffel bags with guns that it said were found inside the hospital.\nHamas said the earlier video was staged, while other Palestinians said that – even if they were real – they show nothing like the militant command centre claimed by Israel to justify raiding the hospital.\n“These are weak pretexts. There is nothing for the resistance inside medical institutions,” said Dr Nahed Abu Taaema, the director of the Nasser Hospital in Khan Younis, who said medics were alarmed for their colleagues at Al Shifa after losing contact with them since Wednesday.\nThe health ministry in Gaza said Israeli bulldozers damaged portions of the southern entrance to the medical complex.\nAshraf al-Qudra, a spokesperson for Gaza’s health ministry, said “thousands of women, children, sick and wounded are in danger of death” as Israeli military raids on the hospital have continued.\nThe World Health Organisation has joined other humanitarian organisations, including Doctors Without Borders, to demand an end to assaults on healthcare facilities in Gaza and have called for an immediate ceasefire.\nThis comes as Israeli airstrikes continued throughout Gaza on Thursday, and the enclave experienced a widespread communications blackout due to the depletion of fuel for the generators of the primary telecommunications provider.\n“All telecom services” in the Gaza strip were out of service, according to statements from the two major Palestinian mobile networks Jawwal and Paltel on Thursday, “as all energy sources sustaining the network have been depleted, and fuel was not allowed in”.\nOn Thursday, Israeli forces said they found the body of 65-year-old Yehudit Weiss, who was abducted from Be’eri kibbutz near the Gaza border by Hamas on 7 October.\nWeiss’s body was found in a building near the al-Shifa hospital, said officials of the Israel Defense Forces (IDF). She had been receiving cancer treatment, according to Israeli forces.\n“The body of Yehudit Weiss, who was abducted by the Hamas terrorist organisation, was extracted by IDF troops from a structure adjacent to the Shifa hospital in the Gaza Strip and was transferred to Israeli territory,” said a spokesperson.\n“In the structure in which Yehudit was located, military equipment including Kalashnikov rifles and RPGs were also found,” said the spokesperson.\nWeiss’s husband, Shmulik, was reportedly among the estimated 1,200 Israelis killed during the 7 October Hamas terror attack across southern Israel.\nAccording to the Bring Them Home Now group, Weiss was without her medication when she was taken hostage by Hamas.\n“Unfortunately, Yehudit was murdered by terrorists in Gaza and we did not get to her in time,” the IDF spokesperson told the media.\nSince 7 October, at least 11,470 Palestinians have been killed in retaliatory strikes by Israel on Gaza. Reports said this figure has not been updated for a few days due to the collapse of the Gaza Strip’s health system amid Israel’s constant bombardment.\nMeanwhile, it was reported that Israel has dropped leaflets in southern Gaza, advising Palestinian civilians to evacuate four towns situated on the eastern periphery of Khan Younis city in southern Gaza.\nIsrael had initially told civilians to flee northern Gaza, and tens of thousands of Palestinians had migrated to UN-run shelters and family homes in recent weeks.", "source_domain": "www.independent.co.uk", "text": null, "title": "Al-Shifa Hospital: Patients at Gaza’s largest hospital ‘screaming from thirst’ as water and oxygen run out", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/al-shifa-hospital-patients-screaming-from-thirst-gaza-b2448924.html"}