{"authors": ["Rachael Bunyan", "Miriam Kuepper"], "date_download": "2024-02-05 15:38:26", "date_modify": "None", "date_publish": "2023-11-17 08:14:16", "description": "ISRAEL-HAMAS RECAP: This was MailOnline's live blog on the latest developments in the war between Israel and Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12761113%2FURL-israel-hamas-war-live-updates-al-shifa-hospital-warning-gaza-no-aid.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/17/08/77919711-0-image-m-11_1700208551617.jpg", "language": "en", "localpath": null, "maintext": "Israel risks facing a long and bloody insurgency if it defeats Hamas and occupies Gaza without a credible post-war plan to withdraw its troops and move toward the creation of a Palestinian state, U.S. and Arab officials, diplomats and analysts said.\nNone of the ideas floated so far by Israel, the United States and Arab nations for the post-war administration of Gaza have managed to gain traction, according to two U.S. and four regional officials as well as four diplomats familiar with the discussions, raising fears the Israeli military may become mired in a prolonged security operation.\nAs Israel tightens its control over northern Gaza, some officials in Washington and Arab capitals fear it is ignoring lessons from the U.S. invasions of Iraq and Afghanistan when swift military victories were followed by years of violent militancy.\nIf Gaza's Hamas-run government is toppled, its infrastructure destroyed and its economy ruined, the radicalization of an enraged population could fuel an uprising targeting Israeli troops in the enclave's narrow streets, diplomats and officials say.\nIsrael, the U.S. and many Arab states agree that Hamas should be ousted after it launched a cross-border raid on Oct. 7 that killed some 1,200 people and took around 240 hostages. But there is no consensus on what should replace it.\nArab countries and Western allies have said a revitalized Palestinian Authority (PA).which partially governs the West Bank, is a natural candidate to play a greater role in Gaza, home to some 2.3 million people.\nBut the credibility of the Authority - run by 87-year-old President Mahmoud Abbas' Fatah party - has been undermined by its loss of control over Gaza to Hamas in a 2007 conflict, its failure to halt the spread of Israeli settlements in the West Bank, and accusations of widespread corruption and incompetence.\nIsraeli Prime Minister Benjamin Netanyahu said at the weekend that the PA in its current form should not take charge of Gaza. He said the Israeli military was the only force capable of eliminating Hamas and ensuring that terrorism did not reappear. In the wake of Netanyahu's comments, Israeli officials have insisted that Israel does not intend to occupy the Gaza Strip.\nU.S. President Joe Biden warned Netanyahu on Wednesday that occupying Gaza would be 'a big mistake'. So far, the U.S. and its allies have not seen any clear roadmap from Israel for its exit strategy from Gaza beyond the declared aim of eradicating Hamas, diplomats say. U.S. officials are pressing Israel for realistic objectives and a plan for how to achieve them.\nWashington's discussions of a post-war plan for Gaza are still in the very initial stages with the PA, other Palestinian stakeholders, and allies including Egypt, Jordan, UAE, Saudi Arabia and Qatar, according to two U.S. officials, speaking on the condition of anonymity.\n'We're certainly not there yet in terms of any effort to sell that vision to our regional partners who ultimately will have to live with it, and or implement it,' one senior U.S. official said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel-Hamas RECAP: Israeli troops continue search of Al-Shifa hospital as UN warns it cannot distribute aid in Gaza", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12761113/URL-israel-hamas-war-live-updates-al-shifa-hospital-warning-gaza-no-aid.html?ns_mchannel=rssns_campaign=1490ito=1490"}