{"authors": [], "date_download": "2024-02-05 15:38:27", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "SAN FRANCISCO -- U.S. Treasury Secretary Janet Yellen said Monday that recent U.S.-China engagements have moved the two sides along the right path. Re.....", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274032753%2Fxinhua-world--summary-at-1530-gmt-nov-14.json", "image_url": "https://static.themainstreammedia.com/story_logos/newsnet/britain-news.jpg", "language": "en", "localpath": null, "maintext": "SAN FRANCISCO -- U.S. Treasury Secretary Janet Yellen said Monday that recent U.S.-China engagements have moved the two sides \"along the right path.\"\n\"Responsibly managing the U.S.-China economic relationship\" has been \"a key priority\" throughout her time in San Francisco, Yellen told reporters at a press conference following the conclusion of the Asia-Pacific Economic Cooperation (APEC) Finance Ministers' Meeting. (China-US-APEC-Yellen)\n- - - -\nBAGHDAD -- Three Islamic State (IS) militants, including a local ringleader, were killed in an operation in Iraq's northern province of Kirkuk, the Iraqi military said on Tuesday.\nIraqi Counter-Terrorism Service forces, backed by helicopter gunships, launched an operation to hunt down members of an IS cell in the Wadi-Zghaiton area in the southwest of the namesake provincial capital Kirkuk, Yahia Rasoul, spokesman of the commander-in-chief of Iraqi forces, said in a statement. (Iraq-IS Militants-Killing)\n- - - -\nJERUSALEM -- The Israeli army announced Tuesday that its troops had seized control of Hamas's governing institutions in Gaza.\nIsrael Defense Forces (IDF) Spokesman Daniel Hagari posted video footage on the social media platform X showing Israeli forces raiding what he said is a government building of Hamas in Gaza City. It also showed gunfights between Palestinian militants and Israeli soldiers, who were inside one of the government buildings. (Israel-Gaza-Hamas Governing Institutions)\n- - - -\nBEIJING -- An earthquake with a magnitude of 5.8 jolted New Britain region, Papua New Guinea at 1252 GMT on Tuesday, the GFZ German Research Center for Geosciences said.\nThe epicenter, with a depth of 10.0 km, was initially determined to be at 6.12 degrees south latitude and 148.15 degrees east longitude. (Papua New Guinea-Earthquake)", "source_domain": "www.britainnews.net", "text": null, "title": "Xinhua world news summary at 1530 GMT, Nov. 14", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274032753/xinhua-world--summary-at-1530-gmt-nov-14"}