{"authors": [], "date_download": "2024-02-05 15:38:30", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Kathmandu, Nepal - Nepal’s government decided to ban the popular social media app TikTok, saying Monday it was disrupting “social harmony&rdqu", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031653%2Fnepal-bans-tiktok-says-it-disrupts-social-harmony.json", "image_url": "https://cdn.bignewsnetwork.com/voa1699898751.jpg", "language": "en", "localpath": null, "maintext": "Kathmandu, Nepal - Nepal's government decided to ban the popular social media app TikTok, saying Monday it was disrupting \"social harmony\" in the country.\nThe announcement was made following a Cabinet meeting. Foreign Minister Narayan Prakash Saud said the app would be banned immediately.\n\"The government has decided to ban TikTok as it was necessary to regulate the use of the social media platform that was disrupting social harmony, goodwill and flow of indecent materials,\" Saud said.\nHe said that to make social media platforms accountable, the government has asked the companies to register and open a liaison office in Nepal, pay taxes and abide by the country's laws and regulations.\nIt wasn't clear what triggered the ban or if TikTok had refused to comply with Nepal's requests. The company did not immediately respond to an email seeking comment.\nTikTok, owned by China's ByteDance, has faced scrutiny in several countries because of concerns that Beijing could use the app to harvest user data or advance its interests. Countries including the United States, Britain and New Zealand have banned the app on government phones despite TikTok repeatedly denying that it has ever shared data with the Chinese government and would not do so if asked.\nNepal has banned all pornographic sites in 2018.", "source_domain": "www.theuknews.com", "text": null, "title": "Nepal Bans TikTok, Says It Disrupts Social Harmony", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031653/nepal-bans-tiktok-says-it-disrupts-social-harmony"}