{"authors": ["James Callery"], "date_download": "2024-02-05 15:38:30", "date_modify": "None", "date_publish": "2023-11-16 11:48:21", "description": "The move signals a possible expansion of Israel's offensive to areas in Gaza where hundreds of thousands of people are crowded into UN-run shelters and family homes.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12756889%2FIsrael-warns-Palestinians-evacuate-parts-southern-Gaza-hundreds-thousands-gathered-fleeing-north-soldiers-continue-search-Al-Shifa-hospital.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/11/77874873-0-image-m-31_1700134781719.jpg", "language": "en", "localpath": null, "maintext": "Move signals possible expansion of offensive to areas where hundreds of thousands are crowded into shelters and family homes\nIsrael has warned Palestinians to evacuate southern Gaza, where hundreds of thousands have gathered after fleeing the north.\nImages show leaflets being dropped by Israeli forces warning Palestinians to flee parts of the enclave's southern region.\nThe IDF posted on X today: 'To the residents of Tal Al-Hawa, Al-Sabra, Al-Zeitoun, Al-Gharbi, Darj Al-Tuffah, Al-Shuja'iyya and Jabalia, the evacuation corridors will remain open until 16:00 for civilians through the Salah Al-Din route southward of Wadi Gaza.\n'There will be a tactical pause of military operation for humanitarian purposes between 10:00-14:00 in the neighborhoods of Shuja'iyya and Turkmen. During this time, civilians should move south to the Salah Al-Din route.'\nThe move signals a possible expansion of Israel's offensive to areas where hundreds of thousands of people who heeded earlier evacuation orders are crowded into UN-run shelters and family homes.\nIsraeli soldiers take part in an operation in a location given as the Port of Gaza, in this handout image released on November 16, 2023\nIsraeli soldiers sit in an armoured vehicle at a position along the border with the Gaza Strip in southern Israel on November 16, 2023\nAn Israeli military tank is positioned close to the Israeli border with the Gaza Strip in southern Israel on November 16, 2023\nMeanwhile, soldiers continued searching Al-Shifa Hospital in the north in a raid that began early on Wednesday.\nThey displayed guns they say were found hidden in one building but have yet to release any evidence of the central Hamas command centre that Israel said is concealed beneath the complex.\nHamas and staff at the hospital, Gaza's largest, deny the allegations.\nBroadening operations to the south - where Israel already carries out daily air raids - threatens to worsen an already severe humanitarian crisis in the besieged territory.\nOver 1.5 million people have been internally displaced in Gaza, with most having fled to the south, where food, water and electricity are increasingly scarce.\nA picture taken from the border between Israel and Gaza shows leaflets being dropped by the Israeli army over Gaza City telling people to evacuate the area on November 16, 2023\nNewborns are placed in bed after being taken off incubators in Gaza's Al Shifa hospital after power outage, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Gaza City, Gaza November 12, 2023\nPalestinians wounded in Israeli strikes lie on the floor as they are assisted at the Indonesian hospital after Al Shifa hospital has gone out of service amid Israeli ground offensive, in the northern Gaza Strip November 16, 2023\nThis handout picture released by the Israeli army on November 15, 2023, shows soldiers during a military operation around Al-Shifa hospital\nIDF spokesperson Lt. Col. Conricus shows weapons and equipment which he says were found at Al Shifa hospital complex\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nInside a cabinet for medical equipment was another holdall containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman\nThis image taken from a video released by the Israeli Defense Forces, Wednesday, Nov. 15, 2023, shows a bullet proof vest with a Hamas insignia that was found along with weapons the IDF says were found in a medical closet at the MRI center at al-Shifa hospital in Gaza City\nThis image taken from a video released by the Israeli Defense Forces, on Wednesday shows a cache of weapons the IDF says were found in a closet at the MRI center at al-Shifa hospital in Gaza City\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nVideo grabs appear to show medics evacuating patients from Al Shifa hospital during raid\nThis handout picture released by the Israeli army on November 15, 2023, reportedly shows Israeli soldiers carrying out operations inside Al-Shifa hospital in Gaza City\nIt is not clear where else they could go, as Egypt refuses to allow a mass transfer on to its soil.\nThe war, now in its sixth week, was triggered by a wide-ranging Hamas attack into southern Israel on October 7 in which the terrorists killed over 1,200 people, mostly civilians, and captured 240 men, women and children.\nIsrael kills three terrorists who opened fire near West Bank crossing Three gunmen who attacked a checkpoint near Jerusalem today, wounding six security forces, were killed as Israeli police fended them off, police said. National police chief Kobi Shabtai told reporters the attackers carried pistols, axes and ammunition for 'a major attack or a massacre in Israel'. Four members of the security services suffered gunshot wounds, including one who was critically injured, said the emergency medical service Magen David Adom in a statement, adding that two more were lightly wounded. The critically wounded soldier, identified as Avraham Fetena, 20, died of his injuries, the army said in a statement. The attack on a checkpoint guarding road tunnels linking the occupied West Bank and Jerusalem came on the 41st day of the war between Israel and Gaza-based Hamas terrorists. The West Bank has seen a dramatic rise in tension and violence since the start of the Israel-Hamas war. Israel has vowed to eradicate Hamas in retaliation for the attacks of October 7, which killed 1,200 people, most of them civilians, according to Israeli officials. Hamas also took around 240 hostages, among them young children and elderly people, officials say. The Hamas-run health ministry in Gaza says the death toll from the military offensive has now topped 11,500, including thousands of children. Advertisement\nIsrael responded with a weeks-long air campaign and a ground invasion of northern Gaza, vowing to remove Hamas from power and crush its military capabilities.\nMore than 11,200 Palestinians have been killed, two-thirds of them women and children, according to Palestinian health authorities.\nAnother 2,700 have been reported missing, with most believed to be buried under the rubble. The official count does not differentiate between civilian and terrorist deaths, and Israel says it has killed thousands of terrorists.\nThe war has inflamed tensions elsewhere. Three gunmen shot and wounded six security forces at a checkpoint today on the main road linking Jerusalem to Israeli settlements in the occupied West Bank. Police said the attackers were shot dead. One of the Israeli soldiers, who was critically wounded in the attack, identified as Avraham Fetena, 20, died of his injuries, the army said in a statement.\nIsraeli troops stormed into Gaza's largest hospital on Wednesday, searching for traces of Hamas inside and beneath the facility, where newborns and hundreds of other patients have suffered for days without electricity and other basic necessities.\nTroops searched the underground levels of the hospital today and detained technicians responsible for running its equipment, the Health Ministry in Hamas-run Gaza said in a statement.\nThe military said its soldiers were accompanied by medical teams bringing in incubators and other supplies.\nAfter encircling Al-Shifa for days, Israel faces pressure to prove its claim that Hamas used the patients, staff and civilians sheltering there to provide cover for its fighters. The allegation is part of Israel's broader accusation that Hamas uses Palestinians as human shields.\nThe military released video from inside Al-Shifa showing three duffel bags it said it found hidden around an MRI lab, each containing an assault rifle, grenades and Hamas uniforms, as well as a cabinet that contained a number of assault rifles without ammunition clips.\nHamas and Gaza health officials deny its forces operate in Al-Shifa - a hospital that employs some 1,500 people and has more than 500 beds. Palestinians and human rights groups accuse Israel of recklessly endangering civilians.\nMunir al-Boursh, a senior official with Gaza's Health Ministry inside the hospital, said troops ransacked the basement and other buildings, and questioned patients, staff and people sheltering in the facility.\nSmoke rises following an airstrike in Gaza, as seen from southern Israel, amid the ongoing conflict between Israel and the Palestinian group Hamas, November 16, 2023\nA picture taken from the border between Israel and Gaza shows heavily destroyed buildings in the Gaza Strip on November 16, 2023\nThis handout picture released by the Israeli army on November 16, 2023, shows troops during a military operation in the Gaza Strip\nIsraeli soldiers operate, amid the ongoing ground operation of the Israeli army against Palestinian Islamist group Hamas, in the Gaza Strip as seen in a handout picture released on November 15, 2023.\nIsraeli soldiers operate, amid the ongoing ground operation of the Israeli army against Palestinian Islamist group Hamas, in the Gaza Strip, in this handout picture released on November 15, 2023\nThis handout picture released by the Israeli army on November 16, 2023, shows troops during a military operation in the Gaza Strip amid continuing battles between Israel and the Palestinian terrorist group Hamas\nSmoke billows following an Israeli strike on Khan Yunis in the southern Gaza strip on Novembr 16, 2023\nAn Israeli security force officer fires a sponge grenade as the army surrounds the area of a Palestinian home, believed to belong to one of the gunmen that attacked an Israel checkpoint on the edge of Jerusalem earlier in the day, during a military operation in the occupied West Bank city of Hebron on November 16, 2023\nAn Israeli security force officer takes position as they surround the area of a Palestinian home, believed to belong to one of the gunmen that attacked an Israel checkpoint on the edge of Jerusalem earlier in the day, during a military operation in the occupied West Bank city of Hebron on November 16, 2023\nAn Israeli tank takes position near the border with the Gaza Strip in Southern Israel on November 16, 2023\nThis handout picture released by the Israeli army on November 16, 2023, shows troops during a military operation in the northern Gaza Strip\nIsraeli soldiers take part in an operation in a location given as the Port of Gaza, in this handout image released on November 16, 2023\nIsraeli forces battled terrorists outside the hospital for days but there were no reports of terrorists firing from inside Al-Shifa, or of any fighting within the hospital after Israeli troops entered.\nAt one point, tens of thousands of Palestinians fleeing Israeli bombardment were sheltering at Al-Shifa, but most left in recent days as the fighting drew closer.\nThe Health Ministry said 40 patients, including three babies, have died since Al-Shifa's emergency generator ran out of fuel on Saturday. There was no word on the condition of another 36 babies, who the ministry said earlier were at risk of dying because there is no power for incubators.\nThe leaflets, dropped in areas east of the southern town of Khan Younis, warned civilians to evacuate and said anyone in the vicinity of terrorists or their positions 'is putting his life in danger'.\nSimilar leaflets were dropped over northern Gaza for weeks ahead of the ground invasion.\nDefence Minister Yoav Gallant said on Wednesday the ground operation will eventually 'include both the north and south. We will strike Hamas wherever it is'.\nThe military says it has largely consolidated its control of the north, including seizing and demolishing government buildings. Video released by the army today showed soldiers moving between heavily damaged buildings through holes blown in their walls.\nThe military said it had blown up a residence belonging to Ismail Haniyeh, a senior Hamas leader based abroad. It was unclear if anyone was inside the building.\nPalestinian families who escaped the Israeli attacks are sheltering in tents near Nasser Hospital, as Israeli army's attacks continue on its 40th day in Khan Yunis, Gaza on November 15, 2023\nDisplaced Palestinians walk near their tents after arainy night at a temporary camp provided by the United Nations Development Program (UNDP) for displaced Palestinians who lost their homes in Israeli strikes, in Khan Yunis, 15 November 2023\nDisplaced Palestinians stand in front of their tent as people inspect the damage caused by rain on November 15, 2023 in Khan Yunis, Gaza. on November 15\nA woman sits in a tent as Palestinians try to fortify their tents, located near the Al-Aqsa Martyrs Hospital, with limited means to protect themselves from the cold and rainy weather in Khan Yunis, Gaza on November 14, 2023\nDisplaced Palestinians set up tents in the yard of a UN-run school in Rafah, Gaza Strip, during ongoing Israeli bombardment on Wednesday, Nov. 15, 2023\nWith most of Gaza's 2.3 million people crowded into the territory's south, residents say bread is scarce and supermarket shelves are bare. Families cook on wood fires for lack of fuel. Central electricity and running water have been out for weeks.\nThe worsening fuel shortage threatens to paralyse the delivery of humanitarian services and shut down mobile phone and internet service.\nIsrael allowed a small amount of fuel to enter Gaza on Wednesday, for the first time since the war began, so that the UN agency for Palestinian refugees could continue bringing limited supplies of aid.\nThe fuel cannot be used for hospitals or to desalinate water, and covers less than 10 per cent of what the agency needs to sustain 'lifesaving activities', said Thomas White, the agency's Gaza director.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel warns Palestinians to evacuate parts of southern Gaza - where hundreds of thousands gathered after fleeing the north - as soldiers continue to search Al-Shifa hospital", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12756889/Israel-warns-Palestinians-evacuate-parts-southern-Gaza-hundreds-thousands-gathered-fleeing-north-soldiers-continue-search-Al-Shifa-hospital.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}