{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:38:32", "date_modify": "None", "date_publish": "2023-11-16 18:04:51", "description": "EU foreign affairs chief says ‘one horror does not justify another’ and calls for unconditional release of hostages", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F16%2Fjosep-borrell-israel-response-hamas-attacks-eu.json", "image_url": "https://i.guim.co.uk/img/media/7dde23ee3a4edc2bb2e00ea5a0c28406b3b34540/0_274_8192_4915/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9aaa685133a46a1105e1c92d15e7ca3", "language": "en", "localpath": null, "maintext": "The EU foreign affairs chief, Josep Borrell, has urged Israel not to be “consumed by rage” in its response to the Hamas attacks of 7 October as the French president, Emmanuel Macron, acknowledged splits in Europe on the conflict.\nSpeaking from Kibbutz Be’eri – where at least 85 of the 1,200 people killed that day died and from where about 30 of the more than 240 were kidnapped – Borrell said “Israel must be defended”, but, “one horror does not justify another: innocent civilians, including thousands of children, have died in recent weeks.\n“I understand your fears and your pain. I understand your rage. But let me ask you not to let yourself be consumed by rage.”\nThe diplomat also called for the “immediate and unconditional release” of those taken hostage by Hamas that day.\nMacron, who was visiting Switzerland, urged an “immediate truce leading to a humanitarian ceasefire”, but admitted that “there is not a united position, to be honest, at the European level”.\nThe French foreign ministry spokesperson, Anne-Claire Legendre, meanwhile, accused Israeli settlers of a policy of terror in the West Bank aimed at displacing Palestinians, and urged Israeli authorities to protect Palestinians from the violence.\nThe warnings contrasted with Joe Biden, speaking after talks on Wednesday with the Chinese president, Xi Jinping, who defended his refusal to call for a ceasefire in Gaza. The US president said Hamas represented a continuing threat to Israel and that Israeli forces were seeking to avoid civilian casualties. He said Israeli attacks would not stop until Hamas was no longer able to murder civilians.\n00:01:39 Biden defends rejecting calls for ceasefire: Hamas 'plan on attacking Israel again' – video\nBiden also said al-Shifa hospital in Gaza City, which Israeli troops had entered earlier that day, had contained a Hamas underground command centre, justifying the raid – a claim repeated by the White House spokesperson John Kirby on Thursday.\nBiden said it was likely Hamas activity existed at other hospitals in Gaza.\nThe heads of all the main UN agencies meanwhile announced they would not participate in helping citizens of Gaza be forced into Israeli-designated “safe zones” unless such zones had been agreed with all the parties, saying otherwise “they could cause large-scale loss of life”.\nIn a joint statement, the 18 heads of the main UN agencies said: “Without the right conditions, concentrating civilians in such zones in the context of active hostilities can raise the risk of attack and additional harm. No ‘safe zone’ is truly safe when it is declared unilaterally or enforced by the presence of armed forces.\n“Any discussions around ‘safe zones’ must not detract from the parties’ obligation to take constant care to spare civilians – wherever they are – and meet their essential needs, including by facilitating rapid, safe and unhindered humanitarian access to all civilians in need.”\nThe head of the UN Palestinian refugee agency, Philippe Lazzarini, said separately he believed there was a deliberate attempt to “strangle” its humanitarian work in Gaza, warning that the agency may have to suspend its operations entirely due to a lack of fuel. He said the organisation had pleaded for weeks for access to fuel, which was transported into Gaza on Wednesday for the first time since the start of Israel’s war with Hamas, but it was nowhere near what Palestinians in the territory needed to survive.\nUN commissioner says killing of Gaza civilians cannot be dismissed as 'collateral damage' – video\nIsraeli forces had dropped leaflets telling Palestinians to flee parts of southern Gaza, residents told the Associated Press on Thursday, signalling a possible expansion of operations to areas where hundreds of thousands of people who heeded earlier evacuation orders in the north are crowded.\nThe leaflets, dropped in areas east of the southern town of Khan Younis, told civilians to evacuate the area and said anyone in the vicinity of militants or their positions was putting their life in danger.\nSome western officials said they feared that with more than 1.5 million Palestinians displaced from their homes in Gaza, they were going to be forced into tent cities in the south of the strip and this would put them under pressure to leave Gaza altogether, making their displacement “voluntary”.\nThe UN secretary general, António Guterres, is expected to ask Israel to formally accept a resolution passed by the UN security council calling on Israel to accept a humanitarian pause of sufficient duration to allow aid to enter the country.\nBrett Jonathan Miller, Israel’s deputy permanent representative, rejected the resolution, saying it was “detached from the reality on the ground”. But Israel will feel relieved by the degree of continued support that its military received from Biden, who argued that Israeli forces had switched from aerial bombardment, which he seemed to acknowledge had been indiscriminate in parts, to more targeted ground operations, after more than 11,000 Palestinians are reported to have died.\nHe said: “It is not carpet bombing. This is a different thing. They’re going through these tunnels, they’re going into the hospital. They’re also bringing in incubators or bringing in other means to help people in the hospital, and they’ve given, I’m told, the doctors and nurses and personnel the opportunity to get out of harm’s way. So this is a different story than I believe was occurring before, the indiscriminate bombing.”\n00:01:50 Israeli forces enter al-Shifa hospital in Gaza – video report\nWestern media on Thursday were poring over Israel’s decision to send troops into Shifa hospital in Gaza, and assessing the evidence the Israeli military had so far uncovered in support of its claim Hamas had used the hospital as a command centre. On Wednesday, the Israel Defense Forces released a video that they said showed some of the material recovered from a building in the hospital complex, including automatic weapons, grenades, ammunition and flak jackets.\nLt Col Jonathan Conricus, IDF spokesperson, told the BBC’s World at One: “Hamas unfortunately has had time to prepare for our advance. It has taken us time to get there. This time, it looks like, has been put into good use by Hamas to cover its tracks. This does not mean we will not find their infrastructure because they can take away mobile items like guns. We found a few yesterday in one of the clinics.”\nHe added the IDF had not yet searched the whole area and was looking for the access points to the underground infrastructure. “We are looking for tunnels within the compound and we will expand our searches, and I think in maybe a few days’ or weeks’ time we will be able to expose exactly what was or is under Shifa,” he said.\nHamas denied the claim, which it said was “nothing but a continuation of the lies and cheap propaganda through which [Israel] is trying to give justification for its crime aimed at destroying the health sector in Gaza”.\nIt is widely accepted that Hamas has an extensive tunnel network across Gaza.\nAdditional reporting by Emine Sinmaz and Jason Burke in Jerusalem, and Julian Borger in Washington", "source_domain": "www.theguardian.com", "text": null, "title": "EU foreign affairs chief tells Israel not to be ‘consumed by rage’ in response to Hamas attacks", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/16/josep-borrell-israel-response-hamas-attacks-eu"}