{"authors": ["Richard Ashmore"], "date_download": "2024-02-05 15:16:14", "date_modify": "None", "date_publish": "2024-01-23 17:26:00", "description": "Officials said it could take '24 to 36 months' to make the ammunition to replenish stock and help Ukraine fight Russia.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1859021%2Fnato-ukraine-weapons-war-russia.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5177863.jpg", "language": "en", "localpath": null, "maintext": "NATO leader Jens Stoltenberg and President Zelensky of Ukraine\nNATO has signed a £950 million deal to ramp up ammunition production which could help Ukraine fight against invading Russian forces, but the ordnance could take years to arrive. On Tuesday the almost one billion pound contract was signed to to make tens of thousands of artillery rounds to replenish the dwindling stocks of NATO member countries, and to further supply Ukraine. The contract will allow for the purchase of 220,000 rounds of 155-millimetre ammunition, the most widely sought after artillery shell, according to NATO’s support and procurement agency. NATO Secretary-General Jens Stoltenberg said: \"This is important to defend our own territory, to build up our own stocks, but also to continue to support Ukraine. \"We cannot allow President (Vladimir) Putin to win in Ukraine, that would be a tragedy for the Ukrainians and dangerous for all of us.”\nUkrainian soldiers firing a Swedish-made Howitzer battery\nUkraine was firing around 4,000 to 7,000 artillery shells each day last summer, while Russia was launching more than 20,000 shells daily in its neighbour’s territory, according to European Union estimates. Russia’s arms industry far outweighs Ukraine’s and Kyiv needs help to match Moscow’s firepower. But the shells will not arrive quickly, delivery on orders takes anywhere from 24 to 36 months, the NATO agency said. The European Union plans to produce one million artillery rounds for Ukraine have fallen short, with only about a third of the target met. Senior EU officials have said that they now expect the European defense industry to be producing around one million shells annually by the end of this year.\nRussia has carried out drone and missile attacks on civilian infrastructure\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "NATO signs £950million arms deal to help Ukraine - but it won't be of any use until 2025", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1859021/nato-ukraine-weapons-war-russia"}