{"authors": ["Emine Sinmaz"], "date_download": "2024-02-05 15:38:33", "date_modify": "None", "date_publish": "2023-11-16 20:51:58", "description": "Yehudit Weiss, abducted from Be’eri kibbutz by Hamas, found dead in building next to hospital after raid", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F16%2Fisrael-body-of-hostage-recovered-yehudit-weiss-al-shifa-hospital.json", "image_url": "https://i.guim.co.uk/img/media/313b04f7975fa0804300894e814dd88414154146/0_128_1176_706/master/1176.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ecea683d24350c8619faa1b91cef85b9", "language": "en", "localpath": null, "maintext": "The Israeli military has recovered the body of an Israeli hostage from a building near al-Shifa hospital in Gaza City, as soldiers continued to search the hospital complex after Wednesday’s early morning raid.\nYehudit Weiss, a 65-year-old woman, was abducted from the Be’eri kibbutz by Hamas militants during their attack on southern Israel on 7 October, in which at least 1,200 people were killed and more than 240 taken hostage. She had been undergoing cancer treatment.\n“The body of Yehudit Weiss, who was abducted by the Hamas terrorist organisation, was extracted by IDF troops from a structure adjacent to the Shifa hospital in the Gaza Strip and was transferred to Israeli territory,” a spokesperson for the Israel Defense Forces said late on Thursday.\n“In the structure in which Yehudit was located, military equipment including Kalashnikov rifles and RPGs were also found,” the spokesperson added.\nWeiss’s husband, Shmulik, was killed during the Hamas attack.\nThe IDF also said it had uncovered a Hamas tunnel shaft and a vehicle with weapons at the Dar al-Shifa hospital complex.\n“In the Shifa hospital, IDF troops found an operational tunnel shaft and a vehicle containing a large number of weapons,” the military said. It made public videos and photographs of the tunnel shaft and weapons, though no independent verification was possible.\nIsrael dropped leaflets into southern Gaza, telling Palestinian civilians to leave four towns on the eastern edge of Khan Younis, fuelling fears that its offensive would spread south.\nPeople in Bani Shuhaila, Khuza’a, Abassan and al-Qarara were told that anyone in the vicinity of militants or their positions was “putting his life in danger”.\nIsrael’s army chief said forces were close to destroying what he described as the military system that existed in northern Gaza, a day after the IDF entered the Shifa hospital compound.\nThe US president, Joe Biden, speaking late on Wednesday, defended his refusal to call for a ceasefire in Gaza, arguing that Hamas represented a continuing threat to Israel and that Israeli forces were seeking to avoid civilian casualties.\nHe said Israeli forces had switched from aerial bombardment, which he seemed to acknowledge had been indiscriminate in parts, to more targeted ground operations, after more than 11,000 Palestinians were reported to have died.\n“It is not carpet bombing. This is a different thing. They’re going through these tunnels, they’re going into the hospital,” he said after talks with the Chinese president, Xi Jinping.\n00:01:39 Biden defends rejecting calls for ceasefire: Hamas 'plan on attacking Israel again' – video\nThe White House national security spokesperson John Kirby said on Thursday that the US was confident in its intelligence assessment that Hamas used the hospital as a command centre.\nIsrael has so far released pictures of what it says were rifles and flak jackets found on the premises, but no evidence of a vast underground Hamas command headquarters it said was operating in tunnels beneath it.\nAn IDF official said on Thursday that troops were still inside the hospital complex, searching one building at a time in “a discrete, methodical and thorough manner”.\nThe official said the IDF had located weapons, intelligence material, military technologies and equipment, command and control centres and communications equipment belonging to Hamas. They added that information and footage about the hostages abducted from Israel were found on computers and other technological equipment.\nOn Wednesday, Hamas described Israel’s claims that military equipment had been found as “nothing but a continuation of the lies and cheap propaganda, through which [Israel] is trying to give justification for its crime aimed at destroying the health sector in Gaza”.\nThe Hamas-run health ministry said IDF troops were searching the underground levels of Shifa hospital and detaining technicians responsible for running its equipment.\nTens of thousands of people have fled from north to south Gaza in recent weeks, crowding into UN-run shelters and family homes in Khan Younis, the biggest city in the south, amid the offensive.\nThe UN’s human rights chief, Volker Türk, said that five weeks into the war, “massive outbreaks of infectious disease, and hunger” seemed inevitable in the densely populated Palestinian territory.\nHe predicted catastrophic consequences if fuel supplies ran out, including the collapse of sewage systems and healthcare and an end to the already scarce supplies of humanitarian aid.\nUN commissioner says killing of Gaza civilians cannot be dismissed as 'collateral damage' – video\nThe head of the UN’s agency for Palestinian refugees, Philippe Lazzarini, said he feared for civil order in Gaza after it was hit with a new communications blackout on Thursday.\nHe added that he believed there was a deliberate attempt to “strangle” the agency’s humanitarian work in Gaza, warning that it may have to entirely suspend its operations due to a lack of fuel.\nThe director of the Shifa hospital, Muhammad Abu Salmiya, told the BBC that the hospital was packed with 650 patients and about 5,000 displaced people and that it had run out of oxygen and water. “The conditions are tragic and those in the hospital are screaming from thirst,” he said.\nMunir al-Boursh, a senior official inside the hospital, said troops ransacked the basement and other buildings and questioned and face-screened patients, staff and people sheltering in the facility, the Associated Press reported.\nHundreds of patients inside Shifa, including newborn babies, have suffered for days without electricity and other basic necessities.\nThe hospital has become a strategic objective for Israel, which says there is a Hamas command centre in bunkers underneath, which Hamas and hospital staff deny.\nThe Palestinian Red Crescent said Israeli tanks were laying siege to Gaza’s al-Ahli hospital and that a “violent attack” was under way. “Teams are unable to move and reach those who are injured,” the organisation said.\n00:01:38 Gaza City before and after: footage shows destruction wreaked by war – video\nOn Thursday morning, the IDF said Israeli fighter jets had struck the house of the Hamas leader, Ismail Haniyeh, in Gaza. In a social media post that included a video said to show the strike, the IDF said the home “was used as terrorist infrastructure and a meeting point for Hamas’s senior leaders to direct terrorist attacks against Israel”.\nTwo-thirds of the Gaza Strip’s population of 2.3 million people have been made homeless by the war and every available space in Khan Younis and other southern towns is crammed.\nMohammed Ghalayini, 44, a civil servant from Manchester who is in the centre of Khan Younis, said there was a housing crisis across the city.\n“There’s been a massive influx of people,” he said. “It’s the biggest place and it’s the place where there’s more potential to find somewhere to stay.\n“There’s a massive housing crisis. Every day three people that I know call me saying ‘Can you help me find a place?’ and it’s really hard, because there are no places. Even if you have the space, it’s whether it can support people in terms of water and sanitation.”\nMore than 11,200 Palestinians have been killed in Gaza, two-thirds of them women and children, according to the Palestinian health authorities. Another 2,700 have been reported missing, with most believed to be buried under the rubble.\nThe Israeli army on Thursday announced the deaths of two more soldiers in Gaza, increasing the number of troops killed in the territory to 50 since the start of the war.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel says body of hostage recovered near al-Shifa hospital", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/16/israel-body-of-hostage-recovered-yehudit-weiss-al-shifa-hospital"}