{"authors": ["Tim Sigsworth", "Verity Bowman"], "date_download": "2024-02-05 15:38:37", "date_modify": "None", "date_publish": "2023-11-16 00:00:00", "description": "Israeli soldiers have found a Hamas tunnel and booby-trapped pick-up truck at the Al Shifa hospital, the Israel Defense Forces (IDF) said.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F11%2F16%2Fisrael-gaza-latest-news-updates-hamas-palestine-day-41-live%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/11/16/TELEMMGLPICT000356977586_17001694820290_trans_NvBQzQNjv4Bqsj0L0GjYiWx40bFe6BeEOHPCk54to1rh0uTSjSdmHpg.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Israeli soldiers have found a Hamas tunnel and booby-trapped pick-up truck at the Al Shifa hospital, the Israel Defense Forces (IDF) said.\n“In the Shifa Hospital, IDF troops found an operational tunnel shaft and a vehicle containing a large number of weapons,” the IDF said on Thursday.\nVideo footage released by the Israeli military showed guns, ammunition and grenades laid out on a tarpaulin outside the hospital.\nIt came as the body of Israeli hostage Yehudit Weiss, a 65-year-old mother-of-five, was discovered nearby. “Military equipment including Kalashnikov rifles and RPGs” were found in the same location, the IDF said.\nIsrael claims Hamas has operated a base underneath Al Shifa, the largest hospital in the Gaza Strip. Hamas denies it.\nThe hospital has said 650 patients and 5,000 displaced Palestinians remain inside the hospital, which the World Health Organisation (WHO) has said is no longer functioning.\nFollow the latest updates below and join the conversation in the comments section.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Hamas tunnel and booby-trapped car found at Al Shifa hospital, IDF claims", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/11/16/israel-gaza-latest-news-updates-hamas-palestine-day-41-live/"}