{"authors": [], "date_download": "2024-02-05 15:38:39", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Former British Prime Minister David Cameron is returning to politics as Foreign Secretary after a rotation in the government. British Prime M", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031864%2Fdavid-cameron-is-back-in-politics.json", "image_url": "https://static.midwestradionetwork.com/story_logos/premier/the-uk-news.jpg", "language": "en", "localpath": null, "maintext": "Former British Prime Minister David Cameron is returning to politics as Foreign Secretary after a rotation in the government.\nBritish Prime Minister Rishi Sunak has after days of speculation about her future.\nBraverman found herself at the center of several public debates. Last week she defied Rishi Sunak by publishing an article criticizing the police for applying \"double standards\" in their response to a pro-Palestinian demonstration last Saturday.\nMore than 140 people were arrested at the demonstration after far-right counter-protesters clashed with police trying to keep them away from 300,000 pro-Palestinian demonstrators. Critics say Braverman's stance has contributed to increasing tensions over the issue, which has forced Sunak to take action.\nBraverman's dismissal was followed by the resignation of two ministers - Health Secretary Neil O'Brien and Education Secretary Nick Gibb. Braverman was replaced by former Foreign Secretary James Cleverly, and David Cameron takes over his post.\nCameron became Prime Minister in 2010 and ruled until 2016. He was 43 years old - the youngest Prime Minister in UK history. He went down in history when the prime minister called a referendum on Britain's exit from the European Union, even though he himself campaigned in support of membership.\nCopyright (c) Novinite.com. Published with permission via Big News Network news agency", "source_domain": "www.theuknews.com", "text": null, "title": "David Cameron is Back in Politics", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031864/david-cameron-is-back-in-politics"}