{"authors": [], "date_download": "2024-02-05 15:38:39", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Following a contentious discussion with talk show host Piers Morgan on Monday, former leader of the UK Labour Party Jeremy Corbyn declined to designate Hamas as", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274032373%2Fhamas-is-terror-group-newly-appointed-uk-home-secy-james-cleverly-confirms.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699956691.jpg", "language": "en", "localpath": null, "maintext": "London [UK], November 14 (ANI): Following a contentious discussion with talk show host Piers Morgan on Monday, former leader of the UK Labour Party Jeremy Corbyn declined to designate Hamas as a terrorist organisation, however, the newly appointed Home Secretary James Cleverly \"confirmed\" Hamas as a terror group.\nPosting a video of Jeremy Corbyn getting involved in a heated debate with talk show host Piers Morgan on X (formerly Twitter), Cleverly wrote, \"As Home Secretary, I can confirm that Hamas is a terror group.\"Cleverly's reactions came after a video surfaced that showed Morgan repeatedly asking the far-left politician if the Palestinian militants who conducted a catastrophic attack on Israel last month were terrorists, but he wouldn't respond directly. It happened during a \"Piers Morgan Uncensored\" programme.\n\"Are they a terror group?\" Morgan asked the former UK Labour Party leader.\n\"Everybody knows what they are,\" the member of Parliament replied to the TalkTV host.\n\"Are they a terror group?\" Morgan asked again. \"Can you say it? Can you say it? Can you call them a terror group?\" The New York Post reported.\n\"Is it possible to have a rational discussion with you?\" Corbyn told Morgan following his repeated questioning.\nMorgan persisted in inquiring about Hamas, while Corbyn attempted to push for a cease-fire. The two then got into a full-blown yelling war, the New York Post reported.\nWhen Morgan questioned the former party leader about whether he thought Hamas should continue to rule Gaza, he responded by saying, \"It's not up to you or me.\"The opposition party in Britain suspended Corbyn in 2020 for not acknowledging the truth about a critical study regarding his treatment of antisemitism concerns.\nAccording to the investigation, Corbyn's staff handled the accusations in an \"inexcusable\" way, violating equality regulations. He spoke at and attended a sizable pro-Palestinian demonstration over the weekend, the New York Post reported. (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "\"Hamas is terror group\": Newly appointed UK Home Secy James Cleverly confirms", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274032373/hamas-is-terror-group-newly-appointed-uk-home-secy-james-cleverly-confirms"}