{"authors": [], "date_download": "2024-02-05 15:38:40", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The U.S. dollar lost in late trading on Monday, as the market is awaiting the upcoming U.S. inflation data, which is anticipated to provide crucial in.....", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031810%2Fus-dollar-ticks-down-as-markets-await-inflation-data.json", "image_url": "https://static.midwestradionetwork.com/story_logos/premier/the-uk-news.jpg", "language": "en", "localpath": null, "maintext": "NEW YORK, Nov. 13 (Xinhua) -- The U.S. dollar lost in late trading on Monday, as the market is awaiting the upcoming U.S. inflation data, which is anticipated to provide crucial insights into the Federal Reserve's future actions in managing inflationary pressures.\nThe dollar index, which measures the greenback against six major peers, fell 0.21 percent to 105.6405 in late trading.\nTraders are closely monitoring the upcoming release of the U.S. consumer price index (CPI) scheduled for Tuesday. These figure plays a crucial role in determining whether the Fed needs to strengthen its measures against inflation.\nMeanwhile, U.S. government services would be disrupted and hundreds of thousands of federal workers would be told not to work if Congress failed to extend funding as of Nov. 17.\nMoody's on Friday lowered its outlook on the U.S. credit rating to \"negative\" from \"stable\" citing large fiscal deficits and a decline in debt affordability.\nIn late New York trading, the euro increased to 1.0702 U.S. dollars from 1.0679 U.S. dollars in the previous session, and the British pound was up to 1.2277 U.S. dollars from 1.2217 U.S. dollars.\nThe U.S. dollar bought 151.5970 Japanese yen, higher than 151.5840 Japanese yen of the previous session. The U.S. dollar shed to 0.9016 Swiss francs from 0.9027 Swiss francs, and it slipped to 1.3799 Canadian dollars from 1.3810 Canadian dollars. The U.S. dollar fell to 10.8390 Swedish krona from 10.9151 Swedish krona.", "source_domain": "www.theuknews.com", "text": null, "title": "U.S. dollar ticks down as markets await inflation data", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031810/us-dollar-ticks-down-as-markets-await-inflation-data"}