{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:38:42", "date_modify": "None", "date_publish": "2023-11-16 04:38:29", "description": "Shocking video shows the violence of a Hamas terrorist as the group began their shock sunrise attack on October 7 that has killed over 1,200 people and sparked new tensions in the region.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12755561%2Fhamas-body-cam-footage-october-7-attack-israel.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/04/77862557-0-image-a-8_1700109141143.jpg", "language": "en", "localpath": null, "maintext": "The video, released by the Israeli Defense Forces, shows multiple terrorists in various stages of the surprise invasion\nShocking video shows the violence of a Hamas terrorist as the group began their shock sunrise attack on October 7 that has killed over 1,200 people and sparked new tensions in the Middle East.\nThe video, released by the Israeli Defense Forces, shows multiple terrorists in various stages of the surprise invasion that led to Hamas killing civilians at the SuperNova music festival and several kibitzes.\nThe clips - the first from this angle released since the attack - also show Hamas members celebrating over the dead bodies of civilians and gives a peak into their underground tunnel network.\nIt begins on the morning of the attack, as a group of militants are sprung to life by an explosion. The group makes multiple shouts of 'Allahu Akbar!' translated to 'God is great' in Arabic.\nAt least one of the members made sure they were recording. The video was recovered and released by the IDF to show the horrors of what happened to spark the ongoing Israel-Hamas conflict that has led to more than 10,000 deaths.\nShocking video shows the violence of a Hamas terrorist as the group began their shock sunrise attack on October 7 that has killed over 1,200 people and sparked new tensions in the Middle East\nThe footage also shows the group of terrorists crossing the notoriously destroyed fence meant to keep them on Gaza's eastern border. After crossing a second security fence, they begin to head toward a kibbutz along the dirt roads, according to CNN.\nThe soldiers are carrying AK-47s and other weapons, including missiles and rocket-propelled grenades.\nEventually, they open fire before wondering where the Israeli soldiers are, having seen none as they've continued their invasion.\nThey continue to thank God while one of the men warns not to waste bullets by firing into the air in celebration.\nThe footage shows them firing as they advance and hitting an Israeli soldier at point blank-range with rounds of bullets.\nThe gunman grabs the soldier's rifle before turning the video on himself to lead a celebration over the dead fighter's body, before the Hamas member introduces himself and saying he's 24 years old.\nThe brief clip of the underground tunnel shows pathways to a smaller network of tunnels with wire running through and supplies and barrels across the ground.\nThe video, released by the Israeli Defense Forces, shows multiple terrorists in various stages of the surprise invasion that led to Hamas killing civilians at the SuperNova music festival and several kibitzes\nIt begins on the morning of the attack, as a group of militants are sprung to life by an explosion. The group makes multiple shouts of 'Allahu Akbar!' translated to 'God is great' in Arabic\nAnother clip shows dashcam footage from an Israeli vehicle trying to get away from the missiles near the festival. Eventually, the footage details the driver has been fatally shot.\nFrom here, the Hamas terrorists advance on motorbikes, speeding along nearly empty Israeli roads.\nEventually, one of the Hamas gunman is shown to have been killed on the video footage by someone at an Israeli base, after opening firing on the base, the fighter is stuck and falls to the ground screaming in pain.\nHis gun sits on the ground next to him as he supposedly dies after making the nearly 10-mile journey.\nWhile this is the first public footage of this part of the attack, Israel has started to release longer clips to politicians.\nThe footage depicts the murders of 138 people from October 7, less than a 10th of the 1,400 who were killed. More than 240 people were taken hostage, including many from a music festival that was being held.\nAside from a handful of propaganda released by Hamas, officials still have no solid information about the health of the hostages taken.\n'We have some that we cannot share but it is largely a black hole. We know some have been split in groups, but we don't know how. All we know is they are underground,' Ezra said.\nThe officials lamented the fact that while the world calls for a humanitarian pause for Gazans, no help has been given for the hostages.\nThe Hamas attackers were heavily armed and some of their weapons are shown in the new footage\nAnother clip shows dashcam footage from an Israeli vehicle trying to get away from the attack near the festival. Eventually, the footage shows the driver likely being killed\nThe footage showed several people dead in the road as Hamas attackers continued to advance\nThe clips also show Hamas members celebrating over the dead bodies of civilians and gives a peak into their underground tunnel network\nThe brief clip of the underground tunnel shows pathways to a smaller network of tunnels with wire running through and supplies and barrels across the ground\nWhile this is the first public footage of the attack, Israel has started to release longer clips to politicians. The footage ends with one of the fighters approaching a military base\nThe footage ends with a solider struck and falling to the ground with his gun next to him, where he reportedly died\n'Humanitarian aid is a two way street. Everyone is calling for humanitarian aid to Gaza but we do not even have the most basic information about our hostages. Why can't the Red Cross be allowed in to ensure they are being fed and have access to medication?' Itay Milner, spokesperson for the Israeli Consulate said.\nThe officials do not intend to release the video to the public to protect the victims' families.\nTheir hope is however to show it to enough international journalists to dismiss misinformation that it is fake, and explain the ongoing military campaign.\nThe war between Israel and Hamas erupted on October 7 after the militant group killed some 1,200 people. Meanwhile, Israeli airstrikes have killed more than 11,200 people, according to the Palestinian Health Minister in Ramallah.\nAnother 2,700 have been reported missing.\nAround two third of the territory's 2.3 million people have now fled their homes, with most currently residing in the southern part of the coastal strip.\nResidents say bread is scarce and supermarket shelves are bare, while families have been forced to cook on wood fires due to a lack of fuel, electricity and running water.\nOn Wednesday, Israeli defense officials let in some 24,000 liters of fuel, which will only be used for the UN agency for Palestinian refugees, known as UNRWA, in a bid to bring in the limited supplies of food and medicine from Egypt.\nPalestinians inspect the damage of a destroyed mosque following an Israeli airstrike in Khan Younis refugee camp on November 8\nIsraeli army troops are seen next to a destroyed building during a ground operation in the Gaza Strip on November 8\nIsraeli forces have been pushing deeper in to Gaza in recent days. On Wednesday, Israel claimed to have found 'concrete' evidence that Gaza's biggest hospital Al Shifa was being used as a terrorist base after hundreds of commandos raided it early yesterday.\nThe IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base, with spokesman Lt Col Jonathan Conricus showing a duffel bag hidden behind a hospital MRI machine containing an AK-47, grenades, ammunition and a uniform.\nHe also said a backpack contained 'what appeared to be very important intelligence including a laptop', and added that security cameras in one part of the hospital had been taped over.\nBehind another MRI machine more weapons were said to have been found and in an adjoining room on top of another MRI scanner was a bag containing 'full military kit for one terrorist, including ammunition, a live grenade and AK47 and body armour'.\n'These weapons have no business being in a hospital,' Conricus said as he toured the hospital in a clip released by the IDF.\nInside a cabinet for medical equipment was another holder containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman.\nBut the IDF's search showed no signs of tunnels or a sophisticated command center that many believed would be discovered underneath the facility.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Dramatic body cam shows the moments Hamas terrorists launched their sunrise attack on Israel slaughtering police and 1,200 civilians along the road others and sparked the ongoing war", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12755561/hamas-body-cam-footage-october-7-attack-israel.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}