{"authors": [], "date_download": "2024-02-05 15:38:44", "date_modify": "None", "date_publish": "2023-11-16 09:04:37", "description": "Officials say more than half of the estimated 5,000 refugees who had fled the heavy fighting in Myanmar’s western Chin state and had entered northeastern India have begun returning home", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmyanmar-ap-india-refugees-chin-b2448309.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/09/India_Mizoram_Myanmar_87787.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nMore than half of the estimated 5,000 refugees who had fled the heavy fighting in Myanmar’s western Chin state and had entered northeastern India have begun returning home, Indian officials said Thursday.\nSunday and Monday saw heavy fighting between the rebels and the Myanmar military in the Chin state across the border from Zokhawthar, a village of around 600 households, in India's Mizoram state. The military junta lost control of some areas after rebels, largely belonging to the Chin National Front, seized two military posts.\n“Since Wednesday, we have not heard sounds of airstrikes or gunfire across the border. We presume the situation across Mizoram border in Myanmar is returning to normal, leading to most of the 5,000 refugees returning back,” James Lalrinchhana, the Deputy Commissioner of Champhai district in Mizoram, told The Associated Press.\nThe fighting also forced 40 troops from the Myanmar army to cross over and take shelter in India.\nThe troops crossed to India on Monday, and the Indian Air Force airlifted them back to Myanmar the next day, according to an Indian defense official who requested anonymity because he wasn’t authorized to speak publicly.\nIndia shares a 1,643-kilometer (1,020-mile) border with Myanmar, and is home to thousands of refugees from Myanmar in different states.\nThe Arakan Army, one of the many ethnic insurgent groups active in Myanmar, along with the Myanmar National Democratic Alliance Army and the Ta’ang National Liberation Army, launched a coordinated offensive on Oct. 27 in northern Shan state in northeastern Myanmar along the border with China.\nThe groups called themselves the \"Three Brotherhood Alliance.\"\nThe alliance has claimed widespread victories and Myanmar's military government has acknowledged losing control of three towns, including a major border crossing for trade with China.\nThe attacks took place despite a yearlong cease-fire with Myanmar’s military government, which the Arakan Army called off Tuesday.\nThe Arakan Army is the well-trained and well-armed military wing of the Rakhine ethnic minority movement seeking autonomy from the central government.\nRakhine is also known by its older name of Arakan. It’s the site of a brutal army counterinsurgency operation in 2017 that drove about 740,000 minority Rohingya Muslims to seek safety across the border in Bangladesh.\nAnti-junta rebels across Myanmar appear to have been emboldened to target symbols of the junta-led government in Myanmar, experts say.\n“Forces like the CNF were obviously monitoring the situation in the northern Shan state bordering China where the rebels were attacking the government soldiers. Rebels in the western Chin state, bordering India, also intensified their offensive,” said Arunav Goswami, a researcher with the Guwahati-based Centre for Development and Peace Studies.\nThe offensive in the northern part of Shan state was already seen as a significant challenge for the army, which has struggled to contain a nationwide uprising by the members of Peoples’ Defense Force. The pro-democracy resistance organization was formed after the army seized power from Aung San Suu Kyi’s elected government in February 2021. It also set up loose alliances with several of the ethnic armed groups.", "source_domain": "www.independent.co.uk", "text": null, "title": "Refugees who fled to India after latest fighting in Myanmar have begun returning home, officials say", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/myanmar-ap-india-refugees-chin-b2448309.html"}