{"authors": [], "date_download": "2024-02-05 15:16:15", "date_modify": "None", "date_publish": "2024-01-23 21:15:38", "description": "Deaths come as fighting intensifies around the largest city in southern Gaza", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-hamas-gaza-idf-attack-death-toll-b2483061.html.json", "image_url": "https://static.independent.co.uk/2024/01/23/06/2024-01-20T084850Z_1829959457_RC2JL5AK4Y9O_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nTwenty-four Israeli soldiers have been killed in Gaza during what Israel’s military called the single deadliest day for the army since the war on Hamas began more than 100 days ago. Twenty-one of the soldiers died in an explosion that is likely to have been caused by mines that Israeli forces had placed in two buildings to demolish them, the military said, blaming fire from Palestinian militants.\nEarlier, the Israeli military said three soldiers had been killed in a separate attack in southern Gaza. A total of 221 soldiers have been killed since Israel started its military offensive in the wake of the Hamas attack inside Israel on 7 October, which killed 1,200 people and saw more than 240 more taken hostage.\nIn response to the incursion by Hamas, Israel has vowed to eradicate the militant group and has launched airstrikes and ground operations inside Hamas-controlled Gaza, backed up by a blockade. Health officials in Gaza say more than 25,000 people have been killed during the three months of conflict so far.\nThe soldiers’ deaths came on the day that the Israeli army launched its biggest operation in a month, to seize the remaining parts of Khan Younis, and on Tuesday it said Gaza’s main southern city was surrounded. “Over the past day, IDF [Israel Defense Forces] troops carried out an extensive operation during which they encircled Khan Younis,” the military said, adding that they had “eliminated” dozens of Hamas militants.\nThe recent advances by Israel have taken its military close to areas sheltering hundreds of thousands of Palestinians who have been forced out of other parts of the territory by fighting or the destruction of their homes.\nRecent Israeli advances have taken them near to areas sheltering hundreds of thousands of Palestinians forced from other parts of Gaza (Reuters)\nThe deaths will increase pressure on the Israeli government, and on Israel’s prime minister, Benjamin Netanyahu, over the offensive inside Gaza. “Yesterday we experienced one of our most difficult days since the war erupted,” Mr Netanyahu said. “In the name of our heroes, for the sake of our lives, we will not stop fighting until absolute victory.”\nIsraeli defence minister Yoav Gallant said on Tuesday that it was a “difficult and painful morning”, adding: “Our hearts are with the dear families in their most difficult time.”\n“This is a war that will determine the future of Israel for decades to come – the fall of the soldiers compels us to achieve the goals of the fighting,” he said.\nMilitary spokesperson Daniel Hagari said that rescue workers had been deployed at the site where the buildings collapsed, to search for survivors. An investigation has also been launched into how the explosives detonated and brought down the building. In Israel, families and friends mourned the soldiers at funerals across the country, touching coffins draped in the national flag and hugging one another in their grief.\nRelatives and supporters of the Israeli hostages held in Gaza by Hamas attend a protest calling for their release outside the Knesset, Israel’s parliament (AP)\n“We are still studying and investigating the details of the event and the reasons for the explosion,” Mr Hagari told an early morning press briefing.\nAdvancing Israeli forces have blockaded hospitals around Khan Younis, which Palestinian officials say makes it impossible to rescue the dead and wounded. At the European Hospital, reached by reporters in southern Khan Younis, Ahed Masmah brought in five corpses, piled on a mattress on his donkey cart.\n“I found them face-down in the street,” he said.\nAt Khan Younis’s main Nasser Hospital, the biggest such facility still functioning in the Gaza Strip, bodies were being buried on the grounds because it was unsafe to go out to the cemetery. Footage taken by Palestinian journalist Hamdan el-Dahdouh showed persistent gunfire hitting the top of the main building.\n“I am besieged at Nasser Hospital now and my life is in great danger,” Dr Mahmoud Abu Shammala posted on Facebook. “The smell of death, the only smell I know, is filling the place.”\nProtesters spill red paint on the road to symbolise the blood of the Israeli hostages held in Gaza since the 7 October attacks (Getty)\nAnother Khan Younis hospital, al-Khair, was stormed by Israeli troops who arrested staff, Palestinian officials said. Israel says that Hamas fighters operate in and around hospitals – an assertion that both hospital staff and Hamas deny.\nMr Netanyahu has repeatedly dismissed growing international pressure for a ceasefire in Gaza, as well as exhortations to consider a two-state solution for Palestinians, and has thereby widened the apparent rift with his closest international allies, including Joe Biden. On Sunday, Mr Netanyahu rejected Hamas’s conditions for ending the war and releasing the hostages, which included the Islamist group retaining control of Gaza and Israel withdrawing completely.\nA senior Egyptian official told reporters that Israel had proposed a two-month ceasefire, under the terms of which the Israeli hostages would be freed in exchange for the release of Palestinians imprisoned by Israel, and top Hamas leaders in Gaza would be allowed to relocate to other countries.\nEgypt and Qatar, which have brokered past agreements between Israel and Hamas, have been developing a proposal involving a series of phased ceasefires and releases. More than 100 Israelis and other nationals were freed in return for 240 Palestinian women and children held in Israeli prisons as part of a week-long truce at the end of November.\nAsked about media reports that a ceasefire deal was being discussed, after Qatar said mediation efforts were ongoing, Israeli government spokesperson Eylon Levy said the war’s goals were unchanged.\nThese include “the destruction of Hamas’s governing and military capabilities in the Gaza Strip and the return of all the hostages”, he said, adding: “There will be no ceasefire that leaves the hostages in Gaza and Hamas in power.”\nDespite popular support for the war still being relatively high in Israel, Mr Netanyahu is facing anger over his leadership, with thousands of Israelis holding protests against the leader in Tel Aviv and demanding a new election over his alleged mishandling of the country’s security.\nProtesters including relatives of hostages stormed a parliamentary committee meeting on Monday, demanding a deal to secure the release of their loved ones.\nReuters and Associated Press contributed to this report", "source_domain": "www.independent.co.uk", "text": null, "title": "Deadliest day for Israeli army since start of Gaza war as 24 soldiers killed", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-hamas-gaza-idf-attack-death-toll-b2483061.html"}