{"authors": [], "date_download": "2024-02-05 15:38:46", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "A suspected terrorist commander has been detained here on charges of murdering two tourists and their local guide last month in Queen Elizabeth Nation.....", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031562%2Fuganda-charges-terrorist-commander-in-tourist-murder-case.json", "image_url": "https://static.midwestradionetwork.com/story_logos/premier/the-uk-news.jpg", "language": "en", "localpath": null, "maintext": "KAMPALA, Nov. 13 (Xinhua) -- A suspected terrorist commander has been detained here on charges of murdering two tourists and their local guide last month in Queen Elizabeth National Park, western Uganda, authorities said Monday.\nAbdul Rashid Kyoto, known locally as \"Njovu,\" was remanded in custody on Monday by Erias Kakooza, chief magistrate of the Nakawa area in Kampala, the capital of Uganda. Prosecutors have accused him of nine counts, including terrorism, murder, aggravated robbery and membership in a terrorist organization.\nNjovu serves as a camp commander for the Allied Democratic Forces (ADF), a terrorist organization currently active in the Democratic Republic of the Congo (DRC) with connections to the Islamic State.\nAccording to court documents, on Oct. 17, Njovu and others who remain at large killed two tourists, a British citizen and a South African, who were on their honeymoon in Queen Elizabeth National Park, along with their local guide. The court has documented that Njovu has openly declared his affiliation with the ADF.\nUgandan military forces announced on Nov. 2 that they had eliminated six ADF rebels and captured Njovu in an operation along Lake Edward, which is shared between Uganda and the DRC.\nNjovu is scheduled to return to court on Nov. 27 for the mention of his case.", "source_domain": "www.theuknews.com", "text": null, "title": "Uganda charges terrorist commander in tourist murder case", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031562/uganda-charges-terrorist-commander-in-tourist-murder-case"}