{"authors": [], "date_download": "2024-02-05 15:38:47", "date_modify": "None", "date_publish": "2023-11-16 05:41:27", "description": "President Joe Biden met with Chinese President Xi Jinping for hours on Wednesday in a widely anticipated encounter intended to recalibrate tensions between the two countries", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fjoe-biden-ap-san-francisco-xi-jinping-united-states-b2448228.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/05/APTOPIX_APEC_Biden_XI_72221.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIt was a meeting a year in the making.\nPresident Joe Biden and Chinese President Xi Jinping sat down together on Wednesday just outside of San Francisco, where Asian leaders gathered for an annual summit. It was almost exactly one year since their last encounter in Bali, Indonesia, on the sidelines of another global gathering.\nIn addition to a formal bilateral meeting, Biden and Xi shared a lunch with top advisers and strolled the verdant grounds of the luxury estate where their meeting took place.\nBiden said afterwards that the meeting included “some of the most constructive and productive discussions we’ve had.\" He added that they will “keep the lines of communication open” and Xi is “willing to pick up the phone” — no small thing in the world of high-risk, high-stakes diplomacy between Washington and Beijing.\nIn another potential sign of warmer feelings, Xi signaled later in the night that China would send new pandas to the United States after the three at the Smithsonian National Zoo in Washington were returned earlier this month. In a speech, Xi said he wanted to “deepen the friendly ties between our two peoples.\" Xi also said he learned that Americans — particularly children — were “really reluctant” to say goodbye to the rare and popular animals.\nHere's a look at how the rest of the day panned out.\nNEW AGREEMENTS\nBiden left the meeting with commitments on key issues.\nXi agreed to help curb the production of the illicit fentanyl that is a deadly component of drugs sold in the United States. A senior administration official, who spoke on the condition of anonymity to discuss a private meeting, said the shift will be a setback for Latin American drug dealers.\n“It’s going to save lives, and I appreciated President Xi’s commitment on this issue,\" Biden said at a press conference after his meeting.\nIn addition, Biden and Xi reached an agreement to resume military-to-military communications. That means Defense Secretary Lloyd Austin will speak with his Chinese counterpart once someone is named to the job, the official said. Similar engagements will take place up and down the military chain of command.\nThe official said Biden was “very clear” to Xi that such communications between U.S. and China should be institutionalized and that they are “not done as a gift or as a favor to either side.\"\nBiden said the U.S. and China would talk more about artificial intelligence as well.\n“We're going to get our experts together and discuss risk and safety issues,\" he said.\nThe agreements helped fulfill the White House's goal for the meeting — prove to voters that Biden's dedication to personal diplomacy is paying off.\nOn Sunday, national security adviser Jake Sullivan told CNN that Biden wanted “practical ways” to show that meeting with Xi can help “defend American interests and also deliver progress on the priorities of the American people.”\nZoe Liu, a fellow for China studies at the Council for Foreign Relations, described the meeting between Biden and Xi as a positive step, albeit an incremental one.\n“These agreements will not change the structural challenges in the bilateral relations, but it paves the way for more detailed working-level discussions, which is more important,” she said.\nBIDEN PRESSES CHINA TO ACT LIKE A SUPERPOWER IN COOLING GLOBAL TENSIONS\nBeijing has long sought to be treated as an equal by Washington, and Biden sought to leverage those ambitions with Xi to address two devastating wars.\nIn their private session, Biden appealed to Xi to use his influence to try to calm global tensions, particularly to try to pressure Iran not to widen the conflict between Israel and Hamas.\nA U.S. official said Biden did most of the talking on the matter, and that Xi mostly listened, and that it was too soon to tell what sort of message China was sending to Tehran and how it was being received.\nBiden has also pressed Xi to continue to withhold military support for Russia’s invasion of Ukraine.\nA ‘CLEAR-HEADED’ EXCHANGE AND A WARNING ON TAIWAN\nBiden and Xi held a “clear-headed” and “not heated” discussion on Taiwan — the most sensitive topic in the relationship with the greatest potential to spiral into wider conflict. Biden said he reaffirmed the United States' “One China” policy and its belief that any resolution must be peaceful.\n“I’m not going to change that,” Biden said. “That’s not going to change.”\nHe reiterated, though, that the U.S. would continue to arm Taiwan as a deterrent against any attempt by China to use force to reunify the self-governing island with the mainland. The U.S. had maintained strategic ambiguity about whether it would directly intervene to protect Taiwan in the event of an invasion by Beijing.\nXi, a U.S. official said, told Biden he had no plans to invade the island, though Biden chided him for China’s massive military build-up around Taiwan. Biden also called on China to avoid meddling in Taiwan's elections next year.\nECONOMIC CHALLENGES\nXi arrived in San Francisco at a time of economic challenges back in China, where an aging population and growing debt have hampered its recovering from the COVID-19 pandemic.\nAccording to Beijing's description of the meeting, Xi pressed Biden to lift sanctions and change policies on export controls for sensitive equipment.\n“Stifling China’s technological progress is nothing but a move to contain China’s high-quality development and deprive the Chinese people of their right to development,” the readout said. “China’s development and growth, driven by its own inherent logic, will not be stopped by external forces.”\nThere's no indication that Biden will agree to take such steps. But even the meeting itself could calm jittery nerves back in China, where there have been signs foreign investment is tapering off.\nZhang Lei, a Chinese businessman whose company, Cheche Group, is listed on NASDAQ, said high-level meetings such as the one between Biden and Xi can help assure companies that have been hesitant to invest in China.\n“Confrontations don’t work,” he said. \"You don’t make money with confrontations.”\nIT'S PERSONAL\nBiden and Xi go back years, and Biden often repeats the story of their meetings when they were both vice presidents.\nBut on Wednesday, it was Xi’s turn to reference their previous encounters during brief public remarks, although he eschewed the embellishments that Biden usually adds to the tale.\n“It was 12 years ago,” Xi said. “I still remember our interactions very vividly, and it always gives me a lot of thoughts.”\nBiden also emphasized the length of their relationship and the value of their interactions.\n“We haven’t always agreed, which was not a surprise to anyone, but our meetings have always been candid, straightforward and useful,” Biden said. He added that “it’s paramount that you and I understand each other clearly, leader to leader, with no misconceptions or miscommunication.”\nBilateral meetings aren't always conducive to a personal touch, and Biden and Xi were flanked by advisers on opposite sides of a long table. However, a senior administration official said they spoke about their wives, and Biden wished Xi's wife a happy birthday.\nThe official, who requested anonymity to discuss a private conversation, said Xi was embarrassed, and he admitted that he had forgotten his wife's upcoming birthday because he's been working so hard.\n___\nAssociated Press writer Didi Tang contributed to this report from San Francisco. Seung Min Kim also contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "Pandas, fentanyl and Taiwan - takeaways from Biden's long-awaited meeting with Xi", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/joe-biden-ap-san-francisco-xi-jinping-united-states-b2448228.html"}