{"authors": ["Jason Burke", "Julian Borger"], "date_download": "2024-02-05 15:38:49", "date_modify": "None", "date_publish": "2023-11-16 20:07:49", "description": "Israeli military also claims to have uncovered a vehicle with weapons belonging to the group", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F16%2Fidf-says-hamas-hiding-evidence-of-use-of-shifa-hospital-as-command-centre.json", "image_url": "https://i.guim.co.uk/img/media/e0577f110e5e7a3506faa8decad0b78b0c44103f/0_278_4167_2500/master/4167.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=02672b2a9a2c3e60e000bcc16f304acb", "language": "en", "localpath": null, "maintext": "The Israeli military said late on Thursday that it uncovered a Hamas tunnel shaft and a vehicle with weapons at Gaza’s al-Shifa hospital complex.\n“In the Shifa hospital, IDF [Israel Defense Forces] troops found an operational tunnel shaft and a vehicle containing a large number of weapons,” the military said.\nIt made videos and photographs of the tunnel shaft and weapons public, but no independent verification was possible.\nThe IDF also said it had recovered the body of Yehudit Weiss, a 65-year-old woman taken hostage by Hamas, near al-Shifa. It said the body had been identified by forensic scientific examiners and the family had been informed.\nThe IDF accused Hamas earlier in the day of hiding evidence that would confirm that the organisation had used the hospital as a command and control centre – a charge Israel has made frequently in recent weeks as troops have advanced further into the territory and global anger has mounted.\nIsraeli special forces moved into the hospital early on Wednesday morning and continued to search the sprawling complex in the centre of Gaza City on Thursday.\n“It is important to emphasise that from the moment the Israel Defense Forces publicly exposed the use of hospitals for terrorist activity a few weeks ago, Hamas has persistently worked to conceal infrastructure and cover up evidence,” an IDF spokesperson said\nHamas and medical administrators have strenuously denied the allegation the hospital was a command centre and the health ministry in Gaza said the Israeli military did not find any weapons in the hospital. A British doctor working at Shifa said the charge was an “outlandish excuse”.\nThe Shifa hospital has become a key objective for Israel because it dominates a sector of Gaza City where many government buildings are located and because proving the charge that Hamas used the hospital to shield military activities would help counter the international outcry prompted by the IDF offensive’s high toll on civilians.\n“The soldiers are proceeding one building at a time, searching each floor, all while hundreds of patients and medical staff remain in the complex,” an IDF spokesperson said.\n“The operational activity is being carried out in a discrete, methodical and thorough manner, based on ongoing field assessments and informed by questioning taking place in the field.”\nThe IDF said that “after searching some of the hospital complex buildings”, troops had found weapons as well as “intelligence materials, military technologies and equipment, command and control centres, and communications equipment, all belonging to Hamas”.\nIsrael’s offensive into Gaza was launched days after Hamas launched attacks into Israel on 7 October that killed 1,200 people, mainly civilians shot dead in their homes and at an outdoor dance party. More than 240 hostages were also taken.\n“During the searches, information and footage pertaining to the hostages abducted from Israel were found on computers and other technological equipment,” the IDF said.\nJohn Kirby, the White House national security spokesperson, was questioned by reporters on Thursday about the evidence Israel had so far produced to back its claims.\n“We have our own intelligence that convinces us that Hamas was using al-Shifa as a command and control node and most likely as well as a storage facility,” Kirby said.\n“They were sheltering themselves in the hospital, using the hospital as a shield against military action, placing the patients and medical staff at greater risk. We are still convinced of the soundness of that intelligence.”\nHe declined to say what if any intelligence Israel has shared on the hospital since its seizure by IDF troops.\nThe questions for Kirby came the morning after Joe Biden’s full-throated support of IDF operations in Gaza, at Shifa in particular. Biden had suggested the ground operation should be more targeted than the aerial bombing campaign, which he said had been less discriminate.\n“This is a different story than I believe was occurring before – the indiscriminate bombing,” Biden said on Wednesday night.\nMore than 11,000 people have been killed during the war in Gaza, with about 40% under 18, according to Hamas-run health authorities in Gaza.\nHuman Rights Watch said on Thursday that images released by Israel of weapons it says its soldiers found inside Shifa were not sufficient to justify revoking the hospital’s status as protected by the laws of war.\n“Hospitals only lose those protections if it can be shown that harmful acts have been carried out from the premises. The Israeli government hasn’t provided any evidence of that.”\nIn a video shot inside Shifa, an IDF spokesperson said security cameras throughout had been deliberately covered, and showed a bag with an assault rifle with ammunition and grenades hidden behind an MRI scanning machine, holdalls with more weapons in closets and a computer with “a lot of incriminating evidence”.\nWriting in the Israeli newspaper Haaretz, the columnist Amos Harel said the IDF had moved into Shifa to pursue specific goals – exposing Hamas’s use of medical facilities for military purposes and a search for intelligence about Israeli hostages – but also because of the hospital’s “symbolic importance”.\n“The IDF wants to signal that even though the current raid has limited goals, there is no place its forces fear to enter and there is no place Hamas can feel safe,” Harel wrote.\nOn Thursday, an IDF spokesperson said it had seized control of Gaza’s harbour, a small port used primarily by fishing boats.\nA statement on X, formerly Twitter, said: “Disguised as a civilian area, the harbour was used by Hamas as a training facility for their naval commando forces to plan and execute terrorist attacks.\n“During the operation, conducted by soldiers of the 188th Armoured Corps’ Brigade and Flotilla 13, numerous terrorist tunnel entrances and terrorist infrastructures were destroyed.”\nInternet and telephone services collapsed across the Gaza Strip on Thursday for lack of fuel, the main Palestinian provider said, bringing a potentially long-term blackout of communications as Israel signalled its offensive against Hamas could next target the south, where most of the population has taken refuge.\nThe UN’s World Food Program warned of “the immediate possibility of starvation” in Gaza as the food supply has broken down under Israel’s blockade and too little is coming from Egypt.\nSpeaking to CBS News, Israeli prime minister Benjamin Netanyahu said Israel was doing all it could to get civilians out of harm’s way as it battles Hamas in Gaza, including dropping leaflets warning them to flee, but its attempts to minimise casualties were “not successful”.\n“Any civilian death is a tragedy. And we shouldn’t have any because we’re doing everything we can to get the civilians out of harm’s way, while Hamas is doing everything to keep them in harm’s way,” Netanyahu said.\n“So we send leaflets, (we) call them on their cell phones, and we say: ‘leave’. And many have left,” Netanyahu said.\n“The other thing that I can say is that we’ll try to finish that job with minimal civilian casualties. That’s what we’re trying to do: minimal civilian casualties. But unfortunately, we’re not successful.”\nIsrael has said the goal of its military campaign is to destroy Hamas.", "source_domain": "www.theguardian.com", "text": null, "title": "IDF says it has found Hamas tunnel shaft at al-Shifa hospital in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/16/idf-says-hamas-hiding-evidence-of-use-of-shifa-hospital-as-command-centre"}