{"authors": [], "date_download": "2024-02-05 15:38:50", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "TEHRAN (Tasnim) – North Korea’s Foreign Ministry lashed out at the G7 on Tuesday, calling the bloc a Cold War relic that should keep its nose o", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274032583%2Fnorth-korea-blasts-g7-bloc-as-cold-war-relic.json", "image_url": "https://cdn.bignewsnetwork.com/tas1699969041.jpg", "language": "en", "localpath": null, "maintext": "TEHRAN (Tasnim) - North Korea's Foreign Ministry lashed out at the G7 on Tuesday, calling the bloc a Cold War relic that should keep its nose out of the affairs of other countries, and end its existence altogether.\n- Other Media news -\n\"I resolutely reject and most strongly condemn the 'joint statement' of the G7 foreign ministers' meeting, which is peppered with groundless and unreasonable accusations seriously encroaching upon the dignity and sovereignty of the DPRK,\" North Korean Department of International Organizations Director-General Jo Chol Su told reporters, responding to the G7 statement put out following the bloc's foreign ministers' meeting in Tokyo on November 8, Sputnik reported.\nCharacterizing the G7 as a bloc representing \"only a few countries' interests,\" Jo stressed that it has \"lost the justification for its existence,\" and is a \"legacy of the Cold War\" that \"should be dismantled immediately\" as a \"first step toward defusing the present international crisis and restoring global peace.\"\nJo accused the G7, whose members include the United States, Britain, Italy, Japan, France, Germany and Canada, plus the European Union, of causing and fomenting a series of global crises, from Ukraine and the Middle East to the Taiwan Strait, the South China Sea and the Korean Peninsula.\nFor the G7 to try to \"find fault\" with the actions of independent, sovereign states like the DPRK is constitutes \"a mockery of and an insult to the international community aspiring after fairness and equity,\" the senior North Korean diplomat said. \"I think (the) G7 had better look at its image reflected in the eyes of the international community first before accusing others.\"\n\"Even at this moment, the US is shipping cluster bombs and depleted uranium bombs, the usage of which are completely banned by international law, and other deadly weapons and huge lethal war hardware to Ukrainian battlefields to deliberately undermine peace and stability in the European region. In the Middle East, it is conniving at and fanning up indiscriminate military strikes in Gaza Strip while zealously shielding Israel's hideous massacre of civilians as 'the right of defense',\" Jo said.\n\"Meanwhile, it is keen on muscle-flexing in the Taiwan Strait and other parts of the South China Sea, talking about 'freedom of navigation', 'international order based on rules' and 'opposition to change of the status quo by force or coercion. It has staged a series of bilateral and multilateral joint naval military exercises with their allies to escalate the regional military tensions to the maximum.\nOn the Korean Peninsula, it is pushing the situation to the brink of a nuclear war by establishing different nuclear confrontation policies, including the 'Washington Declaration', and accelerating the efforts for routine deployment of its strategic nuclear submarines, strategic bombers and other nuclear strategic assets,\" the diplomat added.\nJo accused the US's G7 allies, including Japan, Britain, France, Germany and Canada, of stoking tensions and having \"disgraceful records\" doing \"considerable harm to international peace and security,\" citing, for example, to Britain's provision of depleted uranium tank shells and long-range missiles to Ukraine, the deployment of naval forces to the Asia-Pacific, and moves to heighten nuclear tensions in the Pacific through the AUKUS pact with the US and Australia.\n\"All facts go to clearly prove that (the) G7 is a confrontational group of destroyers and violators of peace and stability who stir up and aggravate distrust, conflict, confrontation and armed clash across the world,\" Jo said, adding that the G7 is \"the main stumbling block to the establishment of a just international order.\"\nNorth Korea's response follows the G7 Foreign Ministers' statement calling on Pyongyang to unilaterally denuclearize and liquidate its missile programs in a \"complete, verifiable, and irreversible manner,\" and slammed the DPRK over claims of arms transfers to Russia.\nThe Group of Seven emerged during the Cold War, with the first summit of the G6 countries taking place in 1975 (Canada would join the bloc a year later). The European Economic Community - predecessor to the European Union, was invited to join all future summits in 1977 as a non-enumerated member. Russia was invited into the G7 in 1998 as a sweetener to encourage the Yeltsin government to continue its market reforms and surrender Moscow's strategic interests to the West, but had little power to sway bloc policy. Russia was suspended from the G8 at the start of the Ukrainian crisis in 2014, and announced its permanent withdrawal in January 2017.\nWith the rise of the BRICS bloc of countries (Brazil, Russia, India, China, South Africa, and from January 1, 2024 onward Argentina, Egypt, Ethiopia, Iran, Saudi Arabia, and the United Arab Emirates), the G7 is steadily losing its dominant status in global economic and geopolitical affairs, accounting for some 30 percent of the world's total GDP, compared to 37 percent for the BRICS.\nNorth Korean media have hailed the rise of BRICS, characterizing the Global South country-led bloc's growing power as a factor that will speed up the end of the domination of the US dollar in global trade.", "source_domain": "www.britainnews.net", "text": null, "title": "North Korea Blasts G7 Bloc as Cold War Relic", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274032583/north-korea-blasts-g7-bloc-as-cold-war-relic"}