{"authors": ["Helen Livingstone", "Richard Luscombe", "Léonie Chao-Fong", "Martin Belam", "Helen Sullivan"], "date_download": "2024-02-05 15:38:51", "date_modify": "None", "date_publish": "2023-11-16 04:48:34", "description": "This blog has closed. You can read all our coverage of the Israel-Hamas war here and our latest full report here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F15%2Fisrael-hamas-war-live-updates-israeli-military-al-shifa-hospital-gaza-operation.json", "image_url": "https://i.guim.co.uk/img/media/e29607cc30e3314b1cf5e655595292b954096f1b/0_184_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=57f3199f1941749d2289f7e41e96b493", "language": "en", "localpath": null, "maintext": "From 16 Nov 2023 03.20 CET Joe Biden defends refusal to call for ceasefire Julian Borger Joe Biden has presented an unapologetic defence of his refusal to call for a ceasefire in Gaza, arguing that Hamas presented a continuing threat to Israel and that Israeli forces were seeking to avoid civilian casualties. After a summit meeting with Chinese president Xi Jinping, Biden told reporters: Hamas has already said publicly that they plan on attacking Israel again like they did before, cutting babies’ heads off, burning women and children alive. So the idea that they’re going to just stop and not do anything is not realistic. Reports that Hamas beheaded babies in the 7 October attack on Israeli civilians remain unconfirmed, though the brutality of the massacre in which some 1,200 were killed is not in doubt. Biden also argued that Israeli forces had switched from aerial bombardment, which he seemed to acknowledge had been “indiscriminate” in parts, to more targeted ground operations, after more than 11,000 Gazans are reported to have died. He said: It is not carpet bombing. This is a different thing. They’re going through these tunnels, they’re going into the hospital. They’re also bringing in incubators or bringing in other means to help people in the hospital, and they’ve given, I’m told, the doctors and nurses and personnel the opportunity to get out of harm’s way. So this is a different story than I believe it was occurring before, the indiscriminate bombing. He continued: “The IDF, Israeli Defence Forces, acknowledge they have an obligation to use as much caution as they can, in going after their targets. It’s not like they’re rushing to the hospital knocking on doors, you know, pulling people aside and shooting people indiscriminately.” Biden also suggested that a possible hostage deal was imminent, saying the Israelis had agreed to a “pause” as part of the deal, but then stopped short, appearing to acknowledge the uneasiness of secretary of state Antony Blinken, finally adding: “I’m mildly hopeful.” The forcefulness of Biden’s defence of the Israeli military, is notably out of step with recent remarks by senior US officials, who have shifted their emphasis to appeals to the IDF to observe humanitarian law and avoid civilian casualties. It seemed to confirm reports that the president is more unreservedly pro-Israel than many in his administration.\nUpdated at 03.23 CET\n16 Nov 2023 05.48 CET It’s approaching 7am in Tel Aviv and Gaza now and we’re pausing the blog here. We’ll be back soon to bring you all the latest news. In the meantime, you can read all our coverage of the Israel-Hamas war here and our full report on Joe Biden’s defence of his refusal to call for a ceasefire here. In the meantime, here are the latest key developments: The United Nations security council adopted a resolution calling for humanitarian pauses in the fighting in Gaza and the establishment of aid corridors to speed relief supplies to those in need. Russia, the UK and US abstained from the vote, which passed 12-0, the first global agreement since the conflict began last month. Israel dismissed the resolution as “detached from reality”, while the the permanent observer of Palestine to the UN said the body should hold Israel accountable if it ignores it.\nThe Israel Defense Forces (IDF) withdrew from the al-Shifa hospital complex in Gaza city almost 24 hours after an overnight raid it called a “precise and targeted operation” against Hamas. The IDF said it discovered military equipment including grenades, automatic weapons, ammunition and communications technology, confirming what it said was a Hamas command operations center beneath the hospital.\nHamas denied the claim, which it said in a statement was “nothing but a continuation of the lies and cheap propaganda, through which [Israel] is trying to give justification for its crime aimed at destroying the health sector in Gaza”.\nMuhammad Abu Salmiya , director of the al-Shifa hospital, said that water, electricity and medical oxygen supplies were completely cut off within the facility, and that he was unable to communicate with doctors . “We cannot reach the pharmacy to treat patients as the occupation shoots everyone who moves. The smell of death wafts everywhere,” he told Al Jazeera.\nSeven staff members at the Jordanian field hospital in Gaza were injured in what Jordan alleged was an Israeli airstrike on the emergency department . “Our field hospital staff rushed to the emergency section as they saw a number of Palestinians carrying wounded persons, and as our staff got to the emergency room, they got hit again,” foreign minister Ayman Safadi said, adding that “many other” Palestinians were killed or injured.\nThe Ministry of Health in Gaza did not update the death toll for the fifth consecutive day on Wednesday, due to the collapse in communications and in hospital services in the territory, the UN humanitarian relief agency OCHA noted . As of 10 November the death toll was 11,078, of whom 4,506 were said to be children and 3,027 women. Another 27,490 Palestinians have reportedly been injured.\nEight senior politicians from the Britain’s opposition Labour Party resigned or were fired for defying leader Keir Starmer’s demand they not support a resolution in the UK parliament calling for a ceasefire in Gaza . Overall, 56 Labour MPs voted for an amendment to the king’s speech brought by the Scottish National party, a major blow to the party leader’s attempts to keep unity over the war.\nThe US navy warship Thomas Hudner shot down a drone that emanated from Yemen in the Red Sea early on Wednesday. It was only the second time the US had brought down projectiles near its warships since the Israel-Hamas conflict began last month.\nIsrael’s former deputy prime minister Gideon Sa’ar told the UK publication Jewish News that his country will agree to a temporary ceasefire in Gaza to facilitate the release of hostages held by Hamas. “It will be achieved. We will see a temporary ceasefire,” he said. His words contradict those of Israel prime minister Benjamin Netanyahu, who has frequently and vociferously ruled out a ceasefire.\nGaza’s two main telecommunications companies warned of a “complete telecom blackout in the coming hours” in the Gaza Strip. “Main data centres and switches are gradually shutting down due to fuel depletion,” the companies said in a joint statement.\nThe UN children’s agency says its top official visited children and their families in the Nasser hospital in Khan Younis, in the south of the territory. “What I saw and heard was devastating. They have endured repeated bombardment, loss and displacement,” Unicef’s executive director, Catherine Russell, said in a statement. “Inside the strip, there is nowhere safe for Gaza’s one million children to turn.”\nPhilippe Lazzarini, head of the UN agency for Palestinian refugees, UNWRA, has said: “Our entire operation is now on the verge of collapse,” and that “by the end of today, around 70% of the population in Gaza won’t have access to clean water”.\nThomas White, the director of the UN’s agency for Palestinian refugees (UNRWA), has said that water pumps and sewage treatment in the south of the Gaza Strip have stopped due to lack of fuel.\nEgypt’s state-run al-Qahera television station reported on Wednesday that the first fuel truck to enter the Gaza Strip since the war started on 7 October had crossed the Egyptian gate of the Rafah crossing. It is reported to be carrying 24,000 litres. “This is not enough for anything – not for hospitals, not even for aid deliveries,” an international source familiar with the operation told Reuters, speaking on condition of anonymity.\nQatari mediators were on Wednesday seeking to negotiate a deal between Hamas and Israel that includes the release of about 50 civilian hostages from Gaza in exchange for a three-day ceasefire, an official briefed on the negotiations told Reuters. The deal would also involve Israel releasing some Palestinian women and children from Israeli jails and increase the amount of humanitarian aid allowed into Gaza. Hamas has to date released four of the estimated 240 hostages seized from inside Israel’s borders on 7 October.\nThe family and friends of some of the 240 hostages believed to have been seized by Hamas on 7 October from inside Israel have begun the second day of their protest march from Tel Aviv to Jerusalem. The trip is expected to last five days and will finish at Netanyahu’s office. The families have been critical of Netanyahu’s government for not doing enough to secure the release of the hostages.\n16 Nov 2023 05.23 CET Daniel Hurst Pressure is growing on the Labor government in Australia to take a stronger line on the defence of Palestinian civilians, as backbenchers broke with the cabinet to call for a ceasefire. The Australian government has called for “humanitarian pauses” and urged Israel to follow the rules of war and prevent civilian deaths, but has stopped short of demanding a ceasefire. On Thursday Labor MP Maria Vamvakinou spoke out against the “humanitarian disaster that is unfolding in Gaza” and also took aim at Israel as she said that thousands of Palestinian civilians including children were “being killed by a highly sophisticated army”. “We have to call for an immediate ceasefire in Gaza,” she said as she stood with the Greens to receive petitions from more than 120,000 Australians who are demanding an end to the fighting. Labor backbenchers stand with Greens to call for ‘immediate ceasefire’ in Gaza Read more\n16 Nov 2023 04.36 CET Dani Anguiano Hundreds of demonstrators in Los Angeles shut down a stretch of Hollywood Boulevard on Wednesday afternoon in a protest demanding Joe Biden and US lawmakers call for an immediate ceasefire in Gaza. In the heart of Hollywood, along the palm tree-lined streets near Ripley’s Believe It or Not! and the Walk of Fame, protesters waved Palestinian flags and held signs – “not in our name” and “let Gaza live”. More than 1,000 people gathered in the rain, including a group that staged a sit-in at the intersection with flowers in hand and shirts reading “Jews say ceasefire now” as tourists watched. “We demand an end to the killing and the return of the hostages,” one speaker said. “Ceasefire now.” The demonstration, organized by the groups Jewish Voices for Peace Los Angeles and IfNotNow LA, followed large gatherings around the US in Washington DC, New York and Seattle earlier in the month. Protesters have advocated for a ceasefire in the conflict as well as an end to US military aid to Israel amid the growing death toll in the war. ‘Disgusted and horrified’: protesters in LA stage sit-in urging for Gaza ceasefire Read more\n16 Nov 2023 04.17 CET Police in riot gear have used pepper spray and made arrests to try to disperse demonstrators who had gathered outside the Democratic National Committee (DNC) headquarters in Washington on Wednesday evening to demand a ceasefire in Gaza. Reuters reports that the demonstration was organised by three advocacy groups and took place in an area near the US Capitol building. US Capitol Police said its officers were “working to keep back approximately 150 people who are illegally and violently protesting”. “Officers are making arrests,” it said on X. It advised people to stay away from the area.\nPolice used pepper spray against the demonstrators and fired projectiles containing chemical irritants, a Reuters journalist said. Video of the demonstration posted on social media showed officers pushing protesters who had huddled together, chanting: “Let us live”. They wore black shirts reading “ceasefire now”. View image in fullscreen Police lead protesters demanding a ceasefire away from the headquarters of the Democratic National Committee in Washington. Photograph: Alex Wong/Getty Images\n16 Nov 2023 04.02 CET A car has crashed into a barricade near the Israeli embassy in Tokyo and a man in his 50s has been arrested at the scene, Reuters reports, citing Fuji TV. One police officer was injured, the broadcaster said.\n16 Nov 2023 03.54 CET Mark Regev, a senior advisor to Israeli prime minister Benjamin Netanyahu, has been on various television stations in the US and UK defending Israel’s much-criticised military operation inside al-Shifa hospital. Israel has said it found “technological equipment” – which seemed to be a laptop – as well as automatic weapons, grenades and some flak jackets at the hospital. Asked by Sky whether this was enough to prove that Hamas had its base underneath al-Shifa, Regev said that he could prove it and that: As our forces move forward… as we succeed I have no doubt that we’ll be inviting in journalists with cameras to look at what we have in this hospital. Hamas has said the pictures of weapons at the hospital are “cheap propaganda” and denied that its headquarters were beneath it. Regev pointed out that the US Pentagon had also backed Israel’s claims about al-Shifa being used by Hamas, adding: “the people of Gaza know this … they can’t say so obviously because they live in an authoritarian regime … it’s the worst kept secret in Gaza”. He also accused Hamas of a “grave crime” by using the hospital as a shield for its “war machine”. Asked when Israel would begin providing “proper” humanitarian aid for civilians in the north, he said, “The overwhelming majority of civilians have left” adding that they had “voted with their feet” and “left the combat zone”. By putting its military under a hospital, Hamas turned a humanitarian site into a war zone.\nEveryone of conscience should condemn this.\nWatch me on @SkyNews with @markaustintv pic.twitter.com/aHEFjXLxHv — Mark Regev (@MarkRegev) November 15, 2023\n16 Nov 2023 03.20 CET Joe Biden defends refusal to call for ceasefire Julian Borger Joe Biden has presented an unapologetic defence of his refusal to call for a ceasefire in Gaza, arguing that Hamas presented a continuing threat to Israel and that Israeli forces were seeking to avoid civilian casualties. After a summit meeting with Chinese president Xi Jinping, Biden told reporters: Hamas has already said publicly that they plan on attacking Israel again like they did before, cutting babies’ heads off, burning women and children alive. So the idea that they’re going to just stop and not do anything is not realistic. Reports that Hamas beheaded babies in the 7 October attack on Israeli civilians remain unconfirmed, though the brutality of the massacre in which some 1,200 were killed is not in doubt. Biden also argued that Israeli forces had switched from aerial bombardment, which he seemed to acknowledge had been “indiscriminate” in parts, to more targeted ground operations, after more than 11,000 Gazans are reported to have died. He said: It is not carpet bombing. This is a different thing. They’re going through these tunnels, they’re going into the hospital. They’re also bringing in incubators or bringing in other means to help people in the hospital, and they’ve given, I’m told, the doctors and nurses and personnel the opportunity to get out of harm’s way. So this is a different story than I believe it was occurring before, the indiscriminate bombing. He continued: “The IDF, Israeli Defence Forces, acknowledge they have an obligation to use as much caution as they can, in going after their targets. It’s not like they’re rushing to the hospital knocking on doors, you know, pulling people aside and shooting people indiscriminately.” Biden also suggested that a possible hostage deal was imminent, saying the Israelis had agreed to a “pause” as part of the deal, but then stopped short, appearing to acknowledge the uneasiness of secretary of state Antony Blinken, finally adding: “I’m mildly hopeful.” The forcefulness of Biden’s defence of the Israeli military, is notably out of step with recent remarks by senior US officials, who have shifted their emphasis to appeals to the IDF to observe humanitarian law and avoid civilian casualties. It seemed to confirm reports that the president is more unreservedly pro-Israel than many in his administration.\nUpdated at 03.23 CET\n16 Nov 2023 02.58 CET Biden says he told Netanyahu a two-state solution is the only answer to conflict US President Joe Biden has just spoken in the US, and said he had made it clear to Israeli prime minister Benjamin Netanyahu that a two-state solution was the only answer to resolve the Israel-Palestinian conflict and that occupying Gaza would be a mistake. After meeting his Chinese counterpart Xi Jinping, Biden told reporters he was doing everything in his power to free hostages held by the Hamas militant group in Gaza, but that did not mean sending in the US military. He also reiterated that the US believed like Israel that Hamas had its headquarters under the al-Shifa hospital, where the Israeli military carried out a controversial raid on Wednesday, and said that Hamas had committed war crimes.\nUpdated at 03.00 CET\n16 Nov 2023 02.45 CET Israel launched strikes on several Hezbollah-linked sites in Lebanon in response to an anti-tank missile that was fired towards northern Israel on Wednesday, the Israeli military (IDF) has said. In a Telegram post early Thursday, the IDF said it had struck several Hezbollah “launch posts” including the one from which the anti-tank missile was fired as well as observation posts and other “terror infrastructure sites”.\n16 Nov 2023 02.27 CET A bit more from the OCHA statement, in which the UN agency says that the Ministry of Health in Gaza did not update the death toll for the fifth consecutive day on Wednesday, due to the collapse in communications and in hospital services in the territory. As of 10 November the death toll was 11,078, of whom 4,506 were said to be children and 3,027 women. Another 27,490 Palestinians have reportedly been injured. The statement also noted that Palestinians fleeing northern Gaza have reported dead bodies lying in the streets and that as of 10 November, about 2,700 people including 1,500 children remain missing and are presumed to be dead or trapped under the rubble of destroyed buildings. The Palestine Red Crescent Society has reported that it has been unable to respond to hundreds of calls to assist and evacuate people wounded or trapped under the rubble.\nUpdated at 02.32 CET\n16 Nov 2023 02.12 CET Gaza’s last remaining flour mill, the As Salam Mill in Deir Al Balah, was reportedly hit and destroyed on Wednesday, the UN’s humanitarian affairs office (OHCA) has said in its latest update on the conflict. It said: This was the last functioning mill in Gaza, and its destruction means that locally produced flour will not be available in Gaza in the foreseeable future. It noted that Gaza’s telecoms companies had also announced the “gradual cessation of all communication and internet services in the Strip” on Wednesday, as they exhausted fuel supplies to power generators. It warned: Humanitarian agencies and first responders have warned that blackouts jeopardize the provision of life-saving assistance.\n16 Nov 2023 01.45 CET Seven staff members at Jordanian hospital in Gaza injured in Israeli strike, Jordan says Seven staff members at the Jordanian field hospital in Gaza have been injured in what Jordan alleges was an Israeli airstrike on the emergency department. In an interview with CNN, foreign minister Ayman Safadi said: Our field hospital staff rushed to the emergency section as they saw a number of Palestinians carrying wounded persons, and as our staff got to the emergency room, they got hit again and about seven of our medical staff there were wounded. Many other Palestinians were unfortunately killed and injured. Safadi said it was “incomprehensible that people trying to offer the medical help to wounded people get hit as well” and said Jordan would demand an investigation into the incident. DPM & FM @AymanHsafadi in an interview with Isa Soares @IsaCNN on @cnni:\n- The attack on Jordanian Field Hospital obviously was part of the overall war that we see continue to unfold in Gaza, and again it is just incomprehensible that people trying to offer medical help to… pic.twitter.com/lrzsZlxozt — وزارة الخارجية وشؤون المغتربين الأردنية (@ForeignMinistry) November 15, 2023\n16 Nov 2023 01.23 CET Hamas-run health ministry says Israel destroyed parts of hospital entrance with bulldozers The Hamas-run health ministry in the Gaza Strip has said that the Israeli army deployed bulldozers at the al-Shifa hospital, where Israel launched a controversial operation on Wednesday which it said targeted Hamas. “Israeli bulldozers destroyed parts of the southern entrance” to the hospital, the ministry said in a brief statement in Arabic early on Thursday, according to Agence France-Presse. The Israeli army told AFP that an operation was currently underway at the hospital complex. “Tonight we conducted a targeted operation into Shifa hospital. We continue to move forward,” Major General Yaron Finkelman, head of Israeli military operations in the Gaza Strip, said on the army’s Telegram channel.\n16 Nov 2023 01.09 CET More than two dozen Palestinian cancer patients, who had crossed from Gaza into Egypt, have arrived in Turkey for treatment, Turkey’s Anadolu agency is reporting. Two planes carrying the patients, many of them children, landed at Ankara airport shortly after 00:30 am local time on Thursday (2130 GMT Friday). Turkey has sent a ship loaded with material for field hospitals, ambulances and generators to Egypt to treat civilians who have been able to flee Israel‘s military operation against Hamas militants in the enclave. Agence France-Presse reports further: Turkish health minister Fahrettin Koca said 27 patients had been flown to Turkey from Egypt, along with 13 companions, without specifying whether these were doctors or family members. He added that the cancer patients had been able to cross from Gaza into Egypt via the Rafah border crossing. Koca had been in Egypt for discussions on the delivery of humanitarian aid into Gaza, and said the patients were able to be transferred to Turkey thanks to “coordination between Turkey, Egypt and Israel“. He also said that Turkey was waiting for Egypt’s permission to open its first field hospital at the Rafah crossing. “I hope that in the near future – our efforts are going in this direction – we will be able to establish a field hospital in Gaza, in the area near the Rafah gate,” he said. Turkey, a mostly Muslim but officially secular nation, has long championed the Palestinian cause and, more recently, has stepped up its verbal attacks against Israel for the soaring civilian toll of its military operation. Speaking before members of his Islamic-rooted ruling party, President Recep Tayyip Erdogan on Wednesday called Israel “a terror state” that was committing “genocide”.\n15 Nov 2023 00.53 CET Canadian PM Justin Trudeau escorted from restaurant amid protest Canada’s prime minister, Justin Trudeau, was escorted from a restaurant in Vancouver on Tuesday night after about 250 protesters surrounded it, police have said. In a statement, police said almost 100 officers were deployed to disperse the protest in Chinatown and a 27-year-old man was arrested for assaulting an officer, who was punched in the face and had her eyes gouged. A 34-year-old was also arrested for obstructing police. CBC reported that videos of the incident showed protesters shouting “ceasefire now” and waving Palestinian flags. Trudeau angered Israel earlier on Tuesday by saying the “killing of women, of children, of babies” in Gaza must end.\nUpdated at 01.12 CET\n15 Nov 2023 00.27 CET Israeli opposition leader calls on Benjamin Netanyahu to resign Israel’s opposition leader, Yair Lapid, has called on prime minister Benjamin Netanyahu to resign, local media is reporting, saying “we can’t run an extended [military] operation with a prime minister we do not have faith in”. In an interview with Israel’s Channel 12, Lapid did not call for an election but said the ruling Likud party should replace Netanyahu with someone from within its ranks. Netanyahu has long been a divisive figure in Israeli politics and has been roundly criticised for allowing the 7 October attack by Hamas to happen. In a statement, the Likud party hit back at Lapid’s comments, saying: It is regrettable and shameful that Lapid is engaging in politics during a time of war, proposing to oust the prime minister that leads the campaign and replace him with a government that would establish a Palestinian state and would allow the Palestinian Authority to control Gaza. A statement by Lapid’s Yesh Atid party countered by saying that the Likud has “probably missed the point,” Haaretz newspaper reported, as “Lapid proposed a government led by the Likud, with a Likud prime minister who is not Netanyahu. That is how we will begin the national healing.” This is Helen Livingstone taking over from my colleague Richard Luscombe. View image in fullscreen Yair Lapid, leader of the centrist Yesh Atid party. Photograph: Xinhua/REX/Shutterstock\nUpdated at 01.10 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: Israel launches strikes on Hezbollah-linked sites in Lebanon - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/15/israel-hamas-war-live-updates-israeli-military-al-shifa-hospital-gaza-operation"}