{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:38:54", "date_modify": "None", "date_publish": "2023-11-16 08:10:28", "description": "Video shows Haniyeh's home erupting into a huge fireball, with debris seen flying through the air, as soon as it was struck by IDF forces.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12756185%2FMoment-Hamas-leader-Ismail-Haniyehs-home-destroyed-Israel-IDF-say-property-used-meeting-point-groups-leaders-direct-terror-attacks.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/08/77866389-0-image-a-25_1700122212322.jpg", "language": "en", "localpath": null, "maintext": "This is the moment Israeli fighter jets destroyed the home of Hamas leader Ismail Haniyeh in Gaza in a withering airstrike.\nVideo shows the air strike tearing through Haniyeh's home before it erupts into a huge fireball, sending debris flying through the air.\nHaniyeh, considered the terrorist group's overall leader, has lived in Doha, Qatar for several years.\nBut the IDF said his house was being used as a 'meeting point for Hamas' senior leaders to direct terror attacks against Israeli civilians and soldiers'.\nHaniyeh, who is said to have a net worth of more than £2.4 billion, is a father of 13 children and had been in hiding since 2019.\nGerman tabloid Bild reports that he often jets between Tehran, Istanbul, Moscow and Cairo in his private jet to meet leaders in friendly nations, and two of his sons Maaz and Abdel Salam are often seen in Instagram posts lounging on hotel beds in Istanbul or Doha.\nFrom Doha, Haniyeh watched and celebrated the massacre of 1,200 Israelis as his Hamas terrorists rampaged across southern Israel on October 7.\nThis is the moment Israeli fighter jets destroyed the home of Hamas leader Ismail Haniyeh in Gaza in a withering airstrike\nVideo shows the air strike tearing through Haniyeh's home before it erupts into a huge fireball, sending debris flying through the air\nVideo shows the air strike tearing through Haniyeh's home before it erupts into a huge fireball, sending debris flying through the air\nIranian Foreign Minister Hossein Amir-Abdollahian meets with Haniyeh (right) in Doha on October 31\nHaniyeh was spotted with other Hamas officials cheering for joy before they prostrated themselves on the floor and praised God on the day of the attack.\nIn a speech, he hailed the massacre as the beginning of a new era in the Israeli-Hamas conflict.\nHe said at the time: 'Enough is enough, the cycle of intifadas and revolutions in the battle to liberate our Palestinian land and our prisoners languishing in occupation prisons must be completed.'\nThe terror chief also hinted that further violence was coming to Jerusalem and the occupied West Bank.\nThe targeting of his house by Israeli forces today comes as Israel renewed its raid at Gaza's largest hospital today, targeting what it said was a Hamas command centre hidden beneath thousands of patients, medics and displaced people.\nThe raid began early Wednesday but has yet to uncover evidence of the central Hamas headquarters that Israel has said is concealed beneath the complex. Hamas and staff at the hospital, Gaza's largest, deny the allegations.\nMeanwhile, Israeli forces dropped leaflets warning Palestinians to flee parts of southern Gaza, residents said Thursday, signalling a possible expansion of operations to areas where hundreds of thousands of people who heeded earlier evacuation orders are crowded into U.N.-run shelters and family homes.\nBroadening the offensive to the south - where Israel already carries out daily air raids - threatens to worsen an already severe humanitarian crisis in the besieged territory.\nOver 1.5 million people have been internally displaced in Gaza, with most having fled to the south, where food, water and electricity are increasingly scarce.\nThe war, now in its sixth week, was triggered by a wide-ranging Hamas attack into southern Israel on October 7 in which the militants killed over 1,200 people, mostly civilians, and captured some 240 men, women and children.\nSmoke rises following an airstrike in Gaza, as seen from southern Israel, amid the ongoing conflict between Israel and the Palestinian group Hamas on Thursday\nThis handout picture released by the Israeli army on November 15, 2023, reportedly shows Israeli soldiers carrying out operations inside Al-Shifa hospital in Gaza City\nThis handout picture released by the Israeli army on November 16, 2023, shows troops during a military operation in the Gaza Strip amid continuing battles between Israel and the Palestinian militant group Hamas\nIsraeli troops during a military operation in the Gaza Strip amid continuing battles between Israel on Thursday\nPeople collect items among the rubble of buildings destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Wednesday\nIsrael responded with a weekslong air campaign and a ground invasion of northern Gaza, vowing to remove Hamas from power and crush its military capabilities.\nMore than 11,200 Palestinians have been killed, two-thirds of them women and minors, according to Palestinian health authorities. Another 2,700 have been reported missing, with most believed to be buried under the rubble. The official count does not differentiate between civilian and militant deaths.\nIsraeli troops on Wednesday stormed into Gaza's largest hospital, searching for traces of Hamas inside and beneath the facility, where newborns and hundreds of other patients have suffered for days without electricity and other basic necessities.\nTroops were searching the underground levels of the hospital on Thursday and detained technicians responsible for running its equipment, the Health Ministry in Hamas-run Gaza said in a statement.\nAfter encircling Al Shifa for days, Israel faced pressure to prove its claim that Hamas was using the patients, staff and civilians sheltering there to provide cover for its fighters. The allegation is part of Israel's broader accusation that Hamas uses Palestinians as human shields.\nLast night, Israel claimed it had found 'concrete' evidence that Gaza's biggest hospital Al Shifa was being used as a terrorist base after hundreds of commandos raided it early yesterday.\nThe IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base, with spokesman Lt Col Jonathan Conricus showing a duffel bag hidden behind a hospital MRI machine containing an AK47 assault rifle, grenades, ammunition and a uniform.\nHe also said a backpack contained 'what appeared to be very important intelligence including a laptop', and added that security cameras in one part of the hospital had been taped over.\nBehind another MRI machine more weapons were said to have been found and in an adjoining room on top of another MRI scanner was a bag containing 'full military kit for one terrorist, including ammunition, a live grenade and AK47 and body armour'.\n'These weapons have no business being in a hospital,' Conricus said as he toured the hospital in a clip released by the IDF.\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nInside a cabinet for medical equipment was another holdall containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman\nIDF spokesperson Lt. Col. Conricus shows weapons and equipment which he says were found at Al Shifa hospital complex\nIn this image taken from a video released by the Israeli Defence Forces, on Wednesday, Lt. Col. Jonathan Conricus, an Israeli military spokesman, holds up a bullet proof vest with a Hamas insignia that was found along with weapons the IDF says were found in a medical closet at the MRI center at al-Shifa hospital in Gaza City\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Palestinian Islamist group Hamas\nInside a cabinet for medical equipment was another holder containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman.\nBut the IDF's search showed no signs of tunnels or a sophisticated command centre that many believed would be discovered underneath the facility.\nHamas and Gaza health officials deny militants operate in Shifa - a hospital that employs some 1,500 people and has more than 500 beds. The Palestinians and rights groups accuse Israel of recklessly endangering civilians.\nMunir al-Boursh, a senior official with Gaza's Health Ministry inside the hospital, said that for hours, the troops ransacked the basement and other buildings, including those housing the emergency and surgery departments, and searched the grounds for tunnels. Troops questioned and face-screened patients, staff and people sheltering in the facility, he said, adding that he did not know if any were detained.\n'Patients, women and children are terrified,' he told the AP by phone Wednesday.\nThe military said its troops killed four militants outside the hospital at the start of the operation, but through days of fighting there were no reports of militants firing from inside Shifa. There were also no reports of any fighting within the hospital after Israeli troops entered.\nThe military said it was carrying out a 'precise and targeted operation' in a specific area of the hospital, and that its soldiers were accompanied by medical teams bringing in incubators and other supplies.\nAt one point, tens of thousands of Palestinians fleeing Israeli bombardment were sheltering at Shifa, but most left in recent days as the fighting drew closer. The fate of premature babies at the hospital has drawn particular concern.\nThe Health Ministry said 40 patients, including three babies, have died since Shifa's emergency generator ran out of fuel Saturday. There was no immediate word on the condition of another 36 babies, who the ministry said earlier were at risk of dying because there is no power for incubators.\nSmoke rises during an Israeli military bombardment of the northern Gaza Strip on Wednesday\nPeople are seen among the rubble of buildings destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Wednesday\nThe leaflets, dropped in areas east of the southern town of Khan Younis, warned civilians to evacuate the area and saying anyone in the vicinity of militants or their positions 'is putting his life in danger.' Similar leaflets were dropped over northern Gaza for weeks ahead of the ground invasion.\nTwo local reporters who live east of Khan Younis confirmed seeing the leaflets. Others shared images of the leaflets on social media.\nDefense Minister Yoav Gallant said Wednesday the ground operation will eventually 'include both the north and south. We will strike Hamas wherever it is.'\nThe military says it has largely consolidated its control of the north, including seizing and demolishing government buildings. Video released by the army Thursday showed soldiers moving between heavily damaged buildings through holes blown in their walls.\nOn Thursday, the military said it had blown up a residence belonging to Ismail Haniyeh, a senior Hamas leader based abroad. It was unclear if anyone was inside the building.\nMost of Gaza's 2.3 million people have already crowded into the territory's south, where a worsening fuel shortage threatens to paralyze the delivery of humanitarian services and shut down mobile phone and internet service.\nConditions in southern Gaza have been deteriorating as bombardment continues to level buildings. Residents say bread is scarce and supermarket shelves are bare. Families cook on wood fires for lack of fuel. Central electricity and running water have been out for weeks across Gaza.\nIsrael allowed a small amount of fuel to enter Gaza for on Wednesday, for the first time since the war began, so that the U.N. agency for Palestinian refugees, which is providing basic services to hundreds of thousands of people, could continue bringing limited supplies of aid through the Rafah crossing with Egypt.\nThe fuel cannot be used for hospitals or to desalinate water, and covers less than 10% of what the agency needs to sustain 'lifesaving activities,' said Thomas White, the agency's Gaza director.\nThe Palestinian telecom company Paltel, meanwhile, said it expected services to halt later Wednesday because of the lack of fuel or electricity. Gaza has experienced three previous mass communication outages since the ground invasion.\nIf Israeli troops move south, it is not clear where Gaza's population can flee, as Egypt refuses to allow a mass transfer onto its soil.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Moment Hamas leader Ismail Haniyeh's home is destroyed by Israel: IDF say property was used as a meeting point for group's leaders to direct terror attacks", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12756185/Moment-Hamas-leader-Ismail-Haniyehs-home-destroyed-Israel-IDF-say-property-used-meeting-point-groups-leaders-direct-terror-attacks.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}