{"authors": [], "date_download": "2024-02-05 15:38:58", "date_modify": "None", "date_publish": "2023-11-16 09:10:40", "description": "Palestinians in parts of southern Gaza say they received evacuation notices", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-palestinians-hamas-world-health-organization-b2448315.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/07/APTOPIX_Israel_Palestinians_47282.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPalestinians in parts of southern Gaza said they received evacuation notices Thursday. The signal that fighting is about to expand in the south comes a day after Israeli forces began searching a north Gaza hospital where they claimed Hamas militants operate — a claim that Hamas and hospital staff deny.\nOn Thursday, Saudi Arabia condemned the raid on Shifa Hospital, which has become a symbol of the widespread suffering of Palestinian civilians since Israel vowed to wipe out Hamas after the militant group launched its Oct. 7 incursion. Some 1,200 people have died in Israel, mostly during the initial attack, and around 240 were taken captive.\nThe Israeli military displayed what it said were Hamas weapons and military equipment it uncovered in Shifa Hospital. But so far, its search showed no signs of tunnels or a sophisticated command center. The Associated Press could not independently verify the Israeli claims that the weapons were found inside the hospital.\nOnly a quarter of Gaza’s hospitals are still functioning, either because they have been damaged or because they ran out of fuel, the World Health Organization said Wednesday.\nMore than 11,200 Palestinians — two-thirds of them women and minors — have been killed since the war began, according to the Health Ministry in Hamas-run Gaza, which does not differentiate between civilian and militant deaths. About 2,700 people have been reported missing.\nCurrently:\n— A protest in Washington calling for a cease-fire in the Israel-Hamas war ends in arrests.\n— The Israeli military has set its sights on southern Gaza in its campaign to stamp out Hamas.\n— Their families wiped out, grieving Palestinians in Gaza ask why.\n— ASEAN defense chiefs call for the fighting in Gaza to cease, but they struggle to address Myanmar.\n— Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war\nHere’s what's happening in the latest Israel-Hamas war:\nPOLICE SAY SHOOTERS OPEN FIRE AT A CHECKPOINT IN ISRAEL, WOUNDING 4\nJERUSALEM — Shooters opened fire Thursday at a checkpoint south of Jerusalem, wounding at least four people, one critically, Israeli police said.\nThe attackers arrived by car at the checkpoint on the main road connecting Jewish settlements in the West Bank and southern Jerusalem and opened fire at Israelis, police said, and at least three shooters were killed by security guards at the crossing. Police and bomb disposal units were searching for the area for additional shooters or suspicious activity.\nTensions have been rising as a result of the war in the Gaza Strip and deadly Israeli military raids in the West Bank. Violence has soared in the Israeli-occupied West Bank since the start of the war, with nearly 200 Palestinians killed, according to the Palestinian Health Ministry. Most were killed during gunbattles triggered by Israeli arrest raids or in violent demonstrations. Israel says it has arrested hundreds of people, mostly suspected Hamas members.\nSAUDI ARABIA CONDEMNS ISRAEL'S RAID ON SHIFA HOSPITAL\nRIYADH, Saudi Arabia — Saudi Arabia condemned Israel’s raid on Shifa Hospital in Gaza City, calling it a “blatant violation of international law” in a statement Thursday from the Foreign Ministry. It also condemned what it said was shelling near another hospital and called on international bodies to hold Israel accountable.\nIsrael says its troops are carrying out a targeted operation in Shifa, where it has long accused Hamas of maintaining an underground command center. Hamas and hospital staff have denied the allegations. Israeli forces searching the medical compound since early Wednesday say they have found guns and other indications that Hamas militants were inside, but have not shown any evidence regarding the alleged command center.\nHospitals can lose their protections under international law if combatants use them for military purposes. Even then, civilians must be given ample time and opportunity to flee and any action must be proportional to the military objective.\nBefore the war, Saudi Arabia was in talks with the United States over potentially normalizing relations with Israel.\n60 MORE NORWEGIANS WILL BE ALLOWED TO LEAVE GAZA\nCOPENHAGEN, Denmark — Another 60 Norwegian citizens will be able to leave Gaza on Thursday, the Foreign Ministry in Norway said, with Scandinavian Prime Minister Jonas Gahr Støre saying that they have received information from relatives that a citizen from the Nordic country was killed in Gaza.\nGahr Støre said that “many countries have several of their citizens in Gaza,” and it's estimated that of the approximately 250 people with ties to Norway in Gaza, more than half of them are children.\nThose able to leave Gaza will be able to enter into Egypt via the border crossing at Rafah. On Wednesday, Norway said it had been informed that 51 Norwegians could leave Gaza through Rafah.", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Palestinians in parts of southern Gaza receive notices to evacuate", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-palestinians-hamas-world-health-organization-b2448315.html"}