{"authors": [], "date_download": "2024-02-05 15:16:15", "date_modify": "None", "date_publish": "2024-01-23 19:22:03", "description": "Biden administration demands ‘urgent’ investigation into Israeli killing of American teen Tawfic Abdel Jabbar in West Bank", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Ftawfic-abdel-jabbar-biden-israel-b2483489.html.json", "image_url": "https://static.independent.co.uk/2024/01/23/17/1939161853.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPresident Joe Biden’s administration is calling for an investigation into the killing of a 17-year-old Palestinian-American who was fatally shot by Israeli forces in the West Bank last week.\nUS officials are “devastated” by the killing of Tawfic Abdel Jabbar, a US citizen, and demand an “urgent investigation to determine the circumstance of his death,” according to US State Department spokesperson Vedant Patel.\nMr Patel told reporters on Monday that the US Office of Palestinian Affairs has visited the teenager’s family and is connecting them with the US Embassy in Jerusalem.\n“We call on Israel to conduct a full, thorough, transparent investigation into his killing,” White House National Security Council spokesperson John Kirby told reporters on Monday. “And of course, we have every expectation that those responsible for it will be held properly accountable.”\nTawfic, the son of Palestinian immigrants, was raised, coincidentally, on the West Bank of the Mississippi River from New Orleans. He attended schools in nearby Gretna and an all-boys Catholic preparatory high school in New Orleans. Last year, he made a temporary move to the occupied territory, where his father grew up, to be closer to relatives and improve his Arabic before returning to the US for college, according to his family.\nOn 19 January, he was reportedly in a car in the village of Al-Mazra’a Al-Sharqiya, roughly 10 miles northeast of Ramallah, when an Israeli settler began firing at him and others, followed by fire from Israeli military, according to accounts from his family and Defence for Children International – Palestine.\nA statement from the Israel Defense Forces reported an off-duty police officer and a civilian “fired toward a Palestinian individual” who was reportedly throwing rocks.\nHis family and witnesses have disputed Israel’s account. “If they were throwing rocks 150 meters to the street, what is it going to do to a tank? Or to a jeep? Or to a car full of soldiers? You’re gonna shoot the car 10 times because a guy threw a rock?” his father Hafeth told NBC News.\nTawfic Abdel Jabbar (Defence for Children International – Palestine)\nHis father reported arriving at the scene to find his son bleeding in a truck with bullet wounds in his chest and neck, while people in IDF uniforms pointed guns at him and others with a warning to stay away from the area.\nAt his funeral on Saturday, his father called the US “killer machines” for its unflinching support of Israel’s military. “They are using our tax dollars in the US to support the weapons to kill our own children,” he said, according to the Associated Press.\nImages from Tawfic’s funeral show mourners gathering around his body as it lies on a bed of flowers with his head wrapped in a keffiyeh.\n“They demolished his dreams, not just his life. Instead of having produced a productive citizen, our tax money sent him to the grave. This is not right,” according to Nabil Abukhader, president of Masjid Omar, Tawfic’s hometown mosque in Harvey, Louisiana, where family and friends and Muslim community members held a packed vigil on Saturday.\n“Our administration should stand firm to stop this genocide,” he said, according to New Orleans newspaper Gambit. “And we should use our money and our influence to spread peace everywhere, for everybody.”\nThe mother of 17-year-old Palestinian Tawfic Abdel Jabbar mourns over his body before a funeral procession in the Israeli-occupied West Bank on 20 January. (AFP via Getty Images)\nIsraeli troops and settlers in the occupied West Bank have killed nearly 300 Palestinians, including dozens of children, in the wake of Hamas attacks in Gaza on 7 October and Israel’s ongoing siege, according to the United Nations Office for the Coordination of Humanitarian Affairs.\n“Palestinian children live in a hyper-militarized context where Israeli civilians illegally settled in occupied territory are armed by the Israeli government as a matter of official policy,” according to Ayed Abu Eqtaish, accountability program director at Defence for Children International – Palestine.\n“Israeli soldiers, police, and private security staff not only protect Israeli settler populations, but they also aid, abet, and perpetrate unlawful killings of Palestinians, including children,” he said.\nMore than 25,000 Palestinians have been killed by Israel’s attack on Gaza in the last three months, according to Gaza’s health ministry. Most of the victims were women and children.", "source_domain": "www.independent.co.uk", "text": null, "title": "US demands ‘urgent’ investigation into Israeli killing of American teen in West Bank", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/tawfic-abdel-jabbar-biden-israel-b2483489.html"}