{"authors": [], "date_download": "2024-02-05 15:39:04", "date_modify": "None", "date_publish": "2023-11-16 10:30:44", "description": "Residents say Israeli forces have dropped leaflets warning Palestinians to flee parts of southern Gaza", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhamas-ap-israel-gaza-palestinians-b2448267.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/07/Israel_Palestinians_86048.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsraeli forces dropped leaflets warning Palestinians to flee parts of southern Gaza, residents said Thursday, signaling a possible expansion of operations to areas where hundreds of thousands of people who heeded earlier evacuation orders are crowded into U.N.-run shelters and family homes.\nMeanwhile, soldiers continued searching Shifa Hospital in the north, in a raid that began early Wednesday but has yet to uncover evidence of the central Hamas command center that Israel has said is concealed beneath the complex. Hamas and staff at the hospital, Gaza's largest, deny the allegations.\nBroadening the offensive to the south — where Israel already carries out daily air raids — threatens to worsen an already severe humanitarian crisis in the besieged territory. Over 1.5 million people have been internally displaced in Gaza, with most having fled to the south, where food, water and electricity are increasingly scarce.\nThe war, now in its sixth week, was triggered by a wide-ranging Hamas attack into southern Israel on Oct. 7 in which the militants killed over 1,200 people, mostly civilians, and captured some 240 men, women and children. Israel responded with a weekslong air campaign and a ground invasion of northern Gaza, vowing to remove Hamas from power and crush its military capabilities.\nMore than 11,200 Palestinians have been killed, two-thirds of them women and minors, according to Palestinian health authorities. Another 2,700 have been reported missing, with most believed to be buried under the rubble. The official count does not differentiate between civilian and militant deaths.\nSOME GUNS, BUT SO FAR NO TUNNELS\nIsraeli troops on Wednesday stormed into Gaza’s largest hospital, searching for traces of Hamas inside and beneath the facility, where newborns and hundreds of other patients have suffered for days without electricity and other basic necessities.\nTroops were searching the underground levels of the hospital on Thursday and detained technicians responsible for running its equipment, the Health Ministry in Hamas-run Gaza said in a statement.\nAfter encircling Shifa for days, Israel faced pressure to prove its claim that Hamas was using the patients, staff and civilians sheltering there to provide cover for its fighters. The allegation is part of Israel's broader accusation that Hamas uses Palestinians as human shields.\nThe military released video from inside Shifa showed three duffel bags it said it found hidden around an MRI lab, each containing an assault rifle, grenades and Hamas uniforms, as well as a closet that contained a number of assault rifles without ammunition clips. The Associated Press could not independently verify the Israeli claims that the weapons were found inside the hospital.\nHamas and Gaza health officials deny militants operate in Shifa — a hospital that employs some 1,500 people and has more than 500 beds. The Palestinians and rights groups accuse Israel of recklessly endangering civilians.\nMunir al-Boursh, a senior official with Gaza’s Health Ministry inside the hospital, said that for hours, the troops ransacked the basement and other buildings, including those housing the emergency and surgery departments, and searched the grounds for tunnels. Troops questioned and face-screened patients, staff and people sheltering in the facility, he said, adding that he did not know if any were detained.\n“Patients, women and children are terrified,” he told the AP by phone Wednesday.\nThe military said its troops killed four militants outside the hospital at the start of the operation, but through days of fighting there were no reports of militants firing from inside Shifa. There were also no reports of any fighting within the hospital after Israeli troops entered.\nThe military said it was carrying out a “precise and targeted operation\" in a specific area of the hospital, and that its soldiers were accompanied by medical teams bringing in incubators and other supplies.\nAt one point, tens of thousands of Palestinians fleeing Israeli bombardment were sheltering at Shifa, but most left in recent days as the fighting drew closer. The fate of premature babies at the hospital has drawn particular concern.\nThe Health Ministry said 40 patients, including three babies, have died since Shifa’s emergency generator ran out of fuel Saturday. There was no immediate word on the condition of another 36 babies, who the ministry said earlier were at risk of dying because there is no power for incubators.\nLOOKING SOUTH\nThe leaflets, dropped in areas east of the southern town of Khan Younis, warned civilians to evacuate the area and saying anyone in the vicinity of militants or their positions “is putting his life in danger.” Similar leaflets were dropped over northern Gaza for weeks ahead of the ground invasion.\nTwo local reporters who live east of Khan Younis confirmed seeing the leaflets. Others shared images of the leaflets on social media.\nDefense Minister Yoav Gallant said Wednesday the ground operation will eventually “include both the north and south. We will strike Hamas wherever it is.”\nThe military says it has largely consolidated its control of the north, including seizing and demolishing government buildings. Video released by the army Thursday showed soldiers moving between heavily damaged buildings through holes blown in their walls.\nOn Thursday, the military said it had blown up a residence belonging to Ismail Haniyeh, a senior Hamas leader based abroad. It was unclear if anyone was inside the building.\nMost of Gaza’s 2.3 million people have already crowded into the territory’s south, where a worsening fuel shortage threatens to paralyze the delivery of humanitarian services and shut down mobile phone and internet service.\nConditions in southern Gaza have been deteriorating as bombardment continues to level buildings. Residents say bread is scarce and supermarket shelves are bare. Families cook on wood fires for lack of fuel. Central electricity and running water have been out for weeks across Gaza.\nIsrael allowed a small amount of fuel to enter Gaza for on Wednesday, for the first time since the war began, so that the U.N. agency for Palestinian refugees, which is providing basic services to hundreds of thousands of people, could continue bringing limited supplies of aid through the Rafah crossing with Egypt.\nThe fuel cannot be used for hospitals or to desalinate water, and covers less than 10% of what the agency needs to sustain \"lifesaving activities,” said Thomas White, the agency’s Gaza director.\nThe Palestinian telecom company Paltel, meanwhile, said it expected services to halt later Wednesday because of the lack of fuel or electricity. Gaza has experienced three previous mass communication outages since the ground invasion.\nIf Israeli troops move south, it is not clear where Gaza’s population can flee, as Egypt refuses to allow a mass transfer onto its soil.\n___\nChehayeb reported from Beirut. Associated Press writer Amy Teibel in Jerusalem contributed to this report.\n___\nFull AP coverage at https://apnews.com/hub/israel-hamas-war.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel signals wider operations in southern Gaza as search of hospital has yet to reveal Hamas base", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hamas-ap-israel-gaza-palestinians-b2448267.html"}