{"authors": [], "date_download": "2024-02-05 15:39:05", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Defence Minister Rajnath Singh on Monday held a telephonic conversation with his British counterpart Grant Shapps and discussed means to bolster closer defence", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031402%2Frajnath-singh-discusses-defence-ties-indo-pacific-with-uk-counterpart.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699885579.jpg", "language": "en", "localpath": null, "maintext": "New Delhi [India], November 13 (ANI): Defence Minister Rajnath Singh on Monday held a telephonic conversation with his British counterpart Grant Shapps and discussed means to bolster closer defence relations as well as the security issues in the Indo-Pacific region.\nAccording to the Defence Ministry, both Ministers discussed a range of defence and security issues with particular emphasis on the Indo-Pacific. They briefly reviewed the ongoing engagements and discussed possible cooperation in new domains.\nThe two leaders explored ways and means to develop closer defence relations. Grant Shapps also invited Rajnath Singh to visit the UK in the near future.\nSingh also congratulated Shapps on his appointment as the Secretary of State for Defence.\n\"Had a telephonic conversation with the UK Secretary of State for Defence Mr Grant Shapps. We discussed a range of defence and security related issues with particular emphasis on the Indo-Pacific,\" Rajnath Singh posted on X (formerly Twitter).\nShapps was appointed as the new Defence Secretary of United Kingdom in August, after Ben Wallace resigned from his position.\nNotably, External Affairs Minister S Jaishankar is also on a four-day visit to the UK. He celebrated Diwali by offering prayers at the BAPS Shri Swaminarayan Mandir (Neasden Temple) in London.\nEarlier in the day, he met former PM Tony Blair and discussed bilateral ties.\nHe also met UK Prime Minister Rishi Sunak and his wife Akshata Murty at 10 Downing Street on Sunday and conveyed the best wishes of Prime Minister Narendra Modi on Diwali, and also gifted him a Lord Ganesha statue and a cricket bat signed by Indian batting great Virat Kohli.\nMeanwhile, Rajnath Singh during the election campaigning in Chhattisgarh slammed Congress over the ED's claims in connection with the alleged Mahadev betting app scam.\nSingh said that it seems even 'Mahadev' -- another name for Lord Shiva -- has decided that the \"corrupt\" Congress government should be \"dislodged from power and the BJP should return to the hustings\". (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Rajnath Singh discusses defence ties, Indo-Pacific with UK counterpart", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031402/rajnath-singh-discusses-defence-ties-indo-pacific-with-uk-counterpart"}