{"authors": [], "date_download": "2024-02-05 15:39:06", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "David Cameron has made a comeback to the British government after being appointed as the UK's new foreign secretary Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031443%2Fex-uk-pm-makes-sensational-return-as-foreign-secretary.json", "image_url": "https://cdn.bignewsnetwork.com/NTEwYjlmMDMtNGM.jpg", "language": "en", "localpath": null, "maintext": "David Cameron led the country between 2010 and 2016, stepping down after the Brexit referendum\nFormer UK Prime Minister David Cameron has made a surprise comeback to the British government after being appointed to head the country's Foreign Office by incumbent PM Rishi Sunak. Cameron, who led the country for six years, resigned in 2016 after the UK voted to leave the European Union.\nThe move was announced by Downing Street on Monday as part of a major cabinet reshuffle. Cameron was picked to succeed James Cleverly, who in turn was chosen to replace the recently sacked Home Secretary Suella Braverman. Braverman was given the boot after a row over the policing of pro-Palestinian protests in London, which she branded as \"hate marches.\"\nCommenting on his appointment, Cameron wrote on X (formerly Twitter) that \"we are facing a daunting set of international challenges, including the war in Ukraine and the crisis in the Middle East,\" saying the UK must \"stand by\" its allies.\nHe added that while he \"may have disagreed with some individual decisions\" of the British government, he described Rishi Sunak as \"a strong and capable Prime Minister, who is showing exemplary leadership at a difficult time\" while vowing to do his best in the new role.\nThe 57-year-old veteran politician became the leader of the Conservative Party in 2005 and became prime minister in 2010. During Cameron's tenure, his government dealt with the aftermath of the 2008 global financial crisis and oversaw the 2012 London Olympics. Cameron has also positioned himself as an ardent supporter of Britain's membership in the EU in the months leading up to the Brexit referendum.\nIn 2016, he resigned as both prime minister and Conservative Party leader after Leave supporters won the vote by a 3% margin. While Cameron has been out of frontline politics for many years, in 2018, the Sun reported that he would like to return to the public spotlight, preferably as foreign secretary.", "source_domain": "www.theuknews.com", "text": null, "title": "Ex-UK PM makes sensational return as foreign secretary", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031443/ex-uk-pm-makes-sensational-return-as-foreign-secretary"}