{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:39:07", "date_modify": "None", "date_publish": "2023-11-16 10:08:22", "description": "Ukraine had claimed on Tuesday to have secured a foothold on the eastern bank 'against all odds', a potentially major setback for Russian occupation forces in the south.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12756527%2FRussia-admits-Ukrainian-troops-crossed-Dnipro-river-set-positions-crucial-east-bank-latest-blow-Putin-Kremlin-warns-fiery-hell-awaits-Zelenskys-men.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/10/77870295-0-image-a-21_1700129214396.jpg", "language": "en", "localpath": null, "maintext": "Russia has finally admitted that Ukrainian troops have been able to cross the vast and strategically crucial Dnipro River and set up positions in yet another battlefield blow for Putin.\nKyiv said Ukrainian soldiers had managed 'against all odds' to gain a foothold on the occupied east bank of the river in the Kherson region, a potentially major setback for Russia in the south where Ukraine is trying to open a new line of attack.\nThey are now trying to push the Kremlin's invading forces back from the eastern bank of the river, which serves as a formidable natural barrier on the battlefield.\nLast night Russia admitted for the first time that some Ukrainian troops had established positions on the Moscow-held side of the river.\nThe Moscow-installed head of Ukraine's Kherson region, Vladimir Saldo, admitted the existence of 'small groups' of Ukrainian soldiers stretched along the eastern bank.\nBut he insisted Ukrainian forces were being met by 'fiery hell' from Russian artillery, rockets and drones, enduring heavy losses.\nRussian and Ukrainian forces have been entrenched on opposite sides of the river since Moscow withdrew from the western part of Kherson region last November. Since then, both sides have failed to make decisive gains, despite staging numerous offensives.\nA group of Ukrainian marines sail from the riverbank of Dnipro at the frontline near Kherson, Ukraine, Saturday, October 14, 2023\nA Ukrainian serviceman jumps out of the boat onto the shore of Dnipro at the frontline near Kherson, Ukraine, Sunday, October 15, 2023\nRussian-installed leader of the Kherson region Vladimir Saldo attends unveiling of the monument to Kirill Stremousov in Simferopol, Crimea, November 9, 2023\nUkrainian servicemen fire an artillery during an anti drone drill in Chernigiv region on November 11, 2023\nRussia's Saldo said on Wednesday that 'about one and a half enemy companies, mostly in small groups,' were currently on the Russian-held side.\nAccording to Russia's TASS news agency, a company in the Russian military consists of anything from 45 to 360 soldiers.\nHe also claimed Ukraine had lost 'at least one and a half to two full battalions' trying to cross, that morale was low and that the average life-span of a Ukrainian soldier on the bank is 'little more than two days'.\nHis comments were the first admission by a senior Russian official that Ukraine had managed to secure some positions on the Russian-controlled side of the river.\nSaldo said Ukrainian forces were operating in small groups spread over an area from a railway bridge to the village of Krynky, a distance of around 20 km (12 miles).\nThe village of Krynky lies close to the Dnipro around 30 km northeast of the city of Kherson, which Ukraine recaptured almost exactly a year ago.\nHe added that Ukrainian forces were pinned down in basements in the day and predicted the Ukrainian assault would be thwarted.\nFor Ukraine, a sustained breakthrough would mark a significant tactical success for Kyiv, whose wider counteroffensive has so far failed to turn the tide after 21 months.\nMilitary expert Oleksandr Kovalenko told media outlet RBK Ukraine that the growing area of contested control on the eastern bank 'significantly reduces the mobility and capability of the Russian occupiers'.\nSince mid-October, Russian military bloggers close to the armed forces have been reporting that small groups of Ukrainian troops were successfully crossing the river.\nPhotographs from the frontline showed marines sailing the Dnipro near Kherson on October 14 and 15.\nBut until now, neither side has been able to decisively break the deadlock.\nBoggy, swamp-like terrain makes amphibious landings difficult, and Russia has significant access to manpower and equipment on the eastern side of the river.\nRiver crossings are also dangerous in warfare, leaving soldiers exposed and unable to quickly retreat if engaged.\n'Against all the odds, Ukraine's defence forces have gained a foothold on the left (eastern) bank of the Dnipro,' President Volodymyr Zelenskiy's chief of staff said on Tuesday.\nThe official, Andriy Yermak, said Ukraine's counteroffensive, launched in June, was 'developing' and that Kyiv knew 'how to achieve victory'.\nThe Kremlin has refused to acknowledge whether Ukraine's attempts to land on the other side of the river were working, deferring questions to the defence ministry instead.\nThe ministry has said separately that it had captured a small group of Ukrainian soldiers 'trying to land on the left bank'.\nBoth Kyiv and Moscow regularly claim to have killed high numbers of 'enemy' soldiers, though neither side comments on their own losses.\nUkrainian soldiers of the 67th brigade prepare a grenade launcher at their fighting position on the frontline, in the direction of Kreminna, Donetsk Oblast, Ukraine on November 15, 2023\nA Ukrainian serviceman of the 123rd Territorial Defense Brigade rests next to boxes of mortar shells, in an undisclosed location near the Dnipro River in the Kherson region, on November 6\nUkrainian servicemen of the 123rd Territorial Defense Brigade prepare to fire a mortar over the Dnipro River toward Russian positions, in the Kherson region, on November 6\nMortar shells with the messages 'For children and grandchildren', 'For Odesa' written on them, at an undisclosed position near Kherson, on November 6\nSaldo's rare admission came as President Volodymyr Zelensky said it had been a 'difficult day' for Kyiv due to deadly Russian strikes in the east of the country.\nTwo rescue workers arriving at the scene of a Russian strike in Zaporizhzhia region were killed by a second strike, Interior Minister Igor Klymenko said on social media.\n'Rescuers were at the scene in a matter of minutes. Then the occupiers struck again,' he said.\nThe victims were 31 and 34 years old, he added.\nIt was not immediately clear where or when the attack took place.\nThe region's governor had said earlier that Russia launched three rocket attacks at a town in Zaporizhzhia region Wednesday, killing one person and injuring seven others.\nMeanwhile, Britain's new Foreign Secretary - former Prime Minister David Cameron - made a surprise visit to Kyiv, announced on Thursday, and vowed to keep up military support for Ukraine.\n'We will continue to give you the moral support, diplomatic support, the economic support, but above all, the military support, that you need not just this year, and next year, but for however long it takes,' Cameron said during a meeting with Zelensky.\n'Russia thinks it can wait this war out, and that the West will eventually turn its attention elsewhere. This could not be further from the truth,' he added in a separate statement.\nZelensky has expressed concerns in recent weeks that Ukraine may become a lesser priority among backers as attention shifts to the escalating conflict between Israel and Hamas in the Middle East.'\n'Now you know the world is not focused on the situation on our battlefield in Ukraine and dividing the focus really does not help,' Zelensky told Cameron in a video distributed by the presidency.\nUkraine's foreign ministry said Cameron had also attended talks with his counterpart Dmytro Kuleba on issues related to weapon deliveries, arms production, and maritime security in the Black Sea.\nUkraine's President Volodymyr Zelenskiy welcomes Britain's Foreign Secretary David Cameron before their meeting, in this handout picture released November 16, 2023\nDavid Cameron made a surprise visit to Kyiv, announced on Thursday, and vowed to keep up military support for Ukraine\nA woman prays at a church in Posad-Pokrovske, a village heavily damaged last year during confrontation of Russian troops and Ukrainian army, in Kherson region, on November 4, 2023\nFarmer Volodymyr Melnikovych looks at the ruins of his farm after a recent Russian rocket attack in the village of Kiseliovka close to Kherson, Ukraine, Friday, November 10, 2023\nRussia was also today accused of pre-planning to pillage over $1bn of Ukrainian grain each year in order to fund its invasion of Ukraine.\nA report shared by Global Rights Compliance, an international human rights law firm, revealed 'significant evidence' of the 'weaponisation' of grain on 'an unprecedented scale'.\nThe group highlighted forced seizures of grain facilities from Ukrainian farmers and corporations, taking control of network links to send grain east, into Russia.\nData pooled between December 2021 and July 2023 built on open-source research, analysing and verifying photographs, videos, public statements by officials and 'other digital data'.\nAs early as March 1, 2022, one farmer in Zaporizhzhia reported that his farm had been taken over by Russian forces.\nWithin two weeks, Russian officials were publicly sharing plans to rapidly increase grain exports by using occupied ports.\n'The speed at which Russia targeted and took over Ukraine's grain infrastructure in these regions speaks to a highly coordinated level of pre-planning,' according to a GRC statement.\nYousuf Syed Khan, Senior Lawyer at Global Rights Compliance, said: 'The highly systematised weaponisation of Ukraine's grain that we are documenting is unprecedented in modern history, and has involved extremely intricate pre-planning.\n'It is purposefully designed to deny food to civilian populations in third-States.\n'Russia is doing this to fund its unlawful war effort, to elicit sanctions relief on the world stage, to buy votes in international fora, and to represent itself as the legitimate authority of Ukrainian territory, in turn also weakening Ukraine's national economy.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Russia admits Ukrainian troops have crossed the Dnipro river and set up positions on its crucial east bank in latest blow for Putin - but Kremlin warns 'fiery hell' awaits Zelensky's men", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12756527/Russia-admits-Ukrainian-troops-crossed-Dnipro-river-set-positions-crucial-east-bank-latest-blow-Putin-Kremlin-warns-fiery-hell-awaits-Zelenskys-men.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}