{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:16:16", "date_modify": "None", "date_publish": "2024-01-23 10:08:07", "description": "Under a new proposal, Israel is apparently open to exchanging more Palestinian prisoners in return for all of the remaining hostages still held in Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12995321%2Fisrael-two-month-gaza-ceasefire-release-hostage-stomed-parliament-building.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/23/10/80346207-0-image-m-30_1706004416212.jpg", "language": "en", "localpath": null, "maintext": "Israel is seeking a two month ceasefire with Hamas in Gaza to ensure the safe release of some 130 hostages still trapped in the enclave, reports claim.\nUnder a new proposal, Israel is open to exchanging more Palestinian prisoners in return for all the remaining hostages and the bodies of those who have died since the conflict erupted on October 7, American outlet Axios reported late on Monday.\nQatari and Egyptian mediators have already helped facilitate urgent talks between the warring parties that would look to pause but not decisively end the war in the Middle East, the report claims.\nOfficials said they were waiting for a response from Hamas - but claimed to be cautiously optimistic talks would progress in the coming days.\nThe claims come just one day after aggrieved families of hostages stormed the Knesset, Israel's parliament, to demand the safe return of loved ones after nearly two months without an exchange.\nFamilies and supporters also mobilised outside Israeli Prime Minister Benjamin Netanyahu's Jerusalem residence on Monday, holding up photos of hostages emblazoned with demands to 'bring them home now'.\nHamas has also ramped up demands for Israel to end the bombardment of the Gaza Strip or risk further casualties. Earlier this month, the group released a video of hostages, apparently under duress, calling for an end to the hostilities from within Gaza - before claiming two had since been killed in airstrikes by Israel's Defense Forces.\nFamilies of hostages and supporters take part in a protest to call for the immediate release of hostages in Gaza outside the Israeli PM's residence, in Jerusalem January 22, 2024\nA woman calls for the return of Alex Dancyg outside Netanyahu's residence in Jerusalem, January 22, 2024\nProtesters held up signs and chanted slogans in a Knesset parliamentary session yesterday\nAccording to Axios, Israel would look to see a multi-phase hostage-prisoner swap potentially lasting two months, in which women, men over 60 and hostages in critical medication condition would be prioritised for release.\nThe proposed deal would aim to agree a set number of Palestinian prisoners to be returned to Gaza in return for hostages travelling the other way, before working out the finer details of each individual negotiation.\nIsraeli officials would even be willing to redeploy the IDF outside of main population centres, as pressure mounts from Israel's allies to minimise the number of civilian casualties inside the Gaza Strip.\nBut the proposal does not make provisions for Israel to formally end the war or to release all 6,000 Palestinians held within Israeli prisons, Axios reported.\nThe claims come at the height of recent clashes between the government and the families of hostages urging the safe release of their loved ones.\nLast night, protestors wielding signs calling for the release of hostages amassed outside the Israeli PM's Jerusalem residence as relatives stormed a parliamentary committee nearby.\nSome 20 people interrupted the Knesset Finance Committee discussion with placards reading: 'You will not sit here while they die there. Get up from your chairs.'\nThe group chanted: 'Release them now, now, now!'\nIt was the latest in a string of deliberate disturbances to challenge the government on its stated aim of returning hostages snatched from Israel last October.\nSome 240 were taken as Hamas descended on small localities in southern Israel on the morning of October 7, 2023.\nIsrael and Hamas agreed to a week's truce in November that saw a significant prisoner swap of some 110 held captive in Gaza in return for some 180 Palestinians held in Israel.\nSince then, Israel has returned to its bombing campaign over the beleaguered Strip, paving the way for infantry forces to sweep through major population centres in the north, south and centre for Hamas hideouts.\nAid workers in Khan Younis, southern Gaza, told MailOnline in December conditions were much worse than before the ceasefire and that people were struggling to access food, water and medical supplies.\nBut Hamas has reportedly rejected peace proposals from Israel in the weeks since as international pressure mounts on Israel to show restraint in Gaza either way.\nDr Andreas Krieg, Assistant Professor of Defence Studies at King's College London, told MailOnline that Hamas' ceasefire demands have changed as Israel 'realises this operational tempo is not sustianable'.\nWhere many of those released in the first ceasefire were civilians, a new list will include 'Palestinian Islamic Jihad terrorists and other high ranking, high profile terrorists', and demands will include 'some sort of permanent ceasefire'.\nIt will be harder for Israel to justify the release of such groups than civilians previously held.\nNonetheless, Hamas has requested the release of all Palestinian security prisoners in Israel in return for the remaining hostages, while turning down an ambitious proposal by Egypt to end the fighting and move towards a singular Palestinian government that could include Hamas late last year.\nHamas is 'realising the IDF is not making the progress that they thought they were making and the IDF is realising that this military solution is going to take years, Dr Krieg said.\n'But there is no stomach in the US or domestically to keep this going at the current rate so something has got to give.'\nThe families of hostages have also called on Israel to scale back operations following reports IDF soldiers had accidentally shot dead hostages while operating in the Strip's dense urban environment.\nIn December, the IDF took responsibility for the accidental deaths of three hostages revealed to have been shouting 'help' in Hebrew and waving white flags when they were gunned down earlier on Friday morning.\nA day later, the killing of a Christian mother and child sheltering in a church in Gaza fueled concerns about how the IDF was operating in Gaza.\nAnd this month, Hamas released a video reportedly showing the bodies of two Israeli hostages they claimed were killed in Israeli airstrikes.\nMia Schem, 21, reunites with her family following her release from Gaza, November 30, 2023\nSmoke billows over Khan Yunis in the southern Gaza Strip during Israeli bombardment, January 22, 2024\nCritics have otherwise urged Israel's government not to risk antagonising Hamas with new policies like widened provisions for the death penalty that they believe could put the lives of hostages at further risk.\nThey remain a minority voice in Israel, with just 1.8 per cent of Israelis today believing the IDF is using too much firepower in Gaza.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel 'proposes TWO MONTH Gaza ceasefire to secure the release of remaining 130 Hamas hostages' - a day after furious families stormed parliament building demanding action", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12995321/israel-two-month-gaza-ceasefire-release-hostage-stomed-parliament-building.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}