{"authors": [], "date_download": "2024-02-05 15:39:17", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "External Affairs Minister S Jaishankar who is currently on a visit to the UK met with his British counterpart David Cameron and discussed progressing a Free Tra", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274032173%2Fjaishankar-cameron-discuss-progressing-india-uk-free-trade-agreement.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699944146.jpg", "language": "en", "localpath": null, "maintext": "London [UK], November 14 (ANI): External Affairs Minister S Jaishankar who is currently on a visit to the UK met with his British counterpart David Cameron and discussed progressing a Free Trade Agreement and partnerships on defence, science and technology.\nDuring the meeting on Monday, the two leaders reflected on the strength of the UK-India relationship, including meeting the ambition of the UK-India 2030 Roadmap, according to the UK's Foreign, Commonwealth and Development Office.\n\"The Foreign Secretary and Jaishankar also discussed progressing a free trade agreement and partnerships on defence, science and technology,\" it said.\nThe duo also discussed shared global challenges, including the situation in Israel and Gaza and the war between Russia and Ukraine.\n\"They discussed shared global challenges, including the concerning situation in Israel and Gaza and Russia's illegal war in Ukraine. In the meeting, they also covered the importance of the Indo-Pacific region to global growth and prosperity,\" the UK's Foreign, Commonwealth and Development Office said in a statement.\nNotably, India and the UK are negotiating a Free Trade Agreement (FTA). Talks for FTA between India and the UK started in 2022 and the 12th round of negotiations took place from August 8-31 this year.\nThe India-UK Comprehensive Strategic Partnership was launched in 2021 along with the India-UK Roadmap 2030, according to the Ministry of External Affairs. The Roadmap is a commitment to a partnership that delivers for both countries.\nMeanwhile, Jaishankar said that he congratulated David Cameron on his appointment as UK Foreign Secretary. Jaishankar stated that he looked forward to working with Cameron closely.\nTaking to X, Jaishankar stated, \"A pleasure to meet UK Foreign Secretary @David_Cameron this afternoon on his first day in office. Congratulated him on his appointment. Held a detailed discussion on realizing the full potential of our strategic partnership. Also exchanged views on the situation in West Asia, the Ukraine conflict and the Indo-Pacific. Look forward to working with him closely.\"In a cabinet reshuffle by UK PM Rishi Sunak, former Prime Minister David Cameron was appointed UK Secretary of State for Foreign, Commonwealth and Development Affairs, Downing Street informed on Monday. This comes after Sunak sacked his Home Secretary Suella Braverman.\nJaishankar, who is on a five-day visit to the UK, called on Sunak and his wife Akshata Murty at 10 Downing Street and conveyed the best wishes of Prime Minister Narendra Modi on Diwali on Sunday.\nJaishankar along with his wife, Kyoko Jaishankar met with the UK PM and presented him a Lord Ganesha statue and a cricket bat signed by Indian batting great Virat Kohli.\nTaking to his official handle on X, EAM Jaishankar shared details about his meeting with the UK PM, posting, \"Delighted to call on Prime Minister @RishiSunak on Diwali Day. Conveyed the best wishes of PM @narendramodi. India and UK are actively engaged in reframing the relationship for contemporary times. Thank Mr. and Mrs. Sunak for their warm reception and gracious hospitality.\" (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Jaishankar, Cameron discuss progressing India-UK Free Trade Agreement", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274032173/jaishankar-cameron-discuss-progressing-india-uk-free-trade-agreement"}