{"authors": ["Helen Sullivan", "Abené Clayton", "Maya Yang", "Gloria Oladipo"], "date_download": "2024-02-05 15:39:18", "date_modify": "None", "date_publish": "2023-11-16 05:12:25", "description": "US and Chinese president kick off bilateral with handshake and cordial words at summit aimed to ease tensions", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2Flive%2F2023%2Fnov%2F15%2Fus-china-biden-xi-meeting-republicans-congress-politics-latest-updates.json", "image_url": "https://i.guim.co.uk/img/media/e733159e5ad6abce48020354649399e4619e44ce/939_58_3582_2150/master/3582.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=98aa90af0ad69da6ed7701e1360e47aa", "language": "en", "localpath": null, "maintext": "From 16 Nov 2023 02.38 CET Joe Biden announced that military-to-military contacts will resume between the US and China During his San Francisco press conference, the US president said military-to-military contacts will resume between the two countries. Biden said: That’s how accidents happen. Misunderstandings. So we’re back to direct, open, clear communications on a direct basis.\nUpdated at 02.48 CET\n16 Nov 2023 06.07 CET Julian Borger Joe Biden has claimed that his summit meeting with Xi Jinping has brought substantial progress, including agreements on limiting narcotics trafficking, restoring militaries lines of communication, and to start talking about the global risks posed by artificial intelligence. However, it was clear that after more than four hours of talks in a mansion outside San Francisco, the meeting had not brought the US and China any closer on the fate of Taiwan, which Xi reportedly told Biden was “the biggest, most potentially dangerous issue in US-China relations”. Furthermore, Biden himself risked undoing some of the bridge-building at the summit, the first between the two leaders for a year, with an off-the-cuff response to a reporter’s question at the tail-end of a press conference, in which he confirmed he still looked on Xi as a dictator. “Look, he is,” the president said. “He’s a dictator in the sense that he’s a guy who runs a country that is a communist country that’s based on a form of government totally different than ours.” Joe Biden hails progress after Xi Jinping talks but Taiwan still the sticking point Read more\nUpdated at 06.08 CET\n16 Nov 2023 05.54 CET Summary This blog is closing shortly. Here is a summary of of the meeting between Joe Biden and Xi Jinping: US President Joe Biden and Chinese leader Xi Jinping held their first face-to-face talks in a year on Wednesday, and agreed to open a presidential hotline, resume military-to-military communications and work to curb fentanyl production. Biden and Xi met for about four hours on the outskirts of San Francisco to discuss issues that have strained US-Chinese relations.\nThe two leaders “agreed Wednesday to resume on the basis of equality and respect high-level military-to-military communication,” Beijing state media said after the meeting. China severed military contact after then-House of Representatives Speaker Nancy Pelosi visited Taiwan in August 2022.\nBiden announced this in remarks after the talks, saying, “We’re back to direct, open clear direct communication on a direct basis,” and, “That’s how accidents happen […] misunderstandings. So we’re back to direct, open, clear communications on a direct basis.”\nUS Secretary of Defense Lloyd Austin will meet his Chinese counterpart when that person is named , a senior US official said.\nBiden said he and Xi agreed to high-level communications. “He and I agreed that each one of us can pick up the phone call directly and we’ll be heard immediately.”\nAhead of the meeting Xi and Biden also pledged to cooperate more closely to fight climate change, both countries said that they would commit to “economy-wide” nationally determined contributions across all greenhouse gases, not just CO2.\nDuring the meeting Xi Jinping called the partnership between the US and China “the most important bilateral relationship in the world”, and said that he and Joe Biden “shoulder heavy responsibilities for the two peoples, for the world and for history”.\nBiden emphasised the value of the two leaders speaking in person, telling Xi, “There’s no substitute to face-to-face discussions”. Biden also said, “We have to ensure that competition does not veer into conflict,” and that the two countries, “also have to manage it responsibly … and work together when we see it in our interest to do so.”\nChinese leader Xi Jinping warned US President Joe Biden at a summit to stop arming Taiwan, Beijing said Thursday. “The US side should... stop arming Taiwan, and support China’s peaceful reunification,” Xi told Biden, according to a readout from China’s foreign ministry. “China will realise reunification, and this is unstoppable,” the Chinese leader said of the future of the self-ruled island, which Beijing has pledged to re-take one day.\nWhen asked by a reporter whether or not he trusted Xi Jinping in the contest of their joint efforts to reduce the flow fentanyl, Biden said, “I know the man, I know his modus operandi…he’s been straight.” He added that he and Xi talked about Taiwan’s election and Biden “expects no interference” from China’s government.\nIn addition, the summit saw the two men agree to set up joint government talks on the use of artificial intelligence, as well as a working group on counternarcotics cooperation, Xinhua news agency said. They further committed to work towards stepping up scheduled passenger flights between their countries early next year. And they agreed to deepen cooperation on climate change and step up joint efforts ahead of this month’s COP28 summit in Dubai.\nXi told Biden that China did not seek to “surpass or unseat the United States” and stressed that “the United States should not scheme to suppress and contain China”.\n“China will not follow the old path of colonisation and plunder, nor will it follow the wrong path of hegemony when a country becomes strong,” Xi said, according to Xinhua. China’s development, he said, “will not be stopped by external forces”.\nXi also warned Washington that Beijing was dissatisfied with sanctions and other measures against its companies. “US actions against China regarding export control, investment screening and unilateral sanctions seriously hurt China’s legitimate interests,” Xi said. “Suppressing China’s science and technology is curbing China’s high-quality development and depriving the Chinese people of their right to development.”\nFollowing the meeting, the White House said that the US president and Chinese president had a “candid and constructive” conversation on a range of issues, including international diplomacy.\nBiden also doubled down on comments he made in June calling Xi Jinping a “dictator.” In response to a question from a reporter Biden said, “Well look, he is, he’s a dictator in the sense that he is a guy who runs a country that is a Communist country, based on a form of government that is totally different from ours.”\nIn addition to fielding questions about his meeting with Xi, Joe Biden was pressed by reporters about the Israel-Hamas war. Among other comments about hostage negotiations and his approval of Benjamin Netanyahu’s military actions Biden said of the Israel-Hamas war, “I don’t know how long it’s going to last but it won’t end until there’s a two-state solution.”\n16 Nov 2023 05.46 CET Julian Borger Joe Biden has presented an unapologetic defence of his refusal to call for a ceasefire in Gaza, arguing that Hamas presented a continuing threat to Israel and that Israeli forces were seeking to avoid civilian casualties. After a summit meeting with Chinese president Xi Jinping on the sidelines of the Apec summit in San Francisco, Biden told reporters on Wednesday night: “Hamas has already said publicly that they plan on attacking Israel again like they did before, cutting babies’ heads off, burning women and children alive. So the idea that they’re going to just stop and not do anything is not realistic.” Reports that Hamas beheaded babies in the 7 October attack on Israeli civilians remain unconfirmed, though the brutality of the massacre in which about 1,200 people were killed is not in doubt. The Israeli military made the claim in the first few days after 7 October, but the claims have not been independently verified. Joe Biden issues strident defence of refusal to call for ceasefire in Gaza Read more\n16 Nov 2023 05.36 CET Here is our video report on the meeting between Biden and Xi: 00:02:13 Talks with Xi Jinping 'some of the most productive discussions we've had', says Biden - video\n16 Nov 2023 05.29 CET Bilateral meetings aren’t always conducive to a personal touch, and Biden and Xi were flanked by advisers on opposite sides of a long table. However, a senior administration official said they spoke about their wives, and Biden wished Xi’s wife a happy birthday. The official, who requested anonymity to discuss a private conversation, said Xi was embarrassed, and he admitted that he had forgotten his wife’s upcoming birthday because he’s been working so hard.\n16 Nov 2023 05.23 CET Biden and Xi go back years, and Biden often repeats the story of their meetings when they were both vice presidents, the Associated Press reports. But on Wednesday, it was Xi’s turn to reference their previous encounters during brief public remarks, although he eschewed the embellishments that Biden usually adds to the tale. “It was 12 years ago,” Xi said. “I still remember our interactions very vividly, and it always gives me a lot of thoughts.” Biden also emphasised the length of their relationship and the value of their interactions. “We haven’t always agreed, which was not a surprise to anyone, but our meetings have always been candid, straightforward and useful,” Biden said. He added that “it’s paramount that you and I understand eachother clearly, leader to leader, with no misconceptions or miscommunication.”\n16 Nov 2023 05.09 CET Key takeaways: Xi asked Biden to lift sanctions and change export controls Xi arrived in San Francisco at a time of economic challenges back in China, where an ageing population and growing debt have hampered its recovering from the Covid-19 pandemic. According to Beijing’s description of the meeting, Xi pressed Biden to lift sanctions and change policies on export controls for sensitive equipment. “Stifling China’s technological progress is nothing but a move to contain China’s high-quality development and deprive the Chinese people of their right to development,” the readout said. “China’s development and growth, driven by its own inherent logic, will not be stopped by external forces.” There’s no indication that Biden will agree to take such steps. But even the meeting itself could calm jittery nerves back in China, where there have been signs foreign investment is tapering off. Zhang Lei, a Chinese businessman whose company, Cheche Group, is listed on Nasdaq, said high-level meetings such as the one between Biden and Xi can help assure companies that have been hesitant to invest in China. “Confrontations don’t work,” he said. “You don’t make money with confrontations.”\n16 Nov 2023 04.56 CET Key takeaways: Biden asked Xi to use his influence on Iran and Russia Beijing has long sought to be treated as an equal by Washington, and Biden sought to leverage those ambitions with Xi to address two devastating wars. In their private session, Biden appealed to Xi to use his influence to try to calm global tensions, particularly to try to pressure Iran not to widen the conflict between Israel and Hamas. A US official said Biden did most of the talking on the matter, and that Xi mostly listened, and that it was too soon to tell what sort of message China was sending to Tehran and how it was being received. Biden has also pressed Xi to continue to withhold military support for Russia’s invasion of Ukraine.\n16 Nov 2023 04.44 CET Key takeaways: China says it will curb the production of fentanyl-related products AP: Xi agreed to help curb the production of the illicit fentanyl that is a deadly component of drugs sold in the United States. A senior administration official, who spoke on the condition of anonymity to discuss a private meeting, said the shift will be a setback for Latin American drug dealers. “It’s going to save lives, and I appreciated President Xi’s commitment on this issue,” Biden said at a press conference after his meeting. Beijing state media said after the meeting that the two leaders “agreed Wednesday to resume on the basis of equality and respect high-level military-to-military communication”. When asked by a reporter whether or not he trusted Xi in the contest of their joint efforts to reduce the flow fentanyl, Biden said, “I know the man, I know his modus operandi…he’s been straight.”\nUpdated at 05.09 CET\n16 Nov 2023 04.29 CET Key takeaways: Taiwan Biden and Xi held a “clear-headed” and “not heated” discussion on Taiwan, the most sensitive topic in the relationship, with the greatest potential to spiral into wider conflict. Biden said he reaffirmed the United States’ “One China” policy and its belief that any resolution must be peaceful. “I’m not going to change that,” Biden said. “That’s not going to change.” Biden said in the press conference after the meeting that he and Xi talked about Taiwan’s election and Biden “expects no interference” from China’s government. He reiterated, though, that the US would continue to arm Taiwan as a deterrent against any attempt by China to use force to reunify the self-governing island with the mainland. The US had maintained strategic ambiguity about whether it would directly intervene to protect Taiwan in the event of an invasion by Beijing. Xi, a US official said, told Biden he had no plans to invade the island, though Biden chided him for China’s massive military build-up around Taiwan. Biden also called on China to avoid meddling in Taiwan’s elections next year. Xi warned US President Joe Biden at a summit to stop arming Taiwan, according to a readout from China’s foreign ministry.\n“The US side should... stop arming Taiwan, and support China’s peaceful reunification,” Xi told Biden.\n“China will realise reunification, and this is unstoppable,” the Chinese leader said of the future of the self-ruled island, which Beijing has pledged to re-take one day.\n16 Nov 2023 04.15 CET In an interview with the Associated Press, Zoe Liu, a fellow for China studies at the Council for Foreign Relations, has described the meeting between Biden and Xi as a positive step, albeit an incremental one. “These agreements will not change the structural challenges in the bilateral relations, but it paves the way for more detailed working-level discussions, which is more important,” she said.\n16 Nov 2023 04.10 CET Key takeways: Resuming military-military communications Let’s take another look at the key takeaways from today’s meeting between Biden and Xi. First up, resuming military-to-military communications. China severed military contact after then-House of Representatives Speaker Nancy Pelosi visited Taiwan in August 2022. On Wednesday, the two leaders reached an agreement to resume military-to-military communications. That means Defense Secretary Lloyd Austin will speak with his Chinese counterpart once someone is named to the job, the official said. Similar engagements will take place up and down the military chain of command. The official said Biden was “very clear” to Xi that such communications between US and China should be institutionalised and that they are “not done as a gift or as a favor to either side.” This is Helen Sullivan taking the Guardian’s live coverage.\nUpdated at 04.29 CET\n16 Nov 2023 03.35 CET Summary Here’s a summary of Biden’s first meeting with Xi Jinping since the pair were in Bali last year, and Biden’s subsequent remarks on the meeting. During the meeting at the Filoli estate, 30 miles south of San Francisco, Xi Jinping called the partnership between the US and China “the most important bilateral relationship in the world”, and said that he and Joe Biden “shoulder heavy responsibilities for the two peoples, for the world and for history”.\nAhead of the meeting, Xi and Biden pledged to cooperate more closely to fight climate change . Both countries said that they would commit to “economy-wide” nationally determined contributions across all greenhouse gases, not just CO2.\nBiden emphasized the value of the two leaders speaking in person, saying: “There’s no substitute to face-to-face discussions .” “ We have to ensure that competition does not veer into conflict,” Biden added. “And we also have to manage it responsibly … and work together when we see it in our interest to do so.”\nIn a tweet, the White House said that the US president and Chinese president had a “candid and constructive” conversation on a range of issues including international diplomacy.\nIn addition to fielding questions about his meeting with Xi Jinping and the US’s relationship with China, Joe Biden was pressed by reporters about the Israel-Hamas war. Among other comments about hostage negotiations and his approval of Benjamin Netanyahu’s military actions, Biden said of the Israel-Hamas war: “I don’t know how long it’s gonna last but it won’t end until there’s a two-state solution.” Thank you for following the Guardian’s live blog. My colleagues in Australia will be picking things up from here.\nUpdated at 03.45 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Biden: China and US military to resume ‘open, clear communications on a direct basis’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/live/2023/nov/15/us-china-biden-xi-meeting-republicans-congress-politics-latest-updates"}