{"authors": ["Matthew Cox", "Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com In San Francisco", "Emily Goodin", "Senior U.S. Political Reporter For Dailymail.Com In San Francisco"], "date_download": "2024-02-05 15:39:20", "date_modify": "None", "date_publish": "2023-11-16 11:15:03", "description": "A spokesperson said the statement after their meeting was 'extremely wrong'. US-Chinese relations have been seriously strained since the spy balloon saga at the start of 2023.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12756589%2FChina-rebuke-Biden-President-Xi-dictator-hours-pair-held-clear-air-talks-Beijing.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/10/77870883-0-image-m-12_1700130548738.jpg", "language": "en", "localpath": null, "maintext": "China has issued a damning reply to U.S. President Joe Biden's comments that he still considers President Xi Jinping 'a dictator', just hours after the pair held clear-the-air talks in California.\nChina's foreign ministry said it 'strongly opposes' the 'wrong and irresponsible' remarks.\nBiden said Wednesday: 'He’s a dictator in the sense that he is a guy who runs a country that is a communist country that’s based on a form of government totally different than ours.'\nBeijing's spokesperson Mao Ning told reporters at a routine briefing Thursday: 'This statement is extremely wrong and irresponsible political manipulation.\n'It should be pointed out that there will always be some people with ulterior motives who attempt to incite and damage U.S.-China relations, they are doomed to fail.'\nThe meeting had been mooted as an opportunity to reverse the trajectory of rhetoric between the two powers in light of the spy balloon saga in January and escalating situation surrounding Taiwan\nXi, 70, told the 80-year-old Biden, 'We shoulder heavy responsibilities for the world and for history'\nBiden reaches out to Xi's hand at the entrance to the Filoli estate ahead of their first meeting in almost a year\nA spokesperson for the Chinese foreign ministry has criticized President Joe Biden's comments saying that he still considers Chinese leader Xi Jinping a 'dictator'\nMao refused to specify who she was referring to as 'some people' in answer to a follow-up question.\nIn his press conference, President Biden also said he gave Xi a blunt warning not to interfere in Taiwan's January elections.\nWhen asked about the region, amid U.S. fears of a Chinese invasion even amid wars in the Middle East and Europe, Biden spoke about the upcoming Taiwanese elections.\nHundreds of critics of Beijing marched through the city's downtown around noon on the day of the talks, chanting 'free Tibet' and 'free Hong Kong'.\nBiden told reporters he 'made it clear I didn’t expect any interference – any at all. We had that discussion as he was leaving,' speaking from a California estate after the talks.\nXi secured his third term last year as general secretary of the Chinese Communist Party, after China ended term limits, allowing for indefinite rule over a system which limits free expression and political protest.\n'We maintain an agreement that there is a One China policy,' Biden said while looking down at notes. 'I’m not going to change that. That’s not going change.\n'That’s about the extent to which we discussed it,' he said of the precarious topic.\nThe leaders of the two superpowers pose for photos. They are meeting to try and repair frosty Washington-Beijing relations\nBiden said it was 'paramount that we understand each other truly, leader-to-leader' and said to Xi 'we've known each other a long time'\nXi responded that 'Planet Earth' is big enough for both nations\nBiden hailed the new communications link with Beijing, following a series of standoffs and what the Pentagon calls provocative actions by Beijing.\n'It’s been worrisome. That’s how accidents happen, misunderstandings,' Biden said.\nHe said he and Xi agreed that either one of them can 'pick up the phone call directly and be heard immediately.'\nTop defense lines of communication are also being resumed.\nThe president also indicated he raised difficult subjects with Xi, including 'Russia’s refusal to stop the brutal war of aggression against Ukraine and conflict in Gaza.'\nSeparately, when questioned, he stood by claims his administration says is backed by U.S. intelligence that Hamas is basing military assets under hospitals.\n'We’ve discussed the need for them to be incredibly careful,' he said of the Israeli Defense Forces (IDF).\nHe said Hamas 'does have weapons material below this hospital and, I expect, others.'\nBiden revealed details of his talks with Xi while calling on reporters from a pre-prepared list, then responding to a few shouted questions.\nHe recalled all their hours meeting together when both were vice presidents, appearing to jest about former Chinese leader Hu Jintao.\n'His president was President Hu – I’m not making a joke,' Biden said.\nBiden raises his hand up Xi's back as they head into their talks\nDelegates from both the U.S. and China line the negotiating table inside a room of the estate\nBiden said China agreed to go after companies who produce precursor chemicals to fentanyl, in a move meant to curb the epidemic in the U.S. Biden said it would 'save lives' and said he appreciated what he said was Xi's commitment to the issue.\n'For a situation where we agree that fentanyl and its precursors will be curbed substantially… that's a big moment,' he said.\nHe said he knows two people 'near where I live' where 'kids literally... they woke up dead' after taking fentanyl.\n'I hope you don't have any experience with knowing anyone. But this is the largest killer, people in that age category,' Biden said. There have been multiple reports of people experiencing death or severe complications after a single use of a drug laced with fentanyl, often without their knowledge.\nAlthough he focused on getting communication back on track with the emerging China, Biden spoke several times about the Middle East, including his repeated calls with Israeli Prime Minister Benjamin Netanyahu.\n'I’ve made it clear to Israelis, to Bibi and his war cabinet, that I think the only answer here is a two-state solution that’s real,' he said, during a week when pro-Palestinian protesters in San Francisco demanded a cease fire.\nXi told Biden that the U.S. needed to take ‘concrete actions’ to reassure China that it still stands by its stated policy of not supporting Taiwanese independence, according to a readout of their meeting from Chinese state media.\nHe also asked Washington to end arms sales to Taiwan, something that would run afoul of existing U.S. law.\n'China will eventually be reunified and will inevitably be reunified,' Xi said, according to state broadcaster CCTV.\nA senior Biden administration official said Biden and Xi had a ‘substantial exchange about Taiwan, without providing many details.\n‘I think President Xi made clear the continuing concerns, underscored that this was the biggest most potentially dangerous issue in US-China relations,’ the official said.\nThe president made his comments following high-stakes talks with Xi in the pastoral setting, although his outdoor press conference backed by a 56-room brick mansion got moved inside due to rain.\nBiden called them 'some of the most constructive and productive discussions we’ve had.'\nBiden and Jinping met for the first time in over a year for high-stakes talks on Wednesday to try and bury the hatchet amid dangerously escalating tensions between Washington and Beijing\nIt was the first time in over a year that the two men met to try and bury the hatchet amid dangerously escalating tensions between Washington and Beijing.\nThe meeting lasted four hours at a historic home outside of San Francisco. Their encounter began with a warm double-clasped handshake, and a declaration by Xi that the world is 'big enough' for both countries, despite years of rising rhetoric and provocations.\n'The China-U.S. relationship has never been smooth sailing and always faces problems of one kind or another,' Xi said through a translator as he met Biden.\n'Yet it has kept moving forward amidst twists and turns. For China and the United States, turning their back on each other is not an option. It is unrealistic for one side to remodel the other, and conflict and confrontation has terrible consequences for both sides. Planet Earth is big enough for the two countries to succeed.'\nIn his own remarks, Biden called for a 'candid exchange.'\nLunch Menu For lunch, President Biden and President Xi dined on: Herbed Ricotta Ravioli Artichoke Crisps Tarragon roasted Heritage Chicken Carolina Gold Rice Pilaf Charred Broccolini + Brussels Sprouts Almond Meringue Cake Praline Buttercream Concord Grape Sauce Advertisement\n'I've always found our discussions to be straightforward and frank and always appreciated them,' Biden told Xi, after spending years telling U.S. audiences he has spent more time with the Chinese autocrat than any other U.S. leader.\nBiden said it was 'paramount that we understand each other truly, leader-to-leader.'\nAnd he underlined the risks if the two countries fail to find a way to get along despite their differences.\n'We have to ensure that competition does not veer into conflict and we have to manage responsibly that competition,' Biden told his counterpart. 'That's what the United States wants and what we intend to do. I believe that's also what the world wants from both of us.\n'We have a responsibility to our people and the world to work together when we see it in our interests to do so. The critical global changes we face from climate change, narcotics to artificial intelligence demand us to work together.'\nXi, 70, told the 80-year-old Biden, 'We shoulder heavy responsibilities for the world and for history.'\nThe leaders of the two superpowers aimed to use the crucial summit as they try to prevent their nations' rivalry spilling into conflict.\nThey came face-to-face on a red carpet at the Filoli country estate on the outskirts of San Francisco.\nBiden greeted Xi with plenty of pomp, two Marines in dress uniforms opened Xi's car door and Biden was waiting for him at the entrance of the historic home.\nWashington-Beijing relations have been seriously strained since a Chinese spy balloon flew across the U.S. in February and was eventually shot down off the coast of South Carolina.\nJoe Biden waits for Xi Jinping to arrive\nXi and Biden chat on the red carpet\nXi Jinping prepares to address Biden\nThe leaders of the world's two largest economies met as concerns were also soaring over issues including Taiwan, Beijing's actions in the South China Sea sanctions, heightened espionage, trade and human rights.\nBiden and Xi were expected to cover a wide range of topics, including the flow of fentanyl into the U.S., climate change and the accelerating use of artificial intelligence.\nAfter their meeting an expanded discussion was held with their top security aides.\nThis encounter was months in the making, after high-level visits from Biden's cabinet and even a trip to Beijing by California Gov. Gavin Newsom.\nThe meeting was also an example of the kind of personal diplomacy Biden has championed.\nHis Chinese counterpart is a leader who holds unique power over a government that is flexing its muscle around the globe.\nWhile Biden has to deal with a divided and frequently dysfunctional Congress amid his own weak poll numbers, his top advisors believe Xi has the capacity to deliver, even if only on some of the modest agreements on fentanyl and climate change.\n'I would say that what we've seen over the last several years is the collection of power in the person of really one man: President Xi,' a senior administration official told DailyMail.com.\n'What that means is that, yes, other forms of diplomacy are important. But frankly when you really have to do serious diplomacy, it has to take place at the very top.\n'So the stakes really just couldn't be higher. Yes, I think if you want to effect change the system, if you want a kind of clear shot to try and affect certain outcomes, it comes down to a meeting like this.'\nPresident Biden drives past protesters in his motorcade in downtown San Francisco\nThe meeting was taking place inside a 654-acre estate amassed by a California mining and gas baron.\nThe grounds of the Filoli estate include five 'distinct ecosystems,' trails, a fruit orchard, redwood groves, and natural springs.\nA Georgian revival-style mansion has a total of 54,000 square feet.\nThe home was built in 1917, and opened to the public in 1975.\nIt is far removed from the streets of San Francisco where the APEC summit is underway. That was the scene this week of continued street demonstrations by pro and anti-communist protesters, along with people weighing in on Israel’s war on Gaza.\nAlso lining the streets have been members of the Falun Gong spiritual movement that is banned in China.\nProtesters clashed with riot police as thousands of people descended into the streets of San Francisco to 'shut down' the APEC summit on Wednesday morning\n'We won't allow genocide to be normalized,' an organizer said\nThe crunch talks occurred after San Francisco's homeless were cleared from the streets in a massive clean-up operation to avoid Xi and other dignitaries seeing the squalor.\nBut there was still chaos around the summit.\nAs the meeting began hundreds of anti-oil, pro-Palestine protesters clashed with riot police outside the APEC summit.\n'We won't allow genocide to be normalized,' an organizer with the No APEC Coalition told the the San Francisco Standard.\nThe protesters chanted 'Biden, Biden telling lies' and 'shut down APEC.'\nPresident Joe Biden is set to meet Chinese President Xi Jinping at the Filoli estate, according to Voice of America\nThe Georgian revival-style mansion has a total of 54,000 square feet\nThe home is located in Woodside on the Peninsula near San Francisco\nIt is just the kind of open political expression that Chinese authorities have repeatedly tried to squelch for years, including during the 1989 Tiananmen Square crackdown, even while opening up its economy to become a dominant global force, second only to the U.S.\nThe White House said on Wednesday that Biden would raise human rights issues with Xi as he always does during such meetings.\nOfficials hope the peaceful setting of the Filoli estate will contribute to a positive outcome for the talks.\n'If they like each other, they are likely to start trusting each other and to communicate better,' said Jeremi Suri, a professor of public affairs and history at the University of Texas at Austin.\n'A place like this allows them to get away, not just from the media, but from a lot of the other things that encourage conflict.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "China issues furious rebuke after Biden again branded President Xi 'a dictator' hours after the pair held clear-the-air talks: Beijing blasts comments 'wrong, irresponsible manipulation'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12756589/China-rebuke-Biden-President-Xi-dictator-hours-pair-held-clear-air-talks-Beijing.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}