{"authors": [], "date_download": "2024-02-05 15:39:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "External Affairs Minister S Jaishankar met with newly appointed UK Foreign Secretary David Cameron and conveyed his greetings on assuming charge of his new offi", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031546%2Fuk-jaishankar-meets-counterpart-david-cameron-on-his-first-day-in-office-discusses-strategic-partnership.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699893688.jpg", "language": "en", "localpath": null, "maintext": "London [UK], November 13 (ANI): External Affairs Minister S Jaishankar met with newly appointed UK Foreign Secretary David Cameron and conveyed his greetings on assuming charge of his new office on Monday.\nIn conversation with the British counterpart, EAM held discussions on strengthening India-UK strategic partnership and exchanged views over the ongoing conflict in Gaza and Ukraine.\nTaking to X, Jaishankar said about his meeting, \"A pleasure to meet UK Foreign Secretary @David_Cameron this afternoon on his first day in office. Congratulated him on his appointment. Held a detailed discussion on realizing the full potential of our strategic partnership. Also exchanged views on the situation in West Asia, the Ukraine conflict and the Indo-Pacific. Look forward to working with him closely.\"In a surprising cabinet reshuffle by UK PM Rishi Sunak, former Prime Minister David Cameron was appointed as the Secretary of State for Foreign, Commonwealth and Development Affairs, Downing Street informed on Monday.\nThis comes after UK PM Rishi Sunak sacked his home secretary Suella Braverman over her sharp criticism of Police amid the ongoing Pro-Palestine rallies in the United Kingdom.\n\"The Rt Hon @JamesCleverlyMP has been appointed Secretary of State for the Home Department @ukhomeoffice\", the official X handle of UK Prime Minister posted on X (formerly Twitter).\n\"The Rt Hon @David_Cameron has been appointed Secretary of State for Foreign, Commonwealth and Development Affairs @FCDOGovUK,\" it said in a subsequent post.\nNotably, this is only the second time after World War II that a former Prime Minister has returned to the cabinet.\nCameron had resigned as the PM in 2016 after Britain voted to leave the European Union, in a referendum that was called by him.\nMeanwhile, Braverman's removal came amid mounting pressure on PM Sunak over her article in the Times UK that criticised the Metropolitan Police for allegedly \"going soft\" on certain \"radical elements\" in Pro-Palestine rallies.\nEarlier today, Jaishankar met with former UK Prime Minister Tony Blair and discussed bilateral ties between India and the UK.\nDuring his meeting with the former UK PM, both leaders also exchanged their thoughts on the situation in West Asia and Africa.\nEarlier yesterday, EAM Jaishankar, who is on a four-day official trip to the UK, celebrated Diwali by offering prayers at the BAPS Shri Swaminarayan Mandir (Neasden Temple) in London.\nSpeaking to the media outside, he said India is the fastest-growing large economy today.\n\"India is today the fastest-growing large economy. There is leadership. There is vision. There is good governance,\" he said.\nJaishankar is currently on an official visit to the United Kingdom. He arrived in Britain on Saturday and will conclude his visit on November 15. He is scheduled to meet several other dignitaries during his visit.\nIndia and the UK have a \"growing bilateral partnership\", the MEA stated in a release earlier, noting that the two countries launched a Comprehensive Strategic Partnership in 2021.\n\"India and the UK share a warm and thriving relationship. The India-UK Comprehensive Strategic Partnership was launched in 2021 along with the India-UK Roadmap 2030,\" the MEA stated in its release.\n\"The Roadmap is a commitment to a partnership that delivers for both the countries. EAM's visit will give new impetus to the friendly ties between the two countries,\" it added.\nSignificantly, India and the UK are negotiating a Free Trade Agreement. Talks for FTA between India and the UK started in 2022 and the 12th round of negotiations took place from August 8-31 this year. (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "UK: Jaishankar meets counterpart David Cameron on his first day in office, discusses strategic partnership", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031546/uk-jaishankar-meets-counterpart-david-cameron-on-his-first-day-in-office-discusses-strategic-partnership"}