{"authors": [], "date_download": "2024-02-05 15:39:22", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "External Affairs Minister S Jaishankar met UK Home Secretary James Cleverly on Monday evening and expressed appreciation for his unwavering support, underscorin", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031745%2Fjaishankar-appreciates-james-cleverly-unwavering-support-for-india-uk-strategic-partnership.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699906272.jpg", "language": "en", "localpath": null, "maintext": "London [UK], November 14 (ANI): External Affairs Minister S Jaishankar met UK Home Secretary James Cleverly on Monday evening and expressed appreciation for his unwavering support, underscoring the continued strength of the strategic partnership between India and the UK.\nThe two leaders' meeting also delved into critical issues shaping bilateral relationships, with conversations revolving around the pivotal role of mobility, skills, and talent in fostering cooperative development.\n\"Met UK Foreign Secretary James Cleverly at High Commissioner's reception last evening. Met UK Home Secretary James Cleverly this evening. Discussed the importance of mobility, skills and talent in the development of our bilateral cooperation,\" posted EAM Jaishankar on X.\nThey also exchanged views on joint efforts to address pressing concerns such as extremism, economic offences, trafficking, and security.\n\"Exchanged views on addressing shared concerns on extremism, economic offenses, trafficking and security. Appreciate @JamesCleverly's continued support for our strategic partnership,\" his post added.\nJaishankar, who is currently on an official visit to the UK, also engaged in a discussion with UK Defence Secretary Grant Shapps. The focus of their talks was bolstering defence and security cooperation between the two nations.\n\"A good interaction with UK Defence Secretary @grantshapps this afternoon. Discussed enhancing defence and security cooperation between our two countries,\" said Jaishankar in a post on X.\nEAM Jaishankar also highlighted the promising avenues for collaboration through the Make in India initiative, offering new opportunities for British partners. The leaders also exchanged perspectives on pressing global security challenges, emphasising the convergences in their strategic approaches.\n\"MakeinIndia offers new opportunities for our British partners. We also shared perspectives on the global security challenges and the convergences in our approach,\" his post also read.\nFollowing a surprising cabinet reshuffle by UK PM Rishi Sunak, Jaishankar met with newly appointed UK Foreign Secretary David Cameron and conveyed his greetings on assuming charge of his new office on Monday.\nThe former home secretary Suella Braverman was sacked by UK PM Rishi Sunak over her sharp criticism of police amid the ongoing pro-Palestine rallies in the United Kingdom, and former Prime Minister David Cameron was appointed as the Secretary of State for Foreign, Commonwealth, and Development Affairs, Downing Street informed on Monday.\nNotably, this is only the second time after World War II that a former Prime Minister has returned to the cabinet. Cameron had resigned as PM in 2016 after Britain voted to leave the European Union, in a referendum that was called by him.\nEAM Jaishankar arrived in Britain on Saturday and will conclude his visit on November 15.\nIndia and the UK have a \"growing bilateral partnership\", the MEA stated in a release earlier, noting that the two countries launched a Comprehensive Strategic Partnership in 2021.\n\"India and the UK share a warm and thriving relationship. The India-UK Comprehensive Strategic Partnership was launched in 2021 along with the India-UK Roadmap 2030,\" the MEA stated in its release.\n\"The Roadmap is a commitment to a partnership that delivers for both countries. EAM's visit will give new impetus to the friendly ties between the two countries,\" it added.\nSignificantly, India and the UK are negotiating a Free Trade Agreement (FTA). Talks for an FTA between India and the UK started in 2022, and the 12th round of negotiations took place from August 8-31 this year. (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Jaishankar appreciates James Cleverly's unwavering support for India-UK strategic partnership", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031745/jaishankar-appreciates-james-cleverly-unwavering-support-for-india-uk-strategic-partnership"}