{"authors": [], "date_download": "2024-02-05 15:16:18", "date_modify": "None", "date_publish": "2024-01-23 21:08:17", "description": "It comes as Russian strikes on Ukrainian cities including Kyiv and Kharkiv kill at least seven people", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fnato-ukraine-artillery-russia-b2483373.html.json", "image_url": "https://static.independent.co.uk/2024/01/23/15/SEI188363042.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussia’s invasion of Ukraine has become a battle for ammunition, the head of Nato has warned, as the alliance signed a £950m contract to buy thousands of artillery rounds to help Kyiv’s battle against Vladimir Putin’s forces.\nNato secretary general Jens Stoltenberg announced that the alliance had signed contracts to purchase 220,000 rounds of 155-millimetre ammunition.\n“This is important to defend our own territory, to build up our own stocks, but also to continue to support Ukraine,” Mr Stoltenberg said. “Russia’s war in Ukraine has become a battle for ammunition, so allies must refill their own stocks, as we continue to support Ukraine.”\nThe announcement came just hours after Russia launched more than 40 missiles into Ukraine’s two biggest cities – Kyiv and Kharkiv – killing at least seven people.\nMr Stoltenberg said: “We cannot allow President Putin to win in Ukraine. That would be a tragedy for the Ukrainians and dangerous for all of us.”\nThe Nato Support and Procurement Agency (NSPA) concluded the deal on behalf of several of its members, including Belgium, Lithuania and Spain, who will either pass the shells to Ukraine or use them to refill their own arsenals.\nVolodymyr Zelensky and Jens Stoltenberg in Davos last week (Reuters)\nRussia’s arms industry has always far outstripped Ukraine’s, but recent failures from Kyiv’s western backers to push through additional military support, as well as new North Korean weapons packages to Moscow, have compounded the problem.\nUkraine is said to now be firing around 2,000 artillery shells per day; it was roughly four times that last summer. Russia, meanwhile, is believed to be firing 10,000 shells per day. White House national security spokesperson John Kirby described the next few months as critical to Ukraine because “they don’t know when the next shipment is going to come”.\nHe added: “The Russians certainly are not suffering under the same uncertainty, as they reach out to North Korea for ballistic missiles … and drones from Iran.”\nWhile the latest Nato announcement provides some reassurance, the procurement agency admitted that the latest purchases of shells would not arrive quickly. Delivery on orders takes anywhere from 24 to 36 months, it said.\nBoth the US and the European Union failed to pass fresh military support packages at the end of last year, worth tens of billions of pounds. In Europe, domestic stockpiling issues have also become a growing problem.\nSenior EU officials have said they expect the European defence industry to be producing around 1 million shells annually by the end of this year to remedy this problem – but Ukraine’s shortages are pressing. As of late December last year, Ukrainian officials said their European partners had failed to send 70 per cent of the 1 million artillery rounds they had been promised for 2023 and 2024.\nAn adviser to the European External Action Service (EEAS), the combined defence and foreign policy arm of the EU, told The Independent last year that these failures to push further aid to Ukraine had created a “worrying gap” in ammunition supplies to Ukraine in the first half of 2024. No significant Western military package has been pledged to Ukraine since.\nA residential building damaged from a missile attack in Kharkiv on Tuesday (AFP via Getty Images)\nFor the first time since US defense secretary Lloyd Austin established the international group to support Ukraine in April 2022, the United States hosted the monthly gathering of about 50 countries on Tuesday, with the US unable to send ammunition and missiles. While waiting for Congress to pass a budget and potentially approve more money for Ukraine's fight, the US will be looking to allies to keep bridging the gap.\n“I urge this group to dig deep to provide Ukraine with more lifesaving ground-based air defence systems and interceptors,” Mr Austin said in opening remarks broadcast from his home, where he is still recuperating after prostate cancer surgery.\nIn the latest Russian strikes, Ukraine’s air defences were able to intercept at least 21 of the more than 40 missiles. However, Tuesday’s onslaught in Kharkiv, in northeastern Ukraine, killed six people and injured 57, including eight children, the UN said.\nThe attacks injured at least 20 people in four districts of Kyiv, the capital, including a 13-year-old boy, according to mayor Vitali Klitschko. A missile also killed a 43-year-old woman and damaged two schools and eight high-rise buildings in Pavlohrad, an industrial city in the eastern Dnipro region. It was the lowest missile interception rate, which has often been more than 90 per cent in recent months.\nAndry Yermak, an adviser to Ukrainian president Volodymyr Zelensky, wrote after the attack that “the world must understand that this terror can only be stopped by force”.\nElsewhere, Turkish legislators began debating a long-delayed bill to approve Sweden's bid to join Nato, in a step that could remove a major hurdle for the Nordic country's entry into the military alliance.\nAssociated Press contributed to this report", "source_domain": "www.independent.co.uk", "text": null, "title": "Nato signs £950m contract so Ukraine has more artillery rounds: ‘The war is now a battle for ammunition’", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/nato-ukraine-artillery-russia-b2483373.html"}