{"authors": [], "date_download": "2024-02-05 15:39:25", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Israel reportedly aims to install former UK prime minister Tony Blair in a humanitarian post in Gaza Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274031737%2Fisrael-wants-tony-blair-as-humanitarian-coordinator-in-gaza---media.json", "image_url": "https://cdn.bignewsnetwork.com/YjQxMWU3ZjgtYzd.jpg", "language": "en", "localpath": null, "maintext": "The former UK prime minister, who avoided prosecution over the Iraq invasion, would oversee medical treatment and evacuations\nIsrael is considering hiring former UK Prime Minister Tony Blair as humanitarian coordinator for Gaza in an attempt to alleviate international concern over excessive civilian casualties in the enclave, Israeli outlet Ynet reported on Sunday.\nPrime Minister Benjamin Netanyahu reportedly hopes Blair's diplomatic experience in the region will lend legitimacy to Israel's military campaign and quell international demands for a ceasefire amid a massive humanitarian crisis and thousands of civilian deaths. Blair served as envoy to Israel and Palestine for the Middle East Quartet, made up of the US, Russia, EU, and UN, after stepping down as leader of the UK.\nThe exact definition, authority, and scope of Blair's proposed role have yet to be determined, but it would focus on \"providing medical treatment and medicines, and on the possibility of evacuating the wounded and sick from the [Gaza] Strip,\" according to Ynet.\nBlair's office told the outlet that while he maintains an office in Israel and has had \"conversations with people in the region and other places in order to see what can be done\" regarding the conflict, \"he has not been given or offered a position\" by Netanyahu's office.\nHowever, a spokesperson confirmed on Monday that he is \"discussing the situation\" and is open to the possibility.\nBlair released a statement on X (formerly Twitter) in the days after Hamas' October 7 attack on Israel declaring that \"decades of conventional Western diplomacy around the Israeli/Palestinian issue will need to be fundamentally re-thought\" as the status quo had only led to \"grief and tragedy\" for both Israel and Gaza.\nWhile he supported the blockade of Gaza following Hamas' election victory in 2006, Blair acknowledged in 2017 that Israel and its western allies had made a mistake by cutting the militant group off, arguing in retrospect that they should have tried to open a dialogue instead.\nThe former prime minister's appointment as peace envoy for the Quartet in 2007 was highly controversial due to his having led the UK into a disastrous war with Iraq in 2003. The New Labour standard-bearer avoided prosecution for war crimes after an official inquiry led by Sir John Chilcot found he disregarded warnings about the risks of military action. It also said he deliberately exaggerated the threat posed by Saddam Hussein and his alleged weapons of mass destruction in order to join the American invasion.\nMany in the UK - a third of those polled in 2017 - still believe Blair should be tried as a war criminal, a sentiment shared by Hans Blix, the UN weapons inspector whose findings that Hussein did not have WMD were ignored in favor of going to war.", "source_domain": "www.theuknews.com", "text": null, "title": "Israel wants Tony Blair as humanitarian coordinator in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274031737/israel-wants-tony-blair-as-humanitarian-coordinator-in-gaza---media"}