{"authors": ["Dave Burke", "Image", "Zelenskiy_Official Instagram"], "date_download": "2024-02-05 15:39:26", "date_modify": "None", "date_publish": "2023-11-16 08:15:53", "description": "New Foreign Secretary David Cameron told Ukrainian President Volodymyr Zelensky that he didn't always agree with Boris Johnson, but support for the war-torn nation was the \"finest thing\" his rival did as PM", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fpolitics%2Fdavid-cameron-visits-zelensky-ukraine-31450869.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31450901.ece/ALTERNATES/s1200/0_Ukraine.jpg", "language": "en", "localpath": null, "maintext": "New Foreign Secretary David Cameron told Ukrainian President Volodymyr Zelensky that he didn't always agree with Boris Johnson, but support for the war-torn nation was the \"finest thing\" his rival did as PM\nDavid Cameron has visited Ukraine in his first overseas visit after his surprise return to frontline politics.\nThe new Foreign Secretary told Ukrainian President Volodymyr Zelensky that he would work to ensure attention isn't diverted from the war with Russia. He told the Ukrainian leader that support for the war-torn country was one of the things he agreed with his great rival, Boris Johnson about.\nHe became the third Foreign Secretary to visit Kyiv since the war broke out last February. In that time the UK has had three Prime Ministers.\nIn video shared on social media Lord Cameron was shown telling Mr Zelensky: \"I wanted this to be my first visit I admire the strength and determination of the Ukrainian people. What I want to say by being here is that we will continue to give you the moral support, the diplomatic support, the economic support but above all the military support that you need not just this year and next year but however long it takes.\nImage: zelenskiy_official/Instagram) zelenskiy_official/Instagram)\n\"I had some disagreements with my friend Boris Johnson we've known each other for 40 years, his support for you was the finest thing that he and his government (did).\"\nHe continued: \"It's really important that we're here... to make sure that the attention is here in Ukraine.\"\nThe Ukrainian President said he was concerned that with the outbreak of war in the Middle East, world attention has been \"diverted\" from his war with Vladimir Putin's army. Posting a video of the meeting, he wrote: \"Hosted David Cameron on his first visit to Ukraine as Foreign Secretary of the UK. We had a good meeting focused on weapons for the frontline, strengthening air defense, and protecting our people and critical infrastructure. I am grateful to the UK for its support!\"\nFollowing the meeting the Foreign Secretary said: \"As Foreign Secretary, supporting Ukraine against Putin's aggression is vital, which is why I am pleased to make this my first visit as Secretary of State.\n\"Russia thinks it can wait this war out, and that the West will eventually turn its attention elsewhere. This could not be further from the truth. In my first discussions with President Zelensky in my new role, I made clear that the UK and our partners will support Ukraine and its people for as long as it takes for them to achieve victory.\n\"As winter approaches, we continue to stand with the Ukrainian people as they resist Putin's illegal invasion. In the last three months, they have pushed Russia back in the Black Sea and are opening vital sea trade routes for the Ukrainian economy and global food supplies.\"\nAs PM, Lord Cameron deployed UK troops to train Ukrainian forces in 2015 following Russia's seizure of Crimea, which he described as a \"flagrant breach of international law\".\n* Follow Mirror Politics on Snapchat, Tiktok, Twitter and Facebook.", "source_domain": "www.mirror.co.uk", "text": null, "title": "David Cameron visits Zelensky in Ukraine in first overseas trip since surprise return", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/politics/david-cameron-visits-zelensky-ukraine-31450869"}