{"authors": ["Emily Goodin", "Senior Reporter For Dailymail.Com In San Francisco", "Geoff Earle", "Deputy U.S. Political Editor In San Francisco"], "date_download": "2024-02-05 15:39:27", "date_modify": "None", "date_publish": "2023-11-16 02:04:42", "description": "President Joe Biden said he had made it clear to Israeli Prime Minister Benjamin Netanyahu that a two-state solution was the only answer and said Hamas was guilty of war crimes.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12755441%2FBiden-says-Hamas-committing-war-crimes-storing-weapons-tunnels-Gaza-hospital-insists-two-state-solution-outcome-Israel-conflict.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/16/02/77860081-0-image-a-8_1700100257464.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden on Wednesday said he had made it clear to Israeli Prime Minister Benjamin Netanyahu that a two-state solution was the only answer to resolve Israel-Palestinian conflict and said Hamas commited war crimes by storing weapons in a tunnel under a Gaza hospital.\n'You have a circumstance where the first war crime is being committed by Hamas by having their headquarters, their military, under a hospital. And that's a fact. That's what happened,' Biden said.\nHe also noted 'I made it clear to the Israelis -- to Bibi and his war cabinet -- that I think the only ultimate answer here is a two-state solution.'\nBiden said that, at this point, Hamas still could, and still maintains weapons and technology underneath Gazan hospitals. 'I don't think it ultimately ends until there's a two-state solution.'\nHe said he has been negotiating with Arab nations on the next steps.\nThe president made his remarks at a solo press conference after his summit with Chinese President Xi Jinping.\nPresident Joe Biden speaks during a news conference after his meeting with China's President President Xi Jinping\nA two-state solution is one in which Israel would co-exist alongside an independent Palestine state but such an idea has eluded American presidents and peace makers for decades.\nBiden has taken up the call for it to happen when the Hamas-Israel conflict ends and is pushing other nations in the Middle East to support the idea.\nBut he also defended Israel's actions in the Gaza.\n'Hamas has already said publicly that they plan on attacking Israel again, like they did before — cutting babies' heads off and burning women and children alive. And so the idea that they’re gonna just stop and not do anything is not realistic,' he said.\nMeanwhile, Israeli troops found a command centre and weapons and combat gear belonging to Palestinian Hamas militants in Gaza's biggest hospital on Wednesday, Israel's military said.\nThe IDF raided the Al Shifa hospital complex in Gaza in the early morning hours.\nIn one hospital department, 'the soldiers located an operational command centre and technological assets belonging to Hamas, indicating that the terrorist organization uses the hospital for terrorist purposes,' an Israeli military statement said.\nBiden, at his press conference, noted his administration has encouraged the IDF to careful.\n'This is not carpet bombing. This is a different thing,' he said.\n'They're also bringing in incubators. They're bringing in other means in the hospital, and giving the doctors—I'm told—and the doctors and nurses the opportunity to leave,' he added.\nBiden said he would urge Israeli prime minister Benjamin Netanyahu to consider a two-state solution\nEarlier Wednesday White House national security spokesman John Kirby declined to second-guess the Israeli military after it inserted forces into Gaza's largest hospital and claimed to discover 'terror infrastructure' there.\nKirby once again said he would not engage in 'armchair quarterbacking' of the Israeli military's powerful assault on Hamas in Gaza, even while underlying U.S. concerns about protecting civilians in Gaza, amid estimates that thousands have been killed in the Israeli bombardment.\nHe said there was 'no expectation' that Israel would outline its military moves in advance, adding that 'certainly we talked to them about our continued concerns over civilian casualties.'\n'We don't want to see hospitals attack from the air. We don't want to see innocent civilians, patients, medical staff, become the victims of crossfire between Hamas and Israel Defense Forces. We believe that hospitals should be protected,' said Kirby, a day after he said U.S. intelligence indicated that Hamas and Palestinian Islamic Jihad used hospitals to conceal military operations and hostages.\nHe said it was 'understandable' that the IDF would want to 'remove Hamas' ability to use cover like that to sustain themselves' as it carries out orders to eliminate Hamas.\n'But again, this this means they have an added burden here because it is hospital, because there are real patients and real doctors and real nurses that have nothing to do with this fight that that need to be protected as much as possible.'\nHe spoke after Israeli troops finally began to withdraw from the beleaguered hospital, where Israel alleges Hamas has an underground base.\n'I'm going to refrain from armchair quarterbacking ongoing military operations for the military that is not the United States,' he said. 'We have been very consistent, very clear with our Israeli counterparts about how important it is to minimize civilian casualties.\n'We have also been very clear with them about the special care that must be taken when you're talking about hospitals, because there are patients and even pediatric patients and and medical staff and that hospital is an active, legitimate hospital and serving the legitimate medical needs of the people of Gaza.'\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Hamas in this still image from handout video obtained November 15, 2023\nPalestinians injured in Israeli raids arrive at Nasser Medical Hospital on November 14, 2023 on November 13, 2023 in Khan Yunis, Gaza. The White House says Hamas uses tunnels beneath hospitals for its military\nIsraeli forces have continued to pound Gaza for weeks\nIsrael has long accused Hamas of hiding its forces among civilian targets. Hamas officials have said more than 10,000 have died in Israel's campaign, although the White House says it cannot verify the figure.\nAn estimated 1,400 were killed in the Hamas October 7 attack on Israel.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden says Hamas is committing war crimes by storing weapons in tunnels beneath Gaza hospital and insists a 'two-state solution' will be the outcome of the Israel conflict", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12755441/Biden-says-Hamas-committing-war-crimes-storing-weapons-tunnels-Gaza-hospital-insists-two-state-solution-outcome-Israel-conflict.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}