{"authors": ["James Reinl", "Social Affairs Correspondent", "For Dailymail.Com"], "date_download": "2024-02-05 15:39:32", "date_modify": "None", "date_publish": "2023-11-15 21:59:26", "description": "'It'd be a screaming shame for the US to give concessions to China, selling out its own ideals and actions in its fight against Uyghur genocide and getting nothing out of it,' said Louisa Greve.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12754549%2FChinas-Uyghurs-Biden-oppressed-minority-blacklisted-forensics-lab-Xis-promise-fentanyl.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/21/77850505-0-image-a-36_1700084882197.jpg", "language": "en", "localpath": null, "maintext": "Members of China's oppressed Uyghur minority have slammed President Joe Biden for reportedly agreeing to lift sanctions against China in exchange for 'empty promises' about staunching fentanyl flows into the US.\nLouisa Greve, advocacy director for the Uyghur Human Rights Project, said Biden's deal with his Chinese counterpart Xi Jinping would further hurt her repressed ethnic group without getting America any help in return.\nGreve spoke with DailyMail.com as Biden met Xi on the sidelines of the Asia-Pacific Economic Cooperation (APEC) forum in San Francisco, where they discussed their deal over sanctions and Chinese-made precursor chemicals.\n'It'd be a screaming shame for the American government to give concessions to China, selling out its own ideals and actions in its fight against Uyghur genocide and getting nothing out of it,' said Greve.\nChina's Uyghurs say they're being sold out in Joe Biden's fentanyl deal with Xi Jinping\nThe US wants China's help to stop an illicit flow of 'precursor' chemicals that are used to make fentanyl, which are often mailed to Mexican drug cartels and smuggled and sold across America — often with deadly results.\nThe agreement reportedly involves lifting US sanctions against the Institute of Forensic Science, part of China's Ministry of Public Security, which has been blacklisted for alleged abuses against Uyghurs and others since 2020.\nLouisa Greve expects 'empty promises' from China\nGreve says the deal would undermine the cause of the Uyghurs, a mostly Muslim, Turkic-speaking group in the northwestern region of Xinjiang, which has seen been subject to forced labor, sterilizations and other abuses in a crackdown from Beijing.\nWashington put the institute on the Commerce Department's 'entity list' in 2020 over alleged abuses toward Uyghurs and other minority groups — effectively barring it from receiving US exports.\nChina has long questioned why the US would expect cooperation on fentanyl while targeting the institute.\n'It would send the wrong message to lift sanctions on the forensic institute, which has been implicated in the involuntary collection of DNA of Tibetans and Uyghurs,' said Greve, an author of several books who has testified before Congress.\nWorse still, added Greve, Biden is likely being sold 'empty promises.'\nThe drug was initially produced in India and China and mailed to recipients across North America. Makeshift labs have since sprung up in Mexico to receive the precursor chemicals from Asia, mix them or press them into pills, and smuggle them into the US\nHomeless San Francisco denizen Travis Hayes, 65, holds up a bag believed to be fentanyl\nThe Centers for Disease Control and Prevention (CDC) estimates there were 109,673 overdose deaths in the year to April 2022 — a new record. Many were due to fentanyl, pictured\n'China's word on international agreements cannot be trusted,' she added.\n'Like how it violates foundational UN agreements on atrocity crimes, this deal on fentanyl could turn out to be empty promises.'\nChina's embassy in Washington declined to comment on the fentanyl issue.\nChinese state media has repeatedly said addiction and demand for the drug are US domestic problems.\nStill, US officials say that small chemical firms in China make precursor chemicals that are shipped to Mexico to produce illicit fentanyl.\nThe opioid, which is 50-100 times stronger than heroin, is often mixed with other illegal drugs, sold as powders and nasal sprays, and increasingly turned into pills that look like legitimate prescription opioids.\nThese are then smuggled across the US-Mexico border, the officials say.\nDEA officers seized a million fake pills containing fentanyl at a home in Inglewood, California. The drug is so potent that users can easily take a lethal dose\nDrugs and paraphernalia recovered from a bust in New York in September 2016, in which officers made a record seizure of 33 kilograms of heroin and 2 kilograms of fentanyl from a drug ring encompassing New York, Massachusetts, Pennsylvania, Arizona and New Jersey\nThis image from Mexico's national defense forces shows a makeshift drugs lab in northwest Mexico, where officers discovered precursor chemicals, fentanyl paste, weapons and drug making gear, from November 2021\nLast month, Washington slapped sanctions on 28 people and entities involved with the international proliferation of illicit drugs, including a large China-based network.\nThe US rate of drug overdose deaths involving fentanyl more than tripled from 2016 through 2021, according to the US Centers for Disease Control and Prevention (CDC).\nTens of thousands of people die annually from synthetic opioid overdoses, government statistics show.\n'We know that this global fentanyl supply chain, which ends with the deaths of Americans, often starts with chemical companies in China,' said US Attorney General Merrick Garland.\nAhead of the summit in San Francisco, state and local officials have tried to clean up drugs from the city's streets, with limited success.\nThe crisis has drawn sharp criticism from residents in the city, where drug-fuelled crime has forced some businesses to leave.\nWith Reuters.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "EXCLUSIVE: China's Uyghurs slam Biden for selling out the oppressed minority by lifting curbs on a blacklisted forensics lab in return for Xi's 'empty promises' on cutting fentanyl flows", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12754549/Chinas-Uyghurs-Biden-oppressed-minority-blacklisted-forensics-lab-Xis-promise-fentanyl.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}