{"authors": ["Sidney Blumenthal"], "date_download": "2024-02-05 15:39:33", "date_modify": "None", "date_publish": "2023-11-15 11:02:04", "description": "The Republican race is grotesque: Trump’s rivals pretend to be viable candidates, and the media pretends to ask them questions", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fnov%2F15%2Frepublicans-trump-zombie-candidates-sidney-blumenthal.json", "image_url": "https://i.guim.co.uk/img/media/f167e3f99717f2196e9647bc1088b5a0e851a679/0_307_5946_3569/master/5946.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=76228ffe96ef3be0e10c5850b8229d3a", "language": "en", "localpath": null, "maintext": "In taking the loyalty oath to support the party nominee in order to be permitted to participate in debates, the Republican candidates have transformed themselves into zombies. For one brief shining moment they may have imagined that they would edge out Donald Trump by offering themselves as more electable. But electability is a transient quality, often glittering like fool’s gold. Their unique selling proposition was that they did not carry his wagon train of baggage. Their logic was not more complicated than that. They promised that electability would be a pragmatic turn to reality. But the appeal of a rational idea that seeks a rational response immediately separated them from the Trump base. With Trump leading in the polls, and the latest poll showing him momentarily ahead of President Biden in key swing states, the electability gambit has evaporated on the ground of its premise.\nBeyond the misplaced gamble on evanescent electability, accepting that Trump’s negatives might be a burden in a general election would crack the entire edifice of his mythology. If it were true, it would mean that the whole Trump storyline the base has embraced is false. From his branding in The Apprentice as a master of the universe to the big lie, the greatest con in American history would collapse. Rejecting the fable would demand of his followers that they recognize their own fallibility and gullibility. But they mirror their hero in associating self-reflection as a trait of their cultural elite enemies. To shake their spell, they would have to undergo a reversal of the plot of the early film classic of humans turned into zombies, Invasion of the Body Snatchers.\nBut the Republican party would be the last place to conduct intensive deprogramming of Republicans. Instead, its enchanted base is doubling down in intensity. When the first indictment against Trump came down in New York in the campaign fraud case of paying hush money to a porn star, Trump’s believers rallied to him as savior and martyr, his polls shot up and the electability ploy dissolved into thin air. His Republican opponents were left with their hands raised in a salute to whoever the nominee would be, which would be Trump. They were the living dead.\nThe media participating in the debates have presented themselves as though they are performing a dignified and necessary role in the democratic process as it has always been done. But the forms are drained of substance. The media insistence on behaving normally is their state of denial. Just as the candidates pretend they are viable, the media pretends they are interviewing live candidates. The illusory horserace is driven round the track with illusory questions about the horserace. Sometimes the zombie candidates devour each other on stage – Nikki Haley aptly referring to Vivek Ramaswamy as “scum” – but that bit of friction has no frisson because the undead cannot be reanimated.\nThe debates have no purpose other than as a harbinger of the Republican zombie apocalypse. Already some of the prescient big-money Republican donors who had previously backed Trump, but transferred their cash in rounds of roulette first to Ron DeSantis, then to Tim Scott, and now to Haley, have begun placing their chips on Trump again.\nWhat the zombie candidates can never discuss is why they are dead. Their decayed state makes it impossible for them to examine the hex that has cast them into their twilight. They cannot explain why Trump dominates their party, transfixed it into a cult of personality, how they have all enabled him, and his ambitions for a dictatorship.\nNor can they discuss Trump’s influence in the triumph of theocratic reactionary leadership among the House Republicans, and the unholy alliance with evangelicals by which the supposedly sacred submits to the rule of the profane. Of course, the media questioners did not discourteously ask the candidates whether they agreed with the federal judge presiding over the E Jean Carroll defamation case, Lewis Kaplan, who stated as obiter dicta from the bench that Trump is a rapist “as many people commonly understand the word ‘rape’.” Trump was found guilty of sexually assaulting and defaming Carroll, and ordered to pay $5m. Then, Trump defamed her again. His second trial will begin on 15 January 2024, the same day as the Iowa caucuses.\nThe media have become zombies by a different process than the candidates. By acting on the false premise that the Republican candidates are not zombies they inevitably become zombies. Nothing is normal, but simulating the idea that the campaign is normal is both to inhabit a fantasy and empower the abnormal. Falling back on the familiar horserace narrative in which they are the bookies, they unsuspectingly enter the Trump netherworld. Their stupefied questions about winning and losing cannot restore the lost world. They treat the candidates as hopefuls, ignoring the motto at the entrance: Abandon all hope.\nThe media heavily rely on questions and answers produced by pollsters. Odds-making is offered as shrewd analysis. Repeating ever-changeable poll numbers as static empirical facts that project the future as all things being equal is the lowest and most banal surrogate for objectivity, the most common journalistic evasion of the higher duty of objectivity. It is the equivalent of reporting a poll in Weimar Germany for the July 1932 federal elections (National Socialist Workers’ party at 37%, etc), but avoiding the issue at stake of the survival of democracy, and after the election describing the result in terms of “winners and losers”.\nHow should an election that might end democracy be understood?\nBut why just make a captious reference to Germany, however pertinent the point? Our history provides dangerous precedent enough. The United States itself faced an election over the fate of democracy in 1860. The refusal to accept the election of Abraham Lincoln – the rejection of democracy – resulted in the civil war. His platform to prevent the extension of slavery to the territories was grasped by all sides as about the ultimate disposition of political power. A conservative supreme court attempted pre-emptively to impose a solution to the crisis in the Dred Scott decision of 1857 to advantage the south and crush the new Republican party through an originalist justification that the founders believed that black people were “beings of an inferior order, so far inferior, that they had no rights which the white man was bound to respect”.\nTo which Lincoln replied in his Cooper Union speech on 27 February 1860, speaking as if directly to the gathering forces of secession: “Under all these circumstances, do you really feel yourselves justified to break up this Government unless such a court decision as yours is, shall be at once submitted to as a conclusive and final rule of political action? But you will not abide the election of a Republican president! In that supposed event, you say, you will destroy the Union; and then, you say, the great crime of having destroyed it will be upon us! That is cool. A highwayman holds a pistol to my ear, and mutters through his teeth, ‘Stand and deliver, or I shall kill you, and then you will be a murderer!’ To be sure, what the robber demanded of me – my money – was my own; and I had a clear right to keep it; but it was no more my own than my vote is my own; and the threat of death to me, to extort my money, and the threat of destruction to the Union, to extort my vote, can scarcely be distinguished in principle.”\nApproaching the 1860 election, the stakes for democracy were daily discussed in the press, north and south, east and west. “How stands the case?” editorialized the New York Herald, the largest circulation newspaper in the country, opposed then to Lincoln. “The question, therefore, of Union or Disunion, will have to be settled with Lincoln’s election,” it wrote. The paper explained that if his “administration go on smoothly”, six free states would join the Union, creating majorities in the Senate and the House, and breaking the hold of minority rule. “The simple truth is, that in submitting to Lincoln’s election, the south must be content to prepare deliberately for the abolition of slavery from Delaware to Texas. This is exactly what this thing means.”\nSo, what is the simple truth exactly about what this election means? Since none of the Republican zombie candidates have a ghost of a chance, media questions about how the undead might get ahead only underscore both their and the candidates’ hollowness. Horserace questions are beating a dead horse. Such questions derive from a combination of lazy complacency and fear of offending that renders the media jockeys that flog them into zombies themselves.\nThose questions are the media contribution to avoiding the fundamental and obvious stakes in this election: the character of the Trump Republican party, its antipathy to democracy, the rise of authoritarianism and theocracy, the criminality of the prospective nominee, the conservative phalanx on the supreme court stamping the rightwing agenda on the country, the theocratic predilections of the new speaker of the House, second in the line of succession to be president, and the utter dysfunctionality of the Republican House, which is subject to Trump’s sway.\nFootnote: after his election as speaker, Mike Johnson adjourned the House as a federal government shutdown looms to travel abroad to confer with rightwing groups at what was dubbed the World Freedom Initiative, in a trip co-sponsored by the Danube Institute, a foundation financed by the anti-democratic government of Hungary sympathetic to Putin, and included the Hungarian prime minister Viktor Orbán’s political director as well as far-right figures from across Europe, one of them convicted in France of hate speech. The conference’s events included segments on “The Future of [the] Right-Wing Alliance” and “Trump’s 2016 [Campaign Managers’] Secrets, Social Media and Governmental Interference”.\nThe zombie candidates will all, one by one, decompose into a pile of dust and be swept into the proverbial dustbin of history\nIn his first chess move as speaker, Johnson has sought to separate aid to Israel from that to Ukraine, but to tie the Israel aid to slashing the budget of the Internal Revenue Service – a poison-pill proposal unacceptable to the Biden administration and the great majority of the Senate including most Republicans. The consequences of Johnson’s crackpot foray into policy is that aid to both Israel and Ukraine has been stalled. But the new speaker’s proposal was not raised in the debate by the media questioners. Nor did they once mention the name Mike Johnson.\nThe Republican debate on 9 November occurred after extensive reportage of the Heritage Foundation’s Project 2025, which lays out an anti-democratic plan to turn the US government into an authoritarian state as Trump’s program for a second term. On 25 April, the New York Times reported of the plan to replace the career civil service – “snakes” and “traitors”, according to Trump – with Trump-vetted far-right appointees in the Project 2025 database.\nOn 27 July, the Times reported how Trump and his allies plan to end the independence of the justice department and all other federal agencies. “And he plans to scour the intelligence agencies, the state department and the defense bureaucracies to remove officials he has vilified as ‘the sick political class that hates our country’.”\nOn 7 August, the Times reported Project 2025’s plan to end environmental regulation, all green energy programs and any mention of climate change. On 1 November, the Times reported the plan to purge the justice department and replace its lawyers with Trump loyalists, including those who supported the coup.\nThe Washington Post reported on 6 November on the Trump plan “for using the federal government to punish critics and opponents should he win a second term, with the former president naming individuals he wants to investigate or prosecute and his associates drafting plans to potentially invoke the Insurrection Act on his first day in office to allow him to deploy the military against civil demonstrations.”\nI reported in the Guardian on 7 November on the Heritage Foundation’s support for Senator Tommy Tuberville’s blockade against military promotions unless abortion services are denied to women in the service in order to replace the “woke” officer corps.\nYet the media interlocutors of the Republican debate asked not a single question about any aspect of the Project 2025 plan to turn the federal government from top to bottom into Trump’s personal tool and abrogate civil liberties. As it happened, the day after the debate, Trump answered that question without prompting: “If I happen to be president,” he said, “and I see somebody who’s doing well and beating me very badly, I say, ‘Go down and indict them.’ They’d be out of business. They’d be out of the election.”\nLester Holt, the anchor of NBC Nightly News, opened the debate with this question: “Speak to Republican voters who are supporting Donald Trump. Why should you and not him be the Republican nominee to face Joe Biden a year from now?”\nThe problem with that question was that it embodies journalistic lethargy barely tolerable in pre-Trump elections but glaringly inadequate in this one. The question was not an attempt to communicate or elicit vital information, but instead invited self-serving triteness. Beginning the debate with that question conveyed an implicit point of view that this campaign and election is an ordinary contest of contending opinions taking place within democratic norms. Negligence in asking straightforward questions about Trump’s brazen intent to establish a dictatorial regime to replace constitutional government served as a prophylactic for the absent but overshadowing presence.\nThe ghost at the debate, quitting from lack of funds and abysmal polls, was the former vice-president, Mike Pence. “Hang Mike Pence!” No one, moderators or candidates, saw fit to acknowledge his existence. He may be spectral for now, but he is not a zombie. He will likely reappear very much alive as a central witness in Trump’s trial starting in March 2024 in the Washington DC district court. He is not forgotten by Jack Smith.\nThree days before the debate, special prosecutor Jack Smith filed a motion entitled “Government’s Opposition to Defendant’s Motion to Strike Inflammatory Allegations from the Indictment”. In it, he wrote: “Indeed, that day was the culmination of the defendant’s criminal conspiracies to overturn the legitimate results of the presidential election, when the defendant directed a large and angry crowd – one that he had summoned to Washington DC, and fueled with knowingly false claims of election fraud – to the Capitol to obstruct the congressional certification proceeding. When his supporters did so, including through violence, the defendant did not try to stop them; instead, he encouraged them and attempted to leverage their actions by further obstructing the certification.”\nNeither Jack Smith nor his latest or any filing were raised by the moderators in the debate. Other words that went unsaid were “trial”, “indictment” and “January 6”.\nTrump’s portentous invisibility was reinforced by the media ignoring his statements. Kristen Welker, the moderator of Meet the Press, asked each candidate where they stood on funding for Ukraine. But since the candidates have become zombies, the only valuable query would be to probe their views about Trump’s to gauge the degree of absolute mindlessness of their loyalty oath to him.\nEleven days before the debate, on 29 October, Trump told a story about how he rebuked Nato leaders that if they did not pay more the US would not honor its treaty obligation to defend the alliance. “We’re not going to protect you any longer,” Trump said he had boasted. “The head of a country stood up, said, ‘Does that mean if Russia attacks my country, you will not be there?’”\n“That’s right, that’s what it means,” Trump said. “I will not protect you.”\nTrump’s former national security adviser, John Bolton, stated in May of 2022 that Trump “may well have withdrawn from Nato” in a second term and that Putin “was waiting for that”. Trump’s former chief of staff, the retired general John Kelly, stated that “one of the most difficult tasks he faced with Trump was trying to stop him from pulling out of Nato”, according to the New York Times reporter Michael Schmidt. But there was no follow-up question to ask the candidates about Trump’s evident intention to wreck the western alliance in Putin’s obvious interest.\nWelker moved on to an abortion question, framed on the implicit terms that the Republican problem with the issue was one of messaging, reducing it to a matter of positioning, a question again of winning and losing. “Abortion rights supporters saw victories in Ohio and Virginia following earlier wins in states like Kansas and Kentucky. Governor DeSantis, first to you. How do you see the path forward for Republicans on this issue?” The supreme court went unmentioned.\nThe question avoided everything that surrounded the high court’s decision in Dobbs overturning a half-century women’s right. Did Clarence Thomas, John Roberts, Samuel Alito, Neil Gorsuch, and Amy Coney Barrett commit perjury in their Senate confirmation hearings when they stated under oath that they believed in the judicial doctrine of stare decisis, of deference to long-established precedent, and as a result would retain Roe v Wade? Sonia Sotomayor has said about Dobbs: “Will this institution survive the stench that this creates in the public perception that the constitution and its reading are just political acts? I don’t see how it is possible.”\nHer question went unasked. Nor were there questions about the ethical crisis enveloping the supreme court, with revelations of luxury gifts lavished on conservative justices by wealthy interested patrons. Nor was Senator Sheldon Whitehouse’s herculean effort to bring the court under the ethics standards of the rest of the federal judiciary mentioned. Under intense public pressure, the court issued its first ethics guidelines four days after the debate, with no mechanisms for enforcement, leaving the matter to each individual justice: the Clarence Thomas honor code. The media moderators missed their opportunity – and their responsibility.\nThe zombie candidates will all, one by one, decompose into a pile of dust and be swept into the proverbial dustbin of history. Senator Tim Scott, after raising more than $13m, and his associated political action committee millions more, supported by less than 3% of Republican voters, dropped out after the debate. When he departed, he left no trace of his prior existence. And soon enough there will be none, except Trump.\nThe sleepwalking media in the debate performed a pantomime made up of archaic conventional gestures. But their willful obliviousness obscures the present danger posed by Trump’s fever dreams of dictatorship.", "source_domain": "www.theguardian.com", "text": null, "title": "We have zombie Republican presidential candidates, enabled by an undead media", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/nov/15/republicans-trump-zombie-candidates-sidney-blumenthal"}