{"authors": ["Sky Uk Limited"], "date_download": "2024-02-05 15:39:35", "date_modify": "None", "date_publish": "2023-11-15 03:15:00", "description": "Thousands have fled the hospital since the outbreak of the conflict, but around 650 patients and 500 staff - along with around 2,500 displaced Palestinians - are thought to still be in al Shifa, according to UN estimates.", "filename": "https%3A%2F%2Fnews.sky.com%2Fstory%2Fisrael-hamas-israel-launches-targeted-raid-on-al-shifa-hospital-13008524.json", "image_url": "https://e3.365dm.com/23/11/1600x900/skynews-israel-gaza-hamas-incubator_6360117.jpg?20231114100049", "language": "en", "localpath": null, "maintext": "Israel's military says it has delivered incubators, baby food and medical supplies to the al Shifa hospital where its \"targeted operation\" is \"still ongoing\".\nIsraeli forces said overnight they had entered a \"specified area\" of the medical complex for a \"precise and targeted\" operation \"against Hamas\", with tanks and troops seen at the site this morning.\nThe Israel Defense Force (IDF) has since released images it claims shows their military operation at the al Shifa hospital.\nMeanwhile, the Hamas-led health ministry has released photos it claims shows damage inside the hospital during the operation.\nA senior Israeli defence official has said there has been no combat inside the hospital complex and that forces are in one specific area.\nImage: The Israeli military has said this photo is from the operation at al Shifa hospital\nImage: Israeli soldiers appear to be gathered outside a building at the hospital site\nA doctor inside the hospital, Ahmed El Mokhallalati, told Reuters that gunfire outside the compound has forced staff to hide away from the windows.\n\"Bombardment. Shooting around the hospital and within the hospital. It's really horrible... and then we realised that the tanks are moving around the hospital,\" he said.\n\"They just parked in front of the hospital emergency department. All kinds of weapons were used. They targeted the hospital directly. We try to avoid being near the windows.\"\nOther key developments\n• Israel says it has agreed to allow fuel into Gaza for first time during conflict\n• Israeli military says it has taken over refugee camp\n• Pro-Palestinian protest in San Francisco ahead of meeting between Biden and Xi\n• US fighter aircraft strike locations in eastern Syria\nFollow live: Israeli forces enter al Shifa hospital in 'targeted operation'\nImage: An image released by the IDF\nImage: An image the IDF says shows its soldiers during its operation at the al Shifa hospital\nThe IDF has said in a post on X, formerly known as Twitter, that its \"precise and targeted operation is still ongoing\".\nThe post added: \"We can now confirm that incubators, baby food and medical supplies, provided by the IDF, have successfully reached the hospital.\n\"Our medical team and Arabic-speaking soldiers are on the ground to ensure that these supplies reach those in need.\"\nMedical staff there had previously reported babies were taken out of existing incubators as there was no electricity supply because fuel had been cut off, rather than a shortage of incubators.\nHowever, IDF officials have said the incubators being delivered would not need to be connected to a power source.\nRead more from Sky News:\nGaza surgeon gives harrowing account of child amputation\nPalestinians stream onto Gaza highway as Israeli forces strike near hospitals\nWhat protection do hospitals have in wartime?\nImage: Gaza's health ministry says this image shows medics looking at the damag inside the al Shifa hospital following during the Israeli raid\nImage: An image Gaza's health ministry says shows inside the hospital during the operation\nThe raid comes hours after the US backed Israel's claims that the medical facility had been used by Hamas as a base for operations.\nHamas - which flatly denied the claims - blamed US President Joe Biden and his administration for the Israeli raid, saying that the \"adopting\" of the allegations had effectively given Israel the \"green light\" to launch the operation.\nHowever, in a statement, the White House said it did not support air strikes on the hospital and that it \"did not want to see\" a firefight inside the facility.\nThe White House also urged that patients \"must be protected\" during the raid.\nWhile thousands have fled the hospital since the outbreak of the Israel-Hamas conflict, around 650 patients and 500 staff - along with around 2,500 displaced Palestinians - are thought to still be in al Shifa, according to UN estimates.\nImage: The Israeli military shared this image it says show medical supplies it has delivered to al Shifa hospital\nImage: The Israeli military says it has delivered baby food to the hospital\nIDF spokesperson, Lieutenant Colonel Peter Lerner, said their intelligence put the number of people still inside the facility at around 1,000.\nHe also said IDF forces would \"perhaps\" rescue some of the estimated 240 hostages who were taken into Gaza during Hamas's attack on Israel on 7 October.\nIsrael has repeatedly claimed that al Shifa - a large medical complex in Gaza City - along with other hospitals, have been used as bases by Hamas.\nIt has previously threatened to target al Shifa and has warned about the potential for the facility to lose its protection under international humanitarian law if used to hide fighters or store weapons.\nImage: An image from inside the hospital earlier in the conflict. Pic: Gaza Health Ministry\nImage: An image from inside al Shifa earlier in the conflict. Pic: Gaza Health Ministry\nOn Monday, President Biden said that the hospital \"must be protected\" and that it was his \"expectation\" that there would be \"less intrusive action\".\nIt came before the White House's national security council spokesperson, John Kirby, said on Tuesday that the US had its own intelligence that showed Hamas were operating out of al Shifa.\nHamas responded to \"strongly condemn and reject the claims\".\nHowever, hours later, the IDF announced it had launched its \"targeted operation\" at the hospital.\nImage: Smoke rises over the al Shifa hospital\nPlease use Chrome browser for a more accessible video player 0:59 What status do hospitals have in war?\nIn a statement announcing the raid, the IDF said it had \"publicly warned time and again that Hamas' continued military use of the hospital jeopardised its protected status under international law\".\n\"Yesterday [Monday], the IDF conveyed to the relevant authorities in Gaza once again that all military activities within the hospital must cease within 12 hours,\" the statement adds.\n\"Unfortunately, they did not.\"\nThe IDF urged any Hamas fighters in the hospital to surrender immediately.\nImage: Premature Palestinian babies in Shifa Hospital. Pic: Dr Marawan Abu Saada via AP\nImage: Map showing Israeli operations in Gaza\nIn response, Hamas said it held Israel, President Biden, and his administration, \"fully responsible for the repercussions of the occupation army's storming of the Shifa Medical Complex, and what the medical staff and thousands of displaced people are exposed to, as a result of this brutal crime against a health facility protected by international law\".\nThe raid came amid claims of a humanitarian crisis at the hospital. Gaza's Hamas-run Health Ministry said 32 patients, including three babies, had died since the hospital's emergency generator ran out of fuel on Saturday.", "source_domain": "news.sky.com", "text": null, "title": "Israel-Hamas: IDF enters Gaza's largest hospital but says it has delivered incubators, baby food and medical supplies", "title_page": null, "title_rss": null, "url": "https://news.sky.com/story/israel-hamas-israel-launches-targeted-raid-on-al-shifa-hospital-13008524"}