{"authors": [], "date_download": "2024-02-05 15:16:18", "date_modify": "None", "date_publish": "2024-01-23 05:41:43", "description": "For almost 20 months the Pentagon has spearheaded a monthly gathering of about 50 allies where the U.S. has led the way in sending billions of dollars in aid to Kyiv", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fpentagon-ap-united-states-ukraine-lloyd-austin-b2483055.html.json", "image_url": "https://static.independent.co.uk/2024/01/23/05/Russia_Ukraine_War_Military_Aid_04727.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFor the first time since Defense Secretary Lloyd Austin established the international group to support Ukraine in April 2022, the United States will host the monthly gathering of about 50 countries out of money, unable to send the ammunition and missiles that Ukraine needs to fend off Russia.\nWhile waiting for Congress to pass a budget and potentially approve more money for Ukraine’s fight, the U.S. will be looking to allies to keep bridging the gap.\nTuesday's meeting will focus on longer-term needs, deputy Pentagon press secretary Sabrina Singh told reporters Monday.\n“Even though we aren’t able to provide our security assistance right now, our partners are continuing to do that,” Singh said.\nThe meeting will be virtual because Austin is still recuperating at home from complications of treatment for prostate cancer.\nThe Pentagon announced its last security assistance for Ukraine on Dec. 27, a $250 million package that included 155 mm rounds, Stinger anti-aircraft missiles and other high-demand items drawn from existing U.S. stockpiles.\nThe U.S. has not been able to provide additional munitions since then because the money for replenishing those stockpiles has run out and Congress has yet to approve more funds.\nMore than $110 billion in aid for both Ukraine and Israel is stalled over disagreements between Congress and the White House over other policy priorities, including additional security for the U.S.-Mexico border.\nMeanwhile, Russia has shown no willingness to end its conflict in Ukraine, and on Monday the United Nations ruled out any peace plan backed by Kyiv and the West.\nThe U.S. has provided Ukraine more than $44.2 billion in security assistance since Russia invaded in February 2022. About $23.6 billion of that was pulled from existing military stockpiles and almost $19 billion was sent in the form of longer-term military contracts, for items that will take months to procure. So even though funds have run out, some previously purchased weapons will continue to flow in. An additional $1.7 billion has been provided by the U.S. State Department in the form of foreign military financing.\nThe U.S. and approximately 30 international partners are also continuing to train Ukrainian forces, and to date have trained a total of 118,000 Ukrainians at locations around the world, said Col. Marty O’Donnell, spokesman for U.S. Army Europe and Africa.\nThe United States has trained approximately 18,000 of those fighters, including approximately 16,300 soldiers in Germany. About 1,500 additional fighters are currently going through training.", "source_domain": "www.independent.co.uk", "text": null, "title": "The Pentagon has no more money for Ukraine as it hosts a meeting of 50 allies on support for Kyiv", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/pentagon-ap-united-states-ukraine-lloyd-austin-b2483055.html"}