{"authors": [], "date_download": "2024-02-05 15:39:37", "date_modify": "None", "date_publish": "2023-11-15 16:06:33", "description": "A Myanmar army battalion based near the Chinese border has reportedly surrendered to an alliance of ethnic armed groups that launched a surprise offensive last month in the country’s northeast", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmyanmar-ap-chinese-bangkok-rakhine-b2447884.html.json", "image_url": "https://static.independent.co.uk/2023/11/15/16/Myanmar_Conflict_00884.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA Myanmar army battalion based near the Chinese border surrendered to an alliance of ethnic armed groups that launched a surprise offensive last month against the military, a spokesperson for one of the groups said Wednesday.\nThe surrender on Sunday of 261 people — 127 soldiers and 134 family members — from the infantry battalion in northeastern Shan state appears to be the biggest by regular army forces since widespread armed conflict in Myanmar broke out in 2021 following the military's seizure of power from the elected government of Aung San Suu Kyi in February that year.\nThe alliance expects to soon capture Laukkaing, the area’s major city, the spokesperson said.\nThe surrender — which has not been announced by the military government and could not be independently confirmed by The Associated Press — came two weeks after the Arakan Army, the Myanmar National Democratic Alliance Army and the Ta’ang National Liberation Army, calling themselves the Three Brotherhood Alliance, launched a coordinated offensive on Oct. 27.\nThe alliance has claimed widespread victories, and the military government made a rare acknowledgement on Nov. 2 that it had lost control of three towns. One is a major border crossing for trade with China.\nThe offensive in the northern part of Shan state was seen as a significant challenge for the army, which has struggled to contain a nationwide uprising by members of the Peoples’ Defense Force, a pro-democracy armed group established after the 2021 army takeover. The various PDF groups that operate around the country have joined forces with well-organized, battle-hardened ethnic armed groups — including those in the Three Brotherhood Alliance — that have been fighting Myanmar’s central government for greater autonomy for decades.\nThe military government faced another challenge on Monday when the Arakan Army launched surprise attacks on military targets in five townships in Myanmar's western Rakhine state. A yearlong cease fire had previously been declared in the state between the military government and the Arakan Army.\nThe U.N. humanitarian office in a situation report on Wednesday said in addition to the attacks in Rakhine, fighting has spread to areas in Myanmar's northwest and southeast. It said there was active combat in Loikaw, the capital of the eastern state of Kayah, which resistance forces are trying to seize. The U.N agency said the city has been bombed by the military, causing civilian casualties.\n“In northern Shan alone, fighting continues to rage in at least 10 townships, leading to a surge in civilian casualties, with 43 fatalities and 71 injuries reported,” it said, adding that the number of new internally displaced people since the recent fighting began has climbed to 60,000.\nLe Kyar Wai, a spokesperson for the Myanmar National Democratic Alliance Army, told the AP that each soldier who surrendered in Shan state, including the commander, was awarded 1 million kyat (about $480) and family members were each given 100,000 kyat ($48).\n“We give medical treatment to the injured. We delivered them safely to their desired destination,” Le Kyar Wai said, adding that the alliance groups planned to launch an operation soon to seize Laukkaing after they surrounded the city.\nLaukkaing is known for hosting major organized criminal enterprises including cyberscam operations controlled by Chinese investors in cooperation with local Myanmar warlords.\nThe Chinese government in recent weeks has pushed a crackdown on these operations, and thousands of people involved have been repatriated to China. Many employed were tricked into working and then held against their will.\nThe Three Brotherhood Alliance has announced that a goal of its Oct. 27 offensive was to crack down on the scam operations. Le Kyar Wai said the alliance would rescue those held by the scam centers, arrest the people behind the operations and transfer them to relevant authorities.\nThe soldiers who surrendered were not the first to lay down their weapons to the alliance groups in Shan state. On Oct. 30, 41 soldiers from another infantry battalion based in nearby Kunlong township surrendered.\nSince the offensive began last month, soldiers and police have also surrendered in Karen, Kayah, Rakhine and Chin states and Sagaing region, according to ethnic armed groups and independent local media.", "source_domain": "www.independent.co.uk", "text": null, "title": "An ethnic resistance group in northern Myanmar says an entire army battalion has surrendered to it", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/myanmar-ap-chinese-bangkok-rakhine-b2447884.html"}