{"authors": ["Jack Maidment", "Benedict Smith", "Daniel Martin", "Politics Live Blog Editor", "Deputy Political Editor"], "date_download": "2024-02-05 15:39:41", "date_modify": "None", "date_publish": "2023-11-15 00:00:00", "description": "Sir Keir Starmer suffered the biggest rebellion of his leadership last night as eight Labour frontbenchers defied him over a vote for an immediate ceasefire in Gaza.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fpolitics%2F2023%2F11%2F15%2Frishi-sunak-latest-news-suella-braverman-pmqs%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/politics/2023/11/15/TELEMMGLPICT000290509049_17000845147680_trans_NvBQzQNjv4BqRo0U4xU-30oDveS4pXV-Vv4Xpit_DMGvdp2n7FDd82k.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Sir Keir Starmer suffered the biggest rebellion of his leadership last night as eight Labour frontbenchers defied him over a vote for an immediate ceasefire in Gaza.\nJess Phillips and seven other shadow ministers resigned or were sacked after being told they could not stay in the top team if they voted against the party’s Israel policy.\nAnother two parliamentary aides, along with almost 50 backbench MPs, voted for a ceasefire in the territory, which has been under fire by Israeli forces since the Hamas attacks on Oct 7.\nThe frontbench exodus is thought to be the biggest since 16 ministers left Boris Johnson’s government in the dying days of his premiership in 2019.\nThe vote came on the same day that Israeli forces stormed Gaza’s biggest hospital, claiming to have found Hamas weapons stored among patients.\nLast night, a defiant Sir Keir said: “I regret that some colleagues felt unable to support the position tonight.\n“But I wanted to be clear about where I stood, and where I will stand. Leadership is about doing the right thing. That is the least the public deserves. And the least that leadership demands.”\nMajor rebellion for Starmer\nMs Phillips, the shadow domestic violence minister, defied the party whip along with Paula Barker, Rachel Hopkins, Afzal Khan, Sarah Owen, Yasmin Qureshi, Naz Shah and Andy Slaughter.\nTwo parliamentary private secretaries, Dan Carden and Mary Foy, also left their posts.\nIn a letter to Sir Keir, Ms Phillips said: “I must vote with my constituents, my head, and my heart which has felt as if it were breaking over the last four weeks with the horror of the situation in Israel and Palestine.\n“I see no route where the current military action does anything but put at risk the hope of peace and security for anyone in the region now and in the future.”", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Jess Phillips among eight frontbenchers to defy Starmer over Gaza ceasefire", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/politics/2023/11/15/rishi-sunak-latest-news-suella-braverman-pmqs/"}