{"authors": ["Adam Chapman"], "date_download": "2024-02-05 15:39:48", "date_modify": "None", "date_publish": "2023-11-15 16:23:00", "description": "The high-speed pursuit takes an unexpected turn when one Russian soldier opens the door of the car.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1835415%2Fukraine-war-drone-russia-vladimir-putin.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5068031.jpg", "language": "en", "localpath": null, "maintext": "Uninvited guest: Insane moment Ukrainian drone enters speeding car full of Russian soldiers\nThis is the unbelievable moment a Ukranian drone enters a minivan full of Russian soldiers. The exhilarating footage is taken from the drone as it chases down the speeding car in an unspecified location in Ukraine. The vehicle is seen careening from side to side as it hurtles down the dirt road in what appears to be a desperate attempt to escape the drone. This proves increasingly challenging as the drone zooms ahead of the car before turning to confront it head-on. Against all odds, the minivan manages to outmanoeuvre the Ukrainian hardware again.\nHowever, its luck soon runs out after one passenger decides to open the door of the car. The drone then gains entry into the speeding vehicle in what appears to be a direct hit. The screen then turns to grey. The fate of the Russian soldiers remains unclear but other footage circulating from the front line has a less ambiguous ending. FPV drone footage captured the dramatic moment a Russian soldier was blown up as he crossed a field.\nTrending\nThere's no short supply of these videos as Vladimir Putin's invasion of Ukraine sputters. On Wednesday, a top Ukrainian official said its troops had established a beachhead on the eastern bank of the Dnieper River near Kherson, an important advance in bridging one of Russia’s most significant strategic barriers in the war. Andriy Yermak, head of the president’s office, provided no details but confirmed the development that has been widely discussed in military forums over the past month. “Against all odds, Ukraine’s defense forces have gained a foothold on the left bank of the Dnieper,” Yermak told the Hudson Institute, a conservative Washington think tank, in a speech Monday. It marks a major win for the counteroffensive and could shape the trajectory of the war. Crossing the Dnieper could allow Ukraine to outflank Russia without having to break through the heavily mined and fortified front line in the Zaporizhzhia region.", "source_domain": "www.express.co.uk", "text": null, "title": "Insane moment Ukrainian drone enters speeding car full of Russian soldiers", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1835415/ukraine-war-drone-russia-vladimir-putin"}