{"authors": [], "date_download": "2024-02-05 15:39:48", "date_modify": "None", "date_publish": "2023-11-15 23:13:30", "description": "As war rages on between Israel and Gaza, tensions have been heightened at schools across the US, students and academics tell Josh Marcus", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fcornell-cooper-college-israel-palestine-b2440138.html.json", "image_url": "https://static.independent.co.uk/2023/11/02/10/free%20speech%20on%20college%20campuses%20Indycomp%20copy.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nSince the outbreak of the Israel-Hamas war, schools across America have been grappling with two great, related challenges: how to keep students safe and prevent identity-based intimidation and violence, and how to maintain the tradition of open scholarship and activism on campus.\nEach of these issues is complicated in its own right, and they have become fiendishly difficult when balanced against each other. Tempers are rising and schools seem overwhelmed, as US campuses are consumed with protest melees, death threats, doxxing, officials banning protest groups, and calls to remove professors for their writings.\nIncidents have taken place across the country.\nLate last month, a short clip went viral on social media, showing a group of Jewish students in yarmulkes and tzitzit appearing to be locked inside the library of Cooper Union college in New York, as demonstrators chanted, “Free Palestine!” and banged on the doors.\n“Are we locked in?” one of the students asks in the video. Some reportedly began to cry in fear.\n“I felt hated for my Jewish identity,” student Taylor Roslyn Lent said of the experience. “There’s definitely a big difference between a pro-Palestine-anti-Israel rally, and an anti-Jewish rally. And the more the day went on, the more it felt like an anti-Jewish rally.”\nThe encounter began earlier that day as pro-Israel students joined a counter-protest against the planned pro-Palestine demonstration, then broke off and headed for the library. Some of the pro-Palestine demonstrators continued chanting and eventually headed in the same direction. School officials decided to close the library doors. Cooper Union told The Independent the doors were not locked, and that security footage shows “people entering and exiting the library during the 20 minutes that the doors were closed.”\nPolice officers were on campus for the demonstration at the request of school officials, and were present in the library with students. The NYPD said it did not see any direct safety threat, but the encounter left some students deeply shaken nonetheless.\nCooper Union students locked in library during rally\n“I felt not safe, deep down,” Ms Roslyn Lent told The WashingtonPost.\n‘Terrified for their lives’\nOn 31 October, a 21-year-old junior at New York’s Cornell University named Patrick Dai was arrested for allegedly making a series of extreme violent threats towards the school’s Jewish population.\nOn Greekrank, an online message board devoted to campus sorority and fraternity life, Mr Dai allegedly used pseudonyms like “hamas” and “jew jenocide” and called for the murder and rape of Jewish students at the university, whom he called “pigs” and “animals,” and threatened to shoot up a dining hall that serves Kosher food.\nThe 21-year-old, whose mother told the Rochester Democrat and Chronicle he struggles with his mental health and later apologised for the posts, appeared in court earlier this month and did not enter a plea.\nStudents with a variety of different perspectives on the Israel-Palestine crisis say campus debate has gone off the rails\n“Jewish students on campus right now are unbelievably terrified for their lives,” Molly Goldstein, co-president of the Cornell Center for Jewish Living, told CNN. “I never would have expected this to happen on my university campus.”\nCornell isn’t the only place place on edge.\nIn October, a 19-year-old was charged with hate crimes for allegedly assaulting an Israeli student at Columbia University for hanging posters about Israeli civilian deaths and hostages.\n“Free speech, open debate and heterodox views lie at the core of academic life. They are fundamental to educating future leaders to think and act morally. The reality on some college campuses today is the opposite: open intimidation of Jewish students,” a group of pro-Israel student activists from Yale, Brown, and Cornell wrote in a recent New York Times op-ed. “Mob harassment must not be confused with free speech.”\nEarlier this month, at Stanford University in California, an Arab Muslim student was struck in a hit-and-run, with the driver allegedly yelling, “F*** you and your people,” in what the California Highway Patrol and Santa Clara County Sheriff’s Office are investigating as a hate crime.\nThe Anti-Defamation League, a civil rights group that tracks antisemitism and other forms of extremism, says it has seen a 400-per cent increase in antisemitic incidents across the US since the war started, from vandalism and assault to “anti-Israel rallies” and events with “implicit support for Hamas”.\n“This is a threat that is reaching, in some way, sort of historic levels,” FBI director Christopher Wray testified before Congress in October. “In fact, our statistics would indicate that for a group that represents only about 2.4 per cent of the American public, they account for something like 60 per cent of all religious-based hate crimes.”\nThe FBI official also described a hate-crime investigation into the death of Wadea Al-Fayoume, a six-year-old Palestinian-American boy who was stabbed by his family’s landlord in Illinois. Federal officials and community groups have warned of a rise in anti-Muslim attacks amid the ongoing war.\nThe threat is so severe the White House has become involved, partnering with the Department of Justice and the Department of Homeland Security, as well as campus law enforcement, to track hate-related campus threats, including online.\nWhite House officials say they’re concerned with an ‘alarming’ rise in antisemitism on campus and have launched new measures to monitor threats (AP)\n“The US remains in a heightened threat environment and recent events reinforce that,” a DHS spokesperson told The Independent. “As the Israel-Hamas conflict continues, we have seen an increase in reports of threats against Jewish, Muslim, and Arab communities and institutions. Lone offenders, motivated by a range of violent ideologies, pose the most likely threat.”\nSpeaking to the urgency of the threat, nearly 100 officials from top universities like Harvard, Yale, Columbia and the University of Pennsylvania are expected to attend Brandeis University’s Presidential Initiative to Counter Antisemitism in Higher Education.\nNews of the US campus crisis has even circled back to Israel, where the country’s equivalent of Saturday Night Live has mocked American college activists.\nProtesters on all sides said they were facing major pressure to limit their activities and silence their voices on campus. While the US has a long tradition of activism on school grounds, campuses have also been home to civil rights abuses against students, from the Kent State massacre to the FBI’s infiltration of student and civil rights groups under J Edgar Hoover.\nStudent protest has a long history in the US, from the civil rights movement to demonstrations on campus against the Vietnam War (Getty Images)\nIn late October, a group of students, many of them Muslim, organised a protest at the public Bloomfield Hills High School, in Bloomfield Township, a wealthy town outside Detroit home to both a large Jewish population and sizeable Muslim minority, including Palestinian-Americans.\nThe school had been notified about the demonstration, which was meant to raise awareness of the ongoing humanitarian crisis in Gaza, and administrators tried to dissuade students from carrying it out, according to the Michigan chapter of the Council on American-Islamic Relations (CAIR). Nonetheless, the school gave its permission and offered security assistance, CAIR said.\nBut when students, including some who were Jewish, did carry out the demonstration, parents showed up at the school and began filming the protest, and a police officer reportedly questioned one student about why she was engaged in the demonstration, CAIR told The Independent.\nThe incident left both students and their parents alarmed.\nParticipants in the event were allegedly called into the principal’s office and asked questions about the protest and their role in it, ranging from who made signs to what students’ “intentions” were. Those who refused to answer were removed from school and threatened with another interview with a district safety official.\nTo Amy V Doukoure, an attorney at CAIR, the whole affair marked a major overstep from school officials. She said students had the right to protest on school grounds. “The Supreme Court is clear that students, even public high school students, do not check their constitutional protections at the door,” she told The Independent.\nThe school has previously been home to student protests about Black Lives Matter, LGBT+ rights, and school shootings, none of which provoked interrogation.\nIn fact, she said, even after the Israel-Hamas war began, the school has navigated such issues, such as allowing a student to wear an Israeli Defense Forces sweatshirt on campus and allowing other students to express their disagreement with it. Hauling in students and interrogating them about a campus protest crosses a line, according to the attorney.\nMany campus debates about the war center on what counts as fair commentary and what’s hateful incitement when it comes to Israel and Palestine\n“It seems like retaliation frankly and it seems like hyperbole,” she added. “The school doesn’t have the right to determine someone’s intent behind their political beliefs. They have the requirement to determine whether an actual threat was made.”\nThe group behind the rally, Students Organized for Palestine, said in a statement that the event had partly been to call for expanded humanities courses that would “accurately present an impartial, unbiased portrayal of the history of the Israeli occupation of the Palestinian territories” based on input from Israeli and Palestinian experts.\nSchool officials have said the event wasn’t school-sanctioned.\nParents have demanded that the students involved be expelled for breaking school rules on threatening people, because of the protesters using the chant, “From the river to the sea, Palestine will be free.” Some parents saw the slogan, which dates back to the 1960s, as a direct threat to harm Jews through the destruction of the Israeli state. Others say they use it to signify a call for political equality, rather than violence.\nThe Independent has contacted Bloomfield Hills High School for comment.\nThe slogan was also projected last week onto buildings at the University of Pennsylvania, alongside messages like, “Zionism is racism.”\n“Projecting hateful messages on our campus is not debate, it is cowardice, and it has no place at Penn,” university president Liz Magill wrote in a statement.\n‘The climate is incredibly tense’\nThe tense atmosphere has made it hard to have nuanced discussions, according to one campus activist at the University of Florida chapter of Jewish Voice for Peace (JVP), the leftist advocacy group behind mass demonstrations across the US calling for a ceasefire.\nThe student, who asked to remain anonymous for his safety, is Jewish and has family in Israel, and is also critical of Zionism and of the thousands of civilian deaths in both Israel and Gaza in recent weeks.\nHe said he has seen pressure to stay quiet from above and from his fellow students. At one campus event, he was sitting near a table where a Muslim student organisation had a Palestinian flag. A stranger walked up and began shouting that the nearby organisations were “actively supporting the genocide of all Jews”.\n“The campus climate is incredibly tense,” he said. “There are people here who are scared. There’s rising racism, Islamophobia, and antisemitism all across American right now.”\nPoliticians and advocates have also painted pro-Palestinian groups as material supporters of terrorism. In late October, the Anti-Defamation League and the Brandeis Center sent letters to nearly 200 colleges and universities, warning that members of the Students for Justice in Palestine group may be materially supporting Hamas, because the group frames itself as part of the same overall Palestinian “resistance” movement as the militant group.\nRon DeSantis has urged Florida education officials to crack down on pro-Palestine student activists, suggesting they may be materially supporting Hamas (Copyright 2023 The Associated Press. All rights reserved)\n“In recent weeks, their rhetoric and activity has escalated significantly,” the letter warned.\nFlorida has followed through on these warnings. In a 24 October letter, the chancellor of Florida’s State University System said he had ordered the shutdown of its SJP chapters “in consultation with Governor [Ron] DeSantis.”\nColumbia University on Friday announced it was suspending its chapters of SJP and JVP, accusing the groups of repeatedly violating university event policies and holding an “unauthorised event” that “proceeded despite warnings and included threatening rhetoric and intimidation.”\nWhen contacted for comment, the national organisation of SJP pointed to a statement from Palestine Legal, a legal aid group that supports the Palestine solidarity movement, which called shuttering university chapters “a blatant attack on students’ First Amendment rights, and it will be challenged in court.”\nCivil rights advocates have also condemned the Florida campaign in particular, calling it an undue threat against students for protected activities.\n“We urge you to reject calls to investigate, disband, or penalise student groups on the basis of their exercise of free speech rights,” the ACLU said of the efforts, adding that it “in no way approves or endorses” the “brutal mass murder of civilians,” but also “strongly oppose efforts to stifle free speech, free association, and academic freedom here at home.”\n“It’s just so arbitrary,” the JVP activist told The Independent. “It feels just authoritarian to some degree. We grew up learning about hating the USSR, but look at these things, the censorship in the US media and the amount of state-backed repression that is happening in the US is staggeringly similar.”\nNonetheless, the Florida student also said he’s seen quiet moments of coming together on campus since the war began.\n“A friend came up, in garb, in her hijab, and said, ‘I really appreciate you showing solidarity’ because I had attended an event wearing my kippah. I thought that was an important show of solidarity.”\n“Interactions like that show me there is a lot of positive to be found right now,” he added.\n‘Crossed the line’\nStudents and academics who support Palestine or criticise Israel say they have been swiftly condemned in the national spotlight in a way that doesn’t apply for others with different views.\nWhen Harvard students, echoing the sentiments of the editorial board at Israel’s paper of record, Haaretz, signed onto a letter holding Israel’s larger policies towards Palestinians as “responsible” for the outbreak of war, they were immediately doxxed, harassed with trucks on campus bearing their name and personal information, and subject to an online campaign from prominent business executives and Wall Street leaders to blacklist them.\nRyna Workman, an NYU law student who blamed Israel for the 7 October attacks in a statement, saw their job offer at Winston & Strawn, a prominent law firm, rescinded and was removed as president of the student bar association.\nAcademics and activists at US universities who are critical of Israel say they frequently face unfair public demonisation (Getty Images)\nThe University of Pennsylvania hosted a Palestinian literature festival in September, prior to the outbreak of the war, featuring over 100 speakers, including a few guests who critics considered to be antisemitic. Since 7 October, alumni including private equity billionaire Marc Rowan, Law & Order creator Dick Wolf, and former US ambassador John Huntsman have halted donations to the Ivy League giant and called for its president to resign, accusing the school of harbouring hate.\nHarvard University students who blamed Israel for creating the context for the war were doxxed and blacklisted by coporate executives (Copyright 2022 The Associated Press. All rights reserved.)\n“I have a difficult time imagining an improved dialogue in the current conditions, if only because the levels of institutional power between supporters of Israel and Palestine are so discordant,” said Steven Salaita, a Palestinian-American writer and scholar of indigenous studies.\nHe was fired from a tenured position at the University of Illinois in 2014 before he even began teaching classes for making what school administrators called “uncivil” tweets about Israel amid the 2014 siege of Gaza, angering donors to the public university. He sued the school, saying it had violated his constitutional “right to express my opinion on pressing human rights concerns, including Israeli government actions,” and the university later settled the case.\nAll of these forces – students under threat, academics feeling silenced, administrators struggling with a response – have come to a head at Columbia University, a school with an Ivy League pedigree, a population of nearly one-quarter Jewish students, and a long history of post-colonial Palestinian scholarship as the home of famed academic Edward Said.\nOn 13 October, a petition appeared on Change.org from Columbia student Maya Platek, calling for the removal of Joseph Massad, a longtime tenured professor of modern Arab politics. It now has over 75,000 signatures.\nMs Platek, who is Jewish and Israeli, accused the professor, who is Palestinian, of “condoning and supporting terrorism,” encouraging “violence and misinformation,” and “putting many Jewish and Israeli students on campus at risk” for an 8 October article on the website The Electronic Intifada,\nThe article, “Just another battle or the Palestinian war of liberation?”, analyses the early moments of the conflict after what he calls the “innovative” and “stunning” 7 October Hamas surprise attack on Israel, an operation that killed numerous civilians. The professor calls Hamas, which is designated a terrorist group by the US government, a legally justified armed anti-colonial resistance movement with a “right to resist occupation under international law.”\nA petition is calling for the firing of a Columbia professor who praised aspects of Hamas’s 7 October on Israel (Copyright 2023 The Associated Press. All rights reserved.)\nMs Platek, a junior and former student body president, said she first encountered Prof Massad’s work the day she started the petition and had never been his student. But she was horrified to read what she saw as the glorification of violence against civilians, and worried such rhetoric would make students at Columbia unsafe, given the already unstable campus atmosphere.\n“I think it’s valid to have different perspectives and there should be vigorous debates,” she told The Independent. “This specifically is talking about something that horrifically and barbarically happened to civilians. That’s what crossed the line.”\n“That specifically feels unsafe,” she added. “I don’t think that this is about the Israeli-Palestinian conflict.”\nThe Biden administration has directed the departments of Justice and Homeland Security to crack down on campus antisemitism (Copyright 2022 The Associated Press. All rights reserved.)\nThe economics-math-political science major, who also filed a formal complaint with the university, thought going public was the only way her effort would get real traction. For now, she’s uninterested in meeting with the professor directly.\n“I think that the moment you dehumanise an entire population of children, women, and the elderly there’s very little I can say,” she said. “I and many people feel unsafe with somebody who is capable of saying rhetoric like that.”\nSince launching the petition, she said she’s received numerous messages from students sharing similar fears about being on campus.\nNew York University historian Zachary Lockman, who chairs the Middle East Studies Association’s (MESA) Committee on Academic Freedom, and who studies Israel and Palestine, worries that calls to fire professors for their views on the war are eroding the academic freedom to have vital discussions at a time of great geopolitical change.\n“The whole point of academic freedom is to protect people from being threatened with dismissal because of their opinions, whether or not I agree with Joseph Massad or the specific way he expresses his opinions,” Prof Lockman told The Independent. “He did so as an individual. He is entitled to do so. I think it’s wrong to demand of the university that they terminate him…This kind of stuff is dangerous.”\nMESA wrote a letter to Columbia’s president warning of “a severe abdication of professional and academic responsibility” and urging the school to do more to defend the professor, who was previously subject of a high-profile removal campaign in the 2000s championed by then-Columbia student Bari Weiss, who has since become a prominent commentator.\nThe Independent has contacted Prof Massad and the Columbia University president’s office for comment.\nFinding a way to have a better conversation somehow is vital to the wider picture of US politics, according to NYU’s Professor Lockman, because of America’s position as Israel’s key security ally.\nHe said: “It’s only the Biden administration which stands between what’s going on now and a ceasefire. The rest of the world would come around tomorrow. This brings it home in a certain way. We are complicit, for better or worse, whatever one thinks, in what’s going on.”\nThis article was amended on 15 November 2023. It previously inaccurately stated library doors were locked during an October protest at Cooper Union. The doors were closed but not locked.", "source_domain": "www.independent.co.uk", "text": null, "title": "Fear and free speech collide on America's campuses as Israel-Hamas war rages", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/cornell-cooper-college-israel-palestine-b2440138.html"}