{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:39:49", "date_modify": "None", "date_publish": "2023-11-15 08:30:04", "description": "MAILONLINE LIVEBLOG: As the Israel-Hamas war enters its 40th day, follow here for all the latest updates.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12751527%2Fisrael-hamas-war-live-updates-israeli-soldiers-gaza-al-shifa-hospital-targeted-operation.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/08/77819995-0-image-a-12_1700036841820.jpg", "language": "en", "localpath": null, "maintext": "This is not the first time the sprawling complex of buildings and courtyards that make up Gaza's Al Shifa hospital has found itself in the middle of a conflict.\nThe complex is metres from Gaza City's small fishing port and sandwiched between Beach refugee camp and the city's Rimal neighbourhood. Its name comes from the Arabic word 'healing' - common for hospitals in the Middle East.\nIt was built in 1946 during British rule, two years before Britain withdrew from Palestine. It survived the Egyptian invasion in 1948 and two decades of Egyptian military rule over the Gaza Strip.\nIn 1967, Israel captured and occupied the Gaza Strip and in subsequent years, there were regular clashes nearby which sometimes moved into the hospital grounds.\nIn 1971, The Times reported a gun battle between a Palestinian militant who hid under a bed in the nurses' quarters and an Israeli army patrol.\nAnd on December 9 1987, the first day of the First Intifada against Israeli occupation during which Hamas was formed, Shifa was again pulled into the conflict.\nA story from Reuters's archive describes an Israeli army helicopter circling the hospital three times, before flying low over the wall and dropping tear gas onto the hospital's central courtyard - where civilians are sheltering today.\n'Palestinian orderlies, patients' relatives and students scattered in panic, their eyes streaming. A youth picked up the grenade and threw it out into the street,' the report said at the time. One person yelled that they thought they were under fire.\nIn 1994, Palestine Liberation Organization leader Yasser Arafat's security forces saluted the Palestinian flag when it was raised over the hospital after Palestinians were granted limited self-autonomy in Gaza during the Oslo peace process.\nHamas won a surprise election victory in Gaza in 2006. The following year, Hamas staged a military takeover of Gaza, forcing Fatah, the secular group that has long dominated the Palestinian Authority, out of the enclave.\nDuring the power struggle building up to that takeover, fighters from both Fatah and Hamas were treated at Shifa and other hospitals, under the understanding that neither would harm the other side's wounded.\nHamas has ruled Gaza ever since, but the hospital is staffed by medics paid by the Fatah-dominated Palestinian Authority based in the West Bank.\nDuring a 2008-9 war in which more than 1,400 Palestinians and 13 Israelis were killed, Israel accused Hamas of using underground areas in Shifa to hide.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel-Hamas RECAP: Israeli soldiers storm Gaza's al Shifa hospital in 'targeted operation' to root out Hamas terrorists as doctors inside describe 'terrifying' situation for trapped patients", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12751527/israel-hamas-war-live-updates-israeli-soldiers-gaza-al-shifa-hospital-targeted-operation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}