{"authors": ["Cheyenne R. Ubiera"], "date_download": "2024-02-05 15:16:20", "date_modify": "None", "date_publish": "2024-01-23 01:55:27", "description": "TWO Navy Seals who vanished at sea during a raid on a ship carrying Iranian weapons to Yemen have been identified.Navy Special Warfare Operator 2nd Cl", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25453452%2Fmissing-navy-seals-identified-recovery-search%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/KS-navy-seals-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "TWO Navy Seals who vanished at sea during a raid on a ship carrying Iranian weapons to Yemen have been identified.\nNavy Special Warfare Operator 2nd Class Nathan Gage Ingram, 37, and Navy Special Warfare Operator 1st Class Christopher J. Chambers, 27, were last seen entering the waters off Somalia on January 11.\n3 Navy Special Warfare Operator 2nd Class Nathan Gage Ingram has been identified as one of two Navy Seals who died on a mission off the coast of Somalia Credit: Department of Defense via AP\n3 Navy Special Warfare Operator 1st Class Christopher J. Chambers jumped in to save Ingram but both men vanished into the sea Credit: Department of Defense via AP\n3 The two Navy Seals were part of a team that was conducting a raid on a boat to seize Iranian arms headed for Yemen Credit: U.S. Central Command via AP\nThe members of Navy Seal Team 3 were climbing a ladder to board an unflagged ship carrying Iranian-made weapons to Yemen when Ingram slipped.\nHe fell into the water between the Seals' boat and the vessel that the team was trying to board after waves created a gap between the two vessels.\nChambers followed Ingram into the water, jumping from the ship into the gap to try to rescue his teammate.\nThe men were weighed down by their body armor and heavy equipment, dragging them deep into the Arabian Sea.\nThe military launched an 11-day search and rescue mission but the two service members were later declared dead.\n\"Chris and Gage selflessly served their country with unwavering professionalism and exceptional capabilities,\" said Captain Blake Chaney, Commander of Naval Special Warfare Group 1.\n\"This loss is devastating for NSW, our families, the special operations community, and across the nation.\"\nThe Seals team seized Iranian-made weaponry on the mission, including cruise and ballistic missile components, the US military said.\nAn investigation is underway to determine whether the Seals were equipped for the mission and if procedures were followed.\nInvestigators will also look at decisions in the timing and approval of the raid, including the weather and state of the seas, The Associated Press reported.\nSeals train for such scenarios regularly, the outlet noted, and the team was supported by drones and helicopters after they departed USS Lewis B. Puller, a mobile sea base.\n'AMERICA'S FINEST'\nChambers, who was from Maryland, enlisted in 2012 and served with West Coast-based Seal units, according to the Naval Special Warfare Command.\n\"His awards and decorations include the Navy/Marine Corps Achievement Medal with Combat 'C,' three Navy/Marine Corps Achievement Medals, Army Achievement Medal, Combat Action Ribbon, and other personal and unit awards,\" read a statement.\nIngram, a resident of Texas, enlisted in 2019, serving with West Coast-based Seal units and earning several personal and unit awards.\nPresident Joe Biden released a statement, saying: \"Jill and I are mourning the tragic deaths of two of America’s finest — Navy SEALs who were lost at sea while executing a mission off the coast of East Africa last week.\"\nBiden added that the Seals represent \"the very best of our country, pledging their lives to protect their fellow Americans. Our hearts go out to the family members, loved ones, friends, and shipmates who are grieving for these two brave Americans.\"\nThe commander of Naval Special Warfare Group 1 added that Chambers and Ingram were \"exceptional warriors, cherished teammates, and dear friends to many within the Naval Special Warfare community.\"\nUNDER FIRE\nThe raid was the latest seizure by the US Navy of weapon shipments headed to Houthi rebels in Yemen, who have launched attacks threatening global trade in the Red Sea and Gulf of Aden.\nJust today, the UK launched a second strike on the group after they refused to stop attacks on ships in the Red Sea.\nFour RAF Typhoon jets blasted laser-guided bombs in a UK-led strike with the US.\nIt came hours after Biden and UK Prime Minister Rishi Sunak warned the militants that they would strike Yemen again \"if needed.\"\nThe four RAF Typhoon jets were accompanied by two Voyager tankers and US forces, striking Houthi targets at military sites near the Sanaa airfield.\n\"Dangerous Houthi attacks on shipping in the Red Sea have continued to threaten the lives of sailors and disrupt shipping at an intolerable cost to the global economy,\" said UK Defense Secretary Grant Shapps.\n\"Along with our US partners, we have conducted a further round of strikes in self-defense.\n\"Aimed at degrading Houthi capabilities, this action will deal another blow to their limited stockpiles and ability to threaten global trade.\n\"Alongside our ongoing diplomatic efforts, we will continue to support regional stability across the Middle East, working hand in hand with our like-minded partners.\"", "source_domain": "www.thesun.co.uk", "text": null, "title": "Navy Seal Christopher Chambers leapt into sea to help comrade Nathan Gage Ingram before pair died on Houthi arms mission", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25453452/missing-navy-seals-identified-recovery-search/"}