{"authors": ["Noa Halff", "Noa Halff In Washington Dc For Dailymail.Com", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:39:57", "date_modify": "None", "date_publish": "2023-11-15 03:24:37", "description": "A woman with six family members being held hostage by Hamas said she was serving as 'their voice' alongside the 200,000 pro-Israel protesters marching in Washington Tuesday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12750297%2Fisraeli-woman-nightmare-family-hostage-hamas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/03/77810911-0-image-m-23_1700018466728.jpg", "language": "en", "localpath": null, "maintext": "A woman with six family members being held hostage by Hamas said she was serving as 'their voice' alongside the 200,000 pro-Israel protesters marching in Washington Tuesday.\nAlana Zeitchik, who lives in New York, said a half-dozen of her cousins were snatched from a kibbutz and has been speaking out since the week of the attack. She was one of the speakers at the march.\nZeitchik told DailyMail.com her life has been 'a nightmare' and 'absolutely awful' as her cousin Shahan, Shahan's husband David, their twin 3-year-olds, Emma and Yuli, Shahan's sister Danielle and her 5-year-old daughter have been held captive.\n'Every day I have to wake up and remember that six of my family members, six people I love the most in the world,' she said. 'So it's a living nightmare. It's like the worst thing you could ever imagine.’\nZeitchik has made several posts about her missing family on her Instagram account and across several networks demanding they come home.\nAlana Zeitchik, who lives in New York, said a half-dozen of her cousins were snatched from a kibbutz and has been speaking out since the week of the attack . She was one of the speakers at the march\nZeitchik told DailyMail.com her life has been 'a nightmare' and 'absolutely awful' as her cousin Shahan, Shahan's husband David, their twin 3-year-olds, Emma and Yuli, Shahan's sister Danielle and her 5-year-old daughter have been held captive\nShe spoke at the march because she felt she had to represent her family in an attempt to bring them to safety.\n'I have a very big family in Israel and my family isn't here. I'm here in the west. And so it is my duty to be their voice here and to advocate for them so that the world will know what's happening to us.’\nIn a rare show of bipartisanship, new Republican Speaker of the House Mike Johnson appeared alongside Democrats Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries as they all pledged their support for Israel.\n'The calls for a ceasefire are outrageous,' Johnson said. 'Israel will cease its counteroffensive when Hamas ceases to be a threat to the Jewish state.'\nSchumer also took the stage and said 'never ever will we forget the evil of Hamas' as he chanted 'bring them home' with the crowd.\nThe New York senator, the highest-ranking Jewish elected official in American history, pledged 'we will not rest until we get all the assistance you need.'\nIn a rare show of bipartisanship, new Speaker of the House Mike Johnson spoke after Schumer.\nJeffries also pledged to continue working in Congress to support Israel, saying: 'Hamas wants to wipe Israel off the face of the earth , so let me be clear we will not let that happen.'\n'Every day I have to wake up and remember that six of my family members, six people I love the most in the world,' Zeitchik said. 'So it's a living nightmare. It's like the worst thing you could ever imagine.’\nShe spoke at the march because she felt she had to represent her family in an attempt to bring them to safety\n'I have a very big family in Israel and my family isn't here. I'm here in the west. And so it is my duty to be their voice here and to advocate for them so that the world will know what's happening to us,’ Zeitchik told DailyMail.com\nSigns of kidnapped Israelis were held along with slogans saying 'NO TRUCE WITH TERRORISTS' at the march\nJacob Mitrani, 11, from New Jersey, waves Israeli flags during a March for Israel rally on the National Mall\nSpeaker of the House Mike Johnson (R-LA), House Minority Leader Hakeem Jeffries (D-NY) and Senate Majority Leader Chuck Schumer, (D-NY), speak during the March For Israel\nJeffries also pledged to continue working in Congress to support Israel, saying: 'Hamas wants to wipe Israel off the face of the earth , so let me be clear we will not let that happen'\nDemocratic political analyst Van Jones was one of the first to speak to the crowd, and said he is praying for the return of the Israeli hostages.\n'The Jews stood with the Civil Rights movement and that's why I can't stay silent today,' he said.\n'I'm a peace guy, no more rockets from Gaza and no more bombs falling down on the people of Gaza,' Jones added, prompting the crowd to chant, 'no cease fire!'\nIsraeli president Isaac Herzog made a virtual appearance from the Western Wall in Jerusalem and thanked American allies and the Biden administration for 'their moral clarity.'\n'Jews in America must be safe. Jews all over the world must be safe,' Herzog said. 'Just as you stand with us, we stand with you.'\nRelatives of some of the hostages and actress Debra Messing were are also among those scheduled to speak.\nThe event was organized by the Jewish Federations of North America and the Conference of Presidents of Major American Jewish Organizations.\nThe Jewish Federations of North America said the event would 'bring together communities from across the country to show strong solidarity with the Israeli people, while demanding the immediate release of the remaining hostages and to condemn the rise of antisemitism.'\nRep. Ritchie Torres (D-NY) speaks onstage at the March For Israel\nDemonstrators cheer as they attend the March for Israel on the National Mall\nIsraeli president Isaac Herzog made a virtual appearance from the Western Wall in Jerusalem\nThe Jewish Federations of North America said the event will 'bring together communities from across the country to show strong solidarity with the Israeli people'\nCrowds of supporters gather on the National Mall at the March for Israel on Tuesday\nYeshiva University in New York cancelled classes on Tuesday, and 2,500 students were expected to attend the rally, university president Rabbi Ari Berman told The Washington Post.\nAdditionally, more than 250 New Yorkers traveled in five buses to the capital for a day trip to attend the rally.\nJewish students from Queens College in New York and the University of Maryland also traveled to DC to attend.\nMoreover, a video posted to social media showed members of the Jewish Federation Of Cleveland, Ohio, hopping on a bus headed for the rally early on Tuesday.\nThe event was organized by the Jewish Federations of North America and the Conference of Presidents of Major American Jewish Organizations\nThe Gaza war has seen anti-Semitic incidents in the US soar by nearly 400 percent, per the Anti-Defamation League\nThe rally greatly disrupted traffic in DC, with parking restrictions and closures in placer for much of the day.\nFourth Street from Constitution Avenue, NW to Independence Avenue, SW, will be closed until Wednesday at 5am.\nSeventh Street from Constitution Avenue, NW to Independence Avenue, SW, 3rd Street from Pennsylvania Avenue, NW to Independence Avenue, SW, Madison Drive from 4th Street to 14th Street, NW, Jefferson Drive from 4th Street to 14th Street, SW, Maryland Avenue from Independence Avenue to 3rd Street, SW, Inbound 14th Street from 14th Street to Independence Avenue, SW and the 12th Street Tunnel will be closed until Tuesday at 6pm.\nThe Hamas attacks of October 7 left over 1,000 Israelis dead and 240 abducted - and unleashed the most significant conflict in the region in years.\nSince Israel began its counterattack in Gaza, more than 11,000 people have been killed.\nPeople from all over the nation traveled to the 'March for Israel' at the National Mall\nPeople pray on Pennsylvania Avenue in front of the White House before the rally\nIn the weeks since the attack, Anti-Defamation League CEO Jonathan Greenblatt said there have been attacks on businesses that are run by Jewish people, in addition to attacks on individuals and places of worship.\n'I'm not talking about stores producing IDF [Israel Defense Forces] T-shirts; I'm talking about a coffee shop on Long Island, an ice cream parlor in the Bay Area, a restaurant in Chicago,' he said.\nGreenblatt also raised the issue of the spate of anti-Semitic incidents that have taken place on campuses of Ivy-league colleges including Harvard and Cornell.\nThe ADL Center on Extremism said preliminary data showed 312 reported U.S. anti-Semitic incidents from Oct. 7 to Oct. 23, including harassment, vandalism and assault.\nAbout 190 of those were directly linked to the war between Israel and Hamas.\nAmong examples cited by ADL were alleged physical assault; violent online messages, especially on messaging platform Telegram; and rallies where 'ADL found explicit or strong implicit support for Hamas and/or violence against Jews in Israel.'\nThe Biden administration has warned that U.S. schools and colleges must take immediate action to stop antisemitism and Islamophobia on their campuses, citing an 'alarming rise' in threats and harassment.\nThe Jewish Federation Of Cleveland is heading out to Washington DC where they will participate in the march for Israel. pic.twitter.com/PPsamAd5Ko — Dan Stamness (@DStamness) November 14, 2023\nMore than 250 New Yorkers traveled in five buses to the capital for a day trip to attend the rally\nLeft a couple hours ago with @QC_News students, we are heading to the rally in DC in support of Israel and against Hamas terrorism! Bring the hostages home! Am Yisrael Chai! @ChabadOnCampus pic.twitter.com/AI4a8niD0z — Shaul Wertheimer (@RabbiShaul) November 14, 2023\nThe energy on our plane going to the pro-Israel rally in Washington DC is electrifying!!! 🇮🇱🇮🇱🇮🇱🇮🇱🙏🏻 pic.twitter.com/NKSYwiuz4s — Brittney Hopper 🇮🇱 (@brittneytv) November 14, 2023\nWe’re traveling with Jewish students from @umterps headed to todays Pro-Israel rally on the National Mall. @MarylandHillel organized the caravan which could total more than 300 UMD students. @wusa9 pic.twitter.com/n90D2EXeYw — Eric Flack (@EricFlackTV) November 14, 2023\nLast week the Education Department said there's 'renewed urgency' to fight discrimination against students during the Israel-Hamas war. The letter reminded schools of their legal duty to protect students and intervene to stop harassment that disrupts their education.\n'The rise of reports of hate incidents on our college campuses in the wake of the Israel-Hamas conflict is deeply traumatic for students and should be alarming to all Americans'' Education Secretary Miguel Cardona said in a statement. 'Antisemitism, Islamophobia and all other forms of hatred go against everything we stand for as a nation.'\nThe University of Pennsylvania is just one of the Ivy Leagues in hot water following demonstrations by student groups that have been deemed as pro-Hamas.\nThe school is facing a civil rights complaint as it is accused of being a 'magnet for anti-Semites' after anti-Israel slogans were projected on several of the school's buildings last week.\n'From the river to the sea, Palestine will be free,' read one message splashed across the John M Huntsman hall on Wednesday night. The slogan demands the land from the River Jordan to the Mediterranean Sea, meaning the end of the State of Israel.\nWhile there have been no direct threats against the demonstration, organizers have said they expect counter-protestors to be present\nThe Jewish Federations of North America said the event will 'bring together communities from across the country to show strong solidarity with the Israeli people'\nIt comes after the prestigious school increased security and contacted the FBI after a string of reports of threats against Jewish students.\nThe Brandeis Center saying it will file a complaint against the school, stating it 'has allowed its campus to become a hostile environment for its Jewish students as well as a magnet for anti-Semites.'\nThe complaints 'seek immediate and specific action to address increasing discrimination against and harassment of Jews in violation of Title VI of the Civil Rights Act of 1964.'\nUPenn said on Monday that several of its staff members received 'vile, disturbing anti-Semitic emails' threatening violence against Jews on campus, particularly in Penn Hillel, an on-campus Jewish organization, and Lauder College House.\nUniversity president Liz Magill wrote: 'These messages also included hateful language, targeting the personal identities of the recipients. Penn's Division of Public Safety was immediately notified and responded. Penn Police also notified the FBI of this potential hate crime and a joint investigation is underway.\nThe University of Pennsylvania is facing a civil rights complaint as it is accused of being a 'magnet for anti-Semites'\nA clip emerged purportedly showing a UPenn student praising Hamas' 'glorious October 7' incursion into southern Israel\nMagill has also acknowledged 'swastikas and hateful graffiti' and 'chants at rallies, captured on video and widely circulated, that glorify the terrorist atrocities of Hamas, that celebrate and praise the slaughter and kidnapping of innocent people, and that question Israel's very right to exist.'\nPro-Palestine demonstrations have taken place all over the western world since the star of the war in the Middle East last month.\nLast Thursday, pro-Palestinian demonstrators occupied the lobby of The New York Times,, demanding an immediate cease-fire in Gaza while accusing the media of showing a bias toward Israel in its coverage of the Israel-Hamas war.\nThe latest in a series of near-nightly demonstrations since the start of the war saw thousands march through Midtown Manhattan to protest Israel's attacks on Gaza.\nEarlier this month, tens of thousands of pro-Palestinian demonstrators from Washington to Paris marched as they called for a halt to Israel's bombardment of Gaza.\nThe marches reflected growing disquiet about the mounting civilian casualty toll and suffering from the Israel-Hamas war. Protesters, particularly in countries with large Muslim populations, including the US, UK. and France, expressed disillusionment with their governments for supporting Israel while its bombardments of hospitals and residential areas in the Gaza strip intensify.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "EXCLUSIVE: Israeli woman who has six family members being held hostage by Hamas says she is in a 'living nightmare' as she joins 300,000 in DC for Pro-Israel march: 'It's my duty to be their voice'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12750297/israeli-woman-nightmare-family-hostage-hamas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}