{"authors": ["Archie Bland"], "date_download": "2024-02-05 15:40:00", "date_modify": "None", "date_publish": "2023-11-15 07:08:13", "description": "In today’s newsletter: Attack on alleged Hamas command centre beneath hospital is a key test for Israel’s military and its ability to protect civilians", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F15%2Ffirst-edition-dar-al-shifa-hospital-gaza.json", "image_url": "https://i.guim.co.uk/img/media/5e66ea5cd6e72ce1bc9f19d038e969cbf7bee9b5/0_0_2862_1717/master/2862.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f7cdaa7234bff605ccd722b151619cd6", "language": "en", "localpath": null, "maintext": "Good morning. In the last few hours, Israeli soldiers have stormed Gaza’s Al-Shifa hospital. Israel says that the raid, which is still underway, is a “precise and targeted operation against Hamas”, which it accuses of operating a command centre beneath the medical facility, a claim Hamas denies.\nThe attack at al-Shifa is militarily significant – but it is also taking place in the arena of an unfolding humanitarian catastrophe that has drawn huge global attention, with conditions rapidly deteriorating on the site since the Israel Defence Forces (IDF) surrounded it last week. And so whether Israel is able to carry out the pinpoint attack it has promised is likely to be a critical test of the international community’s view of its conduct of the war.\nIsrael says that it will do everything in its power to protect patients, medical staff, and others sheltering on the site. But there have already been claims of civilians coming under fire as they sought to flee. For the very latest, head to the live blog. Today’s newsletter, which comes a little late as the situation develops, takes you through what you need to know. Here are the headlines.\nFive big stories\nConservatives | Suella Braverman has launched an astonishing attack on Rishi Sunak the day after he sacked her as home secretary, claiming he had “betrayed” the country by failing to deliver on secret promises he made her last year. Braverman indicated she will spearhead a Tory rebellion over the government’s Rwanda asylum plan, which faces a crucial legal test on Wednesday. Cyprus confidential | Chelsea FC is facing questions over how its former owner Roman Abramovich funded the club’s success, after leaked files revealed a string of secret payments that may have breached football’s strict “financial fair play” rules. The disclosures are part of an international investigation into a cache of 3.6m leaked offshore records in Cyprus. Cost of living | The UK inflation rate has dropped to 4.6%, down from 6.7% in September, it has just been announced. That is an even larger fall than was expected. Head to the business live blog for more. Ukraine | The Ukrainian president’s chief of staff has said for the first time that Ukraine’s forces in the Kherson region have a foothold on the eastern bank of the Dnipro river, potentially opening a new line of attack towards Crimea. Andriy Yermak claimed that the advance was part of a developing counteroffensive. Health | A vaccine to protect against chickenpox should become a routine childhood jab in the UK, government advisers have said, adding that it would not only reduce the number of children who become sick from the virus, but also cut the number of cases that can become fatal.\nIn depth: How a hospital became the focus of the conflict\nView image in fullscreen A wounded infant receives treatment at al-Shifa Hospital. Photograph: APAImages/Shutterstock\nThe Dar al-Shifa (House of Healing) hospital is the most advanced in the Hamas-controlled Gaza Strip. There are about 600 patients and somewhere between 200 and 700 medics and administrators on site; figures have varied widely on the number of displaced people there, from 1,500 to 15,000, with an estimate from a doctor on Wednesday morning that 2-3,000 were sheltering at the facility.\nIsrael claims that since it pulled out of Gaza in 2005, Hamas has expanded existing basements under the complex of buildings into a sprawling command centre as part of a broader strategy of using civilians to shield its forces from Israeli attack. Hamas denies this.\nSince Friday, when Israeli tanks and snipers encircled the facility, an already dire situation has worsened. On Saturday, the hospital said that its last generator ran out of fuel, and yesterday, a health ministry spokesperson said that mass graves were being dug on site to deal with about 100 decomposing bodies. A key question about this morning’s attack is whether it will put those civilians on site in still greater danger, or end the situation rapidly and allow them to escape or get the medical supplies they need.\nWhat do we know about the attack so far?\nAt about 1am local time, Israel told officials in Gaza that it intended to raid the hospital complex in “the coming minutes”. Later, the IDF confirmed that an attack was underway and said that it was strictly targeted on an area of the hospital where it said Hamas was operating. It said that its forces had undergone special training for the “complex and sensitive environment” and that medical teams and Arabic speakers had gone in as part of the operation.\nDr Munir al-Bursh, director-general of the Gaza health ministry, told Al Jazeera that Israeli forces had raided the western side of the site. There were also reports of tanks inside the complex. A Gaza health ministry spokesperson said that the IDF had reached the basement and was “shooting and carrying out bombings”, while an eyewitness told the BBC that they had seen soldiers entering a specialised surgical department. None of these claims have been independently verified by the Guardian.\nWhat impact has the situation had on patients?\nBefore the attack began, the UN said that 32 patients had died so far, as well as three nurses. Those physically able to leave were already frightened to do so: healthcare worker Goudhat Samy al-Madhoun told AP that Israeli Defense Forces (IDF) fired on a group of about 50 who were attempting to flee the facility on Monday despite promises of safe passage. Al-Madhoun said Israeli forces fired on the group several times, wounding one man, who had to be left behind.\nWithout the fuel needed to keep crucial equipment running, the humanitarian situation has been deteriorating rapidly. Munir al-Boursh, a doctor and Palestinian health ministry undersecretary who spoke to the Guardian’s Ruth Michaelson, said that there were no oxygen supplies or light to conduct surgery, and that six operating theatres were out of action.\nMeanwhile, photographs from Reuters published on Monday showed premature babies weighing less than 1.5kg, who had been removed from incubators, lying huddled together on ordinary beds in an operating theatre. “Yesterday I had 39 babies and today they have become 36,” Dr Mohamed Tabasha, head of the paediatric department, said then. “I cannot say how long they can last.”\nThe IDF has said that it is arranging the transfer of incubators from Israel; Gaza health ministry spokesperson Ashraf al-Qidra said that no such plan was in place before the raid. Israel also says that it left 300 litres of fuel at the entrance to the complex on Sunday but that Hamas stopped the hospital from taking it.\nBut the hospital needs 10,000 litres of fuel a day. Hospital director Mohammad Abu Salmiya told CNN that the Israeli offer would be enough to power the facility for half an hour, and that staff had been too scared to retrieve the fuel given how small a difference it would make. Hospital officials have called for any delivery to be made by a neutral body like the International Committee of the Red Cross.\nWhy is Israel targeting the hospital?\nView image in fullscreen An aerial view shows the compound of Al-Shifa hospital in Gaza City on 7 November 2023. Photograph: Bashar Taleb/AFP/Getty Images\nIt says that since the 7 October attacks that killed 1,200 Israelis, senior Hamas leaders have been based there. Israeli army spokesperson Lt Col Peter Lerner told CNN the hospital and compound were for Hamas “a central hub of their operations, perhaps even the beating heart and maybe even a centre of gravity”.\nIsraeli officials quoted in the New York Times claimed that Al-Shifa was spared during past operations in Gaza out of deference to civilian patients and staff but that it was now a key Israeli target.\nIn an analysis piece on Sunday, Jason Burke wrote that Israel intends to dismantle Hamas’s ability to govern Gaza, and quoted Prof Kobi Michael of the Institute of National Security Studies in Tel Aviv, who said: “In this war we have to dismantle the elements of Hamas that will prevent Hamas from becoming a military threat again or a government again.”\nWhat is the evidence for claims that Hamas is headquartered under the hospital?\nThe IDF has released footage which it says is of two interrogations of Hamas militants who allegedly confirm that the organisation has a command centre hidden at al-Shifa. It has also released audio recordings said to capture other militants discussing the command centre, and claims to have further intelligence supporting its case. (The authenticity of other audio recordings released as evidence by Israel has been disputed.)\nThe US said on Tuesday that its own intelligence supported Israel’s conclusions – a move which Hamas said this morning had given a “green light” for the raid.\nHamas, and medical staff on site including the hospital director, deny that there is any Hamas presence there. The NGO Human Rights Watch has also said it is unable to corroborate the allegation. The health ministry in Gaza has invited an independent inspection, but others have dismissed that suggestion as impractical in the current circumstances.\nIs Israel entitled to take military action at the hospital?\nRegardless of the truth of the claim, Israel has been urged to spare the hospital and the civilians there. Joe Biden said on Monday that “the hospital must be protected”, and others including the World Health Organization and Unicef have called for an end to all attacks on hospitals. After the operation was announced, a White House spokesperson said that the US did not wish to see a firefight in the hospital “where innocent people, helpless people, sick people trying to get medical care they deserve are caught in the crossfire”.\nThe Geneva convention provides special protection for civilian hospitals, saying that they should “in no circumstances be the object of attack”. But it adds that such protection can be rescinded if a hospital is used for “acts harmful to the enemy”, like concealing fighters or weapons. If so, there is still a requirement for due warning and a “reasonable time limit” for the acts to stop.\nCordula Droege, chief legal officer of the ICRC, said that the law also prohibits any action that prevents hospitals from treating the sick. There was no “free licence to attack”, she said. “Every attack is subject to the principles of proportionality and precaution. This means that the party to the conflict has to do everything feasible to avoid or at least minimise harm to patients and medical staff.”\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nUsing civilians as human shields, as Hamas is repeatedly accused of doing, is itself a war crime, as Peter Beaumont explains in this piece. But under international law, that fact does not in its own right justify an attack on a hospital unless all possible measures have been taken to protect the civilians in the firing line.\nThat is why Israel insists there is “no siege” at al-Shifa, that it has provided evacuation routes for civilians, and that it gave Hamas authorities 12 hours notice that any military operation inside the facility must cease before the operation. began. And it is why such close scrutiny will now be applied to whether the IDF does everything in its power to protect the civilians who are still in the hospital as the battle rages.\nWhat else we’ve been reading\nView image in fullscreen Anna Richardson Photograph: © Channel Four Television Corporation\nJazz singer Norma Winstone was pretty nonchalant about the fact that rapper Drake used her vocals on a song from his most recent album until her son, a fellow musician, told her who he was. Jude Rodgers spoke to her about the unexpected attention that has capped off a career that that started in east London. Nyima Jobe, newsletters team\nBeing evicted can be an incredibly traumatising experience with wide ranging impacts on people’s lives. Robert Booth’s report poignantly highlights some of the fallout. Nimo\nThis week, supermarket Booths announced a move away from self checkout areas and a return to human contact with checkout cashiers. Rachel Obordo spoke with customers to get their verdict on the announcement. Nyima\nI’ve long wondered what kind of person goes on the nude dating show Naked Attraction (pictured above). Amelia Tait answered that question by speaking to previous contestants – some of whom have appeared on the show twice. Nimo\n“Super agent” Rafeala Pimenta is one of the leading figures in the football universe. She spoke to Donald McRae about her two decades navigating the industry as a woman - and what her clients Paul Pogba and Erling Haaland are really like. Nyima\nSport\nView image in fullscreen Adam Johnson playing for the Pittsburgh Penguins in 2019. Photograph: John Russell/NHLI/Getty Images\nHockey | Police have arrested a man on suspicion of manslaughter in connection with the death of the Nottingham Panthers ice hockey player Adam Johnson (pictured above), who died after his neck was cut during a match. The 29-year-old American died during a game against Sheffield Steelers after appearing to receive a catastrophic cut to his neck from the skate blade of another player in front of 8,000 fans.\nWomen’s Champions League | Barcelona thrashed Benfica 5-0 as the defence of their crown began with a comfortable home victory courtesy of two goals from Ballon d’Or winner Aitana Bonmatí. Ada Hegerberg scored her 60th Women’s Champions League goal as Lyon opened their campaign with a 9-0 demolition of Slavia Prague.\nFootball | The highly rated Adelaide United teenager Nestory Irankunda has signed for Bayern Munich for an A-League record transfer fee, with the 17-year-old saying his move to the Bundesliga champions is a “dream come true”. Irankunda will move to Germany in July next year, four months after turning 18 – the minimum age for a global transfer under Fifa rules.\nThe front pages\nView image in fullscreen Guardian front page, Wednesday 15 November 2023 Photograph: Guardian\nThe Guardian splash today is “Braverman accuses Sunak of ‘betrayal’ in brutal parting shot”. “We had a deal and you broke it, Suella tells PM” – that’s the Daily Mail on the same theme, which the Times also takes up: “Braverman: PM lied to me and betrayed Britain”. In the Daily Telegraph it’s done as “Braverman launches brutal attack on PM’s ‘betrayal’ of nation”. “War is declared: Suella accuses Rishi of betraying the nation” says the Daily Express, while the i calls it “Revenge served hot”. “Tories are revolting” – the Daily Mirror loses points for that hackneyed pun. “Ice hockey death arrest” is the splash in the Metro, while the top story in the Financial Times is “Wall Street markets jump after US inflation falls more than expected”.\nToday in Focus\nView image in fullscreen Photograph: Kateryna Klochko/EPA\nHas Putin got the upper hand in Ukraine?\nWith the world’s attention on the Middle East, Ukraine seems to be at a stalemate – which may sound like good news for Russia, but is not so straightforward, Luke Harding reports\nCartoon of the day | Martin Rowson\nView image in fullscreen Illustration: Martin Rowson/The Guardian\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nView image in fullscreen ‘No-kill’ caviar produced by John Addey in Yorkshire. Photograph: Courtesy of KC Caviar\nFor a long time, the only way most people extracted eggs from sturgeons to make caviar was by beating the fish on the head to death before cutting its belly open. When polar and marine scientist Angela Köhler saw this happen, she knew she had to figure out a way to produce “no kill caviar”.\nExtracting the eggs like this is not only an ethical issue, it’s also a financial problem. Depending on the species of sturgeon, the fish do not start spawning for a minimum of eight to 15 years. Killing the fish is “economically insane”, Köhler said. After four years of researching, Köhler developed a new method to extract the eggs. An ultrasound is carried out to check the eggs are ready and then the bellies of the fish are gently massaged so that they are naturally released. It is a far more humane process.\nSturgeons are one of the most critically endangered species in the world because of overfishing and poaching, so Köhler’s extraction technique could prove to be a crucial method of preservation. “It should be a no-brainer to invest in this slaughter-free technology,” she says.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.", "source_domain": "www.theguardian.com", "text": null, "title": "Wednesday briefing: Why Israeli forces are raiding Gaza’s biggest hospital", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/15/first-edition-dar-al-shifa-hospital-gaza"}