{"authors": ["Ruth Michaelson"], "date_download": "2024-02-05 15:40:01", "date_modify": "None", "date_publish": "2023-11-15 17:25:45", "description": "Israeli troops entered Gaza’s al-Shifa hospital in a ‘targeted operation’ at 3am and remained there well into the afternoon", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F15%2Fall-men-16-years-and-above-raise-your-hands-how-al-shifa-raid-unfolded.json", "image_url": "https://i.guim.co.uk/img/media/089ca86512dda4106802ce09c454554ae9ff6021/174_0_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=037b44ffa89c606176cd972b8ac0cf43", "language": "en", "localpath": null, "maintext": "Three hours before dawn, witnesses and doctors inside Gaza’s largest hospital reported that Israeli tanks had entered the sprawling medical compound on the western edge of Gaza City. “We can see them pointing the guns of the tanks toward the hospital … they are inside the complex with the tanks,” Khader Al Za’anoun, a reporter for the Palestinian news agency Wafa, told CNN.\nMunir al-Boursh, a doctor inside the Dar al-Shifa hospital and a Palestinian health ministry undersecretary, had earlier appealed to approaching Israeli forces to exercise caution. “You being inside the hospital will create a state of fear and hysteria among the patients here,” he told the Israel Defense Forces in a phone call obtained by Al Jazeera. “All floors of the hospital are full of people from floor one through to six.”\nFor five days, the Israeli military had been drawing closer to the hospital, where hundreds of patients, including newborn babies, have gone without electricity and with little food as fighting raged around them.\nWitnesses told Reuters that tanks entered the complex at 3am and that one parked in front of the emergency department. Mohammed Zaqout, the director of hospitals in the territory, said Israeli soldiers entered the emergency department and the surgery building, which also contains intensive care units. An official at the Hamas-run health ministry told AFP he could see “dozens of soldiers and commandos inside the emergency and reception buildings”.\nWitnesses who spoke to the BBC and AFP said Israeli soldiers used loudspeakers to demand that all males aged between 16 and 40 leave every part of the hospital complex other than the surgical and emergency wings and enter the hospital courtyard.\nView image in fullscreen IDF soldiers during a military operation around at Al-Shifa hospital in Gaza City. Photograph: Israeli Defence Forces/AFP/Getty Images\n“All men 16 years and above, raise your hands,” a soldier shouted in accented Arabic, according to a journalist speaking to AFP. “Exit the building towards the courtyard and surrender,” the soldier ordered.\nAbout 1,000 Palestinian males, their hands above their heads, were soon led into the vast hospital courtyard, some of them stripped naked by Israeli soldiers checking them for weapons or explosives, the journalist said.\n00:01:50 Israeli forces enter al-Shifa hospital in Gaza – video report\nIsrael said its troops had killed militants in a clash outside but once inside there had been no fighting. The Israeli army released video showing soldiers carrying boxes labelled “baby food” and “medical supplies”.\nA spokesperson for the Palestinian ministry of health in Gaza, Ashraf al-Qudra, told Al Jazeera Arabic that “only doctors, patients and displaced people” were present when Israeli forces entered the hospital’s emergency department. “We have nothing to be afraid of or hide,” he said.\nOmar Zaqout, who works in the emergency room at al-Shifa, told Al Jazeera that Israeli soldiers had detained and assaulted some men who had taken refuge there. “[They] did not bring any aid or supplies, they only brought terror and death,” he said.\nThe IDF described the raid as “a precise and targeted operation against Hamas in a specified area in the Shifa hospital, based on intelligence information and an operational necessity.”\nThe Israeli authorities have long maintained that Hamas uses the area below the hospital as a command centre. Hamas and hospital staff deny this.\nThe IDF said in a briefing that soldiers found “weapons and other terror infrastructure,” at al-Shifa, and that they had seen “concrete evidence that Hamas terrorists used the Shifa hospital as a terror headquarters,” which they intended to publish later.\nView image in fullscreen Scenes from Al Shifa hospital amid Israel's ground operation in Gaza City. Photograph: Ahmed El Mokhallalati/Reuters\nHamas said the IDF’s claims were “nothing but a continuation of the lies and cheap propaganda, through which [Israel] is trying to give justification for its crime aimed at destroying the health sector in Gaza”.\nThe raid continued well into the afternoon, though details were scant due to a widespread telecommunications blackout, which the two major Palestinian telecoms networks said had been caused by a lack of fuel. Phone calls to staff inside al-Shifa hospital and health ministry officials across Gaza failed to connect.\nThe head of the World Health Organization, Tedros Adhanom Ghebreyesus, said his organisation had lost contact with medics inside al-Shifa.\nIn the late afternoon, Boursh told Al Jazeera that Israeli troops were still present in the hospital. “They are still here … patients, women and children are terrified,” he said. He said the medical staff had vowed to stay with their patients “till the end.”\nThe raid followed days of suffering for medics, patients and civilians sheltering inside the complex, where staff described how they had moved every patient into the hospital corridors and away from the windows, fearing gunfire. Boursh told the Guardian that some who attempted to flee al-Shifa earlier this week were surrounded by gunfire as they left the hospital grounds, and turned back.\nView image in fullscreen Israeli soldiers walk in the area of Al-Shifa hospital in Gaza City. Photograph: Israel Defense Forces/AP\nThe Palestinian health ministry said 40 patients died on Tuesday, after five days without the fuel needed to power generators that fed dialysis machines and other vital medical equipment. The hospital had also run out of clean water, and doctors said they were subsisting on dates to survive as food supplies dwindled to nothing.\nCorpses were piled in front of the hospital, with staff too terrified to move between buildings. The UN’s office for humanitarian affairs said staff at al-Shifa, for decades the linchpin of Gaza’s medical system, had begun preparations for a mass grave to entomb 180 bodies in front of the facility, as there was no way for them to leave in order to bury the dead.", "source_domain": "www.theguardian.com", "text": null, "title": "‘All men 16 years and above, raise your hands’: how al-Shifa raid unfolded", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/15/all-men-16-years-and-above-raise-your-hands-how-al-shifa-raid-unfolded"}