{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com"], "date_download": "2024-02-05 15:40:02", "date_modify": "None", "date_publish": "2023-11-15 15:08:00", "description": "The strikes, carried out by Air Force F-15E fighter jets on Sunday, targeted an Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12752793%2FBiden-Syria-airstrike-Hamas-Israel.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/15/77063345-0-image-a-15_1700060856318.jpg", "language": "en", "localpath": null, "maintext": "The US has released footage showing President Joe Biden's latest airstrikes against Iranian proxy forces in Syria, in an escalating tit-for-tat that follows a wave of drone and missile attacks on US forces in the region.\nThe strikes, carried out by Air Force F-15E fighter jets on Sunday, targeted an Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin, the Pentagon said.\nA senior US defense official told DailyMail.com that as of Monday, US and coalition troops have been attacked at least 55 times in Iraq and Syria since October 17, injuring 59 Americans, though all have returned to duty.\nThe Iran-backed militant groups claiming responsibility for the missile and kamikaze drone attacks have said they are in response to US support for Israel in its war against Hamas in Gaza.\nThe escalating violence in Syria and Iraq is raising concerns that the Israel-Hamas conflict could widen into a regional conflict, with US troops at bases throughout Middle East becoming targets.\nUS strikes on Sunday targeted an Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin\nThe US still has about 900 troops in Syria, and 2,500 more in neighboring Iraq, to advise and assist local forces trying to prevent a resurgence of Islamic State, which was defeated after seizing large swathes of both countries.\nIn recent weeks, US forces in Iraq and Syria have come under nearly daily bombardment from Iran-backed militants, who operate under the umbrella brand of the Islamic Resistance in Iraq.\nSunday's airstrike against Iranian assets in Syria was the latest such US counterstrike to degrade and deter Iran's proxy forces.\nIn a statement, US Defense Secretary Lloyd Austin said Biden had ordered Sunday's strikes.\n'The President has no higher priority than the safety of US personnel, and he directed today's action to make clear that the United States will defend itself, its personnel, and its interests,' said Austin.\nWhile prior strikes have hit unoccupied facilities, including weapons storage depots, the US believes up to seven people were killed in Sunday's strikes, a US official told Reuters on Tuesday.\nThe official said most of the people were killed during one of the strikes on the training facility near the city of Abu Kamal, and that the strike on the Mayadin safe house may have killed one additional person.\nThe US military assesses that no women or children were killed in the strikes, the official said.\nUS and coalition troops have been attacked at least 55 times in Iraq and Syria since October 17, injuring 59 Americans, though all have returned to duty\nFor years, Iran has supplied its Qasef-1 drones (above in a file photo) and other UAV munitions to its proxies in the region, including militant groups in Syria, Lebanon, Iraq, Yemen, and Gaza\nAmerica strikes back: US warplanes conducted airstrikes against Iranian proxy forces in Syria in retaliation for attacks against US troops in Middle East\nAt the Pentagon, spokesperson Sabrina Singh said an assessment was ongoing.\n'We are aware that there were IRGC affiliated members in the proximity of the facilities that were struck by our aircraft. But I don't have more on casualty numbers or anything else to read out,' Singh told reporters, using an acronym for Iran's Revolutionary Guards.\nThe American strike Sunday is the third since October 26 as the United States attempts to quell wave after wave of drone and rocket attacks against American troops in Syria and Iraq, triggered by the Israel-Hamas war.\nTwo weeks earlier, the US sent two F-16 fighter jets to attack a weapons storage facility and an ammunition plant near Abu Kamal.\nBoth sites were run by Iran's Revolutionary Guard Corps, the Pentagon said.\nOn November 8, the US also carried out a retaliation airstrike on a weapons warehouse in Maysulun, allegedly used by Iranian forces and their proxy militias.\nDefense officials said the strikes were not directly connected to the Israel-Hamas war, but analysts said they were designed to send a warning to Iran not to take advantage of the regional turmoil to widen the conflict.\nIran's Foreign Minister, Hossein Amir-Abdollahian, said at the United Nations last week that if Israel's offensive against Hamas does not end, the United States will 'not be spared from this fire'.\nIranian President Ebrahim Raisi (center) and Syrian President Bashar Al-Assad (right) are seen Saturday during a bilateral meeting in Riyadh, Saudi Arabia. Iran-backed forces established a foothold in Syria while fighting in support of Assad during the country's civil war\nBiden has warned Iran's supreme leader Ayatollah Ali Khamenei not to attack US forces in the region, and said there would be consequences.\n'My warning to the Ayatollah was that if they continue to move against those troops, we will respond,' said Biden.\nSince the Israel-Hamas conflict erupted, the United States has deployed additional air defenses and sent warships and fighter aircraft to the region, including two aircraft carrier groups, to try to deter Iran and its proxy forces.\nHamas on October 7 launched an unprecedented sneak attack on Israel that left 1,400 dead, most of them civilians.\nIsrael has responded by pummeling the Gaza strip with airstrikes, and launching a ground assault on the Palestinian enclave in an attempt to remove Hamas from power there.\nGaza's Hamas-controlled health ministry, which does not differentiate between combatant and civilian casualties, says more than 11,000 Palestinians have died in the war.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Video shows Biden's retaliation airstrikes on Iranian proxy forces in Syria - as Pentagon reveals 59 Americans have been injured in recent drone and missile attacks in the region", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12752793/Biden-Syria-airstrike-Hamas-Israel.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}