{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:40:03", "date_modify": "None", "date_publish": "2023-11-15 18:53:54", "description": "White House national security spokesman John Kirby said he wouldn't engage in 'armchair quarterbacking' and didn't second-guess the Israeli military's storming of a Gaza hospital.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12754045%2FJohn-Kirby-says-understandable-Israel-Hamas-positions-Gaza-hospital-says-wont-armchair-quarterback-military-minimize-civilian-casualties.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/14/20/77799027-0-image-a-10_1699993825465.jpg", "language": "en", "localpath": null, "maintext": "White House national security spokesman John Kirby declined to second-guess the Israeli military after it inserted forces into Gaza's largest hospital and claimed to discover 'terror infrastructure' there.\nKirby made the comments on a call with reporters in San Francisco after Israel said it 'discovered weapons and other things' inside the al-Shifa hospital when forces stormed part of it after surrounding it for days.\nKirby once again said he would not engage in 'armchair quarterbacking' of the Israeli military's powerful assault on Hamas in Gaza, even while underlying U.S. concerns about protecting civilians in Gaza, amid estimates that thousands have been killed in the Israeli bombardment.\nHe said there was 'no expectation' that Israel would outline its military moves in advance, adding that 'certainly we talked to them about our continued concerns over civilian casualties.'\n'We don't want to see hospitals attack from the air. We don't want to see innocent civilians, patients, medical staff, become the victims of crossfire between Hamas and Israel Defense Forces. We believe that hospitals should be protected,' said Kirby, a day after he said U.S. intelligence indicated that Hamas and Palestinian Islamic Jihad used hospitals to conceal military operations and hostages.\nWhite House security spokesman John Kirby said he wouldn't engage in 'armchair quarterbacking' about Israeli military moves after IDF forces stormed the largest hospital in Gaza. It came after he said Hamas and Palestinian Islamic Jihad 'use some hospitals in the Gaza Strip, including Al Shifa' in order to 'conceal and to support their military operations and to hold hostages'\nHe said it was 'understandable' that the IDF would want to 'remove Hamas' ability to use cover like that to sustain themselves' as it carries out orders to eliminate Hamas.\n'But again, this this means they have an added burden here because it is hospital, because there are real patients and real doctors and real nurses that have nothing to do with this fight that that need to be protected as much as possible.'\nHe spoke after Israeli troops finally began to withdraw from the beleaguered hospital, where Israel alleges Hamas has an underground base.\n'I'm going to refrain from armchair quarterbacking ongoing military operations for the military that is not the United States,' he said. 'We have been very consistent, very clear with our Israeli counterparts about how important it is to minimize civilian casualties.\n'We have also been very clear with them about the special care that must be taken when you're talking about hospitals, because there are patients and even pediatric patients and and medical staff and that hospital is an active, legitimate hospital and serving the legitimate medical needs of the people of Gaza.'\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Hamas in this still image from handout video obtained November 15, 2023\nThe White House said Tuesday that U.S. intelligence indicates that Hamas fighters used tunnels beneath hospitals in Gaza to conceal its military operations, amid a furious debate over Israel's bombing campaign and advancing forces.\nWhite House National Security Spokesman John Kirby spoke to reporters on Air Force One about the use of the infamous tunnel network as President Joe Biden made his way to San Francisco for the APEC summit.\n'Now on the hospitals, I can confirm for you that we have information that Hamas and the Palestinian Islamic Jihad use some hospitals in the Gaza Strip, including Al Shifa, had tunnels underneath them, to conceal and to support their military operations and to hold hostages,' Kirby said.\n'Hamas and the Palestinian Islamic Jihad - BIJ - members operate a command and control node from Al Shifa in Gaza City,' he said.\n'They have stored weapons there and they're prepared to respond to an Israeli military operation against that facility.'\nHe said the information related specifically to Al Shifa, where Israeli forces have advanced to just outside the hospital.\nThe Israeli Defense Forces says it will let staff and patients leave, while hospital officials say they are desperately low on fuel to operate equipment amid large scale suffering due to Israel's war against Hamas.\n'We have information that confirms that Hamas is using that particular hospital for a command and control mode,' Kirby said. He said they were probably using the network to store weapons. 'That is a war crime.'\nPalestinians injured in Israeli raids arrive at Nasser Medical Hospital on November 14, 2023 on November 13, 2023 in Khan Yunis, Gaza. The White House says Hamas uses tunnels beneath hospitals for its military\nIsraeli forces have continued to pound Gaza for weeks\nIsrael has long accused Hamas of hiding its forces among civilian targets. Hamas officials have said more than 10,000 have died in Israel's campaign, although the White House says it cannot verify the figure.\nAn estimated 1,400 were killed in the Hamas October 7 attack on Israel.\nKirby said the Palestinian groups were prepared to respond to Israeli military operations, with IDF ground forces nearby.\nKirby was non-specific about the intelligence methods that provided the information.\nHe said it was based on 'a variety of intelligence methods of our own' – distinguishing it from information from the Israelis.\n'I think you can understand that we're not going to be able to provide a whole lot of granular detail on that, we have to protect sources and methods. But we were able to downgrade some information to be able to provide that for you today but it comes from a variety of intelligence methods of our own, of our own,' he said.\nOn his trip to Israel immediately after the attacks, President Biden backed up Israeli's government after it said an errant missile launched by Palestinian Islamic Jihad was responsible for the explosion at a different hospital in Gaza.\nBiden said it 'it appears as though it was done by the other team, not you,' in remarks to Israeli Prime Minister Benjamin Netanyahu.\nKirby laid down some markers for what the government considers acceptable as Israel seeks to dislodge fighters and free 240 hostages seized during the Hamas raid.\n'To be clear, we do not support striking a hospital from the air. We do not want to see a firefight in a hospital where innocent people, helpless people, sick people are simply trying to get the medical care they deserve,' Kirby said.\n'We have been clear on multiple occasions - Hamas actions do not lessen Israel's responsibilities to protect civilians in Gaza, and this is something we're going to continue to have an active conversation with our counterparts about.'\nHis news update came as Biden prepares to try to focus on economic issues as he meets with Asia Pacific leaders, while also planning a high stakes sit-down with China's President Xi Jinping.\nThe Middle East conflict is expected to be a major topic on the sidelines of the conference.\nThe developments came on a day President Biden spoke optimistically about an emerging deal to free hostages in Gaza.\n'I believe it is going to happen but I don't want to get into details,' he said at the White House before going on his trip.\nThe Washington Post reported on a possible deal to free women and children held hostage in Gaza in exchange for Palestinian women and children held in Israeli prisons.\nIsrael wants all 100 women and children released, although Hamas indicated it only wanted to release 70, according to reports.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "White House insist U.S. did NOT give Israel the 'OK' to raid the al-Shifa Hospital - but slams Hamas for turning building into an underground operations center", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12754045/John-Kirby-says-understandable-Israel-Hamas-positions-Gaza-hospital-says-wont-armchair-quarterback-military-minimize-civilian-casualties.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}