{"authors": [], "date_download": "2024-02-05 15:40:05", "date_modify": "None", "date_publish": "2023-11-15 08:55:06", "description": "Claims that Hamas has a command centre inside and beneath Shifa hospital have been repeatedly denied by doctors and the militant group.", "filename": "https%3A%2F%2Fguernseypress.com%2Fnews%2Fworld-news%2F2023%2F11%2F15%2Fisraeli-forces-raid-gazas-largest-hospital-with-hundreds-of-patients-stranded%2F.json", "image_url": "https://www.guernseypress.com/resizer/85ne5QKGgZmlpQcze7M1BdTqwiA=/1200x900/cloudfront-us-east-1.images.arcpublishing.com/mna/UGS3YFGOJBGGZACOUPEABE5GEA.jpg", "language": "en", "localpath": null, "maintext": "Israeli troops have stormed into Gaza’s largest hospital, searching for traces of Hamas inside and beneath the facility filled with hundreds of patients, including newborns, who have gone for days without electricity and with little food as fighting raged around them.\nDetails from the raid remained sketchy, but officials from Israel and Gaza presented different narratives about what was happening at the hospital.\nThe Israeli army released video footage showing soldiers carrying boxes labelled as “baby food” and “medical supplies”, while Gaza health officials talked of terrified staff and patients as troops moved through the buildings.\nAfter encircling the Shifa Hospital for days, Israel faced pressure to prove its claim that Hamas had transformed it into a command base, using the patients, staff and civilians sheltering there to provide cover for its militants – part of Israel’s broader accusation that Hamas uses Palestinians as human shields.\nThe video released by the military from inside Shifa showed three duffel bags it said it found hidden around an MRI lab, each containing an assault rifle, grenades and Hamas uniforms, as well as a closet that contained a number of assault rifles without ammunition clips.\n“These weapons have absolutely no business being inside a hospital,” Lt Col Jonathan Conricus, a military spokesman, said in the video, adding that he believed the material was “just the top of the iceberg”.\nThe raid drew condemnation from the UN, Jordan and the West Bank’s Palestinian Authority, which called it a violation of international law.\nSeparately, the UN Security Council approved a resolution calling for “humanitarian pauses and corridors” throughout Gaza after four failed attempts to respond to the Israel-Hamas war.\nIsraeli troops taking part in a ground operation in the Gaza Strip (AP)\nThe war between Israel and Hamas erupted after the militant group killed some 1,200 people and seized around 240 captives in a surprise attack on October 7. Israel has since killed thousands of Palestinians and unleashed widespread destruction in Gaza.\nMore than 11,200 people, two thirds of them women and children, have been killed in Gaza, according to the Palestinian Health Ministry in Ramallah.\nAbout 2,700 people have been reported missing, with most believed to be buried under the rubble. The ministry’s count does not differentiate between civilian and militant deaths.\nAs Israeli forces tighten their hold on northern Gaza, Israeli leaders have increasingly talked of expanding their ground operation into the south to root out Hamas.\nAlready, most of Gaza’s population of 2.3 million has crowded into the territory’s south, where a worsening fuel shortage on Wednesday threatened to paralyse the delivery of humanitarian services and shut down the mobile phone and internet network.\nA Palestinian wounded in Israeli bombardment of the Gaza Strip is brought to a hospital in Khan Younis (AP)\nMunir al-Boursh, a senior official with Gaza’s Health Ministry inside the hospital, said Israeli forces ransacked the basement and other buildings, including those housing the emergency and surgery departments.\n“Patients, women and children are terrified,” he said by phone to the Associated Press. Another doctor there, Adnan al-Bursh, told Al-Jazeera TV that the troops removed displaced families who had been sheltering in the basement.\nNeither the Palestinians nor the military reported any clashes inside the hospital during the raid. The military said its troops at the start of the operation killed four militants outside the hospital.\nThroughout days of fighting in the surrounding streets, there has been no report of militants firing from inside Shifa.\nThe Israeli military said it was carrying out a “precise and targeted operation against Hamas in a specified area in the hospital”, adding that it was separate from where patients and medical staff are located.\nAn explosion rocks the Gaza Strip (AP)\nIt added that forces are searching for hostages. The plight of the captives, who include men, women and children, has galvanised Israeli support for the war, and families and supporters of the hostages are holding a protest march from Tel Aviv to Jerusalem.\nThe raid drew condemnation from Jordan and the internationally recognised Palestinian Authority, which called it a violation of international law.\nUN aid chief Martin Griffiths said he was “appalled” by the raid, saying the protection of civilians “must override all other concerns”.\nAt one point, tens of thousands of Palestinians seeking safety from Israeli bombardment were sheltering at the hospital, but most left in recent days as the fighting drew closer. A few thousand remained behind, along with patients, including premature babies, whose fate has drawn particular concern.\nThe Health Ministry said 40 patients, including three babies, have died since Shifa’s emergency generator ran out of fuel on Saturday. Another 36 babies are at risk of dying because there is no power for incubators, according to the ministry.\nHours before Israel’s raid, the United States said its own intelligence indicated militants have used Shifa and other hospitals – and tunnels beneath them – to support military operations and hold hostages.\nWith its troops inside Shifa, the burden will shift to Israel to prove its claim that the facility was being used by militants and that it was a big enough military target to justify the battle that isolated its patients for days and a fuel embargo that eventually shut down incubators and other life-saving equipment.\nHospitals can lose their protected status if combatants use them for military purposes, but civilians must be given ample time to flee, and any attack must be proportional to the military objective.\nThe deteriorating conditions at Shifa reflect the broader deprivations across the besieged territory, which has been without central electricity or running water for weeks.\nHardly any aid has been delivered to the north. About two thirds of the territory’s 2.3 million people have fled their homes – and most are now squeezed into the southern part of the narrow coastal strip, where conditions are also deteriorating as the bombardment there continues.\nAfter refusing to allow fuel into Gaza for weeks, Israeli defence officials changed course early Wednesday to let in some 24,000 litres, but the fuel will only allow the UN agency for Palestinian refugees, known as the UNRWA, to continue bringing limited supplies of food and medicine from Egypt.\nThe agency is providing basic services to the more than 600,000 people sheltering in severely overcrowded UN-run schools and other facilities in the south.\nThomas White, director of the UNRWA in Gaza, said that under Israeli restrictions the fuel would only be used for transporting aid from Egypt.\n“No fuel for water or hospitals,” he said, adding that the amount is equivalent to “only 9% of what we need daily to sustain lifesaving activities”.\nIsraeli troops, meanwhile, have extended their control across northern Gaza, capturing the territory’s legislature building and police headquarters.\nThe military says Israeli forces have completed the takeover of the Shati refugee camp, a densely built district, and are moving about freely in the city as a whole.\nThe military says its forces have found weapons and eliminated fighters in government buildings, schools and residential buildings. Israel says it has killed several thousand fighters, including important mid-level commanders, while 46 of its own soldiers have been killed in Gaza.\nInside some of the newly captured buildings, soldiers held up the Israeli flag and military flags in celebration.\nDefense minister Yoav Gallant said on Wednesday the ground operation will eventually “include both the north and south”, adding: “We will strike Hamas wherever it is.”\nPrime Minister Benjamin Netanyahu echoed the plans, saying Israel’s goal is “a complete victory over Hamas in the south and the return of our hostages”.\nIsrael told residents of northern Gaza to evacuate south, saying it wanted to get civilians out of the path of its ground assault, and hundreds of thousands fled.\nIf Israeli troops move south, it is not clear where Gaza’s population can flee, with Egypt refusing a mass transfer onto its soil.", "source_domain": "guernseypress.com", "text": null, "title": "Israeli forces raid Gaza’s largest hospital with hundreds of patients stranded", "title_page": null, "title_rss": null, "url": "https://guernseypress.com/news/world-news/2023/11/15/israeli-forces-raid-gazas-largest-hospital-with-hundreds-of-patients-stranded/"}