{"authors": [], "date_download": "2024-02-05 15:40:07", "date_modify": "None", "date_publish": "2023-11-15 01:19:28", "description": "North Korea says it has successfully tested new solid-fuel engines designed for intermediate-range ballistic missiles", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fnorth-korea-ap-south-korea-kim-jong-un-seoul-b2447447.html.json", "image_url": "https://static.independent.co.uk/2023/11/15/01/Koreas_Tensions_65603.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNorth Korea said Wednesday it successfully tested new solid-fuel engines designed for intermediate-range ballistic missiles as it continues to work on developing nuclear-capable weapons targeting its rivals in the region.\nNorth Korea’s official Korean Central News Agency said the country’s military scientists tested the first-stage and second-stage missile engines on Saturday and Tuesday. The report did not say when the new missile system was expected to be completed.\nThe North’s existing intermediate-range missiles, including the Hwasong-12 that may be able to reach the U.S. Pacific territory of Guam, are powered by liquid-fuel engines, which need to be fueled before launch and cannot stay fueled for long periods of time.\nMissiles with built-in solid propellants can be made ready to launch faster and are easier to move and conceal, which theoretically makes it harder for adversaries to detect and preempt the launch in advance.\nThe recent tests were an “essential process for further enhancing the strategic offensive capabilities of (North Korea’s) armed forces in the light of the grave and unstable security environment facing the country and the future military situation in the region, in which the enemies will get more vicious in their military collusion and nexus,” KCNA said.\nTensions on the Korean Peninsula are at their highest point in years after North Korean leader Kim Jong Un ramped up his weapons demonstrations, including events he described as simulated nuclear attacks on the South. He also authorized his military to launch preemptive nuclear strikes against enemies if it perceives Pyongyang’s top leadership to be under threat.\nSouth Korea has responded by expanding its combined military exercises with the United States, which Kim has condemned as invasion rehearsals. Seoul is also seeking stronger public assurances from Washington that it would swiftly and decisively use U.S. nuclear weapons to protect the South in case of a North Korean nuclear attack.\nDuring their annual security talks this week, U.S. Defense Secretary Lloyd Austin and South Korean Defense Minister Shin Won-sik signed an updated a bilateral security agreement with the aim of more effectively countering North Korea’s evolving nuclear and missile threats.\nShin said the new document spells out that the United States would mobilize its full range of military capabilities, including nuclear, to defend the South in the event of a North Korean nuclear attack. He also said the document will be a template for the allies to strategize how South Korea could assist U.S. nuclear operations in such events with its conventional capabilities but didn’t elaborate further.\nNorth Korea earlier this year revealed its first solid-fuel intercontinental ballistic missile, the Hwasong-18, which has the potential ability to reach deep into the U.S. mainland.\nAnalysts say the North has to clear further technological hurdles to have a viable nuclear arsenal that could threaten the United States.\nAll of North Korea’s ICBM tests so far were done at high angles to avoid the territory of neighbors, so it’s not yet clear whether the country has mastered the technology to ensure its warheads would survive atmospheric reentry well enough to precisely hit their targets.\nThe latest steps in North Korea’s weapons development follow concerns about a potential arms alignment with Russia, in which North Korea provides munitions for Russia’s war in Ukraine in exchange for Russian technology transfers that would upgrade Kim’s military nuclear program.\nSouth Korean intelligence and military officials have said North Korea may have shipped more than a million artillery shells to Russia beginning in August, weeks before Kim met Russian President Vladimir Putin. Both Moscow and Pyongyang have denied U.S. and South Korean claims about the alleged arms transfers.\nSeparately, KCNA reported that Russia's natural resources minister, Alexander Kozlov, is visiting North Korea in a sign of the countries' expanding diplomacy. The report said the two sides were engaged in talks over trade, science and technology exchanges, but it did not elaborate further.\nThe Associated Press had reported he arrived in Pyongyang on Tuesday.", "source_domain": "www.independent.co.uk", "text": null, "title": "North Korea says it tested new solid-fuel engines for intermediate-range ballistic missiles", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/north-korea-ap-south-korea-kim-jong-un-seoul-b2447447.html"}