{"authors": ["Alona Ferber", "Alona Ferber Is The Editor Of The New Statesman'S Spotlight Policy Section", "Supplement. She Writes On Policy", "Politics", "Including Her Specialist Coverage Of Israel", "Conducts Interviews With Major Public Figures.", "More This Author"], "date_download": "2024-02-05 15:40:08", "date_modify": "None", "date_publish": "2023-11-15 15:16:27", "description": "Washington is pushing Israel on its postwar intentions, after Antony Blinken stated that the country can’t occupy Gaza.", "filename": "https%3A%2F%2Fwww.newstatesman.com%2Fworld%2Fmiddle-east%2F2023%2F11%2Funited-states-israel-support-postwar-gaza.json", "image_url": "https://dl6pgk4f88hky.cloudfront.net/2023/11/15/USA-Israel-800x418.jpg?1707144009", "language": "en", "localpath": null, "maintext": "US Secretary of State Antony Blinken arrives in Israel for crisis talks. Photo by Jacquelyn / AFP via Getty Images\nOn 8 November at a meeting of G7 foreign ministers in Tokyo, the US secretary of state Antony Blinken addressed the future of the Gaza Strip after Israel’s war against Hamas has ended. “Gaza cannot… continue to be run by Hamas; that simply invites a repetition of 7 October,” he told his foreign counterparts. But, he added, “it’s also clear that Israel cannot occupy Gaza”.\nYet only the day before, Israel’s prime minister, Benjamin Netanyahu, had told ABC News that his country “would have overall security responsibility [in Gaza] for an indefinite period” should Hamas be vanquished – an apparent and public clash with the US’s stated position.\nThis is a sign that, despite the US’s staunch support of Israel’s war effort, it is diplomatically, yet publicly, pushing Israel to be clear about its postwar intentions and to minimise civilian casualties. According to Alon Pinkas, Israel’s former consul general in New York, “we don’t see” the significant pressure the US is placing on Israel. It is in private conversations where Washington’s influence is most keenly felt.\nThe US has focused on three key issues in its blunt closed-door talks with Netanyahu’s cabinet. The first is to warn Israel against escalating the conflict with Hezbollah in Lebanon – a wider war is what the US fears the most. The second is over what Israel’s plan is for the Strip – or the lack of it – if Hamas is defeated. The third is over minimising civilian harm.\nMore than 11,000 Palestinians, including 4,000 children, have been killed in Israel’s war on Hamas, according to the Hamas-run Gaza health ministry. The war has destroyed Gaza’s infrastructure and created a refugee crisis. On 13 November the United Nations Relief and Works Agency for Palestine Refugees, which delivers aid across the Strip, said that its fuel depot was empty. This meant that within days there would be no electricity to power hospitals or even sewage pumps.\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. Sign up directly at saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. Sign up directly at morningcall.substack.com Events and Offers Stay up to date with NS events, subscription offers & updates. The Green Transition Weekly analysis of the shift to a new economy from the New Statesman's Spotlight on Policy team. Your email address Job title Job title\nAdministration / Office\nArts and Culture\nBoard Member\nBusiness / Corporate Services\nClient / Customer Services\nCommunications\nConstruction, Works, Engineering\nEducation, Curriculum and Teaching\nEnvironment, Conservation and NRM\nFacility / Grounds Management and Maintenance\nFinance Management\nHealth - Medical and Nursing Management\nHR, Training and Organisational Development\nInformation and Communications Technology\nInformation Services, Statistics, Records, Archives\nInfrastructure Management - Transport, Utilities\nLegal Officers and Practitioners\nLibrarians and Library Management\nManagement\nMarketing\nOH&S, Risk Management\nOperations Management\nPlanning, Policy, Strategy\nPrinting, Design, Publishing, Web\nProjects, Programs and Advisors\nProperty, Assets and Fleet Management\nPublic Relations and Media\nPurchasing and Procurement\nQuality Management\nScience and Technical Research and Development\nSecurity and Law Enforcement\nService Delivery\nSport and Recreation\nTravel, Accommodation, Tourism\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\nIsrael has said that this war will take time and, six weeks into the conflict, its army is deep inside Gaza. Yet Hamas fighters operate in an intricate network of tunnels underground. Israeli journalists embedded within the Israel Defense Forces have reported seeing few militants above ground, only terrified civilians. Netanyahu insists that they are removing Hamas’s military capabilities “step by step”.\n[See also: The Iran Trap]\nYet, across the West, patience among Israel’s international backers is running out, as people take to the streets to call for a ceasefire. The French president, Emmanuel Macron, who visited Israel in solidarity in the aftermath of Hamas’s attack, recently urged the country to stop killing Gazan women and babies – though he later scrambled to reassure counterparts in Israel of French support. The UN secretary-general, António Guterres, said the sheer scale of civilian death shows “something is wrong” with Israel’s military tactics.\nPolling from Brookings shows that support for Israel among the American public has fallen, particularly among Democrats. The Biden administration, facing domestic pressure ahead of the 2024 election, may fear that the political cost of continuing to support Israel might become too high. The divergence in interests between the US and Israeli governments is still mostly hidden, for now. Yet this divide could be critical for Israel, which heavily relies on US support. “We aren’t there yet,” says Pinkas, “but we are close.”\nThe Netanyahu government is also under intense internal pressure. Before 7 October, Israel was a country riven by protest, most recently over the government’s anti-democratic attempt to curb the judiciary’s powers. Now, thousands of families are displaced from the south and the north, where Hezbollah has been firing over the border. And Hamas continues to fire rockets across the country. In the West Bank, armed settler extremists have been harassing and killing Palestinian herders, with few reprisals from security forces.\nSurveys indicate that most Israeli Jews support the war, with only 10 per cent believing Israel should stop the fighting to exchange the more than 200 hostages still held by Hamas – despite protests from the families of the kidnapped. The Israeli taboo over criticising the state during war is veering into outright censorship, with reports of Palestinian and Arab citizens of Israel being arrested for alleged incitement over social media posts. Mohammad Darawshe is a long-time peace advocate whose 23-year-old cousin was murdered at the Nova Festival. He said he feels silenced by Netanyahu’s government, and Israelis in general: “We shut our mouths, swallow our hearts and our tongues, and cry quietly about what we are seeing in Gaza.”\nIsrael may insist that the war will take time, but Pinkas told me that the US “has called Israel’s bluff”, with the fighting dragging on because Israel doesn’t have a postwar plan. Then there are Netanyahu’s motivations. Eager to avoid facing his ongoing criminal corruption case, eager to avoid the reckoning of a postwar public inquiry, he may have his own reasons for wanting the conflict to continue.\nOn 13 November the foreign minister Eli Cohen predicted that there were two or three weeks before international support for Israel recedes. Israel needs the US for its survival, but it also needs regional support from the Arab states for a viable future. There will be a day after this war. If Israel wants to guarantee its security in the long term, it can only do so by trying to find a political solution that gives the Palestinians freedom and statehood. So far, no military solution has sufficed.\n[See also: Rashid Khalidi: “Israel is stealing land as we speak”]\nRelated", "source_domain": "www.newstatesman.com", "text": null, "title": "In public the US supports Israel, but in private pressure mounts", "title_page": null, "title_rss": null, "url": "https://www.newstatesman.com/world/middle-east/2023/11/united-states-israel-support-postwar-gaza"}