{"authors": ["Iona Cleave"], "date_download": "2024-02-05 15:14:36", "date_modify": "None", "date_publish": "2024-01-30 20:24:09", "description": "THE chief of Iran-backed militia tonight announced a halt to the militia's attacks on US assets in both Syria and Iraq.The decision follows the killin", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25612799%2Firan-militia-halts-attacks-us-deaths-troops%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/2024-according-iraqi-sources-us-874554202_5f7a23.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "It followed reports that US President Biden was drawing up plans for a revenge strike on the militia\nREBEL CLAMPDOWN Iran-backed militia suddenly HALTS attacks on US troops as Pentagon say deaths of 3 squaddies bore group’s ‘footprints’\nTHE chief of Iran-backed militia tonight announced a halt to the militia's attacks on US assets in both Syria and Iraq.\nThe decision follows the killing of three US troops in a drone ambush near the Jordan-Syria border – an attack that the Pentagon said bore the \"footprints\" of the Iraq-based terror group.\n7 The Iraq-based Kata'ib Hezbollah Brigades have called off attacks on US bases and troops in Iraq and Syria Credit: AFP\n7 Their striking decision came soon after reports President Biden was plotting his revenge Credit: AP\n7 The Pentagon was reportedly planning aerial attacks on the Iran-backed militia responsible for the killing three US squaddies\nKata'ib Hezbollah Brigades Secretary-General al-Hamidawi announced the immediate \"suspension\" of military operations against the US.\nHe said in a statement: \"As we announce the suspension of military and security operations against the occupation forces - in order to prevent embarrassment to the Iraqi government - we will continue to defend our people in Gaza in other ways.\"\nInstead, al-Hamidawi advised his fighters to engage in \"passive defence if any hostile American action occurs towards them\".\nThe Hezbollah Brigades are a group affiliated with the Hashed al-Shaabi, an alliance of Iran-backed former paramilitary groups now integrated in Iraq's regular armed forces.\nThe striking announcement followed reports President Joe Biden was considering blitzing targets belonging to the Iran-backed group as he plots a revenge strike for the ambush on the US base that killed three.\nSgt William Rivers, 46, Specialist Kennedy Sanders, 24, and Specialist Breonna Moffett, 23, were killed in the unprecedented attack on the Tower 22 base in Jordan, which injured another 34.\nThe strike marked the first US deaths by enemy fire since the start of the Israel-Hamas war - a major escalation in the crisis taking hold across the region.\nThe US Department of Defense said that the drone attack bore the signs of an extremist group with access to Iranian weaponry.\nAnd while the Pentagon investigates what type of drone slipped past their air defences, preliminary evidence suggests that Kata'ib Hezbollah was responsible.\nPentagon spokesperson Sabrina Singh said: “In terms of attribution for the attack, we know this is an [Islamic Revolutionary Guard Corps]-backed militia. It has the footprints of Kata'ib Hezbollah, but not making a final assessment on that,” she said on Monday.\n“Our teams are continuing to do the analysis, but we know Iran is behind it.”\nWho are Kata'ib Hezbollah? KATA'IB Hezbollah is a radical Shiite paramilitary group based in southern Iraq. Also known as the Hezbollah Brigades, the group first emerged in the early 2000s and has been blamed for violence across Iraq. It has close ties with fellow Iranian proxy Hezbollah in Lebanon and Iran's terrorist army, the Islamist Revolutionary Guard Corps (IRGC). The group is also affiliated with the Hashed al-Shaabi (Popular Mobilisation Force), an alliance of Iran-backed former paramilitary groups now integrated into Iraq's regular armed forces. With up to 10,000 members, the group has been responsible for attacks on US targets in Iraq and Syria killing hundreds of soldiers. Its leader Ahmad al-Hamidawi, was named a Specially Designated Global Terrorist in February 2020. The Pentagon believes that a drone strike on a US base near the Syria-Jordan border on January 28 that killed three personnel bore the 'footprints' of the group.\nOn Monday, Biden held private meetings with his national security team to discuss the \"unacceptable\" attack - and officials said they are preparing to hit back with force.\nWhite House national security spokesman, John Kirby, vowed that a \"very consequential response\" would be carried out.\nHe ruled out the possibility of directly attacking Iran, stating the US does not want to \"escalate\" the conflict.\nHe said: “We do not seek another war. We do not seek to escalate. But we will absolutely do what is required.\"\nKirby added that their eventual response will take into account “that these groups, backed by Tehran, have just taken the lives of American troops.”\nAccording to Politico, options include attacking Iranian personnel in Syria or Iraq, or Iranian naval assets in the Persian Gulf.\nThe US has 45,000 military personnel currently stationed in the Middle East.\nThere are roughly 2,500 American troops in Iraq and some 900 in Syria - a hangover from the occupation and an attempt to monitor Islamic extremist threats.\nPrior to the attack on the American base, the US launched a wave of airstrikes last week that specifically targeted Kata'ib Hezbollah as well as other Iran-affiliated groups.\nThe strikes targeted facilities in Jurf al-Sakhar, south of Baghdad, al-Qaim and another unnamed site in western Iraq.\nThe attack was a retaliation after a ballistic missile ambush at the American Al-Asad airbase days before which left four US military personnel with traumatic brain injuries.\nDefence chief Austin said: \"The President and I will not hesitate to take necessary action to defend them and our interests.\n\"We are fully prepared to take further measures to protect our people and our facilities. We call on these groups and their Iranian sponsors to immediately cease these attacks.\"\nMeanwhile in the Red Sea, Iran-backed Houthi rebels appear undeterred in their mission to turn its troubled waters into an active warzone.\nUS and British forces are currently battling to keep the vital shipping lane open under a barrage of missile and drone attacks.\nAnd today, shocking satellite pictures appeared to reveal a secret Iranian base used to train Houthis in how to carry out their maritime raids.\nA bombshell report seen by The Sun claims Iran's warped terrorist army, the Islamic Revolutionary Guard Corps (IRGC), trained up hundreds of Houthi recruits.\nSince November, the Yemen-based militia have been attacking any ships they deem to have links with Israel in an attempt to avenge Israel's war in Gaza.\nA US-led naval coalition has responded by aggressively patrolling the Red Sea, and American and British forces have struck Houthi military sites across Yemen to keep open the vital trade route.\nFour RAF Typhoon jets unleashed laser-guided bombs, while US warships, submarine-launched Tomahawk missiles and fighter jets took out other missile storage sites and launches in a second blitz last week.\nIt provoked a furious response from the trigger-happy Houthis who vowed that warned the strikes would \"not go unanswered and unpunished\".\nTonight, it emerged that Britain is preparing to send an aircraft carrier to the Red Sea to blast Houthi targets in Yemen with F-35 Lightning jets.\nDefence minister James Heappey gave a “whopping great clue” that one of the Navy’s two carriers would get orders to steam into battle.\nBoth HMS Queen Elizabeth and HMS Prince of Wales are tied alongside in Portsmouth despite attacks by Iran-backed rebels against cargo ships off the coast of Yemen.\nHeappey said the Royal Navy’s most formidable warships weren’t needed while the American carrier USS Dwight D Eisenhower was there.\nHe signalled the UK aircraft carriers were braced to relieve the USS Eisenhower when it needed time in port.\nHe said: “With the Ike on station – the Eisenhower on station – and with jets available from Akrotiri, that we were able to meet the challenge as it is now.\n“That’s not to say that when the Eisenhower goes home, if we were needed to plug a gap in US deployments, or if the situation deteriorates and we need more, that we wouldn't [send a British carrier].”\nPressed on whether Britain would deploy a carrier, he said: “I've given you a whopping great clue in my previous answer.\n“The fact is the Eisenhower can't stay there forever. And so there's a thing about just maintaining a carrier presence in the region where we might cooperate with the Americans to provide a capability there.”\nThe MoD said any carrier deployment would be “based on operational need”.\nAn MoD spokesperson said: “As the Minister set out, any decision as to whether to deploy the carriers will be made in conjunction with our allies and based on operational need.”\n7 The three killed US troops: Sgt William Rivers, 46, Specialist Kennedy Sanders, 24, and Specialist Breonna Moffett, 23\n7 The Royal Navy aircraft carrier HMS Prince of Wales and carrier HMS Queen Elizabeth could be soon deployed to the Red Sea as the crisis deepens", "source_domain": "www.thesun.co.uk", "text": null, "title": "Iran-backed militia suddenly HALTS attacks on US troops as Pentagon say deaths of 3 squaddies bore group's 'footprints'", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25612799/iran-militia-halts-attacks-us-deaths-troops/"}