{"authors": ["Michael Segalov"], "date_download": "2024-02-05 15:16:21", "date_modify": "None", "date_publish": "2024-01-23 13:00:11", "description": "The first conscientious objector to be jailed in Israel since 7 October says ‘there is no military solution’ to the conflict", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F23%2Fisrael-man-jailed-refuse-serve-idf-military-tal-mitnick-interview.json", "image_url": "https://i.guim.co.uk/img/media/1f9d2add33039e1edfd62ba95aab7fdb6c7c0acf/0_260_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dcbb0972d8d8f41aa951327e8851d388", "language": "en", "localpath": null, "maintext": "On Tal Mitnick’s first morning inside an Israeli military prison last month, he was ordered into a small classroom. Pinned to its walls were various famous quotes. One caught his attention: “Education is the most powerful weapon you can use to change the world.” The name beneath it: Nelson Mandela.\n“I nearly laughed to myself,” says the 18-year-old, speaking over Zoom from the bedroom of his family’s Tel Aviv home. “A military upholding apartheid putting that on their wall,” he says, “while South Africa was preparing its case against Israel for the international criminal court? I pointed out how ridiculous this quote being there was. No other prisoners engaged or agreed. I realised how alone I was.”\nIn late December, Mitnick refused his mandatory draft to join the Israel Defense Forces. As a result, a military court sentenced him to 30 days in custody, making him the first conscientious objector to be jailed in Israel since 7 October. He spoke to the Guardian late on Friday afternoon, one day after his release. Over the weekend, Mitnick spent time with friends and family and attended an anti-war march. This freedom will be short-lived. “I’ve already had my draft order from the army for Tuesday morning. Again, I’ll go to the military base and tell them I refuse to serve. Again, I’ll be sent to jail.” On Tuesday morning, Mitnick was sentenced to a further 30 days in prison.\nNo policy dictates how long this cycle might continue. Often refusers spend stints totalling 100 days or more locked away, after which the IDF eventually concludes they’re unfit for service.\nMitnick’s last enlistment date was 26 December 2023. “I was due to enlist that day, yes, but so were many others. My peers were there – with their mothers, fathers and siblings, too, all knowing they were sending their children off to maybe risk their lives.” He counted other conscripts in their hundreds. “Seeing someone else there, in this case me, refusing to do the same? It creates clashes. A lot either ignored me and kept walking, or said just a few words as they passed. They’d call us traitors, say it should have been me in Be’eri.”\nView image in fullscreen Protestors support Mitnick on 26 December. Photograph: Mesarvot Network\nA small protest had been organised by Mesarvot – a network supporting refuseniks – to show support for Mitnick outside the Tel HaShomer military base, his conscription location. Friends and family were also more understanding. “They know what I want is moderate, non-violent and peaceful,” he explains, “even if my outlook isn’t the norm here.”\nMitnick said he had known he wouldn’t serve for many years. While he studied maths and computer science at school, a teacher suggested his natural aptitudes would suit a role in an elite intelligence unit. “So I looked into it more. Intelligence units, I learned, blackmail LGBTQ+ Palestinians and people needing health treatment in Israel into being informants. I started to see how the system is built on oppression. Once I realised this, I knew I had to not only refuse, but also work against it.”\nThe events of 7 October only affirmed his decision. “Israel has already lost this war,” he believes. “More killing and more violence won’t bring back the lives lost on 7 October. I know people are hurt. Traumatised. But this doesn’t make anything better. To root out extremist ideas from Palestinian society, we must root them out in Israel.”\nAnd so, once inside the military base last month, Mitnick presented the recruitment officer with his ID. “I said: ‘No, I’m not doing this.’ I was yelled at, told I had no choice. I had to stand up for myself.” He was sent from commander to commander. “To each of them, I said the same thing: I believe there is no military solution to this conflict. I’m a pacifist.”\nFor first-time refuseniks, seven to 10 days is a standard sanction. On 26 December, Mitnick received 30 days to be spent at a prison just outside the town of Kfar Yona.\n“I don’t see myself as the hero or anything,” he says, “while people are being massacred every day in Gaza. And I want to stress I’m by no means the only one. There are other anti-occupation activists. People opting to not join the army. Peace campaigners, young and old. But at the same time, I do think this takes bravery.”\nOnline, at least, some pro-Palestine voices have questioned the praise being poured on Mitnick, suggesting refusing to participate in the slaughtering of civilians is the very least to be expected. “There is a huge social consequence here for refusing to serve,” he says, “especially doing so publicly. Israeli society is so militarised that most conversations start with ‘Where did you serve?’ or ‘Where are you serving?’ When you say you didn’t, don’t or won’t, a gap opens up. I’m paying a price for this. I was born in Israel – I didn’t choose to live here. We have a test at 18, the country and system tests us to see if we’ll be complicit. I chose not to be.”\nThe events of 7 October shifted political paradigms inside Israel. “Even four months ago,” says Mitnick, “we were in the middle of the judicial reform protests.” He played an active part in the demonstrations. “The refusal movement was gaining traction. Now the supposed liberals, that protested judicial reform, are pilots massacring people in Gaza. People who were speaking out about government corruption are now supporting the far-right leadership, saying there are no civilians in Gaza.”\nView image in fullscreen Protests against Netanyahu’s judicial reform in Tel Aviv on 12 August. Photograph: Anadolu Agency/Getty Images\nHitpakhut is a term much-used in Israel today. “It means sobering up. Lots of Israeli liberals who were vaguely pro-peace are now for Gaza’s destruction. They say they were high, drunk on the fantasy of peace; now they’ve sobered up and say we have to kill the Palestinians.”\nPrison life, for Mitnick, took some adjustment. “You’re treated like a soldier inside a military jail,” he says. “Staff aren’t called guards, but commanders. Some of the day is spent being told to stand in line for hours while they talk to you. Otherwise, you eat, clean your room, maybe rest. Then repeat, over and over.” Access to media was limited. “The only regular news source is the rightwing daily paper Israel HaYom,” he says. Occasionally, a news programme would air on his in-cell TV, although domestic broadcasters have all but ignored Mitnick and the wider anti-war movement. “The media is trying to manufacture consent to kill and massacre more and more,” is Mitnick’s explanation. “If they show my opinion, suggesting there’s another way, it undermines what the government is doing.”\nMitnick was reluctant to tell other inmates why he was inside. “I was mostly in prison with deserters. People who served in the military then didn’t come back. Mostly, that’s for socioeconomic reasons.” Few, if any, shared his political position. “I knew I couldn’t keep it a secret the whole time,” he says. “So I talked. Initially, I was called stupid and naive. Worse, too.”\nBut he had the conversations. “Humanising my opinion is important. One guy I got to know heard other prisoners talking about me behind my back, and then defended me. He told them I don’t support Hamas, I just want peace.”\nIn truth, Mitnick knows, his generation of Israelis doesn’t broadly agree. “Young people here are more rightwing than their parents,” he says. Peace activists have been arrested and face public condemnation.\n“I still remain hopeful,” he says. “We don’t have the privilege to lose hope here. I hope more and more young people my age see that it’s not normal to live in constant fear of terrorist attacks, nor to enlist 18-year-olds into the army. Nothing here is normal, and we have the power to change that.”\nOn Tuesday morning, Mitnick returned to Tel HaShomer. He now faces another month in custody. “There’s no end date to this in sight,” he says, “which isn’t easy. Inside, I wasn’t counting down the days. Here, I’m not celebrating being out either. This is simply a step I have to take. At some point, they’ll have to release me.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘More killing won’t bring back lost lives’: Tal Mitnick, 18, on going to prison instead of joining IDF", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/23/israel-man-jailed-refuse-serve-idf-military-tal-mitnick-interview"}