{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:40:16", "date_modify": "None", "date_publish": "2023-11-15 00:44:13", "description": "More than 500 appointees and staff members criticized Biden’s unwavering support for Israel in letter demanding ceasefire", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fnov%2F14%2Fbiden-letter-israel-gaza-war-ceasefire.json", "image_url": "https://i.guim.co.uk/img/media/4ef2987d6a1597073b8c2c6759953708ed964ec3/0_183_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=db4f3af44e9457a5ca58d135f7b6b3b3", "language": "en", "localpath": null, "maintext": "The Biden administration is increasingly seeking ways to restrain the Israeli military in an effort to slow the civilian toll and limit the risk of a wider conflict, while it faces a rising level of internal dissent over its Middle East policy.\nIn a letter presented to Biden and his cabinet on Tuesday, more than 500 political appointees and staff members from about 40 agencies across the administration criticised the extent of the president’s support for Israel in its war in Gaza.\nThe letter denounced the Hamas killing of 1,200 Israelis, mostly civilians, on 7 October, but called on Biden to rein in Israel’s military campaign in Gaza, in which the death toll is now above 11,000, according to the Hamas-run health ministry.\n“We call on President Biden to urgently demand a cease-fire; and to call for de-escalation of the current conflict by securing the immediate release of the Israeli hostages and arbitrarily detained Palestinians; the restoration of water, fuel, electricity and other basic services; and the passage of adequate humanitarian aid to the Gaza Strip,” the letter said, according to New York Times.\nThe letter, whose signatories are anonymous, reflects mounting unease among US officials about Biden’s policy in the first weeks of the war of emphasising Israel’s right to defend itself in public, while trying to restrain its retaliation in private. The critics have argued that this approach has not been effective.\n“It’s been an open secret for weeks that significant dissent and frustration has permeated across the US government – driven by heightening concern around the scale of Israel’s military response in Gaza,” Charles Lister, a senior fellow at the Middle East Institute. “The trigger for much of the internal dissent was Biden’s public comments – initially his zero-sum approach to the issue and then his misinformed scepticism of casualty figures in Gaza.”\nMore than 1,000 staffers at the US Agency for International Development (Usaid) signed an open letter calling on the administration to make better use of its leverage to limit the civilian death toll, and scores of state department staff have argued for a change in policy through the state department’s formal dissent channel, reportedly on three occasions.\nThe secretary of state, Antony Blinken, takes the dissent seriously, his officials say. Discussions have been encouraged at foreign missions around the world soliciting feedback.\n“We’re listening: What you share is informing our policy and our messages,” Blinken said in a message to staff, in which he acknowledged: “I know that for many of you, the suffering caused by this crisis is taking a profound personal toll.”\nTom Yazdgerdi, the head of the American Foreign Service Association, the diplomats’ trade union, praised the administration for its readiness to listen to internal criticism, in marked contrast to its predecessor.\n“I think there was some concern, particularly by members of Arab American and Muslim American employee organizations at the state department and elsewhere that took issue with the policy, and the fact that this administration does put a premium on dissent and that these groups actually met the secretary himself, along with other leaders at the department – that was good,” Yazdgerdi said in an interview.\n“We were happy to see that because those views need to be heard. They probably have had some effect, I imagine.”\nUS officials say the administration’s call for restraint, and emphasis on the need to limit the civilian death toll, has been conveyed repeatedly to Israel, and the Pentagon has been giving the Israel Defense Forces advice on how to target Hamas in Gaza while minimising “collateral damage”.\nThe officials say that there was support within the Israeli government after 7 October for a pre-emptive attack on Hezbollah in Lebanon, to blunt the threat of a second front, before launching a ground offensive into Gaza. The fact there was no such pre-emptive strike, they say, was due in part to US persuasion, thus fending off the risk, for now, of a wider regional conflict. Hezbollah itself, US officials believe, has no interest in escalating the conflict, and is firing just enough rockets across Israel’s northern border to maintain its credibility as a symbol of resistance against Israel.\nUS officials have meanwhile stiffened the tone of their remarks on Gaza. Biden said on Monday that hospitals there “must be protected”.\nskip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n“My hope and expectation is that there will be less intrusive action relative to hospitals,” Biden told reporters.\n“We continue to have discussions at all levels, including President Biden with Prime Minister Netanyahu, to urge Israel to continue taking every possible measure to protect civilians,” the national security adviser, Jake Sullivan said on the same day. Sullivan said the US was also focused on negotiations to free hostages being held by Hamas, as many as 10 of whom are thought to be Americans who have yet to be accounted for. On Monday he met some of the hostages’ family members.\nThe Usaid administrator, Samantha Power, stiffened the rhetoric further on Tuesday, saying: “Israel’s restoration of communications, electricity, water lines, and fuel to Gaza is imperative.\n“And even as Israel defends its people, it is imperative that the IDF adhere to international humanitarian law,” Power told a meeting of an advisory board created to fund Israeli-Palestinian partnerships.\nUS officials pointed out that the tougher tone was in response to events on the ground, as well as US internal dissent. Senior diplomats argue that the high level of vocal dissent is in part a generational phenomenon, and that the current crop of young foreign service officers feels more entitled to have a say over policy than their predecessors.\nThey also point out that such levels of dissent are not unprecedented. The state department was in constant turmoil during the Trump administration, especially over its early efforts to establish a “Muslim ban” on immigrants. There were three high-level state department resignations over the Iraq war, but there has only been one so far over the Gaza war: Josh Paul, from the political-military bureau.\nAdministration officials also point to the limits to outrage in the Arab world. Neither Bahrain nor the United Arab Emirates has renounced their Abraham accords normalisation agreements with Israel, and Saudi Arabia has insisted it is still interested in pursuing one of its own.\nLister said that the adjustment in US administration tone had in part been a result of Biden’s own initial instincts being reined in by his own officials.\n“With time, it became increasingly clear that Biden himself was the sole driver of that initial zero-sum approach and it took weeks of concerted high-level effort – from state, Usaid, the intelligence community and even part of the national security council itself – to turn things around and shape a more holistic, strategic approach that prioritised support to Israel alongside a far greater emphasis on civilian protection, humanitarian access, and commitment to international humanitarian law and the laws of war.”", "source_domain": "www.theguardian.com", "text": null, "title": "White House seeks to restrain Israel in Gaza amid growing internal dissent", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/nov/14/biden-letter-israel-gaza-war-ceasefire"}