{"authors": ["Emine Sinmaz", "Jason Burke"], "date_download": "2024-02-05 15:40:16", "date_modify": "None", "date_publish": "2023-11-15 20:02:23", "description": "Head of the World Health Organization calls decision to send troops into hospital ‘totally unacceptable’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F15%2Fidf-entered-gaza-al-shifa-hospital-raid-targeted-operation-hamas.json", "image_url": "https://i.guim.co.uk/img/media/d6b22cca03d426b3bee5f01b9a7f3083758063e0/0_0_8707_5225/master/8707.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4dc7949c2179dae4bbcf876a0c7e0c34", "language": "en", "localpath": null, "maintext": "Israeli soldiers were inside Gaza’s largest hospital on Wednesday after an early morning raid that drew fierce condemnation from the head of the World Health Organization, who called it “totally unacceptable”.\nThe decision to send troops into al-Shifa hospital marked an escalation of Israel’s offensive in Gaza, amid increased calls for a ceasefire. Witnesses reported seeing tanks and masked soldiers in the grounds of the hospital around 3am as patients and civilians remained trapped inside.\n“Hospitals are not battlegrounds,” the WHO chief, Tedros Adhanom Ghebreyesus, said. “We’ve lost touch again with health personnel at the hospital. We’re extremely worried for their and their patients’ safety.”\nThe Israeli army said its troops had conducted a “precise and targeted operation against Hamas in a specified area”. Later on Wednesday, a senior Israeli military official said “weapons and other terror infrastructure” had been found during the operation “in one specific area”.\nThe official told reporters that four militants died in a clash outside, and that there was no fighting inside the hospital complex and no friction with medical staff or patients, who he said were in a different section of the site.\nLate on Wednesday, the Israel Defense Forces released a video that it said showed some of the material recovered from an undisclosed building within the large hospital complex, including automatic weapons, grenades, ammunition and flak jackets.\nLt Col Jonathan Conricus, an Israeli military spokesperson, said in the video: “These weapons have absolutely no business being inside a hospital.”\nHamas denied the claim, which it said was “nothing but a continuation of the lies and cheap propaganda, through which [Israel] is trying to give justification for its crime aimed at destroying the health sector in Gaza”.\nOn Wednesday evening, the chief Israeli military spokesperson, R Adm Daniel Hagari, said troops found weapons, combat gear and technological equipment at Shifa, and were continuing their search of the complex.\nThe raid came as Israel’s former deputy prime minister Gideon Sa’ar said his country would agree to a temporary ceasefire in Gaza to facilitate the release of hostages held by Hamas, according to Jewish News. The minister told the UK publication there would be “a temporary short ceasefire in order to get our hostages out. There are ongoing negotiations to achieve that. And it will be achieved. We will see a temporary ceasefire.”\nQatari mediators were reportedly seeking to negotiate a deal that included the release of about 50 civilian hostages from Gaza in exchange for a three-day ceasefire, an official briefed on the negotiations told Reuters.\nAt around 1am local time, a Gaza health ministry spokesperson said Israel had told officials in the territory that it would enter the Shifa complex “in the coming minutes”.\nDr Ahmed El Mohallalati, a surgeon at the hospital, said in a phone call with Reuters that staff were in hiding as the fighting unfolded around the hospital overnight. The sound of what he described as “continuous shooting from the tanks” could be heard in the background as he spoke, Reuters said.\nAfter “horrible” sounds of clashes, “one of the big tanks entered within the hospital from the eastern main gate, and they … just parked in the front of the hospital emergency department,” he said.\nFighting has raged around the Shifa hospital compound for many days, trapping about 1,200 patients and staff. The Gaza health ministry said 40 patients, including three babies, had died since Shifa’s emergency generator ran out of fuel on Saturday.\nThe hospital, Gaza’s biggest, has become a strategic objective for Israel, which says there is an Hamas command centre in bunkers underneath. Hamas and hospital staff have denied this.\nOn Wednesday the Israeli prime minister, Benjamin Netanyahu, said there was no hiding place for Hamas. “They said that we would not reach the outskirts of Gaza City – we’ve arrived. They told us that we would not enter al-Shifa – we’ve entered. There is no place in Gaza that we will not reach,” he said.\nThe Israeli military said it had provided evacuation routes for civilians and given authorities in Hamas-run Gaza 12 hours’ notice that any military operation inside must cease. A spokesperson called on “all Hamas terrorists present in the hospital to surrender”.\nIt also said it had delivered humanitarian equipment and incubators to the hospital, publishing photos of a soldier standing beside cardboard boxes marked “baby food” and “medical supplies” in English.\nA journalist inside the hospital working with the AFP news agency said Israeli soldiers were interrogating people on Wednesday morning, among them patients and doctors.\nA witness inside the hospital told the BBC’s correspondent in Palestine, Rushdi Abu Alouf, that soldiers had entered the complex and “fired a smoke bomb that caused people to suffocate”. The Guardian was not able to verify the claims as phone calls to staff inside the hospital would not connect.\nOn Wednesday, Gaza’s two main telecommunications companies, Paltel and Jawwal, warned of a “complete telecom blackout in the coming hours” due to a fuel shortage.\nThe civilian toll of Israel’s military offensive, which followed attacks by Hamas into Israel last month that killed 1,200 people, has fuelled growing outrage around the world.\n“In the name of humanity, the [UN] secretary general calls for an immediate humanitarian ceasefire,” a spokesperson for António Guterres told reporters.\nUS public support for the war is eroding and 68% of Americans think Israel should call a ceasefire, according to a new Reuters/Ipsos poll.\nIsrael has so far presented in public only limited evidence of the alleged command complex under al-Shifa, though it is widely accepted that Hamas has an extensive tunnel network across Gaza.\nThe US said on Tuesday that its own intelligence supported Israel’s conclusions that Hamas used al-Shifa as a command centre and used tunnels beneath the complex to conceal military operations and possibly hold some of the more than 240 hostages seized during last month’s attack into Israel.\nHamas, which has repeatedly denied the claim that it uses medical facilities as military bases, said on Wednesday that the US president, Joe Biden, was “wholly responsible” for the assault, accusing his administration of giving Israel “the green light … to commit more massacres against civilians”.\nView image in fullscreen Piles of waste and trash are accumulated in front of al-Shifa hospital in Gaza City on 13 November. Photograph: Anadolu Agency/Anadolu/Getty Images\nMore than 11,000 Palestinians, two-thirds of them women and children, have been killed since the war began, according to the health ministry in Gaza. About 2,700 people are reported to be missing.\nA White House official, speaking after the Israeli raid on al-Shifa was announced, said the US did not want to see a firefight in the hospital.\nWitnesses have in recent days described conditions inside the hospital as horrific, with medical procedures taking place without anaesthetic, families with scant food or water living in corridors, and the stench of decomposing corpses filling the air.\nIsraeli troops have now consolidated their hold on much of northern Gaza, capturing the territory’s legislature building and its police headquarters. However, fighting is continuing in al-Shati refugee camp, a coastal neighbourhood that has long been a Hamas stronghold, military officials told the Guardian. About two-thirds of Gaza’s 2.3 million people have been made homeless by the offensive and are unable to escape the territory, where food, fuel, fresh water and medical supplies are running out.\nMany have fled to the southern half of Gaza, some through “humanitarian corridors” opened by Israeli troops. Airstrikes and the bombardment of south Gaza have continued, however.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli soldiers raid al-Shifa hospital in escalation of Gaza offensive", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/15/idf-entered-gaza-al-shifa-hospital-raid-targeted-operation-hamas"}