{"authors": ["Yohannes Lowe", "Geneva Abdul"], "date_download": "2024-02-05 15:40:19", "date_modify": "None", "date_publish": "2023-11-15 18:49:54", "description": "Ukraine announces ‘foothold’ on left bank of Dnipro River in Kherson region", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F15%2Frussia-ukraine-war-live-avdiivka-highly-costly-for-overall-russian-offensive-says-zelenskiy.json", "image_url": "https://i.guim.co.uk/img/media/1704f14ea4fc01fade303115e5feb73dd920337e/0_94_3268_1961/master/3268.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5e905928d446d62321096d66cb8d57c6", "language": "en", "localpath": null, "maintext": "From 15 Nov 2023 11.58 CET Russia says Ukrainian forces have crossed the River Dnipro but face 'hell fire' and death Ukrainian troops are trying to push back Russian forces along the Dnipro River in southern Kherson region, the military said on Wednesday, calling for operational “silence” along what it described as a “fairly fluid” frontline. Ukraine said on Tuesday it had secured a foothold on the Russian-occupied eastern bank of the vast river, for the first time confirming an advance that could open a new line of attack towards occupied Crimea. A Russian-installed official, Vladimir Saldo, said Moscow’s military had pinned down Ukrainian forces who crossed on to the river’s eastern bank and was raining “hell fire” on them. “Our additional forces have now been brought in. The enemy is trapped in (the settlement of) Krynki and a fiery hell has been arranged for him: bombs, rockets, heavy flamethrower systems, artillery shells, and drones,” Saldo said. “They (the Ukrainians) are sitting in basements and run from one basement to another at night. In the last two or three days alone, total enemy losses have totalled about a hundred fighters.” A Ukrainian advance on the Russian-held side of the Dnipro, a formidable natural barrier, would be a big setback for Russia’s occupation troops on the western side of a 1,000 km frontline. These reports have not yet been independently verified.\nUpdated at 12.12 CET\n15 Nov 2023 19.35 CET Posting on Telegram, Ukraine’s president, Volodymyr Zelenskiy, wrote: We are interested in a strategic partnership between Ukraine and the states of the African continent. Our relations should be based on mutual respect, respect for territorial integrity, sovereignty, language and traditions. Thank you to journalists from 11 African countries for our conversation and attention to Ukraine. I believe that in defense against aggression, in defence of international law, the world majority will always be with Ukraine.\n15 Nov 2023 19.00 CET Prague freezes Russia’s property on Czech territory The Czech Republic has frozen property owned by Russia on Czech soil, AFP reports. “All countries that haven’t yet done so should follow suit,” Ukraine’s foreign minister, Dmytro Kuleba, wrote on X, formerly Twitter. “Russian money should be used for Ukraine’s recovery instead of murder and destruction.” Jan Lipavský, the Czech foreign minister, said: At my suggestion, the government today approved the freezing of Russian state assets in the Czech Republic. The commercial activities from which Russia finances the murder of Ukrainians ends here. Czechia has just frozen all Russian state assets. I applaud this principled step and thank my counterpart and friend @JanLipavsky. All countries that haven’t yet done so should follow suit. Russian money should be used for Ukraine’s recovery instead of murder and destruction. https://t.co/7ReaTIj3xc — Dmytro Kuleba (@DmytroKuleba) November 15, 2023\nUpdated at 19.54 CET\n15 Nov 2023 18.09 CET A report in the Wall Street Journal has said that Ukrainian marines were reinforcing positions in three villages on the eastern bank of the Dnipro river, including armoured Humvees and at least one infantry-fighting vehicle, and had cut off one road that Russians used to resupply troops in the area.\nUpdated at 18.10 CET\n15 Nov 2023 17.39 CET Serhiy Lysak, the governor of the Dnipropetrovsk region, wrote on Telegram that Russia attacked Nikopolshchyna in the morning, hitting the “Marganets community” with heavy artillery. He said no one died or was injured.\n15 Nov 2023 16.55 CET The EU has proposed banning the export of machine tools and machinery parts that Russia uses to make weapons targeting Ukraine, documents seen by Bloomberg reveal. The proposal is contained in the EU’s 12th sanctions package, which also includes a ban on diamonds, the outlet reported.\n15 Nov 2023 16.29 CET Russia said that all vessels, including Russian ones, had free passage through the Baltic Sea and said that any attempt to violate international law on the free movement of shipping was dangerous, Reuters reports. Denmark will be tasked with inspecting and potentially blocking tankers carrying Russian oil through its waters under new EU plans, the Financial Times reported (see earlier post at 13.42). “I’ll just remind you … that all vessels, including Russian ones, have the right to free passage through the Baltic Straits,” Maria Zakharova, a spokesperson for the Russian foreign ministry, told reporters. “Any actions that contradict this violate international law,” she said. “And you know how dangerous that is.”\n15 Nov 2023 16.10 CET Russia says Ukrainian Nato membership is unacceptable in any form Russia has said that Ukrainian accession to the US-led Nato military alliance would be unacceptable, in part or in any other form, according to Reuters. “Whether in parts or in any form, Ukraine’s accession to Nato is unacceptable for Russia,” Maria Zakharova, spokesperson for Russia’s foreign ministry, told reporters. Anders Fogh Rasmussen, a former Nato secretary general, has put forward a proposal for Ukraine to join the military alliance without the territories controlled by Russia. Rasmussen has said the cause of Ukraine’s Nato membership cannot be deferred again next year. He said: “The time has come to take the next step and extend an invitation for Ukraine to join Nato. We need a new European security architecture in which Ukraine is in the heart of Nato.” Ex-Nato chief proposes Ukraine joins without Russian-occupied territories Read more\nUpdated at 16.19 CET\n15 Nov 2023 16.02 CET Russia’s foreign ministry has said that the EU’s 12th sanctions package against Russia is part of a “hybrid war” waged by the west, Reuters reports. “Due to the endless sanctions flow against Russia, the EU has become Washington’s ‘useful idiot’,” Maria Zakharova, the spokesperson for the Russian foreign ministry said. Zakharova said the US was using Europe as a “stick” in what she cast as Washington’s “anti-Russian” policy. Zakharova said the new sanctions would achieve nothing and said the west’s sanctions had damaged the EU itself.\nUpdated at 16.20 CET\n15 Nov 2023 14.42 CET Denmark will be tasked with inspecting and potentially blocking tankers carrying Russian oil through its waters under new EU plans, the Financial Times has reported, citing three unidentified sources. Russia sends about a third of its seaborne oil exports, or 1.5% of global supply, through the Danish straits, so any attempt to halt those supplies would send oil prices higher and could trigger a confrontation with Russia. The FT said Denmark would look for tankers carrying Russian oil that did not have western insurance, a step that would hit Russian oil export income hard while snarling up the entire Russian oil production and refinery business.\nUpdated at 14.48 CET\n15 Nov 2023 14.27 CET Ukraine’s president, Volodymyr Zelenskiy, has said he has spoken with Italy’s prime minister, Giorgia Meloni. He said they discussed defence cooperation and the need to speed up the adoption of the 12th EU package of sanctions on Russia, among other things. I spoke with @GiorgiaMeloni to express gratitude for her and Italy’s strong support for Ukraine.\nItaly is demonstrating powerful leadership, and I anticipate that its 2024 G7 Presidency will yield even more important results.\nWe coordinated our joint efforts and agreed to start… pic.twitter.com/bdg34AwD6x — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) November 15, 2023 In September, Meloni told a prank caller posing as an African leader that there was “a lot of tiredness” over the war in Ukraine and that she had some ideas up her sleeve on how to “find a way out”.\nUpdated at 14.34 CET\n15 Nov 2023 14.02 CET Russian missile kills two emergency workers in southern Ukraine as they put out fire, say officials A Russian missile killed two emergency workers in southern Ukraine on Wednesday as they put out a fire from an attack only minutes earlier, Ukrainian officials said (this is an update from an earlier post at 11.48). At least seven other people were injured in the strikes in the Zaporizhzhia region, in which Russian forces fired three missiles in about half an hour, the regional governor, Yuriy Malashko, said. He said a civilian facility had been hit but gave no details, and said that homes and cars nearby had been damaged. Rescue workers had rushed to the scene after the first strikes but another attack followed, the interior minister, Ihor Klymenko, wrote on Telegram. “Employees of the State Emergency Service were already at the scene in a matter of minutes. Then the [Russian] invaders struck again,” he said, adding that the two men killed were aged 31 and 34. He said the injured included three emergency workers and four civilians. These claims are yet to be independently verified.\nUpdated at 14.09 CET\n15 Nov 2023 13.35 CET Nato to modernise surveillance jets in face of Russia threat Nato has announced it will buy six Boeing aircraft to replace its ageing fleet of AWACS surveillance planes, bolstering the alliance’s capabilities to track the threat from Russia, AFP reports. “The production of the six new Boeing E-7A Wedgetail aircraft is set to begin in the coming years, with the first aircraft expected to be ready for operational duty by 2031,” Nato said. Nato said the joint acquisition by its members represented one of the alliance’s “biggest-ever capability purchases”, but did not give the overall cost. The jets will be operated centrally by the alliance, likely out of its Geilenkirchen airbase in Germany, with intelligence shared among the 31 members. “Equipped with a powerful radar, the aircraft can detect hostile aircraft, missiles and ships at great distances and can direct Nato fighter jets to their targets,” the alliance said. ❝Surveillance and control aircraft are crucial for NATO’s collective defence and I welcome Allies’ commitment to investing in high-end capabilities❞\n— @jensstoltenberg\nTap the image for info on NATO's next generation command and control aircraft, Boeing’s E-7A Wedgetail — NATO (@NATO) November 15, 2023\nUpdated at 14.08 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Russia confirms Ukrainian troops have crossed Dnipro River - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/15/russia-ukraine-war-live-avdiivka-highly-costly-for-overall-russian-offensive-says-zelenskiy"}