{"authors": [], "date_download": "2024-02-05 15:40:23", "date_modify": "None", "date_publish": "2023-11-15 05:09:39", "description": "President Joe Biden and Chinese President Xi Jinping are expected to agree to restore some military-to-military communications between their armed forces", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fchina-ap-joe-biden-defense-department-xi-jinping-b2447496.html.json", "image_url": "https://static.independent.co.uk/2023/11/14/23/Biden_APEC_91215.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPresident Joe Biden and Chinese President Xi Jinping are expected to agree Wednesday to restore some military-to-military communications between their armed forces when they meet on the sidelines of the Asia-Pacific Economic Cooperation summit in San Francisco.\nThe plan is to revive the regular talks under what’s known as the Military Maritime Consultative Agreement, which until 2020 had been used to improve safety in the air and sea, said a U.S. official, who requested anonymity to preview the leaders’ expected announcement.\nU.S. military leaders have expressed repeated concerns about the lack of communications with China, particularly as the number of unsafe or unprofessional incidents between the two nations’ ships and aircraft has spiked.\nAccording to the Pentagon's most recent report on China's military power, Beijing has “denied, canceled or ignored” military-to-military communications and meetings with the Pentagon for much of last year and this year. The report warns that the lack of such talks “raises the risk of an operational incident or miscalculation spiraling into crisis or conflict.”\nThe U.S. views military relations with China as critical to avoiding any missteps and maintaining a peaceful Indo-Pacific region. Here's a look at the often fraught relationship between the U.S. and Chinese militaries.\nA DECADE OF TALKS AND VISITS\nMore than 15 years ago, the Defense Department was making progress in a growing effort to improve relations with Beijing as both sides stepped up military activities in the Indo-Pacific.\nThe U.S. was concerned about Beijing's dramatic and rapid military growth. And China was suspicious of America's expanding presence in the region. In an effort to improve transparency and communication, defense leaders from the two countries were meeting regularly. And in a 2008 speech in Singapore, then-Defense Secretary Robert Gates noted that relations with China had improved, and that a long-sought direct telephone link between the U.S. and China had finally been established. He said he had used it to speak with the defense minister.\nHe and other defense chiefs, Joint Chiefs chairmen and regional high-level U.S. commanders routinely traveled to China over the next decade, and Chinese defense leaders came to the Pentagon. “We don’t want miscalculations and misunderstandings and misinterpretations. And the only way you do that is you talk to each other,” noted then-Defense Secretary Chuck Hagel in 2013.\nThe following year Hagel made a historic visit to Yuchi Naval Base and became the first foreign visitor to go aboard China's first aircraft carrier as it was docked at the base.\nThe Defense Department's 2014 report on China's military power referred to “sustained positive momentum” in U.S. ties with Beijing, and noted there was a growing number of agreements, conferences, calls and military exercises. It said the two militaries established new channels for dialogue and signed two agreements to improve transparency and reduce the risks of unintended miscalculations by ships and aircraft in the Pacific.\nBUT TENSIONS PERSISTED\nEven as military leaders were meeting, the Obama administration's widely touted “pivot to the Pacific,\" which added troops, ships and other U.S. military activity in the region, triggered vehement criticism from Beijing. And China's aggressive campaign to militarize a number of manmade islands in the South China Sea alarmed the U.S. and other allies in the Pacific.\nAllies worried that China would seek to limit international transit through the region, and that the islands could be used as bases for military action. In 2018, the Trump administration abruptly withdrew an invitation for Beijing to participate in the military exercise known as Rim of the Pacific, citing what it called strong evidence that China had deployed weapons systems on the islands. China has argued that it is within its rights to build up defenses in the South China Sea on what it believes is its sovereign territory.\nThe Pentagon routinely complained that there was little tangible progress in the press for greater transparency in China’s military ambitions and its burgeoning defense budget. And China bristled at America's continued support for Taiwan, the self-governing island that Beijing views as its own.\nMore broadly, the U.S. issued sharp condemnations of China's escalating cyberattacks targeting government agencies and breaches and cyberespionage into sensitive defense programs.\nTHEN CAME THE PANDEMIC AND PELOSI\nDirect military contacts with Beijing dropped off during the COVID-19 pandemic, due both to travel restrictions and tensions over China’s potential responsibility for the deadly virus that began within its borders. And in August 2022, Beijing suspended all military contacts with the U.S., in the wake of former House Speaker Nancy Pelosi’s visit to Taiwan.\nPelosi was the highest-ranking American lawmaker to visit Taiwan since 1997, when then-Speaker Newt Gingrich traveled there. And her visit sparked a surge in military maneuvers by China. Beijing dispatched warships and aircraft across the median line in the Taiwan Strait, claiming the de facto boundary did not exist, fired missiles over Taiwan itself, and challenged established norms by firing missiles into Japan’s exclusive economic zone.\nU.S. officials suggested China was simply using Pelosi’s visit as a convenient excuse to cut off ties, which were strained by other points of contention, including economic sanctions.\nBut the lack of communications heightened worries about an increase in what the Pentagon calls risky Chinese aircraft and warship incidents in the past two years. Officials noted that even as tensions with Russia have spiked over the war in Ukraine, military commanders have continued to use a telephone line to deconflict operations in Syria.\nThe Defense Department last month released video footage of some of the more than 180 intercepts of U.S. warplanes by Chinese aircraft that have occurred in the past two years — more than the total number over the previous decade. Defense officials said the Chinese flights were risky and aggressive, but stopped short of calling most of them unsafe — a term used in egregious cases. They said this was part of a larger trend of regional intimidation by China that could accidentally lead to conflict.\nCarolyn Bartholomew, chairwoman of the congressionally mandated U.S.-China Economic and Security Review Commission, said a key goal for the administration should be to get a commitment from the Chinese government to scale back on such dangerous incidents.\nTHE MARITIME AGREEMENT\nBonnie Lin, director of the China Power project at the Center for Strategic and International Security, a Washington-based think tank, said it was important to restart the talks under the maritime agreement.\nResumption \"would be a signal that the two sides can work together more,” Lin said at a CSIS forum Tuesday.\n___\nAssociated Press writer Tara Copp contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Biden aims for improved military relations with China when he meets with Xi", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/china-ap-joe-biden-defense-department-xi-jinping-b2447496.html"}