{"authors": ["Nick Craven", "Gemma Parry"], "date_download": "2024-02-05 15:40:25", "date_modify": "None", "date_publish": "2023-11-15 22:32:28", "description": "The IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base, with spokesman Lt Col Jonathan Conricus showing a duffel bag full of guns and ammo", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12754547%2Fisrael-evidence-hamas-gaza-al-shifa-hospital-terrorist-base.html.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/21/77850645-0-image-a-77_1700084918710.jpg", "language": "en", "localpath": null, "maintext": "But they admitted no major control centre or tunnels have yet been found\nIsrael has claimed to have found 'concrete' evidence that Gaza's biggest hospital Al Shifa was being used as a terrorist base after hundreds of commandos raided it early yesterday.\nThe IDF revealed evidence of weaponry which it said proved the hospital was a terrorist base, with spokesman Lt Col Jonathan Conricus showing a duffel bag hidden behind a hospital MRI machine containing an AK47 assault rifle, grenades, ammunition and a uniform.\nHe also said a backpack contained 'what appeared to be very important intelligence including a laptop', and added that security cameras in one part of the hospital had been taped over.\nBehind another MRI machine more weapons were said to have been found and in an adjoining room on top of another MRI scanner was a bag containing 'full military kit for one terrorist, including ammunition, a live grenade and AK47 and body armour'.\n'These weapons have no business being in a hospital,' Conricus said as he toured the hospital in a clip released by the IDF.\nInside a cabinet for medical equipment was another holder containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman.\nBut the IDF's search showed no signs of tunnels or a sophisticated command centre that many believed would be discovered underneath the facility.\nIDF spokesperson Lt. Col. Conricus shows weapons and equipment which he says were found at Al Shifa hospital complex\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nWeapons and equipment which Israel's army says were found at Al Shifa hospital complex\nInside a cabinet for medical equipment was another holdall containing a knife, a Hamas emblem, AK47 and ammunition, according to the spokesman\nIn this image taken from a video released by the Israeli Defence Forces, on Wednesday, Lt. Col. Jonathan Conricus, an Israeli military spokesman, holds up a bullet proof vest with a Hamas insignia that was found along with weapons the IDF says were found in a medical closet at the MRI center at al-Shifa hospital in Gaza City\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Palestinian Islamist group Hamas\nNews of the IDF hospital raid came around 2am local time on Wednesday.\nDoctors said they were given 30 minutes' notice of the Israeli operation before at least six battle tanks moved in on the complex. Troops entered the hospital a short time afterwards.\nOfficials from Israel and Gaza presented very different accounts of what was happening in the hospital.\nThe Israeli army released video showing soldiers carrying boxes labelled as 'baby food' and 'medical supplies,' while health officials talked of terrified staff and patients as troops moved through the buildings.\n'We have discovered weapons and other things. We entered the hospital on the basis of actionable intelligence,' Mark Regev, an advisor to the Israeli Prime Minister said.\nAnother senior Israeli government official, who declined to be named, said: 'IDF (Israel Defence Forces) soldiers have already found weapons and other terror infrastructure. We saw concrete evidence that Hamas terrorists used the Shifa hospital as a terror headquarters.'\nBut the Palestinian Authority in the West Bank condemned the military operation as 'a crime against humanity' and challenged Israel to produce proof of their claims.\nThe Israeli military said it was carrying out a 'precise and targeted operation against Hamas in a specified area in the hospital,' and that its soldiers were accompanied by medical teams bringing in incubators and other supplies.\nIt added that forces were also searching for hostages.\nIn a statement, the IDF said: 'As the soldiers entered the hospital complex, they engaged with a number of terrorists and killed them.\n'Following this, during searches in one of the departments of the hospital, the troops located a room with technological assets, along with military and combat equipment used by the Hamas terrorist organization.\n'In another department in the hospital, the soldiers located an operational command center and technological assets belonging to Hamas, indicating that the terrorist organization uses the hospital for terrorist purposes.\nThis image taken from a video released by the Israeli Defense Forces, Wednesday, Nov. 15, 2023, shows a bullet proof vest with a Hamas insignia that was found along with weapons the IDF says were found in a medical closet at the MRI center at al-Shifa hospital in Gaza City\nThis image taken from a video released by the Israeli Defense Forces, on Wednesday shows a cache of weapons the IDF says were found in a closet at the MRI center at al-Shifa hospital in Gaza City\nVideo grabs appear to show medics evacuating patients from Al Shifa hospital during raid\nThe IDF said Israeli troops delivered medical supplies to the Al Shifa hospital as pictured here\nAt Al-Shifa, doctors said patients and people taking shelter were stranded in horrific conditions in the facility\n'The technological assets and extensive intelligence information located was transferred for full review by the relevant authorities.\n'The IDF is continuing to operate in the hospital complex, while extracting intelligence information and preventing harm to the medical teams and civilians sheltering there'.\nThe military previously said its forces have found weapons and Hamas fighters in government buildings, schools and residential buildings.\nHours before the hospital raid, the United States said its own intelligence indicated militants have used Shifa and other hospitals, and tunnels beneath them, to support military operations and hold hostages.\nUnder international humanitarian law, hospitals can lose their protected status if combatants use them for military purposes.\nBut civilians must be given time to leave, and any attack must be proportional to the military objective.\nSpeaking on CNN, IDF spokesman Lt Col Richard Hecht said fire was exchanged before Israeli soldiers moved into the Al-Shifa but that there was 'no engagement whatsoever' once they had entered the medical complex.\nIsrael has insisted for years that Hamas militants have used Al Shifa as a cover for their operations. But Hamas and hospital staff have repeatedly denied this.\nOne doctor inside the hospital, reached by the BBC, hit out: 'Is everyone just waiting for us to die here and then say 'we were good people'?'\nPlastic surgeon Dr Ahmed Mokhallalati claimed staff and patients were fearful as IDF troops moved through the building. He revealed six premature babies had died in recent days and said around 40 others would die 'one by one' due to a lack of oxygen and power outages.\nIsraeli soldiers walk at the Al Shifa hospital complex, amid their ground operation against Hamas in this still image from handout video obtained November 15, 2023\nSmoke rises during an Israeli military bombardment of the northern Gaza Strip on November 15\nn Israeli soldier holds a weapon in Gaza City earlier this week\nEssential surgeries were carried out on Tuesday with only light sedation, revealed the surgeon – but patients were 'screaming in pain'. No surgery could be carried out yesterday, he said.\nOne patient with burns had to be left to die due to a lack of medical equipment, said the doctor. Asked if Israeli troops had brought medical aid to the hospital, he said: 'If it was up to me, I would refuse [any aid]. They are killing us for 40 days and they want to offer me saline drips.'\nDr Mokhallalati also insisted there were only civilians in the hospital and challenged the Israeli army to provide proof of Hamas's presence. Israeli officials have previously suggested some of the 240 hostages seized by Hamas when they went on a murderous rampage in Israel on October 7 could be held under Gazan hospitals.\nOne journalist inside the hospital told the BBC that IDF soldiers fired into the air and used loudspeakers to order men aged between 16 and 40 to leave before interrogating them.\nMunir al-Boursh, a senior official with Gaza's Health Ministry inside the hospital, said troops ransacked the basement and other buildings, including those with emergency and surgery departments inside, and searched for tunnels.\nPatients, staff and people sheltering in the facility were questioned, he said, adding: 'Patients, women and children are terrified'.\nAt one point, tens of thousands of Palestinians were sheltering at the hospital, but many have left in recent days.\nThe raid drew condemnation from the UN, Jordan and the West Bank's Palestinian Authority, which called it a violation of international law.\nMartin Griffiths, the UN's chief of humanitarian affairs, said on X, formerly Twitter: 'I'm appalled by reports of military raids in Al-Shifa hospital in Gaza. The protection of newborns, patients, medical staff and all civilians must override all other concerns. Hospitals are not battlegrounds.'\nIsrael has faced mounting pressure to prove its claim that Hamas had turned the hospital into a command centre in recent days.\nHamas and Gaza health officials have denied that militants operate in Shifa, according to the Palestinian news agency.\nThe war between Israel and Hamas erupted on October 7 after the militant group killed some 1,200 people and seized around 240 captives. Meanwhile, Israeli airstrikes have killed more than 11,200 people, according to the Palestinian Health Minister in Ramallah.\nAnother 2,700 have been reported missing.\nAround two third of the territory's 2.3 million people have now fled their homes, with most currently residing in the southern part of the coastal strip.\nSmoke rises during an Israeli military bombardment of the northern Gaza Strip today\nPalestinian man Mohammad Abu Daqa, who survived Israeli strikes that killed 8 family members last month\nPalestinians look at destruction after Israeli strikes on Rafah, Gaza Strip today\nPeople search through buildings, destroyed during Israeli air strikes a day earlier, in the southern Gaza Strip today\nPalestinians look for survivers in buildings destroyed in the Israeli bombardment of the Gaza Strip last month\nCivil defence teams and civilians conduct a search and rescue operation under the rubbles of demolished buildings after an Israeli attack hits Hamdan family's residence in Khan Yunis, Gaza\nThe ruins after Israeli bombardment at Jabalia refugee camp in Gaza City, Gaza earlier this week\nResidents say bread is scarce and supermarket shelves are bare, while families have been forced to cook on wood fires due to a lack of fuel, electricity and running water.\nOn Wednesday, Israeli defence officials let in some 24,000 litres of fuel, which will only be used for the UN agency for Palestinian refugees, known as UNRWA, in a bid to bring in the limited supplies of food and medicine from Egypt.\nThomas White, UNRWA's director in Gaza, said the fuel cannot be used for hospitals or to desalinate water, adding the amount is the equivalent of 'only nine per cent of what we need daily to sustain lifesaving activities'.\nThe Palestinian telecom company Paltel has said it is relying on batteries to keep Gaza's mobile and internet network running.\nIt comes as Israeli troops have extended their control across northern Gaza, having taken control of the Shati refugee camp.\nDefence Minister Yoav Gallant said that the ground operation will eventually 'include both the north and south'.\n'We will strike Hamas wherever it is', he said.\nPrime Minister Benjamin Netanyahu echoed the plans, saying Israel's goal is 'a complete victory over Hamas in the south and the return of our hostages.'\nIsrael told residents of northern Gaza to evacuate south, saying it wanted to get civilians out of the path of its ground assault, and hundreds of thousands fled.\nIt comes after the UN Security Council approved a resolution calling for 'urgent and extended humanitarian pauses and corridors throughout the Gaza strip following four failed attempts to respond to the war.\nThe resolution, which was approved by 12-0 with the US, UK and Russia abstaining, also called for the 'immediate and unconditional release of all hostages held by Hamas and other groups'.\nIt made no mention of a ceasefire, and failed to refer to the October 7 attacks which sparked the conflict, or Israel's retaliatory air strikes.\nThe resolution brought the 15 members of the UN's most powerful body together in a first response to the ongoing war.\nIt asks that 'all parties comply with their obligations under international law, notably with regard to the protection of civilians, especially children'.\nUN Security Council resolutions are legally binding, but in practice many parties choose to ignore the council's requests for action.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli troops show what they claim is 'concrete' evidence that Hamas was using Gaza's Al Shifa hospital as a terrorist base - but admit they have not yet found tunnels or an advanced command centre", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12754547/israel-evidence-hamas-gaza-al-shifa-hospital-terrorist-base.html"}