{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com"], "date_download": "2024-02-05 15:40:26", "date_modify": "None", "date_publish": "2023-11-15 18:42:51", "description": "The USS Thomas Hudner, Arleigh Burke-class guided-missile destroyer, shot down a drone launched from Yemen while operating in the Red Sea, according to a report on Wednesday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12754025%2FThomas-Hudner-drone-Yemen-Houthi.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/15/18/77843539-0-image-a-9_1700073759584.jpg", "language": "en", "localpath": null, "maintext": "The USS Thomas Hudner, an Arleigh Burke-class guided-missile destroyer, shot down a drone launched from Yemen while operating in the Red Sea on Wednesday.\nA Pentagon official told DailyMail.com that the Hudner’s crew 'engaged and shot down the drone to ensure the safety of US personnel,' adding that there were no US casualties or any damage to the ship.\nThe official confirmed that the drone originated in Yemen and was heading toward the ship, which was operating in international waters. It's unclear whether the drone was armed or how close it came to the ship before being shot down.\nThe incident follows a wave of drone and missile attacks against US forces in Iraq and Syria, launched by Iran's proxy militias in retaliation for America's support of Israel in its war against Hamas.\nIn Yemen, Iran backs and supplies the Houthis, a Shiite faction that has been at war against a Saudi-led Sunni coalition in the country since 2015.\nThe USS Thomas Hudner (above), an Arleigh Burke-class guided-missile destroyer, shot down a drone launched from Yemen while operating in the Red Sea on Wednesday\nMock Houthi drones and missiles are displayed at a square in Sana'a, Yemen earlier this month\nThe Houthis have emerged as a major military force in the Arabian Peninsula, with tens of thousands of fighters and a huge arsenal of ballistic missiles and armed drones.\nWednesday's incident is only the second time the United States has brought down projectiles near its warships since the Israel-Hamas conflict began.\nLast month, another US warship intercepted four cruise missiles and 15 drones launched by the Houthi movement from Yemen towards Israel.\nYemen's Houthi leader said on Tuesday his forces would continue its attacks on Israel, and that they could target Israeli ships in the Red Sea and the Bab al-Mandeb Strait.\nLast week, the Houthis shot down a US military MQ-9 drone while it was in international airspace.\nThe US has sent a significant amount of naval power to the Middle East in the past month, including two aircraft carrier strike groups and thousands of US troops.\nThe USS Thomas Hudner is part of the Gerald R. Ford Carrier Strike Group and is currently operating in the Middle East after reportedly transiting the Suez Canal over the weekend.\nUS and coalition troops have been attacked by missiles and drones at least 55 times in Iraq and Syria since October 17, injuring 59 personnel, though all have returned to duty, a defense official told DailyMail.com on Wednesday.\nThe Iran-backed militant groups claiming responsibility for the attacks have said they are in response to US support for Israel in its war against Hamas in Gaza.\nUS and coalition troops have been attacked at least 55 times in Iraq and Syria since October 17, injuring 59 Americans, though all have returned to duty\nThe Gerald R. Ford and Dwight D. Eisenhower Carrier Strike Groups are seen conducting joint operations in the Eastern Mediterranean last week in a show of US naval force\nA pro-Palestinian demonstration is seen in Houthi-dominated Sanaa, Yemen earlier this month\nTwo Air Force F-35A Lightning II fighter jets fly alongside amphibious assault ship USS Bataan (background) and guided-missile destroyer USS Thomas Hudner (foreground) in a file photo\nThe escalating violence in Syria and Iraq is raising concerns that the Israel-Hamas conflict could widen into a regional conflict, with US troops at bases throughout Middle East becoming targets.\nThe United States has so far carried out three sets of air strikes against Iran-linked militia in Syria in response to a series of attacks against U.S. troops in Iraq and Syria.\nThe latest strikes, carried out by Air Force F-15E fighter jets on Sunday , targeted an Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin\nThe US still has about 900 troops in Syria, and 2,500 more in neighboring Iraq, to advise and assist local forces trying to prevent a resurgence of Islamic State, which was defeated after seizing large swathes of both countries.\nIn recent weeks, US forces in Iraq and Syria have come under nearly daily bombardment from Iran-backed militants, who operate under the umbrella brand of the Islamic Resistance in Iraq.\nSunday's airstrike against Iranian assets in Syria was the latest such US counterstrike to degrade and deter Iran's proxy forces.\nIn a statement, US Defense Secretary Lloyd Austin said President Joe Biden had ordered Sunday's strikes.\n'The President has no higher priority than the safety of US personnel, and he directed today's action to make clear that the United States will defend itself, its personnel, and its interests,' said Austin.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "USS Thomas Hudner shoots down drone launched from Yemen over the Red Sea in act of self-defense", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12754025/Thomas-Hudner-drone-Yemen-Houthi.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}