{"authors": [], "date_download": "2024-02-05 15:40:28", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "At least 300,000 people marched in the British capital on Saturday demanding an immediate ceasefire in Gaza Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030439%2F300000-march-for-palestine-in-london-videos.json", "image_url": "https://cdn.bignewsnetwork.com/YWI5YmJjYTMtOGU.jpg", "language": "en", "localpath": null, "maintext": "Police accused right-wing counter-protesters of sparking \"extreme violence\" on Armistice Day\nAt least 300,000 people marched in the British capital on Saturday demanding an immediate ceasefire in Gaza. London Metropolitan Police reported at least 126 arrests amid clashes with counter-protesters in which nine officers were injured.\nThe largely peaceful crowds chanted \"free Palestine,\" \"ceasefire now,\" and \"from the river to the sea, Palestine will be free,\" as they marched through the streets of London. The largest demonstration to date took place on Armistice Day.\nAhead of the pro-Palestinian march, a group of right-wing protesters, mainly consisting of football hooligans from across the UK, arrived in central London on the pretext of protecting monuments, but \"were already intoxicated, aggressive and clearly looking for confrontation,\" assistant commissioner Matt Twist said in a statement.\nThe violent crowd, which chanted \"you're not English any more,\" rained abuse on the officers, who were protecting the Cenotaph and preventing the counter-protesters from confronting the pro-Palestinian activists.\n\"Nine officers were injured during the day, two requiring hospital treatment with a fractured elbow and a suspected dislocated hip. Those officers were injured on Whitehall as they prevented a violent crowd getting to the Cenotaph while a remembrance service was taking place,\" police said, adding: \"the extreme violence from the right wing protestors towards the police today was extraordinary and deeply concerning.\"\nThe Palestine Solidarity Campaign march, which the organizers estimated to be at least 500,000-strong, \"did not see the sort of physical violence carried out by the right wing,\" according to police, though a fringe group of around 150 masked people was intercepted while firing fireworks. Several arrests were made \"after some of the fireworks struck officers in the face,\" police said.\nThe unrest follows the debate earlier this week whether the pro-Palestinian protest should be permitted on Armistice Day, which is observed in the UK by two minutes of silence during the 11th hour of the 11th day of the 11th, marking the end of WWI in 1918.\nHome Secretary Suella Braverman was accused of fueling tensions by calling the pro-Palestinian demonstrations \"hate marches,\" while accusing the police of bias for letting the rally go ahead.\nLondon Mayor Sadiq Khan said the clashes were \"encouraged and emboldened\" by senior politicians \"like the Home Secretary\" and were a \"direct result\" of her words.\nPrime Minister Rishi Sunak condemned the violence and hatred on both sides, and called for the nations \"to come together\" to remember \"those who fought and died for our freedom.\"\nFollow LIVE UPDATES for more information", "source_domain": "www.theuknews.com", "text": null, "title": "300,000 march for Palestine in London (VIDEOS)", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030439/300000-march-for-palestine-in-london-videos"}