{"authors": [], "date_download": "2024-02-05 15:40:29", "date_modify": "None", "date_publish": "2023-11-14 01:04:33", "description": "South Korean President Yoon Suk Yeol says he will discuss international response to the purported North Korean-Russian weapons deal during the Asia-Pacific Economic Cooperation summit in San Francisco this week", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fnorth-korea-ap-south-korea-apec-russia-b2446735.html.json", "image_url": "https://static.independent.co.uk/2023/11/14/01/Koreas_Tensions_Yoon_38259.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nSouth Korean President Yoon Suk Yeol slammed the purported illicit arms deal between North Korea and Russia, saying he’ll emphasize its far-reaching security implications and discuss international response during the Asia-Pacific Economic Cooperation summit in San Francisco this week.\nIn written responses to questions from The Associated Press ahead of the APEC meeting, Yoon also said that North Korean provocations will invite immediate retaliation by South Korean and U.S. forces. There are concerns that North Korea might miscalculate and make a move against the South while the world is focused on the conflicts in the Middle East and Ukraine.\n“An effective way to prevent North Korea from miscalculating is to demonstrate our robust deterrence capabilities and determination towards North Korea based on the solid (South Korea) -U.S. joint defense posture,” Yoon said.\n“North Korea’s provocations will not only fail to achieve its intended goal but also result in immediate and strong retaliation from (South Korea)-U.S. alliance,” he said.\nThere are concerns that Russia’s protracted war on Ukraine and the raging conflict between Israel and Hamas are adding to complexities and uncertainties over the security situation on the Korean Peninsula.\nSome experts say North Korea’s reported pursuit of sophisticated Russian weapons technologies in return for its supply of conventional arms for Russia's war in Ukraine could help the North modernize its nuclear-capable missiles targeting South Korea and the U.S. The experts also worry that Washington's preoccupation with Ukraine and Israel might prompt North Korea to conclude that the U.S. security posture on the Korean Peninsula has weakened and launch surprise attacks or other provocations against South Korea.\nSince taking office in May last year, Yoon, a conservative, has made a reinforced military partnership with the U.S. the center of his foreign policy in response to North Korea’s evolving nuclear threats. Since his inauguration, Yoon said that North Korea has test-launched a total of 87 ballistic missiles.\nDespite this, many foreign analysts assess North Korea still doesn't possess functioning nuclear-tipped missiles. But they say that Russian support could help North Korea overcome the last remaining technological hurdles to acquire such weapons.\nBoth North Korea and Russia have dismissed as groundless the speculated weapons transfer deal, which would violate U.N. Security Council resolutions that ban any arms trade to and from North Korea.\n“These two countries’ military cooperation ... not only poses a serious threat to the security of the Korean Peninsula, Northeast Asia and Europe but also undermines the universal rules-based international order,” Yoon said.\nAt meetings with many world leaders during the 21-member APEC meeting, Yoon said he’ll underscore such diverse security threats posed by the “illegal” North Korean-Russian cooperation and discuss ways to strengthen cooperation.\nOne area where North Korea is believed to be receiving Russian technological assistance is a spy satellite launch program. After two consecutive failures to put its first military spy satellite into orbit in recent months, North Korea vowed to make a third launch attempt in October. But it didn’t follow through. South Korean officials suspect it that was likely because North Korea has begun receiving Russian help.\nYoon said the main objective of North Korea’s spy satellite launch, which involves a rocket, is to advance its nuclear delivery vehicle. He cited U.N. bans on any satellite launches by North Korea, because the world body views them as cover for testing its long-range missile technology. North Korean leader Kim Jong Un previously said he needed a spaced-based surveillance system to better monitor South Korean and U.S. activities and enhance the attack capability of his nuclear missiles.\n“If North Korea succeeds in launching the military reconnaissance satellite, it would signify that North Korea’s ICBM (intercontinental ballistic missile) capabilities have been taken to a higher level,” Yoon said. “Therefore, we will have to come up with reinforced countermeasures.”\nYoon said the recent Seoul visits by U.S. Secretary of State Antony Blinken and Secretary of Defense Lloyd Austin serve as an opportunity to demonstrate the strength of the South Korea-U.S. alliance. Observers say such back-to-back visits by top U.S. officials suggest the U.S. security commitment remains strong despite the conflicts in the Middle East and Ukraine.\nBlinken told reporters in Seoul last week that he and his South Korean counterpart, Park Jin, discussed unspecified further actions the two countries can take with others to put more pressures on Russia not to transfer military technology to North Korea. Austin said Monday that the U.S. deterrence commitment to South Korea remains ironclad and includes a full range of America’s nuclear, conventional and missile defense capabilities.\n“By building upon the ironclad (South Korea)-U.S. alliance, the Korean government is acquiring overwhelming response capabilities and a retaliation posture to establish a strong security stance,” Yoon said.\nYoon said that current global challenges -- arising from the war in Ukraine, the Israel-Hamas conflict, the climate crisis and high inflation – offer an opportunity for APEC to demonstrate its leadership again by spearheading efforts to overcome crises and to spur innovation through regional cooperation.\n“I will urge the member economies to work together in the spirit of stronger solidarity and cooperation to advance trade and investment liberalization, innovation and digitalization as well as inclusive and sustainable growth,” he said.\nYoon said the wars in Ukraine and the Middle East have left energy security vulnerable. He said the global economy is becoming further fragmented by the weaponization of economic resources, and that supply chain risks pose the biggest obstacle to regional economic development.\n“The Asia-Pacific region must endeavor to become a free space where people, money and data as well as goods and services flow without disruption,” Yoon said.\nHe also stressed the need to establish new norms for digital ethics that match the era of hyper digitalization.\n“Since digital technology knows no borders and has connectivity and immediacy, it is necessary to establish universal norms that can be applied to everyone in the international community,” he said.\n___\nFollow AP's Asia-Pacific coverage at https://apnews.com/hub/asia-pacific", "source_domain": "www.independent.co.uk", "text": null, "title": "South Korea's Yoon will warn APEC leaders about the risks of a Russia-North Korea arms deal", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/north-korea-ap-south-korea-apec-russia-b2446735.html"}