{"authors": [], "date_download": "2024-02-05 15:40:34", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "As part of Taipei efforts to further boost its case to join a major pan-Pacific free trade pact and enhance ties with European countries, this week, Taiwan and the UK signed an \"Enhanced Trade Partner", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030563%2Ftaiwan-uk-sign-enhanced-trade-partnership.json", "image_url": "https://cdn.bignewsnetwork.com/cus1699591427025.jpg", "language": "en", "localpath": null, "maintext": "TAIPEI, Taiwan: As part of Taipei efforts to further boost its case to join a major pan-Pacific free trade pact and enhance ties with European countries, this week, Taiwan and the UK signed an \"Enhanced Trade Partnership.\"\nDespite having no formal relations, Taiwan considers the UK an important democratic partner, noting London's concerns over increased Chinese military activities near the island, which Beijing considers its own territory, and its support for Taiwan's participation in global bodies, such as the World Health Organization.\nAs a result of Beijing's efforts to isolate it diplomatically, major chip-maker Taiwan has few formal foreign trade agreements despite being a member of the World Trade Organization and having free trade agreements with Singapore and New Zealand.\nThe Taiwanese and British economies were complimentary, and the deal would \"enhance the confidence of other countries in the world to interact with us,\" said John Deng, Taiwan's lead trade negotiator.\nTaiwan's Office of Trade Negotiations said the agreement with the UK is a model for other European countries to improve their trade ties with the island.\nTaiwan has also applied to join the 11-country Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which the UK officially joined in July.\n\"Given its status as the newest member of the CPTPP, improving economic relations with the UK is also crucial for Taiwan's application to join this landmark trade pact,\" Deng said.\nAccording to the UK government, the bilateral trade between Taiwan and the UK totaled £8.6 billion ($10.56 billion) in 2022.", "source_domain": "www.theuknews.com", "text": null, "title": "Taiwan, UK sign 'Enhanced Trade Partnership'", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030563/taiwan-uk-sign-enhanced-trade-partnership"}