{"authors": [], "date_download": "2024-02-05 15:40:35", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Apple Chief Executive Officer Tim Cook on Sunday extended wishes on the occasion of Diwali.", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030282%2Fapple-ceo-tim-cook-extends-greetings-on-diwali.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699774033.jpg", "language": "en", "localpath": null, "maintext": "California [US], November 12 (ANI): Apple Chief Executive Officer Tim Cook on Sunday extended wishes on the occasion of Diwali.\nApple CEO Coo wished everyone that their celebrations were filled with warmth, prosperity and the joy of being together.\nTaking on his social media X, Tim Cook stated, \"Happy Diwali! May your celebrations be filled with warmth, prosperity, and the joy of being together. Shot on iPhone 15 Pro Max by Chandan Khanna.\"Cook also shared an image showing children holding sky lamps, ready to free them in the air.\nPrime Minister Narendra Modi on Sunday gave his best wishes to the people of the country on the auspicious occasion of Diwali and expressed hope that the festival would bring happiness, prosperity and good health to everyone.\nIn a post on the social media app X, the Prime Minister posted, \"Wishing everyone a Happy Diwali! May this special festival bring joy, prosperity and wonderful health to everyone's lives.\"In an earnest expression of delight, Prime Minister Modi on Saturday acknowledged the nation's radiant celebration of Diwali, emphasising the vivid illumination in every household attributed to the government's public welfare schemes.\nDiwali is observed on Amavasya (or the new moon), the 15th day of the month of Kartik, every year. This year, Diwali will be celebrated on Sunday (November 12).\nThe festival is also known as the 'festival of lights', and is the symbol of the victory of light over darkness and good over evil. Hence, this festival holds cultural and spiritual significance.\nOther world leaders also extended greetings on the auspicious occasion of Diwali.\nOfficials from across the world included, UK Prime Minister Rishi Sunak, British High Commissioner to India, Alex Ellis, New York State Senator Kevin Thomas, US Vice President Kamala Harris and her husband, Doug Emhoff. (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Apple CEO Tim Cook extends greetings on Diwali", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030282/apple-ceo-tim-cook-extends-greetings-on-diwali"}