{"authors": [], "date_download": "2024-02-05 15:40:36", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The British High Commission in India on Sunday extended wishes to people on the occasion of Diwali.", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030237%2Fbritish-high-commission-in-india-extends-wishes-to-people-on-diwali.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699769120.jpg", "language": "en", "localpath": null, "maintext": "New Delhi [India], November 12 (ANI): The British High Commission in India on Sunday extended wishes to people on the occasion of Diwali.\nTaking to X, the British High Commission in India stated, \"From our UKinIndia family to yours. We wish everyone celebrating a safe, prosperous and happy Diwali. Shubh Deepawali.\"Earlier on Saturday, UK Prime Minister Rishi Sunak extended Diwali wishes with a message of looking to the \"future with hope\". He also wished people on Bandi Chhor Divas.\nBritish High Commission posted Sunak's message on X. In the message, Sunak stated, \"Happy Diwali to all those celebrating around the world and across the UK, and a very happy Bandi Chhor Divas to our friends in the Sikh community.\"\"With the lighting of the Diyas, let this be a moment we can look to the future with hope. My guiding light as Prime Minister is the determination to change things for the better, and as a symbol of the triumph of light over darkness, I believe Diwali is a poignant representation of the endeavour for a brighter tomorrow,\" the message added.\nSunak further stated, \"As your first British Asian Prime Minister and a devout Hindu, I also hope this can be a celebration of the fantastic ethnic and cultural diversity that makes the UK the place it is today.\"Earlier this week, Rishi Sunak welcomed guests from the Hindu community to Downing Street ahead of Diwali. In the visuals shared by Downing Street on X, the UK PM and his wife, Akshata Murty, were seen lighting diyas, surrounded by a large number of people who had come to join the celebration.\nEarlier on November 10, the British High Commissioner to India, Alex Ellis wished for a safe, happy and prosperous Diwali for everyone.\n\"Diwali is about family, friends, and fun - so we brought all of that together in the office. Aap sabhi ko humari taraf se Diwali ki shubhkamnayein (A very Happy Diwali to all of you from our side),\" the British High Commission in India posted on X.\nIn the video posted on X, Ellis said, \"Namaste! We wish you all a very Happy Diwali from the side of the British High Commission. Diwali is truly a global event, celebrated in India, celebrated across the world including in 10 Downing Street, and across the United Kingdom.\"He said, \"That's why I would like to say... 'Aap aur aapki Diwali surakshit, samridh aur khushaal rahe' (We wish you and your Diwali stay safe, prosperous and happy).\" (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "British High Commission in India extends wishes to people on Diwali", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030237/british-high-commission-in-india-extends-wishes-to-people-on-diwali"}