{"authors": [], "date_download": "2024-02-05 15:40:37", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Kiev?s backers worry that the targeting of Russian political figures could play into Moscow?s hands, Mark Galeotti has suggested\r\n\r\n\r\nUkrainian", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030477%2Frift-growing-between-western-and-ukrainian-spies-the-times.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1699791242.jpg", "language": "en", "localpath": null, "maintext": "Kiev's backers worry that the targeting of Russian political figures could play into Moscow's hands, Mark Galeotti has suggested\nUkrainian terrorist attacks on prominent Russian public figures are widening the rift between Western and Kiev's intelligence services, Mark Galeotti, a British historian and expert on modern Russia, has said.\nIn an article for The Times published on Saturday, Galeotti noted that while Ukrainian spy agencies have been closely cooperating with their American and British counterparts since as early as 2014, cracks are beginning to show between Kiev and the West in the realm of shadow warfare.\nGaleotti attributed the tensions to reservations \"about the Ukrainian strategy of taking the war to Russia by the bombing and killing of not just military but also political targets.\" According to the expert, the West is particularly concerned that, contrary to Ukraine's belief that these strikes will undermine Russian popular support for the military campaign against Kiev, they could have the opposite effect.\nIn addition, some Western officials think that despite a deep level of cooperation, Kiev has never been fully transparent with its backers and has turned a deaf ear to some of their warnings, the article says.\nOne unnamed ex-Ukrainian intelligence officer sought to justify this stance, reportedly telling Galeotti that Western countries that \"kill their enemies on the other side of the world with drones can hardly complain about our methods.\"\nThe expert also pointed to a deep-seated fear in Kiev about \"Ukraine fatigue\" in the West, which could undermine financial and military support in the long run. He noted that while Ukraine may not want to take action that \"could suck the West further into war, they may no longer be going out of their way to prevent it.\"\nMoscow has repeatedly accused Ukrainian intelligence services of orchestrating assassinations on high-profile Russian public figures. Last year, Russia's Federal Security Service (FSB) accused Kiev of blowing up a car carrying Darya Dugina, the daughter of Russian political commentator Alexandr Dugin. The agency also claimed that Kiev was behind the assassination of Russian war blogger Maksim Fomin (more commonly known as Vladlen Tatarsky), who died in an explosion at a cafe in St. Petersburg in April.\nIn July, the FSB also claimed to have foiled a Ukrainian-sponsored neo-Nazi plot to assassinate RT Editor-in-Chief Margarita Simonyan and journalist Ksenia Sobchak.\nThe Washington Post reported last month that the CIA had spent \"tens of millions\" of dollars to bolster Ukrainian intelligence, providing it with surveillance equipment and even helping it to build a major facility. Commenting on the article, Kremlin Press Secretary Dmitry Peskov noted that Russia has long been aware that Ukrainian spies operate \"under the close supervision\" of the US and UK.\n(RT.com)", "source_domain": "www.theuknews.com", "text": null, "title": "Rift growing between Western and Ukrainian spies The Times", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030477/rift-growing-between-western-and-ukrainian-spies-the-times"}