{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:16:22", "date_modify": "None", "date_publish": "2024-01-23 08:04:57", "description": "The soldiers were preparing explosives to demolish two buildings in central Gaza on Monday. The incident is the largest single loss of life for the military since the war began.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12995123%2F21-Israeli-soldiers-killed-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/23/08/80344281-0-image-a-9_1705997044161.jpg", "language": "en", "localpath": null, "maintext": "A deadly attack has killed 24 Israeli soldiers in Gaza, the country's military has said, a major setback that could add to mounting calls for a cease-fire.\nThe soldiers were preparing explosives to demolish two buildings in central Gaza on Monday when a terrorist fighter fired a rocket-propelled grenade at a tank nearby, according to Israeli media reports overnight.\nThe blast triggered land mines, causing the buildings to collapse on the soldiers, killing 24 - the largest single loss of life for the Israeli military since the war began.\nDefense Minister Yoav Gallant said it was a 'difficult and painful morning,' but that Israel was committed to pressing ahead.\n'This war will determine the future of Israel for decades to come, and the fall of soldiers is a requirement to achieve the goals of the war,' he wrote on X.\nIsraeli military spokesman Rear Admiral Daniel Hagari told reporters the IDF was 'investigating the details of the event and the reasons for the explosion.'\n'We worked to find the victims until the last hours,' Hagari added, indicating the difficulty in extracting bodies buried under the rubble. 'Our reservists sacrificed what was dearest to them, so that we could all live here in complete safety.'\nA deadly attack has killed 24 Israeli soldiers in Gaza , the country's military has said. Pictured: Smoke rises over Gaza in the early hours of Tuesday morning\nAccording to a website run by the IDF which posts details on fallen soldiers, those killed in the attack were from the 261st Infantry Brigade - a unit of reserves within the Israeli army's Gaza Division, and the 205th division - a reserve armour brigade.\nThe ages of those identified so far ranged from 23 to 35.\nREAD MORE: British and US troops launch strikes against Houthi targets in Yemen for the second time Advertisement\nThe incident occurred around 4pm in al-Muasi in central Gaza, the Jerusalem Post reported.\nThe deadly attack came as Israeli forces continued to probe deeper into western Khan Younis, the largest city in the south of the Gaza Strip.\nReports said the operation included the storming of a hospital and the arrest on medical staff, Gaza health ministry spokesman Ashraf al Qidra told Reuters.\nEarlier on Monday, the IDF said three soldiers were killed in a separate incident in southern Gaza, taking the total IDF death toll for the day to 24.\nIsraeli Prime Minister Benjamin Netanyahu has vowed to press ahead until Israel crushes the ruling Hamas terrorist group and wins the freedom of more than 100 hostages held captive in Gaza.\nIsraelis are increasingly divided on the question of whether it is possible to do either.\nFamilies of the hostages and many of their supporters have called for Israel to reach a ceasefire deal, saying time is running out to bring the hostages home alive.\nOn Monday, dozens of hostages' relatives stormed a parliamentary committee meeting, demanding a deal to win their loved ones' release.\nMonday's heavy death toll could add new momentum to calls for Israel to pause the offensive or even halt it altogether.\nLarge numbers of Israeli casualties have put pressure on Israel's government to halt past military operations.\nNews of the attack came as a senior Egyptian official said Israel has proposed a two-month cease-fire in which the hostages would be freed.\nIn exchange, Palestinians imprisoned by Israel and top Hamas leaders in Gaza would be released and be allowed to relocate to other countries.\nThe official, who was not authorised to brief media and spoke on condition of anonymity, said Hamas rejected the proposal and is insisting that no more hostages will be released until Israel ends its offensive and withdraws from Gaza.\nPictured: Some of the Israeli soldiers killed in Monday's attack. Left to right: Capt. Nir Binyamin (29), Capt. Ariel Mordechai (28) and Major General Ahmed Abu Latif (26)\nPictured: Some of the Israeli soldiers killed in Monday's attack. Left to right: Maj. Elkana Wiesel (35), Major General Israel Soko (24) and Major General Sagi Idan (24)\nPictured: Some of the Israeli soldiers killed in Monday's attack. Left to right: Sergeant Major Matan Lazar (32), Maj. Gen. Sergey Guntmacher (37), Maj. Gen. Elkana Yehuda Sepaz (35) and Major General Yuval Lopes (27)\nPictured: Some of the Israeli soldiers killed in Monday's attack. Left to right: Major General Cedric Green (23), Maj. Gen. Raphael Elias Moshioff (33), Major Yoav Levy (29) and Major General Nicholas Berger (22)\nIsraeli soldiers walk next to military vehicles and ambulances, as the conflict continues between Israel and the Palestinian Islamist group Hamas, near the fence on the Israeli border with Gaza, Israel January 22\nIsrael's government declined to comment on the talks when approached by the Associated Press, the news agency reported.\nThe official said Egypt and Qatar, which have brokered past agreements between Israel and Hamas, were developing a multistage proposal to try and bridge the gaps.\nIsrael launched the offensive after Hamas' October 7 cross-border attack that killed over 1,200 people and abducted some 250 others.\nThe offensive has caused widespread destruction, displaced an estimated 85% of Gaza's population and left more than 25,000 Palestinians dead, according to health officials in the Hamas-run territory.\nThe UN and international aid agencies say the fighting has unleashed a humanitarian disaster with a quarter of the area's 2.3 million people facing starvation.\nThe war has also heightened regional tensions, with Iran-backed groups in Lebanon, Syria, Iraq and Yemen attacking US and Israeli targets in support of Palestinians.\nThe US and Britain launched another wave of strikes Monday against the Houthi rebels in Yemen, who have targeted international shipping in the Red Sea in what they portray as a blockade of Israel.\nThe growing death toll and dire humanitarian situation have led to increasing international pressure on Israel to scale back the offensive and agree to a pathway for the creation of a Palestinian state after the war.\nThe US, which has provided crucial military aid, has joined those calls.\nBut Netanyahu, whose popularity has plummeted since October 7 and whose governing coalition is beholden to far-right parties, has rebuffed both demands.\nInstead, he has said Israel will need to expand operations and eventually take over the Gaza side of the border with Egypt, where hundreds of thousands of Palestinians who have fled from other areas are packed into overflowing UN-run shelters and sprawling tent camps.\nThat drew an angry protest from Egypt's government, which rejected Israeli allegations that Hamas smuggles in weapons across the heavily guarded frontier.\nFlares fired by Israeli forces are seen over the sky at different parts of the city of Deir Al-Balah, Gaza as the Israeli army's air, sea and land attacks against the Gaza Strip continue uninterruptedly on January 22\nDiaa Rashwan, head of Egypt's State Information Service, said Monday any Israeli move to occupy the border area would 'lead to a serious threat' to relations between the two countries, which signed a landmark peace treaty over four decades ago.\nEgypt is also deeply concerned about any potential influx of Palestinian refugees into its Sinai Peninsula.\nRashwan said Egypt was in full control of the border after taking a number of measures in recent years, including the creation of a 5-kilometer (3-mile) buffer zone and the construction of barriers above and below ground.\nEgypt 'is capable of defending its interests and sovereignty over its land and borders, and will not mortgage it in the hands of a group of extremist Israeli leaders who seek to drag the region into a state of conflict and instability,' Rashwan said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "24 Israeli soldiers are killed in Gaza when RPG is fired at nearby tank, setting off demolition explosives they were preparing and causing two buildings to collapse on them", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12995123/21-Israeli-soldiers-killed-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}