{"authors": [], "date_download": "2024-02-05 15:40:47", "date_modify": "None", "date_publish": "2023-11-14 13:39:16", "description": "Additional US forces were deployed to the Middle East in response to the 7 October attack on Israel by Hamas militants", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Feastern-mediterranean-us-soldiers-helicopter-crash-b2446909.html.json", "image_url": "https://static.independent.co.uk/2023/11/14/10/Screenshot%202023-11-14%20at%2010.51.48.png?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe US Army has named five soldiers killed in a helicopter crash in the eastern Mediterranean over the weekend.\nFive Army aviation special operations forces were killed when their helicopter “experienced an in-flight emergency” during aerial refueling training that resulted in the crash over the Mediterranean sea.\nUS European Command said search and rescue operations were launched immediately following the crash, but none of the soldiers survived.\nA US official previously told CBS News the five soldiers were special operations forces who had been deployed to Cyprus in case an evacuation of Lebanon or Israel was ordered.\nThe US Department of Defense released the identities of the five soldiers, who were all from the same base in Fort Campbell, Kentucky.\nThe five deceased men were named as Sgt Cade Wolfe of Minnesota, 24, Chief Warrant Officer 3 Stephen Dwyer of Tennessee, 38, Chief Warrant Officer 2 Shane Barnes of California, 34, Staff Sgt Tanner Grone of New Hampshire, 26, and Sgt Andrew Southard of Arizona, 27.\nThe US Army is investigating the crash, but said there are no indications that the crash was caused by enemy or hostile actions.\nAdditional US forces were deployed to the Middle East in response to the 7 October attack on Israel by Hamas militants.\nTwo aircraft carriers – the Ford and the Eisenhower – along with supporting ships and dozens of aircraft have been deployed to the eastern Mediterranean since the attack.\nFollowing news of the soldiers’ deaths, tributes flooded in, with the US Army describing each of the five men as a “national treasure” whose loss cuts deeply.\nThe commander of the Army Special Operations Command, Lt Gen Jonathan Braga, said the deceased soldiers “hail from rare patriotic families with deep military service ties that span multiple generations and formations.”\n“This is devastating news that reverberates across the entire Special Operations community,” Mr Braga said on Monday in a statement. “Every loss is tough, but in this case, service to the Nation is truly a family business and it’s hard to express the amount of sorrow that we all feel right now.”\nPresident Joe Biden also paid tribute to the five soldiers, saying their deaths illustrate how service operators “put their lives on the line for our country every day”.\nHe added that the crash occurred at the start of the weekend commemorating Veterans Day. “[First lady] Jill [Biden] and I are praying for the families and friends who have lost a precious loved one – a piece of their soul. Our entire nation shares their grief,” he said.\nMeanwhile, Staff Sgt Grone’s parents paid tribute to their son in a Facebook post, saying that they were “beyond proud of what you became and believed in. Thank you for all these amazing years. Please watch over us. Love you and can’t express how much you will be missed.”\nThe incident marks the second time US Army personnel from Fort Campbell have died in a helicopter crash this year.\nIn March, two HH-60 Black Hawk helicopters collided during a nighttime training flight, killing all nine soldiers aboard", "source_domain": "www.independent.co.uk", "text": null, "title": "US Army names five soldiers killed in eastern Mediterranean helicopter crash", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/eastern-mediterranean-us-soldiers-helicopter-crash-b2446909.html"}