{"authors": [], "date_download": "2024-02-05 15:40:48", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Weighing in on the violence at pro-Palestinian rallies on Armistice Day in the UK, Prime Minister Rishi Sunak on Saturday said all criminality must be met with", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030460%2Fall-criminality-must-be-met-with-full-and-swift-force-of-law-sunak-on-violence-during-pro-palestine-rallies-in-uk.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699792885.jpg", "language": "en", "localpath": null, "maintext": "London [UK], November 12 (ANI): Weighing in on the violence at pro-Palestinian rallies on Armistice Day in the UK, Prime Minister Rishi Sunak on Saturday said all criminality must be met with the full and swift force of the law.\nCalling the incident \"unacceptable\", Sunak condemned the violence saying the fear and intimidation the Jewish community that the country saw over the weekend was deplorable.\n\"All criminality must be met with the full and swift force of the law. That is what I told the Met Police Commissioner on Wednesday, that is what they are accountable for and that is what I expect. I will be meeting the Met Police Commissioner in the coming days,\" Sunak said.\n\"I condemn the violent, wholly unacceptable scenes we have seen today from the EDL and associated groups and Hamas sympathisers attending the National March for Palestine. The despicable actions of a minority of people undermine those who have chosen to express their views peacefully,\" stated an official release from 10 Downing Street, quoting the PM.\nHe added that \"remembrance weekend\" is a time for the community to remember those who fought for the nation.\nThe statement quoted Sunak as saying further, \"It is a time for us to come together as a nation and remember those who fought and died for our freedoms. What we have seen today does not defend the honour of our Armed Forces but utterly disrespects them.\"\"That is true for EDL thugs attacking police officers and trespassing on the Cenotaph, and it is true for those singing antisemitic chants and brandishing pro-Hamas signs and clothing on today's protest. The fear and intimidation the Jewish community has experienced over the weekend is deplorable,\" the UK PM added.\nSunak denounced \"antisemitism\" earlier as well after a series of pro-Palestine protests in the UK.\n\"This weekend we saw hate on our streets. Calls for Jihad are not only a threat to the Jewish community but to our democratic values. We will never tolerate antisemitism in our country. And we expect the police to take all necessary action to tackle extremism head-on,\" Sunak posted from his official handle on X, formerly Twitter.\nEarlier, Sunak visited Israel in the wake of the October 7 Hamas attacks in southern Israel. During his visit, he affirmed the UK's support for Israel's right to defend itself in line with international law and its ongoing fight against Hamas.\nSunak said he was \"sorry\" to visit Israel in \"such terrible circumstances\", adding, \"In the last two weeks, this country has gone through something that no country, no people should have to endure, least of all Israel.\"\"I want to share the deep condolences of the British people and stress that we absolutely support Israel's right to defend itself in line with international law, to go after Hamas...We also recognise that the Palestinian people are victims of Hamas too,\" the British PM said at a joint press briefing with Israeli Prime Minister Benjamin Netanyahu after a private meeting at the latter's office in Jerusalem.\nApart from Sunak, other world leaders including US President Joe Biden, German Chancellor Olaf Scholz, Italian Prime Minister Giorgia Meloni, Greek Prime Minister Kyriakos Mitsotakis, and Dutch Prime Minister Mark Rutte visited Israel after the country declared war on Hamas. (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "\"All criminality must be met with full and swift force of law\": Sunak on violence during pro-Palestine rallies in UK", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030460/all-criminality-must-be-met-with-full-and-swift-force-of-law-sunak-on-violence-during-pro-palestine-rallies-in-uk"}