{"authors": ["Bethan Mckernan", "Oliver Holmes", "Julian Borger"], "date_download": "2024-02-05 15:40:52", "date_modify": "None", "date_publish": "2023-11-14 19:51:06", "description": "Another 200,000 people flee northern Gaza as fighting rages around territory’s biggest health facility", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F14%2Fpeople-flee-northern-gaza-as-fighting-continues.json", "image_url": "https://i.guim.co.uk/img/media/582566aa47a24277a8f0ac76d3cc00ad8edd7fda/0_0_6497_3898/master/6497.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bf099040dfb72d9d0eb277fd293697a0", "language": "en", "localpath": null, "maintext": "Palestinians trapped inside Gaza’s biggest hospital are digging mass graves, with no means of keeping corpses from decomposing due to Israel’s siege, an official there says.\n“We are planning to bury them today in a mass grave inside al-Shifa medical complex,” said a health ministry spokesperson, Ashraf al-Qidra. “The men are digging right now as we speak.”\nWith Israeli forces at the gates of the complex, and fighting raging with Hamas militants in the streets of Gaza City, patients have been dying owing to energy shortages and dwindling supplies. Some of the hospital’s buildings have been bombed.\nThe Biden administration said on Tuesday that US intelligence supported Israel claims that Hamas was using al-Shifa as a military command centre and probably as a weapons store too.\n“We have information that confirms that Hamas is using that particular hospital for a command and control mode” the White House national security spokesperson John Kirby told reporters aboard Air Force One. “That is a war crime.”\nBut Kirby added that the actions of Hamas did not diminish Israel’s responsibility to protect civilians in the course of its military operations.\nAt least 32 patients, including three premature babies, died at the weekend, the health ministry in Gaza said, and another 36 babies and other patients at al-Shifa were at risk. Life-saving equipment, such as incubators, cannot function without fuel to run generators.\nThe UN Office for the Coordination of Humanitarian Affairs (Ocha) said on Tuesday that more than 200,000 people had fled northern Gaza in the past 10 days.\nIt said only one hospital in the northern half of the blockaded Gaza Strip – al-Awda – still had electricity and was able to receive patients, with other medical facilities in sprawling Gaza City now mostly functioning as shelters for people fleeing the violence.\nThose who have left in the last week join the estimated 1.5 million people – three-quarters of the blockaded territory’s population – who have already fled their homes through the Israeli military “safe routes” in the six weeks of war that has killed more than 11,000 Palestinians and 1,200 people in Israel, according to officials.\nOcha said: “Hundreds of thousands of people who are either unwilling or unable to move to the south remain in the north amid intensified hostilities. They are struggling to secure the minimum amount of water and food for survival.”\nView image in fullscreen People fleeing the north on 12 November. Photograph: Ibraheem Abu Mustafa/Reuters\nHebrew-language media reported on Tuesday that Israeli and Palestinian officials were trying to arrange for unconscious patients and those requiring dialysis and cancer treatment to be evacuated from al-Shifa to appropriate facilities in the southern half of the strip. The reports were not immediately confirmed by medics on the ground. The Israeli military said it had started an effort to send incubators to the hospital, but it was not clear how they would be transferred.\nCivilians in the area said heavy gunfire could be heard around the hospital compound. Staff at al-Shifa have said snipers were shooting at people outside, making it dangerous to move around the complex.\nA World Health Organization spokesperson, Margaret Harris, said on Tuesday that the world needed to focus on “saving lives, not taking lives”.\n“Somehow the understanding that a hospital must be a safe haven, a place where people come to be cured, to be treated when they are in trouble, when they are in need, it has been forgotten,” Harris said. “There seems to be a trend to want to turn them into places of death, despair and danger, which should never happen.”\nA spokesperson for the UN secretary general, António Guterres, said he was deeply disturbed by the “dramatic loss of life” in Gaza hospitals. “In the name of humanity, the secretary general calls for an immediate humanitarian ceasefire,” said the spokesperson, Stéphane Dujarric.\nThe US president, Joe Biden, said on Monday that he hoped the Israeli military would proceed with a “less intrusive” operation at al-Shifa, adding that Palestinian civilians must be protected.\nIsrael says al-Shifa sits above the “nerve centre” of the Palestinian militant group’s operations. Israel has not provided conclusive evidence, but the group often fires rockets from densely crowded residential areas and maintains a vast tunnel network.\nView image in fullscreen Palestinians flee north Gaza to move southward, as Israeli tanks roll deeper into the territory. Photograph: Ibraheem Abu Mustafa/Reuters\nUN officials have said Israel’s claims of militant activity in hospitals, whether true or false, do not absolve it from an obligation to spare civilian life.\nThe war, the fifth in Gaza since Hamas seized control of the strip in 2007 and already the bloodiest in the 75-year-old Israeli-Palestinian conflict, was sparked by an unprecedented assault by Hamas in which militants massacred hundreds of Israeli civilians and took 240 hostage. Three weeks of Israeli airstrikes, one of the most intense such campaigns anywhere in the world this century, were followed by a ground invasion.\nIsraeli troops and tanks have slowly but steadily cut off Gaza City as talks mediated by Qatar and the US on releasing hostages and brokering a humanitarian pause or ceasefire have stalled. The Israeli military has ordered Palestinian civilians to move south of the Gaza river to “safe zones” but there has also been intense bombing in the southern half of the strip.\nIn southern Gaza on Tuesday, young men carrying a man wounded from an Israeli strike rushed into Nasser hospital, one of the few medical centres still open.\nAt the same hospital, in the city of Khan Younis, relatives of those killed in Israeli attacks wept as their bodies were transferred from the morgue to be buried.\nView image in fullscreen A refugee prepares a meal while attempting to shelter in al-Shifa hospital in Gaza City on 10 November. Photograph: AFP/Getty Images\nA French hospital ship is expected to arrive in the region in the next few days, and the UAE is setting up a field hospital in Gaza’s south, but these measures are unlikely to alleviate the humanitarian crisis for the 2.3 million Gaza population. The coastal territory, already impoverished by the 16-year-old Israeli-Egyptian blockade imposed after the Hamas takeover, has been left in ruins by the Israeli bombing campaign: about 45% of houses have been damaged or destroyed, along with 279 educational facilities, the UN said on Monday.\nClean water, food and medical supplies are scarce. A tiny fraction of the aid that used to reach Gaza every day has entered from Egypt. Rubbish is piling up in the streets, increasing the risk of diseases such as cholera and dysentery.\nIsrael’s foreign minister, Eli Cohen, said on Monday that he believed that the international community would press Israel to wind down its operations in Gaza in the next two to three weeks. “From a political standpoint, we are starting to see that pressure on Israel has begun. That pressure isn’t very high, but it is in an upward trend … we will continue in any event according to plan,” he told reporters.\nView image in fullscreen A woman and child sheltering a classroom at a school run by the UNRWA in Rafah, southern Gaza. Photograph: Said Khatib/AFP/Getty Images\nIsrael has vowed to destroy Hamas as a military and governing power in Gaza, but it is not clear what it plans to do with the territory after the fighting subsides.\nA senior far-right member of the Israeli government, the finance minister, Bezalel Smotrich, said on Tuesday that Palestinians should “voluntarily” leave Gaza for other countries.\nPalestinians have accused Israel of seeking a new Nakba, or catastrophe, the mass displacement of 700,000 Palestinians in wars surrounding the founding of the state of Israel in 1948.\nOn Saturday, Avi Dichter, a member of the Israeli security cabinet member and agriculture minister, said in a television interview: “We are now rolling out the Gaza Nakba.” The prime minister, Benjamin Netanyahu, warned cabinet ministers the next day to choose their words carefully.\nAn unverified video published online showed what appeared to be Israeli soldiers in front of bombed-out buildings, with one saying they were “conquering, expelling and settling”.\nOn Tuesday, rocket fire by Palestinian militants in Gaza hit areas around the strip, including the city of Ashkelon, where medics said two Israelis were lightly wounded. Hours later, shrapnel from another rocket attack on Tel Aviv, wounded three people, one of them seriously.\nIn the north, anti-tank missiles and mortars were fired from Lebanon at Israeli military positions, and forces returned fire, the Israel Defense Forces (IDF) said. Israel’s fighting with the powerful Iran-backed militia Hezbollah has killed about 70 Lebanese militants and 16 civilians, as well as seven Israeli soldiers and three civilians.\nIn the occupied West Bank, the worst violence for 20 years continued to escalate, with 182 Palestinians killed, mostly in clashes with the IDF and Israeli settlers living in the Palestinian territory. Israeli forces killed at least eight Palestinians in the West Bank on Tuesday, Palestinian medics and local media said.\nReuters contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "Palestinians digging mass graves inside al-Shifa hospital, health official says", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/14/people-flee-northern-gaza-as-fighting-continues"}