{"authors": [], "date_download": "2024-02-05 15:40:53", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "India shut schools and offices in capital Delhi to tackle deadly pollution as it joined calls for a fund to help poorer nations such as itsel", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030370%2Findia-grapples-with-killer-smog-ahead-of-cop-28-summit-in-dubai.json", "image_url": "https://cdn.bignewsnetwork.com/rfi1699780569.jpg", "language": "en", "localpath": null, "maintext": "India shut schools and offices in capital Delhi to tackle deadly pollution as it joined calls for a fund to help poorer nations such as itself to deal with climate warming disasters.\nDelhi also closed factories and construction but surprise rains brought temporary relief on the weekend from choking fumes billed as \"hazardous\" by Swiss group IQAir.\n\"But we are planning for artificial rains as it takes time to prepare,\" Delhi environment minister Gopai Rai said as the city braced for Sunday's festival of lights which hundreds of millions of Hindus celebrate by lighting firecrackers.\nLast week, Delhi's air quality index (AQI) hovered at around 450. An AQI of 0-50 is considered safe while anything past 400 affects healthy people.\nThe Chicago University of Chicago has warned filthy air cut short lives of Delhi residents by 11.9 years while British medical journal Lancet said pollution killed more than two million people in 2019.\nThe World Bank estimates 7.5 trillion euros was the global cost of health damages linked to impure air the same year.\nClimate justice\nIndia meanwhile backed two dozen countries negotiating an international fund to mitigate effects of global warming in poorer nations such as itself.\nThe negotiators in Abu Dhabi agreed the World Bank would host the so called loss-and-damages fund (LDF) for the next four years.\nGlobal leaders will now sign the LDF draft at the 28th UN Climate Change conference, or COP 28 starting 30 November in Dubai and launch the objectives of the corpus, which faced resistance from wealthy nations at previous UN negotiations.\nIndia is likely to face headwinds at COP 28 once it focuses on the phasing out of fossil fuel as burning of coal, oil and gas causes greenhouse gases that are the key reasons for climate change.\nDelhi hopes to more than double its economy at 6.8 trillion euros by 2030 but also honor a promise it made at the 2021 UN climate summit (COP26) of cutting its emissions to net zero by 2070.\nPlans to scale up fossil fuels threaten 1.5C climate target, UN warns Global stocktake of climate efforts will be a critical moment of truthLonely stance\nIndian Power Minister R.K. Sharma last weekend said his government would not relent to pressures to reduce its usage of coal for energy generation to meet the ever-galloping demand of India's expanding economy.\n\"We are not going to compromise on availability of power for our growth even if it requires that we add coal-based capacity,\" Singh said and asked his state ministers to run coal-fired powerhouses to full capacity.\nIndia emitted one billion tonnes of carbon dioxide (CO2), and became the fourth biggest fossil fuel polluter after China, the US and European Union but given its enormous population means its emissions per capita are much lower than other global economies.\nIndia is also not likely to vote for a COP28 initiative to cut cooling-related emissions at the Dubai meeting. India and China must endorse the cooling pledge to make it a success.\nIt was also unclear if the Dubai event will scrutinise a July memorandum by environment ministers from G20 countries in India.\nThe grouping, which emits 80 percent of the climate warming gases, disagreed on aiming to cap emissions by 2025, moving to clean energy and a tax on carbon as a way to cut emissions.\nOriginally published on RFI", "source_domain": "www.theuknews.com", "text": null, "title": "India grapples with killer smog ahead of COP 28 summit in Dubai", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030370/india-grapples-with-killer-smog-ahead-of-cop-28-summit-in-dubai"}