{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:40:54", "date_modify": "None", "date_publish": "2023-11-14 09:05:14", "description": "Israeli tanks have taken up positions outside Al Shifa Hospital, which Israel says sits atop tunnels housing a headquarters for Hamas who are using patients as shields.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12746683%2FThe-youngest-victims-Gaza-war-Time-running-36-newborns-Shifa-hospital-surrounded-IDF-Biden-calls-medical-centres-protected-Israel-insists-Hamas-uses-babies-human-shields.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/14/09/77774379-0-image-m-26_1699952706241.jpg", "language": "en", "localpath": null, "maintext": "Time is running out for 36 newborn babies at Gaza's biggest hospital.\nIsraeli tanks have taken up positions outside Al Shifa Hospital, which Israel says sits atop tunnels housing a headquarters for Hamas who are using patients as shields.\nUS President Joe Biden said hospitals in the Gaza Strip must be protected and he hoped for 'less intrusive' action by Israel as tanks advanced on the main gates, while Britain's Rishi Sunak said 'too many civilians' are dying in the coastal strip.\nAs criticism of Israel's strikes in Gaza grew louder, the Jewish state said it is transferring incubators for the newborns. A doctor at the hospital has said that so far, three babies have died due to a lack of oxygen and electricity.\nDr Mohamed Abu Selmia, manager of the key Al-Shifa hospital, told the BBC that Israel is yet to reach out about the evacuation of the newborns.\nTime is running out for 36 newborn babies (pictured) at Gaza 's biggest hospital\n'No, they haven't reached out, instead we reached out to them... but until now we have received no response,' he said. 'There are negotiations regarding evacuating premature babies but until now nothing has happened.'\nAfter days of heavy air strikes around Al-Shifa hospital, witnesses said tanks and armoured vehicles were yards from the besieged facility.\nThe medical centre has become a focal point of the five-week-old war as Israeli forces have continued to advance into Gaza City.\nThe United Nations believes that thousands, and perhaps more than 10,000 people - patients, staff and displaced civilians - may be inside and unable to escape because of fierce fighting nearby, many using it as a shelter in Gaza's besieged north.\nGaza health ministry spokesperson Ashraf Al-Qidra, who was inside Al Shifa hospital, said on Monday 32 patients had died in the previous three days, including three newborns, because of the siege of the hospital in northern Gaza and a lack of power.\nThe Israeli military said early on Tuesday it had 'initiated a humanitarian effort to coordinate transfer of incubators' from Israel to Al Shifa.\nHowever, it made clear none of the devices, often used to keep pre-mature newborns warm, had been received by the facility.\nThere was no immediate comment from Al Shifa or from Hamas.\nMeanwhile, Israeli forces appear ready to enter the hospital.\nThis would prove a key moment in the war and show once and for all whether Hamas terrorists have indeed based their secret headquarters underneath the hospital.\nBut any such move by the Israeli forces to enter the hospital would see civilians, patients and doctors caught in the middle of fierce fighting.\nAt least 650 patients were still inside Al Shifa hospital, desperate to be evacuated to another medical facility. Meanwhile, the director of the hospital said today that 179 people, including babies and patients who died in the intensive care unit, had been buried in a 'mass grave' at the complex.\n'We were forced to bury them in a mass grave,' said Al-Shifa hospital director Mohammad Abu Salmiyah, adding that seven babies and 29 intensive care patients were among those buried after hospital fuel supplies ran out.\n'There are bodies littered in the hospital complex and there is no longer electricity at the morgues,' he said, as no fuel has entered the Gaza Strip since the Israel-Hamas war began on October 7.\nOn Tuesday, a man and a woman died in the ICU bringing the number of people who had died in the unit to 29, Salmiyah said.\nAs criticism of Israel's strikes in Gaza grew louder, the Jewish state said it is transferring incubators for the babies. A doctor at the hospital has said that so far, three babies have died due to a lack of oxygen and electricity. Some of the babies are seen at the hospital on Nov. 12\nThe Israeli military said early on Tuesday it had 'initiated a humanitarian effort to coordinate transfer of incubators' from Israel to Al Shifa\nA picture shows a view of the exterior of Al-Shifa hospital in Gaza City on November 10\nAmid reports of the premature babies dying for lack of electricity and patients facing gunfire, a surgeon working for Doctors Without Borders said the situation inside the hospital had become 'very bad'.\n'We don't have electricity. There's no water in the hospital. There's no food,' said the doctor, who was not named by his organisation. 'It is inhuman.'\nIsrael accuses Hamas fighters of using tunnels under the hospital as a command 'node', effectively engaging the sick and injured as human shields.\nIt is a charge that Hamas denies.\nIsrael says it is not targeting the hospital, but has vowed to destroy Hamas in response to the attacks of October 7, which killed an estimated 1,200 people, mostly civilians and resulted in 240 hostages being taken back to Gaza.\nThe health ministry in Hamas-run Gaza says Israel's assault has already killed 11,240 people, also mostly civilians, including thousands of children.\nIsrael says 46 of its troops have been killed in fighting in Gaza.\nIsraeli military spokesman Peter Lerner insisted Al-Shifa was 'central in Hamas's command and control capabilities', but said troops were currently 'stand-offish'.\n'The idea is to try to evacuate the people, evacuate as many as possible,' he said.\nBiden called on Israel to use 'less intrusive action relative to the hospital', some of his most pointed comments on Israeli operations to date.\n'The hospital must be protected,' he told reporters.\nHe added: 'there is an effort to get this pause to deal with the release of prisoners and that's being negotiated, as well, with the Qataris ... being engaged.'\nLast night, also in some of his strongest comments yet, British Prime Minister Rishi Sunak said 'too many civilians' are dying in Gaza.\nHe said there needs to be 'unhindered humanitarian access and urgent and substantive humanitarian pauses', telling the Lord Mayor's Banquet in London: 'There are things that Israel must do as part of this response.\n'We've been clear that they must act within international law, they must take all measures to protect innocent civilians, including at hospitals, stop extremist violence in the West Bank and allow more aid into Gaza...too many civilians are losing their lives.\n'That's why I've doubled our aid to Gaza and why we continue to press both at the United Nations and directly with Israel for unhindered humanitarian access and urgent and substantive humanitarian pauses. We want aid coming in by air, land and sea, and we're ready to use our bases in Cyprus as a staging post.'\nA satellite image shows Gaza's Al-Shifa hospital on November 11\nMen check the bodies of people killed in a bombardment in Gaza, November 10\nUnderscoring the role that global public opinion is playing in the war, both sides have repeatedly given vastly different accounts of events.\nIsrael's Lerner put the number of people inside the hospital at 'a few hundred', while the Hamas government's deputy health minister Youssef Abu Rish, who is present in the hospital, said about 20,000 displaced people had sought refuge there.\nRoughly two-thirds of the people in the densely populated Mediterranean strip have been made homeless by Israel's military campaign, in which it has ordered the northern half of Gaza evacuated.\nHamas's brutal attacks of October 7 and Israel's massive response have sparked protests around the world, with hundreds of thousands of people taking to the streets in the Middle East, Europe and beyond.\nIsrael's supporters insist it must protect citizens after the worst attack in the country's 75-year history - an attack that brought painful echoes of past pogroms against the Jewish people.\nBut Israel's critics point to the toll of a blockade and near-relentless bombing campaign on long-suffering civilians in Gaza.\nInternational aid agencies speak of hundreds of thousands of people displaced and a rolling humanitarian catastrophe.\nIsrael's top diplomat admitted Monday that his nation has 'two or three weeks until international pressure really steps up.'\nQuoted by his spokesman, Foreign Minister Eli Cohen added that Israel is working to 'broaden the window of legitimacy, and the fighting will carry on for as long as necessary' as the IDF continues its mission to destroy Hamas.\nIn the face of mounting pressure, Israel has agreed to daily pauses in military operations around specified humanitarian 'corridors' to allow Gazans to flee fighting.\nIsraeli leaders have so far insisted there will be no broader ceasefire before hostages are released. But Qatar is mediating talks on a possible deal to free the hostages.\nAbu Obeida, a spokesman for Hamas's Al-Qassam Brigades military wing, said Monday that a possible deal would involve the release 100 Israeli hostages in return for 200 Palestinian children and 75 women held in Israeli prisons.\nAl-Qassam Brigades posted an audio recording on its Telegram channel saying the group was ready to release the hostages, an offer Israel is unlikely to embrace.\n'We told the (Qatari) mediators that in a five-day truce, we can release 50 of them and the number could reach 70 due to the difficulty that the captives are held by different factions,' Obeida said. He claimed Israel had asked for 100 to be freed.\nAs security officials and diplomats continued negotiations, Hamas released a video of a young woman who was said to be an Israeli soldier held in Gaza.\nThe Israeli army later confirmed the identity of the woman.\n'Our hearts go out to the Marciano family, whose daughter, Noa, was brutally kidnapped by the Hamas terrorist organisation,' the army said in a statement.\nArmy spokesman Daniel Hagari said troops 'found signs that indicate that Hamas held hostages' in the basement of Al-Rantisi children's hospital, showing footage of a baby bottle and a rope near a chair.\nIn the video he showed neatly arranged assault rifles, grenades and what Hagari said were 'vests with explosives'.\nA view of damaged buildings in Gaza following artillery strikes, as seen from southern Israel, amid the ongoing conflict between Israel and the Palestinian group Hamas, November 14\nIDF tanks move through a field in southern Israel on November 13\nCivil defense teams and civilians conduct a search and rescue operation under the rubble of demolished buildings after Israeli bombardment at Jabalia refugee camp in Gaza City, Nov. 14\nThe war in Gaza has also spurred violence on other fronts.\nIn the northern West Bank, five Palestinians were killed in clashes around the city of Tulkarem, the director of a local hospital told AFP on Tuesday.\nAfter repeated strikes on US forces in the Middle East, the United States launched air attacks that killed at least eight pro-Iran fighters in eastern Syria, a Britain-based monitoring group said.\nOn Monday, Israel used fighter jets to strike what it said were 'operational command centres' belonging to Iran-backed militant group Hezbollah inside Lebanon.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "The youngest victims of the Gaza war: Time is running out for 36 newborns at Shifa hospital surrounded by IDF, as Biden calls on medical centres to be 'protected' - but Israel insists Hamas 'uses thos", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12746683/The-youngest-victims-Gaza-war-Time-running-36-newborns-Shifa-hospital-surrounded-IDF-Biden-calls-medical-centres-protected-Israel-insists-Hamas-uses-babies-human-shields.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}