{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:40:55", "date_modify": "None", "date_publish": "2023-11-14 08:03:01", "description": "The Israel-Hamas war began after Hamas brutally massacred 1,400 Israelis (mostly civilians) in a surprise assault on October 7.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fhamas-has-lost-control-gaza-claims-israel-1721569.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721259/people-salvage-belongings-rubble-damaged-buildings-following-strikes-southern-gaza.jpg", "language": "en", "localpath": null, "maintext": "Israel has claimed that Hamas has lost control of the Gaza Strip after 16 years. In a live broadcast, Israel's Defence Minister Yoav Gallant said that Hamas militants have begun to flee southward.\nHowever, the minister did not provide any evidence to prove his claim, according to an AFP report.\n\"Hamas has lost control of Gaza. Terrorists are fleeing southward. Civilians are looting Hamas bases,\" he said. \"They don't have faith in the government anymore,\" he added. The Israel-Hamas war began after Hamas brutally massacred 1,400 Israelis (mostly civilians) and took over 200 hostages in a surprise assault on October 7.\nThe gunmen crossed the border by land, sea, and air, attacking the southern and central parts of Israel, including Tel Aviv and Jerusalem. In retaliation for the Hamas attacks, Israel's prime minister formally declared war against the militant outfit.\nSince then, the Israel Defense Forces (IDF) have launched airstrikes and a ground offensive in Gaza. It has also drafted 300,000 reservists as it continues its war with Hamas. Prime Minister Benjamin Netanyahu says Israel has a \"clear goal of destroying Hamas's military and governing capabilities\".\nJust weeks after the IDF started to bombard Hamas with retaliatory air strikes, more than 10,000 people have been killed, almost half of whom are said to be children.\nHamas is a Palestinian group that has ruled the Gaza Strip since 2007. The Gaza Strip is a 41-kilometre (25-mile) long and 10-kilometre-wide area wedged between Israel, Egypt, and the Mediterranean Sea.\nIsrael occupied Gaza in the 1967 Six-Day War and returned it to the Palestinians in 2005.\nIt later imposed an air, land, and sea blockade on Gaza. The blockade was imposed after Hamas came to power in Gaza in 2007. It is home to approximately 2.3 million Palestinians.\nIsrael controls Gaza's shoreline, airspace, and trade and has vowed to wipe out Hamas if they do not return Israeli hostages.\nMeanwhile, the armed wing of the Palestinian militant group has said that it is willing to release up to 70 women and children if Israel agrees to a five-day truce. The latest war between Israel and Hamas is being described as the bloodiest conflict ever.\nAccording to a United Nations report, almost 1.6 million people have been internally displaced in the Gaza Strip. The UN has called for an immediate halt to fighting, but Netanyahu has rejected such calls for a ceasefire until all hostages are released.\nOn Monday, he said that the latest conflict between Hamas and Israel is \"neither an operation, nor a round, but a war to the end\".", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Hamas Has Lost Control Of Gaza, Claims Israel", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/hamas-has-lost-control-gaza-claims-israel-1721569"}