{"authors": [], "date_download": "2024-02-05 15:40:59", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Kherson residents in Eastern Ukraine are marking one year since the liberation of their city from occupying Russian forces. And though they experience c", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274030055%2Famid-shelling-kherson-marks-year-since-liberation-from-russia.json", "image_url": "https://cdn.bignewsnetwork.com/voa1699742163.jpg", "language": "en", "localpath": null, "maintext": "Kherson residents in Eastern Ukraine are marking one year since the liberation of their city from occupying Russian forces. And though they experience constant shelling from the left bank of the Dnipro River, where Russian troops are positioned, they say they have become resilient against such attacks.\nMunicipal workers are accustomed to wearing bullet-proof vests and staying ready to sweep up the rubble from yet another strike.\nBetween lulls of artillery fire coming from the river, Ukrainians venture out to buy food, bicycle down grassy residential lanes, or gather in the few restaurants that remain open.\n'When you have lived under occupation, you know what freedom means,' say residents marking the anniversary of their city's liberation, on Nov. 11, 2022.\n'It's why we have a special attitude toward the continued shelling. We can withstand it because we know how it could be worse,' said Grigori Malov, who owns one of the three restaurants still operating in the city.\nMunicipal workers in the city of Kherson, Ukraine, decorate the wall of the regional administration building with a national flag to mark one year since Ukrainian troops retook the city from the Russian army, Nov. 10, 2023.\nRussia launched a missile attack Saturday on Kyiv and the nearby region and pounded the east and south of the country with drones, Ukrainian officials said.\n'After a long pause of 52 days, the enemy has resumed missile attacks on Kyiv,' Serhiy Popko, head of the Kyiv city military administration, said on the Telegram messaging app. 'The missile failed to reach Kyiv, air defenders shot it down as it was approaching the capital,' he said.\nRussian anti-aircraft units downed two Ukrainian drones over the Moscow region and Smolensk region to the west near the border with Belarus, the Russian Defense Ministry said early Saturday.\nReuters could not independently verify the reports.\nThe British Defense Ministry reported that Russian President Vladimir Putin and former President Dmitry Medvedev have issued documents described by the British ministry as the 'weaponization of history ... aimed at inculcating anti-Westernism in the minds of the Russian population and intimidating its immediate Western neighbors.'\nIn Saturday's intelligence update on Ukraine, the British Defense Ministry said Putin's publication is a collection of 242 documents entitled, 'On the historical unity of the Russians and Ukrainians.' The documents, from the 11th century to the 20th century, are Putin's attempt to justify the Kremlin's current Ukraine policy and features 'interpretative comments' from the president.\nMedvedev's publication is an article the British ministry says he 'ostensibly wrote' about the history of Russian-Polish relations. He accuses Poland of engaging in 'aggressive revisionist Russophobic policy,' according to the British ministry, and he threatens Poland with a military attack.\nEU aid to Ukraine\nMeanwhile, European Union countries are having reservations about committing a long-term fund of $21.4 billion in military aid for Ukraine as its grinding military campaign continues against Russia's invasion.\nEU defense ministers prepared to discuss the plan Tuesday in Brussels. It was proposed by EU foreign policy chief Josep Borrell last July. However, diplomats say multiple countries, including Germany, have voiced reservations about committing up to $5 billion annually over four years as part of broader Western security commitments to bolster Ukraine's defenses.\nThe EU has provided aid in the form of arms and equipment worth $26 billion, according to the bloc's diplomatic service.\n'Germany has had a lot of questions ... and rightfully so. We're talking about a lot of money,' said a senior diplomat, who asked to remain anonymous.\nThe debate over military aid comes as EU nations are also debating a proposal to give Ukraine almost $54 billion in economic assistance.\nSome EU members have argued they will struggle to make a big long-term pledge as domestic budgets are squeezed.\n'For some member states, there is the reality of the public finances,' said a second EU diplomat.\nAdditionally, the EU is also facing challenges meeting a target of supplying Kyiv with 1 million artillery shells and missiles by March next year.\nSmoke rises from the ruins of a farm after a recent Russian rocket attack in the village of Kiseliovka, which is close to Kherson, Ukraine, on Nov. 10, 2023.\nObstacles from Hungary\nFor months, Hungary has been holding up more than $500 million in payouts from the Peace Facility to EU members for Ukraine aid over Ukraine's blacklisting of a Hungarian bank, OTP.\nSince the bank was removed from the blacklist, Hungary has insisted on guarantees it will not return there.\nHungary's Prime Minister Viktor Orban said Friday he does not support moving forward on negotiations about Ukraine's accession in the European Union, signaling that his country could be an obstacle to Kyiv's ambitions to join the bloc.\nUnanimity among all member states is required to admit a new country into the bloc, giving Orban a powerful veto.\nIn an interview with state radio Friday, Orban said Ukraine is nowhere near gaining membership in the world's largest trading bloc.\n'The clear Hungarian position is that the negotiations must not begin,' he said.\nOrban's government has refused to supply Ukraine with weapons in the war against Russia. It also accuses Ukraine of violating the rights of an ethnic Hungarian minority in western Ukraine by restricting its use of the Hungarian language in schools.\nSome information for this report was provided by The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Amid Shelling, Kherson Marks Year Since Liberation From Russia", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274030055/amid-shelling-kherson-marks-year-since-liberation-from-russia"}