{"authors": ["James Gordon", "James Gordon For Dailymail.Com"], "date_download": "2024-02-05 15:41:02", "date_modify": "None", "date_publish": "2023-11-14 06:38:49", "description": "U.S. President Joe Biden and Chinese President Xi Jinping are set to announce an agreement for China to crack down on the manufacture and export of fentanyl.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12741957%2FXi-agrees-clean-mess-Biden-Chinese-president-announce-deal-export-limits-fentanyl-deadly-opioid-flooded-America-left-San-Francisco-facing-homeless-vagrant-crisis.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/14/05/77770349-0-image-m-63_1699940973848.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden and Xi Jinping are set to strike a deal that would see Beijing crack down on the manufacture and supply of fentanyl to the US, according to a report.\nThe two leaders will meet Wednesday on the sidelines of the Asia-Pacific Economic Cooperation (APEC) in San Francisco - their first meeting since November 2022 amid ratcheting global tensions.\nUnder the terms of the deal, China will crackdown on chemical companies making the compounds used to produce fentanyl, sources told Bloomberg.\nIn exchange, Biden will lift restrictions on China's forensic police institute - which the US says is responsible for human-rights abuses.\nDemocrat leaders have been scrambling to clean up the City by the Bay for Xi's visit - ironically in the grips of a fentanyl crisis which China has been fueling.\nSteel barriers have been erected around the major thoroughfares and drug-addicted vagrants booted off the streets - a kindness the woke government has failed to show its own taxpayers.\nIt comes as Xi's propaganda machine has been unashamedly slamming San Francisco as a 'hell' on Earth ahead of his visit. A recent headline from Chinese-language Phoenix TV said: 'San Francisco declines into a \"death loop\" as this city of freedom and love falls from heaven to hell.'\nBut it is Chinese businesses that are supplying Mexican cartels with the chemicals to make the lethal synthetic opioids that are destroying American cities.\nBiden and Xi have not spoken in a year. Their last meeting was at the Group of 20 summit in Indonesia last autumn in Bali in November 2022\nOn Friday morning, San Francisco resident Christine Johnson, 55, stood outside the Moscone Center holding a sign urging visitors to step outside the security bubble to see the homeless problem that's been temporarily swept away\nA homeless encampment is seen in Tenderloin District is seen here over the summer, a few blocks from where summit will take place Wednesday\nWith just a day before the two leaders meet, city authorities have been hurriedly moving homeless people out of sight and cleaning up neighborhoods that have become blighted by drugs and vagrants - mainly as a result of the fentanyl on the surrounding streets.\nIn an effort to show the city's best side to the leader of the second-largest economy in the world, sidewalks have been scrubbed, walls have been washed and drug addicts have been diverted away from the area - at least until Friday when the summit ends.\nBiden and Xi have not spoken in the year since their last meeting at the Group of 20 summit in Indonesia last autumn.\nBut since their last encounter, tensions between the two nations have grown following a series of events touched off by the shooting down of a Chinese spy balloon that had drifted across the U.S. earlier this year.\nA person sleeps near a security fence setup around the Moscone convention center hosting the Asia-Pacific Economic Cooperation (APEC) leaders' week in San Francisco\nA worker stands near a door on a security fence erected near Moscone Center where APEC will be held\nTony Phillips, who's been homeless for eight years, rests near a security fence on Fourth Street in San Francisco\nIt is hoped the Biden-Xi meeting will produce some concrete results, including the possible reestablishment of military communication between the two nations and a shared effort to combat illicit fentanyl trafficking.\nThe powerful opioid is the deadliest drug in the U.S. today with the Centers for Disease Control and Prevention estimated drug overdose deaths have increased more than seven times between 2015 and 2021.\nMore than 150 people die each day from overdoses related to synthetic opioids such as fentanyl.\nSan Francisco's Mayor, London Breed, has blamed the effects of the drug for the ruin of her city and exacerbating the homeless crisis.\n'Fentanyl has really devastated our city, like no other drug we've ever experienced within my lifetime,' Breed said to Bloomberg News.\n'I would ask him [Xi] to work with the US and to ensure that the resources that are being sent out of China, that come into either the US or Mexico, are cut off to the fullest extent possible.'\nThe drug was initially produced in India and China and mailed to recipients across North America. Makeshift labs have since sprung up in Mexico to receive the precursor chemicals from Asia, mix them or press them into pills, and smuggle them into the US\nMore than 150 people die each day from overdoses related to synthetic opioids such as fentanyl\nFentanyl is the leading driver of drug overdose deaths in the United States, as well as San Francisco with almost 450 deaths alone attributed to the drug in the city\nThis image from Mexico's national defense forces shows a makeshift drugs lab in northwest Mexico, where officers discovered precursor chemicals, fentanyl paste, weapons and drug making gear, from November 2021\nSan Francisco's Mayor, Loudon Reed, has blamed the effects of the drug for ruin her city and exacerbating the homeless crisis\nMexico and China are the primary sources for fentanyl and fentanyl-related substances trafficked directly into the US, according to the Drug Enforcement Administration, which is tasked with combating illicit drug trafficking.\nFentanyl is 50 times more powerful than heroin and 100 times more powerful than morphine.\nBut nearly all the chemicals needed to make fentanyl come from China, with the drugs then mass-produced in Mexico and trafficked via cartels into the U.S.\n'We're hoping to see some progress on that issue this coming week,' National Security Advisor Jake Sullivan said on Monday.\n'That could then open the door to further cooperation on other issues where we aren't just managing things but we're actually delivering tangible results.'\n'China's agreements have an unstated condition: Void if you criticize Xi and the Communist Party,' said Derek Scissors, senior fellow at the conservative American Enterprise Institute to Bloomberg.\n'If the Biden administration isn't pro-China in 2024, enforcement of a fentanyl deal will fade away.'\nSan Francisco has cleaned up several well-known homeless encampments ahead of China 's dictator Xi Jinping 's visit Wednesday - including this one on the street at 7th Street and Mission across the street from the Nancy Pelosi Federal Building in San Francisco California\nWhere tents were previously propped up, sidewalks are clear and spotless. Locales where homeless once congregated are now cleared, as if a yearslong crisis affecting countless never occurred\nIn the span of a few days, the city scrubbed seven intersections in the notorious Tenderloin and South of Market neighborhoods - a decision Newsom this past week defended ahead of the anticipated Asian summit\nOther residents - as well as fed-up activists protesting the anticipated Asia-Pacific Economic Cooperation (APEC) summit at the Moscone Center - said much of the same, waking up this week to see tents that had been stationed along Ellis Street and 13th suddenly gone\nA San Francisco City worker cleans Howard Street ahead of the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco, California, US, on Saturday\nPreparations for the summit are evident around San Francisco.\nThe city has erected tall steel barricades downtown that snake around the streets surrounding the Moscone Center and other venues where APEC events will be held this week.\nThe San Francisco Police Department has beefed up patrols throughout downtown.\nIn the area around Union Square, where many summit dignitaries have booked up the city's five-star hotels, locals have noted how the city's large homeless population seems less prevalent than usual.\nCalifornia's governor Gavin Newsom even boasted about how much work had been done to 'clean up' San Francisco ahead of the APEC Summit.\nNewsom said that work had been done on improving safety in the crime-ridden city, where robbery is up 13.7 percent, year on year, and businesses are fleeing the empty downtown.\n'I know folks are saying, 'Oh, they're just cleaning up this place because all those fancy leaders are coming to town,' said Newsom late last week.\nVolunteers clean up the city near Dolores Park in San Francisco, right near the federal building\nPresident Joe Biden is set to meet with Xi Jinping for the first time in over a year at the Moscone Center, set in the South of Market neighborhood\nHangouts along Mission Street and Market are also no more, along with a brazen open drug market that for more than a year has been outside the Nancy Pelosi Federal Building\nThe area outside the building was considered the biggest of all the open-air drug markets across the city, after suddenly sprouting up earlier this year. Usually, somewhere between 50 to 100 dealers operate on the street daily, usually doing so undeterred and in broad daylight\nThe cleanup left multiple crime hotspots virtually unrecognizable, and left many asking why similar efforts had not been made sooner\n'That's true, because it's true - but it's also true for months and months and months prior to APEC, we've been having conversations.'\nHe added: 'By definition, you have people over to your house, you're going to clean up the house.\n'We have 21 world leaders; tens of thousands of people coming from all around the globe.\n'What an opportunity to showcase the world's most extraordinary place: San Francisco.'\nIn the city's notoriously embattled downtown, video and photos taken over the course of the weekend and Monday show how the city suddenly went into overdrive ahead of Jiping's anticipated visit.\nCity workers clean the streets and remove tents and items belonging to homeless residents ahead of the APEC summit\nA homeless man is seen pushing a wheelchair loaded with his belongings while walking past the St. Regis hotel in San Francisco, as city officials take drastic measures to hide the city's dark reality during the APEC trade summit\nWorkers with the sanitation department hose down the street, washing away human feces, urine, and crack pipes\nWhere tents were previously propped up, sidewalks are clear and spotless. Locales where homeless once congregated are now cleared, as if a yearslong crisis affecting countless never occurred.\nHangouts along Mission Street and Market are no more, along with a brazen open drug market that for more than a year has been outside the Nancy Pelosi Federal Building.\nAll now immaculate, the cleaned-up streets are seen in photos and video taken from the sites Tuesday - a reality that some suspect will be pulled away one once the Chinese president packs up and leaves.\n'They started clearing the tents earlier this week and there is definitely a lot more police presence,' SoMa resident Ricci Lee Wynne told The New Post over the weekend as the city-ordered clean-up was taking place.\n'They've cleared out the tents that were near the Moscone Center on Howard Street, which tells me the city had the capability to do this all along,' the citizen added.\n'Instead, they just do the bare minimum.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Xi agrees to clean up his own mess! Biden and Chinese president will announce deal on export limits on fentanyl - after deadly opioid flooded America and left San Francisco facing homeless vagrant cri", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12741957/Xi-agrees-clean-mess-Biden-Chinese-president-announce-deal-export-limits-fentanyl-deadly-opioid-flooded-America-left-San-Francisco-facing-homeless-vagrant-crisis.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}