{"authors": ["Alice Wright", "Alice Wright For Dailymail.Com"], "date_download": "2024-02-05 15:41:05", "date_modify": "None", "date_publish": "2023-11-14 22:06:06", "description": "A married US Navy officer and father-of-two has died by suicide while his ship was moored in Cleveland, Ohio.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12749115%2FUSS-Marinettes-executive-officer-Commander-Jonathan-Volkle-dies-suicide-combat-ship-moored-Ohio.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/14/22/77800873-0-image-m-46_1699999552058.jpg", "language": "en", "localpath": null, "maintext": "A married US Navy officer and father-of-two has died by suicide while his ship was moored in Cleveland, Ohio.\nCommander Jonathan Michael Volkle was found dead on board the USS Marinette on October 27, the Navy confirmed.\nThe 44-year-old 'was found unresponsive and later pronounced deceased,' a statement from US Surface Force Atlantic said.\n'Our thoughts go out to the Volkle's family during this incredibly difficult period, and we would ask their privacy be respected.\n'Littoral Combat Ship Squadron (LCSRON) 2 is providing chaplain and mental health support to the ship's crew. Cmdr. Janet Brooms will be assigned as executive officer.'\nThe second in command of the Littoral Combat Ship had served in the Navy after enlisting in 2007, working as a career surface warfare officer.\nCommander Jonathan Michael Volkle died by suicide last month on board his ship\nThe 44-year-old 'was found unresponsive on board the USS Marinette (pictured) on October 27\nVolkle served aboard guided-missile frigate USS Kauffman, guided missile destroyers USS John McCain and USS Fitzgerald and commanded the Avenger-class mine countermeasure ship USS Patriot.\nA memorial service was held for the serviceman on Saturday, November 11, in Peeples, Florida.\nVolkle is survived by his wife Kaori Kato Volkle and two sons, Bruno and Nino, as well as his parents, Skip and Louise Volkle.\n'I met John when I started working at Destroyer Squadron 15 to coordinate US-Japan relations' friend and colleague Yuma Kuwata wrote on a page dedicated to Volkle.\n'The entire Japan Maritime Self Defense Force greatly respected John' Kuwata explained.\n'Not only did he inspire me, but he inspired an entire organization.\nVolkle had served in the Navy after enlisting in 2007, working as a career surface warfare officer\nThe USS Marinette was moored in Cleveland, Ohio when Volkle died\n'John is without a doubt the most trusted US Naval Officer by the Japan Maritime Self Defense Force and did more for US-Japan relations than any US military officer in the last 70 years of the alliance.\n'Thank you John, for showing us the way. We will carry the torch you gave us. Rest in Peace.'\nAnother friend, Christopher Homer, wrote: 'Jon was a great mate of mine in Japan when he was teaching in Tateyama.'\n'We had such a laugh telling jokes and talking about life.\n'Jon was an inspirational person who gave everyone confidence which was a pointer to his future career as a professional leader.'\nVolkle's death comes as the Navy grapples with soaring suicide rates and mental health issues in its ranks.\nIn 2022, the service saw its highest increase in death by suicide since 2019, according to USNI News.\nLast year up to ten sailors killed themselves on one ship alone, and three within one week.\nAt least five crewmembers aboard the USS George Washington (pictured) were confirmed to have died by suicide. There have been others who have tried but failed to kill themselves\nTen soldiers died by suicide one the USS George Washington with dozens more revealing suicidal thoughts.\nMore than 200 sailors were moved off the aircraft carrier following the deaths but reports of widespreasd mental health issues were later revealed to forces mental health charity the Brandon Caserta Foundation.\nSailors said they discussed killing themselves every day with each other, listed 'drugs, pills, hanging, jumping, driving into a tree, taking a bullet to the skull, slitting our wrists, toaster in the tub', confessed to feeling like their boss 'doesn't care one way or another if you live or die', said they were 'stressed' and 'isolated', and one said they wouldn't mind if a bus hit them.\nThere has been a 44 percent rise in suicides in the military since 2015, according to Department of Defense statistics.\nSince 2015, 4,842 soldiers took their own lives, 384 military personnel died of suicide in 2020.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "USS Marinette's executive officer Commander Jonathan Volkle dies by suicide while combat ship is moored in Ohio", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12749115/USS-Marinettes-executive-officer-Commander-Jonathan-Volkle-dies-suicide-combat-ship-moored-Ohio.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}