{"authors": [], "date_download": "2024-02-05 15:41:06", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "At least 300,000 people marched in the British capital on Saturday demanding an immediate ceasefire in Gaza Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030098%2Fpro-palestinian-crowds-flood-london-videos.json", "image_url": "https://cdn.bignewsnetwork.com/NmM0YjQ4YzEtODU.jpg", "language": "en", "localpath": null, "maintext": "Police blamed right-wing counter protesters for sparking \"extreme violence\" on Armistice day\nAt least 300,000 people marched in the British capital on Saturday demanding an immediate ceasefire in Gaza. London Metropolitan Police reported at least 126 arrests amid clashes with counter protesters in which nice officers were injured.\nThe largely peaceful crowds were chanting \"free Palestine\", \"ceasefire now\" and \"from the river to the sea, Palestine will be free,\" as they marched through the streets of London. The largest to date demonstration coincided with the annual Armistice Day commemorations.\nAhead of the pro-Palestinian march, a group of right-wing protesters, mainly consisting of football hooligans from across the UK, arrived in central London on a pretense of protecting monuments, but \"were already intoxicated, aggressive and clearly looking for confrontation,\" assistant commissioner Matt Twist said in a statement.\nThe violent crowd, chanting \"you're not English any more\" hailed abuses at the officers, who were protecting the Cenotaph and preventing them from confronting the pro-Palestinian activists.\n\"Nine officers were injured during the day, two requiring hospital treatment with a fractured elbow and a suspected dislocated hip. Those officers were injured on Whitehall as they prevented a violent crowd getting to the Cenotaph while a remembrance service was taking place,\" police said, adding that \"the extreme violence from the right wing protestors towards the police today was extraordinary and deeply concerning.\"\nThe Palestine Solidarity Campaign (PSC) march, which the organizers themselves estimated to be at least 500,000 strong, \"did not see the sort of physical violence carried out by the right wing,\" according to police, although a fringe group of some 150 masked people was intercepted while firing fireworks. Several arrests were made \"after some of the fireworks struck officers in the face,\" police said.\nThe unrest follows the debate earlier this week whether the pro-Palenstian protest should be permitted on Armistice day, that is traditionally observed in the UK by a two-minute silence during the 11th hour of the 11th day of the 11th marking the end of WWI in 1918.\nHome Secretary Suella Braverman was accused of fuelling the tensions by branding pro-Palestinian demonstrations as \"hate marches,\" while accusing the police of bias for letting the rally go ahead.\nLondon Mayor Sadiq Khan said that the clashes were \"encouraged and emboldened\" by senior politicians \"like the Home Secretary\" and were a \"direct result\" of her words.\nThe Prime Minister, Rich Sunak condemned the violence and hatred from both sides and called for the nations \"to come together\" to remember \"those who fought and died for our freedom.\"\nFollow LIVE UPDATES for more information", "source_domain": "www.theuknews.com", "text": null, "title": "Pro-Palestinian crowds flood London (VIDEOS)", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030098/pro-palestinian-crowds-flood-london-videos"}