{"authors": [], "date_download": "2024-02-05 15:41:10", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Communist Party of India (Marxist) MP Bikash Ranjan Bhattacharyya has stoked a political row with his remarks on Lord Shiva.", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030470%2Fcpim-west-bengal-mp-bikash-ranjan-bhattacharyya-remark-on-lord-shiva-stirs-up-row.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699792926.jpg", "language": "en", "localpath": null, "maintext": "Kolkata (West Bengal) [India], November 12 (ANI): Communist Party of India (Marxist) MP Bikash Ranjan Bhattacharyya has stoked a political row with his remarks on Lord Shiva.\nBhattacharyya in a Facebook post on November 11 recounted an incident from his childhood and asked, \"Who is keeping an account of the number of families which have been destroyed due to the belief that Mahadev (Lord Shiva) is the Guru of liqour and ganja (cannabis) consumption and will take care of the families of drunkards.\"The CPI(M) MP wrote in a Facebook post in Bengali that in his childhood he had seen a drunk postman staggering to a Shiva temple and beseeching Mahadev to take care of his family.\n\"Nakuleshwar Lane in Kalighat is a narrow lane near Mahakali Pathshala. If you enter Nakuleshwar Lane from Mahim Halder Street, after four or five houses, you can nfind a small Shiva temple. Some of us sometimes used to hang out on a cement bench of the house near the school on that street corner. One day, in the evening, I saw that the postman of the area who was in an inebriated state staggered to the temple and sat in front of it. I ran to look and saw that he was praying...'Baba, since you are the Lord of liquor and ganja, you should take care of families of those who drink',\" Bhattacharyya posted.\n\"I enjoyed listening to his prayer. The poor postman believes that the guru (God) of cannabis consumption is Mahadev himself and therefore, Mahadev should take the responsibility of taking care of the family of the drunks,\" the CPI(M) Bhattacharyya said.\nBhattacharyya's remarks have spurred a heated debate, highlighting a broader clash of views on religious interpretations.\nCriticizing Bhattacharyya's remarks, the All India Hindu Mahasabha President Swami Chakrapani Maharaj said that the Communist party is 'anti-Hindu' and is always against 'Hindu Sanatana.'\"Lord Shiva is the one who prayed for the protection of the entire world and drank poison to save the world. He doesn't consume alcohol. Bhattacharyya should come and learn about Sanatana and Lord Shiva. Little knowledge is very dangerous. The Communist Party and Congress party have only one job: to insult Sanatana Dharma,\" he said.\n\"This is condemnable, and I want to say that he should apologize immediately. If he fails to do so, we will take action against him,\" he added.\nHe further said that some people mislead Lord Shiva by portraying him as consuming Bhang (cannabis).\nEarlier this October, a political row erupted in Bihar over Rashtriya Janata Dal (RJD) MLA Fateh Bahadur Singh made an alleged derogatory statement regarding 'Goddess Durga,'. The BJP termed the RJD leader's objectionable statement against a Hindu deity as an example of \"appeasement politics.\"\"According to Manuwadis, there are 33 crore Gods and Goddesses. India's population during the British period was 30 crores. When the country was enslaved, where was Maa Durga at that time and why did she not kill the British people? Maa Durga is imaginary,\" Singh said.\nPreviously this September, Bihar Education Minister Chandra Shekhar triggered a similar controversy when he compared the Hindu scriptures Ramcharitmanas with potassium cyanide. The remarks drew sharp reactions from NDA partners in Bihar- BJP and LJP.\nThe salvo was fired as Bihar's Education Minister, Chandra Shekhar, compared the holy Ramcharitmanas to \"potassium cyanide\". (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "CPI(M) West Bengal MP Bikash Ranjan Bhattacharyya's remark on Lord Shiva stirs up row", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030470/cpim-west-bengal-mp-bikash-ranjan-bhattacharyya-remark-on-lord-shiva-stirs-up-row"}