{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Richard Luscombe", "Martin Belam", "Helen Sullivan"], "date_download": "2024-02-05 15:41:11", "date_modify": "None", "date_publish": "2023-11-14 02:14:48", "description": "This blog has closed. You can see all our Israel-Hamas war coverage here and see our latest full report on the conflict here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F13%2Fisrael-hamas-war-live-updates-al-shifa-hospital-who-us-strikes-syria-palestine.json", "image_url": "https://i.guim.co.uk/img/media/080ba006c13d3d742851191833342305fc2476bc/0_30_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=79cdccf7a720ef5173eb35e0ee630a7f", "language": "en", "localpath": null, "maintext": "From 13 Nov 2023 21.02 CET Biden says al-Shifa hospital 'must be protected' Joe Biden has said that Gaza’s largest hospital “must be protected” and called for “less intrusive action” by Israeli forces. Hundreds of patients, including dozens of babies, remain trapped inside al-Shifa hospital in Gaza City, in the north of Gaza, as Israeli troops and Hamas militants take part in heavy fighting outside it. At least 32 patients, including three premature babies, had died over the past three days, Gaza’s health ministry said. The US president, speaking in the Oval Office on Monday, said: It is my hope and expectation that there will be less intrusive action. The Israeli military has said it was providing safe corridors for people to escape intense fighting in the north and move south, but Palestinian officials inside Shifa have said the compound was surrounded by constant heavy gunfire.\n14 Nov 2023 03.14 CET It’s approaching 4.15am in Israel and Gaza and we’re going to pause the blog. In the meantime you can see all our Israel-Hamas war coverage here and see our latest full report on the conflict here. We’ll be back soon to bring you the latest developments. Here’s a summary of the key events of the past day: The Israeli military has reached the gates of Gaza’s largest hospital as hundreds of patients, including dozens of babies, remained trapped inside. Thousands of people have fled al-Shifa hospital in Gaza City, but health officials said the remaining patients were dying due to energy shortages. At least 32 patients, including three premature babies, had died in the past three days, Gaza’s Hamas-run health ministry said.\nAt least 11,240 Palestinians have been killed, including 4,630 children and 3,130 women in Gaza by the Israeli military since 7 October, the health ministry said on Monday.\nJoe Biden has said al-Shifa “must be protected” and called for “less intrusive action” by Israeli forces. “It is my hope and expectation that there will be less intrusive action,” the US president said on Monday.\nAll of the hospitals in northern Gaza are “out of service” amid fuel shortages and intense combat, the health ministry in the besieged territory said on Monday. Two major hospitals in northern Gaza – al-Shifa and al-Quds – have closed to new patients due to Israeli airstrikes and heavy fighting around both facilities as medical staff were left without oxygen, medical supplies or fuel to power incubators.\nThe director of the UN agency for Palestinian refugees, UNRWA has warned that the group’s aid operations in Gaza will be shut down in the next 48 hours unless fuel is allowed into the besieged territory. UNRWA commissioner-general Philippe Lazzarini said the agency’s fuel depot in Gaza had run dry and would no longer be able to resupply hospitals, remove sewage and provide drinking water.\nUNRWA said that one of its schools in northern Gaza and a building designated as a residence for UN international staff in the Rafah area were directly hit by strikes. It did not say who was responsible for the strikes. The UN agency also said it had received “extremely concerning” reports that Israeli security forces had entered one UNRWA school and two UNRWA health centres in the Gaza Strip with tanks and used them for military operations. Earlier, it said one of its buildings in Rafah had been struck by Israel’s navy. Rafah is in the south of the Gaza Strip, within the area Israel has insisted Palestinians move to.\nTrucks transporting desperately needed aid through the Rafah crossing from Egypt could stop operations on Tuesday due to a lack of fuel . “Humanitarian ceasefire, fuel supplies – all of these should be happening now. We are running out of time before really facing major disaster,” Andrea De Domenico, the head of the UN humanitarian affairs office in the occupied Palestinian territory, told journalists on Monday.\nIsrael claims it has uncovered a Hamas operations centre beneath the Rantisi children’s hospital in Gaza City, and evidence suggesting that hostages taken on 7 October were held there. Separately, CNN reported that “a US official with knowledge of American intelligence” said that Hamas had “a command node” under the al-Shifa hospital in Gaza City.\nAt least three Palestinians have been killed and 20 others injured after an Israeli airstrike hit Bani Suheila, a town east of Khan Younis in the Gaza Strip, health officials said on Monday.\nThe armed wing of Hamas says it discussed with Qatari mediators the release up to 70 women and children hostages in Gaza in exchange for a five-day Israeli ceasefire. Israel has rejected any possibility of a ceasefire until the release of all 240 of the hostages.\nUN workers observed a minute’s silence on Monday for the more than 100 colleagues killed in Gaza since the Israel-Hamas war began last month, marking the deadliest conflict ever for UN workers. At least 101 employees of the UNRWA have been killed since 7 October.\nIsrael’s foreign minister, Eli Cohen, has acknowledged the growing international pressure for a ceasefire. He also estimated that Israel has a “diplomatic window” of two to three weeks before pressure on the country seriously begins to increase, local media reported.\nIndonesia’s president, Joko Widodo, has urged Joe Biden to do more to stop the “atrocities” in Gaza and help bring about a ceasefire. Widodo, the leader of the world’s most populous Muslim-majority nation, held talks with the US president on Monday at the White House.\nThe EU’s humanitarian aid chief called on Monday for “meaningful” pauses in the fighting and urgent deliveries of fuel to keep hospitals working in the territory. The EU’s 27 countries issued a statement on Sunday saying hospitals “must be protected” and condemning Hamas for using the medical facilities and civilians as “human shields”.\nOne hundred US government officials from the state department and international development agency have signed an internal memo criticising the White House for “disregarding the lives of Palestinians” and for showing an “unwillingness to de-escalate” in the Israel-Hamas war.\nThe archbishop of Canterbury has called for a ceasefire in the war between Israel and Hamas, saying the scale of civilian deaths and humanitarian catastrophe in Gaza cannot be “morally justified”.\nThe EU’s foreign policy chief Josep Borrell has set out proposals for how Gaza should be run after the war between Israel and Hamas. EU foreign ministers are also looking at a Cypriot proposal to open up a maritime corridor for urgent humanitarian aid for Gaza.\nTony Blair, the former British prime minister, has let it be known that he is available if needed to help in an effort to end the growing crisis in Israel and Palestine. His office, however, denied a report in the Israeli press that he had already been offered a specific job.\nUpdated at 03.26 CET\n14 Nov 2023 02.57 CET Biden’s National Security Advisor Jake Sullivan has confirmed that Washington, which has firmly backed Israel over its offensive against Hamas, has raised the issue of protecting Gaza’s hospitals with its ally. Agence France-Presse reports: “We do not want to see firefights in hospitals,” he told a briefing. “We want to see patients protected, we want to see hospitals protected.” He added: “We have spoken with the Israeli government about this and they have said they share that view that they do not want to see firefights in hospitals.” Sullivan also said the US wanted to see “considerably longer pauses – days, not hours” in the fighting. The White House said last week that Israel had agreed to daily four-hour humanitarian pauses in the fighting to let civilians out of northern Gaza and aid in.\n14 Nov 2023 02.41 CET Brazil’s president has accused Israel of “killing innocent people without any criteria” in the Gaza Strip, deeming its actions there “as grave” as the 7 October attacks by Palestinian militant group Hamas, Agence France-Presse reports. At an official ceremony in Brasilia, Luiz Inacio Lula da Silva said: After the act of terrorism provoked by Hamas, the consequences, the solution of the state of Israel, is as grave as that of Hamas. They are killing innocent people without any criteria. The leader of Latin America’s largest country also accused Israel of “dropping bombs where there are children, hospitals, on the pretext that a terrorist is there.” “This is inexplicable. First you have to save the women and children, then you fight with whomever you want,” Lula said. View image in fullscreen Brazilian President Luiz Inacio Lula da Silva on Monday. Photograph: André Borges/EPA Representatives of Brazil’s Jewish community denounced these remarks as “erroneous”, “unfair” and “dangerous”, adding that they “put Israel and Hamas on the same level”. They defended the “visible and proven” efforts of the Israeli authorities “to save Palestinian civilians”. “Our community expects balance from our authorities,” added the Israeli Confederation of Brazil, which claims to represent some 120,000 Brazilian Jews, the second largest community in the region, in a statement. Lula’s comments came as he welcomed to Brasilia 22 Brazilians and 10 members of their families who had been evacuated from Gaza on Sunday via the land border with Egypt, after more than a month of waiting in the conflict zone.\n14 Nov 2023 02.24 CET US secretary of state Antony Blinken has written to employees to acknowledge disagreements within the state department, CNN reported on Monday, after reports that 100 US government officials have signed a memo criticising the White House for “disregarding the lives of Palestinians”. In his message on Monday, Blinken wrote: I know that for many of you, the suffering caused by this crisis is taking a profound personal toll. The anguish that comes with seeing the daily images of babies, children, elderly people, women, and other civilians suffering in this crisis is wrenching. I feel it myself. He noted that “some people in the Department may disagree with approaches we are taking or have views on what we can do better” and added that forums for employee feedback had been organised in Washington. He continued: We’re listening: what you share is informing our policy and our messages. He said the US’ “overarching objective” remained the same: To bring this terrible conflict to a close as quickly as possible, while standing by Israel’s right and obligation, in full accordance with international humanitarian law, to ensure a terrorist attack like October 7th never happens again. He also repeated that “far too many Palestinian civilians have died” and said that “much more can and should be done to reduce their suffering.” He continued: As I said in private and in public, we believe Palestinian people’s voices must be at the center of post-crisis governance in Gaza. We believe in Palestinian-led governance of Gaza, with Gaza unified with the West Bank. Gaza’s reconstruction must be supported with a sustained mechanism.\n14 Nov 2023 01.52 CET Another UNRWA staff member has been killed in Gaza due to “strikes” the UN agency for Palestinian refugees has said in its latest update, bringing the total number of UNRWA staff killed in the conflict to 102. At least 27 have been injured. The UNRWA death toll over the past month was already the highest number of UN aid workers to be killed in a conflict in the history of the UN. UN workers observed a minute’s silence on Monday for their colleagues killed in Gaza, as we reported earlier. View image in fullscreen From lefy to right: UN deputy secretary-general Amina Mohammed, UN secretary-general Antonio Guterres, president of the UN General Assembly Dennis Francis and UN chef de cabinet Courtenay Rattray observe minute of silence in memory of colleagues killed in Gaza. Photograph: Angela Weiss/AFP/Getty Images\n14 Nov 2023 01.37 CET The Israeli army has confirmed the identity of a soldier being held hostage by Hamas, after the armed wing of the Palestinian group published a video showing the young woman in captivity. The army said in a statement shortly after midnight on Tuesday: Our hearts go out to the Marciano family, whose daughter, Noa, was brutally kidnapped by the Hamas terrorist organisation. We are using all means, both intelligence and operational, to bring the hostages home.” It was the first time the army has officially confirmed a hostage’s identity since Hamas gunmen abducted about 240 people when they stormed across the militarised border from Gaza on October 7. AFP reports further: On Monday night, Hamas’ Ezzedine al-Qassam Brigades published a video of the soldier apparently reading a message in Hebrew in which she identified herself by name and identity card number and said she had been detained in Gaza for four days. “An IDF (Israel Defense Forces) representative came to the family’s home and informed them of the video’s publication,” the army statement said. “The Hamas terrorist organization continues to exploit psychological terrorism and act inhumanely, through videos and photos of the hostages, as done in the past.”\n14 Nov 2023 01.22 CET In one of his first acts as Britain’s new foreign secretary David Cameron has spoken to his US counterpart Antony Blinken about the Israel-Hamas conflict, according to a post on social media by his office. Foreign Secretary @David_Cameron spoke to @SecBlinken this evening.\nThey discussed the conflict in the Middle East, Israel’s right to self defence and the need for humanitarian pauses to allow the safe passage of aid into Gaza.\nThey also expressed their continued support for… — Foreign, Commonwealth & Development Office (@FCDOGovUK) November 13, 2023\n14 Nov 2023 01.11 CET Jason Burke Hundreds of patients, including dozens of babies, remain trapped inside Gaza’s largest hospital as Israeli troops and Hamas militants take part in heavy fighting outside it. What is happening there and why? Where is al-Shifa hospital and how important is it to healthcare in Gaza? The Dar al-Shifa (House of Healing) hospital is a sprawling complex of medical facilities in Gaza City, in the north of Gaza. Located about 500 metres from the coast and a major north-south road, it comprises a group of six-storey buildings that dominate the skyline. With between 600 and 900 beds and thousands of staff, it was the mainstay of healthcare provision locally, with a range of services that few of the other hospitals in Gaza could offer. Since the beginning of the war in Gaza, it has become a shelter for those displaced by the fighting and continuing Israeli bombardment. What are the competing claims about Hamas operations there? Israel claims that Hamas has built its headquarters in bunkers and tunnels under the hospital, effectively using the building, patients and staff as a human shield. Security officials have also said that, after the surprise attacks into Israel by Hamas which killed 1,200 Israelis, mainly civilians in their homes or at a dance party, the senior Hamas leaders have been based in a “command complex” under the hospital. Read on for more from Jason Burke’s explainer about the battle around al-Shifa hospital: What is happening at Gaza’s al-Shifa hospital and why? Read more\nUpdated at 01.18 CET\n13 Nov 2023 00.32 CET Jordan’s King Abdullah has warned that any scenario which includes the reoccupation of parts of Gaza by Israel will worsen the crisis and that continued Israeli “violations” in the West Bank and Jerusalem would “push the region towards an explosion”. In comments reported by official news agency Petra, the king said “a military or security solution” would not succeed and said the conflict had originated in the occupation and the deprivation of rights of Palestinian people. At a meeting with senior Jordanian politicians including former prime ministrers and the Senate president, he said Gaza must not be separated from the rest of the Palestinian territories and called for an end to the war and the resumption of a political process based on a two-state solution. “Any other path will end in failure and lead to further cycles of violence and destruction,” he said. View image in fullscreen Jordan's King Abdullah II speaks at his meeting with top officials in Amman on Monday. Photograph: Royal Hashemite Court/Reuters Others at the meeting “noted that the King has foreseen and repeatedly warned against the dangers witnessed today as a result of Israeli violations,” Petra reported. Jordan is home to a large population of Palestinian refugees and their descendants who fear Israel could expel Palestinians en masse from the Israeli-occupied West Bank, where Israeli settler attacks on Palestinian inhabitants have surged since Hamas’s 7 October attack on southern Israel. This is Helen Livingstone, taking over from my colleague Leonie Chao-Fong.\n13 Nov 2023 23.49 CET Indonesian president urges Biden to 'do more to end atrocities in Gaza' Indonesia’s president, Joko Widodo, has urged Joe Biden to do more to stop the “atrocities” in Gaza and help bring about a ceasefire. Widodo, the leader of the world’s most populous Muslim-majority nation, held talks with the US president on Monday at the White House. He said: Indonesia appeals to the US to do more to stop the atrocities in Gaza. He added: Ceasefire is a must for the sake of humanity. View image in fullscreen US President Joe Biden meets with Indonesian President Joko Widodo in the Oval Office at the White House. Photograph: Leah Millis/Reuters\n13 Nov 2023 23.36 CET Aid trucks could stop operations in Gaza from Tuesday due to fuel shortage, warns UN official Trucks transporting desperately needed aid through the Rafah crossing from Egypt could stop operations on Tuesday due to a lack of fuel, a senior UN humanitarian official has warned. Andrea De Domenico, the head of the UN humanitarian affairs office in the occupied Palestinian territory, told journalists in New York that “lives are hanging by a thread” in Gaza, including those of babies in incubators at hospitals that depend on fuel for electricity. Humanitarian ceasefire, fuel supplies – all of these should be happening now. We are running out of time before really facing major disaster. On Sunday, 76 trucks delivered aid into Gaza through the Rafah crossing, he said, adding: Actually, instead of a much-needed increase of this assistance, we have been informed by the colleagues of UNRWA that due to the lack of fuel, as of tomorrow the operations of receiving trucks will no longer be possible. “Operational conditions in general are deteriorating by the hour,” he added.\nUpdated at 23.37 CET\n13 Nov 2023 23.18 CET Chris McGreal A New York civil liberties group is suing Joe Biden for allegedly failing in his duty under international and US laws to prevent Israel committing genocide in Gaza. The Center for Constitutional Rights’ (CCR) complaint on behalf of several Palestinian groups and individuals alleges that Israel’s actions, including “mass killings”, the targeting of civilian infrastructure and forced expulsions, amount to genocide. The CCR said that the 1948 international convention against genocide requires the US and other countries to use their power and influence to stop the killing. The complaint argued: As Israel’s closest ally and strongest supporter, being its biggest provider of military assistance by a large margin and with Israel being the largest cumulative recipient of US foreign assistance since World War II, the United States has the means available to have a deterrent effect on Israeli officials now pursuing genocidal acts against the Palestinian people in Gaza. The lawsuit, filed in federal court in California, asks the court to bar the US from providing weapons, money and diplomatic support to Israel. It also seeks a declaration that the president, the secretary of state, Antony Blinken, and the defence secretary, Lloyd Austin, are required “to take all measures within their power to prevent Israel’s commission of genocidal acts against the Palestinian people of Gaza”. These include pressing Israel to end the bombing of Gaza, to lift its siege of the territory and to prevent the forcible expulsion of Palestinians.\n13 Nov 2023 23.10 CET UN says school and staff building 'directly hit' by strikes The UN agency for Palestinian refugees (UNRWA) has said that one of its schools in northern Gaza and a building designated as a residence for UN international staff in the Rafah area were directly hit by strikes. In its daily update on Monday, the agency said UN international staff present in Rafah had left the building 90 minutes before the strike, and that no casualties were reported. The strike “is yet another indication that nowhere is safe in Gaza”, it said. It did not say who was responsible for the strikes. The UN agency said the coordinates of the building were shared twice, including just days ago, adding: UNRWA shares coordinates of all its facilities across the Gaza Strip with parties to the conflict. UNRWA also said it had received “extremely concerning” reports that Israeli Security Forces (ISF) had entered one UNRWA school and two UNRWA health centres in the Gaza Strip with tanks and used them for military operations. It cited reports that the ISF “conducted interrogations and arrests” of internally displaced people in the installations, adding: According to the reports, IDPs were subsequently forced to leave the UNRWA installations and move south towards Wadi Gaza. Witnesses reported that Israeli Forces then struck the two health centres with artillery fire. UNRWA is further verifying these reports. If confirmed, the military use of UNRWA facilities raises serious concerns, as such use puts civilians at serious risk of harm.\nUpdated at 23.25 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: Brazil’s president accuses Israel of ‘killing innocent people’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/13/israel-hamas-war-live-updates-al-shifa-hospital-who-us-strikes-syria-palestine"}