{"authors": [], "date_download": "2024-02-05 15:41:14", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Actor Purab Kohli, who stays in London with his family spoke about celebrating Diwali in the UK and also opened up about missing the parties in Mumbai.", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274030474%2Fpurab-kohli-shares-how-he-celebrates-diwali-in-uk.json", "image_url": "https://cdn.bignewsnetwork.com/ani1699792966.jpg", "language": "en", "localpath": null, "maintext": "Mumbai (Maharashtra) [India], November 12 (ANI): Actor Purab Kohli, who stays in London with his family spoke about celebrating Diwali in the UK and also opened up about missing the parties in Mumbai.\nSpeaking to ANI about his Diwali celebration in the UK, he said, \"We tend to have a party every year on the easiest day of the Diwali week which this time is Friday. We had a great party. We try and do a proper Indian meal for all our friends because we have a few Indian friends but also a lot of British friends and they love coming and celebrating Diwali with us. We have nice drinks and nice food. We also do Lakshmi puja but that is separate and a small one that has my kids and my wife.\"Do you miss celebrating Diwali in India, the actor replied, \"Yes, I do miss the Diwali parties in Bombay with all of my close buddies and family in Bombay. There were lots of industry parties. They were always a lot of fun and I miss being around on Diwali. I was last in India during Diwali in 2018 or 2019. I was shooting and it was lots of fun. We had a few parties between the shoots. That was the last Diwali I spent there and I really miss being in India.\"When asked if his children also look forward to celebrating Diwali, he shared, \"Of course they do. They love all the presents that come and the stuff that my mother sends from India. They loved all the jalebis that arrived yesterday along with gulab jamuns and kheer. There are a lot of yummy things for children. Today we are having a Diwali party just for them and their friends. So, we have two parties--one for the adults and one for the children. They are looking forward to their party and they were very much a part of our party last night too, which was great.\"Recalling his childhood memories of Diwali, he shared, \"There are so many. Generally, the memories are of being surrounded by family and friends, meeting up, playing card games, and eating great food.\"(ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Purab Kohli shares how he celebrates Diwali in UK", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274030474/purab-kohli-shares-how-he-celebrates-diwali-in-uk"}