{"authors": [], "date_download": "2024-02-05 15:41:18", "date_modify": "None", "date_publish": "2023-11-13 09:40:06", "description": "The United States and South Korea have updated a bilateral security agreement to more effectively counter North Korea’s evolving nuclear and missile threats", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fsouth-korea-ap-lloyd-austin-austin-russia-b2446271.html.json", "image_url": "https://static.independent.co.uk/2023/11/13/09/South_Korea_US_Austin_48354.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States and South Korea on Monday updated a bilateral security agreement with the aim of more effectively countering North Korea’s evolving nuclear and missile threats.\nThe move followed high-level military talks in Seoul, where the allies also discussed enhancing three-way defense exercises with Japan and improving information-sharing on North Korean missile launches.\nU.S. Defense Secretary Lloyd Austin was in Seoul for annual security talks with South Korean military officials, including Defense Minister Shin Won-sik, which were focused on boosting nuclear deterrence against North Korea. They also talked about how the allies could coordinate over broader geopolitical issues, including Russia’s war on Ukraine and China’s regional assertiveness, Austin said.\nTensions between the Koreas are at their highest point in years as the pace of both North Korea’s weapons tests and South Korea’s combined military exercises with the United States have intensified in a cycle of tit-for-tat.\nDuring their Security Consultative Meeting, Austin and Shin signed a new version of their countries’ Tailored Deterrence Strategy agreement, which was revised for the first time in a decade to address the growing threat of the North’s military nuclear program.\nShin said the new document spells out that the United States would mobilize its full range of military capabilities, including nuclear ones, to defend the South in the event of a North Korean nuclear attack. He also said the document will provide a template for the allies to strategize how South Korea could assist U.S. nuclear operations in such events with its conventional capabilities but didn’t elaborate further.\n“Our deterrence commitment to the ROK remains ironclad — that includes a full range of our nuclear, conventional and missile defense capabilities,” Austin said at a news conference, referring to South Korea’s formal name, the Republic of Korea.\nAustin said the U.S. deployments of major military assets to South Korea in recent months, which included a U.S. nuclear ballistic missile submarine, a nuclear-capable B-52 bomber and aircraft carriers, demonstrated the U.S. commitment to defense of the South. He said another U.S. aircraft carrier battle group will travel to the region soon in a further show of force.\nShin said the allies, after conducting their largest-ever live-fire training this year, will continue to further expand their combined military exercises to deter and respond to North Korean threats.\nThe United States and the government of conservative South Korean President Yoon Suk Yeol have also been strengthening their trilateral security cooperation with Japan, which has included joint military exercises and tightened defense planning, in response to North Korea’s intensifying weapons development and verbal threats of nuclear conflict.\nArriving in South Korea over the weekend, Austin earlier met Shin during a three-way meeting with Japanese Defense Minister Minoru Kihara, who participated in the talks through online video. They agreed to start as planned a real-time information sharing arrangement on North Korean missile launches in December. They also agreed to set up multiyear plans in coming weeks to enhance their trilateral military exercises, South Korea’s Defense Ministry said.\nAustin also on Sunday met Yoon, who expressed satisfaction over the increased consultations with Washington over nuclear deterrence plans and the more frequent deployment of advanced U.S. military assets to the Korean Peninsula in past months, which he described as crucial for keeping the North’s nuclear and missile threats in check.\nYoon also stressed that the allies should be prepared for any type of provocation by the North, including a “Hamas-style surprise attack,” and insisted that North Korea was “directly and indirectly” involved in Russia’s war on Ukraine and the clashes between Israel and Hamas, according to his office.\nU.S. and South Korean officials have accused North Korea of providing munitions and military equipment to Russia to help boost its war in Ukraine. South Korean officials have said North Korea-made rocket-propelled grenades and other weapons could have been used by Hamas during its Oct. 7 assault on Israel and that the North could be considering selling weapons to militant groups in the Middle East amid a deepening confrontation with the United States.\nThe surprise attack on Israel by Hamas has raised concerns in South Korea about the possibility of a similar assault by North Korea and prompted the Yoon government to openly discuss suspending a 2018 inter-Korean military agreement on reducing border tensions to strengthen front-line surveillance on the North.\nThe agreement, reached during a brief period of diplomacy between South Korea’s former liberal President Moon Jae-in and North Korean leader Kim Jong Un, created buffer zones along land and sea boundaries and no-fly zones above the border to prevent clashes. Shin has been a vocal critic of the agreement, particularly the no-fly zones, which he insists prevents South Korea from fully utilizing its air surveillance assets at a time when North Korean nuclear threats are growing.\nWithout elaborating, Austin said he discussed the inter-Korean agreement with Shin and that the allies will “stay in close consultation” on the issue moving forward.\nAustin’s meetings in South Korea followed a visit by U.S. Secretary of State Antony Blinken, who met with Yoon and other members of South Korea’s leadership to discuss the North Korean threat and the potential arms cooperation between Pyongyang and Moscow.\nU.S. and South Korean officials say Kim in return for providing munitions to Russia could seek Russian help to upgrade his own military capabilities, possibly including technical assistance on North Korean efforts to launch its first military spy satellite following two consecutive launch failures in recent months.\nNorth Korean state media had condemned the visits.\nOn Tuesday, Austin and Shin will participate in an inaugural defense ministerial meeting between South Korea and the U.S.-led United Nations Command member states, which sent forces to fight on behalf of the South during the 1950-53 Korean War.\nThe North’s Foreign Ministry on Monday criticized the planned meeting, calling it a “dangerous scheme to ignite a new war of aggression” against the North.", "source_domain": "www.independent.co.uk", "text": null, "title": "US and South Korea sharpen deterrence plans over North Korean nuclear threat", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/south-korea-ap-lloyd-austin-austin-russia-b2446271.html"}