{"authors": ["Ross Ibbetson", "Ross Ibbetson For Dailymail.Com"], "date_download": "2024-02-05 15:16:26", "date_modify": "None", "date_publish": "2024-01-23 21:54:22", "description": "The attack was in retaliation for ballistic missiles fired at Al-Asad airbase on Saturday that left four US personnel with traumatic brain injuries, officials said.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12998305%2FUS-launches-airstrikes-Iran-backed-terrorists-Iraq-retaliation-missile-attack-American-airbase-injured-troops.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/24/02/80390043-0-image-a-27_1706064260564.jpg", "language": "en", "localpath": null, "maintext": "The United States on Tuesday launched a series of airstrikes on Iran-backed terrorists in Iraq - the latest in a series designed to deter the militia from attacking U.S. bases and personnel in the region.\nThe bombs struck three sites used by the Kataib Hezbollah militia group and other Iran-backed jihadists, according to the Pentagon.\nThe assault was in retaliation for ballistic missiles fired at Al-Asad airbase on Saturday that left four US personnel with traumatic brain injuries, officials said.\nThe Pentagon did not say where the targets were located, but footage on social media showed people picking through the debris of a badly-damaged building in the town of Qa'im, in western Iraq near the border with Syria. Another city south of Baghdad, Jurf al-Sakhar, was also targeted, CNN reported.\nUS Central Command said their forces 'conducted unilateral airstrikes' targeting 'KH headquarters, storage, and training locations for rocket, missile, and one-way attack UAV capabilities.'\nJaafar Al-Hussaini, a spokesman for Kataib Hezbollah, said that the airstrikes change nothing, OSINT Defender reported.\nFootage shared on social media appeared to show the aftermath of the air strikes in the town of Qa'im, in western Iraq near the Syrian border\nThe badly-damaged building in Qa'im, western Iraq, is pictured following Tuesday's air strikes\nHe wrote on X that the group will 'continue to strike the strongholds of the enemies, in support of our people in Gaza until the brutal killing machine backed by America stops, and the complete siege is lifted. This is the promise of the free people.'\nThe strikes come after the US and Britain on Monday night bombed Houthi targets in Yemen for a second time this month.\nThere have been more that 150 rocket and drone attacks on US bases in Iraq and Syria since the outbreak of the Israel-Hamas war in Gaza over Washington's support for Jerusalem.\nThere are still around 2,500 US troops in Iraq and 900 in Syria to quell Islamist militants.\nDefense Secretary Lloyd Austin said in a statement: 'Today, at President Biden's direction, US military forces conducted necessary and proportionate strikes on three facilities used by the Iranian-backed Kataib Hezbollah militia group and other Iran-affiliated groups in Iraq.\n'These precision strikes are in direct response to a series of escalatory attacks against US and Coalition personnel in Iraq and Syria by Iranian-sponsored militias.\n'I am grateful for both the skill and professionalism with which our personnel planned and conducted these strikes and the continued efforts of our troops on the ground as they work with regional partners to further dismantle and degrade ISIS.\n'The President and I will not hesitate to take necessary action to defend them and our interests. We do not seek to escalate conflict in the region. We are fully prepared to take further measures to protect our people and our facilities. We call on these groups and their Iranian sponsors to immediately cease these attacks.'\nUS personnel suffered minor injuries and a member of Iraq 's security forces was seriously wounded in an attack on Iraq's Ain al-Asad air base on Saturday\nA picture taken on January 13, 2020 shows a member the US forces walking past a drone in the Ain al-Asad airbase in the western Iraqi province of Anbar\nIraq is deeply concerned about becoming a battleground between the United States, Israel and Iran.\nIraq's Prime Minister Mohammed Shia al-Sudani's office announced moves to evict US forces following an American drone strike in Baghdad that was condemned by the government.\nThe Pentagon said the strike killed a militia leader responsible for recent attacks on US personnel.\nThe Pentagon said it has not been formally notified of any plans to end its presence in the country, and says its troops are deployed to Iraq at the invitation of the government in Baghdad.\nIran last week struck Erbil, the capital of Iraq's semi-autonomous Kurdistan region, with ballistic missiles in what it said was an attack on an Israeli spy headquarters - claims denied by Iraqi and Iraqi Kurdish officials.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US launches airstrikes on Iran-backed terrorists in Iraq in retaliation for missile attack on American airbase that injured troops", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12998305/US-launches-airstrikes-Iran-backed-terrorists-Iraq-retaliation-missile-attack-American-airbase-injured-troops.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}