{"authors": ["Ellie Doughty"], "date_download": "2024-02-05 15:41:19", "date_modify": "None", "date_publish": "2023-11-13 11:52:45", "description": "ISRAEL has released footage of the formidable Arrow-3 weapons system following its first successful interception of a hostile rocket.The \"missile-kil", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24718519%2Fisrael-releases-footage-of-hypersonic-arrow-missile-killer%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/newspress-collage-24718519-1699876314366.jpg?1699876328&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "ISRAEL has released footage of the formidable Arrow-3 weapons system following its first successful interception of a hostile rocket.\nThe \"missile-killer\" was unleashed after Yemen's Iran-backed Houthi rebels launched a barrage of rockets at Israel last week.\n6 Dramatic footage released by Israel shows the Arrow-3 system in action Credit: Ministry of Defence\n6 The hypersonic missile soars into the sky in a long reaching arch to seek and destroy its target\n6 It was used last week to destroy ballistic missiles thought to be shot towards Israel by Yemen-backed Houthi rebels Credit: IAI\nThe Arrow lethal long-range air defence system is able to intercept ballistic missiles from thousands of miles away and blast them out of the sky.\nIsrael released dramatic new footage today of the fierce technology being launched following it's first successful interception on November 9.\nThe hypersonic missile is launched in a cloud of smoke and fire before it soars into the sky in a long reaching arch to find its target.\nArrow 3's flight range is reportedly around 1,500 miles, and it can drastically change direction to target approaching objects.\nA rocket, likely shot by Houthi fighters, was intercepted near the Red Sea by IDF fighter jets using the \"missile-killer\".\nIsraeli forces said: \"A missile was detected that was launched into the territory of the State of Israel and was successfully intercepted in the Red Sea area, by the air defense fighters using the long-range defense system \"Arrow\".\n\"The target did not cross into Israeli territory.\"\nA military spokesperson for Houthi on Thursday confirmed they had fired the barrage of ballistic missiles, including at some of the military bases.\nOne was in the coastal city of Eilat, which runs alongside the Red Sea where the rocket was shot down.\nIsrael's Arrow 3 is thought to be the world's first operational and stand-alone defence system that can be used against tactical ballistic missiles.\nThe powerful state-of-the-art piece of kit detects, tracks and then fires a hit-to-kill warhead to intercept the incoming missile.\nIt can cleanly blast the incoming warheads out of the sky, therefore preventing damage to buildings and civilians.\nThe fearsome anti-missile launcher can be used to defend Israel in conjunction with the \"Iron Dome\" - dubbed the \"guardian of the skies\" as well as the \"Iron Sting\" and \"Iron Beam\" weapons systems.\nIt comes as the IDF ground operation into Gaza Strip continues and the regions surpass a month since Hamas' deadly October 7 attacks sparked an all-out war.\nAccording to the IDF, Hamas has lost control of northern Gaza after claiming to have \"divided the enclave\" in two.\nIsrael continues to hunt down terrorist strongholds in Gaza, including one crucial Hamas cell they captured last week after a bloody ten-hour gunfight.\nCountless weapons, tunnel openings and Hamas battle plans have been recovered during the raids - including in schools, mosques and homes.\n6 It's the first time the lethal system has successfully intercepted a hostile attack Credit: Ministry of Defence\n6 The powerful kit detects, tracks and then fires a hit-to-kill warhead to intercept the incoming missile Credit: Missile Defence Agency", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israel releases footage of hypersonic Arrow-3 ‘missile killer’ after first-ever interception as it blasts rocket", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24718519/israel-releases-footage-of-hypersonic-arrow-missile-killer/"}