{"authors": ["Rachael Bunyan", "Summer Goodkind"], "date_download": "2024-02-05 15:41:21", "date_modify": "None", "date_publish": "2023-11-13 11:03:09", "description": "While fighting has so far been largely concentrated around Al Shifa hospital, the IDF released footage this afternoon of Hamas fighters outside al-Quds hospital, carrying RPG's into the facility.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12742815%2FIDF-reach-gates-Gaza-hospital-hiding-Hamas-HQ-Israel-forces-enter-facility-uncover-terror-groups-secret-base.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/15/77741955-0-image-a-56_1699890400417.jpg", "language": "en", "localpath": null, "maintext": "Hamas fighters carrying RPGs have engaged in a firefight with IDF troops at a Gaza hospital this afternoon, Israel claims - as Tel Aviv's forces continue to surround a medical facility believed to be hiding the terrorists' headquarters.\nWhile fighting has so far been largely concentrated in a tightening circle around Al Shifa, Gaza's biggest hospital, the Israel Defense Forces released footage this afternoon claiming to show Hamas fighters with RPGs outside a second hospital in the territory, al-Quds.\nThe IDF said some of its troops were fired at from the entrance of the hospital, where militants had 'embedded' themselves among civilians. But the force engaged with the fighters and 'subsequently eliminated' them, they say.\n'RPG fire and small arms fire were directed at the soldiers from the direction of the al Quds Hospital in Gaza City,' the IDF said in a statement.\n'The shooting was carried out by a terrorist squad that had embedded itself within a group of civilians at the entrance of the hospital.'\nHamas fighters carrying RPGs have engaged in a 'firefight' with IDF troops at al-Quds hospital in Gaza\nIt said a tank was damaged in the exchange, and some Hamas fighters were able to make their way back inside the hospital after a firefight\nIsraeli soldiers take position during the ongoing ground operation in Gaza\nIsraeli military vehicles manoeuvre during continued conflict in Gaza\nIt said a tank was damaged in the exchange, and some Hamas fighters were able to make their way back inside the hospital after a firefight.\n'During the incident, approximately 21 terrorists were killed and there were no casualties to our forces.'\nIt is unclear if any civilians were hurt in the exchange.\n'During the exchange of fire, civilians were seen leaving the hospital building, and other terrorists who came out of adjacent buildings hid among them and joined the attempted attack,' the IDF said.\n'After the terrorists fired RPGs, they returned to hide in the hospital.'\nMeanwhile, Israeli forces today reached the gates of Gaza City's main hospital under which the IDF has insisted Hamas terrorists have their headquarters in makeshift tunnels.\nScores of Israeli soldiers and tanks have now surrounded the sprawling Al Shifa hospital where thousands of patients and civilians remain trapped in what could be a pivotal moment in the bloody war.\nGaza health ministry spokesperson Qidra said an Israel tank was now stationed at the hospital gate. Israeli snipers and drones were firing into the hospital, making it impossible for medics and patients to move around.\n'We are besieged and are inside a circle of death,' he said.\nIsraeli forces appear ready to enter the hospital where they have consistently insisted that Hamas terrorists are hiding in underground tunnels beneath the building and using the patients as shields.\nThis would prove a key moment in the war and show once and for all whether Hamas terrorists have indeed based their secret headquarters underneath the hospital. But any such move by the Israeli forces to enter the hospital would see civilians, patients and doctors in the middle of fierce battles.\nThe Al Shifa hospital, which the World Health Organisation has said is 'no longer functioning', has been a primary target for Israeli troops in their battle to seize control of the northern half of the Gaza Strip. Medics and the thousands of civilians trapped inside have told how newborn babies and patients are dying for lack of fuel.\nIsrael has been unrelenting in its military campaign to annihilate Hamas since the terrorists rampaged through southern Israel and slaughtered 1,400 Israelis as they fled their homes or a music festival on October 7.\nIsraeli soldiers walk through the destroyed streets of the Gaza Strip during battles against Hamas terrorists\nAn Israeli soldier takes position, amid the ongoing ground operation of the Israeli army against Hamas terrorists, in Gaza Strip\nA man carries a Palestinian child at a hospital following Israeli strikes, amid the ongoing conflict between Israel and the terrorist group Hamas in Khan Younis, on Monday\nSmoke rises following an Israeli airstrike in the Gaza Strip, as seen from southern Israel on Monday\nIsrael's withering airstrikes, which have killed more than 11,000 people according to the Hamas-run Health Ministry in Gaza, were quickly followed by a ground invasion that has seen soldiers quickly encircle Gaza City.\nFighting has since been concentrated in a tightening circle around the Al Shifa hospital, the enclave's biggest, where thousands of civilians sought shelter.\nAbout 650 patients, 500 healthcare workers and an estimated 2,500 displaced people remain in the sprawling Shifa hospital compound, said Mohammed Zaqout, director of hospitals in Gaza.\nIsrael says the hospital is the prime example of Hamas's alleged use of human shields, claiming that the militants have a command centre and other military infrastructure in and beneath the medical compound. Hamas and hospital staff deny those allegations.\nGaza health ministry spokesperson Ashraf Al-Qidra, who was inside the Al Shifa hospital in Gaza city, said an Israel tank was today stationed at the hospital gate.\n'The tank is outside the gate of the outpatient clinic department, this is how the situation looks this morning,' Qidra said.\nAs witnesses reported more 'violent fighting', overnight aerial bombardments and the clatter of gunfire echoed across the sprawling Al Shifa hospital at the heart of the Gaza City, now an urban war zone.\nIsrael has told civilians to leave and medics to send patients elsewhere. It says it has attempted to evacuate babies from the neo-natal ward and left 300 litres of fuel to power emergency generators at the hospital entrance, but the offers were blocked by Hamas.\nQidra, the Gaza health ministry spokesperson, denied rejecting the offers of fuel but said the 300 litres would power the hospital for just half an hour.\nPalestinians including children are brought to Nasser Hospital for treatment aftermath of Israeli attack in Khan Yunis, Gaza, on Monday\nA wounded Palestinian woman from the Baraka family is surrounded by her children upon their arrival at Nasser Hostpial in Khan Yunis in the southern Gaza Strip following Israeli air strikes that hit their building on Monday\nNewborns are placed in bed after being taken off incubators in Gaza's Al Shifa hospital after power outage, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Gaza City, on Sunday\nWomen cry as relatives of Baraka family mourn their family members at a hospital, following Israeli strikes, on Monday\nIsraeli tanks cross a barbed wire fence at a position along the border with the Gaza Strip and southern Israel on Sunday\nAn Israeli tank rolls near Sderot along the border with the Gaza Strip\nIsraeli military vehicles are lined up on a beach, amid the ongoing ground operation of the Israeli army against Palestinian Islamist group Hamas, in the Gaza Strip\nShifa needed 8,000-10,000 litres of fuel per day, which must be delivered by the Red Cross or an international aid agency, he said.\nAn Israeli official who requested anonymity said 300 litres could last several hours because only the emergency room was now operating, reducing the hospital's need for fuel.\nThe Hamas government's deputy health minister Youssef Abu Rish said six premature babies had died in the hospital along with nine other patients in intensive care due to the lack of electricity.\nA surgeon at the hospital, Dr Ahmed El Mokhallalati, said on Sunday bombing had forced staff to line up premature babies on ordinary beds, using the little power available to run warm them.\n'We are expecting to lose more of them day by day,' he said.\nAl Shifa was 'not functioning as a hospital anymore', World Health Organization chief Tedros Adhanom Ghebreyesus said in a post on X.\n'Tragically, the number of patient fatalities has increased significantly,' he said. 'The world cannot stand silent while hospitals, which should be safe havens, are transformed into scenes of death, devastation, and despair.'\nThe more than month-long conflict has polarised the world, with many countries saying that even the shocking brutality of the Hamas attacks did not justify an Israeli response that has killed so many civilians in a crowded territory under siege.\nIsrael says it must destroy Hamas, and the blame for harm to civilians falls on fighters who intentionally hide among them. It has rejected demands for a ceasefire, which it says would only prolong the suffering by giving Hamas a chance to regroup, a position supported by Washington, which nevertheless says it is pressing its ally to protect civilians.\n'The United States does not want to see firefights in hospitals where innocent people, patients receiving medical care, are caught in the crossfire and we've had active consultations with the Israeli Defence Forces on this,' White House National Security Adviser Jake Sullivan told CBS News.\nEU foreign policy chief Josep Borrell also urged Israel to show 'maximum restraint' while condemning Hamas for using 'hospitals and civilians as human shields'.\nThe Israel Defense Forces on Monday reported more heavy fighting and again stressed its claim that Hamas was hiding in civilian infrastructure.\n'IDF troops are continuing to conduct raids... targeting terrorist infrastructure located in central governmental institutions in the heart of the civilian population, including schools, universities, mosques and residences of terrorists,' it said.\nIsraeli forces had entered Gaza's Abu Bakr mosque and found 'a large number of explosive devices and flammable materials' as well as weapons, military equipment and Hamas operational plans, it said.\nA wounded Palestinian child from the Baraka family arrives at Nasser Hostpial for treatment in Khan Yunis in the southern Gaza Strip, following Israeli air strikes that hit their building on Monday\nA wounded Palestinian child and other members of the Baraka family arrive at Nasser Hospital in Khan Yunis, following Israeli air strikes that hit their building in the southern Gaza Strip city on Monday\nPeople carry the bodies of the Kadih family members killed in Israeli attacks after attending a funeral prayers in Khan Yunis, Gaza, on Monday\nPeople cry and hold each other as relatives of Baraka and Abu Reda family mourn their family members at a hospital, following Israeli strikes in Khan Younis on Monday\nIn another operation, 'IDF ground troops entered the residence of a senior Islamic Jihad terrorist and located a large number of weapons inside the kids' room of the residence'.\nIsrael's Prime Minister Benjamin Netanyahu has ruled out calls for a ceasefire, saying Hamas must first release the hostages.\nHundreds of thousands of civilians are believed to remain in the northern part of Gaza where the fighting is focused, despite Israel's order to leave. Israel has also regularly bombed the south, leaving Gazans saying they have nowhere safe to go.\nThe order to leave the north amounted to a choice 'whether to stay in your home, where your memories are and where you were born, and go to nowhere or be bombed,' said Ahmed, 42, reached by phone in the Jabalia refugee camp in northern Gaza.\n'Most of the people in Jabalia didn't leave and they don't want to leave. Israel doesn't differentiate between north and south,' he said.\nIn the south, Israeli planes bombed several houses in Khan Younis. In one strike health officials said seven people were killed and several wounded.\nAt Nasser Hospital, people in private cars brought casualties including children to the emergency department.\n'There are dead bodies under the rubble, we need ambulances,' one of the men cried.\nIsrael continues to strike what it says are terrorist targets across southern Gaza, often killing women and children.\nMore than 11,000 Palestinians, two-thirds of them women and children, have been killed since the war began, according to the Health Ministry in Gaza, which does not differentiate between civilian and militant deaths. About 2,700 people have been reported missing.\nHealth officials have not updated that toll since Friday because of the difficulty of accessing hard-hit areas and collecting information.\nAt least 1,400 people have been killed on the Israeli side, mostly civilians killed in the initial Hamas attack.\nHamas terrorists are holding nearly 240 hostages seized in the raid, including men, women, children and older adults. The military says 44 soldiers have been killed in ground operations in Gaza.\nThe conflict has raised fears of a broader conflagration. Lebanon-based Hezbollah, which like Hamas is backed by Iran, has traded missile attacks with Israel, and other Iran-backed groups in Iraq and Syria have launched at least 40 separate drone and rocket attacks on U.S. forces.\nThe United States carried out two air strikes in Syria against Iran-aligned groups on Sunday, a U.S. defence official said, in what appeared to be the latest response to the attacks.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hamas fighters with RPGs 'engage in firefight with IDF troops at Gaza hospital' as Israel also surrounds second medical facility believed to be hiding the terrorists' HQ in 'circle of death'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12742815/IDF-reach-gates-Gaza-hospital-hiding-Hamas-HQ-Israel-forces-enter-facility-uncover-terror-groups-secret-base.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}