{"authors": ["Rachel Hagan"], "date_download": "2024-02-05 15:41:22", "date_modify": "None", "date_publish": "2023-11-14 07:36:48", "description": "Israeli authorities have still not granted permission for bodies to leave the hospital to be buried and dogs have now entered the hospital grounds and started eating the bodies", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fisrael-palestine-gaza-war-live-31418814.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31434953.ece/ALTERNATES/s1200/0_APTOPIX-Israel-Palestinians-23318364637600.jpg", "language": "en", "localpath": null, "maintext": "Stray dogs were eating the bodies of slain Palestinians which have piled up in the yard of Gaza's largest hospital Al-Shifa, the Palestinian Authority Minister of Health has said.\nHundreds of bodies are waiting to be buried as intense bombardment around the hospital has hindered operations. Doctors now fear disease outbreaks as the bodies are piling up and rotting. Dr Mohamed Abu Selmia, Al-Shifa's manager, told the BBC there were about 150 bodies decomposing, \"leaving unpleasant odours\".\nDr Selmia said the Israeli authorities had still not granted permission for those bodies to leave the hospital to be buried and that dogs had now entered the hospital grounds and started eating the bodies. Gaza’s Health Ministry official Munir al-Bursh also said yesterday, while sobbing uncontrollably, that \"rabid dogs kept eating at the bodies\", despite their best efforts to chase them away.\nAhmad Mukhallati, the head of the plastic surgery department at the hospital, told Middle East Eye: \"The bodies will really be the big source of infection and all kinds of bacteria and other diseases, and then we can't do anything.\"\nAs it stands, more than 11,000 Gazans have been slaughtered since October 7, the majority of them women and children and Israel's allies are struggling to maintain their unconditional support. Tonnes of ambulance vans have been arriving at the hospital in Khan Younis, where children have been hauntingly pictured wailing over corpses.\nThis blog has ended..", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel conflict: 'Stray dogs eat corpses' at Al-Shifa hospital as kids mourn the dead", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/israel-palestine-gaza-war-live-31418814"}