{"authors": ["Stephen M. Lepore", "James Nye For Dailymail.Com"], "date_download": "2024-02-05 15:41:24", "date_modify": "None", "date_publish": "2023-11-13 01:44:29", "description": "Biden orders wave of airstrikes on Iranian facilities in Syria linked to dozens of attacks on US forces after Hamas atrocities in Israel.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12741605%2FBiden-orders-wave-airstrikes-Iranian-facilities-Syria-linked-dozens-attacks-forces-Hamas-atrocities-Israel-significant-escalation-violence-region.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/04/77725273-0-image-m-25_1699851585503.jpg", "language": "en", "localpath": null, "maintext": "President Biden ordered airstrikes against two facilities in Syria used by Iran's Islamic Revolutionary Guards on Sunday.\nThe strikes, carried out by Air Force F-15E fighter jets are the latest retaliatory attacks for the daily barrage of rocket hits on US forces in Iraq and Syria.\nThe US jets hit structures in Abu Kamal and a safe house in Mayadin - used for weapons and ammunition storage and command and control HQs.\nThe attacks come four days after US warplanes hit a munitions depot in eastern Syria and the same day five US Army soldiers were killed in a helicopter crash in the Mediterranean Sea.\nTwo weeks ago, two Iranian-controlled sites in similar locations were hit by U.S. airstrikes in retaliation for a flurry of attacks against U.S. bases in Syria and Iraq.\nOn Saturday, Pentagon officials told DailyMail.com that 'multiple one-way drones' were launched in the morning against US and coalition forces stationed at Rumalyn Landing Zone in northern Syria.\nPresident Biden order airstrikes against two facilities in Syria used by Iran 's Islamic Revolutionary Guards on Sunday\nThe US jets hit structures in Abu Kamal and a safe house in Mayadin - used for weapons and ammunition storage and command and control HQs\n'The President has no higher priority than the safety of U.S. personnel, and he directed today's action to make clear that the United States will defend itself, its personnel, and its interests,' Defense Secretary Lloyd Austin said in a statement on Sunday's strikes.\nLocal sources also said the strikes targeted a camp run by pro-Iranian militias in an area west of Albu Kamal, in Deir al Zor province.\nThe other strike was near a bridge close to the city of Mayadeen, near the Iraqi border and stronghold of pro-Iranian militias, the sources said.\nThe source of the drone strikes against US forces in Syria on Saturday was not immediately clear, but similar strikes in recent week have been attributed to Iran-backed militants operating under the umbrella of the Islamic Resistance in Iraq.\nFor years, Iran has supplied its Qasef-1 drones and other UAV munitions to its proxies in the region, including militant groups in Syria, Lebanon, Iraq, Yemen, and Gaza.\nRumalyn Landing Zone was also targeted by a 107mm rocket attack on October 8, one day after Hamas launched its sneak attack on Israel that left 1,400 dead, most of them civilians.\nThe American strike Sunday is the third since October 26 as the United States attempts to quell wave after wave of drone and rocket attacks against American troops in Syria and Iraq, triggered by the Israel-Hamas war.\nTwo weeks earlier, the U.S. sent two F-16 fighter jets to attack a weapons storage facility and an ammunition plant near Abu Kamal.\nUS soldiers with the 1st Armored Division are seen operating in Syria in 2020. There are about 900 US troops in Syria today, most of them in the east\nIranian President Ebrahim Raisi (center) and Syrian President Bashar Al-Assad (right) are seen Saturday during a bilateral meeting in Riyadh, Saudi Arabia. Iran-backed forces established a foothold in Syria while fighting in support of Assad during the country's civil war\nBoth sites were run by Iran's Revolutionary Guard Corps, the Pentagon said.\nThe Pentagon said the strikes were not connected to the Israel-Hamas war, but analysts said they were designed to send a warning to Iran not to take advantage of the regional turmoil.\nIran's Foreign Minister, Hossein Amir-Abdollahian, said at the United Nations on Thursday that if Israel's offensive against Hamas does not end, the United States will 'not be spared from this fire'.\nThere was no report of any casualties in the 4:30am strike, and a U.S. official told Voice of America's Jeff Seldin that the locations were chosen because there were no civilians present.\nIt is the first time since March that the Biden administration has authorized strikes against Iranian-linked targets in Syria and Iraq, and comes after a series of assaults beginning on October 17.\nThe attacks against multiple U.S.-controlled sites in the region resulted in minor injuries to 21 U.S. service members, and the death of an American contractor, who died from a heart attack during one attack.\nIran and its supporters say the United States shares responsibility for Israel's declared war against Palestinian militant group Hamas, which is also backed by Iran.\nU.S. and coalition troops have been attacked at least 40 times in Iraq and Syria by Iran-backed forces in recent weeks.\nAmerica strikes back: US warplanes conduct airstrikes against Iranian proxy forces in Syria in retaliation for attacks against US troops in Middle East\nAt least 45 U.S. troops have suffered traumatic brain injuries or minor wounds.\nPresident Joe Biden has warned Iran's supreme leader Ayatollah Ali Khamenei not to attack U.S. forces in the region, and said there would be consequences.\n'My warning to the Ayatollah was that if they continue to move against those troops, we will respond,' said Biden.\nThe United States has 900 troops in Syria, and 2,500 more in neighboring Iraq, on a mission to advise and assist local forces trying to prevent a resurgence of Islamic State, which in 2014 seized large swathes of both countries but was later defeated.\nA U.S. official, speaking on condition of anonymity, said the strikes took place within the past several of hours and added that a U.S. review was underway to determine whether the they killed or wounded anyone.\nThere is growing concern that the Israel-Hamas conflict could spread through the Middle East and turn U.S. troops at isolated bases into targets.\nBenjamin Netanyahu says his Israeli Defense Forces will be able to swiftly defeat Hamas terrorists operating out of Gaza as he previews release of more hostages.\nThe Israeli prime minister took a dig at American efforts to take-out al-Qaeda and ISIS terrorist organizations, claiming Israel will act faster in defeating Hamas.\nThis image from video provided by the Department of Defense shows a November 8, 2023, airstrike on a weapons warehouse in eastern Syria\nIt comes as he dodged questions from CNN on whether he would take responsibility for not preventing the terrorist attacks on October 7. Many claim there was an intelligence failure on the part of Israel's government.\nThe conflict between Israel and Hamas has been ongoing for more than a month.\n'I don't think it's going to take the time that it took the United States and the international coalition to defeat ISIS or to defeat al-Qaeda. It took you many years. I don't think it's going to be many years,' Netanyahu told NBC News host Kristen Welker during a Sunday interview on Meet the Press.\nHe also claimed that there are negotiations for the release of more hostages from the Palestinian enclave of Gaza, where Hamas is the de facto government.\nIsraeli Prime Minister Benjamin Netanyahu said on Sunday that IDF is working toward a quick defeat of Hamas terrorists, and said it would be done more swiftly than the U.S. took out al-Qaeda and ISIS\nMeanwhile, National Security Adviser Jake Sullivan said during an interview on ABC This Week that the U.S. believes there should be 'no reoccupation of Gaza' after Hamas is defeated by Israel.\n'No reduction in the territory of Gaza. No forcible displacement of Palestinians,' he added.\nNetanyahu told NBC that he has set 'targets' for the road to defeating Hamas, but claimed he doesn't have a specific deadline in mind.\n'We're proceeding as quickly as we can but also as carefully as we can, because we want to minimize civilian casualties and we want to minimize casualties on our side while maximizing the, the casualties of the Hamas terrorists,' he added.\nIn the same interview, the Israel PM said that 'there could be' a deal on Gaza releasing more hostages held by Hamas terrorists – but he didn't want to say too much publicly.\n'The less I say about it, the more I've increased the chances that it materializes,' Netanyahu said.\n'Do you know where all of the hostages are being held right now, Mr. Prime Minister?' Welker asked Netanyahu.\nHe replied: 'We know a great deal, but I won't go beyond that.'\nAsked in a separate interview on CNN's State of the Union Sunday program about taking responsibility for the failures that led to the October 7 attack, Netanyahu said there would be time for such 'difficult' questions once the war is over.\n'We're going to answer all these questions. Right now, I think what we have to do is unite the country for one purpose; to achieve victory,' he told CNN host Dana Bash.\n'Let's focus on victory – that's my responsibility now.'\nNetanyahu previewed on Sunday that there might be a deal on the table for release of more hostages from the Hamas stronghold of war-torn Gaza (pictured on November 12)\nPressure has built on Netanyahu regarding the failure of Israel to anticipate and prepare for the deadliest attack in Israel's history.\nOn October 7, Hamas killed the most amount of Jewish people in a single day since the Holocaust.\nAround 1,400 Israelis were killed in the attacks and 200 were taken hostage.\nSullivan says there are still nine Americans missing, as well after 32 were killed in the terrorist attacks.\nThe United States has sent warships and fighter aircraft to the region since the Israel-Hamas conflict erupted on Oct. 7, including two aircraft carriers, to try to deter Iran and Iran-backed groups.\nThe number of troops added to the region is in the thousands.\nReuters has reported that the U.S. military was taking new measures to protect its Middle East forces during the ramp-up in attacks by suspected Iran-backed groups, and was leaving open the possibility of evacuating military families if needed.\nThe measures include increasing U.S. military patrols, restricting access to base facilities and boosting intelligence collection, including through drone and other surveillance operations, officials say.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden orders wave of airstrikes on Iranian facilities in Syria linked to dozens of attacks on US forces after Hamas atrocities in Israel - in a significant escalation of violence in the region", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12741605/Biden-orders-wave-airstrikes-Iranian-facilities-Syria-linked-dozens-attacks-forces-Hamas-atrocities-Israel-significant-escalation-violence-region.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}