{"authors": ["Laura Parnaby", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:41:25", "date_modify": "None", "date_publish": "2023-11-13 04:58:36", "description": "The toddler's parents were slaughtered by the Palestinian terror group during the October 7 massacre which saw militants kill around 1,200 civilians in Israel.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12741581%2FAmerican-orphan-hostage-Hamas-parents-killed-White-House-Israel-Palestine.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/04/77722639-0-image-a-12_1699851510212.jpg", "language": "en", "localpath": null, "maintext": "A three-year-old American orphan is among the hostages held by Hamas, the White House has revealed.\nThe toddler's parents were slaughtered by the terror group during the October 7 massacre inside Israeli territory that saw 1,200 civilians killed and around 200 people taken hostage including at least nine US nationals.\nIn a call with Qatar's leader Sheikh Tamim Bin Hamad Al-Thani on Sunday, Biden 'condemned unequivocally the holding of hostages by Hamas, including many young children, one of whom is a three-year old American citizen toddler, whose parents were killed by Hamas on October 7th.'\nThe White House statement added: 'The two leaders agreed that all hostages must be released without further delay.'\nIt comes amid warnings from Congress that some of the hostages could be held by other terror factions, raising a nightmare scenario for negotiators. Only four prisoners have been released so far.\nA three-year-old American orphan is believed to be among the hostages held by Hamas after his parents were slaughtered, the White House has revealed. (Pictured: militants riding an Israeli military jeep in Gaza following the October 7 attack)\nThe toddlers unnamed parents were killed by the Palestinian terror group during the October 7 massacre which saw the militants wipe out around 1,200 civilians in Israel. (Pictured: civilians flee the terror attack near Kibbutz Urim in southern Israel on October 7)\nPresident Joe Biden spoke with Qatar 's leader Emir Sheikh Tamim Bin Hamad Al-Thani about the harrowing developments on Sunday, and the White House issued a news release showing they discussed the missing American toddler\nFlorida Rep Jared Moskowitz - who was part of a US delegation to Tel Aviv at the weekend - told ABC's This Week: 'The hostages are in number of places, some are in the tunnels, some are not in the tunnels.\n'As it turns out some of the hostages might be kept by not Hamas - it might not be Islamic Jihad who have some of these hostages, it might be some of the citizens of Gaza.'\nWhite House security adviser Jake Sullivan confirmed nine Americans are still missing in Gaza.\n'There are ongoing negotiations involving the Israelis, the Qataris, and we, the United States, are actively engaged in this as well,' he told ABC.\n'We want to make sure that we bring home those Americans who have been taken hostage as well as all of the other hostages.'\nSullivan said it's unknown how many hostages are still alive - but added: 'There are nine missing American citizens as well as a missing legal permanent [resident], a green card holder.'\n'That's the number that we are trying to ensure the safe return of, and we have been engaging with the families.\n'In fact, I will personally be seeing family members of the American hostages this coming week.'\nQatar's government earlier said Al Thani had stressed the need for an immediate ceasefire in Gaza and the permanent opening of the Rafah crossing into Egypt in the call with Biden.\nWashington has rejected calls from Arab leaders and others for it to pressure Israel into halting its assault on the Hamas-controlled Gaza strip which has so far killed more than 11,000 Palestinians.\nIn the US and around the world, thousands of people have taken to the streets in protests to demand a ceasefire, but Netanyahu has said this won't happen until all hostages are released.\nAs of Sunday, Hamas has released just four of the prisoners, including American nationals Natalie Shoshana Raanan, 17, and her mother Judith Tai Raanan, 59.\nFlorida Democrat Rep Jared Moskowitz, who was among a US delegation which met with Israeli Prime Minister Benjamin Netanyahu in Tel Aviv at the weekend, warned that some hostages could be held by terror groups beyond Hamas\nPalestinians wave their national flag and celebrate by a destroyed Israeli tank at the Gaza Strip fence east of Khan Younis southern Saturday, October 7, 2023\nDemocratic Rep. Jared Moskowitz tells @JonKarl that finding the hostages being kept in Gaza is “a top priority.”\n“The hostages are in a number of places. Some are in the tunnels, some are not in the tunnels.” https://t.co/AFpDbiNYYf pic.twitter.com/RG7I7Xth3G — This Week (@ThisWeekABC) November 12, 2023\nThis weekend, I joined a bipartisan, bicameral delegation to Israel, where we met with Prime Minister Netanyahu, Minister of Defense Gallant, and family members of hostages held by Hamas. America will continue to stand by its ally Israel as it defends itself against terror. pic.twitter.com/gvK7JBJWmd — Congressman Jared Moskowitz (@RepMoskowitz) November 12, 2023\nNetanyahu said he still has daily contact with Biden, and also has the 'political and ethical support' of the American administration.\nBut the Arab and Muslim world called for an immediate end to military operations in Gaza, rejecting Israel's justification of self-defense.\nA communique issued at the summit urged the International Criminal Court to investigate 'war crimes and crimes against humanity that Israel is committing' as it continues to wage war on the Gaza Strip.\nThe World Health Organization warned on Sunday that Gaza's largest hospital is 'not functioning' and is in a 'perilous' state after one airstrike bombardment left it without electricity and water for three days.\nHeart-breaking photos show seven newborn babies wrapped in green scrubs laid beside each other on a bed after they were taken out of incubators due to a power outage at Al-Shifa hospital.\nGenerators used to prop up supplies ran out of fuel yesterday and 36 babies are at risk of dying. Three premature babies and four patients have already died, according to the Hamas-run Health Ministry.\nThe Hamas-run health ministry accused Israel of deliberately targeting the hospital with airstrikes, and claimed that Israeli snipers would regularly take shots at the medical complex.\nMuhammad Abu Salmiya, the director of Al Shifa hospital, said that newborn babies were dying after the hospital suspended operations\nIsrael's military confirmed clashes outside the hospital, but IDF spokesperson Daniel Hagari denied Al-Shifa Hospital (pictured) was under siege\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 11, 2023, shows smoke rising over buildings during an Israeli strike on the Palestinian enclave\nIsrael contends that Hamas gunmen have placed command centers in and around the hospitals, meaning doctors, patients and thousands of evacuees taking refuge in them must leave.\nHamas denies using hospitals this way. Medical staff say patients could die if they are moved and Palestinian officials say Israeli fire makes it dangerous for others to leave.\nIsrael's Agriculture Minister Avi Dichter broke ranks as he called the evacuations 'Gaza's Nakba' - a reference to the mass dispossessions of Palestinians after Israel was founded in 1948.\n'Operationally there's no way to conduct a war the way the IDF wants to conduct it inside Gaza territories,' Dichter said. 'I don't know how it will end'.\nThe comments drew an immediate slap down from Netanyahu - who is sliding dismally in the polls. The PM said: 'Every word has meaning when it comes to diplomacy. If you don’t know - don't speak.'\nMeanwhile, a Hamas leader who was presumed dead is alive, Israeli spies are said to believe.\nMohammed Sinwar was pronounced dead in 2014 by Hamas which released an image of him lying on a bloodstained bed.\nBut in reality this was a stunt aimed at protecting him from Israeli assassination attempts and he was one of three to four figures behind the October 7 attack.\n'He was 100 per cent one of the core team who planned Oct 7,' a former Mossad counter-terror chief told the Telegraph.\n'In the military leadership he's very important,' the source said.\nMohammed Sinwar was pronounced dead in 2014 by Hamas, which released an image of him lying on a bloodstained bed\nSources claim this was a stunt aimed at protecting Mohammed (pictured) from Israeli assassination attempts\nMohammed Sinwar is the younger brother of Yahya Sinwa, Hamas's leader in Gaza and Israel 's most-wanted terrorist\n'He's around number seven on the wanted list, alongside the likes of Mohammed Deif, Marwan Issa and Tawfiq Abu Naim. He's an important figure and he's still alive for sure.'\nMohammed Sinwar is the younger brother of Yahya Sinwa, Hamas's leader in Gaza and Israel's most-wanted terrorist.\nHe helped free his elder brother from an Israeli jail during a 2011 prisoner exchange and is considered an 'expert' in using kidnappings to secure the release of prisoners, according to Ronen Solomon - an intelligence analyst and author of the Intelli Times blog.\nAs the war continues to tear Israel and Palestine apart, Biden ordered airstrikes against two facilities in Syria used by Iran's Islamic Revolutionary Guards on Sunday.\nCarried out by Air Force F-15E fighter jets, the strikes are the latest retaliatory attacks for the daily barrage of rocket hits on US forces in Iraq and Syria.\nThe US jets hit structures in Abu Kamal and a safe house in Mayadin - used for weapons and ammunition storage and command and control HQs.\nThe US jets hit structures in Abu Kamal and a safe house in Mayadin - used for weapons and ammunition storage and command and control HQs\nOn Sunday, five US Army special forces troops were also killed in a helicopter crash in the Mediterranean Sea.\nThe MH-60 Black Hawk helicopter was on a refueling training mission when it crashed off the coast of Cyprus late Friday, officials told The New York Times.\nAn investigation has been launched but there is no indication of hostile activity.\nThe Pentagon has dispatched commando teams - including Delta Force and SEAL Team 6 - to the region to stand-by for hostage rescues in the Gaza Strip. Cyprus is around 150 miles from Israel.\nThe helicopter was from the Army's 160th Special Operations Aviation Regiment - the Night Stalkers - which ferries commando forces on secret raids.\nUnited States European Command (EUCOM) said in a statement: 'Out of respect for the affected families, and in accordance with Department of Defense policy, the identities of the crewmembers are being withheld until 24 hours after next of kin notifications have been completed.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Three-year-old American orphan is being held hostage by Hamas after his parents were killed, White House reveals - as Congressman raises nightmare scenario that other terror groups are keeping US citi", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12741581/American-orphan-hostage-Hamas-parents-killed-White-House-Israel-Palestine.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}