{"authors": [], "date_download": "2024-02-05 15:41:27", "date_modify": "None", "date_publish": "2023-11-13 19:00:24", "description": "Editorial: Hospitals cannot function. The death toll mounts. Combatants must be held accountable for crimes – but first, the killing must stop", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fnov%2F13%2Fthe-guardian-view-on-gazas-casualties-mounting-calls-for-a-ceasefire-must-be-heeded.json", "image_url": "https://i.guim.co.uk/img/media/82376d4fd9e57aa2124b57eadd248c15ec79253b/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a6a12d55cc027bbdfcfb555aca2bda46", "language": "en", "localpath": null, "maintext": "The thousands injured by relentless airstrikes need treatment; the health of many more is deteriorating sharply due to the lack of clean water, food and medicines; others have taken shelter in medical facilities in the belief that surely there, at least, they will be safe. But as the World Health Organization’s director general, Tedros Adhanom Ghebreyesus, has warned, nowhere and no one is safe in Gaza. Israeli forces were on Monday night at the gates of al-Shifa, Gaza’s biggest hospital, which the WHO had already said was “not functioning as a hospital any more”. Another major site, al-Quds, had been forced to close to new patients amid Israeli airstrikes and heavy fighting.\nMore than 11,000 are dead in Gaza, two-thirds of them women and children, according to its health ministry. While Israel casts doubt on figures from the Hamas-run ministry, one Biden administration official has said the tally could be even higher than cited. More than 100 UN employees are among the dead. An estimated 70% of the 2m population are displaced. One Israeli minister spoke of “Gaza’s Nakba”, a reference to the expulsion and dispossession of Palestinians in 1948. But though the suffering extends far beyond the walls of these hospitals, they have come to epitomise it.\nThe Israel Defense Forces say that Hamas has placed command centres under and around al-Shifa and other facilities; Hamas and the hospital staff deny this. Using human shields is forbidden under international law. The special protections granted to hospitals in wartime may not apply if combatants use them to hide fighters or store weapons. That does not, however, give free rein to attack them. The danger to civilians must still be heeded, and harm disproportionate to the military objective renders an attack illegal.\nIsrael has a right to defend itself and a duty to protect its citizens. But as António Guterres, the United Nations secretary-general, warned: “You cannot use the horrific things Hamas did [on 7 October] as a reason for the collective punishment of the Palestinian people.” Concern is growing. An internal US state department dissent memo, from staff challenging official policy, accuses Israel of war crimes. Scale alone does not determine the status of military action. But when death and destruction are wreaked on such an immense scale, with so many civilian casualties, the insistence that this is a proportionate response becomes unsustainable.\nAccountability is essential, not least to protect civilians in future. Israel must be held responsible for its actions in Gaza, just as Hamas must be for its murderous raids and taking of hostages, who must be released. But the road to international justice is long, obstacle-strewn and may prove impassable. And no judgment, however necessary, can resurrect the dead. That is why a ceasefire is long overdue. Joko Widodo, president of Indonesia – the world’s most populous Muslim-majority nation – and France’s Emmanuel Macron are the latest to join Mr Guterres in making the call. This week, MPs are likely to vote on an SNP motion on a ceasefire.\nThe US strategy of hugging Israel close to temper its response has failed. Its unease is evident, with the secretary of state, Antony Blinken, observing that “far too many” Palestinians have died. But it is harder to draw red lines when you previously appear to have given Benjamin Netanyahu carte blanche. This weekend, the WHO chief warned that one child is killed every 10 minutes in Gaza. How many more of them are to be lost?\nDo you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.", "source_domain": "www.theguardian.com", "text": null, "title": "The Guardian view on Gaza’s casualties: mounting calls for a ceasefire must be heeded", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/nov/13/the-guardian-view-on-gazas-casualties-mounting-calls-for-a-ceasefire-must-be-heeded"}