{"authors": [], "date_download": "2024-02-05 15:41:28", "date_modify": "None", "date_publish": "2023-11-13 07:37:55", "description": "At Al-Shifa, two premature babies and 10 other patients have died, UN agency says", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fal-shifa-hospital-gaza-who-israel-latest-b2446182.html.json", "image_url": "https://static.independent.co.uk/2023/11/12/22/2023-11-12T162003Z_1936887129_RC2RB4ALXI19_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-AL-SHIFA-NEONATALS.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nGaza’s largest hospital is no longer operating amid “constant gunfire and bombings in the area”, said the World Health Organisation (WHO).\nThis comes amid an intense retaliatory offensive by Israel in the occupied Palestinian enclave after Hamas launched an attack on the southern part of the country on 7 October.\nWHO chief Tedros Adhanom Ghebreyesus on X/Twitter said the situation has become “dire and perilous” for Gaza’s hospitals.\nAl-Shifa Hospital – the largest hospital in the Gaza Strip – is no longer operating as it should, warned the WHO director-general.\n“It’s been 3 days without electricity, without water and with very poor internet which has severely impacted our ability to provide essential care,” said Mr Adhanom Ghebreyesus.\n“The constant gunfire and bombings in the area have exacerbated the already critical circumstances,” he said.\n“Tragically, the number of patient fatalities has increased significantly. Regrettably, the hospital is not functioning as a hospital anymore.”\nHe also called for a ceasefire and said “the world cannot stand silent while hospitals, which should be safe havens, are transformed into scenes of death, devastation, and despair”.\nIsrael’s president Isaac Herzog said “everything is operating” in Al-Shifa hospital and denied any Israeli strikes there.\nDoctors and the health ministry in Gaza said there is a shortage of fuel that has hindered surgeries and prevented the operation of incubators for premature babies. Mr Herzog, however, refuted the remarks.\n“We deny this at all, there is a lot of spin by Hamas... but there’s electricity in Shifa, everything is operating,” he said in an interview with the BBC.\nIsrael has alleged Hamas maintains a tunnel underneath the hospital building which acts as their base. The militant group has refuted these allegations.\nOn Sunday, the Palestine Red Crescent Society (PRCS) said Gaza’s second-largest hospital, the al-Quds hospital, ceased operations due to a fuel shortage.\n“The hospital has been left to fend for itself under ongoing Israeli bombardment, posing severe risks to the medical staff, patients and displaced civilians,” said the PRCS in a statement on Sunday, according to Al Jazeera.\n“This cessation of services is due to the depletion of available fuel and power outage. Medical staff are making every effort to provide care to patients and the wounded, even resorting to unconventional medical methods amid dire humanitarian conditions and a shortage of medical supplies, food, and water,” PRCS said.\nThe WHO has joined other humanitarian organisations, including Doctors Without Borders, in demanding an end to assaults on healthcare facilities in Gaza and calling for an immediate ceasefire.\nSince the 7 October Hamas attack, Israel has killed more than 11,000 Palestinians, including 8,000 women and children, according to Gaza’s health ministry.\nThe UN Office for the Coordination of Humanitarian Affairs (UNOCHA) in the occupied Palestinian territory said in its recent daily update that three of al-Shifa’s nurses were killed.\n“Bombardments and armed clashes around the Shifa hospital in Gaza city intensified since the afternoon of 11 November,” it said.\n“Critical infrastructure, including the oxygen station, water tanks and a well, the cardiovascular facility, and the maternity ward, was damaged, and three nurses killed.\n“At Shifa, two premature babies and 10 other patients have died since the power outage that started on 11 November, compounded by the lack of medical consumables,” it said.\nUNOCHA warned another 36 babies in incubators and kidney dialysis patients are at heightened risk of death.\nWhite House national security adviser Jake Sullivan told CBS News Hamas was using hospitals and other civilian facilities to house fighters and weapons, which he said was a violation of the laws of war.\n“The United States does not want to see firefights in hospitals where innocent people, patients receiving medical care, are caught in the crossfire and we’ve had active consultations with the Israeli Defense Forces on this,” he was quoted as saying.\nIsraeli prime minister Benjamin Netanyahu said on Sunday that Hamas was “doing everything in its power” to keep civilians “in harm’s way”.\n“We have designated routes to a safe zone south of Gaza City. We want all civilians to be moved out of harm’s way,” he told CNN.\n“We’ve called to evacuate all the patients from that (Al-Shifa) hospital, and 100 or so have already been evacuated. There’s no reason why we can’t just take the patients out of there.”\nHe also told NBC News on Sunday that Israel had offered fuel to help operate the hospital.\n“On the contrary, we offered actually, last night, to give them enough fuel to operate the hospital, operate the incubators and so on, because we (have) no battle with patients or civilians at all,” he said.\n“We are expecting to lose more of them [premature babies] day by day,” Dr Ahmed El Mokhallalati was quoted as saying by Reuters.\nAl Jazeera reported that northern Gaza’s Kamal Adwan Hospital was also forced to shut operations due to a lack of fuel for its main generator.", "source_domain": "www.independent.co.uk", "text": null, "title": "Gaza’s largest hospital ‘no longer functioning’, says WHO", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/al-shifa-hospital-gaza-who-israel-latest-b2446182.html"}