{"authors": ["Fiona Leishman", "Image", "U.S. Army Special Operations Command"], "date_download": "2024-02-05 15:41:32", "date_modify": "None", "date_publish": "2023-11-13 14:44:29", "description": "Five US Army crew members were carrying out an air refuelling flight over the Mediterranean Sea when their MH-60 Blackhawk suffered a \"mishap\" and crashed into the sea", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-tragic-faces-5-army-31427578.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31427847.ece/ALTERNATES/s1200/1_five-soliders-main.jpg", "language": "en", "localpath": null, "maintext": "Five US Army crew members were carrying out an air refuelling flight over the Mediterranean Sea when their MH-60 Blackhawk suffered a \"mishap\" and crashed into the sea\nFive special operators have been named and pictured by the US military after they were killed in what has been described as an aircraft \"mishap\" over the weekend.\nThe US says the five men were US Army Special Operations aviation soldiers who were conducting a routine refuelling flight over the Mediterranean Sea when they crashed. In a statement confirming the identities of those killed in the crash, the US Department of Defense said: \"Our thoughts and prayers remain with the families of the fallen.\"\nThe department also confirmed an investigation into the incident is being conducted by the US Army's Combat Readiness Center. The deceased have been named as:\nREAD MORE: Israeli troops reach gates of Gaza's al-Shifa hospital 'hiding Hamas' in crunch moment\nChief Warrant Officer 3 Stephen R Dwyer, 38, of Clarksville, Tennessee\nChief Warrant Officer 2 Shane M Barnes, 34, of Sacramento, California\nStaff Sergeant Tanner W Grone, 26, of Gorham, New Hampshire\nSergeant Andrew P Southard, 27, of Apache Junction, Arizona\nSergeant Cade M Wolfe, 24, of Mankato, Minnesota\nIn a statement on Sunday, President Joe Biden mourned the deaths of the five soldiers. Taking to X, formerly Twitter, he wrote: \"Jill and I mourn the loss of 5 American service members who died when their aircraft crashed into the Mediterranean Sea during a training mission. We are praying for the families and friends who lost a precious loved one - a piece of their soul. Our entire nation shares their grief.\"\nHe added: \"Our service members put their lives on the line for our country every day. They willingly take risks to keep the American people safe and secure. And their daily bravery and selflessness is an enduring testament to what is best in our nation.\"\nTennessee Representative Ronnie Glynn said: \"I am deeply saddened to hear about the loss of these brave service members who were a part of Fort Campbell's Special Operations Aviation Regiment. I am praying for the families of our service members. This loss is felt not only in our community, but also around the world.\"\nThe Blackhawk went down during a routine air refuelling mission as part of military training on Friday evening, crashing into the sea and killing all crew members. A search and rescue mission was immediately launched, which included nearby US military aircraft and ships, a US European Command spokesperson confirmed.\nIn a statement, the US Department of Defense said: \"There are no indications the crash was caused by enemy/hostile actions. The MH-60 Blackhawk was conducting aerial refuelling training when the aircraft experienced an in-flight emergency resulting in the crash.\"\nUS Defence Secretary Lloyd Austin said in a statement that they \"mourn the tragic loss of five US service members during a training accident in the Mediterranean Sea early Saturday morning.\" He added: \"While we continue to gather more information about this deadly crash, it is another stark reminder that the brave men and women who defend our great nation put their lives on the line each and every day to keep our country safe.\"\nArmy aviation special operations forces are assigned to the 160th Special Operations Aviation Regiment based at Fort Campbell, Kentucky. The group has almost 3,000 soldiers and more than 200 aircraft, according to the US Army Special Operations Command.\nThe mayor of nearby Hopkinsville, James Knight, ordered all city properties to fly their flags at half-staff. In a statement, he said: \"On behalf of the City of Hopkinsville, I extend my deepest condolences to the families of the five Army Special Operations service members lost during a training accident in the Mediterranean Sea this Veterans Day weekend. Let it serve as a reminder to all of us the sacrifice these soldiers and their families continue to make for our freedom.\"\nImage: U.S. Army Special Operations Command) U.S. Army Special Operations Command)\nThe US has sent extensive assets to the eastern Mediterranean in an effort to deter Iran and terrorist proxy groups from joining Israel's war against Hamas. The Air Force has sent additional squadrons to the region and the USS Gerald R Ford aircraft carrier, which has an array of aircraft on board, has also been operating in the eastern Mediterranean.\nIt is unclear whether the air refuelling exercise was related to activities in the region as tensions mount. One of the reasons behind tensions growing in the area was the Pentagon's decision to move forces into the area in the aftermath of the October 7 attack Hamas launched in Israel.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Tragic faces of 5 US Army helicopter crew killed in Mediterranean aircraft 'mishap'", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/breaking-tragic-faces-5-army-31427578"}