{"authors": ["Summer Goodkind"], "date_download": "2024-02-05 15:41:34", "date_modify": "None", "date_publish": "2023-11-13 12:37:35", "description": "Yoav Atzmoni, 31, an IDF soldier who was called up to fight after the October 7 massacre, proudly posed with the colourful flag as he was stationed in Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12743165%2FGay-Israeli-soldier-displays-love-LGBT-flag-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/12/77735077-0-image-m-39_1699878272399.jpg", "language": "en", "localpath": null, "maintext": "A gay Israeli soldier has unfurled an LGBT flag in Gaza, simply reading: 'In the name of love'.\nYoav Atzmoni, 31, an IDF soldier who was called up to fight after the October 7 massacre, proudly posed with the colourful flag as he was stationed in Gaza.\nHis brave act was one of defiance against the territory's deep anti-gay laws and imposed rhetoric, he told The New York Post.\nThe image began circulating on social media over the weekend and was re-shared by the official State of Israel account today, with the title: 'The first ever pride flag raised in Gaza.'\nAtzmoni revealed his plans last month to bring the pride flag on his army tank to his fight against Hamas, despite it making him a larger target for attacks by militants.\nYoav Atzmoni, a gay Israeli soldier, has unfurled an LGBT flag in Gaza, simply reading: 'In the name of love'\nAtzmoni revealed his plans last month to bring the pride flag on his army tank to his fight against Hamas, despite it making him a larger target for attacks by militants\nHe told Insider at the time of his concern that a Hamas victory could set Israel's progress on LGBTQ+ rights back several decades. 'I won't let them bring me back into the closet,' he said.\nNow, he has succeeded in his mission after raising the flag in Al-Atatra, the northern part of the Gaza Strip, two weeks ago.\nAtzmoni was called up to serve in the Israel Defense Forces following the October 7 Hamas terror attack, which killed around 1,200 people, and 240 taken hostage.\nSince then, Israel has retaliated against Hamas, launching a military campaign that has killed thousands in Gaza.\nSome anti-Israel protesters who call themselves 'Queers for Palestine' have been mocked online, considering the oppression LGBTQ people in Gaza face.\n'To all the anti-Israel LGBTQ activists, the IDF sends regards from Gaza!' Israeli activist Yoseph Haddad tweeted.\nLGBTQ Palestinians living under Hamas rule deal with 'severe persecution and ostracism,' according to a 2022 UN Watch's report.\nMen are also banned from same-sex activity punishable by a prison sentence of up to 10 years, according to the Human Dignity Trust.\nSome anti-Israel protesters who call themselves 'Queers for Palestine' have been mocked online, considering the oppression LGBTQ people in Gaza face\nThe laws date back to the British Mandate Criminal Code Ordinance in 1936 and are still valid today in Gaza.\nMeanwhile in Israel, it is the only country in the Middle East to recognize same-sex marriage.\nThe rule came into place in 2006 and allowed adopting children via surrogacy in 2020.\nConsequently, hundreds of gay and bisexual Palestinians have for years been fleeing to Israel to escape persecution.\nOne such refugee, Ahmad Abu Marhia, a 25-year-old gay Palestinian man, was living under asylum in Israel when, in 2022, he was kidnapped and beheaded in the West Bank city of Hebron. His murderers uploaded footage of the killing to social media.\nIn 2016, Hamas executed one of their own seniors, Mahmoud Ishtiwi, reportedly for sleeping with a man.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Gay Israeli soldier displays 'In the name of love' LGBT flag in Gaza", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12743165/Gay-Israeli-soldier-displays-love-LGBT-flag-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}