{"authors": [], "date_download": "2024-02-05 15:41:37", "date_modify": "None", "date_publish": "2023-11-13 18:56:37", "description": "A former mayor says that a powerful and feared gang leader in Haiti who was once a math and physics teacher was killed in a neighborhood within a sprawling seaside slum that he controlled for years", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-portauprince-barbecue-san-juan-puerto-rico-b2446623.html.json", "image_url": "https://static.independent.co.uk/2023/11/13/19/Haiti_Gang_Leader_Killed_52238.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA powerful and feared gang leader in Haiti who was once a math and physics teacher was killed in a neighborhood within a sprawling seaside slum that he controlled for years, local media reported on Monday.\nThe death of Iskar Andrice, who also has been identified as Iscar Andris, raised concerns that already rampant gang violence could spike further in the vacuum his death created.\nAndrice ruled the Belekou community within the Cite Soleil slum where he died, former mayor Esaïe Beauchard told Radio Galaxie FM.\n“It’s regrettable that this guy had to be involved in gang activity, because he’s a very intelligent man,” Beauchard said.\nIt wasn’t immediately clear what day Andrice died.\nJean-Frédérique Islain, the current mayor of Cite Soleil, declined to comment when contacted by The Associated Press.\nThe gang that Andrice led was involved in murder, robbery, extortion, rape and the hijacking of goods and trucks, according to a recent U.N. report. He later joined forces with renowned gang leader Jimmy Chérizier, known as Barbecue, who formed the “G9 Family and Allies” alliance, Haiti’s biggest and most powerful gang group.\nMedia interviews granted by Chérizier first had to be approved by Andrice.\nThe U.N. said that Andrice, like other gang leaders, created a social foundation in 2015 known as the Siloé Foundation to win over the community he controlled and present a positive image of himself.\nAndrice and other gang leaders were accused of leading several deadly raids on Haitian neighborhoods that targeted civilians, according to a report by the nonprofit National Human Rights Defense Network in Haiti.\nThey also were accused of paralyzing operations at a main fuel terminal in the capital, Port-au-Prince, last year, crippling the country and forcing Haitian Prime Minister Ariel Henry to make his first request for the urgent deployment of a foreign armed force.\n___\nAssociated Press reporter Dánica Coto in San Juan, Puerto Rico, contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "Math teacher who became powerful Haitian gang leader has been killed, former mayor says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-portauprince-barbecue-san-juan-puerto-rico-b2446623.html"}