{"authors": ["Jonathan Guyer"], "date_download": "2024-02-05 15:41:38", "date_modify": "None", "date_publish": "2023-11-13 18:23:28", "description": "An Israeli actor and a Palestinian American scholar present different narratives – one more dismissive than the other", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fbooks%2F2023%2Fnov%2F13%2Fthe-wildly-divergent-histories-of-israel-palestine-that-have-climbed-us-bestseller-lists.json", "image_url": "https://i.guim.co.uk/img/media/979a4d19fbcd1b98a89af0de5cca9cf3bfd10add/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1bad88039b389590817e98a67f28dc18", "language": "en", "localpath": null, "maintext": "The war between Israel and Hamas did not start on 7 October. But when did it begin?\nTwo books that have shot to the top of national bestseller lists in recent weeks attempt to answer that question, through divergent histories of the Israel-Palestine conflict. Currently at No 3 on the New York Times nonfiction paperback bestseller list is the pre-eminent Palestinian American historian Rashid Khalidi’s The Hundred Years’ War on Palestine: A History of Settler Colonialism and Resistance, 1917-2017, which draws on scholarly research and the author’s experience to explain Palestinian dispossession and perseverance in the face of colonialism. At No 5 on the list is Israel: A Simple Guide to the Most Misunderstood Country on Earth by the actor and former Israeli envoy Noa Tishby, a breezy rundown of Israel’s national myths and talking points.\nYou could judge them by their covers: Khalidi’s blurbs are from the Financial Times, the Nation and Middle East academics, while Bill Maher, Aaron Sorkin, Ritchie Torres and Ben Shapiro line up behind Tishby. Though both books are a few years old, Americans are turning to them to understand how and why Hamas could launch attacks on Israel that killed 1,200 people and kidnapped 242, according to that country’s defense forces, and how Israel could respond with an assault on Gaza that has already killed more than 10,000 people, according to the Palestinian health ministry, amid a humanitarian catastrophe.\nThese books’ current popularity shows that Americans want to get into the history of this moment – but even in doing that, they are picking a side. Read together, however, they make clear the war about the war has been a century in the making.\nAlthough the books were published two years ago this month, both authors have taken stages across the country. Khalidi spoke alongside Ta-Nehisi Coates at the packed Palestine Festival of Literature at Riverside Church in Harlem, and Tishby is posting social media videos about Israel between her TV hits. Both authors are keen to use their histories to shape how the world sees this conflict.\nBoth writers bring in personal and family histories to show readers how viscerally Palestinians and Israelis relate to a conflict both groups view as existential. Where the authors differ most is in how willing they are to engage with the other side’s perspective and narratives.\nKhalidi hails from a Jerusalem family of scholars whose ancestral apartment is steps from the Dome of the Rock, one of the most contested pieces of real estate in the Holy Land. His great-great-great-uncle corresponded with Theodor Herzl, the founder of modern Zionism. Khalidi’s own history tracks with that of the Palestinian struggle, and he recounts working alongside the Palestine Liberation Organization (PLO) during the Lebanese civil war in the 1970s and early 1980s, and then fleeing with his young family as Beirut became unlivable under Israeli bombardment; the advisory role he played in the Madrid Peace Conference of 1991; and his encounters with Palestinian luminaries from Ghassan Kanafani to Edward Said to Yasser Arafat.\nView image in fullscreen Rashid Khalidi delivers a report marking the 100th anniversary of the Balfour Declaration. Photograph: Pacific Press Media Production Corp./Alamy\nThroughout, Khalidi engages in nuanced self-criticism, interviewing former diplomats to understand how Israel outmaneuvered the PLO in the 1990s, during the Oslo peace process that followed from Madrid, and how Arafat and the old guard had grown out of touch with a new generation of Palestinians in the occupied territories. He uses the framework of settler colonialism to explain the success of the Zionist movement in taking the land and emptying it of its inhabitants. He reads primary sources and documents conveying displacement, ethnic cleansing and apartheid policies, to demonstrate how Israel has prevented an independent Palestine through six historical periods that constitute a century-long war against Palestinians.\nThe pro-Israel crowd could benefit from this history to understand the roots of today’s war. Instead they are probably reading what Tishby herself calls a “history-ish book”. An Israeli producer and actor who made it in Hollywood, she worked as Israel’s special envoy for combating antisemitism and delegitimization. Her writing is strongest when describing the formative roles her grandparents played in the Zionist movement in Europe and in the early days of the state of Israel. Her book begins by cementing the Jewish people’s biblical and religious connections to “their tiny piece of ancestral land”, and then recounts in detail antisemitism in Europe.\nIn this book, Mandatory Palestine was “mostly empty” and the Arabs were always trying to “wipe the new Jewish state off the map”. She spends more space censuring the United Nations and its refugee aid work for Palestinians than in understanding how and why Israel displaced Palestinians.\nIt’s only toward the end of her book that Tishby’s goal becomes clear: this is a guide to countering Palestinian boycott, divestment and sanctions (BDS) activism and the swelling of anti-Zionist perspectives on US college campuses — all told in the voice of Carrie Bradshaw.\nIndeed it’s the type of historical sweep that Khalidi provides – of Zionism as a colonial project, empowered first by the British and then by the US empires – that Tishby’s polemic is responding to. Where Tishby says that Palestinian claims of indigenousness don’t apply and that the Zionist project had nothing to do with colonialism, Khalidi returns to the words and deeds of Israel’s founders to situate a history of Palestinians that most Americans are not taught, and which until the recent war have been largely absent from US media.\nNoa Tishby says her awakening came during the 2010 Gaza flotilla, when activists set sail from Turkey to break the siege on Gaza with humanitarian items, and Israeli forces boarded the boats and killed nine people. At that time, the Israeli government had yet to grasp the power of decentralized social media and the fact of shifting global perceptions of its occupation. “Israel’s PR problems were about to turn into an existential threat,” she writes. Soon she was briefing the Israeli military on digital strategy and became an unofficial ambassador.\nskip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThis is a guide to countering BDS activism and the swelling of anti-Zionist perspectives on US college campuses – all told in the voice of Carrie Bradshaw\nShe assures readers that she is a liberal, centrist/lefty and feminist, but in her casual millennial tone she reaches for tired caricatures of Palestinians and Arabs that are dismissive if not mildly racist. Tishby repeats without context Golda Meir’s infamous denial of Palestinians’ existence, and notes: “There has never been a coherent Palestinian national, religious, or political identity.” The occupied West Bank city of Hebron “felt like a hostile Arab country” to her as a young soldier hanging out there with Ayelet Shaked before she became a rightwing minister.\nTishby repeats that Israel is not a perfect country – but sees Israel as an inclusive democracy for all, whose faults are not systemic or by design but that simply get too much international scrutiny. For many audiences, especially those who didn’t receive these pro-Israel messages through Hebrew school or on a Birthright trip, it’s useful to see the Hasbara handbook updated for the 21st century, and the maps, bullet points and highly abridged timelines show how Israel sees itself in the world.\nKhalidi understands this too, and notes that Israel’s reputation abroad is “in some ways its most vital asset”. He often returns to the PR problem of Palestinians, specifically that Arafat and the PLO didn’t understand the significance of US public opinion to their cause and thus failed to mobilize it.\nBut Tishby’s narrative can’t engage with actual Palestinians because it would undermine her entire perspective. SodaStream, previously an Israeli company located in the West Bank, with its Palestinian workers, represents peace. The occupied West Bank is “restrictive AF” for Palestinians, but also “in limbo”, and “there is enough blame to go around”. Israel is, as she puts it, “the worst apartheid state ever”, because Palestinian citizens of Israel, she says, have equal rights. She celebrates Jewish refugeedom, but her “intrepid curiosity” is not extended to Palestinians, whose identity and history she often dismisses, and whom she rarely speaks with.\nView image in fullscreen Noa Tishby signs copies of her book in Los Angeles on 6 April 2021. Photograph: Rich Fury/Getty Images for Wolman Wealth Management\nMost offensive is how she describes 1948, the catastrophe Palestinians call the Nakba. She emphasizes the Nakba’s “sudden rebranding” that gained currency a couple of decades ago when the PLO inaugurated it as an annual occasion in 1998. She relies on passive voice to convey the official Israeli mythic version of Israel’s war of independence: “blood was spilled, and atrocities were committed” and Arabs “got pushed out”.\nKhalidi, for his part, goes into great depth on the “violent transformation” of that year, notably the ethnic cleansing and land theft that would shape Israel’s establishment. He details the “post-Nakba political vacuum” of Arab disunity and complex intra-Palestinian politics, which Tishby tends to dismiss as a hot mess and indicative of the absence of a real Palestinian identity or a claim on the land.\nBoth of these books were published before Hamas’s October attacks, yet they tell a crucial story about the players shaping the Middle East’s future. These are the two dominant narratives but they are not symmetrical: the Palestinian scholar examining how US policy has enabled Israel for 75 years, and an Israeli celebrity wondering why everyone seems to hate this little country, and believing that better messaging could help.\nBut what do these two books say about Gaza, and how this war will end?\nKhalidi is critical of Hamas, its indiscriminate attacks on Israeli civilians, and how it has undermined the Palestinian cause through its violence. He also traces Israel’s military doctrine of disproportionate force and the tremendous amount of US weapons given to Israel. What is most helpful for readers is his explanation of relevant moments that aren’t directly about Gaza but explain where this war might go, like the PLO’s transformation from a militant group to Israel’s negotiating partner. His intimate experience of surviving Israel’s onslaught of Beirut in 1982 is an eerie parallel to the accounts coming out of Gaza today.\nTishby’s descriptions of Gaza are mainly focused on Hamas’s determination to implement “sharia law” there and on the rockets it has sent into Israel. She chastises college students for protesting against Israel but not Hamas. Maybe Tishby should read Khalidi to understand where Hamas came from – the generations of Palestinian leaders who were assassinated, the missteps of Arab states and the harshness of Israeli occupation.\nFor Tishby, the Palestinians have rejected Israel’s peace entreaties at every turn. Khalidi says that the previous process toward a two-state solution was always rigged in Israel’s favor and, while questioning the PLO’s approach, concludes that an “unending series of unilateral Israeli actions”, backed with US power, turned the Palestinian Authority into a subcontractor of the Israeli occupation rather than a liberation movement.\nTishby writes “It would take a Holocaust” for the Jewish state to emerge. One wonders how much death it would take in Gaza for a Palestinian state to emerge alongside it.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Israeli talking points in Carrie Bradshaw’s voice’: what we can learn from two Israel-Palestine bestsellers", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/books/2023/nov/13/the-wildly-divergent-histories-of-israel-palestine-that-have-climbed-us-bestseller-lists"}