{"authors": ["Mark Toth", "Jonathan Sweet"], "date_download": "2024-02-05 15:41:39", "date_modify": "None", "date_publish": "2023-11-13 14:21:58", "description": "Foreign policy expert Mark Toth and former US Army Colonel Jonathan Sweet discuss why the Israel-Hamas and Russia-Ukraine conflicts should be treated as a 'global war' by the West.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12742647%2FHow-Hamas-aiding-Putin-Xis-ideological-war-against-West-UK-Israel-Ukraine-global-conflict-Russia-China-achieve-economic-military-domination.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/13/77737729-0-image-m-22_1699882633188.jpg", "language": "en", "localpath": null, "maintext": "The Russia-Ukraine and Israel-Hamas wars have become a battleground for Western and Eastern influence, with each conflict threatening to disrupt the international order.\nHamas's bloody invasion of Israel came at an opportune time for Vladimir Putin - with the October 7 attack taking attention away from Russia's significant battlefield losses and desperate attempts to regain occupied territory in Ukraine.\nRussia enjoys warm relations with the terror group's leadership, recently welcoming members to Moscow. The Kremlin is also friendly with Iran - backers of Hezbollah, which has been launching attacks on Israel from Lebanon in the north.\nAnd while the eyes of the world are on Israel, analysts have warned that the US and NATO could be distracted from the threat of China as it continues to pile pressure on Taiwan.\nMeanwhile, Russia is also believed to have been sending satellite technology to volatile nuclear state North Korea in return for more than 1,000 containers of military equipment and munitions to use in Ukraine.\nAs a result, the West is now facing an existential threat from a coalition of hostile powers, according to economist and foreign policy expert Mark Toth and former US Army Colonel and intelligence officer Jonathan Sweet.\nHere, they discuss why the conflicts in Ukraine and the Middle East should be treated by the West as being part of a 'global war'.\nMARK TOTH AND JONATHAN SWEET: For some time at high altitude, Putin has been waging a structural war against the post-World War II global order\nMARK TOTH AND JONATHAN SWEET: China, ahead of Xi's meeting next Wednesday with U.S. President Joe Biden in San Francisco, stands to militarily benefit from any protracted American military involvement in Israel\nThe Russia-Ukraine and Israel-Hamas conflicts are separate and distinct, but mutually beneficial – particularly as Putin's military is no longer able to conventionally produce 'shock and awe' on the battlefields in Ukraine, thus reducing the Kremlin to try and 'block and stall' United States, United Kingdom and NATO support for Ukrainian President Volodymyr Zelensky and his generals.\nKinetically, the wars in Ukraine and the Middle East are unlikely to meld into one; however, they are part and parcel to the same overall ideological global war that Russia alongside China in the wings are aggressively waging against the West.\nTo understand this growing symbiosis between Ukraine's fight against Russian President Vladimir Putin and Israeli Prime Minister Benjamin Netanyahu's war against Hamas, it is essential to examine the second- and third-order effects of both wars on a worldwide basis.\nMembers of Ukraine's National Guard Omega Special Purpose unit fire a mortar toward Russian troops in the front line town of Avdiivka\nA member of Ukraine's National Guard Omega Special Purpose walks to a position in the front line town of Avdiivka, amid Russia's attack on Ukraine\nFor some time at high altitude, Putin has been waging a structural war against the post-World War II global order.\nPutin shares Chinese President Xi Jinping's goal of creating a multi-polar world; however, that is just code.\nWhile both men are taking different approaches – Putin kinetically in Ukraine, Xi strong armed military brinkmanship against Taiwan and the broader Indo-Pacific, including most recently against the Philippines – their goal is the same: Russian and Chinese economic and military domination. But it is a marriage of convenience.\nMARK TOTH AND JONATHAN SWEET: A badly weakened Kremlin is reduced to leveraging its 'arsenals of evil' – Iran and North Korea – for military support\nMoscow and Beijing's multipolar design can only be achieved if what they perceive as American global hegemony is destroyed or marginalized – and as a result the West would be sidelined in a then Russian and Chinese dominated world.\nTo try and yet accomplish this overall strategic goal given Putin's unraveling 'special military operation' in Ukraine, a badly weakened Kremlin is reduced to leveraging its 'arsenals of evil' – Iran and North Korea – for military support in the form of weapons and ammunition.\nWeakened conventionally, Putin desperately needed a distraction to launch his October 9th counteroffensive along the Avdiivka axis in eastern Ukraine.\nIsraeli soldiers take position during the ongoing ground operation of the Israeli army against Hamas in the Gaza Strip\nIsraeli military vehicle manoeuvres during the ongoing ground operation targeting Hamas after the October 7 attacks on Israel\nIran and Hamas – likely by coordinated design as we argued in The Hill in Washington DC – gifted Moscow just that on October 7th by heinously attacking Israeli civilians and Jews on a scale not witnessed since the Holocaust.\nHamas's ISIS-like depravity accomplished its goal. The world was shocked and little notice was paid to Putin's forces attempting to encircle Avdiivka two days later.\nAs we stated at the time, 'There was only one real winner last Saturday when war broke out in Israel — Russian President Vladimir Putin.'\nIsraeli Prime Minister Benjamin Netanyahu declared war on Hamas after the October 7 attacks\nNonetheless, Putin's counteroffensive in Avdiivka is failing and his land gains to date are militarily insignificant, especially when compared to his massive losses in men, armor and artillery. The losses were staggering.\nUkraine's Ministry of Defense reports that between October 9 and November 12, 29,120 Russian soldiers were killed, 526 tanks, 947 armored personnel carriers, 853 artillery pieces and 61 multiple launch rocket systems were destroyed.\nYet there are reports that Russia has assembled another 40,000 troops to continue the carnage.\nPutin is now more than ever desperate to weaken U.S., United Kingdom and NATO support to Ukraine.\nEscalating the conflict in the Mideast against U.S. national security interests in Israel is one course of action to try and 'block and stall' the White House given the Russian army's continued inability to conventionally deliver 'shock and awe' on the battlefields of Ukraine.\nLeveraging Iranian influence to have Hezbollah enter the fray would widen the conflict and possibly force the U.S. to kinetically support Israel.\nLeveraging Iranian influence to have Hezbollah enter the fray would widen the conflict and possibly force the U.S. to kinetically support Israel\nIran, however, will likely be hesitant to comply – especially the Islamic Revolutionary Guard Corps – given the relative ease in which the Israel Defense Force (IDF) has been able to divide and surround the Gaza Strip and to penetrate deep into northern Gaza City.\nLikewise, China, ahead of Xi's meeting next Wednesday with U.S. President Joe Biden in San Francisco, stands to militarily benefit from any protracted American military involvement in Israel – especially vis a vis Beijing's unification designs against Taiwan.\nWhile it is not a global kinetic war, it is nonetheless a global ideological war being fought on multiple kinetic fronts by proxies.\nIt is essential, therefore, that the U.S. and the United Kingdom begin treating it as a 'global war' and that it is one, existentially speaking, they must win.\nThe White House and Whitehall can begin achieving that by ensuring Ukraine and Israel both win their wars against Putin, Iran and their proxies.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "How Hamas is aiding Putin and Xi's ideological war against the West: US and UK 'must see Israel and Ukraine as part of a global conflict that could see Russia and China achieve economic and military d", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12742647/How-Hamas-aiding-Putin-Xis-ideological-war-against-West-UK-Israel-Ukraine-global-conflict-Russia-China-achieve-economic-military-domination.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}