{"authors": [], "date_download": "2024-02-05 15:41:40", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "called on Ukraine's alliescalled on Ukraine's alliescalled on Ukraine's alliesRFE/RL's Live Briefing gives you all of the latest develo", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274029770%2Flive-briefing-russia-invades-ukraine.json", "image_url": "https://cdn.bignewsnetwork.com/rfe1699712133.jpg", "language": "en", "localpath": null, "maintext": "called on Ukraine's alliescalled on Ukraine's alliescalled on Ukraine's alliesRFE/RL's Live Briefing gives you all of the latest developments on Russia's full-scale invasion of Ukraine, Western military aid to Kyiv, worldwide reaction, and the plight of civilians and refugees. For all of RFE/RL's coverage of the war, click here.\nLatest Developments At A Glance Air-raid warnings sounded in the Ukrainian capital, Kyiv, amid several strong explosions, as Ukraine marked the first anniversary of the liberation of Kherson on November 11. The Russian Defense Ministry said late on November 10 that air-defense forces had intercepted two Ukrainian drones over the territories of the Moscow and Smolensk regions just before midnight. The mayor's office of the Siberian city of Krasnoyarsk has rejected an application by relatives of mobilized soldiers fighting in Ukraine to hold a demonstration, citing measures instituted to combat the spread of COVID-19. NATO Secretary-General Jens Stoltenberg has called on Ukraine's allies to continue giving Kyiv all the necessary military support it needs in its war against Russia's aggression and warned that they have to be prepared for a protracted battle U.S. Treasury Secretary Janet Yellen said on November 10 that the U.S. government had seen evidence that Chinese firms may be aiding in the flow of equipment to Russia's war effort despite Western sanctions. Staff from the International Monetary Fund (IMF) and Ukrainian officials reached agreement on an updated set of economic and financial policies to allow disbursement of $900 million in funding, subject to approval by the IMF board. Bohdan Yermokhin, a 17-year-old Ukrainian who was taken to Russia last year from the southern city of Mariupol, will be returned to Ukraine following an agreement between the two countries, a top official in Kyiv said on November 10. The Kremlin has admitted for the first time to recruiting inmates to fight in the war against Ukraine, saying the recruits 'are atoning for their guilt with blood,' a phrase first used by Soviet dictator Josef Stalin during World War II. Ukraine's Defense Ministry has confirmed that its forces damaged two Russian landing boats in occupied Crimea in a strike early on November 10. Ukrainian President Volodymyr Zelenskiy signed laws extending martial law and a general mobilization by 90 days. The European Union will be able to work around any Hungarian veto and give Ukraine 50 billion euros ($53.4 billion) in aid, officials in the bloc said. Russia's war on Ukraine has had a huge negative impact on children's welfare and education, with thousands of schools and kindergartens being destroyed and millions of young people being denied access to education, Human Rights Watch said. How Did Russian Hackers Manage To Infiltrate Ukraine's Electrical Grid? Hackers affiliated with Russia's military intelligence agency penetrated, and disrupted, parts of Ukraine's electricity grid late last year using sophisticated new hacking tools, a new report said.\nThe findings add further evidence about the tools used by, as well as the sophistication of, the agency known as the GRU in targeting not only Ukraine, but other places around the globe as well. Read the story by Mike Eckel here.\nHow Is Ukraine's Counteroffensive Going? Not As Well As Many Had Hoped.\nUkraine reported has managed at least two bridgeheads across the Dnieper River. Whether it's the last gasp of Kyiv's five-month counteroffensive, or a glimmer of good news in face of Russia's own multipronged assault, is an open question. Read the story by Mike Eckel here.\nWeekly Map: Avdiyivka territorial control What Does The New U.S. House Speaker Mean For Aid To Ukraine?\nU.S. lawmaker Mike Johnson has previously voted against Ukraine aid, and now says funding to support Ukraine and Israel should be handled separately, suggesting he won't back a $106 billion package that includes aid for both countries. Does his election as House speaker doom future aid for Ukraine? Read the report by Reid Standish here.\nHow Is The Israel-Hamas War Affecting U.S. Aid For Ukraine?\nThe attack on Israel by Hamas -- designated a terrorist organization by the U.S. and EU -- is drawing the attention of a crisis-stricken world away from the Russia's war on Ukraine. At the same time, it could provide a path for the U.S. administration to secure support in Congress for new financial and military aid for Ukraine -- but that's far from guaranteed. Read the story by Todd Prince here.\nDoes It Make Sense For Ukraine To Strike Targets Inside Russia?\nIt is 'perfectly reasonable' for Ukraine to strike targets deep inside Russia, in part to 'degrade' Russia's military, says Richard Dannatt, a former head of the British Army. In an interview with RFE/RL's Georgian Service, Dannatt also says that given the slow pace of Ukraine's counteroffensive, Kyiv and its Western partners should prepare for a likely protracted conflict. Read the interview by Vazha Tavberidze here.\nUkraine Territorial Control (Updated weekly) How Are Chinese Drones Helping Russia In Its Invasion Of Ukraine?\nDespite promises from Chinese companies to halt sales, new research shared with RFE/RL shows Chinese-made drones being sold to Russian entities and training centers with links to Moscow's war effort. Read the story by Reid Standish here.\nZapo/Donetsk offensive (Updated weekly) How Are Ordinary Russians Feeling About The War Being Delivered To Their Doorstep?\nAttacks in Shebekino and elsewhere in the Belgorod region have brought the war home to Russia as local residents grapple with the new reality. Read the article by Oleg Artyushenko here.\nHeavy Fighting In Donetsk, Eastern Ukraine (updated weekly)\nCopyright (c) 2018. RFE/RL, Inc. Republished with the permission of Radio Free Europe/Radio Liberty, Washington DC 20036", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Live Briefing: Russia Invades Ukraine", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274029770/live-briefing-russia-invades-ukraine"}