{"authors": [], "date_download": "2024-02-05 15:41:45", "date_modify": "None", "date_publish": "2023-11-13 08:09:00", "description": "Fighting between Israeli forces and Palestinian militants outside Gaza’s largest hospital has prompted thousands of people to flee from the sprawling medical facility, but hundreds of patients and others displaced by the war remained inside, health officials said Monday", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-israeli-tedros-adhanom-ghebreyesus-hamas-b2446223.html.json", "image_url": "https://static.independent.co.uk/2023/11/13/08/Israel_Palestinians_09088.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFighting between Israeli forces and Palestinian militants outside Gaza's largest hospital has prompted thousands of people to flee from the sprawling medical facility, but hundreds of patients and others displaced by the war remained inside, health officials said Monday.\nWorld Health Organization Director-General Tedros Adhanom Ghebreyesus said a day earlier that the UN agency was in contact with Shifa hospital, which he said had been without electricity and water for three days, and noted that gunfire and bombings outside the compound “have exacerbated the already critical circumstances.\"\n“Regrettably, the hospital is not functioning as a hospital anymore,” he said in a post on X, formerly known as Twitter.\nPatients inside the hospital include dozens of babies at risk of dying because of a lack of electricity, health officials at the facility said.\nMore than two-thirds of Gaza’s population of 2.3 million have fled their homes since the war began.\nGaza City, the largest urban area in the territory, is the focus of Israel’s campaign to crush Hamas following the militant group's deadly Oct. 7 incursion into southern Israel that set off the war.\nMore than 11,000 Palestinians, two-thirds of them women and minors, have been killed since the war began, according to the Health Ministry in Gaza, which does not differentiate between civilian and militant deaths. About 2,700 people have been reported missing.\nMore than 1,200 people in Israel died, most of them in the Hamas attack, and about 240 hostages were taken from Israel into Gaza by Palestinian militants.\nCurrently:\n— Thousands flee Gaza's main hospital but hundreds, including babies, still trapped by fighting\n— Hospitals have special protection under the rules of war. Why are they in the crosshairs in Gaza?\n— Biden's certitude on Israel gives way to the complexities and casualties of a brutal war\n— Attacks by Lebanon's Hezbollah group wound 7 Israeli troops, 10 others along border with Israel\n— US conducts airstrikes against Iran-backed groups in Syria, retaliating for attacks on US troops\n— Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war\nHere’s what is happening in the latest Israel-Hamas war:\nMANY PALESTINIANS HAVE LEFT GAZA'S LARGEST HOSPITAL, UN SAYS\nCAIRO — Many displaced Palestinians, along with some medical patients, have left Gaza’s largest hospital, which is surrounded by Israeli forces, a U.N. health official said Monday.\nAbout 650 patients, 500 health care workers and an estimated 2,500 displaced people remain in the sprawling Shifa hospital compound, said Mohammed Zaqout, director of hospitals in Gaza. This would signal a significant departure since the weekend when Gaza health officials had said about 1,500 patients, along with 1,500 medical workers and 15,000 displaced people were at Shifa.\nIsraeli forces and Hamas gunmen have waged heavy battles outside Shifa, and some hospital officials have said Shifa was under siege, with those inside being pinned down by Israeli fire. Israel has said it had offered safe passage to those wanting to leave.\nThe situation at Shifa deteriorated over the weekend, with doctors reporting that the last generator had run out of fuel, leading to the deaths of several patients, including premature babies.\nThe U.N. official said Monday that many of the displaced fled the compound and that some families took relatives with moderate injuries with them. He said remaining patients require special procedures for evacuation including equipped ambulances to take them to Egyptian hospitals. The official spoke on condition of anonymity because he was not authorized to speak to journalists.\n___\nAssociated Press writer Samy Magdy contributed.\nISRAEL BLOCKS HEZBOLLAH-AFFILIATED, BEIRUT-BASED TV CHANNEL\nJERUSALEM — The Israeli government has blocked the Hezbollah-affiliated, Beirut-based Al Mayadeen TV news channel from broadcasting in Israel.\n“Broadcasts that identify with the enemy are harmful to the state’s security and should be blocked,” Communciations Minister Shlomo Karhi wrote in a joint statement with Defense Minister Yoav Gallant.\nLast month, the government approved emergency regulations allowing it to block the wartime operations of foreign channels it deems hostile to the state. Karhi had also pressed to shut down the Israeli office of Qatar-based Al Jazeera, but Doha is leading efforts to release hostages captured from southern Israel during Hamas’ bloody Oct. 7 incursion, and the Israeli government hasn’t moved ahead on his plan.\nWHO DIRECTOR-GENERAL SAYS SHIFA ‘NOT FUNCTIONING AS A HOSPITAL’\nBEIRUT — World Health Organization Director-General Tedros Adhanom Ghebreyesus said the UN agency was in contact with Shifa Hospital late Sunday, which he said had been without electricity and water for three days.\n“The constant gunfire and bombings in the area have exacerbated the already critical circumstances,” he said in a post on X, formerly known as Twitter. “Regrettably, the hospital is not functioning as a hospital anymore.”\nSeveral charities and humanitarian agencies that support Shifa have told The Associated Press they were unable to reach the hospital throughout the day.\nMORE FOREIGN NATIONALS EVACUATED FROM GAZA\nBUCHAREST, Romania — A group of 86 Romanian citizens were evacuated on Sunday from the Gaza Strip into Egypt, Romania’s Foreign Ministry said.\nThe latest group of evacuees left Gaza through the Rafah border crossing and were on their way to Cairo, it said. Earlier Sunday, 41 Romanians were flown to Romania from Egypt after being evacuated from Gaza, bringing the total to 134 since the conflict with Israel started.\nSince Hamas launched its attack on Israel on Oct. 7, at least five Romanian citizens have been confirmed killed. Six Romanians who hold dual Romanian-Israeli citizenship are also among the hostages held by Hamas.\nMeanwhile, Albania's foreign minster said Sunday that the first Albanian citizens, a mother and her four children, were evacuated from Gaza. Igli Hasani posted on X, formerly known as Twitter, that the five people were safe in Egypt “while we continue the procedures for their return to Albania as soon as possible.”\nHasani thanked Israel and Egypt for their cooperation and UN migration and the International Committee of the Red Cross for their support “in this complex operation.\"\nAlso Sunday, a group of 32 Brazilians was en route to Cairo after they were allowed to cross from Gaza into Egypt, according to a statement from Brazil’s Foreign Ministry posted on X. From Cairo, the group will fly to Brazil on a plane belonging to the Brazilian armed forces. They are scheduled to arrive Monday evening.\nJORDAN CALLS ON EU TO HOLD ISRAEL TO ACCOUNT\nBEIRUT — Jordanian Foreign Minister Ayman Safadi said Sunday that he asked European Union foreign policy chief Josep Borrell to apply the same “legal, moral grounds” for its support of Ukraine to “define its stand on Israel’s war crimes.”\n“Israel crossed every legal, ethical (and) humanitarian red line in its barbaric war on Gazans,” Safadi said on X, formerly known as Twitter. “Message to the region: Identity of aggressor & victim determines applicability of Int’l law.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Fighting outside Gaza's largest hospital prompts thousands to flee", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-israeli-tedros-adhanom-ghebreyesus-hamas-b2446223.html"}