{"authors": ["Adrian Horton"], "date_download": "2024-02-05 15:16:28", "date_modify": "None", "date_publish": "2024-01-22 22:39:39", "description": "The new documentary War Game follows lawmakers and military officials role-playing the response to a political coup", "filename": "https%3A%2F%2Fwww.theguardian.com%2Ffilm%2F2024%2Fjan%2F22%2Fwar-game-documentary-sundance-january-6.json", "image_url": "https://i.guim.co.uk/img/media/0ce1f29bc03e6ba35a00a0f85faf8f662f4b9e0f/80_0_2400_1440/master/2400.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=39533216e6527b8aa90265b62732a63b", "language": "en", "localpath": null, "maintext": "Is the US government prepared to withstand another January 6? That’s the question a new documentary sparking conversation at the Sundance film festival chillingly poses, arguing that US government and military officials must brace for the possibility of a potential political coup in a divided America.\nWar Game, directed by Jesse Moss and Tony Gerber, observes a closed-door, unscripted simulation of an armed attack on the Capitol based on the events of 6 January 2021, when a mob of Trump supporters and far-right insurrectionists stormed the building to disrupt lawmakers’ certification of Joe Biden’s election. The six-hour exercise asked a bipartisan group of US defense, intelligence and elected policymakers spanning five presidential administrations to role-play the administrative response to a political coup backed by rogue members of the US military in the wake of a contested election.\nThe exercise was developed by the Vet Voice Foundation, an organization helping military veterans in civic leadership and policy, to help US government officials practice responses to a January 6-level threat to democracy and understand the threat of extremism from within the military. The film notes that one in five criminal defendants from the Capitol attack were military veterans.\nJanuary 6 “did not surprise those who follow far-right movement”, says Kristofer Goldsmith, a combat veteran from the war in Iraq who developed the game’s “red cell” of insurgents. War Game opens with footage of Goldsmith and his colleague Chris Jones scouting out Washington DC for how a potential social media and conspiracy theory-fueled mob attack would unfold. Both experts on domestic extremist movements, the two based their mock insurgency group, the Order of Columbus, on Q-Anon, Donald Trump’s Maga movement and far-right groups involved in the Capitol attack, such as the Proud Boys or Oath Keepers.\nThe war game, held at a hotel in Washington DC in January 2023, imagines a fictional 6 January 2025, in which the Order of Columbus has called an attack on Congress to prevent the certification of President Hotham (played by the former Montana governor Steve Bullock) after a contested election. Bullock’s president, in a war room with several advisors, intelligence officers and military heads, must decide how to respond to an escalating series of threats including: the storming of the Capitol aided by rogue national guard members, disinformation on social media and coordinated uprisings on several state capitols. They must contend with messages from a Trump-like rival candidate inciting more violence, and a video from a high-ranking general, based on the former Trump official and Stop the Steal rally speaker Michael Flynn, calling on the military to disobey the commander in chief.\nView image in fullscreen Photograph: Sundance\nThe point of the exercise is to “think about the unthinkable”, says Benjamin Radd, a game producer who recalls living through Iran’s 1979 revolution as a child, in which stability and institutional authority collapsed. Do you respond with a strong show of force? How much force? Focus on messaging? When do things get dire enough to justify invoking the Insurrection Act, a law allowing the president to use the US military on its own citizens, considered the game’s nuclear option.\nThat’s in part because of its potential for abuse in the wrong hands. The film notes that Stewart Rhodes, the founder of the Oath Keepers, personally implored Trump to invoke the Insurrection Act to prevent the certification of Biden’s election, and promised that the Oath Keepers would support him if he did. “You must use the Insurrection Act and use the power of presidency to stop him. All us veterans will support you,” he wrote. Rhodes, a Yale-educated former paratrooper who founded the far-right group (including current and retired military personnel, law enforcement officers and first responders) in 2009, was convicted of seditious conspiracy for his role in the Capitol attack.\nThe 94-minute film also features interviews with game producers and participants on what motivated them to fight domestic extremism, and how seriously they view the country’s vulnerability to potentially violent, anti-democratic factions. All it takes is a “tiny fraction” of enlisted service people who believe “this conspiracy, this cult, this religion” to “pose a serious security threat”, says Goldsmith, who is particularly concerned about the recruitment of disillusioned, isolated veterans to far-right movements.\n“Wishing that it’s just going to go away? It’s not going to happen,” says Linda L Singh, a retired major general of the Maryland army national guard, on extremist beliefs in the armed forces.\nThe film stresses that while a political coup attempt is by no means likely in the near future, it is important to remember that the US has no built-in immunity to one. The repeated message is: it can happen here. “Is it probable? Probably not,” says Heidi Heitkamp, a former senator from North Dakota playing a senior advisor to Bullock’s president. “Is it possible? Absolutely.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘Think about the unthinkable’: could the US handle an even worse January 6?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/film/2024/jan/22/war-game-documentary-sundance-january-6"}