{"authors": ["Rachael Bunyan", "Elena Salvoni"], "date_download": "2024-02-05 15:41:47", "date_modify": "None", "date_publish": "2023-11-13 07:33:45", "description": "MAILONLINE LIVEBLOG: As the Israel-Hamas war enters its 38th day, follow here for all the latest updates.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12742189%2Fisrael-hamas-war-live-updates-gaza-hospital-warning.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/13/07/77728237-0-image-a-11_1699860653739.jpg", "language": "en", "localpath": null, "maintext": "Nearly 40 tiby newborn babies are under the care of exhausted medics at Gaza's Al Shifa hospital, which is besieged by Israeli tanks battling Hamas fighters, and lacks electricity, water, food, medicines and equipment.\nDr. Mohamed Tabasha, head of the paediatric department at Al Shifa Hospital, said on Monday: 'Yesterday I had 39 babies and today they have become 36. I cannot say how long they can last. I can lose another two babies today, or in an hour.'\nThe premature babies, who weigh less than 1.5 kg (3.3 pounds) each and in some cases only 700 or 800 grams, should be in incubators where the temperature and humidity can be regulated according to their individual needs.\nInstead, they had to be moved to ordinary beds over the weekend because of a shortage of electricity, said Tabasha. They were placed side by side, surrounded by packets of nappies, cardboard boxes of sterile gauze and plastic bags.\n'I never expected in my life that I would put 39 babies side by side on a bed, each with a different disease, and in this acute shortage of medical staff, of milk,' said Tabasha.\nThe infants are too cold, and the temperature is not stable because of power cuts, he said. In the absence of infection control measures, they are transmitting viruses to each other and they have no immunity.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel-Hamas war RECAP: EU calls for 'meaningful' pauses in Gaza fighting as Palestine asks for aid to be 'parachuted' into the region", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12742189/israel-hamas-war-live-updates-gaza-hospital-warning.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}