{"authors": ["Robert Tait", "Lauren Gambino"], "date_download": "2024-02-05 15:41:49", "date_modify": "None", "date_publish": "2023-11-12 12:00:04", "description": "The first Palestinian American woman in Congress was formally rebuked this week, but allies say she’ll keep speaking up for peace and justice", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fnov%2F12%2Frashida-tlaib-censure-congress-palestinian-rights-gaza.json", "image_url": "https://i.guim.co.uk/img/media/7aaced5f870072c7f0265ffa73265c9be05a6b33/0_334_3097_1858/master/3097.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=300f10f4762f9865571f7b4b8c7bd718", "language": "en", "localpath": null, "maintext": "As Israeli ground troops battled in Gaza City amid a spiralling civilian death toll on Tuesday, the congresswoman Rashida Tlaib, the sole Palestinian American member of the US Congress, rose to answer a censure motion rebuking her for comments she made about the war.\nGripping a photograph of her sity, her grandmother who lives in the occupied West Bank, she defended her stance and declared that she “will not be silenced” and “will not let you distort my words”.\n“I can’t believe I have to say this, but Palestinian people are not disposable,” Tlaib said, her voice breaking. The congresswoman Ilhan Omar of Minnesota reached to comfort Tlaib, a show of solidarity between the only Muslim women in the chamber. Tlaib continued: “The cries of the Palestinian and Israeli children sound no different to me.”\nLate that night, 22 Democrats joined nearly all Republicans in censuring Tlaib, a punishment one step below expulsion. As the gavel came down, her closest allies in the Democratic party’s progressive wing, all people of colour, encircled Tlaib as if to form a protective shield.\nThe extraordinary scene crystallised the fierce devotion and respect that Tlaib – one of 14 children of Palestinian immigrants to the US – commands among her political allies, friends, staff members and, according to supporters, many of her constituents in her Michigan congressional district.\nBut in its intensity, it also underlined the fierce passions aroused among critics of the Michigan Democrat, 47, who has become – at least since Hamas’s attack on Israel last month – one of the most polarising figures on Capitol Hill.\nThe censure against Tlaib, proposed by the Republican congressman Rich McCormick of Georgia, accused her of “promoting false narratives regarding the October 7 2023 Hamas attack on Israel and for calling for the destruction of the state of Israel”. Its passage made Tlaib only the 26th member of the House of Representatives to be censured since its formation in 1789.\nTuesday’s vote, which came days after she avoided an earlier censure motion, was triggered by the presence of a highly charged slogan, “From the river to the sea, Palestine will be free”, in a video Tlaib posted on social media last week that also accused Joe Biden of supporting “genocide” and called for an immediate ceasefire amid Israel’s military offensive in Gaza.\nHowever hurtful personally for Tlaib – a legislator known for her diligence and conscientiousness on behalf of her constituents – she signalled that she had no intention of backing down, reflecting the stubbornness Biden himself praised two years ago, when, following a memorable eight-minute heated conversation on Palestinian rights on the runway of Detroit’s airport, he complimented her as “a fighter”.\n“She will not be deterred by a censure motion passed by the House of Representatives. Not a bone in my body believes that,” said Abbas Alawieh, a senior Democratic strategist who previously worked as Tlaib’s legislative director.\n“Rashida is a person on a mission. She is fiercely protective of the people she loves. She will stop at nothing. For her, to support or not to support a cause isn’t a theoretical political question. It’s a question of whether or not her family members deserve to stay alive. It’s the life or death of people she’s directly connected to.”\nThis commitment has fortified her against a shocking degree of personal abuse that would have felled other politicians, said Alawieh, who recalled spikes in phone calls to her office and verbal attacks in public, often after Fox News or other rightwing news channels had criticised her views.\n“When I went to work for her, I couldn’t believe how often the phone rang,” he said. “You couldn’t even imagine how many vile, unacceptable bad words could be strung together in sentences. It will be a sentence jam-packed with sexism, racism, Islamophobia – just all of it.”\nTlaib, whose father was born in the East Jerusalem neighbourhood of Beit Hanina, has long been a lightning rod for criticism from Israel’s staunchest supporters, who have alleged that her views and rhetoric are antisemitic.\nIn the immediate aftermath of the Hamas attack, she faced backlash from Republicans and some Democrats over her initial statement, in which she expressed grief for the loss of “Palestinian and Israeli lives” but did not mention Hamas, though she did call for “ending the occupation, and dismantling the apartheid system”.\nView image in fullscreen A sign outside the congressional office of Rashida Tlaib. Photograph: Stefani Reynolds/AFP/Getty Images\nShe drew additional fire from her critics after being one of nine Democrats to vote against a House resolution – subsequently adopted by a vote of 412-10 – declaring solidarity with Israel after the Hamas attacks.\nExplaining her opposition in a floor debate on 25 October, she said the resolution was “not a serious examination of the root causes of the violence we are witnessing and doubles down on decades of failed policy”.\nUnconditional US military support for Israel had failed to bring “peace and justice” to the region, she said.\nShe added: “Achieving a just and lasting peace where Israelis and Palestinians have equal rights and freedoms, and where no person lives in fear for their safety, requires ending the blockade, occupation and dehumanizing system of apartheid.”\nHer opponents have also pointed to her use of the “river to the sea” slogan. While Tlaib and others justify the phrase as an “aspirational call for freedom, human rights and peaceful co-existence”, critics say it is a pro-Hamas chant calling for the eradication of the Jewish state.\nThe Democratic congressman Brad Schneider of Illinois cited her embrace of the slogan and her refusal to remove a tweet blaming Israel for a devastating explosion at al-Ahli Baptist hospital in Gaza City that killed hundreds, despite Israeli denials and US intelligence claims that a misfired Palestinian rocket had caused the damage.\n“Congresswoman Tlaib has repeatedly insisted on using inflammatory language that dangerously amplifies Hamas propaganda and disinformation,” Schneider said in a statement. “Representative Tlaib most certainly understands the import and impact of her words and yet still chooses to use them anyway. We are at an exceedingly perilous moment, when emotions and intentions are on a razor’s edge.”\nEven Bernie Sanders, the leftwing senator from Vermont, who has spoken out forcefully against Israel’s military campaign in Gaza while stopping short of a ceasefire call, voiced muted criticism of Tlaib’s use of the slogan.\nCalling her a “friend” who had been “shaken” by the bloodshed in Gaza, Sanders told CNN: “We need a serious discussion on how the hell we get out of this difficult situation, maintain democracy, bring peace to the world. And it ain’t easy, but slogans are not going to do it on any side.”\nThe congressman Jamaal Bowman of New York, a fellow member of the progressive “Squad” who has also called for a ceasefire, dismissed the focus on the slogan as “a distraction”, calling Tlaib “one of the strongest, most compassionate people I know”.\n“Congresswoman Tlaib has always been an advocate of peace, justice and human rights,” he said. “It is false and misleading to imply that she intended to call for destruction or violence. She is not in support of Hamas. We should all be doing everything in our power to end violence against innocent civilians.”\nConservatives have demanded Tlaib take down the Palestinian flag displayed outside her congressional office, saying it was disrespectful in the wake of the Hamas attack. One Republican member advocated a ban on foreign flags in the Capitol, while another, the congressman Brian Mast of Florida, wore a uniform from his time serving in the Israel Defense Forces. On X, he wrote: “Tlaib’s Got Her Flag, I’ve Got My Uniform.”\nMast later said there were “very few innocent Palestinian civilians … I don’t think we would so lightly throw around the term innocent Nazi civilians”, remarks that some House Democrats believe warrant a censure.\nTlaib’s previous outspokenness has landed her in hot water with pro-Israel advocates. The liberal Israel advocacy group J Street withdrew its endorsement of her campaign in 2018 after she publicly voiced support for a one-state solution to the Middle East conflict, in open contradiction of the organisation’s policy favouring two states, Israel beside an independent Palestine. As part of her support for a one-state solution – entailing a single democratic state encompassing Israel and the occupied territories – Tlaib has said she is uncomfortable with the idea of uprooting Jewish settlers from their homes in the occupied West Bank.\nShe will be known for being the freedom fighter and the justice warrior. She will be known for being the peacekeeper Cori Bush\nIn a floor speech in 2021, Tlaib, arguing against a bill to send $1bn in additional funding to support Israel’s Iron Dome missile defense program, accused Israel’s far-right government of operating a “violent apartheid system”, a characterization that drew a furious response from longstanding Democratic supporters of Israel. Tlaib, who has long sought to condition aid to Israel on Palestinian rights, was one of just nine lawmakers to vote against the measure.\nTlaib has Jewish supporters, particularly among leftwing groups that echo her ceasefire calls and have staged demonstrations in Washington accusing Israel of unleashing a “genocidal” war in Gaza.\n“Congresswoman Tlaib is truly an incredible person and one of the few members of Congress who genuinely cares about people,” said Beth Miller, political director of Jewish Voice for Peace (JVP), a leftist group that openly describes itself as anti-Zionist.\n“She has so much warmth and love, and makes everyone feel welcome and safe around her. This is really important because we see this horrible smear campaign that turns her into the opposite of what she is – which is someone who cares deeply for Israelis who have been killed, as well as Palestinians who have been killed. We are proud to be her ally in this.”\nEva Borgwardt, the national spokesperson for If Not Now, another Jewish group that has staged ceasefire rallies in concert with JVP, said Tlaib was a victim of anti-Palestinian racism being espoused by Republican politicians who see her as a “threat to their vision of a white Christian supremacist future of America”.\n“As a Jewish American, I’m absolutely terrified of the implications of the ongoing targeting of Rashida, because Jewish and Palestinian safety is tied together,” she said. “I cannot imagine what it’s like to face what she has dealt with. I can only hope to have a tiny amount of the integrity and strength that it must take to stand up and lead in Congress every day despite threats from other congressmen down the hall.”\nAs the first Palestinian-American woman to serve in Congress, Tlaib carries “a greater burden” when she challenges US policy toward Israel, said Dawud Walid, executive director of the Michigan chapter of the Council on American-Islamic Relations.\nView image in fullscreen Democratic members of Congress with a sign demanding a ceasefire in the Israel-Hamas war. Photograph: Anadolu Agency/Getty Images\nBut he said Tlaib is not acting alone. For many constituents in her district, which includes the city of Dearborn, home to one of the largest Arab American communities in the country, Palestinian rights are deeply personal, he said.\n“For people in her district, this isn’t some sort of foreign policy issue,” Walid said. “These are people who have family members who are directly impacted by occupation and bombs being dropped on civilians.”\nDespite her support in the district, Tlaib’s detractors hope that her denunciations of the US response to the Israel-Hamas war will draw a primary challenge from the party’s center, like the ones facing other Israel sceptics within the party.\nIn Detroit, she is now the target of an attack ad by a Democratic pro-Israel group. The ad sharply criticises Tlaib for her vote last month against a House resolution declaring solidarity with Israel following the Hamas assault, as well as her past vote against funding for Israel’s Iron Dome missile defense system. It also argues that her ceasefire bill “would allow the terrorists to rearm themselves”.\n“We thought it was important for her constituents and neighbors to know that she is not only wrong on the substance, but radically out of step with the Democratic party,” said Mark Mellman, whose group, the Democratic Majority for Israel, is behind the ad.\nHe continued: “We’re trying to see if she might moderate her positions as a result of her constituents. And if not, perhaps someone will be interested in taking her on.”\nTlaib’s supporters have denounced the ad’s rhetoric as “dangerous” and demanded its removal in light of a sharp rise in Islamophobia and anti-Arab sentiment.\nThe irony of all this, say longtime associates, is that Tlaib has never set out to be a pro-Palestinian organiser – preferring to focus on local issues such as poverty, pollution and water rights, particularly in African American communities.\nShe campaigned vigorously to win a $600m lead pipe replacement and challenged socially conservative parts of her district with her advocacy for LGBTQ+ rights.\n“When people in her district think about Rashida in general, they think ‘water is a human right’,” said Alawieh. “She was obsessed with the idea.”\nThat may once have been true. But nationally, her reputation is set to be defined by more global – and more bitterly contested – concerns.\nFor Cori Bush, a progressive Democrat from Missouri who sponsored ceasefire legislation with Tlaib, it is destined to eclipse the present turmoil and land the Michigan congresswoman a place squarely on the right side of history.\n“Even though the censure happened, people must understand that that is not her legacy,” Bush said. “Rashida Tlaib’s legacy will be about saving lives. It will be about making sure the Palestinians know that they belong and that they should exist in this world.\n“She will be known for being the freedom fighter and the justice warrior. She will be known for being the peacekeeper.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘I will not be silenced’: Rashida Tlaib won’t stop fighting for Palestinian rights", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/nov/12/rashida-tlaib-censure-congress-palestinian-rights-gaza"}