{"authors": ["Amy Sedghi", "Vivian Ho"], "date_download": "2024-02-05 15:41:50", "date_modify": "None", "date_publish": "2023-11-12 18:25:30", "description": "Wagner arm likely led by son of Yevgeny Prigozhin, killed in plane crash after fighters marched on Moscow, says UK defence ministry", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F12%2Frussia-ukraine-war-live-nord-stream-pipeline-sabotage-germany-kyiv.json", "image_url": "https://i.guim.co.uk/img/media/cfa45970eb12c90cdbb5fd825fe084a1f9c7d1aa/0_65_4928_2957/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=0c21bcc380bc915403e82a915acdeb64", "language": "en", "localpath": null, "maintext": "From 12 Nov 2023 17.00 CET Summary of the day so far Dmitry Medvedev, Russia’s former leader, posted on Telegram today an apparent response to a proposal put forth by Anders Fogh Rasmussen, a former Nato secretary general, to have Ukraine join the alliance without its currently Russian-occupied territories. Medvedev, who now serves as deputy chair of Russia’s security council, used Russia’s oft-touted and inaccurate rhetoric that Ukraine is not a country, and therefore cannot join Nato.\nThree Russian guard officers were killed in an explosion carried out by the local resistance in Russian-occupied Melitopol , Ukraine’s defence intelligence said today.\nIn Kyiv, veterans and family of Ukrainian servicemen held a rally calling for legislation regulating the length of active military duty in Ukraine.\nLarge elements of the Wagner mercenary group have likely been assimilated into the command structure of Russian national guard (Rosgvardiya), the UK defence ministry said in its daily intelligence briefing. The Wagner arm in the Rosgvardiya is likely being led by Pavel Prigozhin, son of the late Wagner leader Yevgeny Prigozhin, who was killed in a plane crash shortly after Wagner fighters captured the Russian city of Rostov-on-Don and marched on Moscow – acts that Vladimir Putin declared “treason”. A senior Ukrainian military official played a key role in the sabotage of the Nord Stream gas pipelines in the Baltic Sea last year, according to a joint investigation by the Washington Post and Der Spiegel published Saturday . Roman Chervinsky, a colonel in Ukraine’s Special Operations Forces, was the “coordinator” of the Nord Stream operation, people familiar with his role told the US and German newspapers.\nRussian investigators have determined that the freight train that was derailed yesterday in Russia’s Ryazan oblast was caused by a homemade bomb on the railway line. Authorities have opened a terrorism investigation into the derailment. While Kyiv has not yet commented on the incident, but Russian officials have previously blamed pro-Ukrainian saboteurs for several attacks on the country’s railway system.\nThree people were killed in Russian attacks on the Donetsk oblast overnight, acting regional governor Ihor Moroz said on Telegram. Two people were killed in Toretsk , wehre 30 houses, an infrastructure facility and an administrative building were damaged in Russian attacks. One person was killed in Minkivka .\nA 64-year-old man was killed and his wife hospitalised this morning following the Russian shelling of Dnipro district of the city of Kherson , according to regional governor Oleksandr Prokudin.\nParts of city of Donetsk have lost power following two projectile strikes in the northwestern part of the city. It’s unclear if the strikes came from Ukrainian or Russian forces.\nRussia has accused Kyiv of attacks on border regions. On Sunday, Russia said there had been a series of attacks in the border regions of Bryansk and Belgorod , damaging five train carriages and causing one injury.\nRussian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities. The head of Ukraine’s ground forces, said that Russian troops had begun a push to regain territory near Bakhmut .\nA Russian Defense Ministry spokesman said on Sunday that Russian forces over the previous day repelled five Ukrainian attacks near Klischiivka and Kurdyumivka, two small settlements lying south of Bakhmut.\nUpdated at 19.25 CET\n12 Nov 2023 19.19 CET Russian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities, Ukrainian military officials have said. In a report by Associated Press, the head of Ukraine’s ground forces, said that Russian troops had begun a push to regain territory near Bakhmut. The eastern mining city was the site of the war’s bloodiest battle before falling into Russian hands in May. Col Gen Oleksandr Syrskyi wrote on Telegram on Sunday afternoon: “Toward Bakhmut, the Russians have become more active and are trying to recapture previously lost positions. ... Enemy attacks are being repelled.” A Russian Defense Ministry spokesman said on Sunday that Russian forces over the previous day repelled five Ukrainian attacks near Klischiivka and Kurdyumivka, two small settlements lying south of Bakhmut.\n12 Nov 2023 18.54 CET Russia has accused Kyiv of attacks on border regions. On Sunday, Russia said there had been a series of attacks in the border regions of Bryansk and Belgorod, damaging five train carriages and causing one injury. According to a report by Agence France-Presse, Moscow said it would open an investigation into a Ukrainian strike which injured a civilian in a village on the Ukrainian border, without giving more specifics. The governor of Belgorod, Vyacheslav Gladkov, said that drones and missiles had targeted several areas in the region on Saturday. He said that in most cases they had not caused damage, but three houses and “five railway carriages were damaged” in the town of Valuyki some 30 kilometres (19 miles) from the Ukrainian border. Gladkov also said that power lines were hit, temporarily cutting off electricity. Overnight, Russia’s defence ministry said it had destroyed two Ukrainian drones in the region, preventing what it called attempts at a “terrorist attack”, said AFP. Kyiv also said that a strike by Moscow caused the death of a 64-year-old man in the southern region of Kherson, and injured his wife. Ukrainian officials hailed the anniversary of the recapture of Kherson city on Saturday, the regional capital liberated a year ago in the last major frontline shift but which remains a target of Russian shelling.\n12 Nov 2023 18.17 CET Ukrainian refugees returning from Israel, have spoken of their struggle, saying they had left “one war for another”. Agence France-Presse report: Tetiana Kocheva fled her home in Ukraine’s northeastern city of Kharkiv after Russia invaded last year, taking refuge in Israel’s coastal town of Ashkelon, near Gaza. Her husband had worked in Israel in the past, and she thought taking their three children there - away from Russian attacks - would guarantee living in peace. But then came 7 October, when Hamas attacked Israel, leading to a war that has since killed thousands. Like several thousand other Ukrainian refugees, Kocheva fled war for a second time. “If I am killed then at least it’s on my native land,” the 39-year-old said. In the capital Kyiv, Anna Lyashko and her eight-year-old daughter Diana were also back from Israel. They had fled to Israel in the first weeks of Russia’s invasion in March last year. They had been living close to areas of the Kyiv region that fell to Russian forces early in their attack, living without “electricity, water or communication”, the 28-year-old mother said. “My daughter was very scared and I decided to leave,” she said. Lyashko decided to take her daughter to Israel, where she had a relative. But when hostilities started in Israel last month, it brought her back to the day Russia invaded Ukraine. “My first feelings were the same as 24th of February (2022) in Ukraine,” she said. “Someone called me in the morning and said ‘Anna, war has started’, it was exactly the same feeling I had in Ukraine.” She said her daughter had “fear in her eyes” and that she “understood that I could not stay”. They flew out of Tel Aviv a week later, with the help of the Ukrainian embassy.\n12 Nov 2023 17.00 CET Summary of the day so far Dmitry Medvedev, Russia’s former leader, posted on Telegram today an apparent response to a proposal put forth by Anders Fogh Rasmussen, a former Nato secretary general, to have Ukraine join the alliance without its currently Russian-occupied territories. Medvedev, who now serves as deputy chair of Russia’s security council, used Russia’s oft-touted and inaccurate rhetoric that Ukraine is not a country, and therefore cannot join Nato.\nThree Russian guard officers were killed in an explosion carried out by the local resistance in Russian-occupied Melitopol , Ukraine’s defence intelligence said today.\nIn Kyiv, veterans and family of Ukrainian servicemen held a rally calling for legislation regulating the length of active military duty in Ukraine.\nLarge elements of the Wagner mercenary group have likely been assimilated into the command structure of Russian national guard (Rosgvardiya), the UK defence ministry said in its daily intelligence briefing. The Wagner arm in the Rosgvardiya is likely being led by Pavel Prigozhin, son of the late Wagner leader Yevgeny Prigozhin, who was killed in a plane crash shortly after Wagner fighters captured the Russian city of Rostov-on-Don and marched on Moscow – acts that Vladimir Putin declared “treason”. A senior Ukrainian military official played a key role in the sabotage of the Nord Stream gas pipelines in the Baltic Sea last year, according to a joint investigation by the Washington Post and Der Spiegel published Saturday . Roman Chervinsky, a colonel in Ukraine’s Special Operations Forces, was the “coordinator” of the Nord Stream operation, people familiar with his role told the US and German newspapers.\nRussian investigators have determined that the freight train that was derailed yesterday in Russia’s Ryazan oblast was caused by a homemade bomb on the railway line. Authorities have opened a terrorism investigation into the derailment. While Kyiv has not yet commented on the incident, but Russian officials have previously blamed pro-Ukrainian saboteurs for several attacks on the country’s railway system.\nThree people were killed in Russian attacks on the Donetsk oblast overnight, acting regional governor Ihor Moroz said on Telegram. Two people were killed in Toretsk , wehre 30 houses, an infrastructure facility and an administrative building were damaged in Russian attacks. One person was killed in Minkivka .\nA 64-year-old man was killed and his wife hospitalised this morning following the Russian shelling of Dnipro district of the city of Kherson , according to regional governor Oleksandr Prokudin.\nParts of city of Donetsk have lost power following two projectile strikes in the northwestern part of the city. It’s unclear if the strikes came from Ukrainian or Russian forces.\nRussia has accused Kyiv of attacks on border regions. On Sunday, Russia said there had been a series of attacks in the border regions of Bryansk and Belgorod , damaging five train carriages and causing one injury.\nRussian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities. The head of Ukraine’s ground forces, said that Russian troops had begun a push to regain territory near Bakhmut .\nA Russian Defense Ministry spokesman said on Sunday that Russian forces over the previous day repelled five Ukrainian attacks near Klischiivka and Kurdyumivka, two small settlements lying south of Bakhmut.\nUpdated at 19.25 CET\n12 Nov 2023 16.16 CET In Kyiv, veterans and family of Ukrainian servicemen held a rally calling for legislation regulating the length of active military duty in Ukraine. View image in fullscreen Relatives of Ukrainian servicemen attend a protest calling for legislation regulating the length of active military duty and the frequency of frontline rotation in Kyiv, amid Russia's attack on Ukraine, November 12, 2023. Photograph: Thomas Peter/Reuters View image in fullscreen A child holds a placard during a protest by relatives of Ukrainian servicemen calling for legislation regulating the length of active military duty and the frequency of frontline rotation in Kyiv, amid Russia's attack on Ukraine, November 12, 2023. Photograph: Thomas Peter/Reuters View image in fullscreen A Ukrainian war veteran with the callsign Grizzly attends a protest calling for legislation regulating the length of active military duty and the frequency of frontline rotation in Kyiv, amid Russia's attack on Ukraine, November 12, 2023. Photograph: Thomas Peter/Reuters View image in fullscreen Relatives of Ukrainian servicemen attend a protest calling for legislation regulating the length of active military duty and the frequency of frontline rotation in Kyiv, amid Russia's attack on Ukraine, November 12, 2023. Photograph: Thomas Peter/Reuters\n12 Nov 2023 15.49 CET Local resistance kills three Russian guard officers in Melitopol Three Russian guard officers were killed in an explosion carried out by the local resistance in Russian-occupied Melitopol, Ukraine’s defence intelligence said today. #ГУРінформує\n✔️ У Мелітополі внаслідок вибуху в штабі окупантів знищено офіцерів рф\n💥 11 листопада 2023 року у тимчасово окупованому Мелітополі пролунав потужний вибух.\n🔗 https://t.co/c2lrvCdvQx pic.twitter.com/jpwuEdkstv — Defence intelligence of Ukraine (@DI_Ukraine) November 12, 2023 The explosion went off yesterday at the premises of the “new post office”, which the local Russian administration has turned into their headquarters. At the time, Russian federal security service and Russian guard officers were having a meeting. The Kremlin has not commented on the explosion as of yet.\nUpdated at 15.49 CET\n12 Nov 2023 15.20 CET Russian forces attacked the Kherson Oblast Regional Library overnight, causing significant damage to both the interior and exterior, said regional governor Oleksandr Prokudin. “A fire was raging,” Prokudin said on Telegram. “People who live nearby are horrified to talk about what they experienced.” This video shows the aftermath of the Kherson Oblast Regional Library, which was significantly damaged by Russian occupiers on the night of Nov. 12.\n📽️: Oleksandr Prokudin / Telegram pic.twitter.com/Q8rQGOBMAY — The Kyiv Independent (@KyivIndependent) November 12, 2023\n12 Nov 2023 14.55 CET Russian forces have increased the number of airstrikes in the east, said general Oleksandr Tarnavskyi, who leads Ukrainian troops fighting in and near Avdiivka in the Donetsk oblast. In particular, Russian forces have increased the use of guided air bombs, Tarnavskyi said.\n12 Nov 2023 14.30 CET Medvedev: Ukraine is not a country, Zelenskiy is a 'usurper' Dmitry Medvedev, Russia’s former leader, posted on Telegram today an apparent response to a proposal put forth by Anders Fogh Rasmussen, a former Nato secretary general, to have Ukraine join the alliance without its currently Russian-occupied territories. Medvedev, who now serves as deputy chair of Russia’s security council, purported that it was basically an acknowledgment then that Crimea and Donbas were no longer Ukraine. “Not bad, but it’s important to move on,” he said. “We must admit that Odessa, Nikolaev, Kyiv, and practically everything else is not Ukraine at all.” He claimed that there were three more steps “before admitting the obvious”: that Volodymyr Zelenskiy – “who does not go to the polls”, Medvedev said – is not the president but a usurper, the Ukrainian language is not a language and Ukraine is not a country “but artificially collected territories”. Therefore, Ukraine, even without the Russian-occupied territories, cannot be accepted into Nato as it is not a country, reasoned Medvedev. This inaccurate notion that Ukraine is not an independent country, but instead a historical part of Russia, has been repeated in the rhetoric of Russian leadership for some time now. Vladimir Putin said this at a Nato summit in 2008, and again in 2014 when justifying the illegal annexation of Crimea. “In general, like the Russian propagandists have duly noted recently, they have nothing to lose already so they can say whaterver they want,” said Anton Gerashchenko, adviser to Ukraine’s minister of internal affairs. Medvedev (whom Russian themselves call \"The Sarmat of thr Russian thought) has launched a new \"missile\" in his Telegram channel:\n\"We must admit that Odesa, Nikolaev, Kiev and practically everything else are not Ukraine at all.\nAfter that there are only three steps until the… https://t.co/VjLB36aBRJ — Anton Gerashchenko (@Gerashchenko_en) November 12, 2023\nUpdated at 15.38 CET\n12 Nov 2023 13.30 CET Kremlin press secretary: 'It is impossible to defeat Russia' Dmitry Peskov, press secretary for Vladimir Putin, said in a television interview that Kyiv needs to “understand that it is impossible to defeat Russia”. According to Peskov, the West is growing tired of the war in Ukraine and is reluctant to send aid in the form of money, weapons and munitions. But Kyiv is ready to dance for the West to beg for aid, Peskov said.\nUpdated at 13.30 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Wagner mercenaries likely serving in Russian national guard, says UK - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/12/russia-ukraine-war-live-nord-stream-pipeline-sabotage-germany-kyiv"}