{"authors": ["Vivian Ho", "Amy Sedghi"], "date_download": "2024-02-05 15:41:51", "date_modify": "None", "date_publish": "2023-11-12 18:50:04", "description": "Former Nato leader suggests Ukraine could join alliance without occupied Russian territories; senior Kyiv official played key role in sabotage of Nord Stream pipeline, media report says", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F12%2Frussia-ukraine-war-at-a-glance-what-we-know-on-day-627.json", "image_url": "https://i.guim.co.uk/img/media/6dfa6f0ec8d039da0c3fc86a59263c3836127064/0_0_4134_2480/master/4134.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6c729dbf5fde7a31bbd837538a8f4607", "language": "en", "localpath": null, "maintext": "Dmitry Medvedev, Russia’s former leader, posted on Telegram today an apparent response to a proposal put forth by Anders Fogh Rasmussen, a former Nato secretary general, to have Ukraine join the alliance without its currently Russian-occupied territories. Medvedev, who now serves as deputy chair of Russia’s security council, used Russia’s oft-touted and inaccurate rhetoric that Ukraine is not a country, and therefore cannot join Nato.\nThree Russian guard officers were killed in an explosion carried out by the local resistance in Russian-occupied Melitopol, Ukraine’s defence intelligence said today.\nIn Kyiv, veterans and family of Ukrainian servicemen held a rally calling for legislation regulating the length of active military duty in Ukraine.\nLarge elements of the Wagner mercenary group have likely been assimilated into the command structure of Russian national guard (Rosgvardiya), the UK defence ministry said in its daily intelligence briefing. The Wagner arm in the Rosgvardiya is likely being led by Pavel Prigozhin, son of the late Wagner leader Yevgeny Prigozhin, who was killed in a plane crash shortly after Wagner fighters captured the Russian city of Rostov-on-Don and marched on Moscow – acts that Vladimir Putin declared “treason”.\nA senior Ukrainian military official played a key role in the sabotage of the Nord Stream gas pipelines in the Baltic Sea last year, according to a joint investigation by the Washington Post and Der Spiegel published Saturday. Roman Chervinsky, a colonel in Ukraine’s Special Operations Forces, was the “coordinator” of the Nord Stream operation, people familiar with his role told the US and German newspapers.\nRussian investigators have determined that the freight train that was derailed yesterday in Russia’s Ryazan oblast was caused by a homemade bomb on the railway line. Authorities have opened a terrorism investigation into the derailment. While Kyiv has not yet commented on the incident, but Russian officials have previously blamed pro-Ukrainian saboteurs for several attacks on the country’s railway system.\nThree people were killed in Russian attacks on the Donetsk oblast overnight, acting regional governor Ihor Moroz said on Telegram. Two people were killed in Toretsk, wehre 30 houses, an infrastructure facility and an administrative building were damaged in Russian attacks. One person was killed in Minkivka.\nA 64-year-old man was killed and his wife hospitalised this morning after the Russian shelling of Dnipro district of the city of Kherson, according to regional governor Oleksandr Prokudin.\nParts of city of Donetsk have lost power after two projectile strikes in the north-western part of the city. It’s unclear if the strikes came from Ukrainian or Russian forces.\nRussia has accused Kyiv of attacks on border regions. On Sunday, Russia said there had been a series of attacks in the border regions of Bryansk and Belgorod, damaging five train carriages and causing one injury.\nRussian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key frontline cities. The head of Ukraine’s ground forces, said that Russian troops had begun a push to regain territory near Bakhmut.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war at a glance: what we know on day 627", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/12/russia-ukraine-war-at-a-glance-what-we-know-on-day-627"}