{"authors": ["Kelly Laco", "Executive Editor Of Politics For Dailymail.Com"], "date_download": "2024-02-05 15:41:52", "date_modify": "None", "date_publish": "2023-11-12 12:21:18", "description": "Attorney General Jason Miyares says 'moral leadership' is needed to counter the rise of antisemitism on college campuses.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12734639%2FVirginias-prosecutor-probing-donations-pro-Palestine-group-Hamas-ties-says-moral-leadership-needed-cut-rising-antisemitism-college-campuses.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/10/18/77660975-0-image-a-45_1699640107137.jpg", "language": "en", "localpath": null, "maintext": "Attorney General Jason Miyares says 'moral leadership' is needed to counter the rise of antisemitism on college campuses and is taking several actions to help Israel in the wake of terror group Hamas' bloody attack on October 7.\nMiyares opened an investigation into pro-Palestine charity American Muslims for Palestine based in Northern Virginia that allegedly has ties to Hamas.\nHe told DailyMail.com in an exclusive interview that the group is accused of flowing its charitable donations to terrorist groups, including Hamas in Gaza.\n'There's actually specific language in the Virginia code that specifically prohibits soliciting funds for charity and then have those funds go to any designated terrorist organization,' said Miyares.\n'And so we're looking at whether these allegations have any merit.'\nStudents for Justice in Palestine organized a rally on UVA's campus last month\nMiayres has also collected over 1,000 bulletproof vests, protective gear, and helmets from police around the commonwealth that have been sent to first responders and the Israeli Defense Forces (IDF).\n'We're really honored by the the outpouring and we thought it was great symbolism at a time after October 7 When we saw so much death, that we'd be able to band together and provide equipment that can save lives,' he told DailyMail.com.\nVirginia's top law enforcement official is facing the challenge of the growing rise of antisemitism on college campuses nationwide - including universities within the commonwealth.\nHe said the First Amendment is sacred in the United States, which allows people to express their 'reprehensible views,' but at a certain point it's up to leadership to step in.\n'The First Amendment is very broad, but I also think it's important to provide some some moral leadership as well.'\nLast month, about 200 students at the University of Virginia led a demonstration on campus in support of Palestine and expressed sympathies toward Hamas.\n'Free free Palestine, long live Palestine,' chants rang out across the university.\nOne student stated that 'Hamas is simply a political party that is acting in Gaza,' and 'all Palestinian resistance groups exist only because of Israeli occupation.'\n'Israel you can't hide you're committing genocide,' said another student, who condemned the U.S. for stepping in to aid Israel.\nMiyares told DailyMail.com that the pro-Hamas statements crossed the line.\nStudents for Justice in Palestine's peaceful protest brought 100 people to the UVA Rotunda\n'When you have people marching through a campus saying 'from the river to the sea, Palestine will be free,' what they're talking about is the extermination of 8 million Jews that currently live there, because that's what Hamas is about.'\n'Their charter says we value death more than we value life. And they do not believe in coexistence. They believe in extermination,' continued Miyares.\n'So I think it's important that more leaders point out where they are just flat out wrong in what they're advocating for. And the moral equivalency I think is one of the most troubling aspects that you're seeing on college campuses,' he continued.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "EXCLUSIVE: Virginia's top prosecutor probing donations to pro-Palestine group with Hamas ties says 'moral leadership' is needed to cut through rising antisemitism on college campuses", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12734639/Virginias-prosecutor-probing-donations-pro-Palestine-group-Hamas-ties-says-moral-leadership-needed-cut-rising-antisemitism-college-campuses.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}