{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:41:53", "date_modify": "None", "date_publish": "2023-11-12 05:06:18", "description": "Roman Chervinsky, a colonel in Ukraine's special operations forces, was behind the September 2022 explosion of the Nord Stream pipeline, sources told The Washington Post.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12739437%2FUkraine-DID-blow-20BILLION-Nord-Stream-pipeline-Veteran-special-forces-officer-coordinated-attack-sabotage-Russias-stranglehold-Europes-gas-supply-report-claims.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/12/05/77698525-0-image-a-54_1699765446300.jpg", "language": "en", "localpath": null, "maintext": "A Ukrainian special forces operative was behind the September 2022 attack on the Nord Stream pipeline, sources have claimed - sabotaging a major energy artery from Russia to the West.\nUkraine has always denied being behind the explosion of the pipeline, which sent gas bubbling up on the surface of the Baltic Sea and disrupted Russia's supply of energy to Germany.\nPresident Volodomyr Zelensky said his country was not behind the explosion.\n'Nothing of the sort has been done by Ukraine. I would never act that way,' Zelensky said.\nBlame was initially pinned on the US, Russia, the Ukrainian secret services and an unnamed businessman in Ukraine. All three countries have vehemently denied responsibility.\nThe strongest suspicion has long fallen on Ukraine, which would most benefit by cutting off Russia's valuable energy outlet, and on Saturday sources told The Washington Post that a decorated colonel in the special forces coordinated the attack.\nRoman Chervinsky, 48, is believed to have coordinated the operation to blow up the pipeline, sources have claimed\nSources told The Washington Post that a Ukrainian team was responsible for carrying out the mysterious Nord Stream pipeline blasts in September 2022\nThe blasts knocked out three of the four strands of the pipelines, essentially destroying the main energy link between Russia and the West\nRoman Chervinsky, 48, headed up a group which plotted to destroy the pipeline, the sources said.\nChervinsky organized logistics and support for a six-person team, which rented a sailboat under false identities and used deep-sea diving equipment to place explosive charges on the gas pipelines.\nChervinsky did not plan the operation, the sources said: he reported to senior Ukrainian officials, who ultimately reported to General Valery Zaluzhny, Ukraine's highest-ranking military officer.\nZelensky was deliberately kept out of the loop, according to a CIA report shared by Jack Teixeira, a member of the Massachusetts Air National Guard, on the Discord chat platform.\nTeixeira, 21, was arrested in April for leaking the material and faces trial for sharing national secrets.\nAccording to his document, the CIA reported: 'All of those involved in planning and execution reported directly to [chief of defense] Zaluzhny, so Zelensky wouldn't have known about it.'\nThe pipeline was blown up in September 2022, dramatically curtailing sale of Russian gas\nChervinsky is currently in jail in Kyiv, having been arrested in April this year and accused of abusing his power.\nHe attempted in July 2022 to lure a Russian pilot into defecting, and his actions allegedly gave away the coordinates of a Ukrainian airfield, prompting a Russian rocket attack that killed a soldier and injured 17 others.\nChervinsky denied being behind the pipeline sabotage, telling The Washington Post he was being smeared.\n'All speculations about my involvement in the attack on Nord Stream are being spread by Russian propaganda without any basis,' he said.\nChervinsky added: 'I have devoted my entire life to the defense of Ukraine.'\nGermany's Federal Office of Criminal Investigation (BKA) has been investigating the Andromeda - a yacht hired by a Polish company from the north German port of Rostock just weeks before the explosions were carried out.\nGerman investigators have now turned their attention to the Andromeda (pictured) - a yacht hire by a Polish company from the north German port of Rostock just weeks before the explosions were carried out\nThe yacht (pictured) was found with traces of 'military-grade and underwater-deployable' explosives\nAndromeda is said to have docked in the marina of Christianso, a tiny Danish island northeast of Bornholm and in close proximity to where the three bombs went off, in the days leading up to the sabotage.\nThe yacht was found with traces of 'military-grade and underwater-deployable' explosives.\nThe theory suggests that five men and a woman arrived in Germany using fake Bulgarian and Romanian passports before using the yacht as a base to deploy trained divers to plant the bombs around 70m below sea level.\nGerman investigators argue the attacks would have required aid from state security services and claim to have found evidence that could implicate Ukraine, according to the Süddeutsche Zeitung newspaper.\nThe complex trail is said to lead to a shell company, a travel bureau, which was created by two Ukrainians in Warsaw.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Ukraine DID blow up $20BILLION Nord Stream pipeline: Veteran special forces officer coordinated attack to sabotage Russia's stranglehold on Europe's gas supply, report claims", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12739437/Ukraine-DID-blow-20BILLION-Nord-Stream-pipeline-Veteran-special-forces-officer-coordinated-attack-sabotage-Russias-stranglehold-Europes-gas-supply-report-claims.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}