{"authors": ["Rachel Bowman", "Rachel Bowman For Dailymail.Com"], "date_download": "2024-02-05 15:41:54", "date_modify": "None", "date_publish": "2023-11-12 19:18:26", "description": "The MH-60 Black Hawk helicopter was on a refueling training mission when it crashed off the coast of Cyprus late Friday. Special forces are in the region amid the Israel-Hamas war.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12740531%2FMilitary-crash-plane-Mediterranean-Sea-victims.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/12/18/77711391-0-image-a-23_1699813851575.jpg", "language": "en", "localpath": null, "maintext": "The helicopter was from the Army's 160th Special Operations Aviation Regiment - the Night Stalkers - which ferries commandos on top secret raids\nFive US Army special forces troops have been killed in a helicopter crash in the Mediterranean Sea.\nThe MH-60 Black Hawk helicopter was on a refueling training mission when it crashed off the coast of Cyprus late Friday, officials told The New York Times.\nAn investigation has been launched but there is no indication of hostile activity.\nThe Pentagon has dispatched commando teams - including Delta Force and SEAL Team 6 - to the region to stand-by for hostage rescues in the Gaza Strip. Cyprus is around 150 miles from Israel.\nThe helicopter was from the Army's 160th Special Operations Aviation Regiment - the Night Stalkers - which ferries commando forces on secret raids.\nUnited States European Command (EUCOM) said in a statement: 'Out of respect for the affected families, and in accordance with Department of Defense policy, the identities of the crewmembers are being withheld until 24 hours after next of kin notifications have been completed.'\nThe helicopter was from the Army's 160th Special Operations Aviation Regiment - the Night Stalkers - which ferries commando forces on secret raids (file photo of a Blackhawk chopper)\nThe Pentagon has dispatched commando teams - including Delta Force and SEAL Team 6 - to the region to stand-by for hostage rescues in the Gaza Strip. Cyprus is around 150 miles from Israel\nJoe Biden said in a statement: 'Jill and I mourn the loss of five American service members who died when their aircraft crashed in the Mediterranean Sea during a training mission.\n'We are praying for the families and friends who lost a precious loved one — a piece of their soul. Our entire nation shares their grief.'\nSecretary of Defense Lloyd J. Austin said: 'While we continue to gather more information about this deadly crash, it is another stark reminder that the brave men and women who defend our great nation put their lives on the line each and every day to keep our country safe.\n'They represent the best of America. We will remember their service and their sacrifice.'\nHeadquartered in Stuttgart, Germany, EUCOM is comprised of 65,000 permanent military personnel responsible for US military operations across Europe, portions of Asia and the Middle East, the Arctic and the Atlantic Ocean.\nOn November 3, European Command announced three days of Naval exercises had taken place in the Mediterranean, where two carrier strike groups have been positioned since the start of the Israel-Hamas war.\nThe USS Gerald R. Ford and USS Dwight D. Eisenhower are currently in the region to warn Iran against getting involved in the current conflict.\nShips from the USS Gerald R. Ford and USS Dwight D. Eisenhower sail across the Mediterranean Sea on November 3\nJill and I mourn the loss of 5 American service members who died when their aircraft crashed in the Mediterranean Sea during a training mission. We are praying for the families and friends who lost a precious loved one — a piece of their soul. Our entire nation shares their… — President Biden (@POTUS) November 12, 2023\nPresident Joe Biden and Defense Secretary Lloyd J. Austin have put out statements on the crash\nEuropean Command said that 11,000 people participated in the exercises, and 'trained on high-value unit defense, ballistic missile defense, replenishments-at-sea, cross-deck flight operations, and maritime security operations.'\nIn August, three U.S. marines were killed and 20 others were injured in an aircraft training in Australia.\nTheir Boeing MV-22B Osprey tilt-rotor aircraft plunged to the ground and burst into flames on remote Melville Island.\nUS Marine Corps crew chief Corporal Spencer Collart, 21, pilot Captain Eleanor LeBeau, 29, and Major Tobin Lewis, 37, died in the crash.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Five US Army special forces troops are killed as MH-60 Black Hawk crashes into the Mediterranean Sea during 'refueling training mission'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12740531/Military-crash-plane-Mediterranean-Sea-victims.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}