{"authors": ["Katelyn Caralle", "U.S. Political Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:41:56", "date_modify": "None", "date_publish": "2023-11-12 16:51:34", "description": "Israel Prime Minister Benjamin Netanyahu says his Israeli Defense Forces will be able to swiftly defeat Hamas terrorists operating out of Gaza as he previews release of more hostages.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12740191%2FIsraeli-PM-Benjamin-Netanyahu-takes-dig-claims-forces-defeat-Hamas-quickly-America-destroyed-al-Qaeda-ISIS.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/12/16/77707887-0-image-m-13_1699807870520.jpg", "language": "en", "localpath": null, "maintext": "Benjamin Netanyahu says his Israeli Defense Forces will be able to swiftly defeat Hamas terrorists operating out of Gaza as he previews release of more hostages.\nThe Israeli prime minister took a dig at American efforts to take-out al-Qaeda and ISIS terrorist organizations, claiming Israel will act faster in defeating Hamas.\nIt comes as he dodged questions from CNN on whether he would take responsibility for not preventing the terrorist attacks on October 7. Many claim there was an intelligence failure on the part of Israel's government.\nThe conflict between Israel and Hamas has been ongoing for more than a month.\n'I don't think it's going to take the time that it took the United States and the international coalition to defeat ISIS or to defeat al-Qaeda. It took you many years. I don't think it's going to be many years,' Netanyahu told NBC News host Kristen Welker during a Sunday interview on Meet the Press.\nHe also claimed that there are negotiations for the release of more hostages from the Palestinian enclave of Gaza, where Hamas is the de facto government.\nIsraeli Prime Minister Benjamin Netanyahu said on Sunday that IDF is working toward a quick defeat of Hamas terrorists, and said it would be done more swiftly than the U.S. took out al-Qaeda and ISIS\nMeanwhile, National Security Adviser Jake Sullivan said during an interview on ABC This Week that the U.S. believes there should be 'no reoccupation of Gaza' after Hamas is defeated by Israel.\n'No reduction in the territory of Gaza. No forcible displacement of Palestinians,' he added.\nNetanyahu told NBC that he has set 'targets' for the road to defeating Hamas, but claimed he doesn't have a specific deadline in mind.\n'We're proceeding as quickly as we can but also as carefully as we can, because we want to minimize civilian casualties and we want to minimize casualties on our side while maximizing the, the casualties of the Hamas terrorists,' he added.\nIn the same interview, the Israel PM said that 'there could be' a deal on Gaza releasing more hostages held by Hamas terrorists – but he didn't want to say too much publicly.\n'The less I say about it, the more I've increased the chances that it materializes,' Netanyahu said.\n'Do you know where all of the hostages are being held right now, Mr. Prime Minister?' Welker asked Netanyahu.\nHe replied: 'We know a great deal, but I won't go beyond that.'\nNetanyahu previewed on Sunday that there might be a deal on the table for release of more hostages from the Hamas stronghold of war-torn Gaza (pictured on November 12)\nAsked in a separate interview on CNN's State of the Union Sunday program about taking responsibility for the failures that led to the October 7 attack, Netanyahu said there would be time for such 'difficult' questions once the war is over.\n'We're going to answer all these questions. Right now, I think what we have to do is unite the country for one purpose; to achieve victory,' he told CNN host Dana Bash.\n'Let's focus on victory – that's my responsibility now.'\nPressure has built on Netanyahu regarding the failure of Israel to anticipate and prepare for the deadliest attack in Israel's history.\nOn October 7, Hamas killed the most amount of Jewish people in a single day since the Holocaust.\nAround 1,400 Israelis were killed in the attacks and 200 were taken hostage.\nSullivan says there are still nine Americans missing, as well after 32 were killed in the terrorist attacks.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli PM Benjamin Netanyahu takes dig at US as he claims his forces will defeat Hamas more quickly than America destroyed al-Qaeda or ISIS", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12740191/Israeli-PM-Benjamin-Netanyahu-takes-dig-claims-forces-defeat-Hamas-quickly-America-destroyed-al-Qaeda-ISIS.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}