{"authors": [], "date_download": "2024-02-05 15:41:57", "date_modify": "None", "date_publish": "2023-11-12 11:08:48", "description": "As Israel unleashes one of the most-intense aerial bombing campaigns the Middle East has ever seen, leaders from the world’s top air forces are meeting in the United Arab Emirates to talk about almost anything that isn’t an airstrike", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisraeli-ap-hamas-gaza-strip-dubai-b2445923.html.json", "image_url": "https://static.independent.co.uk/2023/11/12/11/Dubai_Air_Show_48730.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAs Israel unleashes one of the most-intense aerial bombing campaigns the Middle East has ever seen, leaders from the world's top air forces met Sunday in the United Arab Emirates to talk about almost anything that wasn't an airstrike.\nThe discussions at the Dubai International Air Chiefs’ Conference, held ahead of the biennial Dubai Air Show this week, shows the delicate balancing act the federation of seven sheikhdoms faces. The UAE maintains diplomatic ties with Israel despite widespread and growing anger in the Arab world over the civilian casualties from Israel's offensive in the Gaza Strip against Hamas.\nThe Air Chiefs' Conference demonstrates how those ties continue, particularly as Rafael Advanced Defense Systems Ltd., an Israeli defense manufacturer, was a sponsor of the summit. And while the Dubai Air Show focuses primarily on commercial aircraft in a region crucial to East-West travel, there's a military component of the event as well.\nListed among the show's exhibitors are both Rafael and Israel Aerospace Industries, which makes radars for its anti-missile systems and combat drones for the Israeli military.\n“IAI stands shoulder to shoulder with the (Israeli military) to fully support all efforts, with fully operational systems,” the company said in an online message. “We have a national duty and a profound responsibility to support the ... Israeli defense community, while continuing to deliver top-quality service and supplies to our partners worldwide.”\nThe Israel-Hamas war began Oct. 7, when militants stormed into Israel, killing some 1,200 people and taking over 200 others back to the Gaza Strip as hostages. In the time since, the intense Israeli airstrikes on the Gaza Strip, followed up by a ground campaign with street-to-street combat still going on, have killed more than 11,000 Palestinians, two-thirds of them women and minors, according to the Hamas-overseen Health Ministry there.\nFor the arms industry, the Gulf Arab states long have been major clients. The nations, led by Saudi Arabia and the United Arab Emirates, have spent billions of dollars on both sophisticated fighter jets and missile defense systems as tensions with Iran have risen and ebbed over the decades.\nIn the past 10 years alone, Saudi Arabia has spent more than $28 billion on weapons imports, the second-highest in the world behind only India, according to the Stockholm International Peace Research Institute. Qatar has spent more than $11 billion while the UAE has spent over $10 billion as the sixth- and seventh-largest importers in the world respectively, SIPRI data shows.\nThose systems have seen action with the Saudi-led war on Yemen's Iranian-backed Houthi rebels, a war that continues to grind on despite efforts to reach a peace deal. That coalition faced international criticism for airstrikes targeting schools and markets, killing civilians. Meanwhile, Houthi missile-and-drone attacks have reached deep into both Saudi Arabia and the UAE, at one point seeing U.S. forces based in the country fire their air-defense systems to defend Abu Dhabi in 2022.\nThe collapse of Iran's nuclear deal with world powers also saw an escalation in attacks attributed to Tehran as it now enriches uranium closer than ever to weapons-grade levels. And Israel's war on Hamas, which has seen punishing airstrikes level city blocks in the Gaza Strip, also has raised concerns of a regional war breaking out.\nSunday's summit drew attendees from across the world, though it did not appear there were any Israeli military officials on hand. Most attendees came from Western nations, though there was a large contingent from China as well.\nWhile staying away from discussing the Israel-Hamas war, U.S. Air Force Brig. Gen. David A. Mineau did mention the challenges facing the region, including sharing intelligence across nations allied with America. A yearslong boycott of Qatar by nations including Saudi Arabia and the UAE only ended in 2021 after apparently nearly escalating into an armed conflict itself. Qatar, a major non-NATO ally of the U.S., hosts the forward headquarters of the American military's Central Command.\n“The more things change, the more they stay the same because we're still working through some of the same problem sets,” Mineau told the summit. “Some specific things we're still trying to solve ... (are) a shared, common operating picture and shared threat warning.”\nAfter his remarks on stage, Mineau told journalists that “they don't want want us going on record with anything here.” He declined to elaborate.\nEarlier, Italian Air Force Chief of Staff Lt. Gen. Luca Goretti had referenced the Russian war on Ukraine as a sign that air forces must share information to be able to fight.\n“We need to share, in order to protect our freedom, in order to protect our life,\" Goretti said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Dubai air chiefs summit, sponsored by Israeli firm, avoids discussing strikes as Hamas war rages", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israeli-ap-hamas-gaza-strip-dubai-b2445923.html"}