{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:16:29", "date_modify": "None", "date_publish": "2024-01-22 15:57:15", "description": "Protesters call for Israeli government to do more to secure release of loved ones, as south of Gaza sees worst violence since war began", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F22%2Ffamilies-israeli-hostages-storm-knesset-meeting-netanyahu-rejects-hamas-offer-fighting-gaza.json", "image_url": "https://i.guim.co.uk/img/media/b14c77e2278cc44f3e579af5280bfdf9353296b5/0_198_2970_1782/master/2970.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=392af5a3ffbba780c5196f4ad149b043", "language": "en", "localpath": null, "maintext": "Family members of Israelis held hostage in the Gaza Strip have stormed a parliamentary meeting in Jerusalem to demand that Israel’s government does more to return their loved ones, as fighting in Khan Younis reached unprecedented levels.\nAbout 20 relatives of people seized as captives by the Palestinian militant group in the 7 October attack disrupted a Knesset finance committee meeting on Monday, chanting: “Release them now, now, now!”\nOne woman, who has three family members taken by Hamas, cried: “Just one I’d like to get back alive, one out of three.” Other protesters held up signs reading: “You will not sit here while they die there.”\nOn Sunday, the Israeli prime minister, Benjamin Netanyahu, rejected new Hamas conditions for ending the war and releasing the hostages including the Islamist group retaining control of Gaza and Israel withdrawing completely. In response, a Hamas official in Qatar said Netanyahu’s refusal to end the military offensive in Gaza meant there was “no chance for the return of the captives”.\nA total of 110 Israelis and other nationals were released in return for 240 Palestinian women and children held in Israeli prisons as part of a week-long truce at the end of November. Several attempts at a ceasefire since have failed.\nView image in fullscreen Protesters on the streets in Jerusalem on Sunday, as families of hostages and supporters called for the immediate release of hostages still in Gaza. Photograph: Ronen Zvulun/Reuters\nThe families of the remaining 130 hostages, worried that their relatives’ plight now comes second to Israel’s objective of destroying Hamas, appear to be turning to more drastic measures in pursuit of another release deal, including further demonstrations outside Netanyahu’s private home.\nAn admission from the Israel Defense Forces last week that three hostages, whose bodies were recovered in the Jabaliya area in December, may have been killed by an airstrike on a Hamas tunnel, has also stoked relatives’ fears. At least 27 hostages are believed to have died in Gaza, including three men who were shot and killed by Israeli soldiers after escaping captivity and approaching the troops for help.\nIn a meeting with 15 of the hostage families after the Knesset protest on Monday, Netanyahu’s office said that contrary to reports of growing consensus on a ceasefire agreement, there was “no real proposal from Hamas”.\nIn a statement, an official said: “I say this as clearly as I can, because there are so many untrue [reports] that are surely torturing you. On the other hand, there is our initiative, which I will not detail.”\nView image in fullscreen A wounded child is taken to the Nasser hospital in Khan Younis, Gaza, on Monday. Photograph: Mohammed Dahman/AP\nIn Gaza, Israel’s nearly four-month-old offensive has accelerated during the past week in Khan Younis, southern Gaza’s largest city, in what Israeli officials have described as the last large-scale ground assault before a shift to lower-intensity, more targeted operations to eradicate Hamas, as demanded by US allies.\nGround manoeuvres in the south and west of the city began in earnest overnight, with local authorities reporting that approximately 50 people were killed and 100 others wounded in airstrikes and shelling. More casualties are believed to be trapped beneath the rubble.\nView image in fullscreen Smoke rises during Israeli ground operations in Khan Younis on Monday. Photograph: Ibraheem Abu Mustafa/Reuters\nIsraeli tanks reached the gates of two Khan Younis hospitals on Monday, residents in the area said, in the bloodiest fighting of 2024 to date and the worst violence in the south of Gaza since the war began on 7 October, when Hamas killed 1,200 people in its attack on southern Israel.\nMore than 25,200 people in Gaza have now been killed in the fighting, the majority women and children, the health ministry in the Hamas-run territory says.\nThe Palestinian Red Crescent Society said on Monday it had lost all contact with its staff at Khan Younis’s al-Amal hospital, adding that tanks had surrounded both al-Khair hospital and the nearby al-Aqsa University, where thousands of displaced people were sheltering.\nView image in fullscreen A woman grieves as people bury the bodies of Palestinians killed in Khan Younis. Photograph: Ahmed Zakot/Reuters\n“It’s very difficult to leave the [hospital] complex and go to any cemetery and bury bodies because we’re under siege and anyone who leaves the complex is targeted,” Abdelkarim Ahmad, who was helping burying the dead, told Reuters.\nAt Nasser hospital, the only big hospital still accessible in Khan Younis and the largest still functioning in Gaza, witnesses said the trauma ward was overwhelmed with wounded being treated on the floor and in hallways.\nThe majority of Gaza’s 2.3 million residents are now penned into two towns: Deir al-Balah, north of Khan Younis, and Rafah, on the border with Egypt. Most are crammed into public buildings and vast camps of makeshift tents as disease and hunger stalk the trapped population.\nIsraeli plans for the two areas remain unclear, but Israel has said it will not stop fighting until Hamas is completely eradicated, a goal analysts say is unrealistic given the group’s deep-rooted presence in Gaza and elsewhere.\nIsrael blames the offensive’s high civilian death toll on Hamas, which it says uses the population as human shields. Hamas denies the allegation.\nRising tensions and violence across the Middle East sparked by the war in Gaza have stoked fears of a wider conflagration involving Iranian-backed groups in Lebanon, Iraq, Syria and Yemen, as well as the occupied West Bank and East Jerusalem.\nThe biggest fear is of a new conflict with the Lebanese group Hezbollah on Israel’s northern border, where clashes that began in October have intensified in recent weeks.\nNetanyahu has also been criticised for reiterating his opposition to an independent Palestinian state, a stance at odds with the US, Israel’s most important ally. Joe Biden has expended vast amounts of international and domestic political capital in defending Israel’s war effort, despite a growing global outcry over the conflict’s devastating humanitarian toll.\nSupport for the war remains high among Israelis, but opinion polls show lagging support for Netanyahu and his far-right coalition. Weekly Saturday night rallies demanding the release of hostages have been supplemented in recent weeks by growing calls for elections.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli hostages’ families storm Knesset meeting to demand their return", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/22/families-israeli-hostages-storm-knesset-meeting-netanyahu-rejects-hamas-offer-fighting-gaza"}