{"authors": [], "date_download": "2024-02-05 15:42:01", "date_modify": "None", "date_publish": "2023-11-12 12:26:39", "description": "Ukraine says Russian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-bakhmut-kyiv-russia-moscow-b2445954.html.json", "image_url": "https://static.independent.co.uk/2023/11/12/12/Russia_Ukraine_War_99777.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussian forces have ramped up attacks in eastern Ukraine in an attempt to gain ground near two key front line cities, Ukrainian military officials said Sunday.\nMoscow's troops have begun a push to regain territory near Bakhmut, the eastern mining city that was the site of the war’s bloodiest battle before falling into Russian hands in May, the head of Ukraine’s ground forces wrote on the Telegram messaging app.\nUkrainian troops had recaptured the heights over Bakhmut and made some advances to the city’s west, north and south since Kyiv launched its summer counteroffensive.\n“Toward Bakhmut, the Russians have become more active and are trying to recapture previously lost positions. ... Enemy attacks are being repelled,” Col. Gen. Oleksandr Syrskyi wrote in a Telegram update on Sunday afternoon.\nUkraine's long-awaited counteroffensive has so far resulted in only incremental gains and heavy losses, with Ukrainian troops struggling to punch through Russian lines in the south. Meanwhile, Moscow's forces have attempted to press forward in the northeast, likely with a view to distract Kyiv and minimize the number of troops it is able to send to key southern and eastern battles.\nThe Ukrainian ground forces’ spokesperson similarly reported that Russian troops had “switched from defense to active defense” near Bakhmut, “putting pressure” on Ukrainian troops south of the city. Vladimir Fityo made the remarks on Ukrainian TV, adding that Russian troops were searching for weak points in Ukrainian defenses and ramping up artillery strikes on Ukrainian positions.\nUkraine’s General Staff said that Russian troops were also continuing their weekslong push to encircle Avdiivka, an Ukrainian stronghold south of Bakhmut and a key target since the beginning of the war. It's considered the gateway to parts of the eastern Donetsk region under Kyiv's control. The General Staff said the air force was playing a key part in the latest Russian assault.\nGen. Oleksandr Tarnavskyi, who leads Ukrainian troops fighting in and near Avdiivka, said Sunday that the attacking Russian forces were ramping up airstrikes, particularly those using guided bombs. He wrote on Telegram that Russian troops over the previous day had launched 30 airstrikes and 712 artillery barrages at the city and surrounding areas, and clashed almost 50 times with Ukrainian units.\nIn the southern Ukrainian city of Kherson, a 64-year-old man was killed when Russian shells slammed into his yard, Ukrainian regional Gov. Oleksandr Prokudin said. Prokudin added that the man’s wife was hospitalized with a skull injury, concussion and shrapnel wounds to her legs.\nProkudin said that Russian forces shelled Kherson and the surrounding region 62 times over the previous 24 hours, wounding four civilians and damaging one of the city’s libraries. The city has come under near-daily attacks since Ukraine recaptured it a year ago.\n___\nFollow the AP’s coverage of the war at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia ramps up attacks on key cities in eastern Ukraine", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-bakhmut-kyiv-russia-moscow-b2445954.html"}