{"authors": ["Matt Jackson"], "date_download": "2024-02-05 15:42:07", "date_modify": "None", "date_publish": "2023-11-11 01:46:00", "description": "Israel continued its ground operations against Hamas on Friday night", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1833876%2FIsrael-surrounds-gaza-hospital.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5060562.jpg", "language": "en", "localpath": null, "maintext": "Palestinians are now sheltering in Al-Shifa\nShelling, gunshots and explosions could be heard as Israeli troops surrounded one of Gaza's largest hospitals. Social media videos emerged showing people running for cover outside the Rantisi children's hospital in Gaza on Friday. Israel has insisted Hamas fighters hide in tunnels under hospitals in Gaza. However, the Red Cross has now warned hospitals in the region had reached \"a point of no return,\" reports the BBC. The charity says staff in the Strip had witnessed \"horredous scenes\" while trying to deliver medication. The Hamas-controlled Gaza Health Ministry now claims 11,078 people have been killed since the start of the war and more than 27,000 others have been injured.\nPeople are sheltering at the Al-Shifa hospital\nIsrael's offensive in Gaza was launched after Hamas launched a surprise attack on October 7. It is thought 1,200 people died during the surprise attack - lower than the previous 1,400 reported. Reports that Israeli forces in Gaza were surrounding several hospitals in Gaza City first emerged on Friday morning. One person inside the Al-Quds hospital told the BBC that they could hear \"continuous clashes and explosions\". Eyewitnesses outside the Al-Rantisi Paediatric Hospital said that Israeli troops were using megaphones to order anyone who was not medical staff or patients to leave the premises. Meanwhile thousands are said to have sought shelter in the Al-Shifa hospital. Dr Ashraf al-Qudra, a spokesman for the ministry in Gaza, said that up to five Israeli strikes had damaged parts of Al-Shifa hospital, including the maternity ward.\nInside a Gaza hospital\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Shelling, gunshots and explosions as Israel surrounds Gaza hospital", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1833876/Israel-surrounds-gaza-hospital"}