{"authors": ["Perkin Amalaraj"], "date_download": "2024-02-05 15:42:08", "date_modify": "None", "date_publish": "2023-11-11 23:28:57", "description": "The hospital has been forced to suspend operations after running out of fuel, according to the Hamas-run health ministry in Gaza, which has led to two newborn children dying", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12738857%2FAs-fighting-rages-Israel-says-ready-evacuate-babies-Gazas-main-hospital.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/12/09/77702085-0-image-a-8_1699781425023.jpg", "language": "en", "localpath": null, "maintext": "Israel's military said it was ready to evacuate babies from Gaza's largest hospital on Sunday, where Palestinian officials said two newborns died and dozens more were at risk after fuel ran out amid intense fighting across the enclave.\nThe IDF's chief military spokesperson, Rear Admiral Daniel Hagari, said the Israeli military would help evacuate babies from Al Shifa hospital, at the request of the staff.\nThe hospital has been forced to suspend operations after running out of fuel, according to the Hamas-run health ministry in Gaza, which has led to two newborn children, out of the 45 being treated there, dying.\nOn top of this, the roughly 500 people who have been forced to remain have been continuously bombarded for the past 24 hours, according to a senior doctor at the hospital.\nMuhammad Abu Salmiya, the hospital's director, told Al Jazeera, that protecting patients was the priority.\n'We contacted the Red Cross and informed them we ran out of water, oxygen, fuel, and everything,' Abu Salmiya said.\nMuhammad Abu Salmiya, the director of Al Shifa hospital, said that newborn babies were dying after the hospital suspended operations\nThe hospital has been forced to suspend operations after running out of fuel, according to the Hamas-run health ministry in Gaza, which has led to two newborn children dying\nIsrael's military confirmed clashes outside the hospital, but IDF spokesperson Daniel Hagari denied Al-Shifa Hospital (pictured) was under siege\nREAD MORE: Gaza hospitals are under constant fire and running out of power as one baby dies and dozens more are at risk while fighting rages between Israel and Hamas terrorists Advertisement\n'The premature babies, patients of the intensive care, and even wounded people couldn't survive with the lack of electricity.\n'If the occupation forces want to evacuate the wounded people to any place in the world that is safer than the Gaza Strip, we are not against that.'\nHe said that the hospital being forced to suspend operations after running out of fuel had deadly consequences\n'Medical devices stopped. Patients, especially those in intensive care, started to die,' he said by phone, with gunfire and explosions in the background.\nHe accused Israeli troops of 'shooting at anyone outside or inside the hospital' and had prevented movement between buildings.\nIsrael's military confirmed clashes outside the hospital, but Rear Admiral Daniel Hagari denied Al-Shifa was under siege.\nAhmed al-Mokhallalati, a senior plastic surgeon at Al Shifa, told Reuters: 'It's totally a war zone. It's a totally scary atmosphere here in the hospital.'\nThe Hamas-run health ministry says that 45 babies are currently being treated at Al Shifa\nAl Shifa is said to be treating around 500 people, despite running out of fuel this weekend\nPalestinian officials said on Friday that 11,078 Gaza residents had been killed in air and artillery strikes\nRoughly 40% of the Palestinians killed by Israeli airstrikes and missiles have been children, according to Palestinian officials\nThe Hamas-run health ministry accused Israel of deliberately targeting the hospital with airstrikes\nThe Hamas-run health ministry accused Israel of deliberately targeting the hospital with airstrikes, and claimed that Israeli snipers would regularly take shots at the medical complex, limiting doctors' and patients' abilities to move freely.\nIsrael has said doctors, patients and thousands of evacuees who have taken refuge at hospitals in northern Gaza must leave so it can tackle Hamas gunmen who it says have placed command centres under and around them.\nHamas denies using hospitals this way. Medical staff say patients could die if they are moved and Palestinian officials say Israeli fire makes it dangerous for others to leave.\nIsraeli Agriculture Minister Avi Dichter called the evacuations 'Gaza's Nakba', a reference to mass dispossessions of Palestinians after Israel was founded in 1948.\n'Operationally there's no way to conduct a war the way the IDF wants to conduct it inside Gaza territories,' Dichter said. 'I don't know how it will end.'\nIsrael's prime minister Benjamin Netanyahu insisted yesterday that there will be no ceasefire with Hamas until all hostages are returned.\nDiscussing the war at a news conference from Tel Aviv on Saturday, Netanyahu said Israel 'will not stop until we complete our mission' and that its only goal is to win (File Photo)\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 11, 2023, shows smoke rising over buildings during an Israeli strike on the Palestinian enclave\nThis image grab from a handout video released by the Israeli army on November 11, 2023, shows Israeli armoured vehicles rolling inside the Gaza Strip\nIsraeli soldiers operate inside the Gaza Strip, according to the Israeli Defense Forces (IDF), in this handout picture obtained by Reuters on November 11, 2023\nDiscussing the war at a news conference from Tel Aviv on Saturday, Netanyahu said Israel 'will not stop until we complete our mission' and that its only goal is to win.\nHe said Hamas has 'lost its grip' on Gaza and there is now 'no place to hide'.\nIsrael's three major TV news channels, without citing named sources, said there was some progress toward a deal to free hostages held by Hamas in Gaza.\nNetanyahu said he would not discuss details of any possible deal, which according to N12 News would involve 50 to 100 women, children and elderly being released in stages during a three to five day pause in fighting.\nAccording to the reports, Israel would release women and minor Palestinian prisoners and consider letting fuel in to Gaza, while reserving the right to resume fighting.\nPalestinians arrive in Khan Yunis in the southern Gaza Strip on November 11, 2023, after fleeing their homes in Gaza City\nPalestinians including injured people leave their homes to escape Israel's bombardments to reach southern part of the city in Gaza City, Gaza on November 11, 2023\nPeople mourn as they collect the bodies of Palestinians killed in Israeli raids on November 11, 2023 in Khan Yunis, Gaza\nThe war between Israel and Hamas, the bloodiest between the two in decades, began on October 7 after Hamas launched a massive incursion into Israel, taking the world by surprise.\nIsrael said rockets were still being fired from Gaza into southern Israel, where it has said about 1,200 people were killed and more than 200 taken hostage by Hamas last month.\nPalestinian officials said on Friday that 11,078 Gaza residents had been killed in air and artillery strikes since October 7, around 40% of them being children.\nNetanyahu said he still has daily contact with US President Joe Biden, and also has the 'political and ethical support' of the American administration.\nBut the Arab and Muslim world, meeting in Saudi Arabia over the weekend, called for an immediate end to military operations in Gaza, rejecting Israel's justification of self-defence.\nA communique issued at the summit urged the International Criminal Court to investigate 'war crimes and crimes against humanity that Israel is committing.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel offers to evacuate babies from crippled Gaza...", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12738857/As-fighting-rages-Israel-says-ready-evacuate-babies-Gazas-main-hospital.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}