{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com"], "date_download": "2024-02-05 15:42:10", "date_modify": "None", "date_publish": "2023-11-11 20:20:36", "description": "A Pentagon official told DailyMail.com that on Saturday morning, 'multiple one-way drones' were launched against US and coalition forces stationed at Rumalyn Landing Zone in Syria.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12738209%2FDrone-Syria-Rumalyn-Iran-Israel-Hamas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/11/20/77687907-0-image-a-17_1699733759718.jpg", "language": "en", "localpath": null, "maintext": "Armed suicide drones have targeted US forces in Syria, in the latest sign that Iranian-backed militias in the region could try to widen the Israel-Hamas war by striking American troops.\nA Pentagon official told DailyMail.com that 'multiple one-way drones' were launched on Saturday morning against US and coalition forces stationed at Rumalyn Landing Zone in northern Syria.\nOne drone was shot down before reaching its target, and the other impacted the Rumalyn facility, but did not detonate, the official said. There were no injuries or damage to infrastructure.\nSince October 17, there have been at least 48 similar drone or missile attacks targeting US and coalition forces in Iraq and Syria, according to Fox News, which first reported the attack at Rumalyn.\nIn retaliation for the escalating attacks, the US on Wednesday carried out a retaliation airstrike on a weapons warehouse in eastern Syria, allegedly used by Iranian forces and their proxy militias.\nSuicide drones have targeted US forces in Syria on Saturday. There have been at least 48 such drone and missile attacks in Syria and Iraq since October 17\nThe source of the drone strikes against US forces in Syria on Saturday was not immediately clear, but similar strikes in recent week have been attributed to Iran-backed militants operating under the umbrella of the Islamic Resistance in Iraq.\nFor years, Iran has supplied its Qasef-1 drones and other UAV munitions to its proxies in the region, including militant groups in Syria, Lebanon, Iraq, Yemen, and Gaza.\nRumalyn Landing Zone was also targeted by a 107mm rocket attack on October 8, one day after Hamas launched its sneak attack on Israel that left 1,400 dead, most of them civilians.\nIsrael has responded to the Hamas attack by pummeling the Gaza strip with airstrikes, and launching a ground assault on the Palestinian enclave in an attempt to remove Hamas from power there.\nGaza's Hamas-controlled health ministry, which does not differentiate between combatant and civilian casualties, says more than 11,000 Palestinians have died in the war.\nHamas is armed and financed by Iran, and Washington has also blamed Iran-backed militias for dozens of attacks on American troops in the region in recent months.\nIran-backed forces established a foothold in Syria while fighting in support of President Bashar al-Assad during Syria's civil war.\nFor years, Iran has supplied its Qasef-1 drones (above in a file photo) and other UAV munitions to its proxies in the region, including militant groups in Syria, Lebanon, Iraq, Yemen, and Gaza\nUS soldiers with the 1st Armored Division are seen operating in Syria in 2020. There are about 900 US troops in Syria today, most of them in the east\nIn Wednesday's retaliation strike in Syria, two US F-15 fighter jets dropped multiple bombs on a weapons storage facility near Maysulun in Deir el-Zour that was known to be used by Iran's Revolutionary Guard, US officials said.\n'The President has no higher priority than the safety of US personnel, and he directed today´s action to make clear that the United States will defend itself, its personnel, and its interests,' Defense Secretary Lloyd Austin said in a statement.\nA US military official told reporters in a call that people were seen at the warehouse during the day as the US military watched the site for hours, but the number decreased to about 'a couple' overnight when the strike occurred, according to the Associated Press.\nThe official said the strike triggered secondary explosions, indicating the presences of weapons, but the US believes that no civilians were killed and any people at the warehouse were tied to the Revolutionary Guard or Syria-based militia groups.\nA second senior defense official said the strike was aimed at 'disrupting and degrading the capabilities of groups directly responsible for attacking U.S. forces in the region' by specifically targeting facilities associated with the Revolutionary Guard.\nIranian President Ebrahim Raisi (center) and Syrian President Bashar Al-Assad (right) are seen Saturday during a bilateral meeting in Riyadh, Saudi Arabia. Iran-backed forces established a foothold in Syria while fighting in support of Assad during the country's civil war\nIn Wednesday's retaliation strike (above) in Syria, two US F-15 fighter jets dropped multiple bombs on a weapons storage facility near Maysulun in Deir el-Zour\nThe precision strike, said the defense official, was deliberate and designed not to escalate the conflict in the region.\nThe military official said a deconfliction phone line linking US military personnel to Russian forces in Syria was used to let them know about the attack.\nUS forces first deployed into Syria during the Obama administration's campaign against Islamic State, partnering with a Kurdish-led group called the Syrian Democratic Forces.\nThere are about 900 US troops in Syria today, most of them in the east.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Suicide drones attack US forces in northern Syria as fears grow Iran-backed militias seek to widen Israel-Hamas war into regional conflict", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12738209/Drone-Syria-Rumalyn-Iran-Israel-Hamas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}