{"authors": ["James Callery"], "date_download": "2024-02-05 15:42:11", "date_modify": "None", "date_publish": "2023-11-11 20:16:08", "description": "Discussing the war at a news conference from Tel Aviv, Netanyahu said Israel 'will not stop until we complete our mission' and that its only goal is to win.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12738355%2FIsraeli-Prime-Minister-Benjamin-Netanyahu-insists-no-ceasefire-war-against-Hamas-hostages-returned.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/11/20/77689115-0-image-m-32_1699734197330.jpg", "language": "en", "localpath": null, "maintext": "Israel's Prime Minister Benjamin Netanyahu has insisted that there will be no ceasefire in the war against Hamas until all of the hostages are returned.\nHamas's deadly assault on October 7 saw around 240 taken captive and at least 1,200 Israelis have been killed.\nDiscussing the war at a news conference in Tel Aviv on Saturday, Netanyahu said Israel 'will not stop until we complete our mission' and that its only goal is to win.\nHe said Hamas has 'lost its grip' on Gaza and there is now 'no place to hide'.\nNetanyahu said he still has daily contact with US President Joe Biden, and also has the 'political and ethical support' of the American administration.\nDiscussing the war at a news conference from Tel Aviv on Saturday, Netanyahu said Israel 'will not stop until we complete our mission' and that its only goal is to win (File Photo)\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 11, 2023, shows smoke rising over buildings during an Israeli strike on the Palestinian enclave\nSeveral world leaders have come to visit Israel to show support but there are 'minorities that pressure the governments', he said.\nHe urged the government to 'not succumb to this pressure' and said 'our war is their war'.\n'No international pressure, no false accusations... will deviate us from our cause,' he said.\nRejecting calls for a ceasefire, he said: 'If you want peace, we have to eliminate Hamas.'\nThe Israeli leader insisted that after the war, now entering its sixth week, Gaza would be demilitarised and Israel would retain security control there.\nThe position appears to run counter to post-war scenarios floated by Israel's closest ally, the United States, which has said it opposes an Israeli reoccupation of the territory.\nAsked what he meant by security control, Netanyahu said Israeli forces must be able to enter Gaza when necessary to hunt down terrorists.\nHe also said his country is 'fully prepared' on its northern front.\nIsrael has been exchanging fire with Lebanese militant group Hezbollah on the northern border.\nNetanyahu said he had warned Hezbollah that entering war with Israel would be a 'fatal mistake' that would 'determine the fate of Lebanon'.\nPeople mourn as they collect the bodies of Palestinians killed in Israeli raids on November 11, 2023 in Khan Yunis, Gaza\nOn Saturday, pressure was growing on Israel after frantic doctors at Gaza's largest hospital said the last generator had run out of fuel, causing the death of a premature baby, another child in an incubator and four other patients.\nThousands of war-wounded, medical staff and displaced civilians were caught in the conflict.\nIn recent days, fighting near Al-Shifa and other hospitals in northern Gaza has intensified and supplies have run out.\nThe Israeli military has alleged that Hamas has established command posts in and underneath hospitals, using civilians as human shields.\nREAD MORE: Gaza hospitals are under constant fire and running out of power as one baby dies and dozens more are at risk while fighting rages between Israel and Hamas terrorists Advertisement\nMedical staff at Al-Shifa have denied such claims and accused Israel of harming civilians with indiscriminate attacks.\nAl-Shifa hospital director Mohammed Abu Selmia said the facility lost power on Saturday.\n'Medical devices stopped. Patients, especially those in intensive care, started to die,' he said by phone, with gunfire and explosions in the background.\nHe said Israeli troops were 'shooting at anyone outside or inside the hospital' and had prevented movement between buildings.\nIsrael's military confirmed clashes outside the hospital, but Rear Admiral Daniel Hagari denied Al-Shifa was under siege.\nHe said troops will provide assistance on Sunday in moving babies treated there and said 'we are speaking directly and regularly' with hospital staff.\nAmos Yadlin, a former head of Israeli military intelligence, told broadcaster Channel 12 that as Israel aims to crush Hamas, taking control of the hospitals would be key but require 'a lot of tactical creativity,' without hurting patients, other civilians and Israeli hostages.\nSix patients died at Al-Shifa after the generator shut down, including the two children, spokesmen with the Hamas-run Health Ministry said.\nThe 'unbearably desperate situation' at Al-Shifa must stop now, the International Committee of the Red Cross director general, Robert Mardini, said on social media.\n'Shelling and explosions never stopped,' said Islam Mattar, one of thousands sheltering at Al-Shifa. 'Children here are terrified from the constant sound of explosions and the scenes they are watching.'\nThe Health Ministry told Al Jazeera there are still 1,500 patients at Al-Shifa, along with 1,500 medical personnel and between 15,000 and 20,000 people seeking shelter.\nPatients and internally displaced people are pictured at Al-Shifa hospital in Gaza City on November 10, 2023\nThousands have fled Al-Shifa and other hospitals that have come under attack, but physicians said it's impossible for everyone to get out.\n'We cannot evacuate ourselves and (leave) these people inside,' a Doctors Without Borders surgeon at Al-Shifa, Mohammed Obeid, was quoted as saying by the organisation.\nUN humanitarian chief Martin Griffiths posted that 'there can be no justification for acts of war in health care facilities, leaving them with no power, food or water'.\nElsewhere, the Palestinian Red Crescent said Israeli tanks were 20 metres (65 feet) from al-Quds hospital in Gaza City's Tal al-Hawa neighbourhood, causing 'a state of extreme panic and fear' among the 14,000 displaced people sheltering there.\nIsrael's military released footage that it said showed tanks operating in Gaza. The footage showed shattered buildings, some on fire, and rubble-filled streets empty of anyone but troops.\nA 57-nation gathering of Muslim and Arab leaders in Saudi Arabia called in their communique for an end to the war in Gaza and the immediate delivery of humanitarian aid.\nThey also called on the International Court of Justice, a UN organ, to open an investigation into Israel's attacks, saying the war 'cannot be called self-defence and cannot be justified under any means'.\nNetanyahu has said the responsibility for any harm to civilians lies with Hamas, and that while Israel has urged civilians to leave combat zones, 'Hamas is doing everything it can to prevent them from leaving'.\nA Hamas official denied that their fighters opened fire at residents trying to leave Gaza City or its hospitals.\nSpeaking by phone, Ghazi Hamad called such assertions by Israel lies and said that Hamas doesn't have guards at hospital gates to prevent people from entering or leaving.\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 11, 2023, shows smoke rising over buildings during an Israeli strike on the Palestinian enclave\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 11, 2023, shows smoke rising over buildings during an Israeli strike on the Gaza Strip enclave\nIsraeli soldiers operate inside the Gaza Strip, according to the Israeli Defence Forces (IDF), in this handout picture obtained by Reuters on November 11, 2023\nThis image grab from a handout video released by the Israeli army on November 11, 2023, shows Israeli armoured vehicles rolling inside the Gaza Strip\nThe spokesman of the Hamas military wing said they were ambushing Israeli troops and vowed that Israel will face a long battle.\nThe Qassam Brigades spokesman, who goes by Abu Obaida, acknowledged in audio aired on Al-Jazeera that the fight is disproportionate 'but it is terrifying the strongest force in the region'.\nIsrael's military has said soldiers have encountered hundreds of Hamas fighters in underground facilities, schools, mosques and clinics during the fighting. Israel has said a key goal of the war is to crush Hamas, which has ruled Gaza for 16 years.\nFollowing Hamas' deadly October 7 attack on Israel, the nation's allies have defended the country's right to protect itself. But now into the second month of war, there are growing differences over how Israel should conduct its fight.\nThe US has been pushing for temporary pauses that would allow for wider distribution of badly needed aid to civilians in the besieged territory where conditions are increasingly dire.\nHowever, Israel has only agreed to brief daily periods during which civilians can flee the area of ground combat in northern Gaza and head south on foot along the territory's main north-south artery.\nSince these evacuation windows were first announced a week ago, more than 150,000 civilians have fled the north, according to UN monitors.\nOn Saturday, the military announced a new evacuation window, saying civilians could use the central road and a coastal road.\nOn the main road, a stream of people fled southward, clutching children and bags, many on foot and some on donkey-drawn carts.\nPalestinian civilians and rights advocates have pushed back against Israel's portrayal of the southern evacuation zones as 'relatively safe'.\nThey note that Israeli bombardment has continued across Gaza, including airstrikes in the south that Israel says target Hamas leaders but that have also killed women and children.\nPalestinians arrive in Khan Yunis in the southern Gaza Strip on November 11, 2023, after fleeing their homes in Gaza City\nPalestinians including injured people leave their homes to escape Israel's bombardments to reach southern part of the city in Gaza City, Gaza on November 11, 2023\nPalestinians arrive in Khan Yunis in the southern Gaza Strip on November 11, 2023\nThe Palestinian Health Ministry said on Saturday that three young Palestinians have been killed by Israeli forces in the occupied West Bank.\nOne of those killed was from the town of Jenin while the other two were from Arraba, a town to the southwest.\nMore than 11,070 Palestinians, two-thirds of them women and minors, have been killed since the war began, according to the Health Ministry in Gaza, which does not differentiate between civilian and terrorist deaths.\nAbout 2,700 people have been reported missing and are thought to be possibly trapped or dead under the rubble.\nAt least 1,200 people have been killed in Israel, mainly in the initial Hamas attack, Israeli officials say.\nThe military on Saturday confirmed the deaths of five reserve soldiers; 46 Israeli soldiers have been killed in Gaza since the ground offensive began.\nAdditionally, about 250,000 Israelis have been forced to evacuate from communities near Gaza and along the northern border with Lebanon, where Israeli forces and Hezbollah militants have traded fire repeatedly.\nProtesters demand the release of the hostages held in Gaza who were seized in the October 7 attack by Hamas gunmen, in Tel Aviv, Israel, November 11, 2023\nProtesters demand the release of the hostages held in Gaza, in Tel Aviv, Israel, on November 11, 2023\nPro-Palestine marchers on Vauxhall Bridge in London on November 11, 2023\n'Hezbollah is dragging Lebanon into a possible war,' Israeli Defence Minister Yoav Gallant said after meeting with soldiers stationed along the border.\nIn Tel Aviv on Saturday evening, protesters took to the streets outside the Museum of Art demanding the release of the hostages taken by Hamas.\nImages showed crowd members holding glowing phones and placards with pictures of the missing as thousands protested in the city. Family members of the hostages also attended the demonstration.\nIn the UK, dozens of counter-protesters were arrested as hundreds of thousands of people took part in a pro-Palestinian demonstration in central London.\nThe Metropolitan Police said 126 arrests have been made so far.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli Prime Minister Benjamin Netanyahu insists there will be no ceasefire in war against Hamas before hostages are returned", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12738355/Israeli-Prime-Minister-Benjamin-Netanyahu-insists-no-ceasefire-war-against-Hamas-hostages-returned.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}