{"authors": ["Will Stewart", "Bradley Jolly", "Image", "Ap", "Baza"], "date_download": "2024-02-05 15:42:12", "date_modify": "None", "date_publish": "2023-11-11 17:42:59", "description": "A major explosion ripped up the railway line in the Ryazan region of Russia, some 130 miles southeast of Moscow, but it is unclear what the cargo contained", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Frussian-train-carrying-mystery-white-31416984.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31417053.ece/ALTERNATES/s1200/2_PAY-Russia-Ukraine-Developments-23315416671117.jpg", "language": "en", "localpath": null, "maintext": "A major explosion ripped up the railway line in the Ryazan region of Russia, some 130 miles southeast of Moscow, but it is unclear what the cargo contained\nNineteen carriages of a Russian cargo train region crashed off the tracks in an alleged \"sabotage attack\" early today.\nA major explosion ripped up the railway line in Ryazan region, 130 miles southeast of Moscow. A mysterious white power was seen in seven of the overturned wagons.\nBut it is not clear what the other cargo carriages contained. Officially, this was said to be \"mineral fertiliser\". It was suspected that the attack was either by Ukrainians operatives in Russia, or Russian partisans sympathetic to Kyiv.\nIt came shortly after kamikaze drone attacks on a Russian gunpowder plant and a factory making Iskander-M and other missiles. The rail incident was quickly labelled “sabotage” by the authorities. It appeared that this specific train had been targeted.\nImage: AP) AP) Image: BAZA) BAZA)\nCCTV footage caught the sound of a loud explosion ripping up the the track, and causing the crash. The crash was “as a result of interference by unauthorised persons in the operation of railway transport,” said Russian Railways.\nThe carriages were thrown off the line at 7:12am, near the town of Rybnoye. The driver’s assistant sustained minor injuries, and an ambulance was called.\nImage: AP) AP) Image: BAZA) BAZA)\nA report said: “There is no threat to the environment from the carriage derailment.” The Russian Investigative Committee launched a criminal probe into the explosion and derailment.\nVladimir Putin last week staged a \"massive\" drill of a \"nuclear strike\" on the West. The mass-scale exercises involved the launch of a Yars intercontinental ballistic missile from the Plesetsk Cosmodrome in northern Russia. The mock atomic attack also a nuclear submarine and two Tu-95MS strategic missile carriers. A Sineva ballistic missile was also launched from the Barents Sea from the strategic nuclear-powered missile submarine cruiser Tula.\nState television showed Putin directing the exercise via video call with top military officials. Russia’s Minister of Defense Sergei Shoigu said the purpose of the drills is to practice \"dealing a massive nuclear strike with strategic offensive forces in response to a nuclear strike by the enemy.\"", "source_domain": "www.mirror.co.uk", "text": null, "title": "Russian train carrying mystery white powder substance derails after 'sabotage explosion'", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/russian-train-carrying-mystery-white-31416984"}