{"authors": ["Oli Smith"], "date_download": "2024-02-05 15:42:14", "date_modify": "None", "date_publish": "2023-11-11 17:52:00", "description": "Hezbollah has ramped up its threats against Israel, who warned that the destruction seen in Gaza could easily be carried out in Beirut.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1834025%2FIsrael-Hezbollah-Gaza-Beirut-Iran-war.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5061331.jpg", "language": "en", "localpath": null, "maintext": "IDF releases video showing airstrikes on Hezbollah in the border area with Lebanon\nThe risk of a regional conflict is mounting in the Middle East amid escalating tension between Israel and Hezbollah. Deadly skirmishes have continued along the Israel-Lebanon border, with both the Iran-backed terror group and Israeli forces launching repeated attacks against each other. Earlier today, Israel's Defense Minister Yoav Gallant sent a chilling message to Hezbollah's leadership. During a tour of Israeli troops in the north of the country, Mr Gallant warned that the terror group is “close to making a grave mistake” that could doom Beirut. He said that Israel's bombardment of Gaza could also be imposed on the Lebanese capital. READ MORE: IDF now metres from Hamas HQ and poised to take 'entire coastline'\nThe risk of a regional conflict is mounting in the Middle East\nMr Gallant told troops: “I am saying here to the citizens of Lebanon, I already see the citizens in Gaza walking with white flags along the coast and moving south. “Hezbollah is dragging Lebanon into a war that may happen, and it is making mistakes. \"If it makes mistakes of this kind, the ones who will pay the price are first of all the citizens of Lebanon. \"What we are doing in Gaza we know how to do in Beirut.\"\nIsrael has killed 78 Hezbollah fighters since the Hamas attack on Israel on 7 October\nMr Gallant added that the Israeli Air Force was using less than a tenth of its power in the Gaza Strip. He said: “Our pilots are sitting in the cockpit, the noses of the planes are pointing north. \"We have enough to do in the south, but the Air Force is facing north and its power is very great.\" Israel has killed 78 Hezbollah fighters since the Hamas attack on Israel on 7 October amid ongoing border clashes.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending\nOn Friday, Hezbollah attacked northern Israel with three suicide drones", "source_domain": "www.express.co.uk", "text": null, "title": "Israel threatens to declare war on Lebanon in new warning to Hezbollah", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1834025/Israel-Hezbollah-Gaza-Beirut-Iran-war"}