{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Richard Luscombe", "Ashifa Kassam", "Reged Ahmad"], "date_download": "2024-02-05 15:42:15", "date_modify": "None", "date_publish": "2023-11-11 03:46:34", "description": "Head of World Health Organisation says Gaza’s health system is ‘on its knees’. This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F10%2Fisrael-hamas-war-live-updates-benjamin-netanyahu-gaza-fighting-pauses-un-palestine.json", "image_url": "https://i.guim.co.uk/img/media/0139b93d1e1dd80be47ecc2267e37203c4ceb86f/0_218_3267_1960/master/3267.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=97929ee0f6b02bb61301bbc3286c8fc9", "language": "en", "localpath": null, "maintext": "From 10 Nov 2023 23.22 CET WHO chief says a child is killed every 10 minutes in Gaza The head of the World Health Organization (WHO) has described the situation on the ground in Gaza, from hospitals conducting operations without anaesthetics to the fact that a child is killed every 10 minutes. “Nowhere and no one is safe,” Tedros Adhanom Ghebreyesus told the UN security council on Friday. Gaza’s health system “is on its knees”, he said. He said there have been more than 250 attacks on health centres in Gaza and 25 in Israel since the start of the conflict last month. More than 100 UN colleagues have been killed. Half of the 36 hospitals in Gaza and two-thirds of its primary healthcare centers were not functioning, he said. Those that were operating were way beyond their capacities, he said.\nUpdated at 23.24 CET\n11 Nov 2023 04.46 CET Closing summary This is where we’ll pause our live coverage of the Israel-Hamas war for now – we’ll resume it later in the day. Here’s a rundown on the latest as it just passes 5.45am in Gaza City and Tel Aviv. France’s president, Emmanuel Macron, has said there is “no justification” for the Israeli bombing of babies, women and elderly people in Gaza. Macron, speaking to the BBC a day after a humanitarian aid conference in Paris about the war, called for a ceasefire in Gaza, saying it would benefit Israel. In response, the Israeli prime minister, Benjamin Netanyahu, said Hamas was responsible for the civilian deaths in Gaza.\nThe largest hospital in Gaza, where up to 50,000 people are sheltering, is facing bombardment, the World Health Organisation has said . Palestinian officials said Israel launched airstrikes on or near four hospitals and a school on Friday, killing at least 22 people. A WHO spokesperson said 20 hospitals in Gaza were out of action and that there was “intense violence” at al-Shifa hospital in the heart of Gaza City. The Palestinian Red Crescent Society said Israeli forces opened fire on the intensive care unit at al-Quds hospital in Gaza City.\nAn Israel Defence Forces (IDF) spokesperson has said the Israeli army is aware of the sensitivities of the hospitals in Gaza. “The IDF does not fire on hostages but if we see a Hamas terrorist we will kill him,” Lt Col Richard Hecht said in a press briefing on Friday.\nThe International Committee of the Red Cross (ICRC) has urgently called for the protection of patients, healthcare workers and medical facilities in Gaza. An ICRC statement warned that Gaza’s healthcare system had “reached a point of no return” amid escalating violence that had “severely” affected hospitals and ambulances working in the besieged territory.\nThe number of people killed in Gaza by Israeli military actions since the start of the war on 7 October has risen to 11,078, including 4,506 children, according to the Hamas-run health ministry on Friday. Another 27,490 Palestinians in Gaza had been wounded, it said.\nIsrael has revised downwards the death toll from last month’s Hamas attacks in the south of the country from 1,400 to about 1,200, a foreign ministry spokesperson said. The revision was “due to the fact that there were lot of corpses that were not identified and now we think those belong to terrorists … not Israeli casualties”, they said on Friday.\nThousands of Palestinians continued to flee south from northern Gaza on Friday a day after the White House announced that Israel would begin to implement four-hour “humanitarian pauses” in parts of the area to allow people to leave. IDF spokesperson Daniel Hagari said on Friday that more than 100,000 residents had fled south from Gaza City during the past two days.\nDespite the US announcement, there have been no immediate reports of a lull in fighting in northern Gaza. The Israeli military has said there would be “tactical, local pauses for humanitarian aid for Gazan civilians” but “no ceasefire”. On the ground, conditions continued to deteriorate as night fell over Gaza City on Friday during a sustained Israeli onslaught with heavy gunfire, explosions and the buzz of Israeli military drones heard.\nThe head of the World Health Organization (WHO) said a child was killed every 10 minutes in Gaza. “Nowhere and no one is safe,” Tedros Adhanom Ghebreyesus told the UN security council on Friday, adding that Gaza’s health system was “on its knees”, with half of its 36 hospitals not functioning.\nThe UN’s human rights chief, Volker Türk, has called for an investigation into what he described as Israel’s “indiscriminate” bombardment and shelling in densely populated areas in the Gaza Strip . “The extensive Israeli bombardment of Gaza, including the use of high-impact explosive weapons in densely populated areas ... is clearly having a devastating humanitarian and human rights impact,” Türk told reporters in Jordan.\nThe US secretary of state, Antony Blinken, said “far too many Palestinians had been killed” in the war. He said that while the US “appreciates” Israel’s steps to minimise civilian casualties, it was not enough. Blinken said the US had proposed additional ideas to the Israelis, including longer “humanitarian pauses” and expanding the amount of assistance getting into Gaza.\nIsrael’s embassy to the US has issued a rare public rebuke to a State Department office that deals with Palestinian affairs , after it criticised Israel’s demolition of a Palestinian home in Jerusalem. The US Office of Palestinian Affairs posted on X (formerly Twitter) on Friday that the demolition was “in response to the actions of their 13-year-old child” and that “an entire family should not lose their home because of the actions of one individual”. The Israeli embassy shot back in response: “Context is helpful: the ‘13-year-old’ is a terrorist who murdered an Israeli citizen by stabbing him to death.”\nEach recorded fatal Israeli airstrike on Gaza since 7 October has caused an average of 10.1 civilian deaths, a monitoring group has said, amid warnings that reported civilian casualty figures are likely to be an underestimate. The fatality average is far higher than in the three previous Israeli air campaigns in Gaza.\nCrowds of people marched through the centre of Jenin in the occupied West Bank for the funerals of Palestinians killed during an IDF raid. As the Israeli offensive in Gaza continues, violence in the occupied West Bank is escalating. Nineteen Palestinians were killed across the territory on Thursday as clashes took place with Israeli forces.\nIsrael has killed a further seven Hezbollah fighters on its northern border with Lebanon, taking the total death toll of Hezbollah fighters to 78 since the Hamas attack on Israel on 7 October. The group’s leader, Hassan Nasrallah, will make his second speech this month on Saturday, setting out his latest thinking.\nIsrael is considering a deal for Hamas to release all civilian hostages held in Gaza, according to a report. Under one of the proposals being discussed, Hamas would release 10 to 20 civilian hostages in exchange for a brief pause in fighting, one official said. That could be followed by a release of about 100 civilians if terms were met.\nEvacuations from the Gaza Strip in to Egypt for foreign passport holders and for injured Palestinians requiring urgent medical treatment were suspended on Friday . The suspension was due to problems bringing medical evacuees to the Rafah crossing from inside Gaza, Reuters reported. The Rafah crossing was also suspended on Wednesday due to what the US state department referred to as unspecified “security circumstance”.\nSaudi Arabia will host an extraordinary joint Islamic-Arab summit in Riyadh on Saturday, the Saudi foreign ministry said . The kingdom had been scheduled to host two extraordinary summits, the Organisation of Islamic Cooperation summit and the Arab League summit, on Saturday. The joint summit would replace the two separate gatherings, the ministry said, due to “the exceptional circumstances taking place in the Palestinian Gaza Strip”.\nBritish healthcare workers in uniform protested outside Downing Street on Friday to commemorate almost 200 clinicians killed in Gaza since Israel’s bombardment began. The vigil was organised to call on the British prime minister, Rishi Sunak, to push for an urgent ceasefire.\nThe organisers of the pro-Palestine march due to take place in London on Armistice Day believe “hundreds of thousands” of people will turn out for what they say will be one of Britain’s biggest days of mass protest.\n11 Nov 2023 04.14 CET The AP report continues: More than 720,000 displaced people across the Gaza Strip were sheltering at 150 facilities run by UNRWA, as of Thursday. At shelters, the lack of water makes it hard to maintain even basic hygiene. Families are packed into a school building in Deir al-Balah, in central Gaza, with tents set up in the playground, washing hung up to dry in corridors and children sleeping on mats next to their worried parents. Suzan Wahidi, from Gaza City, says as many as seven people might share a mattress – if they can find one. Our children are now suffering from an epidemic. They suffer from all the diseases that you can imagine, diarrhea, vomiting, fever. There are no medicines, there is no food to provide us. View image in fullscreen Palestinians in central Gaza as they head south from Gaza City on Friday. Photograph: Xinhua/Shutterstock\n11 Nov 2023 04.08 CET The Associated Press has this report on the death and misery Palestinians are describing as they flee south from the intense fighting in northern Gaza. A stream of thousands of Palestinians have taken what few belongings they can carry and made their way on foot Friday to the relative safety of the southern Gaza Strip after Israel announced an hours-long window for safe passage. One woman who was displaced from Beit Lahiya in the north, Umm al-Adhan, spoke to AP on Gaza’s main highway as people trudged past heading southward. She said she had been sheltering in a school run by UNRWA, the UN agency for Palestinian refugees. She said: Yesterday, as we were leaving the school, they fired at us. Ten people were killed, including my nephew. A badly wounded child begged for water in his final moments. The woman added, crying: I could not find water to give him. He died in front of me. Israel estimates that more than 850,000 of the 1.1 million people in northern Gaza have left, and later on Friday said over 100,000 Palestinians had gone south in the past two days.\n11 Nov 2023 03.28 CET Islamophobia and antisemitism have seen sharp increases across the US after the Israel-Hamas war erupted last month. According to a new report by the Council on American-Islamic Relations (Cair), the Muslim civil rights and advocacy organisation received a total of 1,283 requests for help and reports of bias between 7 October and 4 November. The spike was “unprecedented”, it said. Jewish communities, meanwhile, say they have also faced record-high levels of antisemitism. On 25 October, the Anti-Defamation League reported an increase of nearly 400% in antisemitic incidents reported year-on-year. From 7 to 23 October, it recorded a total of 312 antisemitic incidents, 190 of which were directly linked to the violence in Israel and Gaza. Read the full story from Maya Yang here: Islamophobia and antisemitism on rise in US amid Israel-Hamas war Read more\n11 Nov 2023 03.09 CET Almost 2,000 police will be on duty on Saturday when more than 100,000 pro-Palestinian supporters are expected to march through London, with extra powers in place to protect landmarks honouring Britain’s war dead, Agence France-Presse reports. Pro-Palestinian marches have been held in the UK capital over recent weekends, with police making almost 100 arrests for offences including supporting banned organisations and serious hate crimes. But Saturday’s march promises to be more fraught as it coincides with Armistice Day, which commemorates those who have died in conflict since world war one. The prime minister, Rishi Sunak, made a late plea for peaceful demonstrations, saying in a statement released late on Friday: It is because of those who fought for this country and for the freedom we cherish that those who wish to protest can do so, but they must do so respectfully and peacefully. It would be a “particularly challenging and tense weekend”, Laurence Taylor, the Metropolitan police deputy assistant commissioner leading Saturday’s operation, said on Friday. We have a full report on the demonstration here: Pro-Palestine march will be one of UK’s biggest ever protests, organisers predict Read more\n11 Nov 2023 02.36 CET A doctor at the largest hospital in Gaza has described heavy bombing outside the facility going late into the night. “Every time, every minute, we hear bombing around us,” orthopedic surgeon Dr Adnan Albursh of the al-Shifa hospital told the US NBC News network around midnight local time. He said there were also multiple bombardments around al-Shifa throughout the day. Many people fled from the hospital but thousands were still there, he said. We cannot evacuate the hospital because there are a lot of patients here. There’s children, women, all ages. As we reported earlier, the World Health Organisation (WHO) has said al-Shifa – in the heart of Gaza City – is facing a bombardment. Up to 50,000 people are sheltering there. Palestinian officials said Israel launched airstrikes on or near four hospitals and a school on Friday, killing at least 22 people. A WHO spokesperson said 20 hospitals in Gaza were out of action and there was “intense violence” at al-Shifa hospital.\nUpdated at 02.42 CET\n11 Nov 2023 02.04 CET Saudis to host Islamic-Arab summit Saudi Arabia will host a joint Islamic-Arab summit in Riyadh on Saturday, the Saudi foreign ministry has said. The joint meeting “will be held in response to the exceptional circumstances taking place in the Palestinian Gaza Strip as countries feel the need to unify efforts and come out with a unified collective position”, Reuters reported the ministry as saying. The kingdom was scheduled to host two extraordinary summits, the Organisation of Islamic Cooperation summit and the Arab League summit, on Saturday. The joint summit would replace the two separate gatherings, the ministry said. The decision was taken after Saudi Arabia onsulted with the Arab League and the Organisation of Islamic Cooperation, according to the statement.\nUpdated at 02.14 CET\n11 Nov 2023 01.50 CET Israeli forces have carried out airstrikes on a series of Hezbollah targets in Lebanon, the Israel Defence Forces has said. IDF spokesman Daniel Hagari said on X (formerly Twitter): Among the targets attacked were a number of buildings and military positions where the organization’s terrorists operated, a weapons warehouse and an intelligence infrastructure from which terrorists directed terrorism against the State of Israel. Hagari said the Israeli strikes were in response to launches from the Hezbollah militant group over the past day. בתגובה לשיגורים ביממה האחרונה, מטוסי קרב וכלי טיס תקפו שורת מטרות טרור של ארגון חיזבאללה בשטח לבנון.\nבין המטרות שנתקפו, מספר מבנים ועמדות צבאיות בהן פעלו מחבלי הארגון, מחסן אמצעי לחימה ותשתית מודיעין ממנה מחבלים הכווינו טרור נגד מדינת ישראל. pic.twitter.com/POJlAD9L6q — דובר צה״ל דניאל הגרי - Daniel Hagari (@IDFSpokesperson) November 10, 2023 As the Guardian’s Patrick Wintour reported earlier, Israel has killed a further seven Hezbollah fighters on its northern border with Lebanon, taking the total death toll of Hezbollah fighters to 78 since the Hamas attack on Israel on 7 October. Hezbollah’s leader, Hassan Nasrallah, is to make his second speech this month on Saturday setting out his latest thinking. He ended his last speech on 3 November by saying he was leaving all military options on the table.\nUpdated at 03.16 CET\n11 Nov 2023 01.20 CET Israel rebukes US Palestinian affairs office over tweet Israel’s embassy to the United States has issued a rare public rebuke to a State Department office that deals with Palestinian affairs, after it criticised Israel’s demolition of a Palestinian home in Jerusalem, Agence France-Presse is reporting. “The government of Israel has demolished the home of a Palestinian family in response to the actions of their 13-year-old child,” the US Office of Palestinian Affairs posted on X (formerly Twitter) on Friday. It added: An entire family should not lose their home because of the actions of one individual. The Israeli embassy shot back in response: Context is helpful: the ‘13-year-old’ is a terrorist who murdered an Israeli citizen by stabbing him to death. Neither side named the teenager, but Israeli media identified him as Muhammad Zalbani, who it said had stabbed to death an Israeli border policeman as he was inspecting a bus in East Jerusalem in February. The Times of Israel said the home demolition took place on Wednesday in the Shuafat refugee camp in East Jerusalem, under the protection of a large police force. View image in fullscreen The Shuafat refugee camp during clashes between Palestinians and Israeli forces last year. Photograph: Ammar Awad/Reuters Israel has defended its controversial policy of destroying the homes of Palestinians who carry out attacks on its citizens, a practice widely condemned by human rights groups as collective punishment. The latest demolition took place amid open warfare between Israel and the Palestinian militant group Hamas in the Gaza Strip. This is Adam Fulton taking over our rolling live coverage of the Israel-Hamas war. It’s 2.20am in Gaza City and Tel Aviv. Stay with us for all the latest developments\nUpdated at 01.28 CET\n10 Nov 2023 00.33 CET Columbia University has suspended two student organisations that have led protests calling for a ceasefire in Israel’s military offensive against Hamas. The New York university said in a statement on Friday that it has suspended Students for Justice in Palestine and Jewish Voice for Peace as official student organisations for the rest of the fall semester. The statement reads: This decision was made after the two groups repeatedly violated university policies related to holding campus events, culminating in an unauthorized event Thursday afternoon that proceeded despite warnings and included threatening rhetoric and intimidation. On Thursday, hundreds of Columbia University students walked out of their classes to call for a ceasefire in Gaza. Walkouts, rallies, clashes: Israel-Gaza ‘war of words’ roils Columbia University Read more\nUpdated at 00.36 CET\n10 Nov 2023 00.26 CET Israel preparing for a year of fighting in Gaza - report The Israel Defense Forces (IDF) is preparing to fight in Gaza for a year, according to a report. Israel’s military is set to expand its ground operations into areas of the Gaza Strip where the IDF has never operated before, the Times of Israel said that Channel 12 reported. The report said the IDF is “preparing for a period of a year of fighting … in different areas … different methods, but a year of fighting to get to the fourth stage of this war: the entry of a new government in Gaza that is not Hamas and is not backed by the Iranians.” There is “no pressure to hurry”, the report said. That is the message army commanders are being told all the time: work slowly and securely. Bring the results.\nUpdated at 00.34 CET\n10 Nov 2023 00.20 CET Netanyahu responds to Macron saying Hamas is responsible for Gaza deaths Benjamin Netanyahu has responded to French president Emmanuel Macron’s call for Israel to stop bombing babies, women and elderly people in Gaza. Macron, in an interview with the BBC on Friday, said there is “no justification” for the ongoing bombing of civilians in Gaza. In a statement from his office, the Israeli prime minister said: While Israel is doing everything to refrain from harming civilians and calling on them to leave areas of fighting, Hamas-Isis is doing everything to prevent them from leaving for safe areas and is using them as human shields. Hamas is “cruelly holding our hostages – women, children and the elderly – in a crime against humanity” and “uses schools, mosques and hospitals as terror command centres”, he said.\nUpdated at 00.25 CET", "source_domain": "www.theguardian.com", "text": null, "title": "WHO says a child is killed every 10 minutes in Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/10/israel-hamas-war-live-updates-benjamin-netanyahu-gaza-fighting-pauses-un-palestine"}