{"authors": ["Laura Parnaby", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:16:30", "date_modify": "None", "date_publish": "2024-01-22 15:34:55", "description": "US Central Command officials said Iran-backed militants launched several ballistic missiles and rockets at al-Asad Airbase at around 6.30pm Iraq time as tensions surge.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12991983%2Fmissiles-attack-base-iraq-personnel-injuries.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/22/15/80311109-0-image-m-20_1705936996106.jpg", "language": "en", "localpath": null, "maintext": "Multiple American soldiers are being evaluated for potential brain injuries following a missile barrage in Iraq on Saturday night.\nUS Central Command officials said Iran-backed militants launched several ballistic missiles and rockets at al-Asad Airbase at around 6.30pm Iraq time as tensions continue to bubble in the region.\nIt came as separate missile attacks on Saturday in Syria, Lebanon, and Yemen threw into sharp focus the increasing risk of the war in Gaza triggering a wider regional conflict pitting Iran and its allies against Israel and the United States.\nThe missiles which struck al-Asad base were deployed inside Iraq, and most were intercepted by the base's air defense systems - but some hit the target.\nUS soldiers have come under fire at least 58 times in Iraq and 83 times in Syria by Iran-backed militants, usually with a mix of rockets and one-way attack drones\nMultiple American soldiers are being evaluated for potential brain injuries following a missile barrage on al-Asad Airbase (pictured) in western Iraq on Saturday night\nA spokesperson for US Central Command, which is part of the US Department of Defense, said: 'Damage assessments are ongoing.\n'A number of U.S. personnel are undergoing evaluation for traumatic brain injuries. At least one Iraqi service member was wounded.'\nThe statement did not say how many US soldiers were impacted and what the extent of their injuries were.\nOn the same day, Iran said five of its Revolutionary Guards were killed in a missile strike on a house in Damascus for which it blamed Israel, and security sources in Lebanon said an Israeli strike there killed a member of Hezbollah.\nThe United States also said it had targeted and destroyed another missile the Iran-backed Houthi group in Yemen was aiming into the Red Sea on Saturday, which it called a threat to shipping.\nTensions in the Middle East have surged since the Israel-Palestine war began in October, when Hamas fighters stormed border defenses to attack Israeli bases and towns, killing more than 1,200 people and seizing more than 250 hostages.\nHamas is part of Iran's 'Axis of Resistance', a regional alliance that also includes Lebanon's Hezbollah, the Syrian government of President Bashar al-Assad, Shi'ite militia groups in Iraq and the Houthis who control much of Yemen.\nIsrael's intense bombardment of Gaza since Oct. 7, which health authorities in the Hamas-run enclave say has killed nearly 25,000 Palestinians, quickly triggered border clashes between Israel and Hezbollah.\nUS soldiers have come under fire at least 58 times in Iraq and 83 times in Syria by Iran-backed militants, usually with a mix of rockets and one-way attack drones.\nThe militants are seeking to impose a cost on the US for its support of Israel against Hamas, which is supported by Iran.\nSeveral US troops suffered minor injuries in the attack, and they were evaluation for potential brain damage, a spokesperson for the US Central Command said\nAin al-Asad air base is seen above in 2020. The so-called 'Islamic Resistance in Iraq', an umbrella group for Iranian-backed proxy militia forces, claimed responsibility for the attack\nThe US has 900 troops in Syria and 2,500 in Iraq on a mission to advise and assist local forces trying to prevent the resurgence of Islamic State, which seized large parts of both countries before being defeated.\nMeanwhile, Iraq is concerned about becoming a battleground between the United States, Israel and Iran.\nIraq's Prime Minister Mohammed Shia al-Sudani's office announced moves to evict US forces following an American drone strike in Baghdad.\nThe attack was condemned by Iraq's government, while the Pentagon said it killed a militia leader responsible for recent attacks on US personnel.\nThe Pentagon said it has not been formally notified of any plans to end the US troop presence in the country, adding that US soldiers are deployed there at the invitation of the government in Baghdad.\nOn Monday, Iran fired missiles at what it claimed were Israeli 'spy headquarters' near the US consulate in the northern Iraqi city of Erbil.\nFour civilians were killed and six injured after missiles hit the upscale area, which is the epicenter of Iraq's semi-autonomous Kurdish region, according to the security council of the Kurdish regional government.\nIran's Revolutionary Guards said in a statement that it had hit a headquarters of Mossad, the Israeli intelligence agency, in the Kurdish region of Iraq.\nAnother statement said it also fired a number of ballistic missiles at 'terrorist operations,' including Islamic State targets, in Syria and destroyed them.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Multiple US troops are being evaluated for possible traumatic brain injuries after missile barrage against base in Iraq", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12991983/missiles-attack-base-iraq-personnel-injuries.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}