{"authors": [], "date_download": "2024-02-05 15:42:18", "date_modify": "None", "date_publish": "2023-11-11 13:55:56", "description": "As a U.S. Navy surveillance plane flew in circles, dozens of Chinese coast guard and accompanying ships chased and encircled Philippine vessels in the latest confrontation in the South China Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-chinese-washington-beijing-manila-b2445713.html.json", "image_url": "https://static.independent.co.uk/2023/11/11/14/Philippines_South_China_Sea_27309.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAs a U.S. Navy surveillance plane flew in circles, keeping a close watch, dozens of Chinese coast guard and accompanying ships chased and encircled Philippine vessels in the latest confrontation in one of the most dangerous flashpoints in the South China Sea.\nAt the height of Friday’s four-hour faceoff in the high seas, a Chinese coast guard ship blasted a water cannon toward a Philippine motorboat delivering food and other supplies to Filipino forces at a marooned, rusting warship that serves as the country's fragile territorial outpost at Second Thomas Shoal.\nChina has steadfastly stood by its claim to virtually the entire strategic waterway, clashing with its smaller neighbors and drawing in the United States, Manila's treaty ally and China's main rival in the Asia-Pacific region. Washington and its allies have deployed navy ships and fighter aircraft to promote freedom of navigation and overflight, build up deterrence and reassure allies like the Philippines.\nThere are fears that the recurring confrontations at Second Thomas Shoal could ignite an armed conflict that could pit the U.S. and China. Philippine officials said Saturday they would never take any step that could ignite a larger conflict but would not be deterred in defending the country's sovereign rights in the South China Sea.\nDespite the Chinese blockades and coercive maneuvers, the Philippine contingent managed to deliver supplies to the handful of Filipino marines aboard the BRP Sierra Madre and left without incident. The slightly listing Philippine warship, donated by the U.S., has been crumbling with age but is still actively commissioned, meaning an armed attack would be considered by Manila as an act of war.\nTwo Associated Press journalists and several other members of the media who were invited on board three Philippine coast guard ships securing two supply boats witnessed the dangerous cat-and-mouse maneuvers in rough waves. It’s part of a shame campaign Philippine officials said they would press on to expose China’s growing aggression in one of the world’s most important trade routes.\nFilipino forces would continue to adhere to the rule of law and would not be provoked by China’s strong-arm tactics, Philippine coast guard Commodore Tarriela said.\n\"Regardless how dangerous the maneuver that they’re going to throw at us, whether they use water cannon, whether they use military-grade laser, we are not going to allow them to make Philippine coast guard personnel on board our vessels to escalate the tensions,” Tarriela said.\nAt least 38 Chinese ships were spotted in Second Thomas Shoal’s vicinity on Friday, including a Chinese navy fast assault craft and a hospital ship, the Philippine coast guard said.\nOne of the Philippine coast guard ships, the BRP Cabra, was surrounded five times by the Chinese coast guard and other ships, but managed each time to move away until it was hemmed in near the shoal.\n“We grow more confident each time we steer past through the Chinese blockades,” the Cabra's commander, Emmanuel Dangate, told AP. “We feel all the more the need by all to follow the international regulations to prevent collisions.”\nThe campaign to expose China’s aggression at sea would continue, Tarriela said in a news conference, where photographs, video and drone shots of Friday’s confrontations were shown.\n\"I believe that our effort in transparency initiative has been very successful in rallying support from the international community to condemn the illegal actions of China and to make the Filipino people aware of what’s happening,” Tarriela said.\nWashington reacted to Friday’s confrontation by repeating that it stands with its oldest ally in Asia “in the face of the People’s Republic of China’s repeated harassment in the South China Sea.\"\nThe U.S. State Department renewed a warning that Washington is obligated to defend the Philippines under a 1951 Mutual Defense Treaty if Filipino forces, public vessels or aircraft, including those of its coast guard ”face an armed attack “anywhere in the South China Sea.\"\n\"The PRC’s actions are inconsistent with international law and follow a pattern of dangerous operational behavior in the South China Sea,” the State Department said in a statement. It cited a 2016 international arbitration decision that invalidated China’s expansive claims to the waterway on historic grounds, including Second Thomas Shoal.\nChina refused to participate in the arbitration, which was brought up by the Philippines in 2013, after Chinese ships took control and surrounded another disputed area, Scarborough Shoal. Beijing dismissed the 2016 ruling as a sham and continues to defy it.\nA Philippine government task force said Friday that vessels belonging to China’s coast guard and its paramilitary maritime militia “recklessly harassed, blocked and executed dangerous maneuvers in another attempt to illegally impede or obstruct a routine resupply and rotation mission.\"\nChina's coast guard said it “followed the Philippines ships in accordance with the law, taking necessary control measures, and made temporary special arrangements for the Philippines side to transport food and other daily necessities,” spokesperson Gan Yu said in a statement.\nIt urged the Philippines to stop actions that infringe upon China’s rights and said China would continue to uphold its national sovereignty.\n\"China urges the Philippine side to immediately stop making trouble and provocation at sea and to tow away the illegal grounded vessel as soon as possible,” Chinese Foreign Ministry spokesperson said at a briefing in Beijing.\nChina and the Association of Southeast Asian Nations, a 10-nation bloc that includes the Philippines, have stepped up efforts to hasten negotiations for a nonaggression pact called a code of conduct that aims to prevent war from breaking out in the South China Sea. But the skirmishes at Second Thomas Shoal would likely continue on a regular basis with Chinese ships, including its navy, surrounding the shoal and the Philippines vowing to defend it at all cost and keep its forces there.\nLast month, a Chinese coast guard ship and another vessel blocked then collided with a Philippine coast guard ship and a military-run supply boat near the shoal. China accused the Philippine vessels of trespassing in what it said were Chinese waters.", "source_domain": "www.independent.co.uk", "text": null, "title": "Dozens of Chinese ships chase Philippine vessels as US renews warning it will defend its treaty ally", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-chinese-washington-beijing-manila-b2445713.html"}