{"authors": [], "date_download": "2024-02-05 15:42:20", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Israel's army said Wednesday that 50,000 civilians had fled north Gaza for the south on Wednesday, hours after Israel said it was tightening i", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274026894%2Fsome-50000-gazans-flee-south-in-a-single-day-israeli-army-says.json", "image_url": "https://cdn.bignewsnetwork.com/frc1699510090.jpg", "language": "en", "localpath": null, "maintext": "Israel's army said Wednesday that 50,000 civilians had fled north Gaza for the south on Wednesday, hours after Israel said it was tightening its \"stranglehold\" on Gaza City, the most populous city in the Hamas-controlled enclave. Read our blog to see how all the day's events unfolded. All times are Paris time (GMT+1).\nThis blog is no longer being updated. For more coverage of the Israel-Hamas war, click here.\nThe pace of Palestinian civilians fleeing the combat zone in northern Gaza has picked up as Israel's air and ground campaign there intensifies, with the Israeli army saying that 50,000 civilians had fled north Gaza for the south on Wednesday.\nIsrael's Defence Minister Yoav Gallant said late on Tuesday that Israeli soldiers were \"tightening the stranglehold around the city of Gaza\", and were operating \"in the heart\" of the enclave's most populous hub.\nThe United States said it opposed any long-term occupation of the Gaza Strip by Israel and any forced relocation of Palestinians from the enclave, a day after Prime Minister Binyamin Netanyahu said Israel would take \"overall security responsibility\" of the enclave for an indefinite period after its war with Hamas.\nThe death toll in the Gaza Strip has risen to at least 10,328 people, including at least 4,237 children, the health ministry in the Hamas-run territory has said.\n3:00am: Fierce fighting in Gaza City\nStreet battles raged in Gaza City with Hamas fighters using tunnels to ambush Israeli forces overnight.\nThe Israeli military said its troops had advanced into the heart of Gaza City, Hamas' main bastion and the biggest city in the seaside enclave, while the Islamist group said its fighters had inflicted heavy losses.\nHamas' armed wing on Wednesday released a video that appeared to show intense street battles alongside bombed out buildings in Gaza City.\nIsraeli tanks have met heavy resistance from Hamas fighters using underground tunnels to stage ambushes, according to sources with Iran-backed Hamas and the separate Islamic Jihad militant group.\n2:54am: US says Palestinians should govern Gaza after war\nPalestinians should govern Gaza once Israel ends its war against Hamas, the United States said on Wednesday, pushing back against Prime Minister Benjamin Netanyahu's idea that Israel would be responsible for security indefinitely.\nHamas gunmen from Gaza burst through the border to Israel on Oct. 7 and killed 1,400 people, Israel says. Now a month later, Washington has begun discussing with Israeli and Arab leaders a future for the Gaza Strip without Hamas rule.\nWhile a plan has yet to emerge, US Secretary of State Antony Blinken on Wednesday outlined in the most comprehensive comments on the issue to date Washington's red lines and expectations for the besieged coastal territory.\n\"No reoccupation of Gaza after the conflict ends. No attempt to blockade or besiege Gaza. No reduction in the territory of Gaza,\" Blinken said at a press conference in Tokyo.\nBlinken said there may be a need for \"some transition period\" at the end of the conflict, but that post-crisis governance in Gaza must include Palestinian voices.\n12:25am: US senator says Gaza civilian toll 'too high'\nA US senator said Wednesday that it is \"vital\" for Israel to carry out a more targeted offensive in the Gaza Strip to limit civilian casualties.\n\"I think that the civilian death toll has been too high and a more surgical approach would be important and vital,\" Chris Murphy, a Democratic member of the powerful Senate Foreign Relations Committee, told AFP.\n12:04am: US strikes Iran-linked site in Syria\nThe United States, for the second time in recent weeks, carried out strikes on Wednesday against a facility in eastern Syria that the Pentagon said was used by Iran's Islamic Revolutionary Guard Corps (IRGC) and affiliated groups.\nAs tensions soar over the Israel-Hamas conflict, US and coalition troops have been attacked at least 40 times in Iraq and Syria by Iran-backed forces since the start of October. Forty-five US troops have suffered traumatic brain injuries or minor wounds.\nIn a statement, US Defense Secretary Lloyd Austin said the strikes were conducted by two US F-15 fighters and were in response to the recent attacks against U.S. forces.\nAustin said the attacks against US troops must stop.\n\"If attacks by Iran's proxies against US forces continue, we will not hesitate to take further necessary measures to protect our people,\" Austin added.\n11:46pm: Democrats urge Biden to grant protected status to Palestinians in US amid war\nA group of Democratic lawmakers on Wednesday urged US President Joe Biden to allow Palestinian tourists, students and workers in the United States to remain in light of the conflict in the Gaza Strip and unrest and violence in the West Bank.\nIn a letter to Biden more than 100 Democrats led by US Senator Dick Durbin called on Biden to grant residents of Israeli-occupied Palestinian territories deportation relief and access to work permits through US programs for people whose homelands are affected by conflicts, natural disasters or other extraordinary circumstances.\n\"In light of ongoing armed conflict, Palestinians already in the United States should not be forced to return to the Palestinian territories, consistent with President Biden's stated commitment to protecting Palestinian civilians,\" the lawmakers wrote.\nThe humanitarian protections would only be available to Palestinians already in the US, not those in the war zone or refugees in other countries. It was not clear how many Palestinians in the US would be covered.\nAround two-thirds of Gaza's 2.3 million population are internally displaced due to the fighting, according to UN figures.\n10:42pm: Israel kills several Hezbollah fighters near Damascus, monitor says\nIsraeli air strikes killed three pro-Iran fighters on Wednesday as they hit sites belonging to the powerful Lebanese Hezbollah group near the Syrian capital Damascus, a war monitor said.\nThe strikes took place on farms and other sites belonging to the group near Akraba and Sayyida Zeinab, Rami Abdel Rahman, who heads the Syrian Observatory for Human Rights, said.\nAkraba, which is located some 10 kilometres from Damascus International Airport, houses a military airport, he said.\nAccording to the monitor, Israel also struck Syrian air defence sites in the country's southern Sweida province.\n9:45pm: In Gaza, a child is killed 'every 10 minutes'\nIn the past month, more than 10,500 Palestinians have been killed in Gaza, including more than 4,300 children, according to the Hamas-run health ministry.\nFRANCE 24's Tom Burges Watson spoke to Shaina Low, the communication advisor for the Norwegian Refugee Council, who confirmed the high death toll among children, saying that on average \"one child is being killed every 10 minutes\".\nWatch the full interview here:\n8:52pm: Mossad helped foil Hezbollah cell in Brazil, Israel says\nIsrael's spy agency Mossad worked with Brazilian security services and other international agencies to foil an attack in Brazil planned by the Iran-backed militant group Hezbollah, Prime Minister Benjamin Netanyahu's office said on Wednesday.\nIt said the cell was operated by Hezbollah to carry out an attack on Israeli and Jewish targets in Brazil, adding: \"This was an extensive network that operated in additional countries.\"\nBrazilian police said they had detained two suspects in Sao Paulo in an operation to \"disrupt the preparation of terrorist attacks and secure evidence on the possible recruitment of Brazilians to carry out extremist acts in the country\".\nPolice also executed 11 search and seizure raids in Sao Paulo, Brasilia and the southeastern state of Minas Gerais, they said in a statement.\nBrazil is home to around 107,000 Jews, the second-biggest Jewish community in Latin America, after Argentina which has a Jewish population of around 250,000.\nCiting police sources, TV Globo, Brazil's biggest broadcaster, said the arrested suspects had recently traveled to Lebanon's capital Beirut. It also said police had asked Interpol to issue a notice for the arrest of two other suspects with Brazilian-Lebanese nationality who are currently in Lebanon.\n7:43pm: 50,000 Gazans move from north to south as Hamas loses control, says Israeli military spokesperson\nIsrael's military spokesperson Rear Admiral Daniel Hagari said in a televised briefing on Wednesday that some 50,000 Gazan civilians had fled in a single day.\n\"We saw 50,000 Gazans move from the northern Gaza Strip to the south. They are moving because they understand that Hamas has lost control in the north,\" Rear Admiral Daniel Hagari said.\n\"Hamas has lost control and is continuing to lose control in the north.\"\n6:54pm: US says Rafah crossing between Gaza and Egypt closed due to 'security circumstance'\nThe Rafah border crossing into Gaza was closed on Wednesday due to an unspecified \"security circumstance\", US State Department deputy spokesperson Vedant Patel said.\nThe United States expects the Egypt-controlled crossing will be reopened at \"regular intervals\" so that aid can enter the Gaza Strip and foreign nationals can continue to depart, Patel said during a regular press briefing.\nRead moreThe Gaza-Egypt Rafah crossing explained: 'It is not a normal border'\n6:20: 'A shift in tactics' as Israeli forces advance in Gaza\nAs Israeli forces have advanced deeper into Gaza in the past 48 hours, the war tactics have changed dramatically on both sides, FRANCE 24's Wassim Nasr says.\nAnalysing footage released by the Israeli army and Hamas, he explains how the use of both javelin rockets and mortars indicate that urban warfare, and thus the final \"and most difficult phase\" of fighting, is now under way in certain areas.\nWatch his full analysis in the video below:\n5:40: Source close to Hamas says talks under way for release of 12 hostages\nTalks are under way for the release of a dozen hostages held by Hamas, including six Americans, in return for a three-day ceasefire in the Gaza Strip, a source close to Hamas said Wednesday.\n\"Talks revolve around the release of 12 hostages, half of them Americans, in exchange for a three-day humanitarian pause, to enable Hamas to release the hostages and to enable Egypt an extended (period of time) to deliver humanitarian aid,\" the source said.\nFRANCE 24 was not immediately able to verify the information.\n5:32pm: Gaza activist on speaking tour in France faces deportation\nA French court has approved the deportation of Palestinian activist Mariam Abudaqa, who came to France for a speaking tour in September and was put under house arrest after the October 7 attack on Israel by Hamas militants.\nThe ruling, which overturns a court decision last month that the interior minister appealed, said 72-year-old Abudaqa, a member of the Popular Front for the Liberation of Palestine (PFLP), was \"likely to seriously disturb public order\".\nThe French government has cracked down on expressions of solidarity with Palestine in the wake of Hamas's October 7 attack which killed 1,400 people, banning protests, cancelling events and accusing some pro-Palestine groups of condoning terrorism.\n5:04pm: UN rights chief says war crimes committed on both sides\nThe United Nations High Commissioner for Human Rights said that both Israel and Hamas have committed war crimes in the conflict.\n\"The atrocities perpetrated by Palestinian armed groups on October 7 were heinous, they were war crimes - as is the continued holding of hostages,\" Volker Turk said at the Rafah crossing in Egypt on the border with Gaza.\n\"The collective punishment by Israel of Palestinian civilians is also a war crime, as is unlawful forcible evacuation of civilians,\" he added.\n3:59pm: UN chief says Gaza deaths show something 'wrong' with Israel operation\nUnited Nations Secretary-General Antonio Guterres said on Wednesday that the number of civilians and children killed in the Gaza Strip shows that there is something \"clearly wrong\" with Israel's military operations against Hamas Palestinian militants.\n\"There are violations by Hamas when they have human shields. But when one looks at the number of civilians that were killed with the military operations, there is something that is clearly wrong,\" Guterres said.\n\"In a few days in Gaza thousands and thousands of children [have been] killed,\" he said.\nHe also said it is important to make Israel understand that the deaths and suffering it is causing in Gaza is against its own interests. \"To see every day the terrible image of the dramatic humanitarian needs of the Palestinian people [...] that doesn't help Israel in relation to the global public opinion.\"\n3:25pm: Hamas says UN agency complicit in 'forced displacement' of Gazans\nHamas on Wednesday accused the United Nations agency for Palestinian refugees of \"colluding\" with Israel in the \"forced displacement\" of residents of Gaza.\n\"UNRWA and its officials bear responsibility for this humanitarian catastrophe, in particular the residents of the Gaza (City) area and north of it\" who are following Israeli military orders to flee south, said Salama Maruf, head of the media bureau of Gaza rulers Hamas.\n2:13pm: Belgium's deputy PM calls for sanctions on Israel for Gaza bombings\nBelgium's deputy prime minister has called on the Belgian government to adopt sanctions against Israel and investigate the bombings of hospitals and refugee camps in Gaza.\n\"It is time for sanctions against Israel. The rain of bombs is inhumane,\" deputy prime minister Petra De Sutter told Nieuwsblad newspaper. \"It is clear that Israel does not care about the international demands for a ceasefire,\" she said.\nDe Sutter said the European Union should immediately suspend its association agreement with Israel, which aims at better economic and political cooperation.\nShe also said an import ban on products from occupied Palestinian territories should be implemented and violent settlers, politicians, soldiers responsible for war crimes should be banned from entering the EU.\nAt the same time, she said, Belgium should increase funding for the International Criminal Court in The Hague to investigate the bombings while cutting money flows to Hamas.\n\"This is a terrorist organisation. Terror costs money and there must be sanctions on the companies and people who provide Hamas with money,\" De Sutter said.\n2:17pm: Italy to send hospital ship near Gaza coast\nItaly will send a hospital ship near the coast of Gaza to help treat victims of the Israeli-Palestinian conflict, Italian Defence Minister Guido Crosetto said.\nThe ship is leaving on Wednesday with 170 staff, including 30 people trained for medical emergencies, the minister said, adding that was also working to send a field hospital to Gaza.\n1:30pm: Massive destruction of Gaza housing a war crime, UN expert says\nThe widespread and systematic bombardment of housing and civilian infrastructure in Gaza amounts to a war crime and a crime against humanity, an independent United Nations expert has said.\nA month of Israeli attacks on targets within the Gaza Strip have destroyed or damaged 45 percent of all housing units in the Palestinian territory, Balakrishnan Rajagopal said, warning the destruction comes at a \"tremendous cost to human life\".\nThe UN special rapporteur on the right to adequate housing stressed that systematic or widespread bombardment of housing, civilian objects and infrastructure are strictly prohibited under international law.\nRead moreExperts say Hamas and Israel are breaking international law, but what does that mean?\n\"Carrying out hostilities with the knowledge that they will systematically destroy and damage civilian housing and infrastructure, rendering an entire city - such as Gaza City - uninhabitable for civilians is a war crime,\" he said.\nWhen such acts are \"directed against a civilian population, they also amount to crimes against humanity\", he said.\n12:50pm: UK police under pressure to ban pro-Palestinian rally\nBritain's top police official has come under mounting government pressure to ban a pro-Palestinian rally scheduled to take place in London on November 11, the day the country commemorates its war dead.\nPrime Minister Rishi Sunak has called the protest against the Israel-Hamas war scheduled for Saturday \"provocative and disrespectful\".\nOrganisers have resisted pleas from Sunak and London's Metropolitan Police to postpone the demonstration, when tens of thousands of people are expected to demand a ceasefire in the month-old conflict.\nThe force's chief, Mark Rowley, has said the rally does not meet the threshold for requesting a government order to stop it going ahead, describing such a ban as \"incredibly rare\" and a \"last resort\".\n12:05pm: Watch our special programme on a month of war between Israel and Hamas\nIn a special edition of our Middle East Matters programme, we take a look at a month of deadly fighting triggered by Hamas militants' gruesome attacks in southern Israel on October 7 - the largest loss of Jewish life in a single day since the Holocaust.\nFor more on the dire humanitarian situation in the Gaza Strip, where health officials say the death toll from Israel's relentless bombardment has passed 10,000, we speak to Juliette Touma from UNRWA, the UN agency for Palestinian refugees.\n11:40am: Health ministry in Hamas-run Gaza says war death toll hits 10,569\nThe Hamas-run health ministry in the Gaza Strip says the death toll from the war there has reached 10,569 as fighting in the Palestinian territory enters its second month.\nThe ministry said there were 4,324 children among the dead and 2,823 women, with more than 26,000 more wounded since war broke out on October 7.\nIn the past, the ministry's figures have been corroborated by UN agencies. But international organisations are no longer able to provide independent verification.\n11:05am: Gaza hospital crisis sparks frantic search for alternative solutions\nAs the need for medical care in Gaza soars, accessing working hospitals and health centres is becoming more and more difficult, writes FRANCE 24's Joanna York.\nAlternative solutions such as evacuating patients overseas and setting up field hospitals are under way, but may offer little hope if there is no end to fighting in the Palestinian enclave, experts say.\nFourteen out of 35 hospitals with inpatient services are no longer operating in the Palestinian enclave and 71 percent of primary care facilities have closed, according to figures from the UN. And in medical centres that are still functioning, the situation is dire.\n\"Hospitals are swamped,\" Michel-Olivier Lacharite, the manager of emergency programmes for French charity Doctors Without Borders (MSF), told reporters in Paris. \"In the past few weeks all of the hospitals in the north have not received any supplies at all.\"\nRead more'How are they going to evacuate them?': The search for solutions to Gaza's hospital crisis\n10:30am: Blinken says Israel should not 'reoccupy' Gaza\nUS Secretary of State Antony Blinken has reiterated Washington's opposition to Israel reoccupying the Gaza Strip once its war with Hamas ends.\nSpeaking to reporters after a G7 meeting in Japan, Blinken said that there should be \"no reoccupation of Gaza after the conflict\" - while also stressing that \"Gaza cannot be continued to be run by Hamas\".\n\"Now, the reality is that there may be a need for some transition period at the end of the conflict,\" he added.\n10:05am: UK labour leader faces dissent over Gaza stance\nA lawmaker in Britain's opposition Labour Party has resigned from his policy role in protest at his leader's refusal to call for a ceasefire in the Israel-Hamas war.\nLabour leader Keir Starmer has so far rejected growing calls in his party for him to press for a ceasefire, saying he supports an immediate humanitarian pause to ease the suffering in Gaza.\nImran Hussain, a lawmaker for a constituency in northern England with a large Muslim population, said that while he still supported Starmer's broader agenda, he wanted to go further on the situation in Gaza.\n\"I want to be able to strongly advocate for a ceasefire,\" Hussain, the party's spokesman for employment reform, said in a post on X late on Tuesday night. \"In order to be fully free to do so, I have tonight stepped down from Labour's Frontbench.\"\n9:40am: G7 says 'supports humanitarian pauses and corridors' in Gaza\nTop diplomats from the G7 countries have announced a unified stance on the Israel-Hamas war after talks in Tokyo, condemning Hamas, supporting Israel's right to self-defence and calling for \"humanitarian pauses\" to speed aid to desperate civilians in the Gaza Strip.\n\"We stress the need for urgent action to address the deteriorating humanitarian crisis in Gaza ... we support humanitarian pauses and corridors to facilitate urgently needed assistance, civilian movement, and the release of hostages,\" the ministers said in a joint statement.\nThe statement also said the ministers \"emphasise Israel's right to defend itself and its people in accordance with international law as it seeks to prevent a recurrence\" of the Hamas attacks on Israel on October 7.\nIt added: \"We call on Iran to refrain from providing support for Hamas and taking further actions that destabilise the Middle East, including support for Lebanese Hezbollah and other non-state actors, and to use its influence with those groups to de-escalate regional tensions.\"\n8:35am: Oxfam warns of 'crisis of epic proportions' in besieged Gaza\nMore than 70 percent of Gaza's population of 2.3 million have already fled their homes, but the growing numbers making their way south point to an increasingly desperate situation in and around Gaza's largest city, which has come under heavy Israeli bombardment.\nFor a deeper perspective on the harrowing humanitarian situation on the ground, FRANCE 24's Mark Owen is joined by Bushra Khalidi, Oxfam policy lead in the Occupied Palestinian Territories and Israel.\n7:40am: Israeli settler violence pushes West Bank farmers off their land\nSince the October 7 attacks by Hamas militants in southern Israel, there's been mounting violence in the occupied West Bank, where more than 160 Palestinians have been killed in the past month, either in army raids or in attacks by illegal Israeli settlers.\nUS President Joe Biden has spoken out on the sharp rise in settler attacks, saying that violence by \"extremist settlers ... has to stop now\".\nThe attacks are driving some Palestinians from their homes and off their farmland, bringing this tense region to boiling point. FRANCE 24's Catherine Norris Trent, Cecile Galluccio and Raïd Abu Zaideh sent this report.\n6:55am: More Palestinians fleeing combat zone in northern Gaza, UN says\nThe pace of Palestinian civilians fleeing the combat zone in northern Gaza has picked up as Israel's air and ground campaign there intensifies, the UN Office for the Coordination of Humanitarian Affairs has said.\nThe UN agency said about 15,000 people had fled on Tuesday, compared to 5,000 on Monday and 2,000 on Sunday.\nThe densely populated northern area of Gaza, specifically Gaza City and adjacent crowded urban refugee camps, is the focus of Israel's campaign to crush Hamas, the militant group that has ruled Gaza for 16 years.\n5:31am: Israel not planning to reoccupy Gaza, says minister of strategic affairs\nRon Dermer, Israel's Minister of Strategic Affairs and part of Netanyahu's war cabinet, told the BBC that Israeli forces would not reoccupy Gaza, but carry out security operations against anything they saw as a threat.\nIsrael withdrew its troops from the territory, which it captured in the 1967 Six-Day War, in 2005.\n5:14am: Doctors Without Borders employee killed, group says 'no place in Gaza is safe'\nAn employee of medical charity Doctors Without Borders (MSF) has been killed in Gaza along with several family members, the group said Tuesday.\nMohammed Al Ahel, a laboratory technician, was killed in his home in the Shati refugee camp when the area was bombed and his building collapsed, MSF said in a statement.\n\"Today, Doctors Without Borders/Medecins Sans Frontieres (MSF) is mourning the loss of one of our team members in Gaza, Mohammed Al Ahel, who was killed along with several members of his family on November 6,\" the medical charity said.\n\"It is clear that no place in Gaza is safe from brutal and indiscriminate bombing,\" it said.\n\"Our repeated calls for an immediate ceasefire have gone unanswered, but we insist that it is the only way to prevent more senseless deaths across Gaza and allow adequate humanitarian aid into the Strip,\" the charity said.\n5:03am: 40 Filipinos leave Gaza through Rafah crossing\nDozens of Filipinos fled from the war-ravaged Gaza Strip into Egypt through the Rafah crossing after Filipino diplomats negotiated for their safe passage and Qatar mediated for the border to be opened, Philippine President Ferdinand Marcos Jr. said Wednesday.\nThe 40 Filipinos were travelling to the Egyptian capital of Cairo, where they planned to take flights back to the Philippines, Marcos said in a video message in Manila. Two Filipino doctors managed to leave the Gaza Strip into Egypt last week.\n4:45am: House votes to censure Democratic Rep. for comments critical of Israel\nThe House voted late Tuesday to censure Democratic Rep. Rashida Tlaib of Michigan - the only Palestinian American in Congress - an extraordinary rebuke of her rhetoric about the Israel-Hamas war.\nThe 234-188 tally came after enough Democrats joined with Republicans to censure Tlaib, a punishment one step below expulsion from the House. The three-term congresswoman has long been a target of criticism for her views on the decades-long conflict in the Middle East.\n4:39am: G7 group tries to find common stance on war in Gaza\nThe Group of 7 leading industrial democracies worked to forge a unified stance on the Israel-Hamas war at intensive meetings in Tokyo on Wednesday, with US Secretary of State Antony Blinken and other senior diplomats looking to contain a worsening humanitarian crisis and stop a spillover of fighting into the wider Middle East.\nBlinken, who arrived in Tokyo after a whirlwind tour of the Middle East, said it's crucial to find a unified stance on the war in Israel, similar to what diplomats have done over Ukraine and other major issues. The ministers are also trying to keep existing differences on Gaza from deepening\nKey developments from Tuesday, November 7:\nPrime Minister Binyamin Netanyahu said on Tuesday that Israel's military was encircling Gaza City and operating inside it. Netanyahu also said his country will take \"overall security responsibility\" of the Gaza Strip for an indefinite period after its war with Hamas.\nIsraelis observed a minute of silence on Tuesday to mark a month since the October 7 attacks that saw Hamas militants slaughter 1,400 people, most of them civilians, and take more than 200 hostages to the Gaza Strip.\nThe International Committee of the Red Cross (ICRC) said a humanitarian convoy came under fire in Gaza City on Tuesday but was able to deliver medical supplies to Al Shifa hospital. Two trucks were damaged and a driver was lightly wounded, the organisation said.\nThe death toll in the Gaza Strip has risen to at least 10,328 people, including at least 4,237 children, the health ministry in the Hamas-run territory has said.\nRead our blog to see how yesterday's events unfolded.\n(FRANCE 24 with AFP, AP and Reuters)\nOriginally published on France24", "source_domain": "www.britainnews.net", "text": null, "title": "Some 50,000 Gazans flee south in a single day, Israeli army says", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274026894/some-50000-gazans-flee-south-in-a-single-day-israeli-army-says"}