{"authors": ["Aurora Bosotti"], "date_download": "2024-02-05 15:42:22", "date_modify": "None", "date_publish": "2023-11-11 09:01:00", "description": "Three of the US Armed Forces's branches have failed to meet their recruitment goals for 2023 despite extensive reform to entice more Gen Zs to sign up.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fus%2F1833901%2Fgen-z-armed-forces-recruitment-down-veterans-day.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/198/1200x712/5060682.jpg", "language": "en", "localpath": null, "maintext": "Nearly 75 percent of prospective voters would not enlist if the US entered a new war\nYounger generations of Americans are turning their backs on a life of service and are showing no interest in the Armed Forces, new data showed. Out of the US Defense Department's five branches, only two met their recruitment goals for the year – the Marine Corps and the Space Force, which already have the lightest target. The US Army, US Navy and US Air Force all fell short, in some cases by as little as one person - and that is despite an extensive reform campaign to attract more recruits in recent years. The Army and Air Forcefailed to meet their targets by approximately 10,000 and 2,700 recruits respectively. The Navy missed out by 6,000 - despite introducing record-high financial incentives of up to $140,000. Recruiters have lamented Covid pandemic as being partially to blame for the shortfall in recent years, citing their limited in-person presence on college and high school campuses. For all the latest on news, politics, sports, and showbiz from the USA, go to Daily Express US\nThe US Army missed out on its 2023 target by 10,000 recruits\nBut experts have now warned the health crisis represented the first setback in what is likely to be a long-term crisis as Gen Zs - those born between 1997 and 2012 - move further and further away from military life. Military recruitment specialist Katherine Kuzminski told Military.com: \"Being thrown off balance by COVID, I do think it threw them off their equilibrium. \"I think this was the last year that they could truly claim that inability to access students on high school and college campuses is what is throwing the overall recruiting environment. \"I think next year will be reflective of longer-term issues.\" An Echelon Insight poll of 1,029 likely voters found that 72 percent of respondents would not be willing to join the Armed Forces should the US be involved in a new conflict.\nThe Navy introduced up to $140,000 in financial incentives to woo potential enlistees\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nThe poll, conducted between October 23 and 26, came as President Joe Biden renewed his support for Israel in its war on Hamas following the attacks on civilians on October 7. Despite public opinion, and 2023's recruitment data, the Air Force claimed to have seen some positive signs that bode well for next year. The US Army saw some gains on previous years, a change attributed to the creation of the Future Soldier Preparatory Course which allows prospective recruits falling short on academic or body fat standards to hit compliance before heading off to boot camp. The National Guard, which became very familiar to Americans because of multiple back-to-back missions on domestic territory - including Covid, the George Floyd protests, and the Capitol Hill insurrection – missed out on its goals by five percent. The US Armed Forces switched to an all-volunteer force in 1973 and since then its branches have increased multiple bonuses and benefits in an effort to bring in new recruits.\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Gen Z turns back on service as US Armed Forces struggle to win over recruits", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/us/1833901/gen-z-armed-forces-recruitment-down-veterans-day"}