{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:42:23", "date_modify": "None", "date_publish": "2023-11-10 07:40:53", "description": "Gadot served in the Israeli Defense Forces before she became an actress.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fviolence-breaks-out-after-gal-gadot-holds-screening-film-based-hamas-attack-1721485.json", "image_url": "https://d.ibtimes.co.uk/en/full/1719945/gal-gadot.jpg", "language": "en", "localpath": null, "maintext": "On Thursday, several clashes broke out in Los Angeles, California outside the venue of the screening of a film based on the October 7 Hamas attack on Israel.\nAccording to local media reports, the screening, held at the Museum of Tolerance on Pico Boulevard, was organised by Hollywood actress Gal Gadot. However, she was not present at the event. The film \"Bearing Witness\" features \"extremely graphic and violent\" footage of the Hamas attack that left over 1,400 people dead.\nThe videos from the clashes have gone viral on social media, and show two groups fighting outside the venue. It is reported that around 200 people, including an Israel Defense Forces (IDF) officer, Israel's ambassador to the United Nations, and Hollywood executives, attended the screening.\nBREAKING:\nAnti-Israel protesters are physically attacking Jews attending a screening of the Oct. 7th Hamas Massacre organized by actress Gal Gadot at the Museum of Tolerance in Los Angeles.\n🇺🇸🇮🇱 pic.twitter.com/jCAQGPGbI0 — Visegrád 24 (@visegrad24) November 9, 2023\nGadot served the mandatory two-year military service in Israel before being cast in several movies and shows. It came as no surprise when she put out a post to condemn the Hamas attack soon after it happened. She has taken a stand for her country in the past as well.\nIn an Instagram post, she condemned the heinous attack and wrote: \"I stand with Israel, you should too. The world cannot sit on the fence when these horrific acts of terror are happening!\"\nHowever, she has not said anything yet about the air strikes in the Gaza Strip, which has affected civilians. She has also come under fire for not issuing a statement on the rising death toll in Gaza.\n\"Dystopian that Gal Gadot isn't even American but has been given a platform to spread Zionist propaganda in California and NYC while Bella Hadid who IS American is losing jobs in her own country,\" a Twitter user wrote.\nThe person was referring to media reports that claimed supermodel Bella Hadid had been replaced by Dior with an Israeli model because of her support for Palestine. Another user commented: \"Gal Gadot went from 'Imagine' to 'Genocide' pretty quick\".\n\"Not only could she not get any celebs to go to her event & had empty seats in the theater, Gal Gadot didn't even go to her own pro-genocide Zionist propaganda film viewing. I'm SCREAMING,\" wrote another.\nGadot is not the only one who has been vocal about her support for Israel. Last month, Oscar-winning filmmaker Quentin Tarantino also paid a visit to an Israeli base in an attempt to boost the Israel Defense Forces' morale.\nTarantino has been living in Tel Aviv since 2021. His Israeli musician wife, Daniella Pick, and their two children have all been living with him. The images posted on X show the filmmaker eating hummus in Har Hanegev and posing with Israeli soldiers.\nActors including Adam Sandler, Jennifer Garner, and Yara Shahidi condemned Hamas' horrific attack on Israel.\nA few celebrities also expressed support for Palestine. Professional boxer and model Youndes Bendijima and Swedish singer Zara Larsson took to Instagram to condemn the West for ignoring what led to the horrific attack.\nThe war between Israel and Hamas began after the militant group launched an unprecedented coordinated attack on Israel. It attacked Israel with a barrage of some 2,000–5,000 missiles on October 7.\nThe gunmen crossed the border by land, sea, and air, attacking the southern and central parts of Israel, including Tel Aviv and Jerusalem. In retaliation for the Hamas attacks, Israel's prime minister declared war against the militant outfit.\nIsrael occupied Gaza in the 1967 Six-Day War and returned it to the Palestinians in 2005. It later imposed an air, land, and sea blockade on Gaza. The blockade was imposed after Hamas came to power in Gaza in 2007. It is home to approximately 2.3 million Palestinians.\nMeanwhile, more than 10,000 Palestinians, including 4,104 children, have been killed in retaliatory Israeli strikes after the October 7 Hamas attack, according to the Gaza Health Ministry, which is also controlled by Hamas.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Violence Breaks Out After Gal Gadot Holds Screening Of Film Based On Hamas Attack", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/violence-breaks-out-after-gal-gadot-holds-screening-film-based-hamas-attack-1721485"}