{"authors": [], "date_download": "2024-02-05 15:42:23", "date_modify": "None", "date_publish": "2023-11-10 05:24:37", "description": "Jewish refugees from the war between Israel and Hamas are finding safety in an unused lakeside resort in the Hungarian countryside", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhungary-ap-jewish-israel-moscow-b2445051.html.json", "image_url": "https://static.independent.co.uk/2023/11/10/05/Hungary_Israel_Jewish_Refugees_25175.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nZusha Pletnyov left his home in the eastern Ukrainian city of Luhansk in 2014, when Russian-backed rebels seized large swaths of eastern Ukraine. After living some years in the capital, Kyiv, he fled again to Israel when Moscow launched its full-scale invasion in February of last year.\nAn observant Jew, Pletnyov moved with his wife and five children to Ashkelon, just miles from the Gaza Strip, in the hopes of building a new life. But when Hamas militants from Gaza launched their attacks last month, a new war forced him to take flight for a third time, now to a camp for Jewish refugees in rural Hungary.\n“Coming here for me and for my wife is such unimaginable relief,” said Pletnyov, whose apartment building in Ashkelon was hit by a Hamas rocket as the attacks began. “It’s a comforting place to be.”\nThe 34-year-old and his family are now living in a state-owned resort, disused for nearly two decades, on the shores of the sprawling Lake Balaton in western Hungary.\nFirst opened for Jewish Ukrainian refugees following Russia's invasion last year, it is now housing around 250 people including some 100 children, most of whom have arrived from Israel in the weeks since Hamas' Oct. 7 attack.\nThe camp is equipped with detached housing units and a central building where three kosher meals are served per day. The residents are provided with shelter and camaraderie, and can also engage in activities like sports and dancing, and may attend yeshiva for religious studies.\n“We make sure people are eating well, make sure they’re healthy, psychologically healthy, mentally healthy,” said Mandel Moscowitz, the rabbi of the camp, adding that the facility is open to all Jews, whether they be Orthodox, secular or non-observing.\n“They find their place here because we all share that we’re Jewish and we all share the refugee status that also brings everybody together,” he said.\nEva Kopolovich, 50, a psychotherapist from Shlomi on Israel's Lebanese border, was one of around 160,000 people evacuated from their homes in the north and south by Israeli Defense Forces after the Hamas attacks began. Born in Hungary where she spent the first four years of her life, she fled with her parents and 11-year-old son to Budapest before making their way to the camp.\nTwo weeks after arriving at the lakeside refuge, Kopolovich said she has taken comfort in being among other Jews who have shared her experiences in being uprooted from their lives.\n“We are in the same boat so we understand each other (regarding) stuff that people who are not in our position can never understand,” she said. “All of us went through a lot of stuff. I’m not even talking about the Ukrainians, who went from one war to another to another.”\nIndeed, many current residents of the camp arrived there after having earlier fled to Israel from Ukraine in the wake of Russia's war. Moscowitz, the rabbi, left his hometown of Kharkiv in eastern Ukraine when Russia launched its full-scale invasion.\nHe said his prior experiences of being displaced have helped him to better serve those who have sought refuge in the camp.\n“I know their needs, I feel their needs. I know what it’s like to run away from war,” he said. “Unfortunately, we’re having to experience a second war for our families. And thank God, thank God that there is a place where we could go to.”\nSlomo Koves, the chief rabbi for the Association of Hungarian Jewish Communities, said that more than 3,000 people have resided in the camp since the war in Ukraine began nearly 21 months ago.\nWhile he said he is “proud” of Hungary for providing a place of refuge for Jews who have been forced from their homes, the very need to do so has been hard to digest.\n“It’s a very sad situation that it has become a famous Jewish refugee camp,\" he said. “I would never have thought that such a thing would be needed in 21st-century Europe.”\nWhile some families that have stayed at the camp have already returned to Israel, many plan to stay for the next few months while waiting for the war to come to an end, Moscowitz said.\n“We’re hopeful that there will be peace in Ukraine and Israel and the world,” he said. “People want to live. People want to live in peace. Nobody’s interested in war.”\n___\nFind AP's war coverage at https://apnews.com/hub/israel-hamas-war", "source_domain": "www.independent.co.uk", "text": null, "title": "Jewish refugees from Israel find comfort and companionship in a countryside camp in Hungary", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hungary-ap-jewish-israel-moscow-b2445051.html"}