{"authors": ["Jen Smith", "Chief Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:42:24", "date_modify": "None", "date_publish": "2023-11-10 14:22:13", "description": "The officials, speaking at a screening of the Hamas atrocity at the Consulate in New York, made a public plea for 'two way' humanitarian aid to rescue the hostages while the world calls for a ceasefire.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12734519%2FIsraeli-officials-dont-know-Hamas-hostages-alive-call-two-way-humanitarianism-black-hole.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/10/14/76534513-0-A_Hamas_gunman_is_seen_carrying_a_distressed_infant_in_a_video_r-a-22_1699626219902.jpg", "language": "en", "localpath": null, "maintext": "Israeli officials last night made the grim admission that they do not know how many Hamas hostages are still alive after being taken underground a month ago.\nThe officials, speaking at a screening of the Hamas atrocity at the Consulate in New York, made a public plea for 'two way' humanitarian aid to rescue the hostages while the world calls for a ceasefire to save remaining Gazan civilians.\nLt. Commander Jonathan Conricus, speaking from Tel Aviv via Zoom, said of the 1.1million civilians in Gaza, between 850,000 and 900,000 have fled northern Gaza. Yesterday, 50,000 evacuated the region between 9am and 2pm, he said.\nThose figures have not been confirmed by Palestinian officials, who today said the civilian death toll is now at 11,000.\nMore than 200 hostages were taken from Israel by Hamas fighters on October 7. The youngest is a ten-month-old baby.\nHamas has released video footage of some of the hostages to serve as proof of life, and said last week they were 'ready' to allow some to return home after relentless airstrikes.\nScroll down for video\nA Hamas gunman is seen carrying a distressed infant in a video released on October 13. The youngest hostage is 10 months old\nSome of the 239 hostages taken by Hamas are shown in a video released by the militant group last month. Israeli officials say they have no confirmation of how many remain alive\nThe health of the majority of the hostages remains unknown.\n'We have some intelligence that we're not sharing but it's largely a black hole.\n'They have been split into groups but we don't know how. Hamas will not even give us their names.\n'There are 10 people who we still cannot say whether they have been killed or kidnapped because the bodies of those murdered are so badly burned,' Aviv Ezra, Acting Consul General of Israel in New York, said.\nIsrael is calling for the hostages to be freed in the four-hour, daily humanitarian pauses that were yesterday agreed upon.\n'Humanitarianism is a two-way street. We are not even being given the most basic information - the names of the hostages - but we are creating humanitarian pauses for Palestinian civilians and delivering aid.\n'Why can't the Red Cross go in and ensure our citizens have access to food, water, aid?' Itay Milner, spokesperson for the consulate in New York, said.\nIDF Lieutenant Commander Jonathan Conricus last night told journalists forces have 'exposed' 130 Hamas tunnels and continue to dismantle key strongholds\nTens of thousands of Palestinian civilians are fleeing north Gaza every day, according to IDF officials.\nOne fear is that as Hamas fighters become increasingly desperate under constant fire from Israel, they may use the hostages as human shields.\n'We have no doubt that if necessary, Hamas would hide behind our civilians, the hostages, if they needed to. They are hiding behind their own citizens. They are hiding under hospitals, schools, kindergartens, in boy scouts.\n'What we do know is that unless we continue to apply pressure, nothing will move,' Ezra added.\nTo his knowledge, there have been no ransom demands or negotiations in releasing the hostages.\nThe remarks were given after a screening of the 47-minute compilation of footage shown to reporters by Israel as part of an ongoing effort to remind the world of the attack that spurned the current conflict.\nDailyMail.com's recap of that footage can be read here.\nThe officials shared it, they said, to dismiss suggestions from some Palestine supporters that the atrocity did not happen.\n'There are still some who deny it. They want us to produce the body of a beheaded baby in order for them to believe it,' Lt. Commander Conricus said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli officials don't know how many Hamas hostages are still alive as they call for 'two-way humanitarianism': 'It's a black hole'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12734519/Israeli-officials-dont-know-Hamas-hostages-alive-call-two-way-humanitarianism-black-hole.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}