{"authors": ["Juliana Cruz Lima"], "date_download": "2024-02-05 15:42:26", "date_modify": "None", "date_publish": "2023-11-10 13:47:02", "description": "ISRAELI troops have wiped out one of Hamas' top commando units, the IDF has claimed.The terrorist group's elite Nukhba forces were the ones \"ordered t", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24693871%2Fisrael-hamas-nukhba-forces-eliminated-idf%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/newspress-collage-24693871-1699623947280.jpg?1699623957&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "ISRAELI troops have wiped out one of Hamas' top commando units, the IDF has claimed.\nThe terrorist group's elite Nukhba forces were the ones \"ordered to kill everyone and burn their homes\" in the October 7 massacre.\n7 Israeli ground troops claim they have wiped out the Nukhba elite forces Credit: AFP\n7 Nukhba forces were the ones ordered to kill everyone and burn their homes on the horror October 7 massacre Credit: AFP\n7 Nukhba, which means \"elite\", is the special forces unit within the Hamas military wing Credit: AFP - Getty\nA video released by the IDF shows a man's anonymous account of how gunmen were instructed to kill everyone they saw, including beheading victims and cutting off their legs, The Times of Israel reported.\n“The plan was to go from home to home, from room to room, to throw grenades and kill everyone, including women and children,” he said.\n“Hamas ordered us to crush their heads and cut them off, [and] to cut their legs.”\nNukhba, which means \"elite\", is the special forces unit within the Hamas military wing, Izz ad-Din al-Qassam Brigades, in the Gaza Strip.\nIts terror fighters are selected by senior Hamas operatives and tasked with carrying out ambushes, raids, and moving through tunnels to infiltrate areas in Israel.\nLittle is known about the group beyond its status as having a high level of training and reports from 2017 which said a number of its men abandoned its ranks to join the Islamic State.\nExperts familiar with Palestinian terror groups said Nukhba had similar levels of training to Hezbollah’s Radwan forces, which specialise in covert attacks on northern Israel at the border.\nDanny Citrinowicz, a senior Middle East analyst at the Atlantic Council told The Telegraph: “They’re commandos, same as the Radwan forces in Lebanon. They’re the same type of elite group and they got the assignment to break first and clear the way for the forces.\"\nThe IDF now says troops killed Ahmed Musa, a Nukhba company commander, and Amr Alhandi, a Nukhba platoon commander in a ground operation.\nThe terrorists were said to be holed up in Jabalia, The Times of Israel reports.\nMusa was reportedly one of the Hamas commanders who led the assault on the Zikim base, the nearby Kibbutz, and another army post in the area on October 7.\n“In recent days Ahmed Musa led offensive activity against IDF forces in the west Jabalia area,” the IDF said.\nThe Israel Defense Forces added troops also killed Muhammed Kahlout, the head of Hamas’s so-called sniper array in the terror group’s northern Gaza brigade.\nIt comes after Israel last month vowed to destroy Nukhba with a wave of strikes on the commando group.\n“Overnight, the IAF conducted a wave of strikes targeting the Nukhba elite forces of the Hamas terrorist organisation, by striking operational command centres used by operatives who infiltrated the communities surrounding the Gaza Strip last Saturday,” an IDF spokesman said.\nVideo footage released by the IDF showed a barracks-like structure being engulfed in a massive explosion.\nIt comes after an Israeli airstrike pounded Hamas' terror headquarters to clear civilians from a Gaza hospital.\nFootage appeared to show the scenes of despair near the Indonesian Hospital as Israel carries out \"pressure cooker\" bombings.\nSuch bombardment operations include steadily increasing fire on a building in which armed targets are holed up.\nUsing increasingly heavy weaponry, from more and more angles, the bombing keeps going until they either surrender or the building caves in on them.\nThe IDF has said it did not target the Indonesian Hospital, where there were reports of explosions yesterday.\n\"The IDF did not target the hospital,\" it said.\n\"The IDF does not target civilians and operates in accordance with international law.\"\n7 The ruined remains of a building in the kibbutz attacks on the deadly October 7 attacks Credit: AP\n7 Petrified festival goers ran for their lives as Hamas terrorists attacked hundreds on the same day Credit: TikTok\n7 Israel last month vowed to destroy Nukhba and its terror soldiers with a wave of strikes Credit: Rex", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israel wipes out Hamas commando unit ‘Elite’ who were ordered to ‘kill everyone & burn houses’ in October 7 massacre", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24693871/israel-hamas-nukhba-forces-eliminated-idf/"}