{"authors": [], "date_download": "2024-02-05 15:42:28", "date_modify": "None", "date_publish": "2023-11-10 22:56:59", "description": "Israel’s assault on Hamas has led to the deaths of dozens of journalists in Gaza. Press freedom groups fear ‘reckless’ allegations against reporters covering the crisis will put more at risk, Alex Woodward reports", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fgaza-journalists-death-toll-israel-b2445517.html.json", "image_url": "https://static.independent.co.uk/2023/11/10/21/06089ca204e14005aa61db3d631e1624.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe last month of Israel’s invasion of Gaza has been the deadliest yet for journalists in more than 30 years.\nRetaliatory strikes in the wake of Hamas attacks on 7 October have killed at least 35 Palestinian journalists and media workers, as of 10 November, marking the deadliest period for the press since the Committee to Protect Journalists began documenting the killing of journalists in 1992.\nWithin the past month, Gaza journalists have also reported violent threats, arrests and cyberattacks, while Israel’s ongoing bombardments have destroyed offices and homes, and food and water shortages and power and communications outages have compounded a growing humanitarian crisis in the region.\nThose attacks came into sharp relief this week when speculative claims from a group that monitors media outlets for critical coverage of Israel led several Israeli and US officials to suggest that journalists be killed.\nWhat press freedom watchdogs have warned is a disinformation campaign targeting journalists threatens to put them at even greater risk.\nThe report from the group HonestReporting asked whether photojournalists who captured the aftermath of the Hamas attack on 7 October coordinated with Hamas or were “part of the plan”; HonestReporting later conceded there was no evidence to defend those suggestions.\nBut in a letter to news outlets, Israel’s communications minister alleged that photojournalists whose work appeared in their pages were “participants in this horrifying event”. Israeli’s former defence minister and current minister without portfolio Benny Gantz suggested that if journalists knew of the attack beforehand, they are “no different than terrorists and should be treated as such.” Danny Danon, former Israeli ambassador to the United Nations, said “we will hunt them down together with the terrorists.”\nThe accusations and threats lobbed at some of the world’s biggest news organisations – including The New York Times, Associated Press, Reuters and CNN – were roundly condemned by press freedom groups and human rights watchdogs, as well as the outlets themselves, which have categorically denied the allegations.\n“The accusation that anyone at The New York Times had advance knowledge of the Hamas attacks or accompanied Hamas terrorists during the attacks is untrue and outrageous,” according to a statement from the company. “It is reckless to make such allegations, putting our journalists on the ground in Israel and Gaza at risk.”\nRelatives attend a funeral of Palestine TV journalist Mohamed Abu Hatab and several of his family members the day after they were killed in Gaza on 3 November. (AFP via Getty Images)\nRepublican US Senator Tom Cotton called on the US Department of Justice to investigate news outlets for “federal crimes by supporting Hamas terrorists.”\nA letter from general counsel with The New York Times warned that his reliance on “disinformation” and “falsehoods” should “not be abused by a US senator to falsely accuse fellow Americans of crimes.”\nHe has refused to retract his statements.\n“It’s absolutely reckless for a group calling itself ‘HonestReporting’ to insinuate that photojournalists who take pictures of atrocities are complicit in them,” Seth Stern, director of advocacy with the Freedom of the Press Foundation, told The Independent.\n“Despite HonestReporting’s recent backpedaling, it’s a virtual certainty that their irresponsible speculation will be cited to justify past and future violence against the press. They’ve put journalists’ lives at risk,” he added. “And it’s disgraceful for politicians … to cite the spurious report to call for violence against journalists and baseless investigations of news outlets.”\nThe Independent has requested comment and clarification from HonestReporting.\nPalestinians rally in the West Bank city of Nablus on 6 November to support journalists in Gaza. (AFP via Getty Images)\nGaza’s health ministry has reported more than 11,000 dead since Israel’s siege began, including more than 4,500 children. The White House believes “many, many thousands of Palestinians” have been killed. The US State Department says the death toll could be “even higher”.\nAmong the dead are at least 39 media workers, including 35 Palestinians, four Israelis and one Lebanese journalist, according to the Committee to Protect Journalists.\nThe organisation also has reported at least three missing journalists and 13 journalists who have been arrested.\nThere have also been multiple “assaults, threats, cyberattacks, censorship, and killings of family members” within the last month, according to the group’s research.\n“Nowhere is safe for journalists in the Gaza Strip,” according to Reporters Without Borders. “Whether they are out in the open, operating in press tents set up near hospitals, or in their homes or makeshift shelters with their family members, reporters in the Gaza Strip covering one of this century’s deadliest wars are in constant danger of death.”\nIn the immediate aftermath of Hamas attacks that killed hundreds in Israel on 7 October, at least three photojournalists were killed as they covered Israel’s response. At least other reporters were killed during an Israeli strike three days later. That night, another four journalists, including members of their families, were killed in their homes, according to Reporters Without Borders.\nThis month, Mohammad Abu Hassir with Palestinian National Authority’s Wafa press agency was reportedly killed in his home with several of his family members.\nPalestinian journalist shows reality of searching for water in Gaza\nPalestine TV correspondent Salman Bashir was on air earlier this month when he learned that a colleague, Mohammed Abu Hatab, was killed in a strike that reportedly destroyed his home. While reporting outside the hospital where his colleague and his family were pronounced dead, he ripped off his blue “press” vest and cried.\n“We are dying one after the other, and no one looks at us anymore,” he said into the camera. “We do not benefit from any protection, from any international protection. … These shields don’t protect us. They are merely slogans.”\nAbu Hatab’s wife, two of his sons and four of his daughters were killed in the strike, according to Mr Bashir.\nAt least 10 journalists killed in Gaza were killed while clearly covering the news, Reporters Without Borders found. More than 50 media premises have also been destroyed under Israeli strikes, the organisation reported.\nPress freedom advocates and human rights organisations have feared Israel is intentionally targeting journalists in its strikes, which Israel’s Defense Forces have denied.\n“The IDF does not purposefully target journalists, and takes measures to mitigate unintended harm to journalists and all civilians,” according to a statement. IDF concedes that “high intensity strikes” may “cause damage to surrounding buildings and areas.”\nLast month, Reuters videojournalist Issam Abdallah was killed in southern Lebanon during rocket strikes that injured six other journalists working for several agencies, including Agence France-Presse, Reuters and Al Jazeera.\nAccording to an investigation from Reporters Without Borders, the location was targeted by two strikes from the direction of Israel’s border.\n“One of their vehicles, marked ‘press,’ was targeted, and it was also clear that the group stationed next to it was journalists,” according to the report.\nCoverage in The Jerusalem Post, meanwhile, has accused Gaza journalists and “influencers” posting on social media of being “Hamas’s propaganda team”, coverage that has been widely condemned as inviting threats against them.\nHundreds of journalists have joined several international press associations to demand “an explicit commitment from Israel to end the violence against journalists and other civilians.”\nAn open letter from Columbia Journalism School has called on “belligerents in the war to take all responsible precautions to protect journalists and guarantee their freedom to report information without restriction or censorship.”\n“Journalists make up only a fraction of the total civilian casualties of this war but the number of journalists killed is shocking,” Mr Stern with the Freedom of the Press Foundation told The Independent. “The US government needs to do everything in its power to pressure its ally to stop targeting journalists, with either irresponsible rhetoric or bombs, and to protect press freedom.”", "source_domain": "www.independent.co.uk", "text": null, "title": "The ‘unprecedented’ death toll among Gaza’s journalists", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/gaza-journalists-death-toll-israel-b2445517.html"}