{"authors": ["Reporter", "Huffpost National Desk"], "date_download": "2024-02-05 15:14:37", "date_modify": "None", "date_publish": "2024-01-30 08:26:43", "description": "The United States has denounced calls for the Israeli resettlement of Gaza, but stopped short of saying it would imperil US aid to Israel.", "filename": "https%3A%2F%2Fwww.huffingtonpost.co.uk%2Fentry%2Fsenior-israeli-officials-speak-at-conference-on-resettling-gaza-strip_uk_65b8b220e4b077c17ab6489f.json", "image_url": "https://img.huffingtonpost.com/asset/65b7dc08240000590027fe8e.jpeg?ops=1200_630", "language": "en", "localpath": null, "maintext": "LOADING ERROR LOADING\nSenior Israeli government officials joined a conference on re-settling the Gaza Strip on Sunday, calling for Israelis to “control the land” despite the United States’ condemnations of similar proposals.\nIn 2005, Israel withdrew settlements and military forces from Gaza, and since then, some in Israel have advocated for re-settling the Strip. Hamas’ October 7 attack on Israel and Israel’s subsequent bombing and invasion of Gaza have heightened those calls.\nAdvertisement\nSenior US officials have condemned Israeli talk of “mass displacement” of Gazans and the “resettlement” of Gaza, but Vice President Kamala Harris, pressed by Katie Couric recently, refused to say that the United States would withhold aid to Israel if such policies were pursued.\n“We are troubled by statements from the conference in Jerusalem yesterday encouraging resettlement in Gaza, which was endorsed and attended by members of the Government of Israel. The US does not support an Israeli reoccupation of Gaza,” a spokesperson for the White House National Security Council said Monday of the conference.\n“We knew what that would bring, and we tried to prevent it,” Israel’s far-right finance minister Bezalel Smotrich said at Sunday’s conference, referring to the 2005 withdrawal, Reuters reported. “Without settlements, there is no security.”\nItamar Ben Gvir, the country’s national security minister, also a featured speaker, added separately: “If we don’t want another October 7, we need to go back home and control [Gaza]. We need to find a legal way to voluntarily emigrate [Palestinians] and impose death sentences on terrorists,” Haaretz reported.\nAdvertisement\nThe Times of Israel reported that in all, 12 Israeli cabinet ministers and 15 additional members of the Israeli Knesset who are part of Israel’s governing coalition attended the conference. (Axios reported 18 coalition lawmakers attended.) The event was entitled “Conference for the Victory of Israel - Settlement Brings Security: Returning to the Gaza Strip and Northern Samaria.” Samaria, in this context, is a reference to the northern West Bank, where some Israeli settlements were also evacuated in 2005. Thousands of people reportedly attended Sunday’s conference.\nThere have been numerous calls from high-ranking Israelis for so-called “voluntary” migration from Gaza, including from Smotrich and Ben Gvir but also Communications Minister Shlomo Karhi, who is a member of Israeli Prime Minister Benjamin Netanyahu’s Likud party.\nOn Sunday, Karhi reiterated past comments, telling the conference that in war, “‘voluntary’ is at times a state you impose [on someone] until they give their consent.’”\nNetanyahu has not himself joined calls for the Israeli re-settlement of Gaza, though he has reportedly said his government was “working on” finding countries willing to absorb Gazans. Some Israeli troops in Gaza are engaged in a campaign to demolish buildings close to the boundary between Israel and the Strip to create a “buffer zone” within Gaza. Twenty-one Israeli soldiers were killed last week while laying explosives to demolish Palestinian buildings, reportedly during a firefight with Palestinian militants.\nNetanyahu also said earlier this month, “In any future arrangement … Israel needs security control of all territory west of the Jordan [River],” which includes both the West Bank and Gaza Strip.\nAdvertisement\nSouth Africa, in its case before the International Court of Justice (ICJ) accusing Israel of genocide, alleged that Netanyahu’s government risked a repeat of the 1948 “Nakba,” in which the establishment of the state of Israel led to the violent displacement of hundreds of thousands of Palestinians from their ancestral homes.\n“The forced displacements in Gaza are genocidal, in that they are taking place in circumstances calculated to bring about the physical destruction of Palestinians in Gaza,” South Africa’s application to the ICJ read, after referencing the widespread destruction of housing stock in Gaza. The document added later: “A forced displacement beyond Palestinian land, reminiscent of the 1948 Nakba, must be prevented.” The court subsequently recognised the risk of genocide in the Strip and ordered Israel to prevent its military from committing acts of genocide in Gaza.\nAsked on Saturday about Sunday’s conference, Netanyahu said members of his government slated to attend were “entitled to their opinions” but that his position on re-settling the Strip “has not changed,” Haaretz reported. Opposition leader Yair Lapid said the conference showed that Netanyahu and the Likud party had been “dragged aimlessly after extremists.”", "source_domain": "www.huffingtonpost.co.uk", "text": null, "title": "Senior Israeli Officials Speak At Conference On Resettling Gaza Strip", "title_page": null, "title_rss": null, "url": "https://www.huffingtonpost.co.uk/entry/senior-israeli-officials-speak-at-conference-on-resettling-gaza-strip_uk_65b8b220e4b077c17ab6489f"}