{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:16:32", "date_modify": "None", "date_publish": "2024-01-22 22:15:49", "description": "Joe Biden on Monday authorized the strikes against the Iranian-backed Houthis, in Yemen. The rebels have since November been attacking Red Sea shipping, disrupting vital trade.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12993791%2FUS-UK-launch-joint-strikes-against-Houthi-targets-Yemen-second-time-Fighter-jets-warships-submarines-pound-missile-launch-facilities-country-retaliation-Iran-backed-militias-Red-Sea-ship-attacks.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/23/05/80335025-0-image-a-85_1705989579708.jpg", "language": "en", "localpath": null, "maintext": "The Pentagon on Monday night revealed that eight targets in Yemen had been hit by joint U.S.-U.K. airstrikes, saying the sites were chosen to 'degrade Houthi capability to continue their reckless and unlawful attacks' on shipping.\nU.S. Central Command said the eight targets 'included missile systems and launchers, air defense systems, radars, and deeply buried weapons storage facilities.'\nThe sites are believed to be in the capital, Sanaa; at a nearby military base, al-Dailami; near the highland city of Taizz; and in Bayda province.\nThe strikes were successful and had 'good impacts' on targets, a U.S. official told CBS News.\nThe official said it was unknown if there were any casualties among the Houthis. Military planners have been extremely careful to try and hit only rebel-held military sites.\nThe strikes were launched from air, surface and subsurface platforms as part of 'Operation Poseidon Archer'.\nThey included Tomahawk land attack missiles as well as manned aircraft from the U.S.S. Eisenhower, the official told CBS.\nThe underground storage facilities contained more advanced weaponry than previously targeted sites, the official added.\nU.S. fighter jets are pictured on Monday evening taking off to bomb a series of Houthi targets\nA crew member on board the aircraft carrier is seen on Monday night readying the plane for takeoff, to bomb the Houthi targets in Yemen\nThe sites of the January 11 airstrikes are pictured. It is not yet clear which eight targets were hit on Monday\nA fighter jet is seen accelerating down the runway on the aircraft carrier on Monday night\nThe fighter jets are seen taking off from the aircraft carrier on Monday night, bound for Yemen\nAn Airborne Warning & Control System (AWACS) aircraft is seen readying to take off in support of Monday's mission. The AWACS will be used to direct the attacks from above\nU.S. officials also said the Houthis still 'remain capable' of conducting attacks against shipping but this and previous strikes have 'definitely degraded their ability to conduct maritime attacks.'\nMonday's coordinated action was the second round of strikes launched by Washington and London. Australia, Bahrain, Canada and the Netherlands were also involved.\nThe attacks were the eighth launched by the U.S., but only the second joint effort. The first joint strikes were on January 11.\nU.S. Central Command said the strikes, on eight targets, were 'intended to degrade Houthi capability to continue their reckless and unlawful attacks on U.S. and U.K. ships as well as international commercial shipping in the Red Sea, Bab Al-Mandeb Strait, and the Gulf of Aden.'\nThe strikes were ordered by Joe Biden and the British prime minister, Rishi Sunak, after the two spoke on the phone earlier in the day, the White House confirmed.\nHouthi rebels are pictured on Monday at a tribal rally near Sanaa, in Yemen\nHouthi supporters are seen on Monday at a rally in support of Palestine. The rebels began their attacks on shipping in a show of support for Gazans being bombed by Israel\nA Houthi fighter manning a machine gun mounted on a vehicle during a tribal parade held on Monday against the United States-led aerial attacks launched on sites in Yemen\nU.S. Central Command statement As part of ongoing international efforts to respond to increased Houthi destabilizing and illegal activities in the region, on Jan. 22 at approximately 11:59 p.m. (Sanaa / Yemen time), U.S. Central Command forces alongside UK Armed Forces, and with the support from Australia, Bahrain, Canada, and the Netherlands, conducted strikes on 8 Houthi targets in Iranian-backed Houthi terrorist-controlled areas of Yemen. These strikes from this multilateral coalition targeted areas in Houthi-controlled Yemen used to attack international merchant vessels and U.S. Navy ships in the region. The targets included missile systems and launchers, air defense systems, radars, and deeply buried weapons storage facilities. These strikes are intended to degrade Houthi capability to continue their reckless and unlawful attacks on U.S. and U.K. ships as well as international commercial shipping in the Red Sea, Bab Al-Mandeb Strait, and the Gulf of Aden. These strikes are separate and distinct from the multinational freedom of navigation actions performed under Operation Prosperity Guardian. Advertisement\nU.S. fighter jets from the carrier USS Eisenhower were reported to be involved in Monday's strikes, but it was not known what the targets were.\nCBS News reported that targets included Houthi-operated radars.\nFox reported that the targets included Al Dailami Air Base, along with missile launching sites and weapons storage facilities for ballistic missiles and drones.\nThe Houthis, who control the most populous parts of Yemen, have claimed their attacks are in solidarity with Palestinians under attack from Israel in Gaza.\nIn the past, the United States and British forces have mainly hit Houthi missiles and radar sites.\nThe January 11 attacks targeted just under 30 locations with 150 different weapons, CBS reported.\nA U.S. official previously told CBS News that the initial strikes, on January 11, destroyed enough of the Houthis' air defense capabilities to allow surveillance of their territory, and make it possible to see what the Houthis are preparing.\nThe White House said Biden and Sunak on Monday 'discussed ongoing Iranian-backed Houthi attacks against merchant and naval vessels transiting the Red Sea'.\nThey reiterated 'their commitment to freedom of navigation, international commerce, and defending mariners from illegal and unjustifiable attacks', the White House said.\nIt added: 'The president and prime minister discussed the importance of increasing humanitarian aid and civilian protections for people in Gaza, and securing the release of hostages held by Hamas.'\nThe Houthi attacks have disrupted global shipping and stoked fears of global inflation.\nThey have also deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East.\nThe Houthis, which control the west of the country, centered around Sanaa, have caused chaos in international shipping\nBut multiple U.S. strikes over the past month have failed to stop Houthi attacks against shipping.\nContainer vessels have been pausing or diverting from the Red Sea that leads to the Suez Canal, the fastest freight route from Asia to Europe.\nMany ships have been forced to take the longer route via the Cape of Good Hope instead.\nThe Houthis have not been able to successfully launch an attack since January 18, but they have made multiple attempts.\nIn two cases over the weekend, the U.S. struck Houthi missiles as the missiles were being prepared to launch, according to statements from U.S. Central Command.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pentagon reveals eight targets - including an underground Houthi bunker and missiles sites - were hit by second joint US and UK airstrike mission on targets in Yemen, in retaliation for Iran-backed mi", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12993791/US-UK-launch-joint-strikes-against-Houthi-targets-Yemen-second-time-Fighter-jets-warships-submarines-pound-missile-launch-facilities-country-retaliation-Iran-backed-militias-Red-Sea-ship-attacks.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}