{"authors": [], "date_download": "2024-02-05 15:42:31", "date_modify": "None", "date_publish": "2023-11-10 12:00:04", "description": "Nine of 12 members of the commission charged with avoiding nuclear conflict have financial ties to defense contractors", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F10%2Fus-congress-nuclear-weapon-committee-conflict-interest.json", "image_url": "https://i.guim.co.uk/img/media/e965d6a8bf2435ac9abe75de0223db824a3741bb/0_186_5568_3341/master/5568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=28cccf3d439a9864d5a74ac209350c8e", "language": "en", "localpath": null, "maintext": "Nine of the 12 members of a high-level congressional commission charged with advising on the US’s nuclear weapons strategy have direct financial ties to contractors that would benefit from the report’s recommendations or are employed at thinktanks that receive considerable funding from weapons manufacturers, the Guardian and Responsible Statecraft can reveal.\nWhile the Congressional Commission on the Strategic Posture of the United States (CCSPUS) purports to recommend steps to avoid nuclear conflict, it does nothing to disclose its own potential conflicts of interest with the weapons industry in its final report or at rollout events at thinktanks in Washington.\nThe United States will soon face “a world where two nations [China and Russia] possess nuclear arsenals on par with our own”, warned the commission’s final report, released in mid-October. “In addition,” the report charged, “the risk of conflict with these two nuclear peers is increasing. It is an existential challenge for which the United States is ill-prepared.”\nAccording to the CCSPUS, this potential doomsday scenario requires the US to make “necessary adjustments to the posture of US nuclear capabilities – in size and/or composition”, a policy shift that would steer billions of taxpayer dollars to the Pentagon and nuclear weapons contractors.\nWe cannot make serious decisions about our security when the industry is buying influence through thinktanks and commissioners Susi Snyder of the International Campaign to Abolish Nuclear Weapons\n“What we’ve consistently seen is the nuclear weapons industry buying influence and that means we cannot make serious decisions about our security when the industry is buying influence through thinktanks and commissioners that are skewing the debate,” said Susi Snyder, program coordinator at the International Campaign to Abolish Nuclear Weapons.\n“Instead of having a debate about the tools and materials we need to make ourselves safe,” she added, “we’re having a debate about which company should get the contracts. And that doesn’t make the American people safe or anyone else in the world.”\nThe CCSPUS was established two years ago via the annual defense policy bill, and conflicts of interest on the commission were apparent from the beginning. But an analysis by the Guardian and Responsible Statecraft found deep ties between the commission and the weapons industry.\nThe most recognizable member of the CCSPUS is its vice-chair, Jon Kyl, who served as a senator from Arizona from 1995 to 2013, and again in 2018 after the death of John McCain. While this is included in his biography in the commission’s report, what’s left out is his more recent employment as a senior adviser with the law firm Covington & Burling, whose lobbying client list includes multiple Pentagon contractors that would benefit from the commission’s recommendations.\nIn 2017 Kyl, personally, was registered to lobby for Northrop Grumman, which manufactures the B-21 nuclear bomber that the commission recommends the US should purchase in greater numbers, at a cost to taxpayers of nearly $700m each.\nKyl did not respond to questions about his employment status with Covington & Burling, but the former senator was listed as a “senior adviser” on the firm’s website until at least 1 December 2022, nearly 10 months after the commissioner selections for the CCSPUS were announced in March 2022.\nView image in fullscreen The CCSPUS vice-chair Jon Kyl, pictured in 2018. Photograph: Jonathan Ernst/Reuters\nAnother commissioner, Franklin Miller, is a principal at the Scowcroft Group, a business advisory firm that describes Miller as having expertise in “nuclear deterrence”, and acknowledges its work in the weapons sector.\n“The Scowcroft Group successfully advised a European defense leader on a strategic acquisition opportunity,” says the consulting firm in the “Defense/Aerospace” section of its website. “We have also assisted a major defense firm in pursuing global partnerships and co-production opportunities.”\nMiller did not respond to a request for comment about the identity of the Scowcroft Group’s clients.\nKyl and Miller are joined on the CCSPUS by retired general John E Hyten, who previously served as the vice-chairman of the joint chiefs of staff, the second-highest-ranking member of the US military.\nWhile Hyten’s biography in the commission’s report lauds his extensive military service, in retirement he has worked closely with a number of firms that could benefit immensely from the commission’s recommendations.\nThis March he was appointed as special adviser to the CEO of C3 AI, an artificial intelligence company that boasts of working with numerous agencies at the Department of Defense. In June 2022, Hyten was named executive director of the Blue Origins foundation, called the Club for the Future, and as a strategic adviser to Blue Origin’s senior leadership. Blue Origin is wholly owned by the Amazon founder Jeff Bezos, and works directly with the National Aeronautics and Space Administration (Nasa), the air force and the space force on space launch-related capabilities.\nHyten’s ties to these firms are notable given the CCSPUS report’s repeated overtures for improving and investing in space and artificial intelligence capabilities. Specifically, the report recommends the United States “urgently deploy a more resilient space architecture” and take steps to ensure it is “at the cutting edge of emerging technologies – such as big data analytics, quantum computing, and artificial intelligence (AI)”.\nHyten did not respond to a request for comment.\nThe CCSPUS also included thinktank scholars whose employers receive significant funding from the arms industry. Two commission members work at the Hudson Institute, which, according to its most recent annual report, received in excess of $500,000 from Pentagon contractors in 2022. This includes six-figure donations from some of the Pentagon’s top contractors, including Lockheed Martin, Northrop Grumman and BAE Systems.\nOn Monday, 23 October, the Hudson Institute held an event to highlight the CCSPUS’s report that included the two Hudson Institute employees who also served as commissioners. The event unabashedly promoted recommendations from the report that would be a financial windfall for Hudson’s funders. The landing page for the event features a photo of a B-21 stealth bomber, the same photo used in the commission report that also recommended that the US strategic nuclear posture be modified to “increase the planned number of B-21 bombers and tankers an expanded force would require”.\nNeither at the event nor in the report is it noted that the plane’s manufacturer, Northrop Grumman, is in the Hudson Institute’s highest donor tier, contributing in excess of $100,000 in 2022.\nView image in fullscreen Former vice-chair of the joint chiefs of staff John E Hyten is on the CCSPUS as well as the executive director of the Club for the Future, the Blue Origins foundation. Photograph: Andrew Harnik/AP\nThe Hudson Institute staff who served as commissioners did not respond to requests for comment.\nAnother commissioner, Matthew Kroenig, is a vice-president at the Atlantic Council, a prominent DC thinktank which, according to the organization’s most recent annual report, is funded by several top Pentagon contractors, including Lockheed Martin, Northrop Grumman, Raytheon (now RTX), General Atomics, Saab and GM Defense. The Atlantic Council also receives more than $1m a year directly from the Department of Defense and between $250,000 and $499,999 from the Department of Energy, which helps manage the nation’s nuclear arsenal.\nThese seeming conflicts of interest were not mentioned at any point in the CCSPUS’s report or at an Atlantic Council event promoting the report and featuring the same photo of the B-21 used by the Hudson Institute and the commission.\nKroenig did not respond to a request for comment.\nEven commissioners whose careers had included positions that were notably critical of nuclear weapons had recently established ties with firms that profit from the nuclear and conventional weapons industry.\nCommissioner Lisa Gordon-Hagerty worked for years at the pinnacle of nuclear weapons policy in the US, including positions on the national security council, the US House of Representatives and the Department of Energy. She was also the director of the Federation of American Scientists, a non-profit organization known for advocating for reductions in nuclear weapons globally. Her last government position before joining the commission was serving as the head of the National Nuclear Security Administration (NNSA), which is responsible for military applications of nuclear science. She resigned from the post in 2020, allegedly after heated disagreements with the secretary of energy, who tried to cut NNSA funding.\nWhile much of her career is mentioned in the commission report, what’s left out is that Gordon-Hagerty has also been cashing in on her nuclear expertise. After leaving the NNSA, in 2021 she joined the board and became director of strategic programs at Westinghouse Government Services, a nuclear weapons contractor that has been paid hundreds of millions of dollars for work with the Department of Defense and Department of Energy.\nGordon-Hagerty did not respond to a request for comment.\nLike Gordon-Hagerty, fellow commissioner Leonor Tomero had a distinguished career at the highest levels of nuclear weapons policy. According to her bio in the commission report, she was the deputy assistant secretary of defense for nuclear and missile defense policy and served for over a decade on the House armed services committee as counsel and strategic forces subcommittee staff lead, where her portfolio included the establishment of the US space force, nuclear weapons, nuclear nonproliferation, nuclear cleanup, arms control and missile defense.\nOutside government, Tomero was director of nuclear non-proliferation at the Center for Arms Control and Non-Proliferation, an organization that has repeatedly called for reductions in the US nuclear weapons arsenal. Tomero is also on the board of the Council for a Livable World, which explicitly states that its goal is to eliminate nuclear weapons.\nYet, in September, Tomero became a vice-president of government relations at JA Green & Company, a lobbying firm whose client list includes a host of military contractors that could see revenues soar if the CCSPUS’s recommendations are adopted. SpaceX, for example – which pays $50,000 every three months to JA Green for lobbying related to “issues related to national security space launch” – would probably benefit mightily from the commission recommendation that “the United States urgently deploy a more resilient space architecture and adopt a strategy that includes both offensive and defensive elements to ensure US access to and operations in space”.\n“No clients of JA Green & Company sought to influence the work of the Commission or the Commission’s recommendations in any way,” said Jeffrey A Green, president of JA Green, in an email. “We follow all applicable ethics rules and there are no conflicts of interest.”\nNone of the potential conflicts of interest between commissioners’ financial interests and the policy proposals laid out in their final report were disclosed by the CCSPUS itself within its final report or at any public event highlighting its findings.\nWhile many commissioners did not respond to requests for comment, the commission’s executive director, William A Chambers, provided a statement on behalf of the CCSPUS and its members.\n“Members of [the commission] were chosen and appointed by Members of Congress based on their national recognition and significant depth of experience in such professions as governmental service, law enforcement, the Armed Forces, law, public administration, intelligence gathering, commerce, or foreign affairs,” wrote Chambers. “Before they began performing their role as Commissioners, they were instructed on the ethics rules that govern congressional entities and were required to comply with rules set forth by the Select Committee on Ethics of the Senate and the Committee on Ethics of the House of Representatives.”\nChambers did not respond to a request for a copy of the ethics rules.\nBut the opacity about potential conflicts of interest leaves some experts questioning the CCSPUS’s recommendations.\n“There’s a huge argument raging over what is security, how much does it rely on transparency and, especially when it comes to nuclear weapons, there is a call for greater transparency,” said Snyder of the International Campaign to Abolish Nuclear Weapons. “That light they’re asking to shine on China, North Korea and Iran is a light they also need to shine on their own decision-making.”\nCo-published with Responsible Statecraft", "source_domain": "www.theguardian.com", "text": null, "title": "‘Buying influence’: top US nuclear board advisers are tied to arms business", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/10/us-congress-nuclear-weapon-committee-conflict-interest"}