{"authors": ["Ben Farmer"], "date_download": "2024-02-05 15:42:32", "date_modify": "None", "date_publish": "2023-11-10 00:00:00", "description": "Strikes have damaged the al-Shifa hospital, killing at least one person and wounding others", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F11%2F10%2Fisrael-strikes-gaza-al-shifa-hospital%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/11/10/TELEMMGLPICT000356189136_16996269079710_trans_NvBQzQNjv4BqyuLFFzXshuGqnr8zPdDWXhbQKbwj1ZsnNMhuR7O6ySI.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Israeli strikes have hit Gaza’s largest hospital while tanks surrounded others, Palestinian officials say, as intense fighting continues.\nPalestinian officials said on Friday that overnight strikes hit al-Shifa hospital, killing at least one person and wounding others. The Indonesian Hospital was also damaged, and the Rantissi Hospital was set ablaze.\n“Israel is now launching a war on Gaza City hospitals, on Rantissi, Nasser hospitals and on al-Shifa,” Mohammad Abu Selmeyah, the director of al-Shifa hospital, told Reuters.\nA UK-based medical charity working in the Strip warned the enclave’s hospitals were now at risk of a full-scale military assault as Israel continued its ground offensive to wipe out Hamas.\nBoth the al-Shifa and Rantissi hospitals were under bombardment on Friday, the World Health Organisation said. But the organisation did not attribute blame.\nIsrael has vowed to eradicate Hamas in the besieged Strip after gunmen stormed into southern Israel on Oct 7, killing 1,400 people and taking more than 200 hostages.\nMore than 11,000 people in Gaza have been killed as the Israel Defense Forces have pushed into Gaza under the cover of heavy bombardment, according to Gaza’s Hamas-run health ministry.\nUsing civilian institutions to hide\nIsrael’s military has long accused Hamas of using civilian institutions as cover for military bases, and has alleged some of the group’s main command posts are beneath al-Shifa, which Hamas denies.\n“While the world sees neighbourhoods with schools, hospitals, scout groups, children’s playgrounds and mosques, Hamas sees an opportunity to exploit,” the Israeli military said.\nMelanie Ward, the chief executive of Medical Aid for Palestinians, said: “Without urgent action from the international community, including the UK government, Gaza’s hospitals remain at serious and imminent risk of full-scale military attacks.\n“Palestinian civilians and healthcare must be protected, and Israel must cease its attacks on hospitals now.”\nIsraeli tanks, which have been advancing through northern Gaza for almost two weeks, had taken up positions around the Rantissi, al-Quds and Nasser Children’s hospitals, medical staff said.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Gaza's largest hospital hit by Israeli strikes", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/11/10/israel-strikes-gaza-al-shifa-hospital/"}