{"authors": ["Paul Withers"], "date_download": "2024-02-05 15:42:40", "date_modify": "None", "date_publish": "2023-11-10 16:15:00", "description": "Hamas militants are resorting to shocking tactics, one Israeli soldier has claimed, as both sides prepare for a bloody battle in Gaza.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1833753%2Fhamas-militants-israeli-army-uniforms-disguise-gaza.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5059948.jpg", "language": "en", "localpath": null, "maintext": "IDF fighter jet launches airstrike at alleged Hamas target\nHamas militants are reportedly resorting to horrifying tactics to get the upper hand against Israel\n\"I had to after I saw what happened on October 7. This is not out of vengeance, it is for my people, my family. I heard about Lebanon, Syria, Iran getting involved and I thought 'hold on, it’s World War 3 here'.\" But the soldier made a stunning claim about the horrifying lengths Hamas militants are willing to go to gain the upper hand on Israel. He continued: \"Hamas wear IDF uniforms taken from our soldiers and pretend to be us; they wear civilian clothes. It’s a tactic they use. \"Then you see a rocket-propelled grenade on their shoulders. They did the same on October 7. They killed police and then wore the uniforms to stop cars. They shot at the traffic jams to kill people.\"\nIsraeli forces have launched several retaliatory airstrikes against Hamas in Gaza City\nBarack, a commander with 25 years’ experience, cancelled his honeymoon to fight in Gaza, and said: \"Hamas is a terrorist organisation. Most of the time they hide behind civilians. \"They produce weaponry in tunnels below Gaza, rockets, everything. Behind hospitals, clinics, schools. We are real soldiers. We don’t fight civilians, there is a moral code.\" The 45-year-old history teacher added: \"We must be smart. They are fighting in territory they know well. They use drones, they come out from underground. They’ve been preparing a long time.” When asked about Hamas leader Yahya Sinwar, who masterminded the October 7 attacks, he said: \"We hope to catch the bad guy and finish it, like a good American movie.\"\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nBenjamin Netanyahu flat-out rejected the possibility of a ceasefire with Hamas\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Hamas militants 'wearing Israeli army uniforms to disguise themselves'", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1833753/hamas-militants-israeli-army-uniforms-disguise-gaza"}