{"authors": ["David Averre"], "date_download": "2024-02-05 15:42:41", "date_modify": "None", "date_publish": "2023-11-10 12:24:26", "description": "'Due to the increasing intensity of the war against the civilian residents of Gaza, the expansion of the scope of the war has now become inevitable', Iranian foreign minister Hossein Amir-Abdollahian said", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12734217%2FIran-warns-expansion-Israel-Hamas-war-inevitable.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/10/12/77646517-0-image-a-50_1699617904821.jpg", "language": "en", "localpath": null, "maintext": "Iran has warned that the expansion of the Israel-Hamas war across the Middle East is 'inevitable', claiming Tel-Aviv's aggression in Gaza will be the catalyst for more widespread violence.\n'Due to the increasing intensity of the war against the civilian residents of Gaza, the expansion of the scope of the war has now become inevitable', Iranian foreign minister Hossein Amir-Abdollahian said to his Qatari counterpart, Sheikh Mohammed bin Abdulrahman Al Thani in a phone call.\nHis comments, which were reported on the ministry's website, compound fears among some analysts that the violence in Gaza could trigger a wider regional conflict.\nOn October 7, Hamas gunmen stormed across the heavily militarised border from the Gaza Strip to kill more than 1,400 people in southern Israel. Most were civilians. The militants also seized around 240 hostages, according to Israeli officials.\nVowing to destroy Hamas, Israel retaliated with an aerial bombing and ground offensive that the health ministry in the Hamas-run Gaza Strip says has killed more than 10,800 people, two-thirds of them women and children.\nNow, Israel has agreed to daily four-hour pauses in the fighting and has established evacuation corridors for fleeing Gazans as the IDF conducts on-the-ground operations designed to root out Hamas.\nBut Palestinian authorities maintain Israeli airstrikes are killing so many civilians that hospitals and morgues are overwhelmed, making the normal rituals of death all but impossible.\nOvercrowded cemeteries have meant families have had to dig up long-buried bodies and deepen the holes, and overflowing morgues have compelled hospitals to bury people before their relatives can claim them.\nSmoke rises following an Israeli airstrike on the northern Gaza Strip, 09 November 2023\nIDF soldiers operate in Gaza\nIsraeli soldiers walk through rubble, amid the ongoing ground invasion against Palestinian Islamist group Hamas in the northern Gaza Strip, November 8, 2023\n'Due to the increasing intensity of the war against the civilian residents of Gaza, the expansion of the scope of the war has now become inevitable', Iranian foreign minister Hossein Amir-Abdollahian (right) said (Iranian supreme leader Ali Khamenei left)\nPeople follow the speech of Hezbollah Secretary General Hassan Nasrallah on the Israel-Hamas conflict on a screen set up at Imam Hossein Square in Tehran, Iran on November 3, 2023\nMany in the international community have called on Israel to reduce the intensity of its attacks on Gaza, with the UN today calling for an end to the carnage of Israel's military campaign.\n'The present course chosen by the Israeli authorities will not bring the peace and stability that both Israelis and Palestinians want and deserve,' Philippe Lazzarini, head of the United Nations' agency for Palestinian refugees (UNRWA), wrote in a media opinion piece. 'The carnage simply must stop.'\nMeanwhile, Iran - which supports Hamas financially and militarily - has hailed the militant group's attack on Israel as a 'success' - though it has denied any involvement.\nPresident Ebrahim Raisi has said Iran sees it as 'its duty to support the resistance groups' but insisted that they act independently.\nTehran also backs the Lebanese movement Hezbollah, whose militants and allies have skirmished with Israeli forces along their border in deadly clashes since the Israel-Hamas war began.\nIn a sign of escalating regional tensions, a series of rocket and drone attacks have also targeted military bases hosting US and other forces in an anti-jihadist coalition in Iraq and Syria.\nA group known as 'Islamic Resistance in Iraq' has claimed most of those attacks, which Washington has linked back to Iran.\nThe United States has sent two aircraft carrier groups to the eastern Mediterranean as part of efforts it says aim to deter a wider war.\nRaisi will join Arab leaders in the Saudi capital on Saturday for summits expected to underscore demands that Israel's attacks on Gaza end before the violence draws in other countries.\nIran does not recognise Israel and has made support for the Palestinian cause a centrepiece of its foreign policy since the 1979 Islamic Revolution, all while training and financing several proxy groups in the Middle East.\nThis picture taken from the Israeli side of the border with the Gaza Strip on November 10, 2023 shows billowing smoke following the Israeli bombardment of the Gaza Strip, amid ongoing battles between Israel and the Palestinian Hamas movement\nCivil defense teams and citizens continue search and rescue operations as Israeli attacks continue on the 35th day, in Rafah, Gaza on November 10, 2023\nRoads, vehicles and buildings are severely damaged after Israeli forces raid Jenin Camp in Jenin, West Bank on November 09, 2023\nHezbollah, based in Lebanon, has in recent years emerged as a potent regional force, boasting a multifaceted arsenal and diverse military capabilities that pose a considerable threat to Israel.\nThe Lebanese political and military group emerged in the early 1980s as a response to the Israeli invasion of Lebanon and officially announced its existence in 1985 with the release of its first manifesto.\nInitially the group was a large but informal conglomeration of Shia Muslims in Lebanon who were spurred on by Iran's Islamic Revolution in the 1970s, which culminated in the overthrow of the Shah and the establishment of the Islamic Republic by Supreme Leader Ruhollah Khomeini.\nTehran, seeing the potential to turn the rebelling Shia group into a fearsome ally, instructed the Islamic Revolutionary Guard Corps to instruct, train and finance them.\nThe Iranian connection has remained a defining aspect of Hezbollah's identity, and the nature of the group's multifaceted setup as a political party and armed militia allow it to wield considerable influence.\nIn addition to the array of small arms, machine guns and tens if not hundreds of thousands of rockets at its disposal, Hezbollah boasts a range of anti-tank and anti-air systems, a fleet of thousands of drones, and dozens of tanks and armoured vehicles.\nHamas was not initially founded or financed by Iran, but Tehran through the 1990s sought to cultivate Hamas as a strategic ally.\nThough religious differences between Iran's Shia theocracy and Hamas' Sunni Islam exist, their shared opposition to Israel motivated Tehran to provide financial aid, delivery of weapons and military training\nFighters from the Lebanese militant group Hezbollah\nGunmen from the Izz al-Din al-Qassam Brigades, the military wing of Hamas, during an anti-Israel military march in Gaza City\nMembers of the Al-Qassam Brigades, the armed wing of the Hamas movement, parade on a truck with rockets in a street in Khan Yunis, in the southern Gaza Strip\nMilitarily, Hamas does not measure up to Hezbollah, but the group has shown it can leverage guerrilla warfare tactics that could make any ground assault dangerous for Israeli troops.\nMeanwhile in Yemen, the Houthi rebel movement - a Shia group waging a bitter war against the Sunni Yemeni government, which is backed by a multinational coalition led primarily by Saudi Arabia - has recently fired missiles towards Israel which had to be intercepted by a US warship.\nUnlike Hezbollah and Hamas, the Houthis do not count Israel as their biggest foe, but have expressed considerable anti-Jewish sentiments and can be considered another potential Israeli opponent in the case of a wider war.\nEven Syria's National Defence Forces, a group constituting several armed militias that pulled together to fight on the side of Bashar al-Assad's government against rebel groups in the Syrian Civil War, were trained by Iran's Revolutionary Guard Corps.\nSyria, alongside Iran, provides missiles, drones and other weaponry to Hamas and Hezbollah.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Sabre-rattling Iran warns expansion of the Israel-Hamas war across the Middle East is 'inevitable'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12734217/Iran-warns-expansion-Israel-Hamas-war-inevitable.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}