{"authors": ["Lilia Sebouai", "Samuel Lovett", "Paul Nuki", "Global Health Security Editor"], "date_download": "2024-02-05 15:42:44", "date_modify": "None", "date_publish": "2023-11-10 00:00:00", "description": "Water shortages, power cuts and constant air strikes cause chaos in healthcare facilities as disease and infection spread", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F11%2F10%2Fisrael-gaza-dispatch-hospitals-al-shifa-hamas-tunnels%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/11/10/TELEMMGLPICT000356225871_16996488105310_trans_NvBQzQNjv4BqnovVTiJx1-CJOCPnC8SeZ2-UbyzXqbnyeN0Exl0sHRQ.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Another pregnant woman described being “buried in rubble” following an airstrike.\n“My face was all covered in blood, my hands, and my legs. Honestly, I couldn’t feel them,” said 26-year-old Sondos.\n“I was transferred to the operating room for my legs because bones were shattered. After that, thank God, I gave birth to a girl. I will name her Habiba al-Rahman, after her sister who was martyred on the same day.”\nThe outbreak of secondary infections continues without clean water and antimicrobial drugs.\n“We have a health disaster. We have a type of worm, called white flies, covering the wounds after the surgery. They appear after one day,” said Dr Abusada.\n“Most injuries and surgeries have no follow-ups as the medical teams cannot cope with the influx of injuries every hour.”\nCalling the situation “disastrous”, he said that the wards have “zero” space left for patients.\n“On a normal day, we have a capacity of 210 beds, and now we have more than 800 patients that need to be admitted.”\nAs night settled over Gaza on Friday, there was no sign of a let up in the fighting around the hospitals.\nPalestinian sources report that there is a heavy exchange of fire in Al-Quds Hospital area in Gaza City. The Red Crescent reported one dead and 20 wounded, including two seriously, from IDF fire.\nThere were also calls for the IDF to make greater efforts to reduce civilian deaths.\nSpeaking in New Delhi at the end of an intense nine-day diplomatic tour of the Middle East and Asia, Antony Blinken, the US secretary of state, said on Friday that the US “appreciates” Israel’s formalisation of pauses in their military operations to allow Palestinians to move south and its creation of a second safe corridor for them to use to escape harm but that more needed to be done.\nMr Blinken added that Israel’s steps “will save lives and will enable more assistance to get to Palestinians in need”, but at the same time ”much more needs to be done to protect civilians and to make sure that humanitarian assistance reaches them”.\nHe said “far too many Palestinians have been killed, far too many have suffered these past weeks” and that everything possible should be done to prevent harm and maximise the assistance they need.\nMargaret Harris, a World Health Organisation spokesman, said on Friday that Al-Shifa hospital had been “coming under bombardment”, adding that 20 hospitals in Gaza were now out of action entirely.\nAsked about the Gaza health ministry’s allegation of an Israeli strike on the hospital courtyard, Ms Harris said: “I haven’t got the details on Al-Shifa, but we do know they are coming under bombardment.” Asked to elaborate, she said there was “intense violence” at the site, quoting colleagues on the ground.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "‘I told Israel, I cannot move my patients or they will die’", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/11/10/israel-gaza-dispatch-hospitals-al-shifa-hamas-tunnels/"}