{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:42:53", "date_modify": "None", "date_publish": "2023-11-09 08:20:59", "description": "However, no official statement has been issued by any of the parties involved in the controversy.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fbella-hadid-replaced-israeli-model-latest-dior-ad-reports-1721439.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721166/bella-hadid.jpg", "language": "en", "localpath": null, "maintext": "\"Boycott Dior\" is the latest hashtag that is trending on Twitter (now called X) after it replaced its longtime brand ambassador, Bella Hadid, a Palestinian-American model.\nThe brand has come under fire after it chose Israeli model, May Tager, over Hadid for its latest ad campaign.\nThe development was first reported by Turkey's Yeni Safak publication. The news soon made it to all social media platforms, and people began to criticise the brand for their alleged support of Israel.\nHowever, no official statement has been issued by any of the parties involved in the controversy. A report by the Associated Press claimed that Hadid's contract with the brand had ended long before the latest conflict, and that Tager has featured in Dior campaigns in the past as well.\nIt needs to be noted that Hadid has been a vocal supporter of the Palestinian cause and has not shied away from slamming Israel for bombing Gaza. She has also reportedly received death threats for her stance on the Israel-Palestine issue.\n\"I've been sent hundreds of death threats daily, my phone number has been leaked, and my family has felt to be in danger. But I cannot be silenced any longer. Fear is not an option,\" she wrote in an Instagram post recently.\n\"My heart is bleeding with pain from the trauma I am seeing unfold, as well as the generational trauma of my Palestinian blood,\" Bella said.\nBella Hadid's connection to Palestine:\nHer father, Mohamed Anwar Hadid, was born into a Palestinian Muslim family in 1948 in Nazareth. Bella and her sister, Gigi Hadid, are half-Palestinian and half-Dutch.\nTheir father and his family had to flee Palestine due to the 1947–1949 Palestine War, according to a Washington Post profile. The family had to walk all the way to the Lebanese border to escape violence.\nThe family lived in Greece, Syria, and Tunisia before moving to the United States when Mohamed Hadid was 14 years old. In 2015, he shared an Instagram post wherein he gave details about his family and life.\n\"I was only about 18 months old. After we were expelled from our beloved #Palestine into the Syrian refugee camps... My dad got a brief job at the University of Damascus in #Syria...Thank you #Syria for taking us in. And thank you America for allowing All of us to realize our dreams ...\"\nThe big picture:\nThe latest Israel-Palestine war has also initiated a social media war. Brands are being boycotted or being asked to apologise for their alleged support to the parties involved in the conflict.\nRecently, fast food chain McDonald's also came under fire for giving out free food to the Israel Defense Forces.\nSome social media posts claimed that the company had given out 100,000 free meals. The move also sparked protests in the UK. Last week, a man dumped dozens of live rodents dyed in the colours of the Palestinian flag at a McDonald's restaurant in Birmingham. International coffee chain Starbucks is also seeing boycott calls on social media.\nThe Turkish parliament has banned Coca-Cola and Nestle products due to their alleged support of Israel.\nAnti-Israel protests have been reported in several parts of the world, including the UK. There has also been an increase in anti-Semitic incidents.\nLondon witnessed a 1,353% rise in antisemitic incidents in the first week of the Hamas attack, according to the Met Police. Anti-semitism is on the rise in European countries like France and Germany as well, and Jews fear backlash after Israel retaliated to the Hamas attack.\nMeanwhile, more than 10,000 Palestinians, including 4,104 children, have been killed in retaliatory Israeli strikes after the October 7 Hamas attack, according to the Gaza Health Ministry, which is also controlled by Hamas. All calls for a humanitarian ceasefire have fallen on deaf ears. The conflict sparked after Hamas brutally massacred 1,400 Israelis (mostly civilians) and took over 200 hostages in a surprise assault on October 7.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Bella Hadid Replaced With Israeli Model In Latest Dior Ad: Reports", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/bella-hadid-replaced-israeli-model-latest-dior-ad-reports-1721439"}