{"authors": [], "date_download": "2024-02-05 15:42:53", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukraine is hoping to receive a \"positive\" European Union appraisal of its progress toward eventual EU membership, Ukrainian Deputy Prime Minist", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274023838%2Fukraine-hopeful-talks-on-its-eu-accession-will-start-soon.json", "image_url": "https://cdn.bignewsnetwork.com/voa1699308388.jpg", "language": "en", "localpath": null, "maintext": "Ukraine is hoping to receive a 'positive' European Union appraisal of its progress toward eventual EU membership, Ukrainian Deputy Prime Minister Olha Stefanishyna told Reuters Monday.\nStefanishyna said that Kyiv has implemented all the reforms required of it. It is expected that the report coming out Wednesday will signal the beginning of talks on Ukraine's accession into the EU, starting in December.\n'I would say that the assessment would definitely be positive because we have been in permanent contact with the European Commission, discussing the steps and negotiating the steps we managed to implement,' Stefanishyna said.\nFILE - Ukraine's Deputy Prime Minister for European and Euro-Atlantic Integration Olha Stefanishyna speaks during a press conference on new European Innovation Council support for tech startups from Ukraine on June 9, 2022 in Brussels.\nEU membership talks take years, as candidates must meet extensive legal and economic criteria before joining. The EU, which now has 27 member states, is also unwilling to take in a country that is at war.\nIn Poland, an EU country, Polish truckers blocked roads to three border crossings with Ukraine Monday, protesting what they see as government inaction over a loss of business to foreign competitors since Russia's war on Ukraine.\nLocal authorities said that Polish truckers do not like that Ukrainian transport companies are exempt from seeking permits to cross the Polish border since Russia's full-scale invasion of Ukraine in February 2022.\nThe truckers' demands include reimposing restrictions on the number of Ukraine-registered trucks entering Poland and a ban on transport companies with capital from outside the European Union, among others.\n'The blocking of the roads to the border crossings between Poland and Ukraine ... is a painful stab in the back of Ukraine, which is suffering Russian aggression,\" Ukraine's ambassador in Warsaw, Vasyl Zvarych, wrote on social media platform X.\nFILE - Trucks wait to cross the Ukraine-Poland border, as Russia's attack on Ukraine continues, at the checkpoint Rava-Ruska, Lviv region, Ukraine, April 17, 2023.\nUkraine on Monday launched a criminal investigation into military officers who organized a troop-honoring ceremony that was hit by a Russian missile strike, killing 19 soldiers in one of the deadliest single attacks reported by Ukrainian forces.\nThe State Bureau of Investigation said it aims to hold military officials accountable for the Rocket Forces and Artillery Day event held Friday near the front line in Zaporizhzhia, where Russian reconnaissance drones could easily spot the crowded gathering.\nThe carnage sparked a wave of criticism among Ukrainians who questioned on social media the planning of an event so close to the battlefield.\nPresident Volodymyr Zelenskyy lamented the deaths of the men of the 128th Separate Mountain-Assault Brigade of Zakarpattia as a \"tragedy that could've been avoided,\" AP reports.\nIn the city of Odesa, Russian drone and missile strikes wounded eight people and damaged an art museum that is part of a UNESCO World Heritage site, late Sunday.\nOdesa's National Art Museum said seven exhibitions, most featuring the work of contemporary Ukrainian artists, were damaged by a strike that left a large crater outside the museum, which was celebrating its 124th anniversary.\nA view shows the site of a Russian missile strike outside Odesa's National Art Museum, amid Russia's attack on Ukraine, in Odesa, Nov. 6, 2023.\nRussia's war on Ukraine is the driving force behind continued high inflation and a decline in social services in Russia, according to the latest intelligence report from Britain's ministry of defense.\nInflation rose to 6 percent in Russia in September, the ministry said Monday, driven by the rising cost of basic consumer items, like food and fuel.\nThe high inflation rate will also likely influence borrowing costs for Russian consumers and \"impact the Russian government's debt service costs,\" according to the ministry.\nMeanwhile, Ukrainian President Volodymyr Zelenskyy has asked the U.S. for more funding for to fight off Russian aggression, saying American soldiers could eventually be pulled into a greater European conflict with Russia if Washington did not increase support.\n'If Russia kills all of us, they will attack NATO countries and you will send your sons and daughters [to fight],' Zelenskyy said in an interview with NBC's \"Meet the Press\" show.\nThe Republican-led U.S. House of Representatives passed a supplemental spending bill last week providing $14.3 billion in aid to Israel, but adding nothing in aid for Ukraine, a large contrast to President Joe Biden's $106 billion funding request with the bulk of the money going to bolster Ukraine's defenses and the remainder split among Israel, the Indo-Pacific and U.S.-Mexico border enforcement.\nU.S. Senator Chuck Schumer, majority leader of the Democratic-controlled Senate, said he would not bring the House bill to a vote and Biden has vowed to veto it.\nIn the interview airing Sunday, Zelenskyy invited former U.S. President Donald Trump, a Republican, to visit Ukraine and experience firsthand the fallout of the conflict initiated by Russia's President Vladimir Putin in February 2022.\nTrump, who is seeking reelection in 2024 and is the leading candidate for his party's presidential nomination, has been sharply critical of U.S. support for Kyiv and has said he could end the war in 24 hours if he were reelected.\n'If he can come here, I will need ... 24 minutes to explain to President Trump that he can't manage this war,' Zelenskyy said. 'He can't bring peace because of Putin.'\nSome information for this story came from The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.britainnews.net", "text": null, "title": "Ukraine Hopeful Talks on Its EU Accession Will Start Soon", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274023838/ukraine-hopeful-talks-on-its-eu-accession-will-start-soon"}