{"authors": [], "date_download": "2024-02-05 15:42:54", "date_modify": "None", "date_publish": "2023-11-09 11:34:07", "description": "‘We have fallen off a precipice. This cannot continue’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-hamas-war-crimes-unhrc-b2444291.html.json", "image_url": "https://static.independent.co.uk/2023/11/09/05/newFile.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nBoth Israel and Hamas were committing war crimes, the UN’s human rights chief said in a strongly worded statement on the Gaza conflict.\nVolker Turk on Wednesday visited the Rafah crossing on the Egypt-Gaza border, where several hundred foreign passport holders have been able to flee this week to escape fierce fighting between Israeli forces and Hamas.\nMr Turk likened the situation there to witnessing “the gates to a living nightmare”.\n“The atrocities perpetrated by Palestinian armed groups on 7 October were heinous, brutal and shocking, they were war crimes – as is the continued holding of hostages,” Mr Turk told reporters.\n“The collective punishment by Israel of Palestinian civilians amounts also to a war crime, as does the unlawful forcible evacuation of civilians,” he said.\n“The massive bombardments by Israel have killed, maimed and injured in particular women and children.\n“The latest death toll from the Gaza Ministry of Health is in excess of 10,500 people, including over 4,300 children and 2,800 women. All of this has an unbearable toll on civilians.\n“We have fallen off a precipice. This cannot continue.”\nIsrael’s retaliatory strikes on Hamas after the 7 October attacks have involved the continued aerial bombardment of Gaza. The country has also intensified ground operations in the past 10 days and is attempting to dismantle a vast underground tunnel network.\nOn Thursday, overnight Israeli bombardments claimed the lives of dozens of Palestinians in Jabalia – Gaza’s largest refugee camp – and Sabra, reported Al Jazeera.\nThe bombardments have forced thousands to walk long distances to seek refuge.\nCNN reported that a stream of people, including women, children, the elderly and disabled, made their way down Salah Eddin Street. This counts as one of the two north-south highways in Gaza along an evacuation corridor.\n“Even in the context of a 56-year-old occupation, the current situation is the most dangerous in decades, faced by people in Gaza, in Israel, in the West Bank but also regionally,” Mr Turk said.\n“My colleagues are among those trapped, and among those who have lost family members, suffering sleepless nights filled with agony, anguish and despair.\n“Israel’s own obligations as an occupying power also continue to apply in full, requiring it to ensure a maximum of basic necessities of life can reach all who need it.”\nEarlier this month, when Israel attacked Jabalia, the Office of the United Nations High Commissioner for Human Rights called it a war crime.\n“Given the high number of civilian casualties [and] the scale of destruction following Israeli air strikes on Jabalia refugee camp, we have serious concerns that these are disproportionate attacks that could amount to war crimes,” UNHCHR wrote on X/Twitter.\nIsrael has rejected the UN’s calls for a humanitarian ceasefire. In October, the US had vetoed a UN Security Council resolution for “humanitarian pauses” to deliver lifesaving aid to millions in Gaza.\nOn Monday, Israeli prime minister Benjamin Netanyahu said he would allow “little pauses” in its assault on Hamas, according to the Associated Press.\nA day later, his defense minister Yoav Gallant dubbed Gaza to be “the biggest terror stronghold that mankind has ever built”.\nGlobally, thousands of people have demonstrated against Israel’s actions in Gaza. A former UN official in New York, Craig Mokhiber, accused the organisation of failing to stop what he claimed was a “textbook case of genocide” unfolding in Gaza, in a damning parting shot as he stepped down from his role.\nThe exodus has also been likened to the historical “Nakba” – meaning catastrophe in Arabic – by a teenage girl quoted by CNN.\nThe term is used to describe the original displacement of more than 700,000 Palestinian people in 1948.\nIt was also used by the commissioner general of the UN agency for Palestinian Refugees, Philippe Lazzarini, in an op-ed for the Washington Post on Wednesday.\nMr Lazzarini wrote that “this exodus is reminiscent of the original displacement of more than 700,000 people from their towns and villages in 1948, also known as the Nakba (’catastrophe’ in Arabic)”.", "source_domain": "www.independent.co.uk", "text": null, "title": "Both Israel and Hamas committing war crimes, says UN human rights chief", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-hamas-war-crimes-unhrc-b2444291.html"}