{"authors": [], "date_download": "2024-02-05 15:42:57", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Israeli forces pounded the Hamas-held Gaza Strip on Monday after encircling the enclave's main city on Sunday, ignoring ceasefire calls by UN", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274023338%2Flive-israel-pounds-gaza-as-hamas-says-death-toll-surpasses-10000.json", "image_url": "https://cdn.bignewsnetwork.com/frc1699277831.jpg", "language": "en", "localpath": null, "maintext": "Israeli forces pounded the Hamas-held Gaza Strip on Monday after encircling the enclave's main city on Sunday, ignoring ceasefire calls by UN aid agencies who condemned surging civilian deaths in the month-long conflict. The fighting came as US Secretary of State Antony Blinken held talks in Turkey on the latest stop of a diplomatic tour aimed at soothing anger over the bloodshed in Gaza and preventing a regional escalation. Follow our live blog for the latest updates. All times are Paris time (GMT+1).\nIsrael pounded the Gaza Strip with \"significant\" strikes on Monday, a day after its forces reached the coastline south of Gaza City, cutting the besieged enclave in two. Israeli forces \"have encircled Gaza City ... Now there exists a south Gaza and a north Gaza,\" military spokesman Daniel Hagari said on Sunday.\nJordan's King Abdullah II said the country's air force air-dropped vital medical supplies to a field hospital in the Gaza Strip overnight. Israel confirmed it \"coordinated\" with Jordan to facilitate the drop.\nUS Secretary of State Antony Blinken arrived in Turkey on the latest stop of a diplomatic tour aimed at preventing a wider regional conflict. The top US diplomat made a surprise visit to Baghdad on Sunday following a trip to the occupied West Bank earlier in the day.\nThe heads of major UN agencies issued a rare joint statement late on Sunday calling for an \"immediate humanitarian ceasefire\". The statement said that 88 UN workers have died since the start of the fighting between Hamas and Israel, the highest number \"ever recorded in a single conflict\".\nGaza's Hamas government reported \"intense bombings\" on Sunday evening around several hospitals in the north of the Gaza Strip, shortly after telecommunications in the territory were cut for a third time.\nThe death toll in Gaza has risen to at least 10,022 people, including at least 4,104 children, according to the health ministry in the Hamas-run Palestinian territory. In the occupied West Bank, more than 140 Palestinians have been killed in violence and Israeli raids.\n2:30pm: South Africa recalls ambassador and diplomatic mission to Israel and accuses it of genocide in Gaza\nSouth Africa's government has recalled Monday its ambassador and diplomatic mission to Israel in condemnation of the bombardment of the Gaza Strip, calling it \"a genocide\".\nThe government also threatened action against the Israeli ambassador to South Africa over his recent remarks about the African country's stance on the Israel-Hamas war. No further details were given about the remarks.\n2:29pm: Gaza border authority says Rafah crossing open only for listed Egyptians and foreigners\nThe border authority in Hamas-controlled Gaza on Monday said that the Rafah border crossing is open only for evacuations by Egyptians and foreigners listed since November 1.\nThe authority's statement added that those who were not listed won't be able to cross the border as per notification from the Egyptian authorities.\n2:00pm: Lebanese patriarch says country must be kept out of Israel-Hamas war\nLebanon's top Christian cleric has urged state officials to shield Lebanon from the war between Israel and Hamas.\nThe Iran-backed Hezbollah has been exchanging fire with Israeli forces across the Lebanese-Israeli frontier since the Israel-Hamas war began on October 7, in the worst fighting there since Hezbollah and Israel fought a war in 2006.\nLong a critic of the heavily armed Hezbollah, Maronite Christian Patriarch Bechara Boutros Al-Rai called for the application of a 2006 UN Security Council resolution which ended the 2006 war, noting it ordered the sides to cease fire.\nHe called on Lebanese state officials to work to keep Lebanon away \"from the scourge of this war ... and to carry out its political and diplomatic role in support of the Palestinian cause. That is more effective,\" he said.\n1:05pm: Blinken says US working 'very aggressively' to get more aid into Gaza\nUS Secretary of State Antony Blinken has wrapped up his whirlwind diplomatic tour of the Middle East with talks with his Turkish counterpart in Ankara, stressing that Washington is working \"very aggressively\" to expand the amount of aid reaching civilians in Gaza.\n\"We know the deep concern here (in Turkey) for the terrible toll ... in Gaza and its civilians, a concern that we share, that we are working on every single day,\" Blinken told reporters before boarding a plane for Japan.\n\"We engage the Israelis on the steps that they can take to minimise civilian casualties,\" he added.\nIn return, Blinken's counterpart Hakan Fidan pressed the US secretary of state to support an \"immediate\" ceasefire in the Israel-Hamas war, a Turkish diplomatic source told reporters.\n12:10pm: 'My future is over': The children caught up in Israel's war with Hamas\nAs Israel continues its relentless bombing of the Gaza Strip, children in the besieged and densely populated enclave are paying a horrific price.\nHealth authorities in the Hamas-run territory say around 4,000 children have been killed in the month-long conflict, with the UN agency UNICEF warning that Gaza has become \"a graveyard for children\".\nIn the southern town of Khan Younis, doctors at a hospital stripped of resources have no choice but to amputate children's limbs due to the lack of medical supplies.\nWarning: the video below contains distressing images.\n11:55am: EU's Borrell suggests plan for 'humanitarian pause' in Gaza including Red Cross access to hostages\nEU foreign policy chief Josep Borrell on Monday suggested a plan under which Israel could suspend its military operation in Gaza in return for the Red Cross getting access to hostages held by Hamas.\n\"I think that a humanitarian pause counterbalanced by an access to hostages with the International Committee of the Red Cross (ICRC) as a first step to their release is an initiative in which we should work,\" Borrell told European Union diplomats in Brussels.\nThe EU, United States and Britain have been pushing for \"humanitarian pauses\" in the fighting between Israel and Hamas in Gaza to ensured people in the besieged territory get help.\nBut Israel's Prime Minister Benjamin Netanyahu has ruled out any temporary truces until all hostages seized in Hamas's October 7 attack are released.\n\"Call it a truce, window, whatever, but we need that violence recedes and that international humanitarian law is being respected,\" Borrell said.\n11:49am: Norway exploring ways to revive diplomatic channel between Israeli and Palestinian authorities\nNorwegian Foreign Minister Espen Barth Eide said on Monday Oslo was exploring ways to revive a diplomatic channel between Israel and the Palestinians to find a political solution to their decades-long conflict.\nNorway served as a facilitator in the 1992-1993 talks between Israel and the Palestinian Liberation Organization (PLO) that led to the Oslo Accords in 1993. Those talks were conducted in complete secrecy.\nSince then, Norway has remained involved as chair of the donor group coordinating international assistance to the Palestinian Territories, the Ad Hoc Liaison Committee (AHLC).\nThere is now interest in trying to revive the AHLC as a possible channel for diplomacy, Barth Eide said, as Israel continues to strike Gaza amid its war against the militant Islamist group Hamas that broke out last month.\n\"We hear now from very many sides - the American, the European and the Arab (sides), and from many among the parties (in the conflict), who want to see whether it can be relevant as a channel again,\" Barth Eide told public broadcaster NRK.\n\"This war has reminded everyone that there is no other lasting solution to this than having a two-state solution, which one had hoped to see after the Oslo Accords 30 years ago.\"\n11:05am: Israeli army says allowing Gaza civilians to move south\nThe Israel Defence Forces (IDF) has posted a message on its Arabic social media channels, accompanied by a map, to inform Gaza residents that it is allowing the movement of civilians from north Gaza to the south of the besieged enclave.\n\"Today the IDF will once again allow passage on the Salah al-Din Road between 10am and 2pm,\" the message reads. \"For your safety, take this next opportunity to move south beyond Wadi Gaza.\"\n10:50am: Palestinian Authority rejects partial tax transfer from Israel\nThe Palestinian Authority will not accept a partial transfer of tax funds from Israel that withholds sums earmarked for administration expenses in Gaza, Palestinian prime minister Mohammad Shtayyeh has warned.\nShtayyeh said he hoped international pressure would bring a speedy transfer of the funds, which are collected by Israel in areas of the occupied West Bank, and paid to the Palestinian Authority under a longstanding arrangement between the two sides.\nPart of the funds go to pay for expenses in Gaza, including the salaries of health workers, that are still covered by the Palestinian Authority even though Hamas controls the blockaded enclave.\n10:15am: France in talks with Egypt to set up field hospital for Gaza wounded\nFrance is in talks with Egypt to establish a military medical facility on the ground, which would include surgical capacities for people seriously wounded in the neighbouring Gaza Strip, France's defence minister has told Lebanon's L'Orient-Le Jour newspaper.\n\"There are also still discussions with Egypt in order to preposition a French military health offering on the ground, particularly providing surgery for war injuries,\" Sebastien Lecornu told the Lebanese paper.\nFrance has sent the Tonnerre helicopter carrier to the region and is currently equipping a second ship with advanced medical facilities that is expected to set sail in the next 10 days.\nParis will also host an international humanitarian conference for the civilian population in Gaza later this week as it looks to coordinate international efforts for the Israeli-occupied Palestinian enclave.\n9:25am: Gaza health authorities say more than 200 dead in Israeli strikes overnight\nIsraeli strikes killed more than 200 people overnight in the Gaza Strip, the Hamas-run health ministry in the besieged Palestinian territory said, adding that the toll only covered Gaza City and the northern part of the enclave.\nIsraeli forces have stepped up their ground offensive in northern Gaza, ignoring calls by UN aid agencies for a ceasefire while urging civilians to flee to southern parts of the enclave.\nIn the video below, ABC News correspondent Jordana Miller brings us the latest from Jerusalem.\n8:50am: Israeli soldier stabbed in east Jerusalem, attacker killed\nA knife-wielding assailant stabbed and seriously wounded a female Israeli soldier before being shot dead in annexed east Jerusalem, police have said.\n\"A terrorist armed with a knife arrived at Shalem police station and stabbed a female soldier ... border police forces neutralised the terrorist by shooting,\" police said in a statement.\nPolice, who did not give details about the assailant's identity, said the soldier was seriously wounded and another suffered light injuries.\n8:35am: French death toll from Hamas attacks rises to 40\nThe number of French nationals killed in the October 7 Hamas attack in Israel has risen to 40, French Prime Minister Elisabeth Borne has said.\nBorne told France Inter radio that eight French citizens were still missing, with some believed to be held hostage in the Gaza Strip.\n8:10am: Palestinian activist Ahed Tamimi arrested for 'inciting terror'\nThe Israeli army says it has arrested the prominent 22-year-old Palestinian activist Ahed Tamimi during a raid in the occupied West Bank.\n\"Ahed Tamimi was arrested on suspicion of inciting violence and terrorist activities in the town of Nabi Salih\" near the city of Ramallah, an army spokesman told AFP.\nTamimi became famous at age 14 when she was filmed biting an Israeli soldier to prevent him from arresting her little brother who had his arm in a cast.\nRead moreInterview with Ahed Tamimi: 'Any Palestinian starts resisting Israeli occupation from birth'\nShe has become an icon of the Palestinian cause and a large portrait of her has been painted on the Israeli separation wall with the West Bank in Bethlehem near Jerusalem.\n7:45am: Israel says it 'coordinated' with Jordan to drop medical aid into Gaza\nThe Israeli army has said it \"coordinated\" with Jordan to air-drop vital medical supplies to a field hospital in the besieged Gaza Strip.\n\"Overnight, in coordination with the IDF (Israel Defense Forces), a Jordanian airplane dropped medical equipment and food to the Jordanian Hospital in the Gaza Strip. The equipment will be used by the medical staff for patients,\" the Israeli army said in a statement.\n6:50am: Hezbollah says Israel to 'pay price' after deadly Lebanon strike\nLebanon's Iran-backed group Hezbollah says it has responded to an Israeli strike on Sunday that killed three children and their grandmother, further stoking tensions at the volatile border.\nHezbollah said it fired a barrage of grad rockets at the town of Kiryat Shmona in northern Israel in response to the strike, in which three girls aged between 10 and 14 were killed, according to Lebanese authorities.\nIt marks the first time Hezbollah has announced using that particular weapon during four weeks of clashes with Israeli forces, underlining the risks of escalation.\n5:10am: Israel intensifies Gaza strikes despite ceasefire calls\nIsrael on Monday pounded Gaza with \"significant\" strikes with soldiers battling Hamas forces in the besieged territory, ignoring ceasefire calls by UN aid agencies who condemned surging civilian deaths in the month-long conflict.\n\"We are striking Hamas, and we are going stronghold after stronghold, according to our plan, in a systematic effort to dismantle Hamas from its military capabilities,\" Israeli army spokesman Jonathan Conricus told CNN.\n\"We have troops on the ground; infantry, armour, combat engineers. They are striking and they are also directing fire from the air,\" he said, adding efforts were focused on the \"underground infrastructure\" network of Hamas tunnels.\n4:00am: Blinken to try to soothe Turkey's anger in Ankara\nUS Secretary of State Antony Blinken holds tough talks in Turkey on Monday, aimed at soothing the anger of one of Washington's most strategic but difficult allies about the bloodshed in Gaza.\nBlinken's first visit since Israel went to war with Hamas in reprisal for the militants' October 7 attack comes with fury at both Israel and the West boiling over on the streets of Turkey and inside the palace of President Recep Tayyip Erdogan.\nPolice used tear gas and water cannon to disperse hundreds of protesters who marched on an air base housing US forces in Turkey's southeast hours before Blinken's arrival Sunday.\n3:49am: US VP Harris to discuss boosting humanitarian aid to Gaza with foreign leaders\nUS Vice President Kamala Harris will discuss the Biden administration's efforts to increase the flow of humanitarian aid to Gaza amid the Israel-Hamas conflict during a phone conversation with foreign leaders on Monday, her office said.\n2:29am: UN agency chiefs join in urging Gaza ceasefire\nThe heads of all major UN agencies issued a rare joint statement Sunday expressing outrage at the civilian death toll in Gaza and calling for an \"immediate humanitarian ceasefire\" in the war between Israel and Hamas.\n\"For almost a month, the world has been watching the unfolding situation in Israel and the Occupied Palestinian Territory in shock and horror at the spiralling numbers of lives lost and torn apart,\" the UN chiefs said.\nThe heads of 18 organizations including UNICEF, the World Food Programme and the World Health Organization described the horrific toll on both sides since the October 7 Hamas attack on Israel, which left about 1,400 people dead, mainly civilians, according to Israeli authorities.\n1:08am: Israel says it stopped firing for 'many hours' in parts of northern Gaza to help civilians leave\nIsrael stopped firing in northern Gaza for several hours two days in a row to create safe passage for civilians to move to the south, a military spokesperson told CNN on Sunday, amid pressure for a humanitarian pause.\n\"Yesterday and today, for many hours with prior notice and warning, we facilitated, we stopped firing in certain areas of northern Gaza, which is the main combat area, and we called on Palestinians to move south,\" Lieutenant Colonel Jonathan Conricus said.\n12:53am: Jordan's King Abdullah II confirms airdrop of 'urgent medical aid' into Gaza\nJordan's air force air-dropped vital medical supplies to a field hospital in the besieged Gaza Strip, King Abdullah II said early Monday.\n\"Our fearless air force personnel air-dropped at midnight urgent medical aid to the Jordanian field hospital in Gaza,\" he said on X, formerly Twitter.\nKey developments from Sunday, November 5:\nThe Israeli army said Sunday its land assault on the Gaza Strip had split the Palestinian territory in two, with \"significant\" strikes continuing in its war against Hamas.\nIsraeli airstrikes hit two refugee camps in the central Gaza Strip on Sunday, killing at least 45 people, the health ministry in Hamas-run Gaza said.\nFrench Foreign Minister Catherine Colonna has called for an \"immediate\" humanitarian pause in the Israel-Hamas war as casualties climb in the besieged Gaza Strip.\nUS Secretary of State Antony Blinken made a high-security surprise visit to the Israeli-occupied West Bank Sunday, meeting with Palestinian president Mahmoud Abbas, according to photographs released by the Palestinian Authority.\nTensions between Israel and Lebanon increased as an Israeli strike in the south of the country killed three children and their grandmother, Lebanese authorities said.\nRead our blog to see how yesterday's events unfolded.\n(FRANCE 24 with AFP, AP and Reuters)\nOriginally published on France24", "source_domain": "www.britainnews.net", "text": null, "title": "Live: Israel pounds Gaza as Hamas says death toll surpasses 10,000", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274023338/live-israel-pounds-gaza-as-hamas-says-death-toll-surpasses-10000"}