{"authors": ["Ellie Doughty"], "date_download": "2024-02-05 15:43:00", "date_modify": "None", "date_publish": "2023-11-09 23:15:59", "description": "ISRAEL deployed its Iron Sting and Arrow weapons systems on Hezbollah terrorists and Iran-backed rebels in Yemen in a brutal double strike.The defensi", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24690033%2Fisrael-deploys-arrow-3-missile-killer-iron-sting-hezbollah%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/newspress-collage-24690033-1699571729075.jpg?1699571739&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "ISRAEL deployed its Iron Sting and Arrow weapons systems on Hezbollah terrorists and Iran-backed rebels in Yemen in a brutal double strike.\nThe defensive attacks, spaced just hours apart, saw the IDF resort to two of its most powerful weapons systems to protect Israeli territory.\n6 The IDF deployed two incredibly powerful weapons systems after missiles were launched towards Israeli territory including the Arrow (pictured) Credit: IAI\n6 The moment Israel's Iron Sting system blows up a 'terror base' in Hezbollah Credit: Twitter\n6 The Iron Sting system was also unleashed on Hezbollah 'terror cells' in Lebanon Credit: Elbit Systems\nThe Arrow 3 \"missile-killer\" was unleashed after Yemen's Iran-backed Houthi rebels launched a barrage of rockets at Israel.\nAnd the IDF revealed it's fighter jets had attacked Hezbollah terror bases in Lebanon, also using it's Iron Sting system for just the second time.\nThe Arrow lethal long-range air defence system is able to intercept ballistic missiles from thousands of miles away and blast them out of the sky.\nA rocket, shot by Houthi fighters, was intercepted near the Red Sea by IDF fighter jets using the \"missile-killer\".\nIsraeli forces said: \"A missile was detected that was launched into the territory of the State of Israel and was successfully intercepted in the Red Sea area, by the air defense fighters using the long-range defense system \"Arrow\".\n\"The target did not cross into Israeli territory.\"\nA military spokesperson for Houthi on Thursday confirmed they had fired the barrage of ballistic missiles, including at some of the military bases.\nOne was in the coastal city of Eilat, which runs alongside the Red Sea where the rocket was shot down.\nThe IDF later said it used fighter jets to attack \"terror bases\" used by Hezbollah militants in Lebanon.\nIt said the \"Iron Sting\" weapons system, a laser and GPS-guided mortar, was used in retaliation to attacks on Israeli territory by Hezbollah.\nIsrael claimed to have used the formidable weapon, along with artillery fire, to blow up terrorist compounds and equipment.\nFootage shared on the IDF's Twitter page showed an enormous explosion, presumably one of the targets in Lebanon.\nIsrael's Arrow 3 is thought to be the world's first operational and stand-alone defence system that can be used against tactical ballistic missiles.\nThe powerful state-of-the-art piece of kit detects, tracks and then fires a hit-to-kill warhead to intercept the incoming missile.\nIt can cleanly blast the incoming warheads out of the sky, therefore preventing damage to buildings and civilians.\nThe fearsome anti-missile launcher can be used to defend Israel in conjunction with the \"Iron Dome\" - dubbed the \"guardian of the skies\" as well as the \"Iron Sting\" and \"Iron Beam\" weapons systems.\nIsrael unveiled the Iron Sting in October, launching its powerful mortar bomb and taking out a Hamas rocket launcher in its first operational use.\nThe high-tech piece of kit was unveiled in March 2021 - but only saw real combat this weekend.\nThe \"Iron Sting\" is specifically designed to strike targets in urban areas with frightening precision and 90 per cent accuracy.\n6 Houthi rebels, who claimed responsibility for shooting a barrage of missiles towards Israel on Thursday Credit: Houthi Media Centre\n6", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israel deploys Arrow 3 ‘missile-killer’ & Iron Sting mortar hours apart in double strike on Hezbollah 'terror cell'", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24690033/israel-deploys-arrow-3-missile-killer-iron-sting-hezbollah/"}