{"authors": [], "date_download": "2024-02-05 15:43:01", "date_modify": "None", "date_publish": "2023-11-09 05:47:20", "description": "Negotiations are underway to reach a three-day humanitarian cease-fire in Gaza in exchange for the release of about a dozen hostages held by Hamas", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fisrael-ap-hamas-gaza-palestinians-b2444297.html.json", "image_url": "https://static.independent.co.uk/2023/11/09/05/Israel_Palestinians_58925.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNegotiations are underway to reach a three-day humanitarian cease-fire in Gaza in exchange for the release of about a dozen hostages held by Hamas. That’s according to two officials from Egypt, one from the United Nations and a Western diplomat, who spoke on condition of anonymity to discuss sensitive diplomatic efforts.\nThe deal would enable more aid, including limited amounts of fuel, to enter the besieged territory to alleviate worsening conditions for the 2.3 million Palestinians trapped there. It is being brokered by Qatar, Egypt and the United States, according to the officials and the diplomat.\nThe war, now in its second month, was triggered by the Oct. 7 Hamas attack on southern Israel.\nThe number of Palestinians killed in the war passed 10,500, including more than 4,300 children, the Hamas-run Health Ministry in Gaza said.\nIn the occupied West Bank, more than 160 Palestinians have been killed in the violence and Israeli raids. More than 1,400 people in Israel have been killed, most of them in the Oct. 7 Hamas attack that started the fighting, and 239 hostages were taken from Israel into Gaza by the militant group.\nCurrently:\n— US launches airstrike on site in Syria in response to Iranian-backed militia attacks on bases housing U.S. troops\n— Israel pressured by allies over plight of civilians in Gaza as thousands flee enclave’s north\n— Americans divided over Israel response to Hamas attacks, AP-NORC poll shows\n— U.S. House of Representatives censures only Palestinian American in Congress\n— Blinken urges united future Palestinian government for Gaza and West Bank, widening gulf with Israel\n— Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.\nHere’s what is happening in the latest Israel-Hamas war:\nNEGOTIATIONS UNDERWAY FOR 3-DAY HUMANITARIAN CEASE-FIRE IN GAZA\nCAIRO — Negotiations are underway to reach a three-day humanitarian cease-fire in Gaza in exchange for the release of about a dozen hostages held by Hamas. That’s according to two officials from Egypt, one from the United Nations and a Western diplomat, who spoke on condition of anonymity to discuss sensitive diplomatic efforts.\nThe deal would enable more aid, including limited amounts of fuel, to enter the besieged territory to alleviate worsening conditions for the 2.3 million Palestinians trapped there. It is being brokered by Qatar, Egypt and the United States, according to the officials and the diplomat.\nOne of the Egyptian officials says details of the deal were discussed this week in Cairo with the visiting CIA chief and an Israeli delegation. The official said mediators are finalizing a draft deal.\nA senior U.S. official said the Biden administration has not put forward any specific time frame for a pause in Israel’s military operations but has suggested that Israel consider tying the length of a pause to the release of a certain number of hostages.\nIf an agreement on the duration of the pause and the number of hostages to be freed can be reached and the deal successfully implemented, the same formula could be revisited for additional pauses and releases, according to the official.\nIsraeli Prime Minister Benjamin Netanyahu has said any temporary cease-fire would have to be accompanied by the release of the hostages who were seized by Hamas during the militant group’s Oct. 7 assault on southern Israel. Israel has said around 240 hostages, both Israelis and those with foreign passports, are currently held in Gaza.\nA three-day cease-fire would allow the delivery of humanitarian aid across Gaza, including the northern area, the focus of Israel’s military campaign to crush the territory’s Hamas rulers. Under the proposed deal, some fuel would also enter Gaza for the first time since the start of the war, to be distributed to hospitals and bakeries under U.N. supervision.\nIsrael has barred fuel shipments to Gaza since the start of the war, arguing Hamas would divert them for military use. Over the past month, only limited amounts of aid, such as medicine, food and water, have entered Gaza. Aid workers say it’s not nearly enough to meet mounting needs.\nUnder the proposed truce deal, Hamas would release a dozen civilian hostages, most of them foreign passport holders, and provide a complete list of hostages to mediators, according to the officials. The International Committee of the Red Cross would be allowed to visit the hostages.\nThe diplomat said the talks are complex because of the involvement of different parties in the region and in Western capitals.\n___\nAssociated Press writers Samy Magdy in Cairo and Matthew Lee in Seoul, South Korea, contributed.\nUS LAUNCHES STRIKE ON SITE IN SYRIA IN RESPONSE TO ATTACKS BY IRANIAN-BACKED MILITIAS\nWASHINGTON — The U.S. launched an airstrike Wednesday on a facility in eastern Syria used by Iranian-backed militias, in retaliation to an increasing number of attacks over the past several weeks on bases housing U.S. troops, the Pentagon said.\nTwo U.S. F-15 fighter jets carried out the strike on a weapons storage facility linked to Iran’s Revolutionary Guard.\nPresident Joe Biden \"directed today’s action to make clear that the United States will defend itself, its personnel, and its interests,” Defense Secretary Lloyd Austin said in a statement.\nThis is the second time in less than two weeks that the U.S. has bombed facilities used by the militant groups, many operating under the umbrella of the Islamic Resistance in Iraq, which U.S. officials say have carried out at least 40 such attacks in the region since Oct. 17.\nUN RIGHTS CHIEF SAYS GAZA TURNED INTO A ‘LIVING NIGHTMARE’ BY ISRAEL-HAMAS WAR\nGENEVA — The U.N. human rights chief said collective punishment by Israel of Palestinian civilians and their forced evacuation, as well as atrocities committed by Palestinian armed groups on Oct. 7 and their continued holding of hostages, amount to war crimes.\nVolker Türk, standing in front of Egypt's Rafah border crossing into Gaza, told reporters Wednesday: “These are the gates to a living nightmare.”\n“We have fallen off a precipice. This cannot continue,” he said later in Cairo.\nTürk said international human rights and humanitarian law must be respected to help protect civilians and allow desperately needed aid to reach Gaza’s beleaguered population of some 2.3 million people.\nHe said the U.N. rights office received reports in recent days about an unspecified orphanage in northern Gaza with 300 children who need urgent help, but communications were down and access were impassable and unsafe, so “we cannot get to them.”\n“I feel, in my innermost being, the pain, the immense suffering of every person whose loved one has been killed in a kibbutz, in a Palestinian refugee camp, hiding in a building or as they were fleeing,” Türk said. “We all must feel this shared pain — and end this nightmare.”\nGAZA HOSPITALS STRAIN UNDER ISRAELI SIEGE, WITH PREMATURE BIRTHS ON THE RISE\nKHAN YOUNIS, Gaza City — Hospitals in Gaza are nearing collapse under Israel's wartime siege, which has cut power and deliveries of food, fuel and other necessities to the territory.\nInside the maternity department at Nasser Hospital in the southern city of Khan Younis, the workload has doubled because of the mass displacement from Gaza’s north. That's according to neonatal specialist Dr. Asaad al-Nawajha, who said Wednesday his team has seen an increase in premature births as the monthlong war intensifies.\nShouq Hararah is one of those mothers. She says her delivery took place with “no proper birth procedures, no anesthesia, painkillers or anything.”\n“I gave birth to twins. The boy was discharged, but the girl remains in the maternity ward,” she said.\nStanding before a row of beeping incubators, al-Nawajha emphasized the war's life-threatening consequences.\n“All of our work depends on electricity; all the machines you see here rely on it,” the doctor said. “When the electricity is cut, these devices stop working, and all the babies will face certain death.”\nSYRIA SAYS ISRAELI AIRSTRIKES HIT MILITARY POSITIONS\nIsrael airstrikes hit several Syrian military positions late Wednesday, Syrian state media reported.\nQuoting an unnamed military source, state news agency SANA said the strikes caused material damage, and did not mention any casualties nor the locations where the airstrikes took place. Pro-government radio station Sham FM said the sounds of explosions could be heard in southeast Sweida province and in some suburbs of the capital, Damascus.\nMeanwhile, Britain-based opposition war monitor the Syrian Observatory for Human Rights said the strike in Sweida province targeted an air defense and radar unit, while at least three strikes in suburbs near Damascus were not far from Syria’s military airbase and wounded three people, without giving further details.\nIsrael, which has vowed to stop Iranian entrenchment next door, has carried out hundreds of strikes on targets in government-controlled parts of neighboring Syria in recent years, but it rarely acknowledges them. Israel did not immediately comment on the alleged airstrikes.\n93 ROMANIANS WHO ESCAPED GAZA FLY TO BUCHAREST\nBUCHAREST, Romania — A group of 93 Romanian citizens landed Wednesday evening at an airbase near Romania’s capital on a flight from Egypt after being evacuated from the Gaza Strip.\nThe specially chartered flight touched down at Base 90 at Bucharest’s Otopeni Airport around 10.00 p.m. local time. The plane also brought back 36 Moldovan citizens, according to Romania’s foreign ministry.\nRomania’s Prime Minister Marcel Ciolacu had flown to Egypt earlier on Wednesday to meet the evacuees and returned with them on the flight to Romania.\n“I was overwhelmed to see the joy and hope in the eyes of the children who escaped the hell in Gaza,” Ciolacu wrote on Facebook after arriving in Egypt. “The Romanian Government will continue to act to facilitate the evacuations by all the means at our disposal.”\nAnother 51 Romanians have also been granted permission to leave Gaza into Egypt through the Rafah border crossing, the foreign ministry said, but did not specify when.\nSix Romanians who hold dual Romanian-Israeli citizenship are among the hostages held by Hamas. Since Hamas launched its attack on Israel on Oct. 7, at least five Romanian citizens have been confirmed killed.\nBRAZIL STOPS TERROR PLOT AGAINST JEWISH COMMUNITY, OFFICIAL SAYS\nRIO DE JANEIRO — Authorities in Brazil foiled a terror plot on Wednesday when they arrested two people in Sao Paulo state, the Federal Police said in a statement.\nThe two suspects were recruited and financed by the Lebanese militia Hezbollah and planned to target buildings tied to the Jewish community, according to an official with information about the plot who spoke on condition of anonymity because they were not authorized to speak publicly.\nThe police statement did not give details about the suspects. It said police also executed 11 search warrants in Sao Paulo, Minas Gerais and the Federal District that were aimed at obtaining proof of possible recruitment of Brazilians for carrying out extremist acts in the country, adding that it was targeting both recruits and recruiters.\nLocal paper O Globo reported that police arrested one of the two suspects when they returned to the international airport in Sao Paulo, with information in hand to carry out the attack. There are two additional targets for arrest in Lebanon, the paper reported, without saying how it obtained that information.\nThe Brazilian Israelite Confederation celebrated the police operation on X, formerly Twitter.\n“The tragic conflicts in the Middle East cannot be imported into our country, where different communities live peacefully, harmoniously and without fear of terrorism,” the group said.\nBrazil has one of the world’s largest Lebanese populations; most estimates put their total well above that of Lebanon itself.\n___\nAssociated Press writer David Biller contributed.\nUS DRONE SHOT DOWN BY YEMEN'S HOUTHI REBELS\nWASHINGTON -- A U.S. drone was shot down by Yemen's Houthi rebels on Wednesday, according to the Iran-backed group’s military arm and a senior U.S. military official.\nThe Houthis said it was an MQ-9 Reaper drone that was in Yemeni air space and was shot down by air defenses. The senior U.S. official said the military is still analyzing the episode, including whether the drone was in international airspace or over Yemen. A second U.S. official said the MQ-9 Reaper was over international waters when it was shot down. The two officials spoke on condition of anonymity to discuss details not yet made public.\nThe Houthis have fired at least four batches of drones and missiles toward southern Israel since Oct. 7. The group controls the capital and much of northern and western Yemen where the majority of the county's population lives.\n___\nAssociated Press writer Lolita Baldor contributed.\nISRAEL SAYS IT DESTROYED 130 HAMAS TUNNELS IN GAZA AND RELEASES VIDEO FROM INSIDE UNDERGROUND NETWORK\nIsrael’s military released video on Wednesday of what it says are combat engineers locating, entering and blowing up Hamas-built tunnels in the Gaza Strip.\nIsrael has destroyed 130 tunnels since the war began, according to Rear Adm. Daniel Hagari, the chief military spokesman.\nThe videos show a soldier’s body camera footage inside what Israel said was a Hamas tunnel, its walls lined with cement and the shaft partially filled with sand. Another clip shows the mouth of what appears to be a tunnel in an open area near damaged buildings. There are clips of armored excavators and bulldozers digging in the dirt, as well as explosions apparently destroying tunnel entrances.\nThe Israeli military did not provide locations where the videos were filmed, and the images did not include any visible landmarks except for one shot showing the sea in the background, so The Associated Press could not independently confirm the videos.\nHamas is believed to have a massive underground network throughout Gaza, allowing it to transport weapons, supplies and fighters.\nIsraeli warplanes have bombed crowded urban neighborhoods, saying the strikes target the tunnel system or Hamas commanders. But airstrikes can inflict only limited damage on the subterranean network.\nWHITE HOUSE SAYS ISRAEL TO KEEP MILITARY IN GAZA AFTER WAR, BUT RE-OCCUPYING IS A ‘MISTAKE’\nWASHINGTON: U.S. National Security Council spokesperson John Kirby said it was likely that Israel would maintain a military presence in Gaza for a “period of time” after the ongoing war, but said the U.S. believes it would be a “mistake” for Israel to re-occupy the territory.\n“I think all of us can foresee a period of time after the conflict is over where Israeli forces will likely still be in Gaza and will have some initial security responsibilities,” Kirby told CNN on Wednesday. “But for how long and where and to what size and scale and scope, I think it’s too soon to know.” Kirby said the U.S. was focused on devising a long-term governance structure for Gaza after the current conflict, but said that as yet there has been little prospect of a viable plan.\n“I think where we are is: a lot of questions, and not a lot of answers,” he said. “We know what we don’t want to see in Gaza post conflict, we don’t want to see Hamas in control, and we don’t want to see a re-occupation by Israel.”\nHe added: “We know that the United States can’t solve this alone,” and that the U.S. was engaging with regional and international partners on the matter.\nPALESTINIANS FLEE ON FOOT FROM NORTHERN GAZA, DESCRIBING HUNGER, THIRST AND RELENTLESS BOMBING\nBUREIJ REFUGEE CAMP, Gaza Strip — A long line of thousands of Palestinians fled on foot from northern Gaza Wednesday — families, children and older adults, crying babies — carrying only what they could take in their arms or on their backs.\nThey were seen in Associated Press video walking down Gaza’s main north-south highway, heeding the Israeli military's orders to evacuate during a five-hour window as its troops battled Hamas militants deep inside Gaza City. Some evacuees were pushing relatives in wheelchairs, with one older adult wheeled down the road in a hand truck.\nAbeer Akeila left her home in Gaza city after relentless strikes forced all her neighbors to flee southward. She said life in the city has become increasingly difficult amid dwindling water and food supplies.\n“There was shelling and bombardment overnight,” she said. “We didn’t have food or drinking water ... They struck the bakeries. There is no life in Gaza.”\nAbout 15,000 people fled northern Gaza on Tuesday — triple the number that left Monday — according to the U.N. Office for the Coordination of Humanitarian Affairs.\nMany of the people walking south are refugees or their descendants who fled or were expelled from their homes in what is now Israel in 1948.\nITALY TO STATION HOSPITAL SHIP OFF GAZA'S COAST\nROME — Italy is sending a hospital ship that will be stationed off the coast of Gaza to aid the Palestinian population, Defense Minister Guido Crosetto announced Wednesday.\nCrosetto said the mission is a concrete sign of Italy’s “closeness to the Palestinian people, distance from the Hamas terrorists.”\nThe ship Vulcano has 170 people on board, including medical and military personnel, and includes operating rooms. It will first head to Cyprus and then as close as possible to the conflict zone to provide emergency medical support, Crosetto said.\nISRAEL TO LAUNCH FORMAL INVESTIGATION INTO HAMAS ATTACK\nJERUSALEM — Israel’s attorney general and state attorney are working with police and military to formally investigate the Hamas attack on Oct. 7, they announced Wednesday.\n“Our goal is to investigate and initiate legal proceedings against those who perpetrated, planned and otherwise took part in these heinous acts -– wherever they are,” the statement said. It said Israel would punish the Hamas militants with “the utmost severity, commensurate with their crimes.”\nPolice are working to collect evidence from towns across the south as attorneys for the Ministry of Justice decide how best to proceed with the investigation.\nSPAIN SAYS CITIZEN MISSING AFTER HAMAS ATTACK IS DEAD\nMADRID — Spain’s Foreign Ministry said Wednesday that a Spaniard missing in Israel following the Hamas attack in October is dead. The ministry identified him as Iván Illarramendi. It declined to give any further details.\nIn a message on X, formerly known as Twitter, Israel’s ambassador to Spain, Rodica Radian-Gordon, said: “Our hearts are torn by the news of the brutal murder of Iván Illarramendi. He has been identified a month after the terrorist massacre committed by Hamas in Israel, along with his wife Dafna Garcovich.”\nThe Israeli Embassy was unable to say where the death occurred.\nSpain’s state news agency Efe and other Spanish news outlets have reported that Illarramendi and his Chilean wife had been living in a kibbutz near the Gaza Strip.\nThe ministry confirmed the death of another Spaniard with Israeli citizenship, Maya Villalobo Sinvany, on Oct. 11.\nFollowing the attacks, the ministry would only say that two Spaniards had been “affected” in the attacks.\nVillalobo was reported to have been in military service at an Israeli miliary base at the time of the attack.\nHEZBOLLAH SAYS IT STRUCK ISRAELI INFANTRY UNITS\nBEIRUT, Lebanon — Lebanese militant group Hezbollah claimed two attacks on Israeli infantry units in the areas of Shomera and Dovev on Wednesday which it said inflicted casualties on Israeli forces. There was no immediate confirmation of the casualties from the Israeli military.\nFollowing the strikes, Lebanon’s state-run National News Agency and an Associated Press journalist in south Lebanon reported heavy shelling in several border areas in Lebanon.\nHezbollah said in a statement that the attack on Dovev was in retaliation for Israeli forces targeting an ambulance in Lebanon. On Sunday, local Lebanese officials said an Israeli drone had struck near two ambulances on their way to pick up casualties from overnight strikes in southern Lebanon, wounding four paramedics. The Israeli army said it had launched strikes on a “terrorist cell” that was attempting to fire missiles toward Israel and hadn’t intentionally targeted the vehicles.\nAnother Israeli airstrike in south Lebanon on Sunday evening hit a car driving between the towns of Ainata and Aitaroun and killed three children and their grandmother and wounded the children's mother. An Israeli military statement later said the car had been “identified as transporting terrorists” and that the military was reviewing “allegations that there were civilians in the vehicle.”\nIsraeli troops and Hezbollah militants and their allies have been clashing along the border since the start of the Israel-Hamas war a month ago. While the clashes remain largely contained, they have increased in intensity as Israel conducts a ground incursion in Gaza against Hezbollah ally Hamas.\nUKRAINE EVACUATES 43 OF ITS NATIONALS AND 36 MOLDOVANS FROM GAZA\nKYIV, Ukraine — Ukraine has evacuated 43 of its nationals from the Gaza Strip and helped 36 Moldovan citizens reach safety in Egypt, Ukrainian President Volodymyr Zelenskyy said.\nUkrainian diplomats helped the two groups get out of the war zone, Zelenskyy said Wednesday on X, formerly known as Twitter.\nHe said Ukraine was working with embassies in Israel and Egypt to get more of its citizens out of Gaza.\nISRAEL CABINET TO MEET IN WEST BANK FOLLOWING WARNINGS OF MORE VIOLENCE\nJERUSALEM — Israel’s wartime security Cabinet will meet late Wednesday in the West Bank offices of the military’s Central Command “due to warnings by security officials about the potential for a serious escalation in violence” in the territory, the Ynet website reported, citing a statement from Prime Minister Benjamin Netanyahu’s office.\nIsraeli media reported last week that the Shin Bet security agency issued such a warning, noting an increase in violence by Jewish settlers.\nDeadly violence has been surging in the Israeli-occupied West Bank as Israel’s military pursues Hamas militants following the group’s bloody Oct. 7 incursion into Israel from the Gaza Strip. The violence threatens to open another front in the war Israel launched against Hamas after it killed more than 1,400 people in southern Israel and took more than 240 people hostage.\nAs of Tuesday, 167 Palestinians had been killed in the West Bank over the past month, mainly in clashes with Israeli troops. The toll since the beginning of the year was 371.\nSome of the dead have been killed in violent anti-Israel protests, and Palestinians have said eight people were killed in attacks by settlers, who have intensified assaults and provocations since the war began.\nDaily Israeli military arrest raids in the territory have intensified, with once-rare aerial attacks becoming much more common. The military said Wednesday that 1,430 wanted men have been arrested in the West Bank since Oct. 7, including more than 900 from Hamas.\nG7 NATIONS ANNOUNCE A UNIFIED STANCE ON ISRAEL-HAMAS WAR\nTOKYO — Top diplomats from the Group of Seven leading industrial democracies announced a unified stance on the Israel-Hamas war on Wednesday after intensive meetings in Tokyo, condemning Hamas, supporting Israel’s right to self-defense and calling for “humanitarian pauses” to speed aid to desperate civilians in the Gaza Strip.\nIn a statement following two days of talks, the nations sought to balance unequivocal criticism of Hamas’ attacks against Israel and “the need for urgent action” to help civilians in the besieged Palestinian enclave.\n“All parties must allow unimpeded humanitarian support for civilians, including food, water, medical care, fuel and shelter, and access for humanitarian workers,” said the statement, hammered out by U.S. Secretary of State Antony Blinken and foreign ministers from Britain, Canada, France, Germany, Japan and Italy. “We support humanitarian pauses and corridors to facilitate urgently needed assistance, civilian movement and the release of hostages.”\nMORE PALESTINIANS FLEEING COMBAT ZONE IN NORTHERN GAZA\nJERUSALEM — The pace of Palestinian civilians fleeing the combat zone in northern Gaza has picked up as Israel’s air and ground campaign there intensifies, U.N. monitors said Wednesday. About 15,000 people fled on Tuesday, compared to 5,000 on Monday and 2,000 on Sunday, said the U.N. Office for the Coordination of Humanitarian Affairs.\nThe civilians flee during a four-hour window set daily by the Israeli military that assures safe passage from Gaza City and its surroundings to the south. Most of those fleeing were children, the elderly and people with disabilities, the U.N. agency said. Many arrived on foot with minimal belongings.\nIn a new development, some of those fleeing reported that they had to cross Israeli checkpoints to reach the south and that they had witnessed some arrests by Israeli forces. Others have said they had to walk past Israeli tanks with raised hands while waving white flags.\nThe densely populated northern area of Gaza, specifically Gaza City and adjacent urban refugee camps, are the focus of Israel’s campaign to crush Hamas, the militant group that has ruled Gaza for 16 years. The war, now in its second month, was triggered by the Oct. 7 Hamas attack on southern Israel.\nTens of thousands of Palestinian civilians remain in the combat area, many sheltering at hospitals or U.N. schools. Some said they were deterred from moving south because of dire humanitarian conditions in the evacuation zone and ongoing Israeli airstrikes across Gaza, including the south.\nU.N. monitors say some 1.5 million of Gaza’s 2.3 million people have been displaced.", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Negotiations underway for 3-day humanitarian cease-fire in Gaza, officials say", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/israel-ap-hamas-gaza-palestinians-b2444297.html"}