{"authors": [], "date_download": "2024-02-05 15:43:02", "date_modify": "None", "date_publish": "2023-11-09 17:40:37", "description": "Kenya says it won't deploy its police officers to Haiti until all conditions on training and funding are met in line with last month’s approval from the U", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fkenya-ap-parliament-nairobi-haiti-b2444766.html.json", "image_url": "https://static.independent.co.uk/2023/11/09/17/Haiti_Kenya_Armed_Force_92723.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nKenya’s government said Thursday that its police officers will not be deployed to Haiti until all conditions on training and funding are met in line with last month’s approval from the U.N Security Council to give the eastern African country command of a multinational mission to combat violent gangs in the troubled Caribbean country.\nInterior Minister Kithure Kindiki told Parliament’s Departmental Committee on Administration and Internal Security that “unless all resources are mobilized and availed, our troops will not leave the country.”\nHe said U.N. member states are securing resources and have identified how funds will be mobilized and made available to Kenya for the mission. However, it was not immediately clear when the forces would be fully trained and funded to allow for deployment.\nMeanwhile, Haiti is reporting a fresh round of gang-related killings and kidnappings as it awaits help.\nOn Wednesday, Haiti’s Superior Court of Auditors and Administrative Disputes said five of its employees were kidnapped in the capital, Port-au-Prince, forcing the agency to temporarily postpone all hearings.\n“The court hopes that the civil servants, who do not receive a salary that allows them to meet the financial demands of the kidnappers, will be quickly released,” it said in a statement.\nAlso this week, the U.N.’s International Organization for Migration said that nearly 2,500 people in the coastal town of Mariani located west of the capital were displaced by violence as gangs inltrate previously peaceful communities.\nNearly 200,000 Haitians have now lost their homes to gangs who pillage neighborhoods operated by rivals in their quest to control more territory. Many of the displaced are now sleeping outside or in makeshift settlements that are crowded and extremely unsanitary.\n“In a country where security is not a priority for the government, each time you go out, you don’t know if you’re going to be shot at,” said Mario Volcy, a 40-year-old construction worker as he waited for a bus in Port-au-Prince. “These guys have machine guns in their hands. They could surprise you by doing something crazy and dumb.”\nVolcy travels from his hometown of Les Cayes, west of Port-au-Prince, to the capital on public transportation amid fears that he could be killed or kidnapped. He said bus fares have spiked because drivers now must pay gangs a “toll” for safe passage.\nMore than 1,230 killings and 701 kidnappings were reported across Haiti from July 1 to Sept. 30, more than double the figure reported during the same period last year, according to the U.N.\nGangs continue to overwhelm Haiti’s National Police, which remains understaffed and underfunded despite the international community supplying training and resources. In late October, two more police officers were killed, according to a police union, with a total of 32 officers slain so far this year.\nHaitian Prime Minister Ariel Henry first requested the immediate deployment of foreign armed forces more than a year ago, but it wasn’t until early October that the U.N. Security Council voted to send a non-U.N. multinational force to Haiti that would be funded by voluntary contributions.\nBut even if the Kenyan forces arrive, it won’t change much, said Pierre Espérance, executive director of the Haitian National Human Rights Defense Network.\n“The biggest problem right now in Haiti is the absence of the government and rule of law, and also all key state institutions have collapsed, even the police,” he said. “How will the force be able to operate in Haiti if we don’t have a functional government?”\nEspérance also noted Haiti’s government has long been linked to gangs, compounding the problem.\nA spokesperson for the prime minister’s office did not immediately respond to a request for comment.\nIt’s not clear when exactly Kenya’s police would be deployed. In addition to waiting for training and funding, Kenya’s government is awaiting resolution of a local court case blocking the deployment.\nA judge was expected to rule Thursday on a petition filed by former presidential candidate, Ekuru Aukot, who argued the deployment is unconstitutional. However, the case was pushed back for the second time in less than a month because the judge is attending a training.\nThe case is now scheduled to be heard on Nov. 16.\nKenya’s Parliament also has to approve of the deployment.\nThe country’s National Security Council petitioned Parliament on Oct. 25 to approve the deployment. The petition is currently with the Departmental Committee on Administration and Internal Security. It will be presented to the House later this month.\n___\nCoto reported from San Juan, Puerto Rico. Associated Press reporter Evens Sanon in Port-au-Prince, Haiti, contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "Kenya says it won't deploy police to fight gangs in Haiti until they receive training and funding", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/kenya-ap-parliament-nairobi-haiti-b2444766.html"}