{"authors": [], "date_download": "2024-02-05 15:16:34", "date_modify": "None", "date_publish": "2024-01-22 10:21:00", "description": "Poland’s Prime Minister Donald Tusk has arrived in Ukraine for talks with President Volodymyr Zelenskyy on how Poland can keep supporting the country’s almost two-year war with Russia", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fdonald-tusk-ap-ukraine-poland-russia-b2482584.html.json", "image_url": "https://www.independent.co.uk/img/shortcut-icons/favicon.ico", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPolish Prime Minister Donald Tusk arrived in Ukraine's capital Monday for talks with President Volodymyr Zelenskyy on how Poland can keep supporting the country's almost two-year war with Russia and resolve a dispute between the neighboring nations over grain shipments and trucking.\nTusk, who returned to power in Poland last month and is keen to show that a change in government won't bring a change in Ukraine policy, was also due to meet with Ukrainian Defense Minister Denys Shmyhal.\n“There are some conflicts of interest, we know it well and we will talk about them, but not only in the spirit of friendship, which is obvious, but with the attitude to solve these problems as soon as possible, not to maintain or multiply them,” Tusk said, according to comments posted on X, formerly Twitter, by his office.\n“For me, it is very important to build the feeling that Poland is the most reliable, most stable ally of Ukraine in this deadly clash with evil,” Tusk said.\nHis visit took place the day after Moscow-installed officials in eastern Ukraine reported that Ukrainian shelling killed at least 27 people on the outskirts of a Russian-occupied city. Kremlin spokesman Dmitry Peskov called the shelling outside Donetsk a “monstrous terrorist act,” and the Russia-backed local authorities declared a day of mourning.\nThe Ukrainian military, however, denied it had anything to do with the attack.\nIt was not immediately possible to verify either side's claims.\nUkraine’s allies have in recent weeks sought to reassure the country that they are committed to its long-term defense against the Kremlin’s forces amid concerns that Western support could be sagging. British Prime Minister Rishi Sunak and France’s new foreign minister also traveled to Kyiv recently.\nLocated on NATO’s eastern flank, Poland has been one of Ukraine's strongest allies in its fight to defeat Russia. The government in Warsaw has provided weapons and humanitarian aid, and opened its borders to Ukrainian refugees since Moscow's troops invaded Ukraine on Feb. 24, 2022.\nBut relations soured last year as economic competition from Ukrainian food producers and truckers angered Poles who said their livelihoods were under threat.\nPolish farmers and truckers blockaded border crossings, causing backups and threatening the flow of some aid going into Ukraine.\nPolish farmers complained that imports of Ukrainian foods had caused prices to fall, hurting their incomes, while truckers said they were being undercut by their Ukrainian counterparts. The issue surfaced during the war as Ukrainian ports were blocked and food producers turned to road routes through Europe to get their products to market.\nAt one point, Poland and some other European nations banned Ukrainian grain imports because of the trade dispute.\nPoland's farmers and trucks have ended their protests for now, but Tusk is seeking ways of addressing their concerns. He has said that his country wants to help Ukraine economically but not at the expense of Polish businesses. He has suggested that Ukraine needs to better regulate its trucking industry.\nTusk was also scheduled to honor Ukrainian fighters and attend observances of the Day of Ukraine’s Unity, which marks Ukraine’s long struggle to be independent from both its eastern and western neighbors.\nIn other war-related developments, Ukraine’s air force said it intercepted all eight Shahed drones that Russia launch overnight over southern and central regions of Ukraine.\nDebris from three drones shot down over the central Dnipropetrovsk region started a fire at an unnamed business but no human casualties were reported.\nMeanwhile, major Ukrainian digital banking platform Monobank said it came under a massive denial-of-service (DoS) attack by unidentified hackers.\nThe attack was successfully repelled, the bank said, with no major consequences.\n___\nMonika Scislowska contributed from Warsaw, Poland.\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Poland's prime minister visits Ukraine in latest show of foreign support for the war against Russia", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/donald-tusk-ap-ukraine-poland-russia-b2482584.html"}