{"authors": [], "date_download": "2024-02-05 15:43:04", "date_modify": "None", "date_publish": "2023-11-09 02:32:26", "description": null, "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fus-strikes-iran-linked-weapons-storage-site-syria-1721416.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721146/us-defense-secretary-lloyd-austin-said-two-american-f-15-warplanes-such-this-one-pictured-june.jpg", "language": "en", "localpath": null, "maintext": "US warplanes carried out a strike on an Iran-linked weapons storage facility in eastern Syria on Wednesday in response to attacks against American personnel, US Defense Secretary Lloyd Austin said.\nIt is the second time in roughly two weeks that the United States has targeted a location in Syria it said was tied to Iran, which supports an array of groups that Washington blames for a spike in attacks on its forces in the Middle East.\nThe United States is striving to deter Iran and its proxies from turning the Israel-Hamas fighting into a regional war, but the repeated attacks and strikes in response risk a conflict between Washington and Tehran.\n\"US military forces conducted a self-defense strike on a facility in eastern Syria used by Iran's Islamic Revolutionary Guard Corps (IRGC) and affiliated groups. This strike was conducted by two US F-15s against a weapons storage facility,\" Austin said in a statement.\n\"This precision self-defense strike is a response to a series of attacks against US personnel in Iraq and Syria by IRGC-Quds Force affiliates,\" Austin said, adding that the United States \"is fully prepared to take further necessary measures to protect our people and our facilities.\"\nThe Syrian Observatory for Human Rights war monitor said the Wednesday strike killed nine people affiliated with Iran-backed groups in Syria -- a toll that could not be independently confirmed.\nThe US military also hit two facilities in Syria on October 26 that it said were used by the IRGC and affiliated groups, and assessed that those strikes did not cause casualties.\nLike the most recent strike, Washington said the earlier two were in response to attacks on US personnel, who have been targeted more than 40 times with rockets and drones since October 17.\nThe surge in attacks on US troops is linked to the war between Israel and Hamas, which began when the militant group carried out a shock cross-border attack from Gaza on October 7 that Israeli officials say killed more than 1,400 people.\nIsrael's military responded with a relentless air, land and naval assault on Gaza that the territory's health ministry said has left more than 10,500 people dead.\nThere are roughly 2,500 American troops in Iraq and some 900 in Syria as part of efforts to prevent a resurgence of the Islamic State group.\nThe jihadists once held significant territory in both countries but were pushed back by local ground forces supported by international air strikes in a bloody multi-year conflict.\nIn another incident linked to the Israel-Hamas war, the Huthis -- who seized Yemen's capital Sanaa in 2014 and control large swathes of the country -- said Wednesday that they shot down an American drone.\n\"Our air defenses were able to down an American MQ-9 while it was carrying out hostile surveillance and espionage activities in Yemeni territorial waters as part of American military support\" for Israel, the rebels said in a statement.\nA senior defense official from the United States -- which rushed military support to Israel and also bolstered American forces in the region after the October 7 attack -- confirmed that one of the country's drones was downed.\nThe Huthis are opposed to government forces in Yemen and are also part of the \"axis of resistance\" of groups arrayed against Israel.\nThey have claimed responsibility for multiple drone and missile attacks against Israel during its war with Hamas, and the US Navy intercepted missiles fired by the rebels last month.\nA series of MQ-9 drones -- which can fly more than 1,100 miles (1,700 kilometers) at altitudes of up to 50,000 feet (15,000 meters) and can be used for both surveillance and strikes -- have been lost or damaged in recent years, including one the United States assessed was downed by the Huthis in 2019.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "US Strikes Iran-linked Weapons Storage Site In Syria", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/us-strikes-iran-linked-weapons-storage-site-syria-1721416"}