{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:43:09", "date_modify": "None", "date_publish": "2023-11-09 07:21:44", "description": "Videos showed fights between protesters outside the Los Angeles Museum of Tolerance, where actress Gal Gadot organized a screening of footage of the Hamas terror attack on October 7.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12728725%2FShocking-moment-Gal-Gadots-screening-Hamas-terror-attack-film-ends-CHAOS-brawl-breaks-pro-Israel-pro-Palestinian-protestors.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/09/07/77593741-0-Multiple_videos_showed_fights_between_protesters_outside_the_Los-a-61_1699514496564.jpg", "language": "en", "localpath": null, "maintext": "Videos showed fights between protestors outside the Los Angeles Museum of Tolerance, where actress Gal Gadot organized a screening of footage of the brutal Hamas terror attack atrocities committed during the October 7 invasion of Israel.\nThe 47-minute footage, provided by the Israeli Defence forces, was aired to a select audience of celebrities and influential personalities in Los Angeles and New York last night.\nAbout 200 people attended the screening, though Gadot was not in attendance, nor were any major Hollywood stars, according to the LA Times. That may have been due to the SAG-AFTRA strike, which only concluded yesterday.\nPeople bearing Israeli flags fighting with pro-Palestinian protestors in the middle of the street can be seen in videos shared on social media, with people punching and kicking one another.\nPolice had been dispatched to the area outside the museum for security purposes well ahead of the skirmishes and ended up having to pepper spray several people.\nIt is not clear whether anyone was taken into custody over the fighting, ABC7 reported. A spokesperson for the LAPD told DailyMail.com that no arrests were confirmed as of late Wednesday night.\nMultiple videos showed fights between protesters outside the Los Angeles Museum of Tolerance, where actress Gal Gadot organized a screening of footage of the brutal Hamas terror attack atrocities committed during the October 7 invasion of Israel\nThe Museum of Tolerance, opened in 1993, is meant to examine the history of prejudice around the world with a strong focus on the Holocaust.\nOscar-winning director Guy Nattiv, who spearheaded the initiative, confirmed to i24 that Gadot and her husband, Yaron Varsano, 'helped make this possible.'\nThe video serves as a damning record of the atrocities perpetrated by Hamas terrorists against Israeli communities on the Gaza border on October 7, which saw the killing of 1,400 people and kidnapping of 240 hostages.\nNattiv, a self-proclaimed humanist advocating for a two-state solution, referred back to the Holocaust to highlight his cause.\n'As a filmmaker, I swore that these images of October 7 would not be forgotten, and the world would see them. Because now the denial begins - it is a fake, it is not a fake (…) We cannot pass by in silence', he told i24.\nThe plan was to host a single screening for 120 viewers, with potential additional screenings based on its reception, the outlet reported.\nThe video content is said to be deeply disturbing and has already been watched by numerous foreign journalists and Israeli Knesset members.\nThe footage aired under the title 'Bearing Witness to the October 7th Massacre' in Los Angeles and New York, according to The Wrap.\nLAPD officers get between supporters of Israel and supporters of Palestine outside The Museum of Tolerance in Los Angeles on Wednesday\nSome videos appear to show people bearing Israeli flags fighting in the middle of the street, with people punching and kicking one another while multiple vehicles were stopped at an intersection\nSupporters of Israel wave Israeli flags at motorists passing the screening\nAbout 200 people attended the screening, though Gadot was not in attendance, nor were any major Hollywood stars\nPolice had been dispatched to the area outside the museum for security purposes well ahead of the skirmishes and ended up having to pepper spray several people\nPeople were wrestling each other after a fight broke out between pro-Israel and pro-Palestinian protestors\nGal Gadot planned the Hollywood screening to show footage of the brutal Hamas terror attack atrocities committed during the October 7 invasion of Israel\nNoa Argamani who was kidnapped by Hamas fighters after being manhandled on a motorbike and driven across the desert\nDashcam footage showed Gaza militants who attacked an all-night music festival in southern Israel shot and killed revelers at point-blank range, then looted their belongings\nAccording to reports, the footage, which was mostly filmed by Hamas terrorists, includes murder, mass rapes and beheadings of Jewish people as well as the massacre at the Nova music festival.\nSome Knesset members were so overwhelmed by the video's content that they left the screening mid-view.\nThe American Jewish Committee and the Anti-Defamation League helped to organize the screenings.\nNattiv shared a redacted image of the invitation on social media Sunday, captioning the post 'Because the world needs to know. #neveragainisnow'.\nGadot has not publicly commented on the screening.\nBut the actress has been particularly vocal on the Middle-Eastern war in recent weeks.\nTwo days after the initial attacks, she demanded the world not 'sit on the fence'.\nGadot served in the Israeli Defense Forces as a combat trainer over a decade ago, leading some to wonder if she would could be called to fight.\nOscar-winning director Guy Nattiv, who spearheaded the initiative, confirmed to i24 that Gadot and her husband, Yaron Varsano, 'helped make this possible'\nThe Wonder Woman star, 38, famously served in the Israeli Defense Forces as a combat trainer over a decade ago\nChildren's toys and personal items lie on the bloodstained floor of a child's bedroom, following a deadly infiltration by Hamas gunmen from the Gaza Strip, in Kibbutz Be'eri\nThe aftermath of an attack on the Supernova music Festival by Palestinian militants\nShortly after the initial attack, the former Miss Israel 2004 was one of the first Hollywood names to support Israel, writing: 'I stand with Israel you should too. The world cannot sit on the fence when these horrific acts of terror are happening!'\nThe star also asked her followers to donate funds for those affected by the attacks.\nThe barbaric October 7 attacks saw Hamas fire a barrage of rockets from Gaza and send fighters across the border, killing 1,400 people and taking about 240 hostages.\nMore than 270 bodies, mostly young people, were strewn across the site of a music festival in a Negev desert kibbutz after Hamas attackers used paragliders to cross the border and fire indiscriminately into the crowd.\nAt a nearby kibbutz in southern Israel, Hamas terrorists massacred at least 40 babies and young children, before beheading some of them and gunning down their families.\nThe onslaught saw around 70 Hamas fighters armed with machine guns and grenades storm the usually quiet Kfar Aza kibbutz in southern Israel killing men, women and children indiscriminately.\nThe terrorists went on a rampage, killing hundreds of Israelis and taking dozens hostage in places like Kfar Aza, near Sderot. Some of the houses had been almost totally destroyed in the attack with collapsed, burned walls.\nThe death toll dwarfs the scale of any past attack by Islamists apart from 9/11. Scores of Israelis were taken to Gaza as hostages, with some paraded through the streets.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Shocking moment Gal Gadot's screening of Hamas terror attack film ends in mass brawls between pro-Israel and pro-Palestinian protestors outside the Museum of Tolerance", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12728725/Shocking-moment-Gal-Gadots-screening-Hamas-terror-attack-film-ends-CHAOS-brawl-breaks-pro-Israel-pro-Palestinian-protestors.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}