{"authors": ["Jacob Kessler"], "date_download": "2024-02-05 15:43:11", "date_modify": "None", "date_publish": "2023-11-09 16:19:00", "description": "The United States has announced that Israel will initiate daily four-hour 'humanitarian pauses' in the northern Gaza region.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1833322%2Fisrael-secures-Hamas-HQ-humanitarian-pause-gaza.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5057953.jpg", "language": "en", "localpath": null, "maintext": "Palestinians evacuate to the south of Gaza\nThe United States has announced that Israel will initiate daily four-hour \"humanitarian pauses\" in the northern Gaza region, enabling people to safely evacuate, with the White House expressing support for this measure. Additionally, the U.S. has set a goal of facilitating the entry of a minimum of 150 humanitarian trucks into Gaza on a daily basis. The Israeli Defense Forces (IDF) has been conducting a military operation in central Gaza City, targeting a Hamas military base. According to the IDF, they have been engaged in operations in the heart of Gaza City, where they say Hamas's military leadership is located.\nUN agency distributes food to displaced Palestinians.\nDuring these operations, approximately 50 Hamas fighters have been killed or captured in intense battles, according to an IDF statement. The IDF carried out the raid with air support and special forces assistance, focusing on the military quarter of Hamas near Al-Shifa Hospital. The IDF alleges that this area served as the center for Hamas's intelligence and operational activities and was used to plan and prepare for the October 7th attacks in Israel. Combat in the area is ongoing The military base also houses the Hamas interior ministry, underground tunnel networks, and war rooms. Al-Shifa Hospital has been used as a shelter by many Palestinians who have been displaced due to the ongoing conflict in Gaza City.\nAftermath of an Israeli attack on Gaza.\nPresident Joe Biden requested Israeli Prime Minister Benjamin Netanyahu to implement daily pauses. The U.S. National Security Council spokesman, John Kirby, stated that the first humanitarian pause would be announced on Thursday. The Israelis have committed to providing at least three hours' advance notice for each four-hour window. During negotiations concerning the release of hostages held by Hamas, Biden asked for a pause longer than three days but ruled out the possibility of a general ceasefire. Last week, U.S. Secretary of State Antony Blinken cautioned Israel that its actions in intensifying the conflict with Hamas could jeopardize the potential for long-term peace if it did not rapidly improve humanitarian conditions in Gaza for Palestinian civilians.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Israel secures Hamas HQ and agrees to 'humanitarian pause' in Gaza", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1833322/israel-secures-Hamas-HQ-humanitarian-pause-gaza"}