{"authors": ["Jacob Kessler"], "date_download": "2024-02-05 15:43:11", "date_modify": "None", "date_publish": "2023-11-09 17:59:00", "description": "Waterborne diseases, including cholera and typhoid, are likely to thrive in Gaza's conditions - meaning residents are threatened by more than bombs falling from the sky.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1833421%2Fgaza-disease-spread-cholera-typhoid-israel-war.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5058412.jpg", "language": "en", "localpath": null, "maintext": "Palestinians evacuate to the south of Gaza\nHunkered down residents in Gaza are facing the prospect of serious disease as conditions caused by Israeli attacks have led to unsanitary conditions. The International Rescue Committee (IRC) has issued a dire warning about an impending public health crisis in Gaza, as the healthcare system teeters on the brink of collapse. Waterborne diseases, including cholera and typhoid, are more likely to thrive due to unsafe water, sanitation and poor hygiene. The UN Office for the Coordination of Humanitarian Affairs estimates that 95 percent of the population lacks access to safe water and 64 percent of primary health facilities have been shuttered. Life-saving medicines have also been held up at the Rafah crossing. READ MORE: Israel obliterates 130 Hamas tunnels as its grip on Gaza City tightens\nPalestinians continue to flee the North of Gaza.\nIn a press release, the IRC has called for an immediate humanitarian ceasefire. This ceasefire would allow aid to flow into Gaza, enable the evacuation of the injured, facilitate hostage negotiations and releases, and bring in protection to reduce suffering. Bob Kitchen, the IRC's VP of Emergencies, emphasized the gravity of the situation. He said: \"The humanitarian suffering in Gaza has already reached catastrophic levels, and it’s set to get worse unless something changes immediately. \"While the overwhelming driver of mortality remains the ongoing violence and destruction, a humanitarian ceasefire now would also serve to help aid agencies get ahead of a looming public health crisis within an already vast humanitarian crisis.\"\nThe Israeli army has said they have opened safe corridors for Palestinians to flee the North.\nGaza's water and sanitation systems, as well as its fragile healthcare sector, have been severely damaged by airstrikes. Health facilities are overwhelmed with trauma patients, facing a dangerous shortage of medicines and fuel. These conditions, compounded by the lack of safe water, are ripe for the spread of communicable and waterborne diseases, particularly affecting children, and can lead to preventable deaths. The IRC has said it would like to deploy its expertise to avoid this catastrophe but says it requires a \"humanitarian ceasefire\" to allow for the free flow of aid. Kitchen added: \"Immediate and sustained diplomatic intervention is urgently needed to enable a humanitarian ceasefire, which would pave the way for addressing these pressing humanitarian and protection needs and halt the health catastrophe that will lead to more deaths, particularly among children.\"\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Gaza on the brink: Trapped civilians at risk of 'imminent' typhoid and cholera outbreak", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1833421/gaza-disease-spread-cholera-typhoid-israel-war"}