{"authors": ["Katie Davis"], "date_download": "2024-02-05 15:43:20", "date_modify": "None", "date_publish": "2023-11-09 09:12:58", "description": "THE US blasted a weapons warehouse in Syria being used by Iran-backed militias.Tensions are hitting boiling point as the US and coalition troops have", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24679800%2Fus-airstrikes-iran-weapons-base-syria%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/2023-fears-escalation-war-israel-853564823.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "Two US F-15 fighter jets struck a weapons storage facility in retaliation for recent blasts on US bases\nAIR ASSAULT US airstrikes blitz Iran-linked weapons base in Syria killing 9 as fears grow Israel war will engulf Middle East\nTHE US blasted a weapons warehouse in Syria being used by Iran-backed militias.\nTensions are hitting boiling point as the US and coalition troops have been attacked at least 40 times in Iraq and Syria by Iran-backed forces since the start of October.\n2 The weapons base in Syria was blasted by US fighter jets Credit: AFP\nLate on Wednesday, two US military F-15 fighter jets struck a weapons storage facility in retaliation, the Pentagon said.\nMultiple bombs were dropped during the blitz near Maysulun in Deir el-Zour on a site that was known to be used by Iran's Revolutionary Guard, US officials said.\nThe Syrian Observatory for Human Rights war monitor said the strike killed nine people affiliated with Iran-backed groups in Syria.\nUS Defense Secretary Lloyd Austin insisted the blast was in retaliation for recent attacks against American forces, which have left 45 soldiers with traumatic brain injuries or minor wounds.\nHe demanded blitzes against US troops stop.\nAustin added: \"If attacks by Iran's proxies against US forces continue, we will not hesitate to take further necessary measures to protect our people.\n\"The President has no higher priority than the safety of U.S. personnel, and he directed today’s action to make clear that the United States will defend itself, its personnel, and its interests.\"\nIt is the second time in less than two weeks that the US has bombed facilities used by the militant groups, many operating under the umbrella of the Islamic Resistance in Iraq.\nA military official said people were seen at the warehouse during the day as the US military watched the site for hours, but the number decreased to about “a couple” overnight when the strike occurred.\nThe official said the strike triggered secondary explosions, indicating the presences of weapons, but the US believes that no civilians were killed.\nThe strike was aimed at “disrupting and degrading the capabilities of groups directly responsible for attacking US forces in the region” by specifically targeting facilities associated with the Revolutionary Guard, a senior defense official added.\nIt comes amid fears the Israel-Hamas war could erupt across the whole of the Middle East.\nWashington has complained that Tehran is stepping up its attacks on American targets using its regional proxies in revenge for Israel's bombardment of Gaza.\nWhite House spokesman John Kirby said that Iran was \"actively facilitating\" the assaults and \"spurring on others who may want to exploit the conflict\".\nUS troops were understood to be evacuating Syrian bases after being targeted by a huge wave of Iran-backed militia attacks.", "source_domain": "www.thesun.co.uk", "text": null, "title": "US airstrikes blitz Iran-linked weapons base in Syria killing 9 as fears grow Israel war will engulf Middle East", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24679800/us-airstrikes-iran-weapons-base-syria/"}