{"authors": [], "date_download": "2024-02-05 15:43:23", "date_modify": "None", "date_publish": "2023-11-09 20:44:59", "description": "Police are investigating fights that erupted among pro-Israeli and pro-Palestinian demonstrators on streets outside Los Angeles’ Museum of Tolerance after a private screening of video showing the Oct. 7 attack on Israel by Hamas militants", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-hamas-los-angeles-police-department-karen-bass-simon-wiesenthal-center-b2444873.html.json", "image_url": "https://static.independent.co.uk/2023/11/09/20/Los_Angeles_Demonstrators_Brawl_01901.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nStreet fights erupted between pro-Israeli and pro-Palestinian demonstrators outside Los Angeles' Museum of Tolerance after a private screening of video showing the Oct. 7 attack on Israel by Hamas militants.\nThe Los Angeles Times reported that 150 people attended the private screening of “Bearing Witness to the October 7th Massacre,” that included graphic footage captured by Hamas militants’ body cameras and cellphones and was compiled by the Israel Defense Forces.\nOutside the museum, demonstrators waved flags and got into shouting matches, before dispersing as the event ended, the newspaper reported. But an hour later, a small group of demonstrators returned and fistfights broke out.\n“Two reports for battery were taken and will be thoroughly investigated,” the Los Angeles Police Department said in a statement Thursday. “At this time, we do not have suspects in custody relating to the battery, or for any other reason relating to this event.”\nThe video has also been screened for world leaders and journalists in other countries, the Times said.\nLos Angeles Mayor Karen Bass called for unity after the Wednesday night fight.\n“We cannot allow current worldwide tension to devolve into this unacceptable violence in our city,” she wrote in a social media post. “This is a time of immense pain and distress for thousands of Angelenos. We must stand together.”\nThe Museum of Tolerance describes itself as the educational arm of the Simon Wiesenthal Center, the Jewish human rights organization named for a renowned Nazi hunter. A telephone message seeking comment on the clash was left at the museum's media office.\nThe brawl came two days after a pro-Israeli demonstrator died from head injuries following a confrontation with a pro-Palestinian demonstrator in suburban Thousand Oaks, northwest of Los Angeles. The death remains under investigation and no one has been arrested.", "source_domain": "www.independent.co.uk", "text": null, "title": "Demonstrators brawl outside LA's Museum of Tolerance after screening of Hamas attack video", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-hamas-los-angeles-police-department-karen-bass-simon-wiesenthal-center-b2444873.html"}