{"authors": ["Léonie Chao-Fong", "Yohannes Lowe", "Caroline Davies", "Adam Fulton"], "date_download": "2024-02-05 15:16:34", "date_modify": "None", "date_publish": "2024-01-22 19:10:07", "description": "US defence official dismissed reports of attack against a US military cargo ship, Ocean Jazz, as Houthi propaganda", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F22%2Fmiddle-east-crisis-live-updates-gaza-hostages-families-protest-release-benjamin-netanyahu-israel-hamas-war-eu-palestine-talks.json", "image_url": "https://i.guim.co.uk/img/media/262bb15b4a5ec90bb1455ff175d3fba9d09e31b1/0_178_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d09bad06cdf7353b775a2100a19fac3a", "language": "en", "localpath": null, "maintext": "From 22 Jan 2024 20.07 CET US denies Houthi claim that it attacked American ship in Gulf of Aden - report US officials have said the claim by Yemen’s Houthi forces that it carried out an attack against a US military cargo ship, Ocean Jazz, in the Gulf of Aden is not true. A US defense official, speaking to Fox News, dismissed the report as a Houthi propaganda, adding that the US military is not seeing or tracking any attacks at this time. From Fox News’ Liz Friden: U.S. defense officials tell Fox News reports the U.S. flagged cargo ship Ocean Jazz was targeted by Houthi's in the Gulf of Aden is not true. One of the officials dismissed this as Houthi propaganda and said the U.S. military is not seeing or tracking any attacks at this time. — Liz Friden (@Liz_Friden) January 22, 2024\nUpdated at 20.08 CET\n22 Jan 2024 20.07 CET US denies Houthi claim that it attacked American ship in Gulf of Aden - report US officials have said the claim by Yemen’s Houthi forces that it carried out an attack against a US military cargo ship, Ocean Jazz, in the Gulf of Aden is not true. A US defense official, speaking to Fox News, dismissed the report as a Houthi propaganda, adding that the US military is not seeing or tracking any attacks at this time. From Fox News’ Liz Friden: U.S. defense officials tell Fox News reports the U.S. flagged cargo ship Ocean Jazz was targeted by Houthi's in the Gulf of Aden is not true. One of the officials dismissed this as Houthi propaganda and said the U.S. military is not seeing or tracking any attacks at this time. — Liz Friden (@Liz_Friden) January 22, 2024\nUpdated at 20.08 CET\n22 Jan 2024 19.53 CET The US state department said it was devastated by the death of a Palestinian American teenager in the occupied West Bank. In a statement, reported by Reuters, the US state department called for an urgent investigation to determine how the 17-year-old died and to hold accountable those responsible. The death of Tawfiq Ajaq in the West Bank came as tensions have been rising between Israel and the US, and drew an immediate expression of concern from the White House. View image in fullscreen A reception for late Palestinian-American teenager Tawfiq Ajaq, 17, who was killed Friday by Israeli fire in the occupied West Bank, at Masjid Omar mosque in Harvey, Louisiana, US. Photograph: Sophia Germer/AP Ajaq was fatally shot on Friday in the West Bank, where about 370 Palestinians have been killed by Israeli fire since 7 October. His cousin, Mohammad Ejak, 16, said Tawfiq was shot while driving to a grove of olive trees owned by the family near their village, the Washington Post reported. He said: We did not throw any rocks at anyone’s car, and we didn’t even get out of our own car before the shots were fired at us.\n22 Jan 2024 19.39 CET Lisa O'Carroll The Israeli foreign minister has been criticised by one of the EU’s most senior diplomats for not engaging fully with a summit of foreign ministers in Brussels designed to pave the way for a peace plan in the Middle East. Josep Borrell, the EU’s high representative, told reporters that Israel Katz had come to the meeting and presented two videos to the bloc’s foreign ministers. One was for an artificial island off the coast of Gaza and another on a railway linking the Middle East to India. Borrell said: This didn’t have much to do with what we were discussing. He added: I think the minister could have made better use of his time to worry about the security of his country and the high number of deaths in the Middle East and the high death toll in Gaza. View image in fullscreen EU foreign policy chief Josep Borrell (R) talks with Israel's foreign affairs minister Israel Katz (L) during a Foreign Affairs Council (FAC) meeting at the EU headquarters in Brussels on Monday. Photograph: John Thys/AFP/Getty Images\n22 Jan 2024 19.32 CET Israel’s foreign ministry has denied that its foreign minister, Israel Katz, suggested that Palestinians could be housed on an artificial island in the Mediterranean during his presentation to his EU ministers in Brussels. Israel’s foreign ministry told the Times of Israel: He never said such a thing, and there is no such plan. The outlet cites a spokesperson as saying that Katz mentioned that housing could be placed on the island as well, but did not mention anything having to do with relocating Palestinians there.\n22 Jan 2024 19.13 CET Israel’s defence minister, Yoav Gallant, has told his visiting French counterpart, Sébastien Lecornu, that attacks against Hezbollah will continue until Israel can guarantee the security of its citizens living near the border. An Israeli readout of the meeting in Tel Aviv said Gallant briefed Lecornu “on the [Israel Defense Forces]’s progress in achieving the goals of the war – namely the destruction of Hamas’s governing and military capabilities, and the return of hostages.” The Israeli minister was quoted as saying: A war in the north will be challenging for Israel, but devastating for Hezbollah and Lebanon. Israel will not cease fire until it can guarantee the safe return of the [evacuated] northern communities to their homes following a change in the security situation along the border. View image in fullscreen French Minister for the Armed Forces Sébastien Lecornu (L) shakes hands with Israel's Defence Minister Yoav Gallant during a meeting at the \"Kirya\", the Israeli army headquarters in the coastal city of Tel Aviv. Photograph: Gil Cohen-Magen/AFP/Getty Images\n22 Jan 2024 19.04 CET An attack by Iranian-backed militants on an air base housing US and Iraqi troops in western Iraq on Saturday was “a larger scale attack than we have seen before”, the Pentagon has said. Multiple missiles were fired at Ain al-Asad airbase in Iraq’s Anbar province, injuring two US personnel and one Iraqi security forces member, Pentagon deputy press secretary Sabrina Singh said today. The US personnel have returned to duty, she said. The attack was claimed by the Islamic Resistance in Iraq, a coalition that includes militias backed by Iran.\n22 Jan 2024 18.22 CET Houthis say they attacked US ship in Gulf of Aden Yemen’s Houthi movement have said its forces carried out an attack against a US military cargo ship, Ocean Jazz, in the Gulf of Aden. A statement from the Houthi military spokesperson, Yahya Sarea, reported by Reuters: The Yemeni armed forces continue to retaliate to any American or British aggression against our country by targeting all sources of threat in the Red and Arab Sea.\n22 Jan 2024 18.14 CET Lisa O'Carroll Diplomatic sources have expressed bemusement at what some interpreted as the Israel foreign minister’s suggestion that Palestinians could be housed on an artificial island in the Mediterranean as part of the peace solution talks being held by foreign ministers in Brussels today. They said the video was “largely ignored” by foreign ministers and it was not clear whether Israel Katz meant it would be used to house Palestinians or just a new port facility, which he proposed back in 2017. The EU’s chief diplomat is just about to host a press conference where he is expected to provide details on exactly what was said behind closed doors.\nUpdated at 18.55 CET\n22 Jan 2024 17.59 CET The Israel Defense Forces (IDF) have said three of its soldiers were killed on Monday in southern Gaza. From the Times of Israel’s Emanuel Fabian: The IDF announces the deaths of three officers killed during fighting in the southern Gaza Strip today, bringing the toll of slain troops in the ground offensive against Hamas to 198.\nThey are:\nMaj. David Nati Alfasi, 27, a deputy battalion commander in the Paratroopers… pic.twitter.com/HF8xLkjkP5 — Emanuel (Mannie) Fabian (@manniefabian) January 22, 2024\n22 Jan 2024 17.53 CET Phone and internet down in Gaza in 10th communications blackout of war The Gaza Strip has been plunged into another communications blackout on Monday, the Palestinian telecoms provider Paltel said, with internet and phone service cut off across the besieged territory for the 10th time since 7 October. In a social media post, Paltel said: We regret to announce that telecom services in Gaza Strip have been lost. Gaza is blacked out again for the 10th time since October 7th due to the ongoing and escalating aggression. We regret to announce that telecom services in Gaza Strip have been lost. Gaza is blacked out again for the 10th time since October 7th due to the ongoing and escalating aggression.#KeepGazaConnected — Paltel (@Paltelco) January 22, 2024 Communication services in Gaza partially returned on Friday after a weeklong blackout – the longest communications outage since the start of the war.\nUpdated at 18.35 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Middle East crisis: US officials reject Houthi claim they attacked American ship in Gulf of Aden - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/22/middle-east-crisis-live-updates-gaza-hostages-families-protest-release-benjamin-netanyahu-israel-hamas-war-eu-palestine-talks"}