{"authors": ["Morgan Phillips", "Congress Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:43:25", "date_modify": "None", "date_publish": "2023-11-09 03:36:40", "description": "Republicans roundly supported Israel in its counter-offensive in Gaza aimed at eradicating Hamas, with Nikki Haley placing blame squarely on Iran for the region's current instability.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12727035%2FRepublican-candidates-throw-weight-Israel-call-Hamas-finished-Haley-shows-foreign-policy-credentials-revealing-spoke-Netanyahu.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/09/03/77588501-0-image-a-14_1699501829122.jpg", "language": "en", "localpath": null, "maintext": "Nikki Haley tears into vindictive Vivek after he said her daughter has a TikTok account - as the crowd BOOS him and Republican rivals have enough\nWho chose that tie, Ron? Viewers jump on the Florida governor for his debate outfit choice and NOT wearing an American flag pin -\nRepublicans roundly supported Israel in its bloody counter-offensive in Gaza aimed at eradicating Hamas, with Nikki Haley placing blame squarely on Iran for the region's current instability.\n'To be very clear there would be no Hamas without Iran. There would be no Hezbollah with no Iran.\nThere would not be the Houthi going out of Iran. There wouldn't be the Iranian militias in Syria and Iraq that are trying to hear our military men and women if it hadn't been for Iran and who was funding Iran right now,' the former United Nations ambassador and South Carolina governor said at the third GOP presidential debate.\nA defense hawk who has long touted her foreign policy chops, Haley revealed she had spoken to Israeli President Benjamin Netanyahu since the October 7 attack.\n'The first thing I said to [Netanyahu] when it happened is I said finish them — finish them.'\nRepublicans roundly supported Israel in its bloody and aggressive counter-offensive in Gaza aimed at eradicating Hamas, with Nikki Haley placing blame squarely on Iran for the region's instability\nAmid growing concerns over the seemingly massive Palestinian casualties, Gov. Ron DeSantis blamed the media and asserted Israel was simply defending itself\nShe pointed to an 'unholy alliance' between Iran, China and Russia and called for the U.S. to launch its own counter attacks.\nAsked whether she supported the use of military force against Iran in response to recent attacks on US troops in Syria and Iraq by Iranian proxy groups, she said: 'The idea that our men and women could be targeted, and that we've allowed almost 100 hits to happen under Biden's watch is unthinkable.'\nIranian-backed groups have targeted U.S. and coalition forces around 40 times since the middle of October.\nShe said the U.S. needs to 'go and take out their infrastructure that they are using to make those strikes with so they can never do it again.'\nVivek Ramaswamy deemed Haley 'Dick Cheney in three-inch heels' after she seemed to endorse military action in the Middle East.\nRamaswamy has signaled he would not support sending more U.S. resources to Israel but stood by the nation's 'right to defend itself.'\nFormer New Jersey Gov. Chris Christie questioned why Israel's intelligence agency had not foreseen the October 7 Hamas attack that left 1,400 dead and over 200 taken hostage.\nIsrael's Mossad has a reputation for being one of the most effective spy agencies in the world.\nRamaswamy has signaled he would not support sending more US resources to Israel but stood by the nation's 'right to defend itself'\n'I think let's go in and make sure that Hamas can never do this again. The fact is that Israel and their intelligence community failed. They failed here and they failed the people of the State of Israel.'\nAmid growing concerns over the seemingly massive Palestinian casualties, Gov. Ron DeSantis blamed the media and asserted Israel was simply defending itself.\n'I would be telling Bibi finish the job once and for all with these butchers,' DeSantis said. 'Hamas should release every hostage and they should unconditionally surrender.'\n'I'm sick of hearing the media - I'm sick of hearing other people blame Israel just for defending itself. We will stand with Israel in word and indeed in public and in private,' he went on.\nOver 10,000 Palestinians have died in the conflict with Israel, according to the Gaza Health Ministry. Those figures have not been independently verified.\nAround 1.5 million of Gaza's 2.2 million population has been displaced, according to the United Nations. Neighboring countries like Egypt and Jordan have refused to take more Palestinians in.\nIsraeli troops are now advancing 'deep inside' Gaza City where they are fighting intense and bloody battles against Hamas terrorists. Israel blames civilian casualties on Hamas hiding among civilian hotbeds.\nThe Israeli military said Hamas militants fired anti-tank missiles at Israeli forces from nearby hospitals and soldiers found weapons hidden in a school in northern Gaza.\nThe military wing of Hamas, which has ruled the small, densely populated territory for 16 years, said its fighters were inflicting heavy losses and damage on advancing Israeli forces. It was not possible to verify the battlefield claims of either side.\nIsrael says 30 of its soldiers have been killed in Gaza since the ground offensive began, and Palestinian militants have continued to fire rockets into Israel daily.\nThe death toll on both sides is without precedent in decades of Israeli-Palestinian violence, and is continuing to raise fears of a wider Middle East conflict.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Republican candidates throw their full weight behind Israel and call for Hamas to be 'finished': Haley shows off her foreign policy credentials by revealing she spoke to Netanyahu", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12727035/Republican-candidates-throw-weight-Israel-call-Hamas-finished-Haley-shows-foreign-policy-credentials-revealing-spoke-Netanyahu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}