{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:43:26", "date_modify": "None", "date_publish": "2023-11-08 08:29:33", "description": "Turkey's government has accused these multinational companies of supporting Israel.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fturkish-parliament-bans-coca-cola-nestle-premises-1721395.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721133/turkish-parliament.jpg", "language": "en", "localpath": null, "maintext": "The Turkish parliament has banned Coca-Cola and Nestle products due to their alleged support of Israel. \"It was decided that the products of companies that support Israel will not be sold in restaurants, cafeterias, and tea houses in the parliament campus,\" the statement read.\nHowever, the statement did not mention the names of the companies concerned. It also did not specify how these firms have been supporting Israel. According to some Turkish media reports, only Coca-Cola and Nestle products have been removed from the menu.\nTurkey's government has been critical of Israel's bombardment of Gaza after Hamas' October 7 attack on the country. The two countries have seen a significant reduction in trade volume since the start of the war.\nIt had also recalled its ambassador to Israel after the continuous bombing which has affected civilians in Gaza. Turkey has also seen massive protests against Israeli operations in Gaza, writes Reuters.\nThe massive assault by Hamas militants on October 7 resulted in the deaths of 1,400 people in Israel. They also took more than 200 people as captives. The Hamas gunmen crossed over into Israel by land, sea, and air, attacking the southern and central parts of Israel, including Tel Aviv and Jerusalem.\nIn retaliation for the Hamas attacks, Israel's prime minister formally declared war against the militant outfit.\nA third mice released in a McDonald's this time in small heath Birmingham McDonald's https://t.co/7k6Y9c9Q5c pic.twitter.com/gqP8L96acU — London & UK Street News (@CrimeLdn) November 1, 2023\nMore than 10,000 Palestinians, including 4,104 children, have since been killed in retaliatory Israeli strikes after the Hamas attack, according to the Gaza Health Ministry, which is also controlled by Hamas.\nRecently, fast food chain McDonald's also came under fire for giving out free food to the Israel Defense Forces.\nThe fast food chain decided to give free meals to IDF soldiers during the first week of the war against Hamas.\nSome social media posts claimed that it had given out 100,000 free meals. The move also sparked protests in the UK. Last week, a man dumped dozens of live rodents dyed in the colours of the Palestinian flag at a McDonald's restaurant in Birmingham. International coffee chain Starbucks is also seeing boycott calls on social media.\nAnti-Israel protests have been reported in several parts of the world, including the UK. There has also been an increase in anti-Semitic incidents.\nLondon witnessed a 1,353% rise in antisemitic incidents in the first week of the Hamas attack, according to the Met Police. Anti-semitism is on the rise in European countries like France and Germany as well, and Jews fear backlash after Israel retaliated to the Hamas attack.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Turkish Parliament Bans Coca-Cola, Nestle From Premises", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/turkish-parliament-bans-coca-cola-nestle-premises-1721395"}