{"authors": ["Lucas Hill-Paul"], "date_download": "2024-02-05 15:43:29", "date_modify": "None", "date_publish": "2023-11-08 09:12:00", "description": "Israeli actress Gal Gadot is being slammed by a Jewish organisation for a planned screening of a documentary film featuring graphic footage of Hamas attacks.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fcelebrity-news%2F1832712%2FGal-Gadot-backlash-Hamas-attack-footage-screening-Israel-IDF.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/79/1200x712/5055081.jpg", "language": "en", "localpath": null, "maintext": "Israel: Police rescue young girls after Hamas attack\nGal Gadot slammed for planned screening of graphic Hamas attack footage\nHowever, the Hollywood star’s participation in the film has now come under fire from the activist organisation Jewish Voice for Peace, which brands itself as anti-Zionist. The org’s LA chapter told TMZ that they consider the screening a “propaganda event”. They claim the footage won’t show the full picture of the Israel-Hamas conflict, particularly the thousands of innocent Palestinian civilians being killed in the crossfire. This footage will only “[fan] the flames of war and genocide,” they said.\nGal Gadot served in the IDF before she started her Hollywood career\nPer TMZ, “Israel is undermining its own mission of trying to save hostages still being held by Hamas through their brutal tactics.” The Alliance for Middle East Peace (ALLMEP), a neutral organization that represents both Israeli and Palestinian peacebuilders, has also weighed in. They told the publication: “There has been some very disturbing denial and obfuscation of the terrible crimes committed on October 7th. “It is understandable that there would be a wish to prevent that denial from becoming more widespread.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending\nThe screening will showcase 'what really happened' on October 7\n“However, this needs to be balanced by the fact that we are dealing with increasingly traumatised people - both in the region and around the world - who have been exposed to images, both in the attacks in Israel and now the airstrikes in Gaza, that they cannot unsee.” “This is particularly worrying for children and young people,” they added. “ALLMEP is focusing efforts on repairing relations between Israelis and Palestinians and furthering peace. “Which is ultimately how we can prevent shocking scenes such as these from ever occurring again.” Express.co.uk has approached Gal Gadot’s representatives for comment.", "source_domain": "www.express.co.uk", "text": null, "title": "Wonder Woman star Gal Gadot slammed for planned screening of graphic Hamas attacks", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/celebrity-news/1832712/Gal-Gadot-backlash-Hamas-attack-footage-screening-Israel-IDF"}