{"authors": ["Martin Belam", "Léonie Chao-Fong"], "date_download": "2024-02-05 15:43:35", "date_modify": "None", "date_publish": "2023-11-08 20:19:52", "description": "IDF says Hamas has ‘lost control’ of northern Gaza; Gaza health ministry says number of dead exceeds 10,500", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F08%2Fisrael-hamas-what-we-know-on-day-33.json", "image_url": "https://i.guim.co.uk/img/media/180c3a808f7e2f5040f42fd2823f0381a62e17cd/0_373_5598_3359/master/5598.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ce03caf9d704e9ccdc15f8346ca0094a", "language": "en", "localpath": null, "maintext": "An Israel Defense Forces (IDF) spokesperson has said Hamas has “lost control” of northern Gaza as thousands of Palestinian civilians fled south. “We saw 50,000 Gazans move from the northern Gaza Strip to the south. They are moving because they understand that Hamas has lost control in the north,” Daniel Hagari said in a Wednesday briefing.\nIsrael has claimed to have destroyed 130 Hamas tunnels in the Gaza Strip since it began its ground operations. In videos posted to social media by Hagari, it showed what it said was evidence of the destruction.\nIsraeli airstrikes in Gaza have killed dozens of Hamas commanders as troops advance deeper into the battered territory, with some fighting in “the heart of Gaza City”, IDF officials and analysts have said. However, there were doubts over the importance of the dead commanders within Hamas, and analysts said there was no obvious sign that the organisation had yet been significantly weakened.\nJonathan Conricus, who is acting as a spokesperson for the Israeli military during the conflict, has described the Hamas leadership inside and outside of Gaza as “dead men walking”. He said “The directive is definitely to kill or capture … all the leaders of Hamas. Those who planned, facilitated, and executed the murderous 7 October massacre in Israel. We’ve said so clearly. All of them are dead men walking. And it’s only a matter of time inside Gaza and outside of Gaza, until these Hamas leaders will either be captured or killed by Israel.”\nIsrael has claimed to kill the senior weapon maker of Hamas, Mohsen Abu Zina. The IDF described him as “an expert in developing strategic weapons and rockets used by Hamas terrorists”.\nEylon Levy, an Israeli government spokesperson, told Sky News in the UK on Wednesday that only 100,000 civilians remained in northern Gaza out of the population of 1.1 million.\nThe Hamas-run health ministry in the Gaza Strip has said that the number of people killed in Gaza by Israeli military actions since the start of the war on 7 October has risen to 10,569. It says 4,324 of these are children, and that a further 26,457 Palestinians have been injured.\nUnder white flags and carrying a few possessions, thousands of Palestinian civilians attempted to make the perilous journey to the south of Gaza under the watch of Israeli tanks as the sounds of war rang out in the near distance. On Wednesday the scale of the movement prompted the IDF to extend the period of the “safe corridor” by an extra hour “in reaction to [Palestinians] sizeable response” to Israel’s call for them to use the corridor to flee.\nThe UN’s human rights chief, Volker Türk, has said both Israel and Hamas have committed war crimes. Speaking during a visit to the Rafah crossing and El Arish hospital in Egypt on Wednesday, Türk described the border crossing into Gaza as an “unjustly, outrageously thin” lifeline and as “the gates to a living nightmare” where Palestinian civilians are “suffocating”.\nThe UN secretary general, António Guterres, has said there is something “clearly wrong” with Israel’s military operations because of the number of civilians killed in the Gaza Strip. Guterres, speaking on Wednesday, said it is “absolutely essential” to have a flow of humanitarian aid into Gaza to meet the “dramatic” needs of the population in the Palestinian territory.\nForeign ministers from the G7 called Wednesday for a “humanitarian pause” in the war between Israel and Hamas to allow essential supplies to be delivered to desperate civilians in Gaza. Speaking to reporters after a meeting in Tokyo, Japan’s foreign minister, Yoko Kamikawa, said the G7 had confirmed the need for “urgent action to address the humanitarian crisis” in Gaza.\nCanada’s prime minister, Justin Trudeau, has called for a significant humanitarian pause in Gaza to allow for the release of all hostages and the delivery of aid to the Palestinian territory. Canada had previously called for a series of halts in the fighting but had steered clear of advocating a longer pause.\nUS secretary of state, Antony Blinken, again rejected calls for ‘a ceasefire in Gaza and Israel on Wednesday. He told the media in a press briefing in Tokyo “those calling for an immediate ceasefire have an obligation to explain how to address the unacceptable result that would likely bring about. Hamas left in place, with more than 200 hostages, with the capacity and stated intent to repeat 7 October, again, and again and again.”\nBlinken also set out the US position on what he described as “a pathway to Israelis and Palestinians living side-by-side in states of their own”. He said the only way to “durable peace and security” was “no forcible displacement of Palestinians from Gaza … no use of Gaza as a platform for terrorism … No reoccupation of Gaza after the conflict ends. No attempt to blockade or besieged Gaza. No reduction in the territory of Gaza”. He later added that “Gaza cannot be continued to be run by Hamas. It is also clear that Israel cannot occupy Gaza. Now, the reality is that there may be a need for some transition period at the end of the conflict.”\nThe Palestine Red Crescent Society has said all roads are closed heading to al-Quds hospital, and that “medical teams are unable to leave the hospital to reach the injured persons”.\nThe Rafah border crossing between Gaza and Egypt was closed on Wednesday due to an unspecified “security circumstance”, a US state department spokesperson said, without providing additional details. The US expects the crossing will be reopened at “regular intervals” so that aid can enter the Gaza Strip and foreign nationals can continue to depart, Vedant Patel said.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: what we know on day 33", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/08/israel-hamas-what-we-know-on-day-33"}