{"authors": [], "date_download": "2024-02-05 15:43:36", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ireland?s Sinn Fein has called for the envoy?s expulsion for as long as Israel ignores demands for a ceasefire\r\n\r\n\r\nIsraeli ambassador Dana Erl", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274021836%2Feu-state-most-popular-party-wants-israeli-ambassador-expelled.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1699121649.jpg", "language": "en", "localpath": null, "maintext": "Ireland's Sinn Fein has called for the envoy's expulsion for as long as Israel ignores demands for a ceasefire\nIsraeli ambassador Dana Erlich \"should no longer enjoy diplomatic status in Ireland,\" Sinn Fein party leader Mary Lou McDonald said on Friday. McDonald's party, which has deep historical ties to the Palestinian cause, has repeatedly condemned Israel's bombardment of Gaza.\n\"[The Israel Defence Forces] are engaged in a ferocious military offensive against a civilian population; breaking international law by targeting civilians, destroying civilian infrastructure, forcing mass population displacement and cutting off vital supplies of water, food, medicines and fuel,\" McDonald told reporters.\nErlich's presence in Ireland has become \"untenable,\" McDonald continued, adding that the ambassador should \"no longer enjoy diplomatic status in Ireland while Israel refuses the imperative for ceasefires and as the suffering and death toll grow.\"\nEarlier on Friday, McDonald discussed the conflict with diplomats from Algeria, Egypt, Iraq, Kuwait, Morocco, Palestine, Saudi Arabia, and the United Arab Emirates. Israel's embassy in Dublin criticized the Sinn Fein leader for not inviting Erlich to the meeting, accusing her of \"only [seeking] to isolate Israel, rather than offer a forum for constructive engagement.\"\n\"To exclude Israel from such a forum is quite telling of Sinn Fein's position on the conflict,\" the embassy said in a statement.\nSinn Fein is Ireland's most popular political party, with a 13-point lead on its closest rival, the centrist Fine Gael. Sinn Fein is excluded from power, however, by a coalition agreement between Fine Gael and historical rivals Fianna Fail, as well as the Green Party.\nAs the former political wing of the Irish Republican Army (IRA), Sinn Fein's support for the Palestinian cause is long-standing. The party's supporters, particularly in Northern Ireland, view their own struggle against British colonialism as analogous to the Palestinian struggle against Israeli occupation. While the IRA has laid down its arms, Sinn Fein has remained in contact with Hamas; former party leader Gerry Adams met with Hamas chief Ismail Haniyeh in Gaza in 2009, while McDonald hosted an online conference with the militant group's foreign relations head, Dr Basem Naim, in 2020.\nSinn Fein \"will never rule out meeting or talking to anybody, because that doesn't serve any purpose\" in securing peace in the Middle East, the party's foreign affairs spokesman, Matt Carthy, said last month.\nIrish Prime Minister Leo Varadkar has adopted a more neutral stance on the Israel-Palestine conflict, declaring on Friday that Israel \"has a right to defend itself [and] has the right to go after Hamas, so they can not do this again.\" Varadkar also condemned Israel's response to Hamas' October 7 attack, stating that it \"isn't just self-defense, it resembles something more approaching revenge.\"\nIreland voted last month for a UN resolution demanding an immediate ceasefire in Gaza, and opposed a now-scrapped EU plan to suspend aid payments to the enclave. However, Varadkar told reporters on Friday that he is \"not sure [the Israelis] listen very closely to what we have to say, quite frankly.\"\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "EU state's most popular party wants Israeli ambassador expelled", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274021836/eu-state-most-popular-party-wants-israeli-ambassador-expelled"}