{"authors": ["Will Potter", "Will Potter For Dailymail.Com"], "date_download": "2024-02-05 15:43:37", "date_modify": "None", "date_publish": "2023-11-08 22:53:06", "description": "The Pentagon confirmed two F-15 fighter jets were involved in the 'self-defense' mission as tensions reaching boiling point in the Middle East.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12727493%2FUS-conducts-airstrikes-Islamic-Revolutionary-Guard-weapons-depots-Syria.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/08/22/77579169-0-image-a-30_1699484346197.jpg", "language": "en", "localpath": null, "maintext": "The US has conducted airstrikes on two weapons facilities in Syria that are used by Iran's Revolutionary Guard.\nThe Pentagon confirmed two F-15 fighter jets were involved in the 'self-defense' mission as tensions are reaching boiling point in the Middle East.\nThe strike was confirmed hours after reports emerged that Iran-backed Houthi forces had shot down a US MQ-9 Reaper drone off the coast of Yemen.\nUS Secretary of Defense Lloyd Austin said in a statement after the strikes that the United States remains 'fully prepared to take further necessary measures to protect our people and our facilities.'\nThe strikes are the second conducted by the US military in less than two weeks, which officials say are in retaliation to over 40 attacks by Iranian proxies against US troops in the region since Hamas' October 7 attacks.\nThe US has conducted airstrikes on two weapons facilities in Syria that are used by Iran's Revolutionary Guard\nAustin continued in the statement: 'This strike was conducted by two US F-15s against a weapons stage facility.'\n'This precision self-defense strike is a response to a series of attacks against US personnel in Iraq and Syria by IRGC-Quds Force affiliates,' the statement read.\n'The President has no higher priority than the safety of US personnel, and he directed today's action to make clear that the United States will defend itself, its personel, and its interests.\n'The United States is fully prepared to take further necessary measures to protect our people and our facilities. We urge against any escalation.'\nAustin concluded by noting that US military personnel will 'continue to conduct counter-ISIS missions in Iraq and Syria.'\nThe strikes come at a time of heightened global tensions and advancing military operations across the world, with Wednesday's moves coinciding with a Houthi-rebel attack on a US MQ-9 reaper drone in Yemen.\nA senior US military official told Times of Israel that investigations are ongoing to determine if the drone had been shot down over international airspace.\nThe US strikes come two weeks after US F-16 fighter jets conducted airstrikes against Iranian proxy forces in Syria in retaliation for attacks against US troops in Middle East\nThe escalation comes after two Iranian-controlled military sites in eastern Syria were also hit by US airstrikes two weeks ago.\nAt the time, The Pentagon said the strikes were not connected to the Israel-Hamas war, however analysts have said they are designed to send a warning to Iran not to take advantage of the region's turmoil.\nIt comes after Iran's Foreign Minister, Hossein Amir-Abdollahian told the United Nations that if Israel's offensive against Palestine does not end, the United States will 'not be spared from this fire.'\nThe US strike two weeks ago saw the Air Force scramble two F-16 fighter jets to a weapons and ammunition plant near Abu Kamal.\nNo deaths were reported in the US retaliatory strikes, and a U.S. official told Voice of America's Jeff Seldin that the locations were chosen because there were no civilians present.\nIslamic Revolutionary Guard Corps (IRGC) officer pictured taking part in a military drill in the northwestern region of Aras along the borders of Armenia and Azerbaijan, October 20, 2022\nUS officials say the strikes are in response to repeat attacks on US troops in Iraq and Syria, stationed to counter the growing ISIS force.\nTroops have been hit by one-way drones or rockets upwards of 40 times by militia forces backed by Iran since Hamas' attacks on October 7 that killed over 1,400.\nThis included forty-five US troops injured in attacks at the al Asad Air Base in Iraq and at al Tanf garrison in Syria on October 17 and 18.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US conducts airstrikes on Islamic Revolutionary Guard weapons depots in Syria", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12727493/US-conducts-airstrikes-Islamic-Revolutionary-Guard-weapons-depots-Syria.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}