{"authors": [], "date_download": "2024-02-05 15:43:39", "date_modify": "None", "date_publish": "2023-11-08 23:05:34", "description": "The Pentagon says the U.S. has launched an airstrike on a site in eastern Syria", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-syria-iraq-pentagon-washington-b2444165.html.json", "image_url": "https://static.independent.co.uk/2023/11/08/23/United_States_Iran_Military_Strikes_98799.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. launched an airstrike on a facility in eastern Syria linked to Iranian-backed militias, in retaliation for what has been a growing number of attacks on bases housing U.S. troops in the region for the past several weeks, the Pentagon said.\nThe strike by two U.S. F-15 fighter jets was on a weapons storage facility linked to Iran's Revolutionary Guard.\n“The President has no higher priority than the safety of U.S. personnel, and he directed today’s action to make clear that the United States will defend itself, its personnel, and its interests,” Defense Secretary Lloyd Austin said in a statement.\nThis is the second time in less than two weeks that the U.S. has bombed facilities used by the militant groups, many operating under the umbrella of the Islamic Resistance in Iraq, which U.S. officials say have carried out at least 40 such attacks since Oct. 17.\nThat was the day a powerful explosion rocked a Gaza hospital, killing hundreds and triggering protests in a number of Muslim nations. The Israeli military has relentlessly attacked Gaza in retaliation for the devastating Hamas rampage in southern Israel on Oct. 7.\nIsrael denied responsibility for the al-Ahli hospital blast, and the U.S. has said its intelligence assessment found that Tel Aviv was not to blame. But the Israeli military has continued a ferocious assault on Hamas, with ground troops now deep inside Gaza City in a war that has a staggering death toll of more than 10,000 Palestinians, two-thirds of them women and children, according to the Health Ministry of the Hamas-run territory.\nThe latest U.S. strike was designed to take out supplies, weapons and ammunition in an effort to erode the abilities of the Iranian-backed militants to attack Americans based in Iraq and Syria. And it reflects the Biden administration’s determination to maintain a delicate balance. The U.S. wants to hit Iranian-backed groups suspected of targeting the U.S. as strongly as possible to deter future aggression, possibly fueled by Israel’s war against Hamas, while also working to avoid further inflaming the region and provoking a wider conflict.\nSimilar U.S. airstrikes on Oct. 27 also targeted facilities in Syria, and officials at the time said the two sites were affiliated with Iran’s Revolutionary Guard. When asked why those locations in Syria were chosen — since many of the attacks have happened in Iraq — officials said the U.S. went after storage sites for munitions that could be linked to the strikes on U.S. personnel.\nThe U.S. has often avoided bombing sites in Iraq in order to lessen the chances of killing Iraqis or angering Iraq’s leaders.\nWhile officials have said the strikes are meant to deter further attacks, they have not had that effect. Rocket and drone attacks have occurred almost daily, although in nearly all cases they have resulted in little damage and few injuries.\nAccording to the Pentagon, a total of 45 personnel have been injured and all of those were in attacks on Oct. 17 and 18. Of those, 32 were at al-Tanf garrison in southeastern Syria, with a mix of minor injuries and traumatic brain injuries, and 13 were at al-Asad air base in western Iraq, with four cases of traumatic brain injury and nine of minor injury. One person was injured at Irbil air base in Iraq.\nThe Pentagon has faced repeated questions about whether deterrence against Iran and its proxies is working because the attacks have only increased.\nAt the same time, the department has moved a number of air defense systems into the region to beef up protection for U.S. forces. And on multiple occasions, the systems have intercepted incoming strikes.", "source_domain": "www.independent.co.uk", "text": null, "title": "US launches airstrike on site in Syria in response to attacks by Iranian-backed militias", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-syria-iraq-pentagon-washington-b2444165.html"}