{"authors": [], "date_download": "2024-02-05 15:43:39", "date_modify": "None", "date_publish": "2023-11-08 20:43:28", "description": "Secretary of State Antony Blinken is calling for a united and Palestinian-led government for Gaza and the West Bank after the war ends, as a step toward Palestinian statehood", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-israel-palestinian-antony-blinken-b2444102.html.json", "image_url": "https://static.independent.co.uk/2023/11/08/20/Japan_G7_Blinken_20004.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nSecretary of State Antony Blinken called on Wednesday for a united and Palestinian-led government for Gaza and the West Bank after the war ends, as a step toward Palestinian statehood. That vision sharpens U.S. differences with ally Israel on what the future should look like for the Palestinian territories once Israel's military campaign against Hamas winds down.\nBlinken's outline of what Americans think should come next for Gaza also serves as a check on the postwar scenarios floated by officials of Israel's hard-right government and its supporters. Prime Minister Benjamin Netanyahu's statement Monday that Israel's military would likely maintain security control of Gaza for an “indefinite period\" appears to have heightened U.S. concerns.\nAny postwar governing plan for Gaza “must include Palestinian-led governance and Gaza unified with the West Bank under the Palestinian Authority,” Blinken told reporters in Japan.\nHe and other top diplomats of the Group of Seven leading industrial democracies were gathered in Tokyo for a meeting focused on Hamas' Oct. 7 attacks in Israel and on easing the suffering of the 2.3 million Palestinians trapped in Gaza under Israel's now month-old military offensive and blockade.\nBlinken reinforced the Biden administration's rejections of any return of lasting direct Israeli control in Gaza, as well as of a proposal — promoted in a policy report by Israel's intelligence ministry — to push Gaza's Palestinian residents into neighboring Egypt.\n“We’re very clear on no reoccupation, just as we’re very clear on no displacement of the Palestinian population,\" Blinken said. “And, as we’ve said before, we need to see and get to, in effect, unity of governance when it comes to Gaza and the West Bank, and ultimately to a Palestinian state.”\nThe U.S. diplomat's remarks highlight the areas of widening daylight between Netanyahu's government and its most important ally on how Israel conducts the war and its postwar relations with the Palestinians.\nThe U.S. and Israel agree that the Hamas militant group cannot return to its rule of the Gaza Strip. But none of the ideas that Israeli officials have raised for Gaza's governance after the war have included independent Palestinian rule as a credible possibility.\nThe Palestinian Authority administers semiautonomous areas of the Israeli-occupied West Bank. While internationally recognized, Palestinian President Mahmoud Abbas is widely unpopular among Palestinians even in the West Bank. Netanyahu long has depicted both Abbas and the Palestinian Authority as too incapable to be a credible partner in peace efforts with Israel.\nA member of Israel’s decision-making War Cabinet on Wednesday acknowledged that Israel does not yet have a vision for the Gaza Strip after its war against Hamas ends, saying the battle plan is open-ended and will include a long-term Israeli security presence in the besieged territory.\nThe comments by Benny Gantz added new uncertainty to the Israeli campaign in Gaza, which has come under growing international scrutiny because of the heavy civilian death toll and widespread destruction. The Group of Seven, which includes many of Israel’s closest allies, called for Israel to do more to improve the dire humanitarian situation in Gaza.\nSpeaking in Israel to international journalists, Gantz, a former defense minister and military chief of staff, said the only certainty in Israeli thinking is that Hamas can have no role in the future of Gaza. But he described a lengthy campaign in Gaza and linked the territory’s future to quiet along Israel’s northern front with Lebanon and eastern front with the West Bank.\n“Once the Gaza area is safe, and the northern area will be safe, and the Judea and Samaria region will calm down, we will settle down and review an alternative mechanism for Gaza,” he said, using the biblical term for the West Bank. “I do not know what it will be.”\n“We can come up with any mechanism we think is appropriate, but Hamas will not be part of it,” he added. “We need to replace the Hamas regime and ensure security superiority for us.”\nAsked how long the war would last, Gantz said, “there are no limitations.”\nSince Israel’s 2005 withdrawal from Gaza, successive Israeli governments have pursued a policy of severing links between the West Bank and Gaza, the two territories that, along with east Jerusalem, were to make up a future Palestinian state. The isolation of Gaza deepened after Hamas drove out the forces of Abbas in 2007 and Israel, along with Egypt, imposed a blockade.\nHamas' breakout from Gaza on Oct. 7 and Israel's deepening military response have marked the bloodiest fighting by far in repeated wars. President Joe Biden, whose administration had made a policy of not publicly pushing Netanyahu's coalition to return to long-abandoned talks to resolve the Israeli-Palestinian conflict, from the first hours after the Hamas attack declared the U.S. would stand by Israel in its military response.\nBiden rushed U.S. weapons to Israel and sent warships to the region. The American president flew on Oct. 18 to Israel, where he clasped Netanyahu and Israeli survivors of the Hamas raids, which killed more than 1,400 people, in tight hugs.\nThe past week, however, has seen increasing private and public U.S. pressure on Israel to alter how it conducts its air, ground and sea campaign against Hamas.\nDeaths in Gaza under Israeli bombardment have soared past 10,000, alienating international governments that had endorsed Israel's right of self- defense. Israel blames Hamas for the heavy death toll, accusing the group of using civilians as human shields.\nEmerging U..S.-Israeli differences already included Americans pressing for what they call humanitarian pauses in the fighting to allow for greater delivery of aid to Gaza's blockaded residents. Israeli officials have linked any cease-fires to Hamas releasing the more than 240 people it is believed to be holding hostage.\nBlinken said Wednesday the time “is now to start the conversation about the future” for Gaza.\n“Identifying the longer-term objectives and a pathway to get there will help shape our approach to addressing immediate needs,” he said.\n—-\nFederman reported from Tel Aviv.\n-", "source_domain": "www.independent.co.uk", "text": null, "title": "Blinken urges united future Palestinian government for Gaza and West Bank, widening gulf with Israel", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-israel-palestinian-antony-blinken-b2444102.html"}