{"authors": ["Christine Caparras"], "date_download": "2024-02-05 15:43:40", "date_modify": "None", "date_publish": "2023-11-08 08:14:59", "description": "A protest against \"Israel's war on Gaza\" is reportedly being planned by pro-Palestinian groups this Saturday.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Ffootball-hooligans-plan-protect-remembrance-day-pro-palestine-protesters-1721391.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721130/pro-palestine-protests.jpg", "language": "en", "localpath": null, "maintext": "In a bizarre report, it appears as though gangs of football hooligans are planning to come together this weekend under a cause that is entirely unrelated to the sport. The often rowdy groups of football die-hards are said to be planning a mass movement to \"protect\" the Cenotaph from pro-Palestine protesters during the Remembrance day events in London on Saturday and Sunday.\nThe Metropolitan Police are already on high alert in preparation for the weekend, and intelligence reports have revealed that they may have to deal with a mass influx of protesters who have the potential to clash with each another.\nRally calling for ceasefire at the Gaza Strip\nEarlier reports claimed that protests are being organised by pro-Palestinian groups. The rally is aimed to denounce the ongoing war that Israel has declared against Hamas after the brutal massacre on Israelis that took place on October 7.\nThe conflict broke out after Hamas terrorists killed 1,400 people, mostly civilians, in Israel and took more than 200 hostages in a surprise attack. This forced Israel to declare war on Gaza, where Hamas is based. The Israeli Defense Forces warned civilians to evacuate but the citizens were left with nowhere to go after Egypt and other nearby Arab nations refused to accept refugees.\nFurthermore, the IDF has revealed that Hamas have embedded their key operational facilities within the civilian zones, including hospitals and mosques. This allows the terrorists to use the civilians as human shields.\nThousands of civilians have since become collateral damage, including those that have been hit by Israeli strikes and misfired rockets from within Gaza itself.\nAs a result, mass protests have erupted around the world calling for a humanitarian ceasefire in order to allow the civilians a respite from the conflict. The have also been left with no electricity, fuel, food and medical supplies as Hamas concentrates on powering up their tunnels.\nIsrael has only allowed minimal aid to enter the territory for fear that it will all end up in the hands of the terrorists like much of the aid that Gaza has received from the international community for decades.\nNeedless to say, the civilians are suffering the most, and a march is being organised to call for a ceasefire on Saturday. The pro-Palestine protest is scheduled to start at 12:45pm at Marble Arch and end at the US embassy in south-west London, which is located just two miles from the Cenotaph. The protest is being seen as \"provocative\" and it is still unclear if the Met Police will ban the activity.\nFootball fans set to take action\nWhile the Met Police have not announced any action against the planned march, football fans are reportedly keen on taking the matter into their own hands. They want to make sure that the events on Sunday won't be affected in case further pro-Palestine protests take place. Despite rooting for different football teams, these groups of fans are coming together this weekend in what could become a volatile situation.\nAccording to a report from the Daily Mail, \"Football Lads Against Extremism\" are answering a plea from veterans who had reached out to them for help \"due to the threat from the far left and pro-Palestine supporters to disrupt the Remembrance Day parade\".\nThe football supporters are planning on \"standing shoulder to shoulder with our veterans that fought for our freedom'.\nThe assembly is scheduled to take place at Embankment Station from 10am on Sunday. They will then proceed to Charing Cross Station before walking to Whitehall at 11am. Security will be at its highest at that time, as the National Service there will be attended by King Charles III, Prime Minister Rishi Sunak, military personnel and war veterans.\nThe police have reinforced their ranks with forces from around the UK amid concerns that the influx of protesters and hooligans may result in potential clashes.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Football 'Hooligans' Plan To Protect Remembrance Day From Pro-Palestine Protesters", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/football-hooligans-plan-protect-remembrance-day-pro-palestine-protesters-1721391"}