{"authors": [], "date_download": "2024-02-05 15:43:41", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Understanding the current conflict requires digging into the territory's decades-long history of violence Read Full Article at RT.com", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274022441%2Fland-of-legends-land-of-blood-how-gaza-became-an-eternal-war-zone.json", "image_url": "https://cdn.bignewsnetwork.com/Nzc2NTFjMzItOGZ.jpg", "language": "en", "localpath": null, "maintext": "Understanding the current conflict requires digging into the territory's decades-long history of violence\nAfter the Hamas terrorist attack on Israel, even those who did not know much about the problems of the Middle East have learned about Gaza. Supporters of both Israel and the Palestinian enclave are enraged and accuse the opposite side of inhumanity. However, the Israeli-Palestinian conflict continues to this day precisely because there is no simple and unambiguous solution to the problem. The words of British historian Thomas Carlyle are in this case more appropriate than ever: \"History will mourn everyone because everyone has suffered a bitter fate.\"\nA bloody legacy\nThe history of the city of Gaza goes back several millennia. Situated on the shores of the Mediterranean Sea, Gaza has been inhabited since the times of the Egyptian pharaohs. Of course, we are primarily interested in understanding the current crisis, but to do so, we will still need to go back in time - to the First World War, when Palestine was a remote corner of the Ottoman Empire.\nBy the beginning of World War I, there were a certain number of Jews living in Palestine. They made up a minority, but nonetheless had a prominent presence in the region. In general, the Jewish people were harmoniously integrated into the local community - they had inhabited the land since Biblical times, and for a long time there were no major conflicts with the Arab population comparable to the modern crisis.\nMeanwhile, reflecting on the post-war structure of the world, the Entente Powers turned their attention to the Middle East. Many projects concerning the Middle East existed at the time, but the most important one was proposed by British Foreign Minister Lord Balfour. Balfour considered it important to build a national home for the Jews in the Middle East.\nDespite such statements, after the First World War, Britain obtained vast territories (practically speaking, colonies) that had once belonged to the fallen Ottoman Empire. The territory of modern-day Israel was called Mandatory Palestine. Having gained control of these regions, the British generally favored the Jews, whom they considered a 'counterbalance' to the Arabs. Jewish communities and immigrants (migration was also encouraged) had an advantage over the Arabs. However, neither the Jews nor the Arabs were satisfied with British rule. As it turned out, several decades of this reckless rule were enough to heat up tensions between the two communities.\nFollowing the Second World War, a unique situation came about that made it possible to create Jewish and Arab states in Palestine. Wishing to throw off its imperial burden, Britain turned to some of the existing ideas for the Middle East. Moreover, after the genocide of the Jewish people in the Second World War, their claims to an independent state were fully justified.\nThe birth of Israel and the first conflicts\nThe borders of the future Arab and Jewish states were drawn up by the UN. However, the project turned out to be a total failure. The UN initially had good intentions - it proposed to give the parts of Palestine with large Jewish communities to the Jewish state, while the Arab state would receive the lands where the Arab population was predominant. Since the city of Jerusalem was sacred to both communities, it was assigned special status.\nOf course, neither side was content with the proposal. Firstly, both nations became torn and made up entirely of a scattering of enclaves. Secondly, the future state of Israel was allocated territories with room for growth. In light of the expected mass arrival of Jews from Europe, the Israelis were given more land than the Arabs, who had to move over. Naturally, the Arabs were furious and neither side wanted to seek compromise. In 1947, a war broke out with the aim of revising the borders. Jordan, Egypt, and other Arab States joined the side of the Arabs. The Israelis successfully fought back and even occupied some of the territories assigned by the UN to the Arabs. However, the remaining parts of Arab Palestine did not become a separate state, but were occupied by neighboring Arab nations. Jordan took control of the West Bank of the Jordan River, and Gaza was occupied by Egypt.\nDavid Ben Gurion, who was to become Israel's first Prime Minister, reads the Declaration of Independence May 14, 1948 at the museum in Tel Aviv, during the ceremony founding the State of Israel.\nZoltan Kluger / GPO via Getty Images\nIf Gaza had simply become a part of Egypt, things would not have been that bad. But the situation turned out to be much worse. In 1947, the population of Gaza numbered only 80,000 people. But Arab refugees subsequently flooded the region and the small area was forced to accommodate up to 300,000 Arabs. At that time, the situation could have already been considered a humanitarian disaster, since people lacked even the most basic necessities.\nMeanwhile, Egypt did not consider Gaza its own territory, and Gazans could not receive Egyptian citizenship. The Egyptians merely used Gaza as a 'battering ram' against Israel. With the help of Egypt, fedayeen detachments were formed in the enclave to wage guerrilla warfare against Israel.\nAt the same time, the UN created the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA). This organization helped to improve life in Gaza. Thanks to the efforts of the UN, refugee camps started to look more like normal cities and in general, life in Gaza - even though it remained difficult - became more tolerable. At that time, many people thought that the issue would soon be solved, and that the status of Gaza would soon change.\nPeople without a state\nThe situation for Gaza did soon change. In 1967, disagreements between the Jewish and Arab states resulted in the Six-Day War, which ended with Israel's occupation of the Sinai Peninsula and Gaza. By that time, almost 400,000 people lived in Gaza, three fifths of whom were refugees.\nIsrael tried to integrate the territory, but with certain conditions. Just as Gazans had been refused Egyptian passports, likewise they could not receive Israeli citizenship. Israel's policy in Gaza was marked by inconsistency. On the one hand, Israel provided jobs, and this was extremely important, since about half of the entire working population of Gaza worked in Israel. Arabs usually held unskilled jobs with low wages, but they still earned more than what they could expect in Gaza.\nOn the other hand, this arrangement hindered the economic development of Gaza. The Arabs were migrant workers - and this seemed to work fine, since incomes in Gaza were growing. But at the same time, the economy in Gaza stagnated. The rights of Arab workers were not protected in the same way as those of Israelis, and as citizens of a non-existent state, Gazans remained practically in limbo. The population of Gaza rapidly grew (as usual, the UN paid for the party). The situation was complicated by the construction of Israeli settlements in Gaza. At one point, these settlements occupied up to a third of the already overpopulated strip. Moreover, many of the settlers adopted the 'conqueror' mentality and behaved accordingly. This did not contribute to peace between the Arab and Jewish communities.\nFollowing the 1979 Egypt-Israel peace treaty, the two countries established peaceful relations, and the Gaza-Egypt border was opened once again. However, Egypt did not consider the Arabs of Gaza as their brethren, and only one checkpoint was established on the border.\nEgyptian President Anwar al-Sadat (L), Israeli Premier Menachem Begin (R) and US President Jimmy Carter (C) shake hands after a press conference in the East Room of the White House, on September 17, 1978.\nCONSOLIDATED NEWS / AFP\nA time to dig\nGaza's 'tunnel economy' dates back to the 1980s, when tunnels leading into Israel and Egypt were being actively built. Today, we hear about these tunnels primarily as terrorist infrastructure, but at the time they were constructed for economic reasons. The tunnels, which are major structures with electricity, ventilation, and even rails for trolleys, were used for smuggling goods. Many of them were built cooperatively - construction was financed directly by the people and the funds were gathered through mosques. Each tunnel became an independent commercial enterprise, and the profit margins were sometimes unbelievable - for example, a new tunnel could pay off in just a month.\nMeanwhile, the political situation was deteriorating. The fight against Israel was led by Yasser Arafat's Fatah party. In the second half of the 1980s, the Hamas movement appeared. It was formed on the basis of one of the most radical and irreconcilable Islamist groups, the Muslim Brotherhood. Hamas was determined to wage war against Israel and to completely destroy it.\nIn 1987, the First Intifada, also known as the Stone Intifada, began. The Arabs incited mass civil riots, attacked settlements in Gaza, and so on. The confrontation was severe and resulted in many casualties. After the riots were suppressed, Israel's reputation suffered a severe blow.\nIn the early 1990s, Israel agreed to negotiations. This led to the signing of the 1993 Oslo Accords, which ensured the creation of a Palestinian National Authority and a return to the project of creating a future Palestinian State. This seemed like a good solution. The Israelis handed Gaza over to the Palestinians, and constructed barriers along the border with the enclave.\nThe conflict, however, could not be fully resolved. Tel Aviv refused to make some concessions. The Arabs and Jews could not agree on the status of Jerusalem, and Arafat demanded compensation for the Arab refugees. As a result, the much bloodier Second Intifada followed. The Palestinians carried out suicide attacks, bloody assaults, and launched self-made rockets at cities. Israel retaliated in a very harsh manner, and as a result of the conflict about 1,000 Jews and 3,000 Arabs were killed. However, the Second Intifada did not just affect the people who suffered from it directly. In the aftermath of the conflict, a fortified fence was built along the Gaza perimeter with only two checkpoints leading out of the enclave: one into Egypt, the other into Israel. No one could freely exit the territory, and the sea and air routes were blocked by Israel.\nThat was the start of a real blockade. It is important to note that Israel viewed Gaza as a hotbed of terrorism, but so did Egypt, which also blocked access to its territory for Gazans.\nThe worst, however, was yet to come.\nFILE PHOTO: Palestinians walk inside a tunnel used for military exercises at a Hamas-run youth summer camp, in Gaza City.\nMOHAMMED ABED / AFP\nIn 2005, Israel completely withdrew from Gaza. Israeli settlements were dismantled, Israel withdrew its troops, and the enclave became isolated. As a result of the wars and blockade, the standard of living in Gaza dropped. Most residents did not want to become suicide bombers for the sake of jihad. However, the lid of the cauldron was tightly shut, and its contents reached a boiling point. In 2006, Hamas won the elections in Gaza, but it was not content with the victory brought about by democratic procedures. A civil war broke out in Gaza. The more moderate Fatah party was defeated, some of its leaders fled from Gaza, and some were killed. The failed Palestinian state was split into the West Bank and Gaza - not only geographically, but also politically. While in the West Bank the Israelis and Arabs found ways to co-exist together, Gaza was completely isolated. The unemployment rate surged to 50%, and Hamas activists - a bloodthirsty and fanatical extremist movement - received uncontested power.\nAll of this was accompanied by terrorist attacks launched from Gaza and the bombing of the enclave by the Israelis. At that point, the Gaza issue was already extremely difficult to solve.\nA chronic disease\nMost people in Gaza would just like to live in peace. But no one asks them what they want. The people cannot escape - both Egypt and Israel consider them potential terrorists (and it is true that there is a considerable number of real terrorists among the population). Everyone in Gaza is forced to deal with Hamas simply because there is no other government, and everyone has friends, relatives, or acquaintances among the terrorists. Finally, because of the long, painful war, people on both sides of the fence have ample reason to hate each other: Gazans suffer from bombing while Israelis suffer from terrorist attacks. And this has gone on for decades.\nIn 2006, militants from Gaza kidnapped an Israeli soldier, who spent several years in captivity and was eventually exchanged for 1,000 Palestinian prisoners, including hardcore militants. Meanwhile, missiles fired from Gaza continued to fly across the border. At this point, Israel adopted the 'grass mowing' concept: after each escalation, Israel would bomb Gaza to reduce the combat potential of Hamas. Between 2008 and 2009, the Israeli Defense Forces (IDF) conducted Operation Cast Lead and entered deep into Gaza - the army suffered minor losses, but was formally successful. However, things merely went back to the way they were before. The next major operation, called Cloud Pillar, followed in 2012. By that time, Israelis considered the constant attacks on their territory something like an inevitable disaster. But likewise, Israeli attacks on Gaza had also become routine.\nGradually, the Israelis deployed the Iron Dome - a major and reliable missile defense system that greatly reduced the damage from the shelling. A new escalation followed in 2014 (Operation Indestructible Rock), during which Israel lost 66 soldiers and some areas of Gaza were completely destroyed by heavy artillery fire.\nThe casualties suffered during Operation Indestructible Rock caused heated discussions in Israel. For a long time after that, the IDF did not attempt to enter deeper into the enclave.\nHowever, after the battles of 2014, the Israelis found what seemed like a center of balance. The Iron Dome successfully protected them from missiles fired from inside Gaza. The entire Gaza perimeter was guarded by the Gaza division, and defense heavily relied on advanced technology - cameras and remote-controlled machine gun turrets were placed along the perimeter. In the coming years, tension on the border decreased, and the sense of danger among the Israelis subsided. Combat-ready units were removed from the Gaza border, and the IDF gradually turned into a peacetime army.\nThe fundamental problem, however, remained. On the other side of the fence built by the Israelis, there was a huge enclave where two million people lived without work, future prospects, or money, and which was headed by a terrorist organization. But while the Israelis were becoming less vigilant, Hamas leaders were paying close attention to what was happening on the other side of the fence.\nOn October 7, it became clear that 'just forgetting' about Gaza is not an option. The border fence was blown up, and hundreds of militants invaded Israel.\n***\nThe Arab-Israeli conflict and especially the problems in Gaza are often said to be the result of malice - either of one side or the other. But in fact, for over a hundred years the fate of Gaza has been determined by decisions that often seemed reasonable and humane at the time, but turned out to be ridiculous and irresponsible in reality. Ill will, well-meaning incompetence, cruelty, and chauvinism all played a part - but they were not exclusive to any particular side, including the leaders of Israel and Palestine. The drama of the Middle East clearly demonstrates how easy it is to let the genie of violence and hatred out of the bottle, and how hard it is to push it back.\nAs of today, no one has succeeded in stuffing the genie back into the bottle - even after a century of effort.", "source_domain": "www.britainnews.net", "text": null, "title": "Land of legends, land of blood: How Gaza became an eternal war zone", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274022441/land-of-legends-land-of-blood-how-gaza-became-an-eternal-war-zone"}