{"authors": [], "date_download": "2024-02-05 15:43:42", "date_modify": "None", "date_publish": "2023-11-08 07:49:23", "description": "There has been fierce fighting across much of eastern and southern Ukraine", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fukraine-russia-map-invasion-frontline-latest-b2443253.html.json", "image_url": "https://static.independent.co.uk/2023/11/04/10/Russia_Ukraine_War_76348.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA Russian former military officer has suggested Vladimir Putin’s troops are weakening as he predicted the forces will be “even less capable of offensive operations than they are now” by spring 2024.\nImprisoned nationalist, Igor Girkin, said the current Ukrainian presence in the east bank of Kherson Oblast is likely to keep Russian forces busy during the winter, according to the Institute for the Study of War (ISW).\nIn a letter published by his wife, Mr Girkin also claimed that the situation for Russian forces was “gradually deteriorating” and that Russian forces were showcasing “growing weakness compared to Ukraine’s capabilities.”\nA Ukrainian APC fires towards Russian positions near Avdiivka, in the Donetsk region (AP)\nHe added that the offensive of the eastern Ukrainian town of Avdiivka, where thousands of troops are said to have died, demonstrated the Russian Army’s inability “to achieve superiority on a very narrow sector of the front”.\nIt comes as the Ukrainian General Staff reported that Ukrainian forces repelled Russian attacks in eastern Ukraine near Kupyansk, while a Russian milblogger claimed Russian forces carried out an offensive in the east.\nThe Russian Ministry of Defense (MoD) claimed that Ukrainian forces conducted unsuccessful attacks along the Kupyansk-Svatove-Kreminna line on 5 November.\nThis map shows the key points of fighting in Ukraine:\nView more\nRussian forces used fresh warfare tactics by attacking at night in foggy conditions in southern Ukraine’s Tavriia but retreated after losing some of their equipment, said Kyiv commander Oleksandr Tarnavskyi.\n“So, the other day, the enemy made an attempt to storm forward positions of paratroopers of the 79th Airborne Assault Brigade of the Ukrainian Armed Forces at night under the cover of fog,” the top official said.\nUkraine forces repelled Russian attacks in eastern Ukraine, Ukrainian officials claim (AP)\nUkrainian soldiers also repelled five Russian attacks in the Bakhmut region in the past 24 hours, the General Staff of the Armed Forces of Ukraine said in a daily update on Tuesday morning.\n“The enemy made unsuccessful attempts to regain the lost ground in the vicinity of Andriivka,” the update said, referring to another village of the same name in Ukraine’s war-torn Bakhmut.\n“In turn, the Ukrainian Defence Forces continue assault operations south of Bakhmut (Donetsk oblast), inflict losses on manpower and equipment on the enemy, and consolidate their new positions,” it added.\nA Ukrainian official said they are bracing for a renewed Russian assault on Avdiivk following several failed Russian attempts to take it.\n“The third wave will definitely happen. The enemy is regrouping after a second wave of unsuccessful attacks,” Vitaly Barabash, head of the Avdiivka military administration, said on Tuesday.\nElsewhere, Ukraine launched up to 17 drone attacks on Crimea and the Black Sea. Explosions were heard near the towns of Novofedorivka and Saky, a Russian air base on the peninsula, just after 4am, according to local reports. Russian claimed to have intercepted all the drones.", "source_domain": "www.independent.co.uk", "text": null, "title": "Mapped: Tracking Ukraine’s frontline", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-map-invasion-frontline-latest-b2443253.html"}