{"authors": [], "date_download": "2024-02-05 15:43:46", "date_modify": "None", "date_publish": "2023-11-08 20:13:11", "description": "A Russian news agency is reporting that the country is preparing to send a battalion of Ukrainian prisoners of war to the front lines in their homeland to fight on Moscow’s side in the war", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-moscow-associated-press-kyiv-royal-united-services-institute-b2444084.html.json", "image_url": "https://static.independent.co.uk/2023/11/08/20/Russia_Ukraine_Prisoners_04348.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussia is sending Ukrainian prisoners of war to the front lines of their homeland to fight on Moscow's side in the war, the Russian state news agency RIA Novosti reported.\nThe news agency said Tuesday the soldiers swore allegiance to Russia when they joined the battalion, which entered service last month.\nThe Associated Press could not immediately confirm the authenticity of the report or videos released by the news agency, or whether the POWs were coerced into their actions. Both Ukrainian military and human rights officials as well as the Russian Defense Ministry did not immediately respond to requests for comment from the AP.\nExperts say such actions would be an apparent violation of the Geneva Conventions relating to the treatment of POWs, which forbids them from being exposed to combat or from working in unhealthy or dangerous conditions — coerced or not.\n“Russian authorities might claim they are recruiting them on a voluntary basis but it’s hard to imagine a scenario where a prisoner of war’s decision could be taken truly voluntarily, given the situation of coercive custody,” said Yulia Gorbunova, senior researcher on Ukraine at Human Rights Watch.\nNick Reynolds, research fellow for Land Warfare at the Royal United Services Institute in London, added that “the entire scenario is laced with the potential for coercion.”\nA prisoner of war, he said, does not have “a huge amount of agency” and is in a “very difficult situation.”\nVideo from RIA Novosti showed the Ukrainians swearing allegiance to Russia, holding rifles and dressed in military fatigues to fight in a battalion named for medieval nobleman Bogdan Khmelnitsky, seen as a national hero in Russia for bringing parts of Ukraine under Moscow's control in the 15th century.\nThe Institute for the Study of War in Washington said there have been previous reports of Ukrainian POWs being asked to “volunteer” for the battalion. They were housed in the Olenivka prison, which was blown up in July 2022. Russia said Ukraine destroyed the prison in the country's east with a rocket, but Kyiv blamed the blast on Moscow to cover up what it alleged was abuse and killings of the POWs.\nRussia also has used inmates from its own prisons to fight in Ukraine in exchange for a commuted sentence if they survive.\nIt is also trying to bolster its forces with a \"conscription campaign in occupied Ukraine,” said the ISW's Karolina Hird.\nBy mobilizing Ukrainian POWs, deploying Russian convicts and conscripting Ukrainians who live in occupied regions, Russia is increasing its combat force \"without having to risk the social implications of conducting a general mobilization,” Hird said.\nEarlier this year, Russian media reported about 70 Ukrainian POWs joined the battalion.\nRIA Novosti reported the Ukrainians will operate as part of another unit in eastern Ukraine, and the unit's website said it has about 7,000 fighters.\nGiven the location of the unit, Hird said she expected the Ukrainian POWs would be deployed to the front lines in the Donetsk and Zaporizhzhia regions.\nReynolds said the fighters were not deployed as part of a conventional Russian military unit but were one of a number of irregular formations that don’t adhere to “normal force structure.”\n___\nFollow AP's coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia reportedly is using Ukrainian POWs to fight in their homeland on Moscow's side", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-moscow-associated-press-kyiv-royal-united-services-institute-b2444084.html"}