{"authors": ["Neha Dhillon"], "date_download": "2024-02-05 15:16:37", "date_modify": "None", "date_publish": "2024-01-21 18:39:13", "description": "IRANIAN-backed Houthi militants are trying to acquire more weapons to ramp up Red Sea missile strikes, US intelligence says.After a dramatic escalatio", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25438206%2Fhouthi-rebels-iran-weapons-attacks%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/houthi-fighters-tribesmen-stage-rally-871919556.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "IRANIAN-backed Houthi militants are trying to acquire more weapons to ramp up Red Sea missile strikes, US intelligence says.\nAfter a dramatic escalation in the attacks against ships in the area, US officials told Politico the rebel group are thought to be preparing for a strike on Western forces now.\n5 Houthi rebels are thought to be preparing for a strike on Western forces in the Red Sea Credit: AP\n5 A US-missile destroyer defeating Houthi anti-ship missiles - as tensions in the Middle East escalate Credit: AFP\n5 Iranian-made missile parts seized by the US earlier this month Credit: AP\nThe intel revealed the rebels have been carefully curating their plan of attack - pinpointing when the strikes would be ramped up and how they would gather the necessary weapons.\nThere are concerns the militants will receive even more lethal weapons from Tehran in the weeks to come.\nIran has historically backed the Houthis, providing them with all they require in terms of weapons, training and funding.\nThis month, US Navy Seals were able to seize one weapons shipment from Iran to the Houthis - intercepting a small boat filled with ballistic and anti-ship missiles.\nSuch shipments are viewed as a sign that Tehran is playing a key role in the current crisis in the Red Sea, a US official has said.\nIntelligence has revealed shipments of weapons from Iran would easily replace the ones that the Houthis have lost in recent US strikes.\nUK Defence Secretary Grant Shapps warns that Iran is \"playing a dangerous game\" in aiding the Houthi rebel attacks.\n“If you look at the situation throughout the region, throughout the Middle East, you've got the Iranian-backed Houthis, you've got Lebanese Hezbollah, you’ve got Hamas themselves trained by Iran,\" he told GB News.\n\"You've got militant groups in Iraq and Syria. They are firmly behind a lot of these problems.\n“And it's a very, very dangerous game for them to be playing.\n\"We are calling on them, and others who have an interest in the trade that comes through the Red Sea and the Suez Canal, to make that message particularly clear to the Iranians.\n\"No good can come of this and they need to calm and cool the situation in the region.”\nAdditional strikes from the Houthis are threatening to draw the US and UK even further into the conflict in the Middle East.\nThe Houthis have been framing their attacks on shipping vessels as support for the plight of Palestinians in Gaza - and as a means of pressuring Israel into stopping the war.\nHouthi spokesman Muhammed al-Bukhaiti criticised the US and UK for their role in the operations against Gaza, saying that all vessels in the region are safe as long as they have no links to Israel.\n\"The madness and idiocy of the USA and UK have played against themselves - now their ships will not be able to use one of the key trade arteries in the world,\" Bukhaiti said to Russian paper Izvestia.\n\"The war we are waging today is one of a kind in terms of its moral and ethical frontier.\n\"The whole world sympathises with Yemen's heroic stand to end the genocide of the Palestinian people.\nAlthough, some experts have suggested that Iran’s support for rebel militias in the region is actually an attempt to exploit the current crisis in order to rid the Middle East of US troops.\nBehnam Ben Taleblu, from the Foundation for Defense of Democracies, said: “In addition to putting pressure on America to end Israel’s war against Hamas, Iran also has a more localized logic at play.\n“It is trying to create a cycle of violence that leads to the eviction of U.S. forces from the region, beginning with Iraq.”\nIt comes just a day after the Islamic Resistance in Iraq, an alliance of Iranian-backed militants, fired a barrage of rockets at the Ain al-Asad airbase in Iraq.\nThe base, home to American forces in western Iraq, came under fire from multiple ballistic missiles and rockets at 6.30 pm (Baghdad time), the US Central Command said in a statement posted to X.\nIt added: \"Most of the missiles were intercepted by the base’s air defence systems while others impacted on the base.\n\"Damage assessments are ongoing.\n\"A number of U.S. personnel are undergoing evaluation for traumatic brain injuries.\n\"At least one Iraqi service member was wounded.\"\n5 The Houthi rebels claim that their attacks are in support of Palestinians Credit: AP", "source_domain": "www.thesun.co.uk", "text": null, "title": "Houthi rebels 'ask Iran for more weapons to step up Red Sea attacks' as UK warns militants are 'playing dangerous game'", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25438206/houthi-rebels-iran-weapons-attacks/"}