{"authors": ["Iwan Stone"], "date_download": "2024-02-05 15:43:51", "date_modify": "None", "date_publish": "2023-11-07 22:06:21", "description": "The musician stoked controversy over the summer by wearing a 'Nazi-style' coat to his concerts, leading to him being investigated by German police following a gig in Berlin.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12722223%2FRoger-Waters-says-Hamas-morally-bound-resist-occupation-October-7-accuses-Israel-making-stories-terror-attack.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/07/22/71877985-0-image-m-75_1699394758096.jpg", "language": "en", "localpath": null, "maintext": "Pink Floyd co-founder Roger Waters has said Hamas were 'morally bound to resist occupation' on October 7 and accused Israel of 'making up stories' about the terror attack.\nThe musician, 80, stoked controversy over the summer by wearing a 'Nazi-style' coat to his concerts, leading to him being investigated by German police following a gig in Berlin.\nSpeaking on the Rumble podcast System Update with Glenn Greenwald - the aged rocker said there was 'something very fishy' about Israel not realising Hamas were invading.\nWaters - who said he was 'an opponent of the whole Zionist exercise' went on to question the atrocities committed by Hamas - saying the terrorist organisation were 'absolutely legally and morally bound to resist'.\nWaters said: 'We don't know what they did do, but was it justified for them to resisit the occupation? Yeah!\nPINK FLOYD FOUNDER ROGER WATERS EXPOSES OCT 7 PROPAGANDA:\n“We don’t yet know what happened”\n“Maybe there were some individual cases of civilians getting killed”\n“Israel is making up stories” pic.twitter.com/3s1zBVUrgG — Sulaiman Ahmed (@ShaykhSulaiman) November 7, 2023\nPink Floyd co-founder Roger Waters stoked controversy over the summer by wearing a 'Nazi-style' coat to his concerts, leading to him being investigated by German police following a gig in Berlin\nSpeaking on the Rumble podcast System Update with Glenn Greenwald (pictured) - the aged rocker said there was 'something very fishy' about Israel not realising Hamas were invading\nSupporters of the Jewish community demonstrated outside The O2 Arena in June before Mr Waters performed (pictured)\nHe was back wearing the controversial outfit again as he performed in London\n'But again it's the Geneva convention - they are absolutely legally and morally bound to resist the occupation since 1967. It's an obligation.'\nHe continued: 'As I said in a statement after it, if war crimes were committed I condemn them.\n'They have finally come out with figures of how many people were actually killed, who they were, on that day.\n'Probably the first 400 were Israeli military personnel - that is not a war crime.\n'Of course I don't condemn that but the thing was thrown out of all proportion by the Israelis making up stories about beheading babies.'\nThe host claimed Waters had been targeted with 'character smears and attacks' - suggesting it is because he has 'expressed views that are threatening to people in power'.\nThe guitarist claimed accusations of antisemitism had come across 'because they have no answer to the argument.'\nHe continued: 'You cannot defend the state of Israel in the genocide that is going on today and tomorrow and the day after in Gaza.\nThe host of the podcast claimed Waters had been targeted with 'character smears and attacks' - suggesting it is because he has 'expressed views that are threatening to people in power'\nMr Rogers (pictured) reportedly pretended to shoot the crowd with an imitation machine gun during his hit songs In The Flesh and Run Like Hell\nMany protested outside the 02 Arena ahead of the London performance\n'It shows that you at least have a platform and that people listen to it - and it is one that they [politicians] do not want people to hear.\nWaters allegedly sang that his agent was a 'f***ing Jew' in an improvised song, according to an account from the rocker's ex-producer in an explosive documentary exploring claims that he has made antisemitic remarks.\nEzrin appears in The Dark Side of Roger Waters, a new documentary produced by the Campaign Against Antisemitism (CAA) - months after Waters appeared on stage in a Nazi-esque trench coat with a red armband as part of his most recent tour.\nIn further allegations the documentary was claimed he made antisemitic remarks such as 'dirty k***' and 'Jew food'.\nHe also allegedly mocked a Jewish musician's grandmother who died in the Holocaust.\nSpeaking about the October 7 invasion on the podcast he continued: 'Let's wait and see what happens, was my first reaction.\n'My second reaction was: \"How the hell did the Israelis not know this was going to happen?\"\n'And I'm still a little bit down that rabbit hole - didn't the Israeli army hear the bangs when they blew up whatever they had to blow up to get across the border?\nA demonstrator outside the O2 Arena before Roger Waters' performance on June 6\nWaters - who said he was 'an opponent of the whole Zionist exercise' went on to question the atrocities committed by Hamas in the documentary - saying the terrorist organisation were 'absolutely legally and morally bound to resist'\nHe compared Anne Frank to Abu Akleh, an Al Jazeera journalist who was fatally shot last year while covering an Israeli Defense Forces raid on a Palestinian refugee camp\n'There's something very fishy about that'.\nFurther allegations against Waters said he wanted a giant floating pig at his concerts emblazoned with the Star of David and offensive slogans.\nIn an email, allegedly sent by Waters in 2010, he appears to suggest to his backstage team that the pig should be made with 'dirty k***', 'follow the money' and 'scum' written on the sides.\nThe word 'k***' is a notoriously offensive word used to denigrate Jews, while the money reference is a classic anti-Jewish trope, says the new film.\nThe pig was eventually made without these terms, but with the Star of David and dollar signs, and has been a feature of Waters' concerts.\nSir Keir Starmer said his party 'fully condemns' Mr Waters for having 'clearly espoused antisemitic views'. The Labour leader suggested that shows by the rocker should be called off in order to block him from spreading his 'troubling' beliefs.\nMr Gove, the Levelling Up Secretary, claimed the former Pink Floyd bassist was 'falling short' of an expectation that those with a significant public profile 'behave responsibly and do not abuse their platform'.\nIt came after the Board of Deputies of British Jews wrote to senior politicians warning of concerns among Jewish communities in cities where the musician is scheduled to tour.\nSpeaking about the documentary, Campaign Against Antisemitism's chief executive Gideon Falter said: 'Roger Waters has repeatedly used his enormous platform to bait Jews, but he always claims that he is not antisemitic.\n'We believed that there was further evidence out there to the contrary, and the release of The Dark Side of Roger Waters now puts the evidence we obtained in the hands of the public.\n'Is Roger Waters an antisemite? Now people can make up their own minds.'\nIn his concerts and on social media, Waters makes clear his criticism of Israel's treatment of Palestinians, insisting this is his motivation rather than any antisemitism.\nHe says in video clips, repeated in Mr Ware's new documentary: 'I'm an antisemite? Are you insane?' and 'Clearly I don't have an antisemitic bone in my body; I never have, I've never done anything antisemitic; I've never said anything antisemitic.'\nIn others clips, Waters says: 'The notion that I am antisemitic is ludicrous. This is something that is aimed at anybody who tries to raise their voice against the policies of the current very right-wing, settler-based Israeli government,' and also: 'If we shout the lie loud enough - \"Roger Waters is an anti-Semite\" we'll get people to believe it. Well, no you won't - because it is a lie.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Roger Waters says Hamas were 'morally bound to resist occupation' on October 7 and accuses Israel of 'making up stories' about the terror attack", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12722223/Roger-Waters-says-Hamas-morally-bound-resist-occupation-October-7-accuses-Israel-making-stories-terror-attack.html?ns_mchannel=rssns_campaign=1490ito=1490"}