{"authors": ["Chris Jewers", "Elena Salvoni", "Perkin Amalaraj"], "date_download": "2024-02-05 15:43:53", "date_modify": "None", "date_publish": "2023-11-07 18:13:35", "description": "Hamas's Gaza leader Yahya Sinwar has been 'isolated' in his bunker, Israel's defence minister Yoav Gallant said tonight, as he confirmed IDF troops are in the heart of Gaza City.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12721777%2FHamass-Gaza-leader-Yahya-Sinwar-isolated-bunker-Israels-defence-minister-IDF-troops-heart-Gaza-City.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/07/18/77516303-0-image-a-8_1699380751967.jpg", "language": "en", "localpath": null, "maintext": "Hamas's Gaza leader Yahya Sinwar has been 'isolated' in his bunker, Israel's defence minister said tonight, as he confirmed IDF troops are in the heart of the terrorist group's 'stronghold', Gaza City.\nWar cabinet minister Yoav Gallant said in a televised statement that the Hamas leader, who has been compared to Al Qaeda's late leader Osama Bin Laden, 'is hiding in his bunker and is without contact with his associates,' but did not disclose where Sinwar's bunker is located.\n'We are in the heart of Gaza City,' Gallant told reporters. 'Gaza is the largest terrorist base ever built.'\nPrime Minister Benjamin Netanyahu tonight vowed that Israel 'will not stop' its war on the terrorist group and that the IDF is 'increasing pressure on Hamas every hour' as it encircles and infiltrates Gaza City for the first time in decades.\n'Hamas is now discovering we are coming into places they never thought we would,' he said at a press conference, adding that terrorist headquarters, tunnels and bases have been 'destroyed'.\nIsraeli forces have pushed further into the besieged enclave, which has been bombarded by airstrikes for weeks, and engaged Hamas fighters near the Shifa Hospital, it was earlier reported.\nThe IDF claims the hospital sits on top of the terror group's headquarters, and accuses Hamas's leaders of using it as a civilian shield against Israeli strikes.\nSmoke rises following Israeli strikes, amid the ongoing conflict between Israel and Hamas, in Gaza City, November 7, 2023\nIDF soldiers from the 14th Brigade, that includes tank battalion, infantry soldiers and Combat engineers. inside the northern part of Gaza strip\nWar cabinet minister Yoav Gallant said in a televised statement that the Hamas leader 'is hiding in his bunker and is without contact with his associates'\nHamas's Gaza leader Yahya Sinwar (pictured) has been 'isolated' in his bunker, Israel's defence minister said tonight\nIsraeli forces have pushed further into Gaza and engaged Hamas fighters near the Shifa Hospital, is have been reported. Above, an Israeli bulldozer is seen demolishing a building inside the Gaza Strip amid the IDF's on-going ground offensive in the territory\nIsraeli soldiers are seen operating inside the Gaza Strip in this handout picture obtained by Reuters on November 7\nRear Adm. Daniel Hagari, a spokesman for the Israeli military, said today that the country's forces were 'deepening the pressure' on Gaza City, with anticipation for a full ground offensive into the city's narrow streets now building.\nIDF troops were reportedly near the enclave's Shifa Hospital - Gaza's main and largest medical facility - which sits about 800 yards from the coast.\nThe advance comes after Benjamin Netanyahu vowed that Israel will take control of the 'overall security' of the Gaza Strip after his country's war with Hamas .\nResisting calls for a ceasefire, the PM said there would be no letup in the war to destroy the terror group, whose attack one month ago today left 1,400 dead in Israel.\nAs he spoke, it is understood that IDF troops have been preparing to enter Gaza City, a mass of narrow streets and densely packed neighbourhoods. Residents escaping the north of Gaza said they passed tanks in position to possibly storming it.\nIsrael says its forces have surrounded Gaza City, home to a third of the enclave's 2.3 million people, and are poised to storm it soon in their campaign to annihilate the Hamas terrorists who attacked Israeli towns exactly a month ago.\nThe IDF wrote on its Arabic language Telegram channel: 'For your safety, take this next opportunity to move south beyond Wadi Gaza.\n'If you care about yourself and your loved ones, head south according to our instructions. Rest assured that Hamas leaders have already taken care of defending themselves.'\nRear Admiral Daniel Hagari said the IDF killed several Hamas field commanders in airstrikes and operations overnight which aimed to 'significantly harms Hamas's ability to carry out counterattacks' - signalling the assault is drawing nearer.\nHe also said Israeli combat engineers were working to demolish each and ever tunnel they came across using 'different and diverse devices.'\nDefense Minister Yoav Gallant, meanwhile, praised the efforts of the IDF's operations in the coastal strip in the past 24 hours as being 'very impressive.'\nThe aftermath of an Israeli bombardment in Rafah in the southern Gaza Strip, November 7\nAn aerial view shows the compound of Al-Shifa hospital in Gaza City on November 7. The IDF claims the hospital sits on top of the terror group's headquarters, and accuses Hamas's leaders of using it as a civilian shield against Israeli strikes\n'The combination between the air force and ground forces shakes the Gaza Strip,' Gallant said in a video statement. On the Hamas field commanders killed in air strikes, he added: 'some of them were the ones we eliminated a day or two ago and they were replaced by others, and they were also eliminated.'\n‘They are manoeuvring on foot [and are using] armoured vehicles and tanks, along with military engineers from all directions, and they have one target – Hamas terrorists in Gaza, their infrastructure, their commanders, bunkers, communication rooms.\n‘They are tightening the noose around Gaza City.’\nTop IDF commanders have compared Sinwar, Hamas' leader, to Bin Laden for his role in the group's atrocities.\nLieutenant Colonel Richard Hecht said: 'Yahya Sinwar is the face of evil. He is the mastermind behind this, like Bin Laden was [with the 9/11 US attacks].'\nWith international criticism of Israel's conduct of the war mounting, the Hamas-run health ministry says the death toll from Israel's bombardment of the territory - launched in response to the October 7 attack - surged past 10,000 people yesterday.\nMore than 1.5 million people in densely packed Gaza have fled their homes for other parts of the territory in a desperate search for cover, with critical aid only trickling in.\nLast night, Netanyahu told ABC News the war would continue until Israel had restored 'overall security' control of Gaza, adding that Gaza should be governed by 'those who don't want to continue the way of Hamas'.\n'Israel will, for an indefinite period, have the overall security responsibility,' he said. 'When we don't have that security responsibility, what we have is the eruption of Hamas terror on a scale that we couldn't imagine.'\nBenjamin Netanyahu (pictured) has vowed Israel will take control of the 'overall security' of the Gaza Strip after his country's war with Hamas\nSmoke and flames rise as a result of Israeli illumination flare attacks over the Al-Shati refugee camp in Gaza Strip on November 6\nPeople flee following Israeli air strikes on a neighbourhood in the al-Maghazi refugee camp in the central Gaza Strip on November 6\nWhile key Israeli ally the United States is seeking a humanitarian 'pause' in the fighting, several countries and UN agencies have repeatedly called for a ceasefire.\nBut Netanyahu has resisted the calls so far, and in his comments said he had no intention of changing his approach.\n'There will be no ceasefire - general ceasefire - in Gaza, without the release of our hostages,' Netanyahu said.\n'As far as tactical, little pauses - an hour here, an hour there - we've had them before. I suppose we'll check the circumstances in order to enable goods - humanitarian goods - to come in or our hostages, individual hostages, to leave,' he added.\n'But I don't think there's going to be a general ceasefire. It will hamper the war effort, it will hamper our effort to get our hostages out, because the only thing that works on these criminals in Hamas is the military pressure we're exerting.'\nIn its October 7 attack, Hamas gunmen took more than 240 people hostage, including children and elderly people, into Gaza. The attack that prompted Israel's massive bombardment of Gaza and an intensifying ground offensive.\nAsked if there would be a pause if Hamas agrees to release the hostages, Netanyahu said 'there would be a ceasefire for that purpose, and we're waiting for that to happen. It hasn't happened so far.'\nAsked if Israel knows where the hostages are inside Gaza, the PM said while the country has some intelligence, 'I'm not sure its wise to share it here with Hamas.'\nNetanyahu's comments came after the White House said the Israeli leader had discussed potential 'tactical pauses' in a phone call with US President Joe Biden.\nHowever, no agreements were announced and the pair did not broach the possibility of a ceasefire, according to reports.\nOn his conversation with Biden, Netanyahu expressed his gratitude for the support of the United States, adding on the question of a ceasefire: 'The president himself said a ceasefire would be a surrender to Hamas, it would be a victory for Hamas.\n'You would no more have it than you would a ceasefire after the Al-Qaeda bombings of the World Trade Centre,' he added, referring to the September 11, 2001 attacks.\nOne month since the war began, the Hamas-run health ministry said the death toll in Gaza had surpassed 10,000 people - more than 4,000 of them children.\nUnited Nations Secretary-General Antonio Guterres said Gaza was becoming a 'graveyard for children'.\nIsraeli soldiers take part in ground operations at a location given as Gaza in this handout photo released by the IDF on November 7\nAn Israeli tank is seen at a location inside Gaza on November 7 amid the on-going invasion\nAn Israeli soldier takes part in ground operations at a location given as Gaza in this handout photo released November 7\nAn Israeli soldier peers through a hole is a destroyed building somewhere in Gaza, November 7\nThe Israeli army said it had pounded Gaza with 'significant' strikes on 450 targets over 24 hours since Sunday morning, and that troops were targeting Hamas commanders in underground tunnels.\nIsraeli infantry and tanks have flooded the northern half of the Gaza Strip and tightened an encirclement of Gaza City, effectively splitting the territory in two.\nIsraeli troops who have taken up positions near the Gaza border told AFP they felt proud to protect their country but also nervous as the war intensifies.\nStationed near Gaza, a 20-year-old soldier said to the news agency he was 'a bit scared to go' into the Palestinian territory if given the order.\n'You don't know if you can come back alive,' said the soldier, whose name like those of other troops cannot be published because of Israeli military censorship.\nAround 30 Israeli soldiers have been killed in the offensive, the latest on Monday, according to a report from the UN Office for the Coordination of Humanitarian Affairs (OCHA), citing Israeli sources.\nAccording to the Hamas-run health ministry, Israel's latest overnight barrage killed 292 people and hit two paediatric hospitals and Gaza's only psychiatric hospital.\n'These are massacres! They destroyed three houses over the heads of their inhabitants - women and children,' Mahmud Meshmesh, a resident of Deir al-Balah in central Gaza, told AFP.\n'We have already taken 40 bodies out of the rubble,' he said as crowds prayed around corpses wrapped in white shrouds.\nIsraeli officials accuse Hamas of building tunnels underneath hospitals, schools and places of worship in Gaza to hide fighters, store arms and ammunition, and plan attacks - charges the militant group has denied.\nIsrael has air-dropped leaflets and sent text messages ordering Palestinian civilians in northern Gaza to head south. A US official said Saturday at least 350,000 civilians remained in the worst-hit areas.\nThe Rafah crossing between the Gaza Strip and Egypt reopened Monday to allow the evacuation of foreigners and dual nationals, the Hamas government said, ending a two-day closure prompted by a dispute over the passage of ambulances.\nThis picture taken from Sderot looking into the Gaza Strip on November 7\nPalestinians walk by buildings destroyed in the Israeli bombardment of the Gaza Strip in Rafah\nPalestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip, Nov. 7\nPalestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip in Rafah\nPalestinians walk by buildings destroyed in the Israeli bombardment of the Gaza Strip in Rafah\nOn Monday, 93 aid trucks carrying food, medicine and water crossed from Egypt into Gaza, the United Nations said, but the needs are overwhelming.\nA convoy including four ambulances arrived in Egypt via the Rafah crossing on Monday, the International Committee of the Red Cross said.\n'I have lost my home and have nothing left. I came here with nothing but the clothes I'm wearing,' said Dana Okal, a Swedish passport holder.\nIsrael withdrew its troops from the Gaza Strip in 2005. A year later, Hamas won elections in Gaza, and subsequently seized control of the territory in 2007.\nThe Fatah party of Palestinian president Mahmud Abbas, which dominates the Palestinian Authority, only exercises limited autonomy in parts of the West Bank.\nUS Secretary of State Antony Blinken suggested last week that the Palestinian Authority should retake control of Gaza after the war, and visited the West Bank to meet Abbas on Sunday. He has advocated for a two-state solution.\nBut Hamas said they would never accept a puppet government in Gaza and that 'no force on Earth could annihilate' it, said senior Hamas official Osama Hamdan.\nBlinken on Tuesday concluded his latest whirlwind Middle East tour, landing in Japan for a meeting of G7 foreign ministers set to seek a common line on Gaza.\n‘This is a very important moment... for the G7 to come together in the face of this crisis and speak as we do in one clear voice,’ he said at the start of the two-day meeting in Tokyo.\nThe United States has bolstered its forces in the region, deploying two carrier strike groups and other assets to drive home its message that regional actors should not seek to take advantage of the conflict.\nSmoke rises after an Israeli strike on Gaza, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, as seen from Sderot in southern Israel, November 7\nHamas militants fired 16 rockets from Lebanon towards northern Israel on Monday, while Yemen's Iran-backed Huthi rebels claimed they had launched a fresh drone attack against Israel. Such attacks have raised fears of a wide conflict.\nThe Pentagon said Monday a US nuclear-powered Ohio-class submarine was in the Middle East to help prevent war from widening.\nMeanwhile, in the latest protest, hundreds of US Jewish activists peacefully occupied New York's Statue of Liberty on Monday to demand a ceasefire an end to the 'genocidal bombardment' of civilians in Gaza.\n'As long as the people of Gaza are screaming, we need to yell louder, no matter who attempts to silence us,' said photographer Nan Goldin at the protest.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hamas's Gaza leader Yahya Sinwar has been 'isolated' in his bunker, Israel's defence minister says as he confirms IDF troops are in the heart of Gaza City", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12721777/Hamass-Gaza-leader-Yahya-Sinwar-isolated-bunker-Israels-defence-minister-IDF-troops-heart-Gaza-City.html?ns_mchannel=rssns_campaign=1490ito=1490"}