{"authors": ["Martin Belam", "Léonie Chao-Fong"], "date_download": "2024-02-05 15:44:02", "date_modify": "None", "date_publish": "2023-11-07 20:32:27", "description": "Benjamin Netanyahu says IDF operating inside Gaza and that Israel may consider ‘tactical little pauses’ to allow hostages to exit", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F07%2Fisrael-and-hamas-at-war-what-we-know-on-day-32.json", "image_url": "https://i.guim.co.uk/img/media/46e1781867c5940b15e39e19b6d713e1971bbfcc/0_252_3800_2281/master/3800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b5928ce9edc411d56223ce7943e89c62", "language": "en", "localpath": null, "maintext": "Israel’s prime minister, Benjamin Netanyahu, said the Israel Defense Forces (IDF) are encircling Gaza City and operating inside it. In a televised statement on Tuesday, Netanyahu said there would be no ceasefire before hostages were released and urged people in Gaza to move south “because Israel will not stop”.\nNetanyahu has said Israel may consider “tactical little pauses” in fighting to allow the entry of aid or the exit of hostages from the Gaza Strip, but he again rejected calls for a ceasefire. When asked who should govern the territory after fighting ends, the Israeli prime minister told ABC news in an interview broadcast on Monday night: “Israel will for an indefinite period … have the overall security responsibility [in Gaza] because we’ve seen what happens when we don’t have that security responsibility.”\nIsrael’s defence minister, Yoav Gallant, also said the IDF are operating in the heart of Gaza City and “tightening the chokehold” around the city. In a televised statement on Tuesday, Gallant rejected any humanitarian pauses without the return of hostages.\nOn Tuesday, a moment’s silence was held in Israel to mark 30 days since the Hamas attack on Israel in which 1,400 people were killed. Vigils have been held around the world. In Jerusalem on Monday night a vigil was held with a candle lit for each victim and relatives of the dead gathered at Jerusalem’s Wailing Wall to mark a month of mourning.\nWaving white flags and holding their hands above their heads, Palestinian families fled past tanks waiting to storm Gaza City. Israel’s military gave civilians inside the encircled city a four-hour window to leave on Tuesday, as its forces prepared to retake the biggest city in the strip. The IDF said they would allow residents to leave from 10am until 2pm local time, and published a video of dozens of people along a main road. Hundreds of thousands of people are feared to still be trapped.\nIsrael’s military claims to have captured a Hamas military stronghold and detonated a Hamas weapons depot “in a civilian area” adjacent to al-Quds hospital. Israel has repeatedly claimed that Hamas is using hospital buildings to carry out military operations.\nIsraeli forces said they had severed northern Gaza from the rest of the besieged territory and pounded it with intense airstrikes on Monday, setting the stage for an expected push into Gaza City.\nThe Hamas-run health ministry in Gaza has claimed that 10,328 Palestinians have been killed within the Gaza Strip by Israeli military actions since 7 October. The number, it says, includes 4,237 children. The number of people wounded has been increased to 25,965, according to the health ministry spokesperson Dr Ashraf al-Qudra. It has not been possible for journalists to independently verify the casualty figures being issued in Gaza.\nA Palestinian journalist has been killed in an Israeli airstrike in Gaza and another was wounded, the official Palestinian news agency reported. Mohammad Abu Hasira was killed along with 42 members of his family “in an Israeli bombing that targeted his house located near the fishermen’s port west of Gaza City”, WAFA news agency reported.\nThe UN high commissioner for human rights, Volker Türk, began a five-day visit to the Middle East on Tuesday to engage with government officials and civil society on the human rights violations taking place amid Israel’s escalation in Gaza. “It has been one full month of carnage, of incessant suffering, bloodshed, destruction, outrage and despair,” Türk said in a statement.\nThe level of death and suffering in the Israel-Palestine crisis is “hard to fathom”, a World Health Organization spokesperson (WHO) has said. “Every day, you think it is the worst day and then the next day is worse,” Christian Lindmeier told journalists on Tuesday. “Nothing justifies the horror being endured by civilians in Gaza.” WHO chief Tedros Adhanom Ghebreyesus urged all parties involved to agree to a humanitarian ceasefire in Gaza and “work toward a lasting peace”. “History will judge us all by what we do to end this tragedy,” he said.\nAt least 320 foreign nationals and dependents were evacuated from Gaza through the Rafah border crossing on Tuesday, as well as 100 Egyptians and 262 Jordanians and the first group of Canadian nationals. A dozen Palestinian children who have cancer were also allowed to leave Gaza on Tuesday for treatment in Egypt.\nMore than half a million people in northern Gaza face death by starvation as food supplies run “perilously” low, an international charity has warned. Riham Jafari, coordinator of advocacy and communication for ActionAid Palestine, said “Cases of dehydration and malnutrition are increasing rapidly”.\nThe Israel Defence Forces military spokesperson Daniel Hagari has said that on Tuesday Israel has again fired into Lebanon in response to an attack. The Israel Defence Forces also claimed they intercepted “a suspicious aerial target” near the blue-line which marks the UN-drawn boundary between Israel and Lebanon.\nA Hezbollah lawmaker said on Tuesday that the Lebanese militant group would respond “double” to any Israeli attacks on civilians after a strike at the weekend that killed three children and their grandmother in south Lebanon.\nThe US secretary of state, Antony Blinken, has arrived in Japan for a meeting of Group of Seven foreign ministers expected to be dominated by the Israel-Hamas war.\nThe British Army is “posturing” itself for the prospect of a “non-combatant evacuation operation” in the Middle East in the event the Israel-Hamas conflict expands, the UK’s chief of the general staff told parliament’s defense select committee on Tuesday.\nThe British government has said it is to hold an emergency committee to consider the impact of the Israel-Hamas conflict in the UK. The prime minister’s official spokesperson said it would address important issues around “community cohesion”.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel and Hamas at war: what we know on day 32", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/07/israel-and-hamas-at-war-what-we-know-on-day-32"}