{"authors": ["Oliver Holmes"], "date_download": "2024-02-05 15:44:03", "date_modify": "None", "date_publish": "2023-11-07 18:37:56", "description": "Civilians given four-hour window to leave encircled capital but fears many are still trapped", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F07%2Fwe-saw-death-families-flee-past-tanks-as-israel-prepares-to-storm-gaza-city.json", "image_url": "https://i.guim.co.uk/img/media/cf871ebd0ceeeb13221565e7db2c58a0807009eb/0_110_3381_2029/master/3381.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ec0f4776a3211cc561b40c6047ea17d8", "language": "en", "localpath": null, "maintext": "Waving white flags and holding their hands above their heads, Palestinian families fled past tanks waiting to storm Gaza City in the next stage of the war that the Israeli prime minister, Benjamin Netanyahu, has said will give Israel “indefinite” control over the besieged territory.\nIsrael’s military gave civilians inside the encircled city a four-hour window to leave on Tuesday, as its forces prepared to retake the biggest city in the strip.\nMen, women and children, some carrying their belongings on donkeys, fled their homes past Israeli troops out of the city.\nIn an Arabic-language message, the Israel Defense Forces (IDF) said they would allow people to leave from 10am until 2pm local time, and published a video of dozens of people along a main road.\nPosting online, one resident, Adam Fayez Zeyara, said the walk on Tuesday was the most dangerous of his life. “We saw the tanks from point blank. We saw decomposed body parts. We saw death.”\nIsrael’s defence minister, Yoav Gallant, said that Israeli forces were operating “in the heart of Gaza City” which he described as “the largest terrorist base ever built”.\nGallant also claimed that Hamas’ most senior leader in Gaza, Yahya Sinwar, was isolated in his bunker, adding that the militant chief was “cut off from his surroundings, [and] his chain of command is weakening”.\nHundreds of thousands of people are feared to still be trapped in the city. Hamas, which has long used the tactic of hiding among civilians, has been accused of blocking people from leaving their homes.\nIsrael has repeatedly told civilians to move south for their own safety but continued to bomb the entire strip, striking the southern city of Khan Younis on Tuesday, killing 23 people according to Palestinian health officials.\nA man rescued from the rubble of a house where medics said 11 people had been killed said that Israel would be “taught a very tough lesson”.\n“This is the bravery of the so-called Israel, they show their might and power against civilians, babies inside, kids inside, and elderly.”\nView image in fullscreen A Palestinian man wounded in the Israeli bombardment is brought to al-Aqsa hospital on Monday. Photograph: Adel Hana/AP\nNearly a month after Israel imposed a “complete siege” on Gaza, the World Health Organization said medical supplies were so low that doctors were performing operations, including amputations, without anaesthetic. The UN secretary general, António Guterres, has said Gaza was becoming a “graveyard for children”, calling for an urgent ceasefire.\nMeanwhile, in Israel on Tuesday people held a minute’s silence to mark a month since the Hamas attack that killed 1,400 people in communities near the frontier and led to the current bombardment of Gaza.\nThe night before, a vigil in Jerusalem was held, with a candle lit for each victim.\nRelatives of the dead gathered at Jerusalem’s Western Wall, where prayers were held to mark the first month of grief, in line with Jewish tradition. “We don’t have other ways to commemorate them except with prayers, lighting candles, and having them in our heart,” Yossi Rivlin, whose two brothers were killed at the music festival massacre during the Hamas attack.\nStanding before a giant Israeli flag, the army’s chief cantor, Shai Abramson, gave a prayer for the dead, modified to include a blessing for security forces personnel who had died.\nIsrael’s bombardment in retaliation for the Hamas raid, in which fighters also seized 240 hostages, has killed more than 10,000 people, including about 4,100 children, according to Palestinian health officials.\n00:01:22 Israel to take 'security responsibility' for Gaza for ‘indefinite period’, says Netanyahu – video\nNetanyahu, in comments that offered the clearest indication yet that Israel plans to keep a tight grip over the strip, home to 2.3 million Palestinians, has said his country will take “overall security responsibility” for Gaza.\nAsked who should “govern” Gaza after the fighting ends, he told ABC News in an interview broadcast on Monday night: “Those who don’t want to continue the way of Hamas,” adding: “Israel will for an indefinite period … have the overall security responsibility because we’ve seen what happens when we don’t have that security responsibility.”\nThe White House reiterated on Tuesday that President Joe Biden does not support an Israeli reoccupation of the Gaza Strip after the war.\n“The president still believes that a reoccupation of Gaza by Israeli forces is not good,” White House national security council spokesperson John Kirby told CNN. “It’s not good for Israel; not good for the Israeli people.”\nHe added that there needed to be a “healthy set of conversations about what post-conflict Gaza looks like and what governance looks like” and that he would leave it to Netanyahu to clarify what he meant by “indefinite.”\nThe UN and other world bodies, including the EU, consider Gaza to be occupied – despite Israel withdrawing its forces from inside the strip in 2005 – as Israel has maintained effective control over the small territory by land, sea and air.\nNetanyahu also said he would consider hour-long “tactical little pauses” in fighting to allow aid to enter or hostages to leave Gaza, but again rejected calls for a ceasefire.\nView image in fullscreen Palestinian firefighters attempt to put out a fire after Israeli strikes on a residential building in Khan Younis. Photograph: Mohammed Salem/Reuters\nBoth Israel and Hamas have rebuffed mounting calls for a halt to fighting. Israel says hostages should be released first, while Hamas says it will neither free them nor stop fighting while Gaza is under assault.\nRights groups and UN experts have accused both sides of war crimes. The UN high commissioner for human rights, Volker Türk, began a five-day visit to the Middle East on Tuesday, although he had still not secured permission from Israel to visit.\n“It has been one full month of carnage, of incessant suffering, bloodshed, destruction, outrage and despair,” Türk said in a statement. “Human rights violations are at the root of this escalation and human rights play a central role in finding a way out of this vortex of pain.”\nView image in fullscreen A candlelight vigil in Tel Aviv at the weekend. Photograph: Alexi J Rosenfeld/Getty Images\nInternational organisations have said Gaza’s hospitals cannot cope with the wounded, and food and clean water are running out, with aid deliveries nowhere near enough. “We need an immediate humanitarian ceasefire. It’s been 30 days. Enough is enough. This must stop now,” said a statement from the heads of several UN bodies.\nThe UN security council met behind closed doors on Monday. The 15-member body is still trying to agree a resolution after failing four times in two weeks. Diplomats said a key obstacle was whether to call for a ceasefire, cessation of hostilities or humanitarian pauses to allow aid access in Gaza.\nReuters and Agence France-Presse contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "‘We saw death’: families flee past tanks as Israel begins to storm Gaza City", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/07/we-saw-death-families-flee-past-tanks-as-israel-prepares-to-storm-gaza-city"}