{"authors": [], "date_download": "2024-02-05 15:44:05", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Taylor Heinicke is the Falcons starting quarterback on Sunday. What are th", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274022442%2Ffive-things-to-watch-when-falcons-host-minnesota-vikings-in-week-9.json", "image_url": "https://cdn.bignewsnetwork.com/atf1699196226.jpg", "language": "en", "localpath": null, "maintext": "Taylor Heinicke is the Falcons starting quarterback on Sunday. What are the ripple effects of this decision? Tori McElhaney\nFLOWERY BRANCH, Ga. -- There's absolutely nothing to talk about when it comes to the Falcons' Week 9 matchup with the Minnesota Vikings this Sunday, right? We have no questions for either team at all, correct?\nWrong, and wrong, again.\nThere are so many -- too many -- questions about this singular game. Fortunately for you, we're going to go through a few of the highlights in your Week 9 five things to watch. Let's waste no time.\nNerdy Birds: Fighting the field position battle, stopping the run when Falcons face Minnesota Vikings in Week 9 A tale of two cornerbacks: A.J. Terrell, Jeff Okudah's stories finally connect in Atlanta Quarterback Taylor Heinicke 'excited for the opportunity' to start against Minnesota Vikings 1. The quarterback conundrum\nThe Falcons and Vikings are experiencing their own versions of the quarterback carrousel this week. For the Vikings, they're having to replace veteran Kirk Cousins, who ruptured his Achilles last week. He is out for the season, leaving Minnesota looking to rookie quarterback Jaren Hall.\nFalcons defensive coordinator Ryan Nielsen said the Falcons won't have much to go off of in terms of tape when it comes to preparing for a Vikings offense led by Hall.\n\"That's always tough,\" Nielsen said. \"... I thought he did a really good job coming in (last week after Cousins' injury), managing the game, closing those guys out. That was good. Obviously, not a lot of tape. A couple of preseason games you see out there.\"\nStill, there are pieces to pick up on.\n\"He's savvy in the pocket, good pocket awareness,\" Nielsen said. \"He had a really good college career. Good arm, good thrower, good decision-maker, so, sure, it will be something along the lines to use his strengths... but rely on their run game. We'll see some play-action. Stuff that we saw last week.\"\nAs for the Falcons, they're choosing to start Taylor Heinicke at quarterback. Desmond Ridder started the first eight games of the season, but was pulled at halftime of their most recent loss to the Titans. He was evaluated for a concussion and cleared to return to the game. However, Heinicke finished the game at quarterback, where he will start this Sunday.\nSmith said the decision to stick with Heinicke is one based on \"a lot of variables,\" and it is a decision the team is making in the short-term.\nAs we question what a Hall-led Vikings team will look like Sunday, we also have to question what the Heinicke-led Falcons will look like, too. How does Heinicke step into the role? What changes do we see offensively when he does? How does Ridder respond? All of these questions hopefully become clearer this Sunday.\n2. Replacing Drake London\nArthur Smith ruled London out of Sunday's game with a groin injury. This will be the first game London has missed since being drafted by the Falcons in 2022.\nLondon suffered a groin injury in the second half of the Falcons loss to the Titans last weekend. He has not practiced at all in Week 9. In 2023, London has totaled 37 catches for 438 yards and two touchdowns. He and Kyle Pitts are the Falcons leading receivers.\nNot having London on the field does change things. Fortunately for the Falcons they do have target depth, especially considering how important tight ends and running backs are to the Falcons pass game.\nPitts, Jonnu Smith, Bijan Robinson and Cordarrelle Patterson are always an option for the quarterback. As are Mack Hollins, KhaDarel Hodge and Scotty Miller, three true receivers who Smith said this week stepped up in London's absence at the end of game in Nashville.\nHow the Falcons make up for London's absence again this week will be something to monitor, especially if this groin injury lingers into the bye week.\n3. Replacing Grady Jarrett\nThere's no replacing Jarrett. There just isn't. With Jarrett out for the season with a torn ACL, though, you have to start thinking about it.\nJarrett is the heart, soul and undisputed leader of this defense. His absence aches. It just does. But let's think about this for a second to bring us some perspective: What would have happened if Jarrett's injury would have come in 2020? Or 2021? Or -- God forbid -- 2022? If a season-ending injury happens in those years you probably feel differently than you do now.\nJarrett's hypothetic loss in those seasons is catastrophic.\nIs it still a gut punch in 2023? Yes, but it's not the end of the world because of the acquisitions the Falcons made this offseason. Having David Onyemata, Calais Campbell and Bud Dupree around make a difference. It makes the blow not hurt as bad. You're down because it'll always hurt losing someone of Jarrett's leadership and talent, but you're not down for the count along the defensive line.\n4. Big day for Bijan?\nAs highlighted in this week's Nerdy Birds article, Bijan Robinson is en route to franchise history.\nThrough eight games, the rookie running back has totaled 655 scrimmage yards. With either 45 total rushing or receiving yards on Sunday he will become the second fastest player to reach 700 yards from scrimmage in franchise history.\nOnly William Andrews surpassed that mark sooner. He accomplished the feat in eight games. Julio Jones (10 games), Kyle Pitts (12 games) and Tyler Allgeier (13 games) round out the record book.\n5. Getting to the bye\nThe Falcons are two games away from their Week 11 bye. The Vikings and Cardinals stand in their way, and how the Falcons show up in both of these games will dictate how you feel about the team coming out of said bye.\nThe bulk of the Falcons divisional games come after Week 11, with Atlanta being thrown right into the fire with the Saints coming to town after Thanksgiving. What the Falcons can't have is a slide in the next two games before they get to that point. They're sitting at 4-4 right now. They haven't been able to find a way to string wins together yet, sticking right around .500 for a while now.\nRemember a couple weeks back, when I wrote about the \"middle eight\" in my notebook? Remember how we took note of the final four minutes of the first half and the first four minutes of the second half being important momentum swings for any team if used productively? Well, consider these next two games and the games that directly follow the Falcons bye week the \"middle eight\" of the season.\nThe Falcons need more touchdowns in the middle eight of games just like they need consecutive wins now that we're in the middle of the season.\nUp Next Videos Atlanta Falcons look to get back on track versus Vikings at Home for Week 9 NFC matchup | NFL Videos Ryan Nielsen, Marquice Williams, & Dave Ragone discuss week 9 preparations Videos Desmond Ridder and Jessie Bates III speak to media ahead of Vikings matchup Videos Rising Stars: Falcons' Jeff Okudah & AJ Terrell join forces in Atlanta | Atlanta Falcons | NFL Videos Bradley Pinion details transformative trip to Africa, giving back and his football origin story | Falcons in Focus Videos Taylor Heinicke, Jerry Gray, Bijan Robinson, & others discuss adjusting to changes ahead of Vikings matchup Videos Bud Brought A Buddy: A.J. Terrell and Bud Dupree talk hip hop, break down film and fashion, and more Videos Arthur Smith discusses trades, injuries, and week 9 starting QB Taylor Heinicke Videos 'Stay in the moment!' | Bud Dupree is mic'd up versus the Tennessee Titans | Atlanta Falcons | NFL Videos Falcons trade for a Defensive Lineman | Grady Jarrett to IR | Rapid Reactions Videos Impact of Grady Jarrett's week 8 injury | Falcons Audible Podcast Videos Kentavius Street's top career plays | Highlights Videos Lorenzo Carter & Ta'Quon Graham on Grady Jarrett's injury & putting in the work to step up as a team Videos Arthur Smith discusses Grady Jarrett's injury & doing what is best for the team approaching week 9 Videos On Desmond Ridder, Taylor Heinicke and Falcons loss to Tennessee Titans Videos Taylor Heinicke, Desmond Ridder, Matthew Bergeron & others speak to media following Titans matchup Videos Arthur Smith addresses media following Falcons vs. Titans matchup Videos Falcons at Titans | NFL+ Highlights Videos Taylor Heinicke with an 8-yard touchdown pass to Scotty Miller vs. Tennessee Titans Videos Bijan Robinson's 13-yard TD run trims Falcons' deficit to 21-15 in fourth quarter Videos Can't-Miss Play: KhaDarel Hodge becomes tackle-breaking machine on 52-yard catch and run Videos KhaDarel Hodge absorbs hit while making 14-yard chain moving catch Videos Drake London climbs ladder to grab 21-yard catch Videos Younghoe Koo's 49-yard FG trims Titans lead to eight early in second half Videos Bijan Robinson showcases his speed on 25-yard rush to open second half Videos Jeff Okudah drops Okonkwo for TFL on third down Videos Desmond Ridder showcases turbo boost on 23-yard run Videos Bud Dupree contains Levis for sack on first down Videos Younghoe Koo's 29-yard field goal opens scoring in Falcons-Titans Videos Desmond Ridder's tight window pass to Drake London moves chains for 12 yards Videos Calais Campbell recovers Titans bad snap setting up Falcons inside 40-yard line Videos Atlanta Falcons serve the community at Hometown Huddle Videos Ryan Nielsen, Dave Ragone and Marquice Williams talk preparation with media ahead of Week 8 matchup Videos Grady Jarrett addresses media ahead of Atlanta Falcons road game against the Tennessee Titans | NFL Videos 'The most clutch kicker in the league!' | Atlanta Falcons kicker Younghoe Koo steps up to win games Videos On The Rise | Episode 6 | Atlanta Falcons take the division lead in a crucial road game in Tampa Bay Videos Calais Campbell's Journey to 100 Sacks Videos Bud Brought A Buddy: Grady Jarrett talks film, fashion, Atlanta hip hop legends, giving back & more Videos KhaDarel Hodge discusses TikTok fame, relentless approach to making it in NFL | Falcons in Focus Videos Desmond Ridder, Bijan Robinson & others look ahead toward Titans matchup | Press Conference", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Five things to watch when Falcons host Minnesota Vikings in Week 9", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274022442/five-things-to-watch-when-falcons-host-minnesota-vikings-in-week-9"}