{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Richard Luscombe", "Martin Belam"], "date_download": "2024-02-05 15:44:08", "date_modify": "None", "date_publish": "2023-11-07 03:56:05", "description": "This blog has closed. You can follow the Guardian’s new live blog on the Israel-Hamas war here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F06%2Fisrael-hamas-war-live-updates-jordan-airdrops-medical-supplies-gaza-blinken-turkey-push-contain-conflict.json", "image_url": "https://i.guim.co.uk/img/media/cef01ac2f0c5627bb1e4ce6e0556f9d87cc4315c/0_400_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d2a26528edf3f19f0b0a9e6e4705a14a", "language": "en", "localpath": null, "maintext": "From 7 Nov 2023 02.20 CET Israel may have 'security responsibility' for Gaza for 'indefinite period' after war ends, Netanyahu says Israel may govern Gaza for an “indefinite period”, after the war ends, prime minister Benjamin Netanyahu has suggested in an interview with the US’ ABC broadcaster. Noting that US President Joe Biden had previously said it would be a “mistake” for Israel to occupy Gaza, interviewer David Muir asked Netanyahu who should govern the territory when the fighting ends. The prime minister suggested Israel would have a role to play for an “indefinite period.” Those who don’t want to continue the way of Hamas … It certainly is not – I think Israel will, for an indefinite period will have the overall security responsibility because we’ve seen what happens when we don’t have it. When we don’t have that security responsibility, what we have is the eruption of Hamas terror on a scale that we couldn’t imagine. Last month, Israel defence minister Yoav Gallant said one key objective of Israel’s military campaign was to sever “Israel’s responsibility for life in the Gaza Strip” and establish a “new security reality for the citizens of Israel.” The US has also suggested the Palestinian Authority, which administers the West Bank, could take charge in Gaza while others have suggested a consortium of Arab states could take responsibility.\nUpdated at 02.48 CET\n7 Nov 2023 04.46 CET An investigation has been launched in Los Angeles after a 69-year-old man died as a result of injuries sustained during a physical altercation between rival pro-Israel and pro-Palestinian protesters, Ventura County Sheriff’s Office have said. In a statement identifying the man as Paul Kessler, the sheriff’s office said they had “not ruled out the possibility of a hate crime”. It said that police were called to the City of Thousands Oaks on Monday afternoon after reports of a physical altercation during which Kessler fell back and struck his head on the ground. He died in hospital of his injuries. It said an autopsy had been performed and the cause of death determined to be “blunt force head injury and the manner of death homicide” but also said the incident “appears to be isolated and not part of a large effort. The Jewish Federation of Greater Los Angeles said he was an “elderly Jewish man” who was “struck in the head by a megaphone wielded by a pro-Palestinian protestor in Westlake Village.” It said it was the fourth “major antisemitic crime” committed in Los Angeles this year and added: “Violence against our people has no place in civilized society. We demand safety.” pic.twitter.com/e9r13j1RjU — Jewish Federation of Greater Los Angeles (@JFedLA) November 7, 2023\n7 Nov 2023 04.21 CET National security council spokesperson John Kirby has commented on the role Israel intends to have in Gaza after the war is over. Israeli prime minister Benjamin Netanyahu suggested in an interview with the US’ ABC broadcaster that Israel may govern Gaza for an “indefinite period”, after the war ends. The broadcaster reports Kirby reacted to the line saying: What we support is that Hamas can’t be in control of Gaza any more. We are having conversations with our Israeli counterparts about what governance in Gaza should look like post-conflict and I don’t believe that any solutions have been settled upon one way or the other.\n7 Nov 2023 04.06 CET In light of Benjamin Netanyahu’s comments that Israel may govern Gaza indefinitely after the war has ended, take a look at Patrick Wintour’s piece from yesterday about what will happen in Gaza after the war has ended. The Guardian’s diplomatic editor looked at the various scenarios being floated, who supports them and the hurdles and opposition they face. Here’s a taster: In a recent interview with the Guardian, the Palestinian Authority’s prime minister, Mohammad Shtayyeh, ruled out going into Gaza to replace Hamas without a comprehensive agreement that includes the West Bank and the birth of a Palestinian state. Fatah fears that if it took over Gaza without a clear political horizon it would be seen as complicit in Israeli and US violence, once again being seen as Israel’s security sub-contractor. Brian Katulis, from the Middle East Institute, has suggested that some of the exercises for constructing a “day after” regional security partnership to go into Gaza “sound like fantasy land because currently Arab states simply do not see eye to eye with America due to its support for the way the war is being conducted”. The eventual realistic options available to the international community for the future governance of Gaza will depend in part on how Israeli politics responds to its trauma. Polls have shown personal support for Netanyahu draining away, with the main split over whether he should resign immediately or later. Read on here: What happens to Gaza the day after the war ends? Read more\n7 Nov 2023 03.44 CET It’s expected Israeli forces are preparing to move in on Gaza City. Associated Press reports that intense airstrikes on the strip are taking place before an expected push into the city’s dense confines. Here are some images ahead of that move. View image in fullscreen Israeli army flares illuminate the sky over west Gaza in the northern Gaza Strip, 6 November. Photograph: Mohammed Saber/EPA View image in fullscreen An Israeli soldier covers his ears as an artillery unit fire shells near the Gaza border. Photograph: Neil Hall/EPA View image in fullscreen A Palestinian man inspects the damage in Gaza City’s Shati refugee camp on 6 November, amid ongoing battles between Israel and Hamas Photograph: Bashar Taleb/AFP/Getty Images View image in fullscreen Palestinians inspect the damage of a destroyed house after an Israeli airstrike in Jabaliya refugee camp, on the outskirts of Gaza City on Sunday 5 Novmber Photograph: Mohammed Alaswad/AP\nUpdated at 03.44 CET\n7 Nov 2023 03.21 CET Maanvi Singh An Arab Muslim student at Stanford University has been hospitalized after being struck in a hit-and-run that authorities are investigating as a hate crime, amid rising threats against Arab and Muslim people across the US. The student, Abdulwahab Omira, was treated for non-life-threatening injuries after being struck by an SUV. “The driver is reported to have made eye contact with the victim, accelerated and struck the victim and then driven away while shouting ‘fuck you and your people’ out the lowered window of the vehicle,” according to the university’s department of public safety. Omira called on others to “collectively denounce hatred, bigotry, and violence”, while also denouncing a slow response from the university. Muslim Stanford student hospitalized in suspected hate crime hit-and-run Read more\n7 Nov 2023 03.01 CET Axios is reporting that the US will allow Israel to buy thousands of M16 rifles from US defense companies only after assurances the weapons won’t go to civilian teams in Jewish settlements in the occupied West Bank. Israeli news outlet Haaretz also quotes White House national security council spokesperson John Kirby as saying “We received a commitment from the Israelis that these weapons will only end up in the hands of Israeli police units. The US state department did its homework and this is the commitment we received.” The assurances come in the wake of the Biden administration expressing growing concern in recent weeks over a rise in settler-led violence against Palestinians in the West Bank.\n7 Nov 2023 02.38 CET The UN security council has once again failed to agree on a resolution on the conflict, with the US calling for “humanitarian pauses” and many others demanding a “humanitarian ceasefire”. The Associated Press reported that after two hours of closed-door discussions differences still remained: “We talked about humanitarian pauses and we’re interested in pursuing language on that score,” US deputy ambassador Robert Wood told reporters after the meeting. “But there are disagreements within the council about whether that’s acceptable.” UN Secretary-General Antonio Guterres earlier Monday told reporters he wanted an immediate humanitarian cease-fire in Gaza and a halt to the “spiral of escalation” already taking place from the occupied West Bank, Lebanon and Syria to Iraq and Yemen. Guterres said international humanitarian law, which demands protection of civilians and infrastructure essential for their lives, is clearly being violated and stressed that “no party to an armed conflict is above” these laws. He called for the immediate unconditional release of the hostages Hamas took from Israel to Gaza in its 7 October attack. China, which holds the Security Council presidency this month, and the United Arab Emirates, the Arab representative on the council, called Monday’s meeting because of the “crisis of humanity” in Gaza, where more than 10,000 civilians have been killed in less than a month. UAE ambassador Lana Nusseibeh said all 15 council members “are fully engaged” and efforts will continue to try to narrow the gaps and reach agreement on a resolution. View image in fullscreen US ambassador Robert Wood speaks to reporters after UN Security Council talks on Gaza on Monday. Photograph: Anadolu Agency/Anadolu/Getty Images\n7 Nov 2023 02.20 CET Israel may have 'security responsibility' for Gaza for 'indefinite period' after war ends, Netanyahu says Israel may govern Gaza for an “indefinite period”, after the war ends, prime minister Benjamin Netanyahu has suggested in an interview with the US’ ABC broadcaster. Noting that US President Joe Biden had previously said it would be a “mistake” for Israel to occupy Gaza, interviewer David Muir asked Netanyahu who should govern the territory when the fighting ends. The prime minister suggested Israel would have a role to play for an “indefinite period.” Those who don’t want to continue the way of Hamas … It certainly is not – I think Israel will, for an indefinite period will have the overall security responsibility because we’ve seen what happens when we don’t have it. When we don’t have that security responsibility, what we have is the eruption of Hamas terror on a scale that we couldn’t imagine. Last month, Israel defence minister Yoav Gallant said one key objective of Israel’s military campaign was to sever “Israel’s responsibility for life in the Gaza Strip” and establish a “new security reality for the citizens of Israel.” The US has also suggested the Palestinian Authority, which administers the West Bank, could take charge in Gaza while others have suggested a consortium of Arab states could take responsibility.\nUpdated at 02.48 CET\n7 Nov 2023 01.59 CET US congresswoman Rashida Tlaib has hit back at criticism for a video she posted over the weekend that was deemed offensive to the Jewish community by some, saying her critics should focus less on the words she used than on saving civilian lives in the Middle East. In the video posted last week, the Michigan Democrat accused Joe Biden of supporting the “genocide of the Palestinian people” and included a warning that she believes his stance on the war will hurt his re-election chances in 2024, as her state has a significant Arab American population. In a statement sent to the Associated Press on Monday, she said: My colleagues are much more focused on silencing me – the only Palestinian American voice in Congress – than they are on ending the horrific attacks on civilians in Gaza and the occupied West Bank right now. Instead of attacking me and distorting my words, they should listen to their constituents and call for a cease-fire to save innocent lives. The video also included a clip of demonstrators chanting “from the river to the sea,” a chant that many Jews and Israelis view as calling for the eradication of Israel, though others say it can have a multitude of meanings. The spat is the latest example of a public rift dividing Democrats in Michigan. View image in fullscreen Rashida Tlaib takes part in a demonstration outside the Capitol Building in Washington DC to advocate for a halt in hostilities in Gaza. Photograph: Anadolu Agency/Anadolu/Getty Images\nUpdated at 02.11 CET\n7 Nov 2023 01.43 CET Hundreds of pro-Palestinian protesters calling for a ceasefire in Gaza have blocked traffic at the Port of Tacoma, south of Seattle, where a military supply ship had recently arrived. Associated Press reports: Organisers say they were targeting the Cape Orlando vessel on Tuesday based on confidential information that it was to be loaded with weapons bound for Israel to be used in the war. Those claims could not immediately be corroborated. In an emailed statement, Air Force Lt. Col. Bryon J. McGarry, a spokesperson for the department of defense, confirmed that the vessel is under the control of the US navy’s military sealift command and is supporting the movement of US military cargo. “Due to operations security, DoD does not provide transit or movement details or information regarding the cargo embarked on vessels of this kind,” McGarry said. The Cape Orlando vessel drew similar protests in Oakland, California, on Friday before it sailed to Tacoma. View image in fullscreen Cars, signs and hundreds of pro-Palestinian protesters gather at the Port of Tacoma at Terminal 7 to block the entrance at where they believe to be a military ship bound for Israel. Photograph: Ellen M Banner/AP\n7 Nov 2023 01.27 CET In Jerusalem, Israelis have been holding a vigil to mark 30 days since the Hamas attack on Israel in which 1,400 people were killed, with a candle lit for each victim. Relatives of the dead gathered at Jerusalem’s Wailing Wall to mark a month of mourning. The holy site is considered the most sacred place Jews can worship. Prayers were held marking the first month of grief, in line with Jewish tradition. Agence France Press reported: “We don’t have other ways to commemorate them except with prayers, lighting candles, and having them in our heart,” said Yossi Rivlin, who lost two brothers at a music festival massacre during the Hamas attack. “This unity of the Israeli nation, we feel it not only in our house but all around the country. Too bad we had to wait for this moment,” the 26-year-old added. “It’s a terrible time. I just hope we won’t forget and return to our routine.” Standing before a giant Israeli flag, army chief cantor Shai Abramson gave a prayer for the departed, modified to include a blessing for security forces who “paid with their lives for the protection of Israeli land”. The ceremony was the first religious commemoration organised at the Wailing Wall since 7 October. It was attended by Benny Gantz, a member of the war cabinet formed by prime minister Benjamin Netanyahu in the wake of the attack, the deadliest the nation has suffered since its founding in 1948. View image in fullscreen People light candles in memory of the 1,400 victims at the Western Wall in Jerusalem on Monday evening. Photograph: Fadel Senna/AFP/Getty Images View image in fullscreen Family members search for the names of relatives at a monument during the lighting of the 1,400 memorial candles. Photograph: Atef Safadi/EPA View image in fullscreen A family member mourns during the lighting of the 1,400 memorial candles. Photograph: Atef Safadi/EPA View image in fullscreen People attending the vigil at the Western Wall in Jerusalem. Photograph: Fadel Senna/AFP/Getty Images View image in fullscreen Jewish men pray at the Western Wall in Jerusalem on Monday. Photograph: Fadel Senna/AFP/Getty Images This is Helen Livingstone, taking over from my colleague Leonie Chao-Fong.\nUpdated at 01.37 CET\n6 Nov 2023 00.48 CET The head of al-Awda hospital in the northern Gaza Strip has warned that it could completely shut down by Wednesday night due to the lack of fuel. Ahmed Muhanna, the director of the hospital, told Al Jazeera that there are 60 patients residing at the hospital, some of whom are in serious condition. Some 80% of the patients in al-Awda – one of Gaza’s biggest hospitals – were women and children, he said. Muhanna added: We are doing the impossible to continue working in the hospital, but we have no choice after the fuel runs out.\nUpdated at 00.50 CET\n6 Nov 2023 00.28 CET US state department employees have signed a dissent memo arguing that the Biden administration should be willing to publicly criticise the Israeli government, according to a report. The memo, obtained by Politico, suggests a growing loss of confidence among US diplomats in Joe Biden’s approach to the Middle East crisis, the outlet writes. The memo has two key requests: that the US support a ceasefire, and that it balance its private and public messaging toward Israel, including airing criticisms of Israeli military tactics and treatment of Palestinians that the US generally prefers to keep private. The document argues that the US’s private and public messaging “contributes to regional public perceptions” that it is a “biased and dishonest actor, which … at worst harms US interests worldwide”. It goes on: We must publicly criticize Israel’s violations of international norms such as failure to limit offensive operations to legitimate military targets. When Israel supports settler violence and illegal land seizures or employs excessive use of force against Palestinians, we must communicate publicly that this goes against our American values so that Israel does not act with impunity. Politico said it was unclear how many people had signed the memo, or if and when it was submitted to the department’s dissent channel.\nUpdated at 00.31 CET\n6 Nov 2023 00.13 CET The United Arab Emirates has announced it will establish a fully equipped field hospital in the Gaza Strip to treat wounded Palestinians, according to state media. The state news agency reported that five aircraft carrying the equipment and requirements necessary for the establishment and operation of the field hospital departed from Abu Dhabi on Monday, heading to al-Arish airport in Egypt. The agency said the hospital would have a capacity of 150 beds. There was no mention of whether the UAE had reached an agreement on the initiative with Israel.\nUpdated at 00.23 CET\n6 Nov 2023 23.47 CET Israel’s prime minister, Benjamin Netanyahu, has once again rejected the idea of a ceasefire in Gaza unless hostages are released, but suggested a series of ‘tactical little pauses’ may be possible. In an interview with ABC News, Netanyahu was asked about the Biden administration’s calls for temporary “humanitarian” pauses in the fighting to allow more aid into Gaza and for civilians to evacuate. Netanyahu said: Well, there’ll be no ceasefire, general ceasefire, in Gaza without the release of our hostages. As far as tactical little pauses, an hour here, an hour there. We’ve had them before, I suppose, will check the circumstances in order to enable goods, humanitarian goods to come in, or our hostages, individual hostages to leave. But I don’t think there’s going to be a general ceasefire. He said he believed a ceasefire “will hamper the war effort” and hamper the effort to get the hostages out “because the only thing that works on these criminals in Hamas is the military pressure that we’re exerting”. Asked if he would agree to a ceasefire if Hamas agrees to the release of hostages, Netanyahu replied: There will be a ceasefire for that purpose.\nUpdated at 00.08 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: UN security council fails to agree resolution - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/06/israel-hamas-war-live-updates-jordan-airdrops-medical-supplies-gaza-blinken-turkey-push-contain-conflict"}