{"authors": [], "date_download": "2024-02-05 15:44:12", "date_modify": "None", "date_publish": "2023-11-07 08:24:14", "description": "Health ministry in Hamas-run territory says 4,000 young people among those killed as UN chief calls besieged territory ‘a graveyard for children’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-gaza-palestinians-hamas-strikes-b2442690.html.json", "image_url": "https://static.independent.co.uk/2023/11/06/19/newFile-1.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsraeli troops are poised to push into the dense confines of Gaza City after pounding the north of the territory with airstrikes. The attacks in the last 24 hours were some of the heaviest in Gaza since Israel began its bombardment in the wake of a Hamas attack inside Israel on 7 October, during which 1,400 people were killed and another 240 taken hostage.\nThe health ministry in Hamas-run Gaza said the death toll had crossed 10,000 on Monday, with the UN secretary general, Antonio Guterres, saying the enclave was becoming a “graveyard for children”.\n“Hundreds of girls and boys are reportedly being killed or injured every day,” Mr Guterres said. The health ministry in the strip has said that more than 4,000 children have been killed since the start of the Israeli bombing campaign.\nMr Guterres said that clear violations of international humanitarian law were being committed. He said the UN needs around £1bn to help deliver aid to 2.7 million people in Gaza and the occupied West Bank.\n“Ground operations by the Israel Defense Forces and continued bombardment are hitting civilians, hospitals, refugee camps, mosques, churches and UN facilities, including shelters. No one is safe,” Mr Guterres told reporters. He also said that Hamas and other militants are using civilians as human shields, while also firing rockets “ indiscriminately towards Israel”.\nGuterres has been criticised for his condemnation of Israeli attacks on Gaza (Reuters)\nIsrael has previously hit out at comments from Mr Guterres and has repeatedly said it believes Hamas are using civilians as shields. Israel's foreign minister Eli Cohen tweeted \"shame on you\" in response to the latest address by Mr Guterres.\nThe military has vowed to crush the operational capacities of Hamas and has called on civilians to move south. But several hundred thousand people are believed to remain in the north and there are fears that casualties could rise sharply as the war turns to close urban combat.\nTroops are expected to enter Gaza City in force at some point in the next 24 to 48 hours, Israeli media reported, while Palestinian militants who have had years to prepare are likely to fight street by street, launching ambushes from a vast network of tunnels.\nIn a briefing with reporters on Monday, Israeli military spokesperson Lt Col Richard Hecht said the army was striving to maintain humanitarian corridors so people could flee to the south of the territory, but acknowledged that if Hamas was believed to be using the roads, the army would not hesitate to attack.\nAirstrikes have also been used on southern areas of the strip, while a blockade of the territory has left food, water, fuel and medical supplies dwindling.\nAid trucks have been trickling into Gaza from Egypt via Rafah, the main crossing that does not border Israel. But UN officials have repeatedly said this was insufficient for Gaza’s civilian population, more than 1 million of whom have been made homeless by Israel’s bombardment.\n“The trickle of assistance does not meet the ocean of need,” Mr Guterres said. “The Rafah crossing alone does not have the capacity to process aid trucks at the scale required.”\nHe said a little more than 400 trucks had crossed into Gaza over the past two weeks, compared with 500 a day before the conflict, adding the numbers did not include fuel supplies. International organisations have said hospitals cannot cope with the wounded.\nAn Israeli artillery unit fires from an undisclosed location near the Gaza Strip (Reuters)\nThere have been growing calls for a humanitarian ceasefire, with the US pushing for such an outcome, with the US secretary of state Antony Blinken having spoken to a number of nations and leaders in recent days. However, Israel has rejected such calls, saying that the 240 hostages held by Hamas in Gaza would need to be released before it would think about a ceasefire in any form.\nUS president Joe Biden and Israeli prime minister Benjamin Netanyahu discussed the potential for tactical pauses in strikes on Gaza for humanitarian reasons and possible hostage releases during talks on Monday, according to a White House spokesperson.\nJohn Kirby said the US and Israeli governments would continue to be in touch on such temporary pauses and that Mr Biden and Mr Netanyahu agreed to continue talks in the coming days.\n“We need an immediate humanitarian ceasefire. It’s been 30 days. Enough is enough. This must stop now,” said a statement released earlier on Monday signed by the UN High Commissioner for Human Rights Volker Turk, World Health Organisation head Tedros Adhanom Ghebreyesus and UN aid chief Martin Griffiths, among others.\nIn northern Gaza, a Jordanian military cargo plane air-dropped medical aid to a field hospital, King Abdullah II said early on Monday. It appeared to be the first such airdrop of the war, raising the possibility of another avenue for aid delivery besides Egypt’s Rafah crossing, but aid agencies are clear that far more aid is needed.\nIsrael said it had struck 450 targets in the last 24 hours. “We’re closing in on them,” said Lt Col Hecht said. “We’ve completed our encirclement, separating Hamas strongholds in the north from the south.”\nGhassan Abu Sitta, a surgeon at al-Shifa Hospital in Gaza City, told The Associated Press the hospital buildings shook all night from the bombardment “and we started getting the bodies and the wounded. It was horrendous”.\nThe war has raised the threat of a wider conflict. On Israel’s northern border with Lebanon, the military wing of Hamas said it had fired rockets from Lebanon into northern Israel on Monday, triggering Israeli airstrikes on the Lebanese side of the border. There have been clashes on the border for weeks, with nations around the region and the West concerned about possible escalation.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israeli troops poised to press into Gaza City with force - as Palestinians say death toll passes 10,000", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-palestinians-hamas-strikes-b2442690.html"}