{"authors": [], "date_download": "2024-02-05 15:44:12", "date_modify": "None", "date_publish": "2023-11-07 19:09:05", "description": "Mexico's government has laid out hurricane reconstruction plans for the resort of Acapulco that seem to give as much priority to building military barracks as re-opening hotels", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Facapulco-ap-andres-manuel-lopez-obrador-mexico-mexico-city-b2443356.html.json", "image_url": "https://static.independent.co.uk/2023/11/07/19/Mexico_Hurricane_Otis_94347.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nMexico’s government laid out hurricane reconstruction plans Tuesday for the resort of Acapulco that seem to give as much priority to building military barracks as re-opening hotels.\nPresident Andrés Manuel López Obrador said he hoped owners would be able to reopen as many as 35 of the resort’s 377 hotels by March or April, following the destruction of Hurricane Otis, the Category 5 storm that smashed into the city Oct. 25.\nBut his administration plans to build 38 new barracks in the resort for the quasi-military National Guard, in addition to five that already exist there. Each barracks will house 250 Guard troopers, who are recruited from or trained by the army.\nThat would mean between 9,500 and 10,000 Guard troops would be stationed permanently in the resort, about the same number sent there following the hurricane, which caused at least 48 deaths.\nIn the days following the storm's Oct. 25 landfall, Guard troops proved incapable of stopping days of ransacking that stripped every large- and medium-sized store in Acapulco to the walls.\nLópez Obrador has promised a barracks in every neighborhood of the resort, which has also been hit by nearly 20 years of drug cartel violence. The president has given the armed forces almost exclusive control of the fight against the cartels and has proposed placing the National Guard under army command.\nLópez Obrador has refused to consider government loans or grants to the hotels, most of which had windows or walls blown out. Many were reduced to their skeletal concrete or steel frames.\nInstead, he said the government would pay half the interest on reconstruction loans from private banks. But with no cash flow, many hotel owners doubt they can qualify for big private bank loans.\nLópez Obrador has also refused to earmark specific funds in the 2024 budget for reconstruction efforts, a move that has led to demonstrations by a protest caravan of Acapulco residents who drove to Mexico City this week.\nEvodio Velázquez, an opposition party member and former mayor of Acapulco, said the demonstrators were demanding a rebuilding program roughly four times the size of the $3.4 billion plan the president announced last week.\n“We want dignified treatment for Acapulco in the federal budget,” Velázquez said Monday.\nThe protesters camped out Tuesday in tents outside Mexico City's National Palace, where López Obrador lives and works.\nMuch of the $3.4 billion aid program will go to making payments of $2,000-$3,000 per damaged home, setting up temporary job programs and providing free electricity for residents for several months. The government is also handing out 250,000 appliances like refrigerators and fans and providing weekly food packages for each family.\nSome stores in Acapulco began tentatively re-opening this week, but they reportedly stocked only basic goods and let in only 20 customers at a time.\nThe federal civil defense agency tallied 220,000 homes that were damaged by the hurricane, which ripped the tin roofs off thousands of homes.", "source_domain": "www.independent.co.uk", "text": null, "title": "Mexico's hurricane reconstruction plans prioritize military barracks, owners left to rebuild hotels", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/acapulco-ap-andres-manuel-lopez-obrador-mexico-mexico-city-b2443356.html"}