{"authors": ["Paul Nuki", "In Gaza"], "date_download": "2024-02-05 15:44:14", "date_modify": "None", "date_publish": "2023-11-07 22:25:00", "description": "In showdown witnessed by a Telegraph reporter, Israeli warplanes, tanks and infantry corner last remains of 1,000-strong battalion", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F11%2F07%2Fhamas-fighters-last-stand-gaza-hospital%2F.json", "image_url": "https://img.youtube.com/vi/EthFQFSCX2g/maxresdefault.jpg", "language": "en", "localpath": null, "maintext": "Hamas terrorists were making a “last stand” in a hospital in northern Gaza on Tuesday night in a showdown witnessed by a Telegraph reporter.\nIsraeli warplanes, tanks and infantry cornered the last remains of a 1,000-strong battalion of the terrorist group’s forces holed up in the Indonesian Hospital and a nearby school.\nA few hundred yards ahead, an Israel Defense Forces (IDF) tank fired off round after round. The air echoed with the pounding of air strikes, the thud of mortars and the chattering of heavy-calibre machine guns.\nAll the munitions – an extraordinary volume of them – were targeting a Hamas battalion making what the IDF said was its last stand in a hospital and school in the northern town of Beit Hanoun.\n“They talk the talk, but they don’t walk so good,” said Lieutenant Colonel Blick of the Israeli 551 Reserve Paratroop Battalion, which escorted The Telegraph to the front line on Tuesday.\nPointing to the plumes of dust rising about 2km to the south, Lt Col Blick said fewer than 100 Hamas fighters were taking shelter in the Indonesian Hospital, the last survivors of a thousand-strong unit.\n“They fought when we came in but folded after a day. Their command lines were cut. Now, where you can see the dust rising, in the hospital, they are making their last stand,” he said.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Hamas terrorists’ last stand at Gaza hospital", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/11/07/hamas-fighters-last-stand-gaza-hospital/"}