{"authors": ["Matthew Dooley"], "date_download": "2024-02-05 15:44:16", "date_modify": "None", "date_publish": "2023-11-07 11:16:00", "description": "Russia has weighed in on an Israeli minister's comments about using nuclear weapons in Gaza after the remarks outraged the international community.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1832366%2Frussia-israel-gaza-strip-nuclear-weapons.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5053514.jpg", "language": "en", "localpath": null, "maintext": "Maria Zakharova urged an international investigation into Israel.\nA Kremlin spokeswoman has weighed in on comments by an Israeli minister who appeared to suggest he was open to using nuclear weapons in Gaza. Israeli Prime Minister Benjamin Netanyahu suspended Heritage Minister Amihay Eliyahu on Sunday from cabinet meetings “until further notice”. When Eliyahu was asked about a potential nuclear strike in Gaza he responded: “That’s one way.” The comments drew outrage from a number of countries and, now, Russia has weighed in on the situation. Maria Zakharova, Russia's foreign ministry spokeswoman said: “This has raised a huge number of questions.”\nIsrael has launched thousands of airstrikes on Gaza since the war began.\nShe claimed that the comment showed that Israel admitted to possessing nuclear weapons - Tel Aviv has not publicly acknowledged its nuclear arsenal but the Federation of American Scientists estimates the country has around 90 warheads. The RIA News Agency quoted Zakharova as saying: “Question number one - it turns out that we are hearing official statements about the presence of nuclear weapons? “If so, then where are the International Atomic Energy Agency and international nuclear inspectors?” Zakharova then claimed that the US must have helped Israel test its nuclear weapons as no tests have been carried out in the Middle East. She said: “If this program exists and existed, where were the tests conducted, at what testing grounds? Obviously, apparently not in the region, then where? And isn't the United States behind all this?”\nIsrael Defense Forces target Hamas outpost in Gaza\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial", "source_domain": "www.express.co.uk", "text": null, "title": "Kremlin slams Israeli minister's threat to drop nuke on Gaza and urges urgent intervention", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1832366/russia-israel-gaza-strip-nuclear-weapons"}