{"authors": ["Maya Yang", "Amy Sedghi", "Geneva Abdul", "Adam Fulton"], "date_download": "2024-02-05 15:16:39", "date_modify": "None", "date_publish": "2024-01-21 00:07:32", "description": "Several members of Syrian armed forces also killed in attack, Iran’s Revolutionary Guards say", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F20%2Fmiddle-east-crisis-live-biden-two-state-solution-netanyahu-israel-gaza-hamas.json", "image_url": "https://i.guim.co.uk/img/media/8f2a7f66aa699e6e32f5d6fc15034096126c5550/0_165_4624_2776/master/4624.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=da69c8bf137f95b05351b8e70e8044b5", "language": "en", "localpath": null, "maintext": "From 20 Jan 2024 11.47 CET Four Iranian Revolutionary Guards confirmed killed in Damascus airstrike Iran has confirmed that four members of its Revolutionary Guards have been killed in Saturday’s missile strike on Damascus. Several members of Syrian armed forces were also killed, Iran’s Revolutionary Guards Corps (IRGC) said in a statement, reported by Al Jazeera: Once more the criminal Zionist regime has moved to violate the city of Damascus, the Syrian capital, and during an airstrike by the fighter jets of the invading and occupying regime a number of Syrian forces and four military advisers of the Islamic Republic of Iran were martyred.” Al Jazeera added that Iranian state television had called it a “terrorist” attack by Israel. The news organisation also reports that one of the IRGC killed was believed to be the head of the intelligence department of the Quds force, the most elite unit of the IRGC. The Iranian state-owned news network, Press TV, published footage that it said showed the “extensive devastation” caused by the strike in the Mazzeh neighbourhood on Saturday: New footage shows the extensive devastation caused by an Israeli attack in the Western Mezzeh Villas suburb in Damascus pic.twitter.com/BueiMQbI2V — Press TV (@PressTV) January 20, 2024\nUpdated at 14.39 CET\n20 Jan 2024 00.58 CET Summary Here is where the day stands: Over the weekend, UNRWA delivered aid to approximately 90 of its shelters, including 33 in Rafah and 25 in Khan Younis. The crucial aid delivery across Gaza comes as nearly 2 million Palestinians grapple with shortages in food, water, medical supplies and fuel as a result of Israel’s attacks across the strip.\nMultiple ballistic missiles and rockets were launched by Iranian-backed militants targeting the Ain al-Asad airbase in western Iraq, according to the US central command, Reuters reports. It added that most of the missiles were intercepted by the base’s air defense systems and that damage assessments remained under way.\nBenjamin Netanyahu has doubled down on his refusal of a Palestinian state. According to a spokesperson for the Israeli prime minister, he claimed in a call with Joe Biden that Israel’s security needs left no space for a sovereign Palestinian state.\nThousands gathered in Tel Aviv in a massive anti-government protest against Netanyahu and his cabinet’s handling of the hostage crisis and Israel’s war on Gaza. Many waved signs that condemned Netanyahu and called for his resignation as family members of hostages currently held by Hamas demanded their release.\nIsraeli shelling east of the Jabalia refugee camp killed four Palestinians and injured 21 more, the Palestine Red Crescent Society (PRCS) reported. Video posted online showed PRCS staff treating injured Palestinians following the strikes. The PRCS added that it had changed the wound dressings of 65 other individuals.\nSenator Bernie Sanders has released the following statement in which he criticizes Netanyahu for his refusal of a Palestinian state: “Despite the illegal and inhumane actions of Netanyahu’s government, President Biden has thus far offered unconditional support to Israel. That must change. President Biden must now loudly and clearly say no to the policies of Netanyahu’s rightwing extremist government.”\nPalestinian people’s right to statehood “must be recognized by all”, the UN secretary general, António Guterres, said at the Non-Aligned Movement summit in Uganda on Saturday. “The refusal to accept a two-state solution for Israelis and Palestinians, and the denial of the right to statehood for the Palestinian people, are unacceptable,” Guterres said.\nUpdated at 01.07 CET\n20 Jan 2024 00.19 CET Over the weekend, UNRWA delivered aid to approximately 90 of its shelters, including 33 in Rafah and 25 in Khan Younis. Our heroic team in @UNRWA Supply Department work continuously in our warehouses in southern📍#Gaza\nThe process of receiving humanitarian aid begins early in the morning & the aid is distributed to around 90 @UNRWA shelters - including 33 in Rafah & 25 in Khan Younis.#UNRWAworks pic.twitter.com/s63d6e4ure — UNRWA Partners (@UNRWAPartners) January 19, 2024 The crucial aid delivery across Gaza comes as nearly 2 million Palestinians grapple with shortages in food, water, medical supplies and fuel as a result of Israel’s attacks across the strip.\nUpdated at 00.58 CET\n20 Jan 2024 23.41 CET Multiple ballistic missiles and rockets were launched by Iranian-backed militants targeting the Ain al-Asad airbase in western Iraq, according to the US central command, Reuters reports. It added that most of the missiles were intercepted by the base’s air defense systems and that damage assessments remain under way. At least one Iraqi service member was wounded in the attacks.\nUpdated at 00.00 CET\n20 Jan 2024 22.44 CET Benjamin Netanyahu has defied Joe Biden and reaffirmed his opposition to Palestinian statehood, saying that there is “no space” for a Palestinian state. The Guardian’s Emma Graham-Harrison and Toby Helm report: Defiant Israeli prime minister Benjamin Netanyahu doubled down on opposition to Palestinian statehood, deepening the divide with Israel’s closest international allies, as cracks in his wartime “unity” government became increasingly evident. Anger with Netanyahu is also increasingly visible on the streets, even though there is broad public support for the war. On Saturday, protesters gathered in Tel Aviv, Jerusalem, Caesarea and Kfar Saba, some calling for bolder action to secure the release of hostages, and others demanding the prime minister step down. One in Jerusalem held a placard that read: “Mothers’ cry: we will not sacrifice our children in the war to save the rightwing.” Over the weekend, Netanyahu sparred publicly – if indirectly – with US President Joe Biden, who for months has offered Israel almost unconditional support for its war in Gaza, at considerable political cost to his own administration, both in America and beyond. For the full story, click here: Netanyahu defies Biden, insisting there’s ‘no space’ for Palestinian state Read more\nUpdated at 22.55 CET\n20 Jan 2024 22.08 CET WHO: three in four Palestinians in Gaza internally displaced Three in four Palestinians in Gaza are internally displaced as a result of Israel’s strikes across the strip, the World Health Organization announced on Saturday. In a video posted to X, Manwa Al Kahwaji, a Palestinian woman who has been internally displaced due to Israeli attacks, said: We go through the toughest moments at night. We are sleeping on the ground using only this sheet. Every day, early morning we head out to get water and it’s not enough. We haven’t had water since yesterday. My little girl is sick since the day we arrived here because of wastewater that’s all around us. 3 in 4 people in #Gaza are internally displaced. These are the conditions they live in. #CeasefireNOW pic.twitter.com/vKUiGYCJhP — Tedros Adhanom Ghebreyesus (@DrTedros) January 19, 2024\nUpdated at 22.20 CET\n20 Jan 2024 21.35 CET At least a dozen missiles were filed at a military base used by US-led coalition forces in Iraq on Saturday. Reuters reports: “Al-Asad airbase was targeted by 15 rockets” fired from Anbar province, which is home to the military base, an Iraqi police official from the region told AFP, speaking on condition of anonymity. He said 13 of the projectiles were shot down by anti-air defences but that “two fell on the airbase.” A US defence official, who also requested anonymity, confirmed that “missiles impacted Al-Asad airbase”, adding that a joint damage assessment was under way with coalition and Iraqi forces. The American official said that initial reports indicated one member of the Iraqi security forces had been seriously injured. In a press release, the Islamic Resistance in Iraq, a loose alliance of Iran-linked armed groups that oppose US support for Israel in the Gaza conflict, said it carried out the attack.\n20 Jan 2024 21.03 CET Israeli shelling east of the Jabalia refugee camp killed four Palestinians and injured 21 more, the Palestine Red Crescent Society (PRCS) reported. Video posted online showed PRCS staff treating injured Palestinians following the strikes. The PRCS added that it changed the wound dressings of 65 other individuals. 🚨PRCS medical post in #Jabalia, northern #Gaza dealt today with four martyrs and 21 injuries due to the Israeli occupation's shelling east of Jabalia camp.\n📌Additionally, PRCS volunteers changed wound dressing for 65 injured individuals.\n📷Videographer: PRCS volunteer, Yusef… pic.twitter.com/X3g6tfpfaL — PRCS (@PalestineRCS) January 20, 2024\nUpdated at 01.07 CET\n20 Jan 2024 20.39 CET Senator Bernie Sanders has released the following statement in which he criticizes the Israeli prime minister, Benjamin Netanyahu, for his refusal of a Palestinian state: Despite the illegal and inhumane actions of Netanyahu’s government, president Biden has thus far offered unconditional support to Israel. That must change. President Biden must now loudly and clearly say no to the policies of Netanyahu’s right-wing extremist government. This is what a true friend of Israel must do in this moment. And Congress must act. There must be no more US military aid to Israel to continue Netanyahu’s war. Humanitarian aid must be immediately allowed to reach those in need. A safe release of all remaining hostages must be negotiated. Israel must work towards a lasting peace that allows two states for two peoples. Netanyahu has made his position clear: He will never allow a Palestinian state, ever. He will continue his devastating war against innocent Palestinians, and block the supplies needed to prevent mass starvation and sickness. Now, we must make our position clear. pic.twitter.com/dOFK02rG8m — Bernie Sanders (@SenSanders) January 20, 2024\nUpdated at 20.41 CET\n20 Jan 2024 20.13 CET Iran’s president, Ebrahim Raisi, vowed on Saturday to punish Israel for a strike which killed five members of Iran’s Revolutionary Guards, according to Iranian state media. “The Islamic Republic will not leave the Zionist regime’s crimes unanswered,” Raisi said in a statement condemning the strike, state broadcaster IRIB said on its website.\nUpdated at 20.37 CET\n20 Jan 2024 19.48 CET Thousands gather in Tel Aviv in anti-government protests over Israel's handling of hostage crisis and Gaza war Thousands have gathered in Tel Aviv in a massive anti-government protest against the Israeli prime minister, Benjamin Netanyahu, and his cabinet’s handling of the hostage crisis and Israel’s war on Gaza. Here are some images and videos coming through social media of the protest: 💥In Tel Aviv, \"Elections now!\"\n\"Netanyahu - our downfall! Leave!\nWe will rebuild our country ourselves!\"\n(Dana Ra'ani) pic.twitter.com/429KczCS5l — Noga Tarnopolsky נגה טרנופולסקי نوغا ترنوبولسكي💙 (@NTarnopolsky) January 20, 2024 💥Masses in Tel Aviv. These rallies are how hovering between \"Bring Them Home!\" to \"Go Home!\" pic.twitter.com/ctdNWvKkJ1 — Noga Tarnopolsky נגה טרנופולסקי نوغا ترنوبولسكي💙 (@NTarnopolsky) January 20, 2024 HAPPENING NOW IN TEL AVIV! The largest rally we had against this war and for Israeli-Palestinian peace. Thousands of Jewish and Palestinian citizens of Israel are marching now demanding a ceasefire agreement, the release of the hostages and the end of the killing in Gaza. Wow. pic.twitter.com/mzHAo6AKuL — Alon-Lee Green - ألون-لي جرين - אלון-לי גרין 🟣 (@AlonLeeGreen) January 18, 2024\nUpdated at 22.39 CET\n20 Jan 2024 19.22 CET UN chief: denial of Palestinian statehood 'unacceptable' Palestinian people’s right to statehood “must be recognized by all”, the UN secretary general, António Guterres, said at the Non-Aligned Movement summit in Uganda on Saturday. “The refusal to accept a two-state solution for Israelis and Palestinians, and the denial of the right to statehood for the Palestinian people, are unacceptable,” Guterres said. Such a stance “would indefinitely prolong a conflict that has become a major threat to global peace and security, exacerbate polarization and embolden extremists everywhere”, he warned. “The right of the Palestinian people to build their own state must be recognized by all.” Guterres’s comments come as Israeli attacks across Gaza since 7 October have killed nearly 25,000 Palestinians while displacing close to 2 million survivors.\nUpdated at 19.37 CET\n20 Jan 2024 18.53 CET Joe Biden said a two-state solution is still possible after a call with the Israeli prime minister, Benjamin Netanyahu, who previously publicly said that he rejects a Palestinian state. The Guardian’s Jason Burke reports: Joe Biden has said the creation of an independent state for Palestinians was still possible while Benjamin Netanyahu was still in office, following a call with the Israeli prime minister on Friday. The US president spoke to Netanyahu for the first time in nearly a month about differences over a future Palestinian state, as well as Israel’s ongoing offensive in Gaza, where the Palestinian death toll is approaching 25,000, according to local health authorities. Early on Saturday, witnesses reported further Israeli bombardment on Khan Younis, the largest city in Gaza’s south, although Palestinian media also reported intense fire around Jabalia in the north. The leaders’ call came a day after Netanyahu said in a televised press conference in Israel that he had told US officials in plain terms that he will not support a Palestinian state as part of any postwar plan. For the full story, click here: Biden says two-state solution still possible after call with Netanyahu Read more\nUpdated at 18.54 CET\n20 Jan 2024 18.26 CET Unicef communication specialist Tess Ingram has released a dispatch from Gaza, saying: “Humanity cannot allow this warped version of normal to persist any longer.” Speaking from the Emirati hospital in Gaza, Ingram said: The situation is very desperate. Some of the mother’s haven’t made it through giving birth. #Gaza: \"Humanity cannot allow this warped version of normal to persist any longer\"-Tess Ingram, @UNICEF Communication Specialist pic.twitter.com/E7bVg0Yp8n — UN News (@UN_News_Centre) January 20, 2024 Two mothers are killed every hour, the UN estimates, as Israeli strikes continue to destroy the Gaza strip, leaving nearly 2 million Palestinians displaced.\nUpdated at 18.30 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Strike on Syrian capital kills fifth Iran Revolutionary Guards member - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/20/middle-east-crisis-live-biden-two-state-solution-netanyahu-israel-gaza-hamas"}