{"authors": [], "date_download": "2024-02-05 15:44:16", "date_modify": "None", "date_publish": "2023-11-07 14:33:39", "description": "NATO allies have frozen their participation in a key Cold War-era security treaty in response to Russia’s withdrawal from the pact", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmoscow-ap-nato-russia-brussels-b2443159.html.json", "image_url": "https://static.independent.co.uk/2023/11/07/14/Russia_WWII_Historical_Parade_43867.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNATO member countries that signed a key Cold War-era security treaty froze their participation in the pact on Tuesday just hours after Russia pulled out, raising fresh questions about the future of arms control agreements in Europe.\nMany of NATO’s 31 allies are parties to the Treaty of Conventional Armed Forces in Europe, which was aimed at preventing Cold War rivals from massing forces at or near their mutual borders. The CFE was signed in November 1990 as the Soviet bloc was crumbling but was not fully ratified until two years later.\nNATO said that Tuesday's action by its signatory members was required because “a situation whereby Allied State Parties abide by the Treaty, while Russia does not, would be unsustainable.”\nEarlier in the day, Moscow said it had finalized its withdrawal from the treaty. The long-expected move came after both houses of the Russian parliament approved a bill proposed by President Vladimir Putin denouncing the CFE.\nU.S. National Security Adviser Jake Sullivan said suspending the obligations by Washington and its allies will strengthen NATO's “deterrence and defense capacity by removing restrictions that impact planning, deployments, and exercises -– restrictions that no longer bind Russia after Moscow’s withdrawal.”\nRussia's actions “further demonstrates Moscow’s continued disregard for arms control,” he added.\nThe German Foreign Ministry underscored that Berlin and its allies are not pulling out of the treaty. “In the case of a fundamental change in Russia’s behavior, a renewed implementation of the CFE remains possible,” it said.\nThe ministry said Germany intends to stick to the national limits for weapons systems in the treaty. It criticized Moscow’s withdrawal, saying that “Russia is destroying another pillar of our European security and arms control architecture.”\n“Securing a balanced conventional potential of forces in Europe cannot be realized without the involvement of Russia,\" it added.\nThe treaty was one of a number of major arms control treaties involving Russia and the U.S. that has been crippled in recent years.\nIn February, with U.S.-Russia tensions running high over Ukraine, Moscow suspended its participation in the New START Treaty, the last arms control pact that remains between the two countries.\nBoth countries also pulled out of the 1987 Intermediate-range Nuclear Forces Treaty in 2019, blaming each other for violations.\nThe INF Treaty, which was signed by U.S. President Ronald Reagan and Soviet leader Mikhail Gorbachev, banned the production, testing and deployment of land-based cruise and ballistic missiles with a range of 500 to 5,500 kilometers (310 to 3,410 miles).\nWilliam Alberque, director of Strategy, Technology and Arms Control at The International Institute for Strategic Studies, expressed concern that another arms control treaty is under threat.\n“What is needed right now is more transparency, more risk reduction, more what we would call guardrails on competition,\" he said. “We basically need to manage the competition so that it doesn’t spiral into crippling arms races.”\nWhen it was signed, the CFE envisaged weapons limits for the Warsaw Pact and NATO, but the Warsaw Pact ceased to exist shortly after it was signed. Unsuccessful attempts were made to renegotiate its conditions.\nRussia suspended its participation in 2007, and in 2015 announced its intention to completely withdraw.\nIn February 2022, Putin sent hundreds of thousands of Russian troops into Ukraine, which also shares borders with NATO members that signed the CFE: Poland, Romania and Hungary.\nAnnouncing Moscow's withdrawal from the treaty had been completed, the Russian Foreign Ministry blamed the U.S. and its allies for the move as well as the West’s allegedly “destructive position” on the treaty.\n“We left the door open for a dialogue on ways to restore the viability of conventional arms control in Europe,” it said. “However, our opponents did not take advantage of this opportunity.”\nThe ministry said that “even the formal preservation” of the treaty has become “unacceptable from the point of view of Russia’s fundamental security interests,” citing developments in Ukraine and NATO’s recent expansion.\nNATO said its members remain committed “to reduce military risk, and prevent misperceptions and conflicts.” It said the alliance will continue to “consult on and assess the implications of the current security environment and its impact on the security\" of the Euro-Atlantic region.\n___\nMorris reported from Tallinn, Estonia. Dasha Litvinova in Tallinn and Geir Moulson in Berlin contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "NATO freezes a Cold War-era security pact after Russia pulls out, raising questions on arms control", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/moscow-ap-nato-russia-brussels-b2443159.html"}