{"authors": ["Morgan Phillips", "Congress Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:44:17", "date_modify": "None", "date_publish": "2023-11-07 20:06:25", "description": "The House voted to advance a resolution to censure Rep. Rashida Tlaib on Tuesday after a number of Republicans sided with Democrats over free speech concerns.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12721605%2FHouse-ADVANCES-bill-censure-Rashida-Tlaib-anti-Israel-comments-Congress-moves-step-closer-condemning-Democrat-calling-Hamas-terrorist-attack-resistance-apartheid-state.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/07/21/77525927-0-image-a-9_1699393434248.jpg", "language": "en", "localpath": null, "maintext": "A defiant Rep. Rashida Tlaib said on the House floor that she will not be 'silenced' after a resolution to censure her advanced.\nTlaib, D-Mich., noted that she is the only Palestinian-American in Congress. 'My perspective is needed here now more than ever. I will not be silenced and I will not let you distort my words,' she said in a passionate speech.\n'There are millions of people across our country who do not support Netanyahu's extremism and are sick of watching our country support collective punishment,' she went on.\n'My criticism has always been of the Israeli government,' said Tlaib. 'The idea that criticizing the Israeli government is antisemitic sets a dangerous precedent.'\n'I can't believe I have to say this but Palestinian people are not disposable. We are human beings. Just like my grandmother, like all Palestinians, who just wants to live her life with the freedom and human dignity we all deserve,' Tlaib went on, holding up a photo of her grandmother who lives in the Palestinian territory.\nThe House voted to advance a resolution to censure Rep. Rashida Tlaib on Tuesday even as a number of Republicans sided with Democrats over free speech concerns.\nA move to table or kill the resolution failed 208 to 213. Nearly all Democrats, including many of those who voiced concerns over Tlaib's words, voted for the motion to table it.\nThe resolution now goes to a final vote on Wednesday. Censure is a form of public reprimand with no formal consequences.\nThe reprimand came after Tlaib defended use of a rallying cry used by Palestinian militants - 'from the river to the sea.'\nThe House voted to advance a resolution to censure Rep. Rashida Tlaib on Tuesday after a number of Republicans sided with Democrats over free speech concerns\nSix Republicans voted with Democrats to table the resolution: Reps. Thomas Massie, R-Ky., Mike Garcia, R-Calif., Tom McClintock, R-Calif., John Duarte, R-Calif., Ryan Zinke, R-Texas, and Ken Buck, R-Colo.\nOne Democrat, Rep. Susan Wild., D-Pa., voted 'present' on the resolution. Another, Rep. Brad Schneider, D-Ill., voted in favor of it. The GOP-led resolution was saved by a number of Democratic absences.\nAt the same time 70 Democrats signed on to a statement led by Schneider condemning the use of the phrase 'from the river to the sea,' calling it a 'a rallying cry for the destruction of the State of Israel and genocide of the Jewish people.'\nHouse Democratic Leader Hakeem Jeffries put out a new pointed statement on Tuesday evening after the vote.\n'Echoing slogans that are widely understood as calling for the complete destruction of Israel - such as From the River to the Sea - does not advance progress to a two-state solution.'\nRepublicans who opposed the resolution had free speech concerns and said the censure was a waste of time.\n'I'm gonna censure the next person that introduces a censure,' Rep. Thomas Massie, a no vote, told reporters.\n'We should all stop this nonsense,' said Rep. Ken Buck, R-Colo. 'People are gonna have differences of opinion, sometimes they're going to mistake facts. So be it, let their voters make that decision.'\nDemocratic leadership warned their rank-and-file members not to 'divide Congress' by voting for the Republican-led measure.\nA handful of Democrats signaled they would vote with their party in favor of killing the resolution but would vote with Republicans on passing it on Wednesday.\nThis privileged resolution was brought forth by Rep. Rich McCormick, R-Ga., after Rep. Marjorie Taylor Greene, R-Ga., forced a vote on a Tlaib censure resolution last week for 'inciting an insurrection,' in reference to a ceasefire protest on Capitol Hill.\nThat resolution had failed when 23 Republicans joined Democrats in voting against the resolution.\nGreene reintroduced her own resolution, replacing 'insurrection' with 'illegal occupation.' Her resolution will be voted on Tuesday night.\nHouse GOP leadership chose to hold the McCormick vote first as it had a better chance at passing, likely hoping that Greene would then withdraw her resolution.\nThis privileged resolution was brought forth by Rep. Rich McCormick, R-Ga\nMcCormick voted to table Greene's resolution last week. His resolution went against the Michigan Democrat 'for promoting false narratives regarding 10/7 Hamas attack on Israel & calling for destruction for the State of Israel.'\nHis resolution does not make mention of the ceasefire protest.\nIt called out Tlaib for 'continuing to knowingly spread the false narrative that Israel intentionally bombed' a hospital in Gaza.\nIsraeli intelligence claimed the hospital explosion, that killed dozens, was caused by a Hamas rocket misfire.\nIt also called out a video Tlaib posted that featured a chant often used by Palestinian militants: 'from the river to the sea.'\nThe chant is widely used by those who do not believe Israel has a right to exist.\n'[Biden], the majority of the American people are not with you on this one. #CeasefireNow,' Tlaib wrote on Twitter along with the clip.\nLater Tlaib claimed on Twitter the phrase was not used to promote violence.\n'From the river to the sea is an aspirational call for freedom, human rights, and peaceful coexistence, not death, destruction, or hate,' she wrote on Twitter on Friday.\nThe resolution also mentioned Tlaib's October 8 statement after the Hamas attack on Israel, which she referred to as 'resistance.'\nThe statement read: 'I grieve the Palestinian and Israeli lives lost yesterday, today, and every day. I am determined as ever to fight for a just future where everyone can live in peace, without fear and with true freedom, equal rights, and human dignity. The path to that future must include lifting the blockade, ending the occupation, and dismantling the apartheid system that creates the suffocating, dehumanizing conditions that can lead to resistance.'\nMeanwhile Tlaib, the only Palestinian-American in Congress, accused her colleagues of being 'more focused on silencing me than they are on saving lives, as the death toll in Gaza surpasses 10,000.'\nFlorida Republican Rep. Brian Mast compared Palestinians to Nazis and said 'very few' of them are innocent in a wild tirade on the House floor\n'Many of them have shown that Palestinian lives still do not matter to them, but I do not police their rhetoric,' she said, adding a fresh call for a ceasefire.\nRep. Sara Jacobs, a Jewish Democrat from California, introduced a retaliatory resolution to censure Rep. Brian Mast, R-Fla., which must also be taken up for a vote this week for comparing Palestinian civilians to Nazis.\nJacobs' resolution cites 'inflammatory statements regarding innocent Palestinian civilians in Gaza who are in harm's way through no fault of their own.'\n'I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians. I don't think we would so lightly throw around the term innocent Nazi civilians,' Mast said in a speech last week.\nWeeks ago, Mast wore his uniform from the Israeli Defense Forces to Capitol Hill.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Rashida Tlaib says Palestinians are 'human beings' and defends her right to criticize Israel in speech tearing into colleagues for advancing bill to censure her for calling Hamas attack 'resistance' a", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12721605/House-ADVANCES-bill-censure-Rashida-Tlaib-anti-Israel-comments-Congress-moves-step-closer-condemning-Democrat-calling-Hamas-terrorist-attack-resistance-apartheid-state.html?ns_mchannel=rssns_campaign=1490ito=1490"}