{"authors": ["Adam Cailler", "Paul Donald", "Image", "Israeli Army Afp Via Getty Image", "Centcom X", "Afp Via Getty Images"], "date_download": "2024-02-05 15:44:25", "date_modify": "None", "date_publish": "2023-11-06 14:14:34", "description": "The US has deployed an Ohio-class nuclear submarine to the Middle East in what some experts have suggested is a clear warning to Iran about its involvement in the ongoing Israel-Hamas war", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fworld-news%2Fnuclear-sub-arrives-middle-east-31372941.json", "image_url": "https://i2-prod.dailystar.co.uk/incoming/article31373035.ece/ALTERNATES/s1200/1_F-MvClMWUAAUwRP.jpg", "language": "en", "localpath": null, "maintext": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nSomething went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nThe United States has dispatched a nuclear-powered submarine to the Middle East in what is being seen as a huge show of support for Israel in its bid to wipe out terror group Hamas in Gaza.\nThe US Central Command confirmed the deployment of an Ohio-Class sub, one of the largest and most powerful submarines ever built for the Navy. On X, previously known as Twitter, the defense force shared a photo of the unnamed sub in the Suez Canal, north-east of Cairo, Egypt, which is something that the US never normally does.\nThey announced: \"On November 5, 2023, an Ohio-class submarine arrived in the US Central Command area of responsibility.\" The stealthy sub, capable of launching conventional strikes virtually undetected, joins other US Navy assets already stationed in the region.\nREAD MORE: Putin's body double has 'deadly Covid fever' but cuddled with kids on public appearance\nFor more exclusive Daily Star content, click here.\n(Image: Israeli Army/AFP via Getty Image)\nIn April, it was revealed that the USS Florida, another East Coast-based SSGN, was operating in the Middle East. Carl Schuster, a former director of operations at the US Pacific Command's Joint Intelligence Center, told CNN in 2021: \"SSGNs can deliver a lot of firepower very rapidly. One-hundred and fifty-four Tomahawks accurately deliver a lot of punch. No opponent of the US can ignore the threat.\"\nThe USS Florida, a guided missile sub, demonstrated its terrifying firepower in March 2011. It fired almost 100 Tomahawks at targets in Libya during Operation Odyssey Dawn, marking the first time these subs were used in combat. This rare reveal of US Navy submarine locations is seen as a clear show of force.\n(Image: CENTCOM/X)\nPentagon spokesperson Brigadier General Pat Ryder explained the force build-up aims to deter regional escalation and protect the US and its partners. He stated: \"Since that Hamas terrorist attack we've also been crystal clear that we do not want to see the situation in Israel widen into a broader regional conflict.\"\n(Image: AFP via Getty Images)\nUS bases in Iraq and Syria, where small US forces are battling ISIS, have been under attack by Iranian-backed militias since the war kicked off on October 7. Yemen's Houthi rebels have been launching drones and missiles at southern Israel, while Hezbollah from Lebanon has been attacking the north of the country.\nWashington is also beefing up its Gulf allies' defences, sending a THAAD missile system to Saudi Arabia and Patriot surface-to-air missile systems to Kuwait, Jordan, Iraq, Saudi Arabia, Qatar and the United Arab Emirates.\n* This article was crafted with the help of an AI tool, which speeds up Daily Star's editorial research. An editor reviewed this content before it was published. You can report any errors to starletters@dailystar.co.uk", "source_domain": "www.dailystar.co.uk", "text": null, "title": "US nuclear sub arrives in Middle East amid fears of dangerous escalation", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/world-news/nuclear-sub-arrives-middle-east-31372941"}