{"authors": [], "date_download": "2024-02-05 15:44:27", "date_modify": "None", "date_publish": "2023-11-06 10:49:45", "description": "White House official does not specify number of Americans who remain inside Gaza", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fgaza-israel-palestine-white-house-b2442287.html.json", "image_url": "https://static.independent.co.uk/2023/11/06/09/gettyimages-1766671880-612x612.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nMore than 300 Americans and their family members have left Gaza after “intensive negotiations”, but a number of US citizens still remain there, said a White House official.\n“We believe that there are still a number of Americans inside Gaza, but that over the last several days, through pretty intensive negotiations with all sides relevant to this conflict, we have been able to get out more than 300 Americans,” deputy national security advisor Jon Finer told CBS News.\nThose released included US citizens, lawful permanent residents and their family members, Mr Finer said.\nHe, however, did not specify the number of Americans who are still inside Gaza.\nLast week, US secretary of state Antony Blinken said around 400 American citizens and their family members, totalling around 1,000 people, wanted to leave the besieged strip.\nEvacuations of injured Gazans and foreign passport holders through the Rafah crossing to Egypt have been suspended since Saturday, but Egyptian, US and Qatari officials said efforts were on to resume them.\nIsrael initiated retaliatory bombardment on Gaza after Hamas gunmen on 7 October killed 1,400 people and took more than 240 hostages. Gaza health authorities said more than 9,770 Palestinians have been killed in the retaliatory Israeli strikes. This includes over 4,000 children.\nIsrael claimed it is aiming its attacks at Hamas, not civilians, and accuses the group of using them as human shields. The Israeli Defense Forces (IDF) said 31 Israeli soldiers have been killed since the ground operation began in Gaza on 27 October.\nDifficult negotiations have continued to secure the release of the captives that include some Americans, Mr Finer said.\n“Those negotiations are going on quietly behind the scenes. They have taken longer than any of us would like,” he said. “But we continue to believe that there is the possibility of getting a significant number of these hostages released.”\nPresident Joe Biden on Wednesday spoke about the need for a pause in hostilities to allow hostages to get out, and the White House said it supports a “humanitarian pause” to allow aid deliveries to Gaza.\nA spokesperson for IDF told CNN late on Sunday that bombardments in northern Gaza were halted for several hours for two days in a row to allow civilians safe passage to move to the south of the narrow coastal strip.\nLieutenant Colonel Jonathan Conricus, the spokesperson, said there was access to water and humanitarian goods in the south of Gaza, but claimed Hamas was impeding convoys by firing on them. These claims could not be independently verified.\nMeanwhile, Mr Blinken met Palestinian president Mahmoud Abbas on Sunday. Aside from pleasantries, neither man spoke as they greeted each other in front of cameras and the meeting ended without any public comment. It was not immediately clear if the lack of words indicated the meeting had gone poorly.\nUS CIA director William Burns is set to visit Israel on Monday to discuss the war and intelligence with senior officials, reported The New York Times. Mr Burns also will make stops in other Middle East countries to discuss the Gaza situation, NYT quoted an unnamed US official as saying.\nAdditional reporting by agencies", "source_domain": "www.independent.co.uk", "text": null, "title": "More than 300 Americans have fled Gaza in recent days, White House says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/gaza-israel-palestine-white-house-b2442287.html"}