{"authors": [], "date_download": "2024-02-05 15:44:28", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "MANILA, PHILIPPINES - Japan and the Philippines announced on Saturday the start of negotiations for a defense pact that would allow troops to be deploye", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274021586%2Fjapan-philippines-boost-alliance-to-counter-china-analysts-say.json", "image_url": "https://cdn.bignewsnetwork.com/voa1699097751.jpg", "language": "en", "localpath": null, "maintext": "MANILA, PHILIPPINES - Japan and the Philippines announced on Saturday the start of negotiations for a defense pact that would allow troops to be deployed to each other's territory, a move analysts say is largely prompted by China's increasingly aggressive behavior in disputed waters.\nJapanese Prime Minister Fumio Kishida met with Philippine President Ferdinand Marcos Jr. in Manila on a two-day official visit, during which Kishida described the countries' bilateral relationship as in its \"golden age.\"\nKishida expressed their shared \"serious concerns\" about increasing tensions in the East China Sea and the South China Sea, where Tokyo and Manila are locked in territorial disputes with China.\n\"[Any] attempt to unilaterally change the status quo by force is unacceptable,\" Kishida said.\nWhile he did not mention Beijing, the statement came after a series of maritime confrontations in the South China Sea, including two collision incidents last month between Philippine and Chinese ships.\nManila accused Beijing of deliberately colliding with its boats, and Japan, in condemning the incident, said it stands with the Philippines in upholding the maritime order.\nAnalysts said these growing concerns against an increasingly assertive China played a huge role in the decision by Manila and Tokyo to deepen security ties.\n\"Having a shared threat perception is one of the most important drivers for closer strategic relations,\" said Don McLain Gill, an international studies lecturer at De La Salle University in Manila.\n\"Japan and Manila share the same interest for stability ... but they also share the same wariness for a particular threat - which is China,\" he said. \"And that would allow both countries to narrow down the focus of their cooperation to make it more specific based on this shared threat.\"\nThe two countries are negotiating a reciprocal access agreement, which could facilitate joint activities by their armed forces, including joint military exercises.\nJapan has separate similar agreements with the United Kingdom and Australia, and the Philippines has such agreements with Australia and the United States.\nGill said this closer alliance with Japan is a \"natural alignment\" for the Philippines, which has enjoyed strong economic support from Tokyo in the past.\n\"It's not something that is forced, because the foundation was already strong for the past few years, but now we are adding to that foundation based on the contemporary trends in regional geopolitics,\" Gill said.\nMilitary cooperation between the two countries has developed further under Marcos, who came to power last year and restored the country's alliance with the United States.\nUnder Marcos, the Philippines asserted the 2016 international tribunal ruling that declared China's historical claims in the South China Sea illegal, in a turnaround from his predecessor, former President Rodrigo Duterte, who sought to appease Beijing in hopes of attracting investment.\nThe Philippines, Japan and the United States held their first joint coast guard drills in the South China Sea in June, and Kishida said they will \"further strengthen\" their trilateral alliance.\n\"The Philippines is earning a lot of respect because right now what we're seeing is we're not just basing everything on the law but we're actually coupling this with action,\" Froilan Calilung, a political science professor at University of Santo Tomas, told VOA.\nAmong the actions Calilung referred to was the Marcos order to remove a floating barrier the Chinese coast guard installed in the Scarborough shoal in September to prevent fishers from entering the lagoon.\nFILE - China Coast Guard boats are close to a floating barrier on Sept. 20, 2023, near the Scarborough Shoal in the South China Sea. (Philippine Coast Guard via Reuters)\nThe Philippines also exposed Chinese actions in the disputed waters, including alleged environmental damage caused by Chinese ships in the Spratly Islands.\nThese \"decisive\" actions, according to Calilung, caught the attention of Japan, which he said decided to ramp up its alliance with Manila.\n\"Japan is still very much worried about China,\" he said. \"And in order for Japan to be able to check on the rising power of China, Japan believes that the Philippines is a very important piece to the equation.\"\nDuring the state banquet in Manila, Kishida said he hoped his visit would give a \"further boost\" to future cooperation.\n\"Japan and the Philippines are now experiencing an excellent relationship - we call it the golden age,\" Kishida said. \"I look forward to working with President Marcos to take these bilateral relations to even new heights.\"\nAside from Tokyo, the Philippines is seen as \"a partner of choice\" by other countries outside Southeast Asia, which share the same vision of a free and open Indo-Pacific, according to Gill.\n\"We are more overt in our desire to not only preserve our sovereignty and sovereign rights based on international law, but to maintain the stability of international law throughout the region. And that is one thing that continues to draw us closer to other countries,\" Gill said, noting an increase of interest for cooperation from European and North American countries.\nA defense accord, such as a reciprocal access agreement, could also clear the way for Japan to bring in military support to the Philippines, according to Dindo Manhit, president of Stratbase ADR Institute, a Manila-based research group.\n\"If we have this reciprocal access agreement that can lead to a stronger security relationship, that will give us a foundation to work stronger with Japan to provide us with more support,\" he said. \"That's why they have limited their support through years with civil maritime or for coast guards, only because we lacked that kind of agreement.\"\nDuring the meeting, Marcos announced that Japan will provide $4 million to Manila for the procurement of coastal radar.\nThe enhanced military alliance aims to send a signal that they are serious in building up a deterrence against China in its actions in the disputed waters, Calilung said.\n\"What we might see in the future is a China that is more careful and cautious about its actions, because let's face it, there's always strength in numbers, and China understands the dynamics of geopolitical security,\" he said.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Japan, Philippines Boost Alliance to Counter China, Analysts Say", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274021586/japan-philippines-boost-alliance-to-counter-china-analysts-say"}