{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:44:34", "date_modify": "None", "date_publish": "2023-11-06 20:16:50", "description": "António Guterres calls for more aid trucks to enter besieged territory and calls for end to ‘dead end of destruction’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F06%2Fgaza-becoming-a-graveyard-for-children-says-un-secretary-general.json", "image_url": "https://i.guim.co.uk/img/media/73022797ce353335bae0730cbf0404c2ca5e9d2d/0_273_7356_4415/master/7356.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e25222601191ed617f7b04ebed973422", "language": "en", "localpath": null, "maintext": "The United Nations secretary general, António Guterres, has warned that the Gaza Strip is becoming “a graveyard for children” as he called again for an immediate humanitarian ceasefire to allow aid into the embattled territory.\nThe UN chief’s comments came on Monday after Gaza health authorities said the death toll had now exceeded 10,000 people and the heads of all the major UN humanitarian organisations made an unprecedented joint statement calling for a ceasefire.\n“We must act now to find a way out of this brutal, awful, agonising dead end of destruction,” Guterres told reporters at the UN. “Gaza is becoming a graveyard for children. Hundreds of girls and boys are reportedly being killed or injured every day.”\nEfforts at the UN security council to negotiate an agreed resolution calling for a ceasefire are deadlocked, with the 10 non-permanent members doing their best to reach an agreement on wording and emphasis. Pressure will then be applied to prevent one of the five veto-wielding permanent members, most likely the US or Russia, from blocking the text.\nIsrael has vowed to wipe out Hamas, which rules the Gaza Strip, after the militants killed 1,400 people and took more than 240 hostages in a string of attacks on 7 October. On Monday, the Israeli military said it had completely encircled Gaza City after more than a week of heavy fighting, in effect severing the territory into two.\nGuterres said that clear violations of international humanitarian law were being committed. He added that the UN needed $1.2bn (£1bn) to help deliver aid to 2.7 million people in Gaza and the West Bank. In practice little of this aid can reach people inside Gaza.\n“Ground operations by the Israel Defense Forces and continued bombardment are hitting civilians, hospitals, refugee camps, mosques, churches and UN facilities, including shelters. No one is safe,” Guterres told reporters.\n“At the same time, Hamas and other militants use civilians as human shields and continue to launch rockets indiscriminately towards Israel,” he said.\nGuterres said 89 people working with the UN Palestinian refugee agency (UNRWA) had been killed in Gaza, which he described as the highest toll for UN aid workers, higher “than in any comparable period in the history of our organisation”.\nIn a phone call on Monday with Israel’s prime minister, Benjamin Netanyahu, the US president, Joe Biden, repeated calls to protect Palestinians, but there were few signs that US calls for restraint were being heard.\nAsked about civilian casualties on Monday, a White House spokesperson said: “We have seen some indications that there are efforts being applied in certain scenarios to try to minimise, but I don’t want to overstate that.”\nMeanwhile, aid has started to enter Gaza through the Rafah crossing in Egypt again, Gutteres said, but it was arriving at wholly inadequate rates.\n“The trickle of assistance does not meet the ocean of need,” Guterres said. “The Rafah crossing alone does not have the capacity to process aid trucks at the scale required.”\nHe said slightly more than 400 trucks had crossed into Gaza over the past two weeks – compared with 500 a day before the conflict began – representing an average of 28 trucks a day.\nThe UN last week said more than one border crossing was needed to deliver aid to Gaza, and that Kerem Shalom – controlled by Israel – was the only one equipped to take enough trucks. Israel has refused to open the crossing, saying it would represent a security risk.", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza becoming ‘a graveyard for children’, says UN secretary general", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/06/gaza-becoming-a-graveyard-for-children-says-un-secretary-general"}