{"authors": ["Dharna Noor"], "date_download": "2024-02-05 15:44:35", "date_modify": "None", "date_publish": "2023-11-06 15:15:40", "description": "Exclusive: study finds militaries have generated about 430m metric tonnes of CO2 emissions since 2015 Paris accords", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fenvironment%2F2023%2Fnov%2F06%2Fstudy-us-and-uk-militaries-owe-combined-111bn-in-climate-reparations.json", "image_url": "https://i.guim.co.uk/img/media/ecc2dfe287dd2574f39963c79b505989f36f8007/0_132_4218_2532/master/4218.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=29434e63303772808b4a62199822d539", "language": "en", "localpath": null, "maintext": "The US and UK militaries “owe” at least $111bn in reparations to communities most harmed by their planet-heating pollution, a first-of-its-kind study calculates.\nThe research employs a “social cost of carbon” framework – a way to estimate the cost, in dollars, of the climate damage done by each additional tonne of carbon in the atmosphere.\n“The environmental costs of maintaining the global military reach of the US and UK armed forces are astonishing,” said Patrick Bigger, research director of the Climate and Community Project and co-author of the report.\nAccording to the report, which was published by the UK-based thinktank Common Wealth and the US-based Climate and Community Project, the two militaries have generated at least 430m metric tonnes of carbon dioxide equivalent since the 2015 United Nations Paris climate agreement. That’s more than the total greenhouse gas emissions produced in the UK last year.\nTo offer minimal compensation for damage caused by those emissions, the US military should offer $106bn in international climate financing, while the UK military should offer $5bn, the researchers write, employing an equation drawn up by a Columbia University researcher in 2021.\nThose figures, though eye-popping, are “extremely conservative”, the authors say.\n“We wanted to get a sense of the minimum scale of climate finance that both of these countries owe due to the effects of their military operations,” said Khem Rogaly, a researcher at Common Wealth and study co-author. “But it really is the minimum.”\nOne reason: they are based on “opaque” and “incomplete” data from the US and UK governments, which don’t include most emissions from the institutions’ supply chains. The figures omit data from 2017 and 2018, when the UK military failed to report its emissions estimates, and from 2022, which the US has not yet released. They also fail to account for certain climate impacts of military activity such as the unique climate-warming properties of jet fuel, among other issues.\nThe UK and the US have made some plans to clean up their militaries’ emissions imprints.\nThe environmental impact wreaked by the US and UK militaries extends far beyond warming from greenhouse gas emissions, the researchers say. The social cost of carbon doesn’t account for health impacts to communities near military activity – from Bikini Atoll in the Marshall Islands, where nuclear testing in the 40s and 50s led to severe environmental damage; to Vieques, Puerto Rico, where decades of US navy chemical pollution significantly increased the risk of cardiovascular and respiratory disease for locals; to Iraq, where troops’ use of depleted uranium led to widespread health issues including birth defects during the Gulf war and the 2003 invasion.\n“These two militaries have about 900 bases overseas,” said Rogaly. “The effects of having all these military installations across the world is going to be extremely severe when you’re supplying them with fossil fuels, clearing land, building installations for military activity, contaminating with toxic waste.”\nBasav Sen, climate policy project director at the Institute for Policy Studies thinktank, who reviewed the report, said the research is “crucial”.\n“We can’t account for our emissions without accounting for the military-industrial complex,” he said.\nView image in fullscreen The US military is the world’s largest institutional greenhouse gas emitter. Photograph: Jacob Mattingly/US Department of Defense/AFP/Getty Images\nThe outsized environmental impact of militaries\nMilitaries are among the world’s biggest contributors to the climate crisis, accounting for 5.5% of all global greenhouse gas emissions, one 2022 estimate from international experts found.\nThe new study’s researchers said they focused on the US and UK militaries specifically because they have been “architects of the modern fossil fuel economy” since the Industrial Revolution.\n“The country where the Industrial Revolution started was Britain,” said Sen. “It was built on capital, free labor and land they got by colonizing people … around the global south.”\nskip past newsletter promotion Sign up to Down to Earth Free weekly newsletter The planet's most important stories. Get all the week's environment news - the good, the bad and the essential Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThe US, meanwhile, has became the “successor state to Britain” by becoming the world’s top imperial superpower, said Sen. “The role of US military power in keeping the world safe for capitalist [fossil fuel] extraction can’t be overstated,” he said.\nThe US military is the world’s largest institutional greenhouse gas emitter and the single largest institutional consumer of fossil fuel, according to two separate 2019 studies.\nMilitary emissions have been exempted from international climate agreements since 1997, when the US successfully lobbied to keep overseas military activity out of the Kyoto protocol. During the Paris talks in 2015, leaders technically removed the exemption, but made military emissions reporting optional.\nRedressing the contributions\nThe report recommends that the two countries contribute a combined $111bn to an independently governed fund for low-income countries on the frontlines of the climate crisis, with regions closest to US and UK military infrastructure receiving the most aid.\nThese funds should come out of military budgets, and both countries should be required to close a percentage of their bases, the authors write. They also say the two nations should create a global military “superfund” program to pay for cleanup efforts “through direct payments, technology transfer, and job training at sites”.\nBoth the US and the UK should also be required to undertake a comprehensive audit of the environmental damage they have caused, the study says. And the two governments should transition some of their military and arms manufacturing sectors to focus on green manufacturing, the authors say, drawing inspiration from previous worker-led conversion projects, such as the 1970s plan by workers at the UK’s Lucas Aerospace – created when facing cuts to production – to shift to producing needed goods like medical equipment and heat pumps.\nLast year, the US Department of Defense began a process to address supply chain emissions, and in 2020, the agency announced it had slashed its emissions by 23% relative to 2008 levels (though those figures also didn’t include highly polluting ships, aircrafts, or combat vehicles). The UK Ministry of Defence has also said it has cut pollution and “increased its sustainability activity” in line with plans to reach net zero emissions across all UK sectors by 2050.\nBut “greening” militaries while maintaining existing operations is not a good solution, the authors say.\n“‘Green’ fuels won’t cut it,” said Rogaly. “Only a reparative program that extends from base closures and reduced operations to environmental remediation, climate finance and just transition plans for military workers is up to the task.”", "source_domain": "www.theguardian.com", "text": null, "title": "US and UK militaries ‘owe’ combined $111bn in climate reparations - study", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/environment/2023/nov/06/study-us-and-uk-militaries-owe-combined-111bn-in-climate-reparations"}