{"authors": [], "date_download": "2024-02-05 15:44:36", "date_modify": "None", "date_publish": "2023-11-06 11:04:36", "description": "The Russian military has reported a successful test launch of an intercontinental ballistic missile designed to carry nuclear warheads from a new nuclear submarine", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Frussia-ap-moscow-vladimir-putin-ukraine-b2442037.html.json", "image_url": "https://static.independent.co.uk/2023/11/05/17/Russia_Military_68012.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Russian military on Sunday reported a successful test launch of an intercontinental ballistic missile designed to carry nuclear warheads from a new nuclear submarine.\nThe report comes as tensions are soaring between Russia and the West over the fighting in Ukraine. Adding to those tensions, President Vladimir Putin last week signed a bill revoking Russia’s ratification of a global nuclear test ban in a move that Moscow said was needed to establish parity with the United States.\nThe Russian Defense Ministry said in a statement that the Imperator Alexander III strategic missile cruiser fired the Bulava missile from an underwater position in Russia's northern White Sea, and hit a target in the far-eastern region of Kamchatka. It wasn't immediately clear from the statement when the test launch occurred.\nThe Imperator Alexander III is one of the new Borei-class nuclear submarines that carry 16 Bulava missiles each and are intended to serve as the core naval component of the nation’s nuclear forces in the coming decades. According to the Defense Ministry, launching a ballistic missile is the final test for the vessel, after which a decision should be made on its induction into the fleet.\nThe Russian navy currently has three Borei-class submarines in service, one more is finishing tests and three others are under construction, the Defense Ministry said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia says it test-fired an intercontinental ballistic missile from a new nuclear submarine", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/russia-ap-moscow-vladimir-putin-ukraine-b2442037.html"}