{"authors": [], "date_download": "2024-02-05 15:44:41", "date_modify": "None", "date_publish": "2023-11-06 16:45:05", "description": "Resistance groups fighting Myanmar’s military government have reportedly seized control of a district capital in a northern section of the country in a four-day offensive that captured a police station and state offices", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-bangkok-myanmar-aung-san-suu-kyi-karen-b2442590.html.json", "image_url": "https://static.independent.co.uk/2023/11/03/14/Myanmar_Conflict_56510.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nArmed resistance groups fighting Myanmar 's military government seized a district capital in the north Monday after taking state offices and a police station in a four-day offensive, according to residents, the country’s major opposition coalition and media reports.\nKawlin in Sagaing region is the first administrative capital seized by the resistance forces in continuing strife since the army seized power from the elected government of Aung San Suu Kyi in February 2021.\nSagaing has been a stronghold of armed resistance to the army, which has responded with major offensives using ground troops supported by artillery and air strikes, burning down villages and driving hundreds of thousands of people from their homes.\nLoosely organized resistance groups opposed to army rule, known as the People’s Defense Force, or PDF, have sprung up around the country since the army’s takeover. They have made alliances with well-established armed ethnic minority groups such as the Kachin and Karen, who have been fighting in border areas for greater autonomy from the central government for more than half a century.\nKawlin, which is about 200 kilometers (125 miles) north of Mandalay, the country’s second biggest city, is the principal town of Kawlin district.\nClashes began there at dawn on Friday with coordinated attacks by a combined force of at least three local resistance groups including the Kawlin People’s Defense Force, according to reports posted online by media groups sympathetic to the resistance struggle.\nOutlets including Khit Thit Media also posted video online showing what they said were members of the resistance clearing the bodies of soldiers and police killed in battle from damaged buildings.\nIt was impossible for The Associated Press to independently verify details of the fighting in the remote, war-torn area.\nHowever, a resident interviewed by phone said that the resistance fighters seized Kawlin’s police station on Sunday evening and the township administration office on Monday at 7:30 a.m, and by that morning they had taken control of the whole town, which was being patrolled by a joint resistance force. He spoke on the condition of anonymity because he was afraid of being arrested by the military.\nMembers of the Kachin Independence Army, an armed wing of the main Kachin political organization, the Kachin Independence Organization, were among the resistance forces taking part, he said.\nHe said the military’s intense aerial bombardments and shelling of recent days had stopped on Monday, and the resistance forces were preparing to defend against new attacks.\nMore than 20 members of the military and three members of the resistance groups died in clashes, and the number of the civilians killed during the fighting was still be being tallied, he said.\nAnother resident who also spoke on the condition of anonymity due to security concerns said about 30,000 civilians, including inmates of the local jail, were evacuated into the forest and nearby villages by the resistance groups to avoid casualties from air strikes.\nMyanmar's National Unity Government -- the main organization opposed to military rule -- said in the statement posted on its Facebook page that resistance fighters had seized control of the police station, general administration office, high school, the land management and statistics office and Myanma Commercial Bank\nIt said it was the first time that an administrative district capital had been attacked and captured.\nAccess to the internet and mobile phone services in the area was almost entirely cut off as the fighting raged.\nMore a dozen Kawlin residents who have been away from the town told the AP that since Saturday evening they have not been able to reach family members still in Kawlin by mobile phone.\nThe victory came a week after the Three Brotherhood Alliance launched an offensive against the military government and seized three towns in the country’s northeast, including a major border crossing for trade with China.\nThe unexpected action by the alliance, composed of the Arakan Army, the Myanmar National Democratic Alliance Army and the Ta’ang National Liberation Army, was seen as boosting the nationwide armed struggle to overthrow the military regime.", "source_domain": "www.independent.co.uk", "text": null, "title": "Myanmar resistance claims first capture of a district capital from the military government", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-bangkok-myanmar-aung-san-suu-kyi-karen-b2442590.html"}