{"authors": ["Stacy Liberatore", "Stacy Liberatore For Dailymail.Com"], "date_download": "2024-02-05 15:44:44", "date_modify": "None", "date_publish": "2023-11-06 19:28:43", "description": "The Israel Defense (IDF) revealed its Arrow missile defense system took down an 'aerial threat' soaring outside of Earth's atmosphere that was fired by Iran-backed Houthi rebels in Yemen.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsciencetech%2Farticle-12716503%2FIsrael-space-war-Arrow-missile-defense-system.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/06/19/77467619-0-image-m-34_1699298888625.jpg", "language": "en", "localpath": null, "maintext": "Space has become the new theater of war after Israel shot down a rocket soaring 'outside of Earth's atmosphere.'\nThe Israel Defense (IDF) revealed last week that its Arrow missile defense system took down an 'aerial threat' allegedly fired by Iran-backed Houthi rebels in Yemen.\nWhile details are sparse, the accepted boundary between Earth's atmosphere and space is 62 miles above the surface, known as the Kármán line.\nIDF said the Arrow intercepted a surface-to-surface missile in the Red Sea fired towards its territory after the rocket traveled nearly 1,000 miles from Yemen.\nHouthi military spokesperson Yahya Saree claimed it was the third attack the group had launched at Israel and vowed there would be more to come until 'Israeli aggression' stopped, referring to the war against Hamas in the Gaza Strip.\nThe Israel Defense (IDF) revealed last week that its Arrow missile defense system took down an 'aerial threat' allegedly fired by Iran-backed Houthi rebels in Yemen\nThe Israeli military said it used the Arrow aerial defense system for the first time since the October 7 outbreak of the war with Hamas, the de facto governing authority of the Gaza Strip.\nThe war began when Hamas gunmen launched a surprise Israel, killing more than 1,400 people and taking over 220 hostages.\nSince then, more than 8,300 people have been killed, many of them children, according to the health ministry in Hamas-run Gaza, an impoverished slice of land that is home to 2.4 million people.\nYemen's Houthi military joined the Israel-Hamas conflict on October 31 when the group fired drones and missiles at Israel, forcing IDF to break out its Arrow 3 'missile-killer' to strike back.\nArrow, jointly built with the US, was first tested in 2013, followed by another in 2014 and again in 2019 over the state of Alaska amid concern about Iran's continuous nuclear and ballistic missile programs.\nThe defense system is designed to intercept ballistic missiles outside the Earth's atmosphere, allowing it to take down Houthi's rocket last month.\nSpace has become the new theater of war after Israel shot down a rocket soaring 'outside of Earth's atmosphere'\nIDF said the Arrow intercepted a surface-to-surface missile in the Red Sea fired towards its territory after the rocket traveled nearly 1,000 miles from Yemen\nArrow is said to have taken down an enemy missile soaring outside Earth's atmosphere. While details are sparse, the accepted boundary between Earth's atmosphere and space is 62 miles above the surface, known as the Kármán line\nCorrection: An earlier version of this caption stated the image was of the Arrow shooting down the rocket. In fact, it is footage showing Israeli airspace intercepting another rocket using an F-35i - taken the same day as Arrow blasted the rocket outside of Earth's atmosphere\nArrow provides hypersonic capabilities and can defend a vast area, providing a comprehensive defense of strategic sites and large populated areas.\nREAD MORE:Netanyahu warns 'no one will be safe' if the Middle East falls to Iran's 'axis of terror' and insists Israel is engaged in a 'global battle' Israeli Prime Minister Benjamin Netanyahu has called on the world to back his fight against Hamas, claiming that Israel is engaged in a 'global battle' against an Iran-led 'axis of terror.' Advertisement\nIt can also blast long-range threats, including those carrying weapons of mass destruction, far away from the targets.\nThe missile system uses hit-to-kill technology to destroy incoming missiles by launching vertically and moving toward the estimated interception point.\nThe kill vehicle is found once the hostile warhead is identified and the target is close enough.\nIt is believed that Houthi launched a laser-guided Barkan 3 long-range missile, which avoided detection for other defense layers, forcing Israel to use its Arrow.\nCEO and President of the Israel Aerospace Industries, Boaz Levy, said: 'The Arrow system […] demonstrated today that Israel possesses the most advanced technology for defense against ballistic missiles at various ranges.'\nIsrael's IDF spokesperson, Rear Admiral Daniel Hagari, referred to the Houthi threat on the evening of October 31, saying that Israel knows how to protect itself and protect its interests.\nHe said that despite the dangers, Israel was concentrated on the conflict against Hamas and would not be distracted by the incident but could act in the future at a time and place of its choosing.\nThe Houthis see themselves as part of the so-called 'Axis of Resistance,' which encompasses Iranian-backed Shi'ite Muslim factions in Iraq and Lebanon's Hezbollah group.\nThe movement has battled a Saudi-led coalition since 2015 in a conflict that has killed hundreds of thousands of people.\nDuring the fighting, the Houthis targeted strategic assets in the Gulf, most notably energy facilities in Saudi Arabia.\nThe addition of yet another Iran-backed group fighting against Israel marks a terrifying escalation in the war and heightens fears the fighting in Gaza could engulf the Middle East.\nIt means that Israel is facing attacks by Tehran-backed groups from every direction - from Hamas to its east, Hezbollah terrorists from the north in Lebanon, Syria's National Defense Forces to the west and now Yemen's Huthis from the south.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Space becomes new theater of war: Israel shoots down a ballistic missile that was traveling 62 miles ABOVE Earth", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sciencetech/article-12716503/Israel-space-war-Arrow-missile-defense-system.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}