{"authors": ["Paul Donald"], "date_download": "2024-02-05 15:44:45", "date_modify": "None", "date_publish": "2023-11-06 12:21:40", "description": "US Central Command said it deployed an Ohio-Class sub (SSGNs), which are the largest submarines every built for the Navy and capable of firing up to 154 Tomahawk cruise missiles", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fnuclear-sub-sent-middle-east-31371339.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31371817.ece/ALTERNATES/s1200/1_F-MvClMWUAAUwRP.jpg", "language": "en", "localpath": null, "maintext": "US Central Command said it deployed an Ohio-Class sub (SSGNs), which are the largest submarines every built for the Navy and capable of firing up to 154 Tomahawk cruise missiles\nThe US has sent a nuclear-powered submarine to the Middle East in what some experts have suggested is a clear warning to Iran about its involvement in the ongoing Israel-Hamas war.\nUS Central Command said it deployed an Ohio-Class sub (SSGNs), which are the largest submarines every built for the Navy and capable of firing up to 154 Tomahawk cruise missiles - 50 percent more than US guided-missile destroyers. They are also the world's third-largest submarines.\nOn X, formerly Twitter, the defense force posted a picture appearing to show the sub, which has not been named, in the Suez Canal north-east of Cairo, Egypt. It wrote: \"On November 5, 2023, an Ohio-class submarine arrived in the US Central Command area of responsibility.\"\nThe sub - which can carry out conventional strikes virtually undetected - joins a number of other US Navy assets already in area, including two aircraft carrier strike groups and an amphibious group. In April, the Navy announced that the USS Florida, one of the two East Coast-based SSGNs, was operating in the Middle East.\nSpeaking to CNN in 2021, Carl Schuster, a former director of operations at the US Pacific Command’s Joint Intelligence Center, explained: “SSGNs can deliver a lot of firepower very rapidly. One-hundred and fifty-four Tomahawks accurately deliver a lot of punch. No opponent of the US can ignore the threat.”\nThe power of the terrifying arsenal they carry was illustrated in March 2011, when the guided missile sub USS Florida fired almost 100 Tomahawks against targets in Libya during Operation Odyssey Dawn. The attack marked the first time the SSGNs were used in combat. It is rare for the US Navy reveal to the locations of its submarines and this is being seen as a clear show of force.\nThe deployment comes as US Secretary of State Antony Blinken meets Turkish Foreign Minister Hakan Fidan in Ankara, following a tour of the Middle East focused on the Israel-Hamas war. Blinken’s first visit to Turkey since Israel went to war in reprisal for the militants’ October 7 attack did not include a meeting with President Recep Tayyip Erdogan, who was travelling in Turkey’s north-east.\nBrigadier General Pat Ryder, a Pentagon spokesperson, explained that the force build-up was aimed at deterring regional escalation and protecting the US and its partners. He said: “Since that Hamas terrorist attack we’ve also been crystal clear that we do not want to see the situation in Israel widen into a broader regional conflict.”\nHe also traveled to Ramallah in the West Bank on Sunday for a previously unannounced meeting with Palestinian President Mahmoud Abbas. The Secretary of State later flew to Baghdad, Iraq, for talks with Iraqi Prime Minister Mohammed Shia al-Sudani. Meanwhile, US vice-president Kamala Harris will have a tele-conference with foreign leaders where she will discuss how the Biden administration is planning to increase the flow of humanitarian aid into the besieged territory of Gaza.\nThe flurry of diplomacy is taking place as US bases in Iraq and Syria – where the US has small forces deployed to fight ISIS – have been attacked dozens of times by Iranian-backed militias since the war began on October 7. Yemen’s Houthi rebels have been firing drones and missiles at southern Israel while the Lebanon-based group Hezbollah has launched limited attacks to the north of the country.\nWashington has also been strengthening its Gulf allies' defences, with a Terminal High Altitude Area Defense (THAAD) missile system being sent to Saudi Arabia and Patriot surface-to-air missile systems heading to Kuwait, Jordan, Iraq, Saudi Arabia, Qatar and the United Arab Emirates.", "source_domain": "www.mirror.co.uk", "text": null, "title": "US nuclear sub sent to Middle East in stark warning as tensions soar in Israel-Hamas war", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/nuclear-sub-sent-middle-east-31371339"}