{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:16:41", "date_modify": "None", "date_publish": "2024-01-21 15:09:05", "description": "If it feels like the world is seeing a spike in deadly conflicts, the data is there to back up that notion, with 2022 seeing a spike in deaths in state-based conflict - a trend expected to continue.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12969249%2FWhy-world-conflicts-globe-increase.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/19/15/80228645-0-image-m-49_1705679465171.jpg", "language": "en", "localpath": null, "maintext": "Speaking on Monday, Britain's defence secretary Grant Shapps warned in a speech that the UK has moved out of a post-war state and is now facing a 'pre-war world'.\nHis comments were made to highlight the need for Britain to increase its defence spending, but also demonstrated growing concern over current and future conflicts.\nRelative peace in Europe was shattered in February 2022 with Vladimir Putin's invasion of Ukraine, and the Middle East once again found itself in crisis 18 months later after Hamas's October 7 terror attack on Israel, and Israel's retaliation on Gaza.\nAnd while these two conflicts have dominated the news cycle, others have also been wreaking havoc in Africa, Southeast Asia, and the Caucuses.\nMeanwhile, there are mounting fears that the war in Gaza could spillover into the Middle East, and that China could invade Taiwan in the coming years - a conflict that has the potential to plunge the world into a third global war.\nWhat's more, Thursday saw NATO admiral Rob Bauer warn that the military alliance is bracing itself for an attack by Russia within the next 20 years.\nIf it feels like the world is seeing a spike in deadly conflicts, the data is there to back up that notion. Figures compiled by the Peace Research Institute Oslo show more battle-related deaths from state conflicts in 2022 than in any year since 1984.\nThe data shows that Russia's invasion of Ukraine and the war between the Government of Ethiopia and the Tigray People's Liberation Front (TPLF) accounted for the majority of the more than 204,000 recorded war-related deaths last year.\nIt was also the first year that fighting in Europe accounted for more than 25,000 of the world's deaths from state-based violence since the Second World War.\nAccording to Justin Crump, an intelligence, security and defence expert and CEO of global risk analysis firm Sibylline, further regional conflicts can be expected in the years ahead, especially as climate change worsens and resources grow scarce, and as the world's superpowers clash with fight proxy wars with Grey Zone tactics.\nRelative peace in Europe was shattered in February 2022 with Vladimir Putin 's invasion of Ukraine , and the Middle East once again found itself in crisis 18 months later after Hamas 's October 7 terror attack on Israel , and Israel's retaliation on Gaza (pictured)\nThere are mounting fears that China could invade Taiwan in the coming years - a conflict that has the potential to plunge the world into a third global war\nThursday saw NATO admiral Rob Bauer warn that the military alliance is bracing itself for an attack by Russia within the next 20 years. Pictured: Russian tanks are seen during a drill in Belarus on February 21, 2022 - days before Putin ordered the invasion of Ukraine\nFigures compiled by the Peace Research Institute Oslo show more battle-related deaths from state conflicts in 2022 than in any year since 1984\nAsked by MailOnline about the growing fears of a global conflict, Mr Crump said: 'I don't think this is inevitable, but I think the risks are mounting.\n'If it's not next year, it'll be by the end of the decade, we'll be looking at a similar sort of problem. And unless something dramatically changes on the planet, the risk is just going to keep mounting. The tensions will keep mounting.'\nSince 2020, there have been a number of regional conflicts in addition to those currently being fought in Ukraine and the Middle East.\nThe Tigray War saw tens of thousands of people killed across northern Ethiopia between November 2020 to November 2022 while an on-going civil war in Sudan, which began in April 2023, has also caused widespread death and destruction.\nAfrica has also seen a series of successful military coups. Governments have been overthrown in countries including Burkina Faso, Guinea, Chad, Mali, Gabon and Niger, and the Democratic Republic of Congo is also facing an on-going humanitarian crisis - the roots of which date back to the Rwandan genocide of 1994.\nAnother coup happened in 2021, this time in Myanmar, when the military overthrew the democratically elected government of Win Myint and Aung San Suu Kyi, plunging the country into a crisis. Rebels continue to fight back.\nNagorno-Karabakh proved to be another flash point in recent years, culminating in 2023 when Azerbaijan launched a large-scale military offensive into the region, forcing the Armenian people there from their homes.\nAccording to Mr Crump, we can expect more of these regional conflicts.\nBut while those listed above have largely been political, he says there is the growing likelihood that wars will be fought as a result of dwindling resources on account of climate change, such as water, and as more people are forced from their homes.\n'We're definitely going to see more regional conflicts next year because the pressures are mounting, climate change is making people shift around,' he said.\n'Guess what? They bump into each other. That causes problems. There isn't enough water. People are going to start fighting for water. This stuff is all going to happen.\n'It's just the case, whether it's this year, next year or ten years hence.'\nIn Sibylline's annual report report analysing global risks, climate change is listed as one of five key drivers of political security, governance and criminal trends.\nIt points to rising temperatures exacerbating wildfire risks, driving erratic storms, and increasing the risk of floods and draughts.\n'Given the increased exposure of human settlements to these risks, the impacts of our changing climate will continue to shift the locations and movement patterns of people – they will also drive competition over resources,' the report says.\nClimate change, the firm adds, 'serves as a slow but steady driver of instability and change, exacerbating many other longer-standing sources of tension and increasing the likelihood of disruption and risk to life.'\nA destroyed tank is seen in a field in the aftermath of fighting between the Ethiopian National Defence Force (ENDF) and the Tigray People's Liberation Front (TPLF) forces in Kasagita town, in Afar region, Ethiopia, February 25, 2022\nA truck, carrying grains to Tigray and belonging to the World Food Programme (WFP), burns out on a route 80 kilometers from the Semera, Ethiopia, on June 10, 2022\nA man waves an Ethiopian flag as he join others gathering in Addis Ababa, Ethiopia, on October 22, 2022 during a protest in support of the country's armed forces\nThis photo taken on December 10, 2023 shows members of the Mandalay People's Defense Forces (MDY-PDF) patrolling near the frontline amid clashes with Myanmar's military\nSub-Saharan Africa - already a region with extreme poverty and disease - will bear the brunt of rising temperatures sooner than others.\nAgriculture is regularly disrupted by extreme weather in the Sahel and the Horn of Africa, and the loss of livelihoods and increasingly scarce resources are 'intensifying inter-communal conflict, further militarising historic disputes and encouraging communities to mobilise along ethnic lines,' the report says.\nBoth Military governments and jihadist groups in the region are exploiting this, with the first marginalising already fringe societies and the latter using it to bolster recruitment. More extreme groups lead to more violence.\nAt the end of last year in Nigeria, almost 300 Christians were reported to have been killed in a wave of 'coordinated' attacks on Christmas Eve. Reports said the attacks were carried out by the Fulani Islamist militia, who in 2014 were named the fourth deadliest terrorist group in the world by the Global Terrorism Index.\nWhile the attacks are believed to have been motivated by religion, other localised conflicts have been fought in Nigeria's Middle Belt over land rights between cattle herders and agrarian hamlets.\nSibylline's report also highlights the risk climate change poses to the Middle East, North Africa and Turkey.\nThe region has to contend with extreme storms, unusually heavy rainfall and wildfires, as well as droughts, sandstorms and food insecurity. Turkey was also the victim of a deadly earthquake last year, displacing thousands of people.\nWorsening conditions in Sub-Saharan Africa as well as across the north of the continent and the Middle East will continue to force people from their homes.\nThis will push them towards safer countries in Europe, where the issue of migration can inflame tensions - both between states and in domestic politics - fuelling border disputes and emboldening parties with more extreme views.\nWhat's more, Africa is home to about one-third of the world's mineral resources, including minerals that are vital to the world's clean energy technologies.\nForecasts suggest that in the coming decades, the world will need many times more cobalt, copper and lithium than what is being produced for consumer goods and defence applications like phones, electric vehicles and satellites.\nThis poses a significant challenge to the United States and the rest of the West, due to China dominating the globe's critical supply of such minerals.\nInfact, China accounts for 60 percent of world-wide production and 85 percent of processing capacity, according to the United States Institute for Peace.\nChina is already well entrenched in Africa, with Chinese entities now owning stakes in nearly all the producing mines in the Democratic Republic of Congo, for example, which supplies 70 percent of the world's cobalt.\nChinese mining companies have also invested heavily in lithium mines, and are behind lithium projects in countries including Namibia, Zimbabwe and Mali.\nEstimates suggest Beijing could control one-third of the world's lithium capacity by 2025, leaving the US and other countries well behind. The West's need for the same resources will only serve to create further divisions with China.\nTensions between the US and China are already high amid fears that Beijing could order the invasion of Taiwan in the coming years.\nChina claims self-ruled Taiwan as its territory, and fears have grown in recent years that President Xi Jinping is planning an invasion in the coming years, in the face of increasingly hostile rhetoric and simulated blockades of the island.\nChinese People's Liberation Army (PLA) soldiers are assembled during military training at Pamir Mountains in Kashgar, northwestern China's Xinjiang region in January 2021\nTensions between the US and China are already high amid fears that Beijing could order the invasion of Taiwan in the coming years. Pictured: Chinese troops march in Beijing (file photo)\nSoldiers of Taiwanese Army take part in a military exercise at an undisclosed location in Taiwan in this handout picture provided by Taiwan Defence Ministry and released on April 9, 2023\nTaiwan's compulsory servicemen demonstrate their combat skills to the media at a military base in Taichung, Taiwan, November 23, 2023\nThere is no doubt that such an invasion would be devastating for the region from a humanitarian perspective, with some suggesting as many as 500,000 people could be killed in any such military action.\nBut experts have also warned of the devastating impact an attack would have from an economic perspective, particularly on the West.\nTaiwan produces 90 percent of the world's advanced chips, the brains in all modern electronic equipment, and any shortage in semiconductors has been described as 'catastrophic' to both the UK and the global economy.\nShould China seize Taiwan, then it would also corner the semiconductor market, giving the US and its allies multiple incentives to defend Taiwan - something Washington has signalled it would do in the event of an invasion.\nChina has been hostile to its other neighbours in recent years, too.\nIt has become increasingly aggressive in the South China Sea, with its navy and fishing vessels often coming into close contact with Filipino vessels.\nIt has also been accused of using its vast fishing fleet to dominate the South China Sea, which it claims should be under its control almost in its entirety.\nAn investigation by the New York Times last year highlighted how China's fishing boats - often armed with weapons - combined with its aggressive coastguard work to assert Beijing's presence more than 1,000 miles from China's coast.\nBeijing has also clashed with Japan over the disputed Senkaku Islands, using its fishing industry to bolster its claim.\nThere have also been clashes between China and India in the Galwan Valley in the Himalayas which has seen soldiers fighting for the world's two largest nations, both of whom are armed with nuclear weapons, clashing with melee weapons.\nIn 2021, China admitted to losing four of its troops in the fighting.\nMr Crump says China's actions in the South China Sea is a prime example of 'Grey Zone' tactics - a type of unconventional warfare\nClementine G. Starling is the deputy director of the Forward Defense practice and a resident fellow in the Transatlantic Security Initiative, told the Atlantic Council think tank that she defines the 'grey zone' as 'a set of activities that occur between peace (or cooperation) and war (or armed conflict).\n'A multitude of activities fall into this murky in-between - from nefarious economic activities, influence operations, and cyberattacks to mercenary operations, assassinations, and disinformation campaigns,' she added.\nThe West, Mr Crump says, should be concerned with such tactics from China.\n'It's the fishing fleet, It's the Coast Guard. It's the way they're just pushing into this space and just making it theirs and basically saying: \"what are you going to do about it? Are you going to fire a missile at us? I don't think you are\".\n'And it's really hard to come up with an answer and it's this sort of creeping penetration of geography, of societies, of thinking that's going on.'\nA picture taken from southern Israel on the border with the Gaza Strip shows smoke billowing over the Palestinian territory during Israeli bombardment on January 19, 2024\nAs China's rhetoric around Taiwan grows increasingly more concerning, there are also fears that the on-going fighting between Israel and the Hamas terror group in Gaza could spill-over into the Middle East.\nIn recent months, we have seen Yemen's Iran-backed Houthi rebels attacking ships passing through the Red Sea, between Asia and Europe - disrupting global trade.\nIn response, the US and UK have hit targets in Yemen with missiles, but have so far failed to deter further Houthi attacks.\nThe vital shipping route remains disrupted.\nThe Iran-back Hezbollah group have also been launching attacks into Israel from Lebanon, raising fears that a war could also break out between the Israeli Defence Forces and Hezbollah - a far superior fighting force to that of Hamas.\nMeanwhile, Iran this week struck targets in Pakistan. Tehran said the attacks were against a terror group, but the move angered officials in Islamabad nonetheless.\nNuclear-armed Pakistan responded overnight on Thursday, striking back at targets in Iran it also said were home to terrorists, killing at least three people.\nCurrently, Mr Crump says that diplomatic efforts by the US and other countries in the region are doing enough to keep a lid on the crisis.\nHowever, populations in the Arab world are growing more angry over the treatment of the people of Gaza by the IDF in their own efforts to eradicate Hamas.\nThere is a concern that some Arab governments in the region more sympathetic towards Hamas could be forced to act over fears of civil unrest at home, like that which was seen in the Arab spring that spread chaos in the 2010s.\nWhile there are several potential flash-points - not to mention Russia's increasingly aggressive rhetoric about its designs on Easter Europe and NATO saying this week that it is bracing for a Russian invasion within the next 20 years, Mr Crump said he thinks its unlikely that World War Three would see the world's superpowers clash head-on in the foreseeable future.\nInstead, he says it is more likely that nuclear-powered nations of the world will fight through proxies and with Grey Zone tactics.\nSuch tactics have been seen already. The Kremlin used 'little green men' to suddenly seize Crimea in 2014, while China has deployed cursive economic tactics through its Belt and Road initiative to vacuum up control over resources, as seen in Africa.\nCyber attacks, information campaigns and other forms of non-violent pressure are also being meted out by the world's superpowers in the shadows.\nUsing Taiwan as an example, Mr Crump says we can expect to see such tactics used more and more as the world's superpowers butt heads in the coming years.\n'If China launches missiles and sends in amphibious warships [to invade Taiwan], then America might feel like they have to do something straight away,' he says.\nInstead, he expects an attack on Taiwan to be 'subtle, insidious and creeping.'\n'I think one of the points about this is you're seeing potentially lots of regional conflicts, lots of grey zone conflicts,' he adds.\n'If you talk about the \"Third World War\", everyone's very scared because they picture mushroom clouds. But at no point does Russia actually want to cease existing over Ukraine. At no point does the US or China want to die in a fiery hell over Taiwan.\nUkrainian servicemen check newly built anti tank fortifications, named 'dragon's teeth' and razor wire, near the Russian border in Chernihiv region, Ukraine, January 10, 2024\nUkrainian servicemen of the 128th separate mountain assault Transcarpathian brigade of the Armed Forces of Ukraine take part in tank drills, in Zaporizhzhia, Ukraine, January 11\n'No one's that madcap about this. So we're actually back to warfare the way it used to be, which is countries fighting over something (while at the same time) they can actually be almost cooperating on something, somewhere else,' Mr Crump said.\n'You're fighting through proxies, which the US did in Vietnam, arguably. It did in Korea, arguably. We (the West) certainly fought proxies that were backed by China.\n'But the US was never actually fighting China. It never struck the Chinese mainland. It's gonna be a bit like that - widespread regional conflict.\n'I think that's more likely than an all-out World War,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Why the world is due for MORE conflicts around the globe: With Ukraine, Gaza and the Red Sea all at war, JUSTIN CRUMP explains why MORE wars will break out as nations clamour for resources", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12969249/Why-world-conflicts-globe-increase.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}