{"authors": [], "date_download": "2024-02-05 15:44:49", "date_modify": "None", "date_publish": "2023-11-06 07:10:43", "description": "‘The number of antisemitic acts has exploded’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Ffrance-antisemitic-attacks-israel-hamas-war-b2442186.html.json", "image_url": "https://static.independent.co.uk/2023/10/12/21/France_Israel_Palestinians_70913.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFrance has witnessed more than a thousand antisemitic acts since the 7 October attack by Hamas in Israel, said the country’s interior minister.\nGérald Darmanin said 486 people, including 102 foreigners, have been arrested since the Israel-Hamas conflict in offences related to antisemitism.\n“The number of antisemitic acts has exploded,” Mr Darmanin told France 2 TV on S, warning foreigners their permits would be withdrawn for committing such acts.\n“Any foreigner who commits anti-Semitic acts will have their residence permit withdrawn, placed in a detention center and expelled from the national territory,” Mr Darmanin said.\nIsrael began a bombing campaign on Gaza in the wake of an attack on southern Israel by Hamas on 7 October, in which 1,400 people were killed and 240 hostages were taken.\nThe retaliatory Israeli military offensive ramped up over the last week, with its forces surrounding Gaza city and conducting operations inside. More than 9,700 Palestinians have been killed in Gaza so far, two-thirds of them women and minors, Gaza’s Hamas-run health ministry has said.\nThe increase in antisemitic acts in France has raised fears for the country with a Jewish population of over 500,000, the largest in Europe and the third biggest in the world after Israel and the US.\nMr Darmanin said he understood the “apprehension” of French Jews and added that all means are being deployed to protect them.\nParis police chief Laurent Nunez said there had been 257 antisemitic incidents in Paris alone and 90 people have been arrested.\nHe said there was “no typical profile” of the people who were found involved in such acts.\n“We find all the profiles, young kids, who say very serious things”, but also “people more anchored in the defense of the pro-Palestinian cause and who slip up”, he said.\nIn one incident that was reported on 4 November, a Jewish woman was stabbed in her home in the city of Lyon. Prosecutors investigating the attack suspect it is linked to antisemitism.\nPolice said they were treating the attack as attempted murder and no arrest has been made yet. They said the woman’s life was not in danger.\nFrance last month banned all pro-Palestinian demonstrations and president Emmanuel Macron urged people not to allow the war in the Middle East to erupt into tensions at home.\nThis came after Paris police resorted to using teargas and water cannons on pro-Palestinian protesters who defied the ban and demonstrated against the Israeli government.\nMore than 13 French citizens have been killed in the ongoing fighting in Israel, with 17 people missing and several others believed to have been taken hostage by Hamas.", "source_domain": "www.independent.co.uk", "text": null, "title": "France records more than 1,000 antisemitic acts since 7 October, interior minister says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/france-antisemitic-attacks-israel-hamas-war-b2442186.html"}