{"authors": ["Elena Salvoni", "Nick Craven In Israel"], "date_download": "2024-02-05 15:44:50", "date_modify": "None", "date_publish": "2023-11-05 19:49:42", "description": "Israel 's Defence Forces say they are carrying out 'widespread strikes on terror infrastructure' below and above ground after revealing what they say is more evidence of Hamas's tunnel network.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12713155%2FIsrael-Hamas-war-crimes-evidence-terror-hospitals-IDF-encircled-Gaza-City.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/05/19/77430147-0-image-a-38_1699213744493.jpg", "language": "en", "localpath": null, "maintext": "Israel's Defence Forces say they have 'fully encircled Gaza City' and are carrying out 'widespread strikes on terror infrastructure' below and above ground after revealing what they say is more evidence of Hamas's 'City of Terror' tunnel network.\nAmid reports of 'severe clashes' between Israeli forces and Hamas, Gaza's Hamas government claimed Israel's forces carried out 'intense bombing' around several hospitals in the north of the Gaza Strip, shortly after telecommunications were cut.\nGaza has reportedly come under its third total communications outage since the start of the war, while Israel's military announced it had surrounded Gaza City and divided the besieged coastal strip into two.\n'Today there is north Gaza and south Gaza,' IDF spokesman Rear Admiral Daniel Hagari said, calling it a 'significant stage' in the war against Hamas. Israeli media reported that troops are expected to enter Gaza City within 48 hours.\nIt came as Israel accused Hamas of war crimes, revealing new evidence that it says proves the terror group uses hospitals in the Gaza Strip as military bases while preventing civilians from escaping.\nSmoke and flames rise over Gaza City as fighting intensifies in the main city of the besieged strip\nAt another civilian facility, the Sheikh Hamad, known as the 'Qatari' hospital, Hagari showed photo evidence of tunnel entrances alongside the building discovered by Israeli troops\nFootage shows what the IDF says are entrances to Hamas tunnels beneath one hospital\n'Hamas is weak without human shields,' said Hagari as the previously classified intelligence was published which he said had been shared with partner agencies from the US and UK.\nHe showed aerial photos of Hamas rocket launchpads near the 'Indonesian' hospital in Gaza, and said the terrorists knew that the IDF could not launch an airstrike with collateral damage to the hospital.\nAmid crippling shortages of fuel for hospitals and homes, Hagari said further material shared by the IDF shows 'there is no shortage of fuel in Gaza. It is in the hands of Hamas. They are stealing it from the hospitals.'\nHe added that some of that fuel was stored under the Indonesian hospital, which was only 75 metres from a launch site, and the building was actually constructed over Hamas' 'City of Terror', the spider's web of tunnels beneath the enclave.\nThere was also a recording of a Gazan official telling a colleague: 'They say there is a fuel shortage in Gaza, they are liars, liars,' in a recorded conversation, which Hagari said the United States had verified.\nAt another civilian facility, the Sheikh Hamad, known as the 'Qatari' hospital, Hagari showed what he said is photo evidence of tunnel entrances alongside the building discovered by Israeli troops.\nHe also showed video footage of Hamas terrorists firing at the Israelis from inside the hospital.\nThere were video and audio clips purportedly showing that Hamas was actively preventing the evacuation of civilians from the northern Gaza strip, which the Israelis have encouraged through the dropping of 1.5m pamphlets, 6m pre-recorded phone calls and 4.4m SMS texts.\nIsraeli army flares illuminate the sky over the northern Gaza Strip\nSmoke rises following Israeli air strikes in the northern Gaza Strip\nIsraeli soldiers and tanks take position inside the heavily-bombarded Gaza Strip\nDuring one, said to be a recorded call to a resident of Jabalia refugee camp, an IDF officer tells them in Arabic: 'There will not be any safe place.'\nHe said some of that fuel was stored under the Indonesian hospital, which was only 75 metres from a launch site, and the building was actually constructed over Hamas' 'City of Terror', the spider's web of tunnels beneath the enclave.\nHagari showed photos of Hamas vehicles blocking the exit road from northern Gaza and said its fighters had fired anti-tank weapons at Israeli troops who opened a humanitarian corridor to allow further evacuations.\nThe new intelligence has come to light as Israel's military said it has split the besieged coastal enclave in two.\nTroops 'reached the coastline and are holding it', he added.\n'There are now widespread strikes on terror infrastructure – below ground and above it,' Hagari said.\nOn Sunday evening, dramatic pictures showed huge fireballs rising over Gaza City in the north, which Hamas has blamed on Israeli bombing.\n'For more than an hour, intense bombings have been taking place around hospitals,' said Salama Marouf, the head of the Hamas government's media office.\nThe vicinity of the Palestinian territory's largest hospital, Al-Shifa, saw particularly heavy strikes, according to Marouf.\nThe bombing came after the Israeli military once again accused Hamas of using hospitals in their military campaign against Israel.\n'Hamas places forces and weapons inside, under and around schools, mosques, homes and UN facilities,' Hagari told reporters on Sunday.\nSmoke rises following Israeli air strikes in the northern Gaza Strip\nA picture taken from Sderot along the border with the Gaza Strip early on November 5, 2023 shows smoke and fire rising over the Palestinian enclave during an Israeli strike\nDestroyed buildings in Gaza City on November 5, 2023\n'Among the worst of Hamas war crimes is the use of hospitals to hide their terror infrastructure,' he added. Hamas has repeatedly rejected the charge.\nAsked what action Israel would take against the Hamas facilities he had identified, he said: 'I can't say more, but it must come to an end,' adding, 'Israel abides by international law.'\nIsrael has relentlessly pounded the besieged Gaza Strip in its battle to destroy Hamas, levelling entire city blocks and killing more than 9,700 people, mostly women and children, according to the Hamas-run health ministry.\nThe attack on Gaza came after Hamas militants stormed across the border on October 7 and killed 1,400 people, mostly civilians, Israeli authorities say.\nIsrael continued its brutal attack on Hamas overnight, with IDF jets striking a 'terror base'\nAs Israel's relentless bombardment of the Gaza Strip continues into its 30th day, the conflict threatens to expand into all-out war on another front.\nAs daily cross-border exchanges of fire continue between Hezbollah and Israel's military across the Israel/Lebanon border, the IDF's Chief of Staff Lt. General Herzi Halevi said today that his army is prepared to go on the offence.\n'We set a goal of restoring a significantly better security situation on the borders, not only in the Gaza Strip,' says Halevi during an assessment at the 210th Division in northern Israel today.\n'We are ready at any moment to go on the offense in the north. We understand that it can happen, and we trust you that the defense here is strong,' he added.\nTensions are racheting up just a day after Hezbollah's firebrand leader Hassan Nasrallah threatened to escalate the war against Israel, warning of a 'true battle'.\nThe powerful group's leader praised the Alaqsa Flood - the name used by Hamas for its vicious assault last month.\nHe said the 'glorious jihadi operation' had led to an 'earthquake' in the Jewish state, revealed the weakness of Israel and its army, and established a new historical phase in the battle.\n'Your fleet in the Mediterranean do not scare us... We are ready to face the fleet you threaten us with,' Nasrallah said, addressing the US. 'Whoever wants to prevent a regional war must quickly stop the aggression on Gaza.'\nThe United States 'impedes a ceasefire and the end of the aggression', he added.\nHis heavily armed group, backed by Iran, carried out simultaneous attacks on Israeli positions along the Lebanese border, as residents of south Lebanon reported the fiercest Israeli strikes yet.\nThe IDF said its planes had struck Hezbollah targets in retaliation for their attack and combined the air strikes with artillery and tank shelling.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel accuses Hamas of 'war crimes' and reveals new evidence terror group uses hospitals as military HQs - as IDF says it has 'fully encircled Gaza City'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12713155/Israel-Hamas-war-crimes-evidence-terror-hospitals-IDF-encircled-Gaza-City.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}