{"authors": ["Juliana Cruz Lima"], "date_download": "2024-02-05 15:44:52", "date_modify": "None", "date_publish": "2023-11-05 16:56:47", "description": "HAMAS terrorists have hidden rocket launchers within a playground and amusement park compound in northern Gaza, the IDF claims.", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24638705%2Fhamas-hidden-rockets-playground-gaza-israel-war%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/newspress-collage-24638705-1699203307528.jpg?1699203320&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "HAMAS terrorists have hidden rocket launchers within a playground and amusement park compound in northern Gaza, the IDF claims.\nTroops claim they have found four underground launchers some 16ft from a children’s swimming pool as Benjamin Netanyahu vowed there will be no ceasefire until Hamas releases its hostages.\n4 The IDF claims Hamas terrorists 'hide rockets in playgrounds and swimming pools' Credit: IDF\n4 Benjamin Netanyahu vowed that Israel will not agree to a ceasefire until all hostages are freed Credit: Rex\nFootage showed more rocket launchers around 100ft from residential homes in the besieged Strip, The Times of Israel reports.\n“This is further proof of the Hamas terror organisation’s constant use of the civilian population as a human shield for terror purposes,” the IDF said in a statement.\nThe IDF also revealed footage of a \"secret tunnel\" in a Gaza hospital saying that Hamas terrorists are exploiting hospitals as part of their war machine.\n\"Today, I will be sharing evidence proving that Hamas systematically exploits hospitals as part of its war machine,\" IDF spokesman Daniel Hagari said during an official livestream on Facebook.\n\"We decided to de-classify and share more intelligence with you because the world must take immediate action against them.\"\nThe IDF claims Hamas systematically places forces and weapons inside, under and around schools, mosques, homes and UN facilities.\n\"Among the worst of Hamas' war crimes is the use of hospitals to hide their terror infrastructure,\" Hagari said.\nThe IDF says it has already shared proof that Hamas has commanding control centres inside and under Shifa Hospital.\nBut Hagari added that the same occurs at the Sheikh Hamad Hospital, located north of Gaza City along the coast.\nA video shown by the spokesman reveals a tunnel under the hospital, allegedly being used for Hamas' ground operations in Gaza.\nHagari goes on to another clip of aerial footage by the IDR, where he claims Hamas terrorists shot at Israeli forces from inside the hospital.\n\"As if it wasn't enough that we exposed the tunnel, the terrorists also shoot at our soldiers from within the hospital.\"\nThe IDF spokesman further explained how the Israeli Defense Forces made almost 20,000 phone calls, sent more than 4 million SMS and sent out over one million leaflets urging residents to evacuate Gaza.\nHe also gave evidence of how Hamas is allegedly blocking civilians from evacuating the south of the besieged enclave.\n\"Hamas tries to prevent Gazans from moving south. They put road blocks to stop civilians from leaving Jabalia,\" Hagari said.\nHe added the IDF has readjusted its ground operations to make sure evacuation corridors were remained clear from north to south of the Strip.\nIt comes as Israeli Prime Minister Benjamin Netanyahu vowed that Israel will not agree to a ceasefire until all hostages are freed, The Times of Israel reports.\n“Take this [word 'ceasefire'] out of the lexicon,\" Netanyahu said in a statement as Israel enters its 30th day at war.\n\"We say this to both our enemies and friends.\n\"We will continue until we defeat them; we do not have an alternative.\"\nHe added: “Our enemies mistook us.\n\"They thought that on the crucial day, [soldiers] would not show up.\n\"We showed up together and now we are fighting shoulder to shoulder.\"\n4 IDF spokesman Daniel Hagari said that Hamas are exploiting hospitals as part of their war machine Credit: Israel Defense Forces", "source_domain": "www.thesun.co.uk", "text": null, "title": "IDF says Hamas 'hide rockets in playgrounds & swimming pools' as Netanyahu vows 'no ceasefire' until hostages are freed", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24638705/hamas-hidden-rockets-playground-gaza-israel-war/"}