{"authors": ["Matt Strudwick", "Katherine Lawton"], "date_download": "2024-02-05 15:44:54", "date_modify": "None", "date_publish": "2023-11-05 09:31:11", "description": "Mr Johnson touched down at Ben Guiron airport alongside Australia's former prime minister Scott Morrison and said he was visiting to make sure people understand Israel's 'right to defend itself'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12712293%2FBoris-Johnson-lands-Israel-meets-Brit-Israeli-soldiers-solidarity-visit.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/05/09/77419671-0-image-a-8_1699175247005.jpg", "language": "en", "localpath": null, "maintext": "Boris Johnson has visited the kibbutz where Hamas massacred Israeli civilians as he warned 'we face a huge terrorist threat' on a solidarity visit to Israel.\nPhotographs show the former prime minister walking around the area where innocent civilians were killed and hostages were snatched by Hamas during the October 7 massacre.\nMr Johnson labelled Hamas' terror attack among the most depraved in the history of human cruelty.\nHe touched down at Ben Guiron airport this morning alongside Australia's former prime minister Scott Morrison and was met by the country's former ambassador to the United Nations, Danny Danon.\nHe said he was visiting the country to make sure people understand Israel's 'right to defend itself' and warned it is imperative that Israelis 'deal' with the 'huge terrorist threat'.\nThe duo met British-Israeli soldiers in Jerusalem and were expected to speak with President Isaac Herzog, and relatives of the hostages snatched by the terrorists.\nFormer British Prime Minister Boris Johnson visits Kibbutz Kfar Aza following the October 7 attack by Hamas gunmen\nPhotographs show the former prime minister walking around the area where innocent civilians were killed and hostages were snatched by Hamas during the October 7 massacre\nMr Johnson looking at the tragic scene in Israel earlier today\nBoris Johnson and former Australian Prime Minister Scott Morrison visit Kibbutz Kfar Aza\nBoris Johnson and former Australian Prime Minister Scott Morrison speak to the media as they tour Kibbutz Kfar Aza in southern Israel\nFormer British Prime Minister Boris Johnson and former Australian Prime Minister Scott Morrison meet with British-Israeli soldiers during a visit to Jerusalem\nMr Johnson landed at Ben Guiron airport alongside former Australian PM Scott Morriosn (left) and was greeted by Israel's ex-UN ambassador Danny Danon (centre)\nMr Johnson said he was visiting the country to make sure people understand Israel's 'right to defend itself'\nMr Johnson appears to reflect on the tragedy after innocent civilians were killed and hostages were snatched by Hamas\nMr Johnson last month described Hamas' attack 'among the most sickening and depraved events in all the history of human cruelty'.\n'So it is incredible that in the three weeks since the murder of 1,400 Jews we seem — in Britain and around the world — to have lost all moral clarity,' he wrote on MailOnline.\nA spokesman for Mr Johnson said: 'Former UK prime minister Boris Johnson and former Australian prime minister Scott Morrison are in Israel making a joint visit to express solidarity and support for Israel after the terrible terrorist attacks on October 7.'\nMr Johnson met with British-Israeli troops and sat at a table alongside Mr Morrison. Explaining why he had made the visit, he said: 'I'm here as a month on after the most appalling atrocities against the Jewish people we have seen since the Second World War.\nREAD MORE: Israeli model reveals how she watched her partner die and had to play dead for two hours surrounded by a pile of corpses during horrific music festival massacre Advertisement\n'I want to make sure people understand the duty of Israelis to defend themselves and to fight terror on behalf of freedom-loving people around the world - I think that's the crucial thing.\n'When it comes to the long-term solution to the security issues then to your point of the involvement of the UK and other Western democracies I'm sure that all that kind of thing is going to be... it is a legitimate subject for consideration.\n'But right now we are facing the imperative to deal with a huge terrorist threat and the Israelis need to get on with that.'\nMr Morrison said he was 'thankful for the opportunity to join former prime minister Johnson to come to Israel as a demonstration of solidarity with the people and State of Israel and the Jewish community throughout the world;, reported The Times of Israel.\n'It is an opportunity to understand firsthand what is occurring on the ground, honor those who have been lost, show support to those who have suffered and are now engaged in this terrible conflict and discuss how to move forward,' he said.\nIt is the first trip made by an Australian politician since Hamas' attack. Rishi Sunak visited Israel on October 19.\nMr Danon posted a pictured of himself standing alongside Mr Johnson and Mr Morrison on his X page and wrote: 'Early this morning, at Israel's Ben Gurion Airport, I received my friends Boris Johnson, the former Prime Minister of Great Britain and Scott Morrison, the former Prime Minister of Australia - both true friends of Israel.\n'During the day we will visit Israel's Southern communities and will meet with our heroic IDF soldiers. On behalf of all the people of Israel, we thank you for your steadfast support.'\nHe later uploaded a video of Mr Johnson meeting British-Israeli soldiers in Jerusalem where the former prime minster asks them how long they had been in the country's army.\nA spokesman for Mr Johnson said he and former Australian prime minister Scott Morrison are in Israel making a joint visit to express solidarity and support for Israel\nMr Johnson is expected to later speak with President Isaac Herzog, and relatives of the hostages who were snatched by the terrorists during the October 7 massacre\nMr Danon described Mr Johnson and Mr Morrison as both 'true friends of Israel' and detailed their itinerary for the day\nA video was later uploaded of Mr Johnson speaking with British-Israeli soldiers in which he asks them how long they have been serving in the army\nMr Johnson shakes hands with a British-Israeli soldier. He is visiting the country a month after 'the most appalling atrocities against the Jewish people we have seen' since World War Two\nThe former Foreign Secretary and Prime Minister warned we are facing 'a huge terrorist threat'\nHe said he wants 'to make sure people understand the duty of Israelis to defend themselves and to fight terror on behalf of freedom-loving people around the world'\nWriting for MailOnline at the end of October, Mr Johnson said he wanted a 'two-state solution, and I will continue to work for it, and for peace'\nWriting for MailOnline at the end of October, Mr Johnson said we are 'treating Hamas and Israel as two belligerent parties in an ancient quarrel, where there are faults on both sides; and we are therefore ignoring, or minimising, what actually happened'.\nHe said: 'I want a two state-solution, and I will continue to work for it, and for peace.\n'I want the Palestinians to have their own homeland — though you have to wonder how the Israelis will ever trust them to make it work after the catastrophic consequences of letting Hamas run Gaza.\n'If you step back and look at the broad sweep of post-war history, you also have to wonder why this is the one territorial dispute that continues to excite such viciousness and such hatred.\n'Think of the colossal movements of people around the world after 1945, the tens of millions who were turned into refugees as the maps were re-drawn.'\nMr Johnson has had close ties with Israel during his time in government and visited the country in 2017 for the first time as Foreign Secretary when he met with Prime Minister Benjamin Netanyahu.\nTwo years later the then Prime Minister hosted Mr Netanyahu at 10 Downing Street and discussed Iran's attempts to acquire a nuclear weapon.\nMr Johnson's visit comes amid accusations from Hamas that Israeli warplanes bombed the Al-Maghazi refugee camp in the central Gaza Strip this morning, killing at least 33 people, reported ITV.\nSince the surprise Hamas attack on October 7, which Israeli officials say has killed 1,400 people, mostly civilians, Israel has bombarded the besieged Gaza Strip.\nThe health ministry in Gaza, which is run by Hamas, says more than 9,480 Gazans, mostly women and children, have been killed in Israeli strikes and the intensifying ground campaign.\nMr Johnson's visit comes amid accusations from Hamas that Israeli warplanes bombed the Al-Maghazi refugee camp in the central Gaza Strip\nThe Hamas-run health ministry said an Israeli bombing on the Al-Maghazi refugee camp late Saturday killed 30 people\nAn eyewitness reporting children dead and homes smashed, with people searching among the rubble for survivors\nMohammed Alaloul, 37, said his 13-year-old son, Ahmed, and his four-year-old son, Qais, were killed in the bombing, along with his brother\nSince Israel sent troops into the narrow Palestinian territory late last month, 'over 2,500 terror targets have been struck' by 'ground, air and naval forces', the army said today.\nIn a statement, it said ground soldiers were engaged in 'close-quarters combat' as Israeli jets were striking targets including a 'Hamas military compound' at an undisclosed location overnight.\nREAD MORE: Dramatic videos reveal intense battles raging between Israel and Hamas in war-torn Gaza with soldiers ambushed by terrorists armed with grenades emerging from tunnels Advertisement\nIn the latest onslaught in Gaza, the Hamas-run health ministry said an Israeli bombing on the Al-Maghazi refugee camp late Saturday killed 30 people, with an eyewitness reporting children dead and homes smashed.\n'An Israeli air strike targeted my neighbours' house in Al-Maghazi camp, my house next door partially collapsed,' said Mohammed Alaloul, 37, a journalist working for the Turkish Anadolu Agency.\nAlaloul told AFP his 13-year-old son, Ahmed, and his four-year-old son, Qais, were killed in the bombing, along with his brother. His wife, mother, and two other children were injured.\nA military spokesperson said they were looking into whether their forces had been operating in the area at the time of the bombing.\nThe Israel Defense Forces (IDF) today told Palestinians they would have a four-hour window for people in northern Gaza to move south.\nThe evacuation route through Salah Al-Deen Street will open between 10am and 2pm local time as people were told to follow the Israeli military's instructions 'if you care about yourself and your loved ones'.\nIsraeli Prime Minister Benjamin Netanyahu met with US Secretary of State Anthony Blinken (left) and rejected his calls for a 'humanitarian pause' until Hamas released the hostages\nTurkish President Recep Tayyip Erdogan (left) has broken off contact with Mr Netanyahu and called him personally responsible for the growing civilian death toll in Gaza\nIDF spokesman Avichay Adraee wrote on X last night: 'Today, Hamas fired mortar and anti-tank shells towards our forces, which were keen to open the road from the north of the Gaza Strip to its south so that you could protect yourselves. Hamas members carried out this because they wanted to remain human shields for themselves and their leaders.\n'I would like to inform you that despite this, the IDF will allow traffic on Salah al-Din Road tomorrow between ten (10:00) in the morning and two (14:00) in the afternoon. For your safety, take advantage of the next time to move south beyond Wadi Gaza.\n'If you care about yourself and your loved ones, head south according to our instructions. Rest assured that Hamas leaders are already taking care to protect themselves.'\nUS Secretary of State Antony Blinken's calls for a 'humanitarian pause' to Israel's onslaught of Gaza has been snubbed by Mr Netanyahu who declared in a televised statement there would not be a ceasefire unless the 240 people kidnapped by Hamas were released.\n'Israel is refusing a temporary truce that doesn't include the release of our hostages,' the Israeli PM said.\nHamas said late on Saturday the evacuation of dual nationals and foreigners from Gaza was being suspended until Israel lets some wounded Palestinians reach Rafah so they can cross the border for hospital treatment in Egypt.\nA senior White House official said Hamas had tried to use a US-brokered deal opening the Egyptian border crossing to get its cadres out.\n'That was just unacceptable to Egypt, to us, to Israel,' the official said.\nMeanwhile, Palestinian ally Turkey yesterday recalled its ambassador to Israel and has broken off contact with Mr Netanyahu in protest at the bloodshed in Gaza.\nTurkish President Recep Tayyip Erdogan told reporters he held Mr Netanyahu personally responsible for the growing civilian death toll in Gaza.\n'Netanyahu is no longer someone we can talk to. We have written him off,' Turkish media quoted Erdogan as saying.\nIsraeli foreign ministry spokesman Lior Haiat said the move was 'another step by the Turkish president that sides with the Hamas terrorist organisation'.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Boris Johnson visits kibbutz where Hamas massacred Israeli civilians as he warns 'we face a huge terrorist threat' on solidarity visit to Israel following October 7 attacks", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12712293/Boris-Johnson-lands-Israel-meets-Brit-Israeli-soldiers-solidarity-visit.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}