{"authors": [], "date_download": "2024-02-05 15:44:57", "date_modify": "None", "date_publish": "2023-11-05 08:45:06", "description": "The Russian military says a Ukrainian missile strike on a shipyard in annexed Crimea had damaged a Russian ship", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fcrimea-ap-vladimir-putin-telegram-b2441871.html.json", "image_url": "https://static.independent.co.uk/2023/11/04/10/Russia_Ukraine_War_37622.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Russian military said a Ukrainian missile strike on a shipyard in annexed Crimea had damaged a Russian ship.\nThe Russian Defense Ministry said late Saturday that Ukrainian forces fired 15 cruise missiles at the Zaliv shipyard in Kerch, a city in the east of the Crimean Peninsula. Air defenses shot down 13 missiles but others hit the shipyard and damaged a vessel, a statement from the ministry said.\nThe ministry didn't give details about the ship or the extent of the damage.\nThe Ukrainian air force commander, Mykola Oleshchuk, said in a statement that at the time of the attack carried out by Ukrainian tactical aviation, “one of the most modern ships of Russia's Black Sea fleet was at the shipyard — carrier of the Kalibr cruise missiles.” He didn't say directly, however, that this particular ship was damaged by the strike.\nThe Crimean Peninsula, which Russia illegally annexed from Ukraine in 2014, has been a frequent target since Russian President Vladimir Putin ordered a full-scale invasion of Ukraine 20 months ago. Crimea has served as the key hub supporting the invasion.\nUkraine has increasingly targeted naval facilities in Crimea in recent months. In September, a Ukrainian missile strike on a strategic shipyard in the port city of Sevastopol damaged two Russian ships and wounded 24 people. Later that same month, a missile strike blasted the Crimean headquarters of Russia’s navy in Sevastopol.\nCommenting on Saturday's strike, head of Ukraine's presidential office Andriy Yermak said in a Telegram post on Sunday morning that “life constantly proves that there won't be (Russia's) Black Sea fleet in Crimea.”", "source_domain": "www.independent.co.uk", "text": null, "title": "A Ukrainian missile strike on a shipyard in Crimea damages a Russian ship", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/crimea-ap-vladimir-putin-telegram-b2441871.html"}