{"authors": [], "date_download": "2024-02-05 15:44:59", "date_modify": "None", "date_publish": "2023-11-05 04:45:16", "description": "Israeli airstrikes have hit a refugee camp in the central Gaza Strip, killing at least 33 people, health officials said", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhamas-ap-gaza-strip-antony-blinken-joe-biden-b2441845.html.json", "image_url": "https://static.independent.co.uk/2023/11/05/04/Israel_Palestinians_10956.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsraeli airstrikes hit a refugee camp in the central Gaza Strip early Sunday, killing at least 33 people, health officials said. The strikes came a day after the U.S. urged Israel to take a humanitarian pause from its bombardment of Gaza, where Palestinians reported multiple fatalities on Saturday.\nU.S. Secretary of State Antony Blinken made another push Saturday to help civilians and met with Arab foreign ministers in Jordan. That was after his talks in Israel with Prime Minister Benjamin Netanyahu, who insisted there could be no temporary cease-fire until all hostages held by Hamas are released. President Joe Biden suggested Saturday that progress was being made on the humanitarian pause.\nThe Palestinian death toll in the Israel-Hamas war reached 9,448, according to the Hamas-run Health Ministry in Gaza. In the occupied West Bank, more than 140 Palestinians have been killed in violence and Israeli raids.\nMore than 1,400 people in Israel have been killed, most of them in the Oct. 7 Hamas attack that started the fighting, and 242 hostages were taken from Israel into Gaza by the militant group.\nRoughly 1,100 people have left the Gaza Strip through the Rafah crossing since Wednesday under an apparent agreement among the United States, Egypt, Israel and Qatar, which mediates with Hamas.\nCurrently:\n1. Blinken tries to cajole Arab leaders on support for post-conflict Gaza.\n2. Protest marches from U.S. to Berlin call for immediate halt to bombing.\n3. These numbers show the staggering toll of the Israel-Hamas war.\n4. Israel deports thousands of Palestinian workers back to Gaza’s war zone.\n5. A U.N. official says the average Palestinian in Gaza is living on two pieces of bread a day.\n6. Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.\nHere’s what is happening in the latest Israel-Hamas war:\nISRAELI WARPLANES HIT MAGHAZI REFUGEE CAMP, KILLING AT LEAST 33\nKHAN YOUNIS, Gaza Strip — Israeli warplanes struck the Maghazi refugee camp in central Gaza early Sunday, killing at least 33 people, according to health officials.\nAshraf al-Qidra, a spokesman for the Health Ministry in Hamas-run Gaza, said at least 42 people were wounded in the strike. He said first responders, aided by residents, were searching the rubble for dead or possible survivors.\nThe camp is located in the evacuation zone where Israel’s military had urged Palestinian civilians in Gaza to seek refuge as it focuses its military offensive in the northern areas. Despite such appeals, Israel has continued its bombardment across Gaza, saying it is targeting Hamas fighters and assets everywhere in the besieged enclave. It has accused Hamas of using civilians as human shields.\nCritics say Israel’s strikes are often disproportionate, considering the large number of women and children killed in such attacks.\nHUNDREDS OF THOUSANDS OF PROTESTERS MARCH IN INDONESIA\nJAKARTA, Indonesia — Hundreds of thousands of pro-Palestinian protesters marched through the center of Indonesia’s capital on Sunday, calling for an end to Israel’s bombardment of the Gaza Strip.\nThe demonstrators, many wearing scarves with the words “Save Palestine” on them, chanted slogans denouncing Israel’s actions in Gaza as they filled the National Monument park in central Jakarta, waving Indonesian and Palestinian flags.\nIt was the biggest protest yet in the world’s most populous Muslim-majority nation since the Israel-Hamas war began last month.\nSeveral cabinet ministers and politicians, including Foreign Minister Retno Marsudi and House speaker Puan Maharani, attended the protest organized by the Indonesian Ulema Council, the country’s most influential Islamic body.\nIndonesia has long been a strong supporter of Palestinians and has no diplomatic ties with Israel.\nRESCUERS DIG THROUGH DESTROYED HOMES TO FIND AIRSTRIKE SURVIVORS\nGAZA CITY, Gaza Strip — Firefighters sprayed jets of water across twisted metal and jumbled concrete as flames roared from homes destroyed by an Israeli airstrike in the Jabaliya refugee camp.\nThe escalating bombardment comes as Israel’s military said it had encircled Gaza City, the initial target of its offensive to crush Hamas.\nIt wasn’t immediately clear how many people were killed or wounded in the strike late Saturday in the northern Gaza Strip. Rescuers shouted to each other as they tried to pull people from the wreckage.\nAssociated Press video showed a man, barefoot and with blood soaking through his clothes, being carried on a stretcher through the concrete skeleton of a damaged building.\n“Careful, careful!” someone called out as they staggered across the rubble. Others used a bed sheet to haul a dead body from the scene. Inside a bouncing ambulance driving away, a rescuer wearing black latex gloves patted the head of a young boy cradled in his lap. A man screamed off-camera.\nPRESIDENT BIDEN HINTS AT PROGRESS ON PERSUADING ISRAEL TO PAUSE ATTACKS\nREHOBOTH BEACH, Del. — President Joe Biden suggested Saturday there have been some advances in U.S. attempts to persuade Israel to pause military strikes on Gaza for humanitarian reasons.\nIn a brief exchange with reporters as he left St. Edmond Roman Catholic Church in Rehoboth Beach, Delaware, Biden was asked if there was progress, and he responded, “Yes,” but did not share specifics.\nThis comes after U.S. Secretary of State Antony Blinken met with his Arab counterparts Saturday. He disagreed with them on the need for an immediate cease-fire and made clear the furthest he would go was backing a pause for aid to reach civilians in Gaza. Blinken said a cease-fire would leave Hamas in place.\nFAMILIES AND SUPPORTERS OF HOSTAGES IN GAZA CALL FOR THEIR RELEASE ‘NOW’\nTEL AVIV, Israel — Thousands of people have joined a demonstration in Tel Aviv organized by families of some 240 hostages being held in the Gaza Strip.\n“Now!” the crowd chanted repeatedly, calling for hostages to be freed without delay after nearly a month in captivity. Many held pictures of the hostages, who include children and older people.\nHadas Kalderon of Kibbutz Nir Oz whose two children were kidnapped, ages 16 and 12, called for a cease-fire in exchange for the return of the hostages.\nHamas militants abducted the hostages in an Oct. 7 cross-border raid that triggered the latest Israel-Hamas war. The plight of the hostages and their families has captured the nation’s attention.\nElla Ben-Ami, a 23-year-old Israeli whose parents were abducted, said she held Prime Minister Benjamin Netanyahu responsible.\nShe called for a halt in all humanitarian aid to Gaza until the hostages are freed.\nTHOUSANDS IN WASHINGTON PROTEST BIDEN ADMINISTRATION’S SUPPORT OF ISRAEL\nWASHINGTON — Thousands of mostly young people filled the streets of downtown Washington D.C. on Saturday afternoon to protest the Biden administration’s support of Israel and its continued military campaign in Gaza.\n“From the river to the sea, Palestine will be free,” chanted demonstrators. They wore black and white keffiyehs as an enormous Palestinian flag was unfurled by a crowd that filled Pennsylvania Avenue, the street leading up to the White House.\nDozens of small white body bags with the names of children killed lined the street and demonstrators held signs calling for an immediate cease-fire.\nCARRIER GROUP ARRIVES IN THE MIDDLE EAST BOOSTING US MILITARY PRESENCE\nBEIRUT — The U.S. Central Command says the Dwight D. Eisenhower Carrier Strike Group arrived in the Middle East and the CENTCOM area of responsibility as part of the increase in regional posture.\nThe Eisenhower sailed into the Mediterranean last Saturday as the American forces expand their presence in the Middle East to deter Iran and its proxy militant groups from trying to widen the Israel-Hamas war.\nThe USS Dwight D. Eisenhower aircraft carrier and its strike group had moved through the Strait of Gibraltar earlier this week, putting two American carriers in the Mediterranean Sea, a rare sight in recent years.\nThe USS Gerald R. Ford Carrier Strike Group is already in the eastern Mediterranean, part of a buildup of forces as the U.S. supports Israel in its war against Hamas.\nISRAELI PROTESTERS CALL ON NETANYAHU TO RESIGN\nJERUSALEM — Thousands of Israelis are protesting outside Prime Minister Benjamin Netanyahu’s official residence in central Jerusalem, calling on the Israeli leader to resign in the wake of the bloody Oct. 7 Hamas rampage that sparked the latest Israel-Hamas war.\nNetanyahu has so far refused to take responsibility for the Oct. 7 attack, in which several thousand Hamas militants burst into Israel and killed over 1,400 people and took some 240 hostages back to Gaza. He says officials, including himself, will have to give answers to the public, but only after the war.\nIsrael has carried out weeks of airstrikes and launched a ground offensive in Gaza, with Palestinian health officials saying over 9,000 people were killed in the fighting.\nDuring Saturday night’s protest, demonstrators called on Netanyahu to step down and called for the return of the hostages. They also held a moment of silence for victims of the attack and those in captivity.\n“Where were you in Kfar Azza,” chanted the protesters, referring to one of the Israeli border communities that was overrun by Hamas.\n“I came here to rescue the country,” said Nava Hefetz, a rabbi and human rights activist, who attended the protest.\nBLINKEN SAYS A CEASE-FIRE WOULD BENEFIT HAMAS\nAMMAN, Jordan — U.S. Secretary of State Antony Blinken and his counterparts from Egypt and Jordan agreed on the need to do more to protect Palestinian civilians in Gaza, but a clear point of division emerged on the question of a possible cease-fire.\nThough the Jordanian and Egyptian foreign ministers urged an immediate cease-fire between Israel and Hamas, Blinken took the position that that would be counterproductive and made clear the furthest he would go was supporting a humanitarian pause to give time for humanitarian supplies to be delivered and getting civilians out of Gaza.\n“It is our view now that a cease-fire would simply leave Hamas in place, able to regroup and repeat what it did on Oct. 7,” Blinken said at the news conference after the talks, referring to Hamas' attack on southern Israel that triggered the latest Gaza war.\nGERMANY'S VICE CHANCELLOR CALLS FOR DESTRUCTION OF HAMAS\nBERLIN — German Vice Chancellor Robert Habeck said in a video speech Saturday to members of his party, The Greens, that “basically, Hamas must be destroyed because it is destroying the process of peace in the Middle East.”\nHabeck added, according to German news agency dpa, that Hamas’ Oct. 7 attack \"requires a necessary consequence from Israel.”\nThe vice chancellor said that “the Palestinians also have the right to their own state,” but added that Hamas has no interest in such a solution.\nGermany has been one of Israel’s staunchest supporters in its war with Hamas.\nJORDAN SAYS ARAB COUNTRIES DEMAND AN IMMEDIATE CEASE-FIRE\nAMMAN, Jordan — Jordanian Foreign Minister Ayman Safadi told reporters Saturday that though he condemned the Hamas attacks of Oct. 7 and that though “nobody in their right mind” would “belittle” the pain felt by Israel that day, the war in Gaza could not be permitted to continue.\n“The whole region is sinking in a sea of hatred that will define generations to come,” Safadi said after a meeting with U.S. Secretary of State Antony Blinken and Egyptian Foreign Minister Sameh Shoukry.\nHe said the Arab countries were demanding an immediate cease-fire, a more dramatic action than the humanitarian pauses supported by the Biden administration to allow for the delivery of food and other supplies and to enable time to secure the release of hostages.\n“We don’t accept that this is self-defense,” Safadi said, adding, “It cannot be justified under any pretext and it will not bring Israel security, it will not bring the region peace.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Israeli warplanes hit refugee camp in Gaza Strip, killing at least 33 people", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hamas-ap-gaza-strip-antony-blinken-joe-biden-b2441845.html"}