{
    "authors": [
        "Yelena Mandenberg",
        "Image",
        "Getty Images",
        "U S Army Reserve Command Upi Rex Shutterstock",
        "Afp Via Getty Images"
    ],
    "date_download": "2024-02-05 15:14:38",
    "date_modify": "None",
    "date_publish": "2024-01-30 16:13:23",
    "description": "President Joe Biden prompted some outrage from Americans today after the White House announced no plans to attend the funeral ceremonies for the three troops killed in Jordan",
    "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbiden-doesnt-plan-attend-ceremony-32003917.json",
    "image_url": "https://i2-prod.mirror.co.uk/incoming/article32004258.ece/ALTERNATES/s1200/1_US-ARMY-MAIN.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Joe Biden prompted some outrage from Americans today after the White House announced no plans to attend the funeral ceremonies for the three troops killed in Jordan\nAmid vows of retaliation over a drone strike that killed three in Jordan, Americans are furious to find out that President Joe Biden has no plans to attend the soldiers' ceremonies - with the president announcing hours later that he will attend after all.\nSgt. William Rivers, 46, Spc. Brianna Moffatt, 23, and Spc. Kennedy Ladon Sanders, 24, all from Georgia, were killed when U.S. forces \"may have mistaken\" an enemy drone for an American one and let it pass unchallenged into a desert base in Jordan on Sunday.\nThe drone killed three U.S. troops and wounded dozens more. The bodies of the troops that were killed are expected to be flown back to Dover Air Force Base in a ceremonious transfer.\nREAD MORE: Jordan attack mapped as Iran drones kill 3 US troops amid World War 3 fears\nImage: Getty Images) Getty Images)\nWhen asked by journalists if President Biden planned to attend the ceremony, National Security Council spokesman John Kirby the president didn't \"have anything on schedule to speak to.\"\nMany took to the internet to voice their displeasure, finding the response \"disgraceful.\"\n\"Joe Biden just got three black members of the military killed,” wrote \"free speech\" advocate Phillip Anderson on X, who is an activist online that considers themselves a \"January 6th survivor,\" who \"stopped the Portland riots and had his \"teeth knocked out protesting Big Tech censorship.\"\nImage: u s Army Reserve Command/UPI/REX/Shutterstock) u s Army Reserve Command/UPI/REX/Shutterstock)\n\"Their black lives mattered so much to Joe Biden that he won’t even bother to show up to receive their bodies, from what I’m hearing,\" says the activist. His conservative posts have gotten him kicked off Facebook, Twitter, and YouTube.\nJon Sweet, a former military intelligence officer, also added to the chatter, noting that this was \"not a good look for the president.\"\nImage: AFP via Getty Images) AFP via Getty Images)\nBiden blamed Iran-backed militias for the first U.S. fatalities after months of strikes by such groups against American forces across the Middle East since the start of the Israel-Hamas war.\nBiden, who was traveling in South Carolina, asked for a moment of silence during an appearance at a Baptist church’s banquet hall.\nImage: u s Army Reserve Command/UPI/REX/Shutterstock) u s Army Reserve Command/UPI/REX/Shutterstock) Image: u s Army Reserve Command/UPI/REX/Shutterstock) u s Army Reserve Command/UPI/REX/Shutterstock)\n“We had a tough day last night in the Middle East. We lost three brave souls in an attack on one of our bases,” he said. After the moment of silence, Biden added, “and we shall respond.”\nBiden said in a written statement that the United States \"will hold all those responsible to account at a time and in a manner (of) our choosing.\"\nDefense Secretary Lloyd Austin added that, \"we will take all necessary actions to defend the United States, our troops, and our interests.\"\nIran-backed fighters in east Syria began evacuating their posts, fearing U.S. airstrikes, according to Omar Abu Layla, a Europe-based activist who heads the Deir Ezzor 24 media outlet. He said that the areas are the strongholds of Mayadeen and Boukamal.\nU.S. Central Command said at least 34 troops were injured by the one-way attack drone, with eight flown out of Jordan for follow-up care. It described the eight as being in stable condition.",
    "source_domain": "www.mirror.co.uk",
    "text": null,
    "title": "Biden to attend ceremony of 3 soldiers killed in Iran drone strike, after sparking anger",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.mirror.co.uk/news/us-news/biden-doesnt-plan-attend-ceremony-32003917"
}