{"authors": ["Aseel Mousa", "Emma Graham-Harrison"], "date_download": "2024-02-05 15:16:43", "date_modify": "None", "date_publish": "2024-01-21 13:00:27", "description": "Human rights worker Ayman Lubbad is among the Palestinian prisoners claiming abuse in Israeli custody, where six have died", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F21%2Fgaza-activist-tells-of-beating-and-abuse-in-israeli-detention.json", "image_url": "https://i.guim.co.uk/img/media/b264024302ecb1eae012e5f8924b35cc82865443/0_0_2559_1536/master/2559.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a98f7bae6598282194a79b4914caba76", "language": "en", "localpath": null, "maintext": "The Gaza-based human rights activist Ayman Lubbad has not seen his wife and three children for more than a month, since he was ordered to strip to his underwear in the street outside his home, then driven away with other Palestinian men for a week of abuse and detention.\nHe was tortured and humiliated, he said, giving one of various accounts of recent Israeli abuse of Palestinians in detention; at least six have died, and one autopsy report showed serious injuries, Haaretz newspaper reported.\nHundreds of Gaza residents detained in Israel’s military campaign have faced torture methods including electric shocks, cigarette and lighter burns, stress positions and deprivation of sleep, food and toilet facilities, investigations by Reuters and +972 magazine found.\nThe Israel Defense Forces have said all allegations of improper conduct in detention facilities are thoroughly investigated, and that suspects strip-searched for security reasons during arrest should be allowed to dress again before being taken into custody.\nWhen Lubbad was released without charge, it was in Rafah, at the southern end of the Gaza Strip, while his family are still at their home in northern Beit Lahia.\nThe Israeli military separate them, Palestinians are not allowed to move north through the strip and his family don’t want to risk the dangerous journey south through an active war zone, he told the Guardian in an interview.\nThey were separated on 7 December, when an Israeli military announcement made over a loudspeaker ordered everyone in the area to evacuate their homes. Women and elderly people were sent to the nearby Kamal Adwan hospital. Men were ordered to undress to their underwear in the street.\nPhotos of dozens of the nearly naked men kneeling in the cold and mud of a ruined street on a December morning prompted outrage around the world. The US said the photos were “deeply disturbing”, and the International Committee of the Red Cross said detainees must be treated with humanity and dignity.\nLubbad, who works at the Palestinian Centre for Human Rights, recognised himself in some of the photos. Other civilian detainees identified by friends, family and employers included a young teenager, a man in his 70s and a well-known journalist.\nAs the men waited some soldiers opened fire, injuring a young man’s hand, while others humiliated their captives and destroyed homes, Lubbad said.\n“The Israeli soldiers photographed us inappropriately and compelled some of the detained boys to dance. They set fire to the homes of the Muqayd, Mahdi, Kahlot and Sorour families in front of us while we were seated in the street,” he said in a statement about his captivity.\nTwo hours later Lubbad was taken just north of Gaza to the beach near Zikim kibbutz, then transported “handcuffed and blindfolded” to an army camp that Israeli soldiers told prisoners was in Ofakim, a city farther inland.\nThere the Gaza residents were herded into shelters surrounded by barbed wire, between 500 and 700 men overlooked by two elevated guard posts for Israeli soldiers. The men had to kneel, their eyes covered, from 5am until midnight.\n“Any attempt to change your position or remove the blindfold resulted in punishment, including standing with hands raised above the head for about three hours and beatings,” Lubbad said.\nThere were interrogations with an investigator who mocked his work, saying: “I’ll teach you your rights well in prison.”\nFive days after he was ordered from his home, he was transferred again. He said he was beaten in the ribs during the move, and was in such severe pain that he was unable to sleep for two nights.\nOther prisoners told him the new facility was in Jabal Mukaber neighbourhood in Jerusalem. He was taken at midday on his first day there for a 10-hour interrogation. The man started the interview by telling Lubbad that he was mentally ill and not taking medication.\nHe demanded information about Hamas and Islamic Jihad, and when Lubbad said he was a civilian activist who didn’t know about the armed groups, the man grew increasingly angry and said Gaza residents would be treated like dogs.\n“The investigator threatened me and cursed me with obscene words while hitting me in the face. He placed a blindfold over my eyes and went to drink tea or have lunch,” Lubbad said.\n“On his return, he would ask me the same questions about Hamas and I would answer that I did not know any details and that my social relationships were very limited.”\nTowards the end of the interview, he was blindfolded and taken to sit outside in the freezing night, where he could hear others being beaten. He was then attacked himself, he said. “After I could not bear the extreme cold, some soldiers came and beat me and told me ‘every dog has its day’,” which he took as a death threat.\nAsked about Lubbad’s claims, an IDF spokesperson said “any allegations of improper conduct in the [detention] facility are thoroughly investigated” and that Israeli law and military regulations “do not permit taking the punitive actions described”.\nThe detention centre mostly held hundreds of Gaza residents who had been working in Israel when Hamas attacked on 7 October. Late on Wednesday night there was a roll call, and soldiers appeared with handcuffs and boxes holding the prisoners’ possessions.\n“Civilian buses appeared, so we knew that they would release us,” he said. The men were handcuffed together for the drive, and reached the Kerem Shalom crossing around midnight, when they were told to cross back into Gaza on foot.\n“I had nothing in my possession except my ID card,” Lubbad said. He contacted his wife and children to tell them he had been released and was back in Gaza, and went to look for somewhere to shelter in Rafah.\nThe intensity of the war in Gaza left little time even for relief that he had survived detention. It was soon overshadowed by a new tragedy. An hour after he crossed back into Gaza, an Israeli airstrike killed his brother.", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza activist tells of beating and abuse in Israeli detention", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/21/gaza-activist-tells-of-beating-and-abuse-in-israeli-detention"}