{"authors": ["Summer Goodkind"], "date_download": "2024-02-05 15:45:02", "date_modify": "None", "date_publish": "2023-11-05 11:21:01", "description": "Speaking in a radio interview, Israel's Heritage Minister Amichay Eliyahu said he was not entirely satisfied with the scale of Israel's retaliation since the October 7 massacre.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12712331%2FBenjamin-Netanyahu-suspends-Israeli-right-wing-minister-suggested-dropping-nuclear-bomb-Gaza-astonishing-remark-radio-interview-government-meetings-notice.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/05/11/77421833-0-image-m-41_1699183212282.jpg", "language": "en", "localpath": null, "maintext": "Benjamin Netanyahu has suspended an Israeli right-wing minister until 'further notice' after he suggested that dropping a nuclear bomb on Gaza was 'an option'.\nSpeaking in a radio interview, Israel's Jerusalem Affairs and Heritage Minister Amichay Eliyahu, an ultranationalist politician part of Netnayahu's ruling coalition, said he was not entirely satisfied with the scale of Israel's retaliation since the October 7 massacre.\nThe attacks killed 1,400 people, mostly civilians, Israeli officials say, with more than 240 Israeli and foreign hostages taken hostage by Hamas.\nThe far-right minister told Israel's Kol Barama radio that 'there are no non-combatants in Gaza,' adding that providing humanitarian aid to the Strip would constitute 'a failure.'\nWhen asked if - since there are no non-combatants in his view – a nuclear attack to 'kill everyone' on the Gaza Strip is an option, Eliyahu replied: 'That's one way'.\nPrime Minister Benjamin Netanyahu's office quickly responded to the minister's remarks, issuing a statement in which it described them as 'disconnected from reality,' adding that Israel and the IDF are acting in accordance with international law in order to avoid harm to non-combatants.\nBenjamin Netanyahu has suspended an Israeli right-wing minister until 'further notice' after he suggested that dropping a nuclear bomb on Gaza was 'an option'\nSpeaking in a radio interview, Israel's Jerusalem Affairs and Heritage Minister Amichay Eliyahu said he was not entirely satisfied with the scale of Israel's retaliation since the October 7 massacre\nPrime Minister Benjamin Netanyahu's office quickly responded to the minister's remarks\nIn a follow-up question about the estimated 240 hostages held in Gaza, Eliyahu said that 'in war we pay a price.'\n'Why are the lives of the hostages... more important than the lives of the soldiers?' he said.\nFollowing the outcry over his remarks, Eliyahu said in a post on X, formerly Twitter, that his statement about the atomic bomb was 'metaphorical'.\nHe also said that Israel was 'committed to doing everything possible to return the hostages safe and sound'.\nFollowing the outcry over his remarks Eliyahu later said in a post on X that his statement about the atomic bomb was 'metaphorical'.\nLater on Sunday morning, Netanyahu's office announced that Eliyahu had been suspended from government meetings until further notice.\nOpposition leader Yair Lapid called for the minister's removal.\n'The presence of radicals in the government endangers us and the goals of the war - defeating Hamas and returning all the hostages,' Lapid wrote on X, adding that Netanyahu 'must fire [Eliyahu] this morning.'\nNational Security Minister Itamar Ben-Gvir, the leader of the Otzma Yehudit party that Eliyahu belongs to, said he spoke to the minister who in turn clarified that he was speaking 'metaphorically.'\nIsraeli Defense Minister Yoav Gallant also took to X, calling Eliyahu's statements 'baseless,' adding that it's 'good that these aren't the people in charge of Israel's security.'\nThe Hostages and Missing Persons Families Forum, representing relatives of people snatched to Gaza by Hamas militants, slammed Eliyahu's 'reckless and cruel' statement.\n'International law, along with fundamental principles of human morality and common sense, strictly prohibits the use of mass destruction weapons,' it said in a statement, calling for the release of all the hostages.\nIsrael has never admitted to having a nuclear bomb.\nNetanyahu has faced tensions in his government after an extraordinary row erupted in his war cabinet after the PM appeared to blame security and intelligence officials for failing to detect signs that Hamas's devastating invasion was imminent.\nNetanyahu, who has faced anger from opposition and Israeli border communities over security lapses before the October 7 Hamas attack, made the accusations in a post which he later deleted and replaced with an apology.\nIt exposed apparent infighting in Israel's emergency government after what was meant to be a show of unity between Netanyahu, Defence Minister Gallant and Knesset member Benny Gantz.\nThe war cabinet members released a joint statement announcing the expansion of ground operations in Gaza and said that the country is 'more united than ever' last night, but Netanyahu's comments shortly after drew widespread backlash.\n'Never, under any circumstance, was prime minister Netanyahu alerted to Hamas' intent to launch a war,' his now-deleted post on the premier's account read.\n'On the contrary, all security officials, including the head of military intelligence and the head of Shin Bet (Israel's internal security agency), believed Hamas was deterred.\nIsrael continued its brutal attack on Hamas overnight, with IDF jets striking a 'terror base'\nPeople search through buildings that were destroyed during Israeli air raids in the southern Gaza Strip on November 5, 2023 in Khan Yunis, Gaza\n'This was the evaluation that was submitted time and again to the prime minister and the (security) cabinet by all security officials and the intelligence community, right until the war broke out.'\nThe post was published on X hours after Netanyahu gave a press conference late on Saturday, in which he was asked if he had been warned about the danger of an attack.\nIt was deleted on Sunday morning and replaced a few minutes later.\n'I was wrong,' he declared in the new post.\n'Things I said following the press conference shouldn't have been said, and I apologise for that.\n'I fully back all the heads of the security establishment. I back the military chief of staff, and the commanders and soldiers of the IDF (Israel Defense Forces) who are on the front and fighting for our home. Together we will win,' he wrote.\nMeanwhile, after 30 days of war, Israel continued its brutal attack on Hamas overnight, with IDF jets striking a 'terror base', troops fighting militants at 'close quarters' and dismantling part of the group's tunnel network in northern Gaza.\nNearly a month after the worst attack in the country's history, Israel, who sent troops into the narrow Palestinian territory last month, has managed to strike 'over 2,500 terror targets' by 'ground air and naval forces', the army said on Sunday.\nIn a statement, it said ground soldiers were engaged in 'close-quarters combat' as Israeli jets were striking targets including a 'Hamas military compound' at an undisclosed location overnight.\nThese dramatic clips graphically reveal the intensity of the battle now raging between the Israelis and Hamas in war-torn Gaza\nOne video from inside one of the 63-tonne APCs shows the sweat glistening on one of the crewmen's face as the gunfire outside can clearly be heard\nPalestinians search for casualties at the Magazi Refugee Camp in central Gaza\nVideo shared to the IDF's social media also revealed them uncovering one of the terror groups hidden tunnels, long been viewed as a major security challenge, used in the past for smuggling and incursions into Israel, as well as a serious obstacle for Israeli forces attempting to operate in Gaza.\n'While Hamas obstructs their civilians from getting to safety in southern Gaza, Hamas hides within their intricate network of terror tunnels.\n'IDF troops uncovered multiple access points during operational activity in Northern Gaza', they posted to X in the early hours of Sunday.\nMore than 240 Israeli and foreign hostages were abducted by Hamas during the October 7 attack, officials say, and Israeli Prime Minister Benjamin Netanyahu rebuffed proposals of a truce until the Islamist group releases them all.\nIsrael on Thursday said it had struck 12,000 targets across Gaza during the war, one of the fiercest bombing campaigns in recent memory.\nThe health ministry in Gaza, which is run by Hamas, says more than 9,480 Gazans, mostly women and children, have been killed in Israeli strikes and the intensifying ground campaign.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Benjamin Netanyahu suspends Israeli right-wing minister who suggested dropping a nuclear bomb on Gaza in astonishing remark during radio interview", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12712331/Benjamin-Netanyahu-suspends-Israeli-right-wing-minister-suggested-dropping-nuclear-bomb-Gaza-astonishing-remark-radio-interview-government-meetings-notice.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}