{"authors": ["Adam Fulton", "Maya Yang", "Tom Ambrose"], "date_download": "2024-02-05 15:45:06", "date_modify": "None", "date_publish": "2023-11-05 06:03:50", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F04%2Fisrael-hamas-war-live-blinken-set-to-meet-with-middle-east-foreign-ministers-in-jordan-airstrike-on-gaza-ambulance-kills-15.json", "image_url": "https://i.guim.co.uk/img/media/9e8601b29c5e2246e0d867cd498782e838c01a8f/0_263_4662_2797/master/4662.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=a7e75b742e2eed9dbe4013c290514664", "language": "en", "localpath": null, "maintext": "5 Nov 2023 07.03 CET Closing summary This is where we’ll close this blog – we’re continuing over rolling live coverage of the Israel-Hamas war in a new blog here. Thank you for reading. Here’s a rundown on where things stand as it just passes 8am in Gaza City and Tel Aviv. The Hamas-run health ministry in Gaza says more than 30 people were killed in an Israeli bombing of the Maghazi refugee camp in central Gaza late on Saturday. Hamas said in a statement on Telegram that Israel had “directly” bombed citizens’ homes, adding that most of the dead were women and children. The Palestinian news agency Wafa earlier put the death toll at 51, with scores wounded.\nUS president Joe Biden signalled there were small signs of progress being made towards a humanitarian pause in the war between Israel and Hamas on Saturday. US officials have been pushing for a pause but so far with little impact.\nThe Palestine Red Crescent Society received 30 aid trucks that entered Gaza through the Rafah border crossing on Saturday. Three were handed to the Red Cross and 19 to UNRWA, the UN agency for Palestinian refugees. Eight trucks from the Egyptian Red Crescent were delivered to the Palestine Red Crescent.\nGaza’s Hamas-run government suspended the evacuation of foreign passport holders to Egyp t on Saturday after Israel refused to allow some wounded Palestinians to be evacuated to Egyptian hospitals, a border official said.\nIsraeli military clashes with Palestinians were reported across the occupied West Bank overnight on Saturday, including in Jenin, Nablus and Tulkarm.\nHamas’s armed wing said more than 60 hostages were missing due to Israeli airstrikes in Gaza. Abu Ubaida, the spokesperson for the Izz el-Deen al-Qassam brigades, also said on Hamas’s Telegram account that 23 bodies of Israeli hostages were trapped under the rubble. Reuters could not immediately verify the statement.\nProtesters gathered outside the residence of Israeli prime minister Benjamin Netanyahu amid growing anger at the government’s failures that led to Hamas’s deadly attacks against Israel on 7 October. Protesters also gathered in Tel Aviv, with many holding signs that said “Ceasefire” and others that read “Release the hostages now at all costs”.\nAgence France-Presse has called on Israel ot provide “an in-depth and transparent investigation” into the exact involvement of its army after a strike severely damaged its office in Gaza City , which has been shelled for weeks. “A strike on the offices of an international news agency sends a deeply troubling message to all the journalists working in such difficult conditions in Gaza,” the news agency’s chairman and CEO Fabrice Fries said.\nUS secretary of state Antony Blinken has reaffirmed US support for “humanitarian pauses” in the ongoing fight between Israel and Hamas. In an address in Amman, Jordan, about sparing civilians and speeding up aid deliveries entering into Gaza, Blinken said: “The United States believes that all of these efforts will be facilitated by humanitarian pauses.”\nFour police officers were injured and 29 people were arrested after thousands of pro-Palestinian protesters gathered in London’s Trafalgar Square demanding a ceasefire in the Israel-Hamas war. They were arrested for inciting racial hatred, other racially motivated crimes, violence and assaulting a police officer, the Metropolitan Police said. It was the fourth consecutive week of London demonstrations in support of Palestinians.\nTurkey has announced it is recalling its ambassador to Israel and cutting contact with Netanyahu. Israeli foreign ministry spokesperson Lior Haiat called Saturday’s move “another step by the Turkish president that sides with the Hamas terrorist organisation.”\nIsrael will locate and kill Hamas’s Gaza chief, Yahya Sinwar, Israeli defense minister Yoav Gallant said. “We will find Sinwar and will eliminate him,” Gallant said on Saturday as Israeli forces fought street battles with Hamas in the Palestinian territory.\nThousands of people filled the streets of downtown Washington DC on Saturday to protest against the Biden administration’s support of Israel and its continued military campaign in Gaza. The demonstrators wore black and white keffiyehs as an enormous Palestinian flag was unfurled by a crowd that filled Pennsylvania Avenue, the street leading up to the White House.\nUpdated at 09.22 CET\n5 Nov 2023 06.29 CET The United States and its Arab allies appeared divided over calls for a ceasefire in Israel’s military offensive against Hamas as the US pushed for a more temporary pause in fighting amid growing global anger over the rising death toll among Palestinian civilians in the Gaza Strip. On Saturday, several Middle East foreign ministers urged the US to persuade Israel to agree to a ceasefire in a meeting with the secretary of state, Antony Blinken. The top US diplomat, however, dismissed the idea, saying such a halt would only benefit Hamas, allowing the militant organisation to regroup and attack again. The diplomatic wrangling came as the conflict entered its fifth week, with reports that more than 30 people were killed in a strike on a refugee camp in central Gaza. You can read our fresh wrap of all the major developments here: Pressure grows for Gaza ceasefire as Israel-Hamas conflict enters fifth week Read more\n5 Nov 2023 05.58 CET Sirens that sounded in northern Israel early on Sunday were determined to be a false alarm, the Israel Defence Forces said a short while ago on X (formerly Twitter). The Jerusalem Post had tweeted earlier that “rocket sirens sounded in Misgav Am, near the Lebanese-Israeli border, on Sunday morning”. The sirens came amid ongoing skirmishes between Israeli troops and Hezbollah militants across the frontier.\n5 Nov 2023 05.18 CET Thousands of people filled the streets of downtown Washington DC on Saturday afternoon to protest against the Biden administration’s support of Israel and its continued military campaign in Gaza, Associated Press reports. “From the river to the sea, Palestine will be free,” chanted demonstrators, who were mainly young people. There is controversy around the slogan’s meaning, with some saying it advocates the destruction of Israel. The demonstrators wore black and white keffiyehs as an enormous Palestinian flag was unfurled by a crowd that filled Pennsylvania Avenue, the street leading up to the White House. Dozens of small white body bags with the names of children killed lined the street and demonstrators held signs calling for an immediate ceasefire. View image in fullscreen Demonstrators in Freedom Plaza, with the US Capitol in the distance, during the pro-Palestinian rally in Washington DC. Photograph: Stefani Reynolds/AFP/Getty Images\n5 Nov 2023 05.02 CET Overnight clashes reported across West Bank Israeli forces clashed with Palestinians across the occupied West Bank on Saturday night and Sunday morning, the Jerusalem Post is reporting, citing Palestinian reports. The Post said Jenin, Nablus and Tulkarm were among the locations of the fighting. In Nablus, three Palestinians were injured during an Israeli raid, the report said. In Jenin, one Palestinian was injured, while at least one other was arrested during a raid.\nUpdated at 05.29 CET\n5 Nov 2023 04.51 CET Harriet Sherwood The “day after” the war between Israel and Hamas in Gaza may still be weeks or months away, but it will come. “When this crisis is over, there has to be a vision of what comes next,” US president Joe Biden said recently. “And in our view, it has to be a two-state solution.” Against a backdrop of repeated cycles of violence and a military occupation lasting more than half a century, diplomats and analysts agree that lasting peace must follow the bloodiest fighting between Israelis and Palestinians for decades. The two-state solution to the bitter conflict that has beset the region for almost a century – dividing the land between the Jordan River and the Mediterranean to carve out two independent, sovereign Israeli and Palestinian states existing side by side – has repeatedly been endorsed by world leaders. But it has proved impossible for Israel and the Palestinians to reach an agreement. And, since US-brokered talks collapsed in 2014, and as Jewish settlements in the West Bank and East Jerusalem have proliferated, the consensus has been that the two-state solution is dead. Can it be revived? And – given the continuing war, regional tensions and settlers’ presence in what would be a Palestinian state – what might a two-state solution look like? See here for the full story: Israel-Palestine: Is the two-state solution the answer to the crisis? Read more View image in fullscreen A Palestinian man carries his child along a road ripped up by an Israeli bulldozer during a military operation in the West Bank last week. Photograph: Aris Messinis/AFP/Getty Images\nUpdated at 05.20 CET\n5 Nov 2023 04.38 CET The Canadian prime minister, Justin Trudeau, has expressed Canada’s support for Israel and its right to defend itself while reaffirming “the importance of upholding international humanitarian law and making every effort to protect Palestinian civilians”, Trudeau’s office has said. In its statement on a conversation between the two leaders on Saturday, Trudeau’s office said he “highlighted his deep concerns with the dire humanitarian crisis, and reiterated Canada’s position on the immediate need to create conditions for urgent and necessary humanitarian aid to flow into Gaza”. Trudeau’s office said the leaders agreed on the need for all hostages held in Gaza to be immediately released, adding: The two leaders also discussed ongoing efforts to get foreign citizens out of Gaza and the prime minister thanked prime minister Netanyahu for Israel’s assurances that Canadians in Gaza will be able to leave in the coming days. Trudeau’s office also said the two leaders “denounced Hamas’ continued terror and discussed the risk of potential escalation in the region” and that Trudeau “underscored Canada’s enduring support for a two-state solution and for the rights of both Israelis and Palestinians to live in peace, dignity and security”. Trudeau also “recognised the disturbing rise of antisemitism around the world, including in Canada, and the impact of the October 7 attack on Canada’s Jewish community”.\n5 Nov 2023 03.59 CET Just to recap: President Joe Biden suggested there have been some advances in US attempts to persuade Israel to pause military strikes on Gaza for humanitarian reasons. In a brief exchange with reporters as he left a church in Delaware on Saturday, Biden was asked if there was progress and he responded “Yes” and gave a thumbs-up, but did not share specifics. Associated Press also reported that the comment came after US secretary of state Antony Blinken met with his Arab counterparts on Saturday. He disagreed with them on the need for an immediate ceasefire, saying that would leave Hamas in place, and made clear the furthest he would go was backing a pause for aid to reach civilians in Gaza.\nUpdated at 04.03 CET\n5 Nov 2023 03.26 CET The Israel Defence Forces has posted a video on social media of apparent Hamas tunnels in northern Gaza, saying Israel troops had uncovered “multiple access points” to them. The IDF’s post on X (formerly Twitter) says: While Hamas obstructs their civilians from getting to safety in southern Gaza, Hamas hides within their intricate network of terror tunnels. IDF troops uncovered multiple access points during operational activity in Northern Gaza. While Hamas obstructs their civilians from getting to safety in southern Gaza, Hamas hides within their intricate network of terror tunnels.\nIDF troops uncovered multiple access points during operational activity in Northern Gaza. pic.twitter.com/vovapYD4Xn — Israel Defense Forces (@IDF) November 5, 2023\n5 Nov 2023 03.10 CET Dozens arrested and police injured at pro-Palestinian rally in Trafalgar Square Four police officers were injured and 29 people were arrested after thousands of pro-Palestinian protesters gathered in London’s Trafalgar Square demanding a ceasefire in the Israel-Hamas war, PA Media reports. They were arrested for inciting racial hatred, other racially motivated crimes, violence and assaulting a police officer, the Metropolitan Police said. Demonstrators climbed on top of the square’s fountains as the mostly peaceful group waved flags and banners on Saturday afternoon. But the force said some demonstrators had launched fireworks into crowds and towards police, leaving four officers injured. There were scuffles with police as the evening went on, and smaller groups of protesters began moving away from the square. More than 1,300 officers were on duty in the area, four of whom were injured, the force said. View image in fullscreen Pro-Palestinian demonstrators at the rally in Trafalgar Square, London. Photograph: Anadolu Agency/Anadolu/Getty Images At least one protester was seen carrying a banner that read “Let’s keep the world clean” with a picture of an Israeli flag being thrown into a bin. A similar banner displayed at a protest in Warsaw was condemned by the Israeli ambassador to Poland as “blatant antisemitism”. Effigies of dead babies were left on the ground in Trafalgar Square, next to pictures of children and candles. The Metropolitan police issued a dispersal order for an area around the square which will remain in force until 1am. An order was also issued giving officers the power to require someone to remove any item being used to conceal their identity, the force said.\n5 Nov 2023 02.53 CET Gaza ministry says more than 30 killed in Israeli bombing of Maghazi refugee camp The Hamas-run health ministry in Gaza says more than 30 people were killed in an Israeli bombing of the Maghazi refugee camp in central Gaza late on Saturday, Agence France-Presse reports. “More than 30 [dead] arrived at al-Aqsa Martyrs Hospital in Deir Al-Balah in the massacre committed by the occupation in al-Maghazi camp in the central Gaza Strip,” a health ministry spokesperson, Ashraf Al-Qudra, said in a statement. The Palestinian news agency Wafa earlier said 51 Palestinians had been killed and scores wounded in the bombardment. Hamas said in a statement posted on Telegram that Israel had “directly” bombed citizens’ homes, adding that most of the dead were women and children. “An Israeli air strike targeted my neighbours’ house in al-Maghazi camp, my house next door partially collapsed,” said Mohammed Alaloul, 37, a journalist working for the Turkish Anadolu Agency. Alaloul told AFP his 13-year-old son, Ahmed, and his four-year-old son, Qais, were killed in the attack, along with his brother. His wife, mother and two other children were injured. An Israeli military spokesperson said it was looking into whether the Israel Defence Forces had been operating in the area at the time of the bombing.\nUpdated at 03.14 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Biden says progress being made towards a ‘pause’ in fighting - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/04/israel-hamas-war-live-blinken-set-to-meet-with-middle-east-foreign-ministers-in-jordan-airstrike-on-gaza-ambulance-kills-15"}