{"authors": ["Mattha Busby"], "date_download": "2024-02-05 15:45:07", "date_modify": "None", "date_publish": "2023-11-04 16:05:10", "description": "Ukraine’s president denies US media report saying Kyiv approached about conditions for peace", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F04%2Frussia-ukraine-war-latest-news-putin-zelenskiy.json", "image_url": "https://i.guim.co.uk/img/media/cedfa77b8ed0ee6baac049849885aa60efacb463/0_293_831_499/master/831.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=8098f8683610c5b4feaa651197f2c87b", "language": "en", "localpath": null, "maintext": "From 4 Nov 2023 14.20 CET Zelenskiy rejects reports that US officials are lobbying for peace Ukraine’s president Volodymyr Zelenskiy has reaffirmed his stance that this is not the time to negotiate with Russia, and he also denied that any western leaders were pressuring him to do so. He told a joint news conference with the European Commission head, Ursula von der Leyen, in Kyiv: Everyone knows my attitude, which coincides with the attitude of Ukrainian society … Today no one is putting pressure [on me to negotiate], not one of the leaders of the EU or the United States. For us now to sit down with Russia and talk and give it something - this will not happen. Zelenskiy also said that Ukraine was committed to pressing on with reforms, including strengthening anti-corruption practices. The EU next week is expected to present a report on Ukraine’s progress in its bid to join the bloc.\nUpdated at 14.25 CET\n4 Nov 2023 16.18 CET We have further comments from President Volodymyr Zelensky at the press conference. “We have difficulties and different opinions, but we have no right to give up. Because what is the alternative? If we give away a third of our country, nothing will end. We know what a frozen conflict is,” Zelensky said, denying that Ukraine was at a “stalemate” in defending itself against Russia. “We need to work more with partners on the supply of air defense, to gain superiority in the sky and enable the armed forces to conduct offensive operations. This is what we need to think about. Not about where we will be tomorrow, but about where we are now.”\nUpdated at 16.21 CET\n4 Nov 2023 16.11 CET Ukrainian presidential aide Ihor Zhovkva has criticised commander-in-chief Valerii Zaluzhnyi’s comments in the Economist, warning against revealing battlefield information. “Because then we make the aggressor’s job easier. I am sure that everything has been very carefully read [in Russia], noted, and conclusions have been drawn,” Zhovkva said on television today, according to the Kyiv Independent. “If we can somehow succeed in this way… maybe this is some smart strategy. But for me, it’s very strange.” Zhovkva claimed that he received a “panicked” phone call from a senior allied official following the publication of the remarks. The official asked if Ukrainian forces were “at a dead end.” In the Economist piece, Zaluzhnyi said that the war was moving towards a “positional” stage characterised by “static and attritional fighting”. He called for Ukraine to be provided greater support to improve its air power, among other things to better equip its military and defend against artillery.\n4 Nov 2023 15.39 CET The European Commission’s president, Ursula von der Leyen, has said that Ukraine has made “excellent progress” towards EU accession, days ahead of a key report on Kyiv’s membership bid. Standing next to President Volodymyr Zelenskiy, she said Ukraine had reached many milestones despite the war with Russia, highlighting Kyiv’s judicial reforms in their joint news conference in Kyiv. I must say you have made excellent progress. I know you are in the process of completing outstanding reforms. If this happens and, I am confident, Ukraine can reach its ambitious goal of moving to the next stage in the accession process. The EU assessment due on Wednesday is expected to say how far Ukraine has advanced in fulfilling various economic, legal, and other criteria to clear the way for accession talks in December. The EU has provided €83bn for Ukraine’s war effort against Russia and plans to send another €3bn by the end of this year, Von der Leyen added. The Ukrainian government has implemented all the steps required to ensure its readiness, Zelenskiy said, vowing to press on with reforms. He stressed efforts to fight corruption, improve transparency, and reduce the influence of oligarchs on the economy. This visit comes at a historical moment ... when we are waiting on a political decision about Ukraine. This decision will have a pivotal impact not only for Ukraine but for entire Europe. Ukraine does not stop in transforming our institutions, reforms will continue. Ukraine’s bid received another boost on Thursday when German foreign minister, Annalena Baerbock, said she was confident the EU would advance Ukraine’s application next month.\nUpdated at 16.01 CET\n4 Nov 2023 15.18 CET Russia has unveiled a sprawling exposition highlighting the nation’s accomplishments, which will run through the months leading to the presidential election in which Vladimir Putin is widely expected to seek a new term. Putin issued a decree in March to hold the exposition and some observers have seen it as aimed at creating an ideological framework for his reelection. News reports had suggested he might use the opening to announce his candidacy for the March election, but his spokesperson later said he would not attend the event. Putin has led Russia as president or prime minister since 2000, and reelection would extend his term until 2030. The event is held at VDNKh, the vast exposition grounds in northern Moscow that was established by Josef Stalin and is renowned for its collection of elaborate Soviet Gothic-style pavilions. The setting plays to many Russians’ nostalgia for the Soviet era and echoes Putin’s drive to restore Russia as a superpower. Thematically, the exposition focuses on Russia as a country of diverse ethnic groups and cultures unified by a sense of national purpose. It includes displays from each of Russia‘s regions, as well as from the Luhansk and Donetsk regions of Ukraine that Russia claims to have annexed, along with an array of presentations on industry, education and technology will be on offer. It also draws on the view of Russia being in a civilizational battle, a concept that has been in forefront of official discourse since Russia sent troops into Ukraine in February 2022. “Any provocations and aggressive actions directed against Russia are doomed to failure. Because we are a single people, bound by a common history, fraternal bonds of friendship and mutual understanding,” Putin said in a message marking the opening of the exposition. View image in fullscreen People walk past the exhibition stand of Crimea region at Russia Expo exhibition, designed to demonstrate Russia's main achievements in culture and technology at the All-Russia Exhibition Centre (VDNKh) in northern Moscow, on 2 November. Photograph: Alexander Nemenov/AFP/Getty Images\n4 Nov 2023 15.05 CET Dear President @ZelenskyyUA, we are impressed by the reforms Ukraine has made in the midst of a war.\nI am confident that you can complete the outstanding reforms very soon.\nIf this happens, Ukraine can reach its ambitious goal. pic.twitter.com/ydD97QAZAf — Ursula von der Leyen (@vonderleyen) November 4, 2023\n4 Nov 2023 14.52 CET Zelenskiy: 'This is not a stalemate' In further comments from the press conference this afternoon, BBC Russia reports the Ukrainian president, Volodymyr Zelenskiy, as saying: Time has passed, people are tired ... But this is not a stalemate. Russia controls the sky. We take care of our military. No one wants to simply abandon them, like Russia abandons its people like meat. How to overcome this? F-16, we have to wait for the guys to learn, when they come back. When there is air defence at the front, the military goes forward and uses equipment. This week, Ukrainian Gen Valerii Zaluzhnyi told the Economist: “Just like in the first world war, we have reached the level of technology that puts us into a stalemate. There will most likely be no deep and beautiful breakthrough.” But Zelensky said that in 2022, it was widely believed that Ukrainian troops were in a stalemate, before they made gains. A few military tricks, and you remember, the Kharkiv region was liberated. We have no right to give up. What’s the alternative? What, we need to give away a third of our state? This will only be the beginning. We know what a frozen conflict is, we have already drawn conclusions for ourselves. We need to work more with air defence partners, unblock the sky, give our fighters the opportunity to carry out offensive actions.\nUpdated at 16.02 CET\n4 Nov 2023 14.42 CET Kremlin spokesperson Dmitry Peskov has again sought to dispel what one Russian state news agency has described as “myths” about Vladimir Putin’s “doubles”. “We have only one Putin,” he said today at a new national exposition. “Now the ‘experts’ are guessing – there are three or four of them and who we now see every day – this morning they laid [flowers] at the [monument] of Minin and Pozharsky – this is the third or fourth “double”, it’s not clear.” Last month, Peskov said in response to a claim that Putin had fallen ill: “This belongs to the category of absurd information hoaxes that a whole series of media discuss with enviable tenacity. This evokes nothing but a smile.” On the double claims, he said in April: “As a matter of fact, he has always been and is mega-active. We can hardly keep up with him – those who work with him. His energy is enviable and one can only wish to be as healthy as he is.” Back in 2020, Putin said he had rejected an offer to use body doubles for personal protection during a conflict with Chechnya. “I refused to have doubles. It was during the most difficult time of the fight against terrorism,” he said.\nUpdated at 14.45 CET\n4 Nov 2023 14.20 CET Zelenskiy rejects reports that US officials are lobbying for peace Ukraine’s president Volodymyr Zelenskiy has reaffirmed his stance that this is not the time to negotiate with Russia, and he also denied that any western leaders were pressuring him to do so. He told a joint news conference with the European Commission head, Ursula von der Leyen, in Kyiv: Everyone knows my attitude, which coincides with the attitude of Ukrainian society … Today no one is putting pressure [on me to negotiate], not one of the leaders of the EU or the United States. For us now to sit down with Russia and talk and give it something - this will not happen. Zelenskiy also said that Ukraine was committed to pressing on with reforms, including strengthening anti-corruption practices. The EU next week is expected to present a report on Ukraine’s progress in its bid to join the bloc.\nUpdated at 14.25 CET\n4 Nov 2023 13.04 CET Ukraine says it has filed criminal charges against Patriarch Kirill, the leader of the Russian Orthodox church, in absentia for “justifying” Russia’s invasion. Moscow’s most influential spiritual leader, a fervent supporter of president Vladimir Putin, has called the war a historic battle against the “forces of evil”. The Security Service of Ukraine said it had “collected evidence” against the head of the Russian Orthodox church, Vladimir Gundyaev, in partnership with the prosecutor general’s office. It said he was “a member of the inner circle of Russia‘s top military and political leadership and ... one of the first to publicly support the full-scale war against Ukraine”. It accused Kirill, as he is better known, of “infringing” on Ukraine’s territorial integrity, justifying armed aggression and planning and preparing an “aggressive war”. It said: “Comprehensive measures are being taken to bring the offender to justice for crimes against our state.” Ukraine, a predominantly Orthodox country, accelerated its drive to cut ties with all Russian-linked Orthodox institutions after the war began. In October, Ukrainian lawmakers voted to ban the Moscow-linked Ukrainian Orthodox church (UOC), accusing its clergy of collaborating with Russia.\nUpdated at 13.08 CET\n4 Nov 2023 12.37 CET Ukraine president Volodymyr Zelenskiy has thanked the US for its latest military aid package, amid concerns that there may now be a time-limit on support. The defence minister Rustem Umerov, meanwhile, urged the US to provide Ukraine with “more ammo for our warriors.” I am grateful to @POTUS Joe Biden, Congress, and the American people for today’s military aid package.\nIt will strengthen our brave warriors and help us protect lives and infrastructure from Russian strikes.\nThe U.S. demonstrates strength in the face of aggression and terror. — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) November 4, 2023 Weekly call with @SecDef.\nGrateful to the US and Secretary Austin for the new military aid package for 🇺🇦.\nDiscussed latest battlefield updates and Future Force preparation status.\nUrged on the current Ukraine’s needs: more ammo for our warriors.\nGrateful for the constant… pic.twitter.com/lDcVsfJElX — Rustem Umerov (@rustem_umerov) November 4, 2023\n4 Nov 2023 12.25 CET The Italian defence minister Guido Crosetto has said the “time not yet ripe” for Ukraine-Russia ceasefire talks. He told the Quotidiano Nazionale newspaper: Support for Kyiv from the west and the EU is unchanged. Ukraine is fighting for the protection of its sovereignty, as well as for the observance of international law. It is obvious that a lasting peace cannot be based on military actions alone. A political ‘ceasefire’ is needed. The time is not yet ripe for that. ⚡️ Italian defense minister: 'Time not yet ripe' for Ukraine-Russia ceasefire talks.\nItaly's Defense Minister Guido Crosetto told the Quotidiano Nazionale newspaper on Nov. 4 that the time has not yet come for Russia-Ukraine ceasefire negotiations on a political level. — The Kyiv Independent (@KyivIndependent) November 4, 2023\nUpdated at 12.31 CET\n4 Nov 2023 12.15 CET The Turkish president, Tayyip Erdoğan, has said he would try to facilitate the parliamentary ratification of Sweden’s Nato membership as far as possible, but added that Stockhom had still not taken sufficient action on Kurdish militants. Long-neutral Sweden and Finland applied to join Nato last year to bolster their security after Russia’s invasion of Ukraine. Finland’s membership was sealed in April, but Sweden’s bid had been held up by Turkey and Hungary. Erdogan submitted a bill approving Sweden’s Nato membership bid to parliament for ratification last month, a move welcomed by the alliance and Stockholm. Turkey had initially raised objections due to what it said was Sweden’s harbouring of groups it deems terrorist. Speaking to reporters on a return flight from Kazakhstan yesterday, Erdoğan said Stockholm had taken some steps regarding protests organised by the outlawed Kurdistan Workers Party (PKK) and also concerning arms embargoes on Turkey, but not on the activities of the PKK in Sweden. “Our duty was to submit this to parliament in the first stage, we did that,” broadcaster Haberturk quoted him today as having told the reporters on his plane. Erdoğan also said planned talks in parliament about Turkey’s 2024 state budget would now take priority, suggesting that the approval of Sweden’s Nato membership might not be rapid. “But we will try to facilitate the work [on ratifying Sweden’s Nato bid] as much as possible. We will try to show positive efforts as much as we can at this point, so long as our counterparts approach us positively.”\nUpdated at 12.19 CET\n4 Nov 2023 11.58 CET Ukraine’s newly appointed head of the defence industry says he is working tirelessly to ramp up local arms production and wants to turn the country into a weapons production hub for the west. Oleksandr Kamysyhin, the minister for strategic industries of Ukraine, said that Russia’s invasion of his country and the Israel-Hamas war in the Middle East have highlighted the need for countries to spend on their defence systems. “We’re really focusing on making Ukraine the arsenal of the free world,” Kamyshin told the Associated Press last night. “We are focused on producing all types of weapons and ammunition, and we show that we can test it on the battlefield and make it better during the war. That’s something we can contribute to the free world, because as you see, defence industry is becoming more and more important globally.” Kamyshyn said approximately 500 companies in Ukraine’s defence industry are contributing to the country’s efforts to increase weapons production in order to counter Russia’s attempts to seize more territory. He was appointed to the post around eight months ago, and is now in charge of 300,000 people employed in Ukraine’s defence industry. He acknowledges that he has had to start scaling the local manufacture of weapons from scratch. Ukraine barely had a local defence industry to speak of before 2022, he said, with the military mainly relying on what it already had and what it received as military aid from allies before the war began with Russia’s invasion in February 2021. Now, Ukraine is delivering locally produced munition to the battlefield and can increasingly strike inside Russia, he said.\n4 Nov 2023 11.45 CET Last year, there were claims that the then British prime minister Boris Johnson had lobbied the Ukrainian president, Vladimir Zelenskiy, against peace. In a statement, Johnson’s office said at the time: The Prime Minister updated on his visit to Kyiv last month and shared his conviction that Ukraine would win, supported with the right level of defensive military assistance. He urged against any negotiations with Russia on terms that gave credence to the Kremlin’s false narrative for the invasion, but stressed that this was a decision for the Ukrainian government. Ukrainska Pravda reported: “According [to] Ukrainska Pravda sources close to Zelenskyy, the Prime Minister of the United Kingdom Boris Johnson, who appeared in the capital almost without warning, brought two simple messages. “The first is that Putin is a war criminal, he should be pressured, not negotiated with. And the second is that even if Ukraine is ready to sign some agreements on guarantees with Putin, they are not.” It came after a former Israeli prime minister rowed back on a suggestion about an alleged agreement to end the war in Ukraine. “It’s unsure there was any deal to be made,” Bennett later said. “At the time I gave it roughly a 50% chance. Americans felt chances were way lower. Hard to tell who was right. It’s not sure such a deal was desirable. At the time I thought so, but only time will tell.” Writing in Foreign Affairs in August 2022, former US national security official Fiona Hill and foreign policy expert Angela Stent said: According to multiple former senior U.S. officials we spoke with, in April 2022, Russian and Ukrainian negotiators appeared to have tentatively agreed on the outlines of a negotiated interim settlement: Russia would withdraw to its position on February 23, when it controlled part of the Donbas region and all of Crimea, and in exchange, Ukraine would promise not to seek NATO membership and instead receive security guarantees from a number of countries. Boris Johnson casts doubt on possibility of negotiated peace in Ukraine Read more\nUpdated at 11.49 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Zelenskiy denies US and Europe pushing for peace talks - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/04/russia-ukraine-war-latest-news-putin-zelenskiy"}