{"authors": [], "date_download": "2024-02-05 15:45:09", "date_modify": "None", "date_publish": "2023-11-04 10:37:43", "description": "Comments made by the musician and activist, who grew up during the Troubles, are being lauded by panel show’s viewer as ‘eloquent’, ‘informed’ and ‘worth listening to’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Farts-entertainment%2Ftv%2Fnews%2Ffeargal-sharkey-israel-palestine-hignfy-b2441548.html.json", "image_url": "https://static.independent.co.uk/2023/11/04/10/newFile.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFeargal Sharkey is being praised for his impassioned speech about the Israel-Palestine conflict during an appearance on Have I Got News For You.\nThe singer, who is the former lead singer of “Teenage Kicks” punk band The Undertones, was a guest on the BBC panel show on Friday (3 November) alongside the episode’s host Jo Brand.\nWhen discussion turned to the current situation in Gaza, Brand asked “A Good Heart” singer and activist Sharkey, 65, if “partition is a good idea”. She asked for his view in particular due to his experiences of growing up in Derry both during the Troubles and following the Good Friday Agreement, the latter which put an end to violence in Northern Ireland after being signed in 1998.\nSharkey replied: “This is the 25th-anniversary of the Good Friday Agreement. For 25 years, the people of Northern Ireland have been able to prosper and grow and blossom and have discovered this thing peace is a very delicate, beautiful little flower that needs nurturing and caressing and supporting.\n“I do wish the people of Gaza, and Palestine and Israel get to discover what 25 years of peace, prosperity and diplomacy and democracy looks like. and that those people can blossom,” he continued, adding: “It’d be a much more confident and much brighter future for everyone involved.”\nSharkey received applause from his fellow panellists as well as the studio audience, and those watching at home expressed their praise for the singer on X/Twitter.\n“Very powerful from @Feargal_Sharkey – worth listening to,” @RichardJMurphy wrote, sharing a clip of Sharkey’s speech.\n@PPM_Expert called Sharkey’s speech an “eloquent, impassioned & informed perspective on the benefits of healing over division, peace over hate”, with others calling it “well said” and “on point”.\nHis words were also branded “moving”, “insightful”, with @HiKennys adding: “The most intelligent and correct thing I've heard throughout this recent utter madness.”\nAccess unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up\nAccess unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up\nFeargal Sharkey on ‘Have I Got News For You’ (BBC)\nThe episode aired as Israeli Prime Minister Benjamin Netanyahu pushed back against growing pressure from the US for a humanitarian pause in its war on Hamas, a month after the terrorist group launched its largest-ever attack on Israel, which killed more than 1,000 people.\nDespite calls to protect civilians and to get more aid into Gaza, Netanyahu said there will be no temporary ceasefire until all hostages are released, adding that Israel will continue “with full force” unless Hamas releases more than 240 hostages.\nOn Friday, an ambulance was struck outside Gaza’s largest hospital, al-Shifa, in Gaza City. The health ministry in the Hamas-run strip said that it was part of a convoy that was seeking to evacuate the wounded from northern Gaza to the south.,\nHumanitarian organisation PRCS said in a stataement shared on Saturday (4 November) that 15 civilians had been killed in the missile strike, and dozens more injured. Israel Defense Forces said it targeted the ambulance because it was being used by Hamas.\nFollow along with live updates on the conflict here.", "source_domain": "www.independent.co.uk", "text": null, "title": "Feargal Sharkey praised for ‘powerful’ Israel-Palestine speech on Have I Got News for You", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/arts-entertainment/tv/news/feargal-sharkey-israel-palestine-hignfy-b2441548.html"}