{"authors": [], "date_download": "2024-02-05 15:45:10", "date_modify": "None", "date_publish": "2023-11-04 09:25:57", "description": "The Taliban are appealing to Afghanistan's private sector to help those fleeing Pakistan's mass deportation drive", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fpakistan-ap-taliban-islamabad-afghan-b2441551.html.json", "image_url": "https://static.independent.co.uk/2023/11/04/09/Afghanistan_Pakistan_Migration_21765.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Taliban Saturday appealed to Afghanistan’s private sector to help people fleeing Pakistan’s mass deportation drive.\nPakistan is arresting and expelling all foreigners it says are in the country illegally, but the policy mostly affects Afghans because they are the biggest group of undocumented foreigners in the country.\nThe Ministry of Commerce and Industry in Kabul urged Afghanistan’s private sector to step forward and help.\nAfghans forcibly expelled from Pakistan are facing the worst situation of their lives, with no opportunities, the ministry said.\n“The ministry invites the private sector to take action because of the profound humanitarian disaster caused by the forced migration of hundreds of thousands of the poor and needy. It is the duty of Islam and Afghans to stand up for their fellow countrymen.”\nAfghanistan is overwhelmed by challenges, including years of drought, a beleaguered economy and the aftermath of decades of war. Millions are already internally displaced, raising concerns among the humanitarian community about the impoverished country being unable to support or integrate those leaving Pakistan.\nTaliban social media accounts have shown senior officials at the Torkham border, in eastern Nangarhar province, shaking hands with returning Afghans and welcoming them home. Temporary camps are providing people with food, shelter, and health care, according to Taliban authorities.\nAs many as 250,000 Afghans left Pakistan before an Oct. 31 deadline to leave voluntarily expired. Tens of thousands are heading to border areas fearing detention and deportation as Pakistan security forces go door-to-door searching for undocumented foreigners.\nAid agencies have scrambled teams to border areas, describing chaotic and desperate scenes among returning Afghans.\nPeople told Save the Children they have nowhere to live or money to pay for food, rent or transport after crossing the border. Some Afghan children born in Pakistan are in Afghanistan for the first time, the agency said.\nThe deportation drive marks a spike in tensions between Pakistan and the Taliban.\nPakistan says Afghans are responsible for carrying out suicide attacks in the country and accuses the Taliban of harboring such militants. The Taliban deny the allegations.\nOn Friday, senior Taliban figures again condemned Pakistan for its anti-migrant crackdown. They called the policy cruel and one-sided and demanded that Afghans be treated with respect and dignity.\nThe Taliban's acting defense minister in Kabul, Muhammad Yaqoob Mujahid, issued a warning to Pakistan.\n“Pakistan should face the consequences of its actions and reap what it sows,\" he said. “What is going on right now will have a negative impact on relations between both countries.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Taliban appeal to Afghan private sector to help those fleeing Pakistan’s mass deportation drive", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/pakistan-ap-taliban-islamabad-afghan-b2441551.html"}