{"authors": [], "date_download": "2024-02-05 15:45:10", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Kiev is reportedly wary about the limit to aid from abroad due to the US House of Representatives getting a new speaker and the Gaza conflict", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274018398%2Fukraine-doubles-down-on-lobbying-in-washington-politico.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1698869641.jpg", "language": "en", "localpath": null, "maintext": "Kiev is reportedly wary about the limit to aid from abroad due to the US House of Representatives getting a new speaker and the Gaza conflict\nUkraine has intensified its lobbying campaign in the US, anxious to keep military aid flowing amid changing realities both stateside and globally, Politico has claimed. Kiev's wish list reportedly includes air-to-air missiles, the long-range, single-warhead version of the ATACMS missile, as well as training conducting ship-to-shore operations.\nIn its article on Tuesday, the media outlet reported that a delegation of Ukrainian officials and troops had arrived in Washington, DC last week, requesting new types of weapons and assistance.\nPolitico, citing the Ukrainian representatives, said Kiev needs aircraft-borne rockets to shoot down Russian bombers, which have increasingly been using GPS-guided glide bombs.\nAs for the Army Tactical Missile System, the US secretly donated a small number of medium-range rockets tipped with cluster munition warheads, as reported by multiple media outlets last month. However, those rockets are not effective against better-protected targets than their solid warhead cousin, a member of the Ukrainian delegation told Politico.\nOn top of that, Ukraine allegedly asked its US backers to accelerate the F-16 training program for Ukrainian pilots as well as join the UK's Royal Marines in preparing Ukrainian forces for amphibious operations, with a view to crossing the Dnepr River. Ukrainian troops have for months been trying to establish a foothold on the left bank in Russia's Kherson Region in an apparent attempt to draw some of Moscow's forces away from the front line in Donbass and Zaporozhye Region.\nThe report alleged that President Vladimir Zelensky's meeting with US lawmakers in Kiev on Monday was also part of this effort to ensure American support, which has apparently begun to look less certain. Politico cited the recent election of Mike Johnson as speaker of the United States House of Representatives, who is opposed to issuing blank checks to Ukraine. Another factor mentioned in the article is the latest escalation between Israel and Hamas, which risks diverting international attention from Kiev's struggle.\nSpeaking before the Senate Appropriations Committee on Monday, US Defense Secretary Lloyd Austin warned that Russia would prevail in its conflict with Ukraine, should Washington withdraw its support for Kiev. Austin, along with Secretary of State Antony Blinken, were making the case for the provision of $44 billion more in defense and other aid to the Eastern European nation, which had been tied to funding for Israel and Taiwan in President Biden's request.\nIn its report on Monday, Time magazine, citing President Zelensky's aides, who were speaking on condition of anonymity, reported that the Ukrainian head of state increasingly feels \"betrayed by his Western allies\" for their apparent failure to provide his country with the \"means to win the war.\"\nAccording to the Pentagon's own estimates, the US has already expended $43.9 billion on \"security assistance\" to Kiev since February 2022.\nMeanwhile, Ukraine's summer counteroffensive has fallen short of high expectations, with the Ukrainian leadership acknowledging that its military has failed to make much progress. In its article, Time assessed that the push has caused Kiev \"enormous losses.\" According to the most recent Russian figures, the Ukrainian military lost more than 90,000 men between early June and early October.\nRussia has repeatedly warned Western nations that the shipment of heavy weapons and other military aid to Ukraine makes them de facto parties to the conflict. Moscow has also stressed that no amount of foreign aid will change the course of the struggle, and that the Russian Army will employ effective countermeasures against any weapons system.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Ukraine doubles down on lobbying in Washington Politico", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274018398/ukraine-doubles-down-on-lobbying-in-washington-politico"}