{"authors": [], "date_download": "2024-02-05 15:45:12", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Hostilities have become a stalemate and may last for years, Valery Zaluzhny told The Economist\r\n\r\n\r\nUkraine will not make any progress in its f", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274019073%2Fkiev-top-general-expects-no-breakthrough-of-russian-defenses.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1698920101.jpg", "language": "en", "localpath": null, "maintext": "Hostilities have become a stalemate and may last for years, Valery Zaluzhny told The Economist\nUkraine will not make any progress in its fight against Russia unless some new technology emerges to give it a decisive advantage, the country's top military commander, General Valery Zaluzny, told The Economist this week.\n\"Just like in the First World War, we have reached the level of technology that puts us into a stalemate,\" he said of the ongoing conflict, as quoted by the British magazine on Wednesday.\nDespite the hopes of Kiev supporters and Ukrainian officials, \"there will most likely be no deep and beautiful breakthrough,\" he predicted. The conflict may \"drag on for years\" and \"wear down\" the country.\nKremlin spokesman Dmitry Peskov disagreed with Zaluzhny on Thursday, stating that Russia was not in a stalemate and would keep pursuing its \"special military operation\" against Ukraine. Kiev should have long acknowledged that expecting a Russian defeat was \"absurd,\" he added.\nThe situational awareness that both sides have thanks to the use of drones makes surprise concentration of forces impossible, Zaluzhny believes. NATO textbooks and predictive models, which were used to plan the summer counteroffensive, have been proven wrong, the general claimed.\n\"Four months should have been enough time for us to have reached Crimea, to have fought in Crimea, to return from Crimea, and to have gone back in and out again,\" he said, referring to optimistic forecasts.\nThe commander has found that an old Soviet military textbook on how to deal with entrenched enemy forces had offered a better explanation of why both sides are now \"in stupor,\" he said.\nZaluzhny's office shared with The Economist a nine-page essay, in which he makes suggestions on how Ukraine could get into a better position against Russia and possibly avoid attrition warfare.\nHis proposed technological solutions include using drones with trap nets to catch Russian UAVs, ground GPS signal stations to counter Russian jamming, and robotic vehicles armed with plasma torches for demining.\nThis week, Time exposed a disconnect between Ukrainian President Vladimir Zelensky's push to keep fighting and the realities on the ground. Some frontline commanders have been defying orders to advance and \"just want to sit in the trenches and hold the line,\" a presidential aide told the magazine.\nA report in The Times last Sunday suggested that Zaluzhny may share this sentiment. A rumor circulating among Ukrainian security sources claimed the general had called for the counteroffensive to be stopped, but Zelensky refused.\n\"[Zelensky] knows that Western patience is limited for his maximalist demands that Ukraine must recover all territory\" that it has lost since 2014, the British newspaper claimed.\nAccording to Russian Defense Minister Sergey Shoigu, Kiev's troops have suffered over 90,000 casualties since June 4, the day the counteroffensive started. The Ukrainian Army has also lost some 600 tanks and nearly 1,900 armored vehicles over the same period, he said during a security conference in China on Monday.\nMoscow sees the hostilities as part of a US proxy war against Russia, in which Ukrainian troops are being used as \"cannon fodder.\" It blames the West for derailing a negotiated resolution in the early months of the conflict, and instead choosing to push Kiev to fight \"to the last Ukrainian.\"\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Kiev's top general expects no breakthrough of Russian defenses", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274019073/kiev-top-general-expects-no-breakthrough-of-russian-defenses"}