{"authors": ["Ryan Fahey"], "date_download": "2024-02-05 15:16:44", "date_modify": "None", "date_publish": "2024-01-21 16:39:30", "description": "North Korea and Russia plan to establish a \"new multi-polarised international order\" - which is a veiled threat against the US as both countries plan to build a united front against Washington", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fvladimir-putin-plots-north-korea-31932780.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31932796.ece/ALTERNATES/s1200/0_FILES-RUSSIA-NKOREA-DIPLOMACY.jpg", "language": "en", "localpath": null, "maintext": "North Korea and Russia plan to establish a \"new multi-polarised international order\" - which is a veiled threat against the US as both countries plan to build a united front against Washington\nVladimir Putin plans to visit North Korea to establish and international order with the Hermit Kingdom.\nThe Russian President expressed his willingness to visit the North at an unspecified \"early date\" as the countries continue to align in the face of their separate, intensifying confrontations with the United States.\nThe North Korean Foreign Ministry highlighted Putin's intent for a visit following North Korean Foreign Minister Choe Son Hui's meetings with Putin and Russian Foreign Minister Sergey Lavrov in Moscow last week. The ministry said in a statement published by state media that the two countries agreed to further strategic and tactical cooperation with Russia to establish a \"new multi-polarised international order,\" a reference to their efforts to build a united front against Washington.\nPutin had already confirmed his willingness to visit the capital, Pyongyang, at a convenient time during his meeting with North Korean leader Kim Jong Un in Russia's Far East in September. One of the few world leaders openly supporting Putin's war on Ukraine, Kim has been actively boosting the visibility of his ties with Russia in an attempt to break out of diplomatic isolation and strengthen his footing, as he navigates a deepening nuclear standoff with Washington, Seoul and Tokyo.\nIn a separate statement on Sunday, the North's Foreign Ministry condemned the U.N. Security Council for calling an emergency meeting over the country's latest ballistic test, which state media described as a new intermediate-range solid-fuel missile tipped with a hypersonic warhead. The ministry said the test-firing on Jan. 14 was among the country's regular activities to improve its defense capabilities and that it didn't pose a threat to its neighbors.\nSouth Korea on Thursday urged the Security Council \"to break the silence\" over North Korea's escalating missile tests and threats. Russia and China, both permanent members of the council, have blocked U.S.-led efforts to increase sanctions on North Korea over its recent weapons tests, underscoring a divide deepened over Russia's war on Ukraine.\nThe alignment between Pyongyang and Moscow has raised international concerns about alleged arms cooperation, in which the North provides Russia with munitions to help prolong its fighting in Ukraine, possibly in exchange for badly needed economic aid and military assistance to help upgrade Kim's forces. Both Pyongyang and Russia have denied accusations by Washington and Seoul about North Korean arms transfers to Russia.\nNorth Korea's Foreign Ministry, in comments published by state media, said Choe and the Russian officials in their meetings expressed a \"strong will to further strengthen strategic and tactical cooperation in defending the core interests of the two countries and establishing a new multi-polarized international order.\"\nRussia expressed \"deep thanks\" to North Korea for its \"full support\" over its war on Ukraine, the North Korean ministry said. It said Choe and the Russian officials expressed \"serious concern\" over the United States' expanding military cooperation with its Asian allies that they blamed for worsening tensions in the region and threatening North Korea's sovereignty and security interests.\nTensions on the Korean Peninsula are at their highest point in years, after Kim in recent months used Russia's invasion of Ukraine as a distraction to ramp up his weapons tests and military demonstrations. The United States, South Korea and Japan have responded by strengthening their combined military exercises, which Kim portrays as invasion rehearsals, and sharpening their deterrence plans built around nuclear-capable U.S. assets.\nIn the latest tit-for-tat, North Korea on Friday said it conducted a test of a purported nuclear-capable underwater attack drone in response to a combined naval exercise by the United States, South Korea and Japan last week, as it continued to blame its rivals for tensions in the region.\nChoe's visit to Moscow came as Kim continues to use domestic political events to issue provocative threats of nuclear conflict.\nAt Pyongyang's rubber-stamp parliament last week, Kim declared that North Korea is abandoning its long-standing goal of a peaceful unification with war-divided rival South Korea and ordered the rewriting of the North's constitution to cement the South as its most hostile foreign adversary. He accused South Korea of acting as \"top-class stooges\" of the Americans and repeated a threat that he would use his nukes to annihilate the South if provoked.\nAnalysts say North Korea could be aiming to diminish South Korea's voice in the regional nuclear standoff and eventually force direct dealings with Washington as it looks to cement its status as a nuclear weapons state.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Vladimir Putin plots North Korea trip to establish 'International Order' with Kim Jong un", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/vladimir-putin-plots-north-korea-31932780"}