{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Tom Ambrose", "Sam Jones", "Maya Yang", "Helen Sullivan"], "date_download": "2024-02-05 15:45:14", "date_modify": "None", "date_publish": "2023-11-04 05:00:30", "description": "This blog is now closed. Our live coverage continues here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F03%2Fisrael-hamas-war-live-updates-un-blinken-expected-call-for-pauses-fighting-allow-aid-gaza-tel-aviv-visit.json", "image_url": "https://i.guim.co.uk/img/media/ed4b8e5710caa70ca5a317b9971330e1fcef6de1/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=57ac43809e2f0a52d8268d8f141d9e59", "language": "en", "localpath": null, "maintext": "From 4 Nov 2023 02.03 CET 'Significant' pause in fighting discussed to secure hostages' release, says US Talks are being held on a “very significant” pause in the Israel-Hamas war to win the release of hostages taken Hamas, Agence France-Presse is quoting a senior US official as saying. “It is something that is under a very serious and active discussion. But there is no agreement as of yet to actually get this done,” the official said on Friday. Reuters quoted a US official saying there was “indirect engagement” aimed at finding a way to get the hostages out but that the work was extremely difficult. It’s something we’re working on extremely hard. An estimated 240 Israeli and foreign hostages were kidnapped by Hamas during its 7 October assault that killed more than 1,400 people, according to Israeli officials. A US official said “nobody knows” the exact number of hostages, adding that it was “well over 100 and maybe over 200”. To get that many people out “is going to require a fairly significant pause in hostilities”. But the official warned: There’s absolutely no guarantee a) that is going to happen or b) when it’s going to happen. Israel and the US have both previously ruled out a blanket ceasefire, which they say would allow Hamas to regroup and resupply, but US president Joe Biden has backed “temporary, localised” pauses. Israeli prime minister Benjamin Netanyahu has said there can be no “temporary truce” in Gaza unless Hamas releases the hostages.\nUpdated at 02.17 CET\n4 Nov 2023 05.45 CET In case you missed it earlier: five people were arrested during a pro-Palestinian sit-in at King’s Cross station in London after the demonstration was banned. The transport secretary, Mark Harper, said he had given an order to allow police to stop the demonstration on Friday evening and later announced that protesters would also be prevented from gathering outside the Israeli embassy in London over the weekend. On Friday evening scores of people could still be seen outside King’s Cross station on social media. One video posted on X (formerly Twitter) appears to show a man draped in a Palestinian flag shouting “free, free Palestine” while being carried away from the station by three officers. See the full story here: Five arrested at King’s Cross in London after pro-Palestinian sit-in banned Read more Meanwhile, the prime minister, Rishi Sunak, has described pro-Palestinian protests planned for London on Armistice Day as “provocative and disrespectful”.\n4 Nov 2023 05.18 CET Jonathan Freedland Beneath the surface of the war between Israel and Hamas, another conflict rages. In this clash, the battle lines are drawn in a very different place, and the alliances and enmities take unexpected shapes. We got a glimpse of it this week – and when the current violence subsides, we shall see it even more starkly. Right now, that moment – what diplomats and others refer to as “the day after” – seems a long way off, though the visit to Israel on Friday of the US secretary of state, Antony Blinken, suggests that Washington is already looking at its watch: proof that even some of Israel’s staunchest allies are alarmed by the mounting loss of life in Gaza. It goes to the poisonous, often-overlooked dynamic that has been present in the Israel-Palestine conflict for decades, and which will matter again when the current chapter ends. For then we’ll see that the contest that matters most is the battle of hardliners v moderates, or, to be more specific, maximalists v partitionists: those who insist on having the whole land for themselves v those who are ready to share it. To read the full analysis on how it could play out, click here.\nUpdated at 05.19 CET\n4 Nov 2023 04.36 CET The average Palestinian in Gaza is living on two pieces of Arabic bread made from flour the UN had stockpiled in the region, but the main refrain now heard in the street is “Water, water”, the Gaza director for the UN agency for Palestinian refugees has said. The Associated Press reports that Thomas White said he had travelled “the length and breadth of Gaza in the last few weeks” and described the place as a “scene of death and destruction”. No place was safe now, he said, and people feared for their lives, their future and their ability to feed their families. The Palestinian refugee agency (UNRWA) was supporting about 89 bakeries across Gaza, aiming to get bread to 1.7 million people, White told diplomats from the UN’s 193 member nations in a video briefing from Gaza. View image in fullscreen The al-Nuseirat bakery in Gaza before and after Israeli airstrikes. Photograph: Composit But, he said, “now people are beyond looking for bread – it’s looking for water”. UN deputy Middle East coordinator Lynn Hastings, who is also the humanitarian coordinator for the Palestinian territories, said only one of three water supply lines from Israel was operational. Many people are relying on brackish or saline ground water, if at all.\n4 Nov 2023 03.29 CET Palestinian Red Crescent condemns deadly strike on Gaza ambulance The Palestinian Red Crescent Society (PRCS) has condemned the targeting of a convoy of ambulances in Gaza by Israeli forces on Friday, which it says killed 15 people and wounded more than 60 others. The PRCS said in a statement early on Saturday that one of its ambulances was struck “by a missile fired by the Israeli forces” about two metres from the entrance to the al-Shifa hospital in Gaza City, Agence France-Presse reports. The attack resulted in the deaths of 15 civilians and wounded 60 other people, the PRCS said, mirroring figures released earlier by the Hamas-run health ministry. Another ambulance, belonging to the health ministry, was “directly targeted” by a missile about a kilometre from the hospital, causing injuries and damage, it said. View image in fullscreen People gather around an ambulance hit in the airstrike near the al-Shifa hospital in Gaza City. Photograph: Momen Al-Halabi/AFP/Getty Images The PRCS, part of the International Red Cross and Red Crescent Movement, added that deliberately targeting medical teams constituted “a grave violation of the Geneva Conventions, a war crime”. Israel’s military said it had launched an air strike on “an ambulance that was identified by forces as being used by a Hamas terrorist cell in close proximity to their position in the battle zone”. “A number of Hamas terrorist operatives were killed in the strike,” a military statement said. An AFP journalist at the scene of the attack saw multiple bodies beside the damaged ambulance outside the hospital, which is overcrowded with civilians seeking shelter from Israeli bombing as well as those wounded.\nUpdated at 04.03 CET\n4 Nov 2023 03.06 CET Blinken in Jordan to meet King Abdullah US secretary of state Antony Blinken is to meet Jordan’s King Abdullah II on Saturday after leaving Israel empty-handed in his efforts to secure humanitarian pauses in its war to destroy Hamas, Agence France-Presse reports. Blinken arrived late on Friday in Amman, where he will also join a meeting of foreign ministers of five Arab countries which will be attended by a representative of the Palestinian Authority (PA) led by president Mahmud Abbas, a rival of Hamas. In Israel, Blinken discussed with prime minister Benjamin Netanyahu the idea of “humanitarian pauses” to secure the release of hostages held by Hamas and to allow aid to be distributed to the Gaza Strip population. But after meeting Blinken on Friday, Netanyahu said there could be no “temporary truce” in Gaza unless Hamas released the hostages it held. View image in fullscreen Blinken disembarks his plane in Amman, Jordan, late on Friday. Photograph: Jonathan Ernst/Reuters\nUpdated at 04.03 CET\n4 Nov 2023 02.44 CET The day after an explosion that seriously damaged Agence France-Presse’s office in Gaza, the Israeli army claimed on Friday that it carried out a strike “nearby” to the news agency’s bureau without having “in any way” targeted it, the agency reports. AFP is the only one of the world’s three major international news agencies currently operating a live video feed from Gaza City which has not been interrupted despite the damage, seen by an AFP employee on Friday. The unmanned AFP camera broadcasting live 24/7 captured the moment of the strike, a few minutes before midday (1000 GMT) on Thursday. An AFP employee who visited the office on Friday said an explosive projectile appeared to have entered the technician’s office in the bureau horizontally from east to west. The strike destroyed the wall opposite the window and caused significant damage to the adjacent room and other doors. It also punctured water tanks on the roof. An Israeli military spokesman initially said it had “checked [the report] multiple times”. “There was no IDF [Israel Defense Forces] strike on the building” in Gaza, he told AFP. Following further questioning by AFP, the army said it had carried out a strike near the building.\n4 Nov 2023 02.03 CET 'Significant' pause in fighting discussed to secure hostages' release, says US Talks are being held on a “very significant” pause in the Israel-Hamas war to win the release of hostages taken Hamas, Agence France-Presse is quoting a senior US official as saying. “It is something that is under a very serious and active discussion. But there is no agreement as of yet to actually get this done,” the official said on Friday. Reuters quoted a US official saying there was “indirect engagement” aimed at finding a way to get the hostages out but that the work was extremely difficult. It’s something we’re working on extremely hard. An estimated 240 Israeli and foreign hostages were kidnapped by Hamas during its 7 October assault that killed more than 1,400 people, according to Israeli officials. A US official said “nobody knows” the exact number of hostages, adding that it was “well over 100 and maybe over 200”. To get that many people out “is going to require a fairly significant pause in hostilities”. But the official warned: There’s absolutely no guarantee a) that is going to happen or b) when it’s going to happen. Israel and the US have both previously ruled out a blanket ceasefire, which they say would allow Hamas to regroup and resupply, but US president Joe Biden has backed “temporary, localised” pauses. Israeli prime minister Benjamin Netanyahu has said there can be no “temporary truce” in Gaza unless Hamas releases the hostages.\nUpdated at 02.17 CET\n4 Nov 2023 01.41 CET More on the airstrike on a Gaza ambulance: video shared on social media, which Reuters has verified, showed people lying in blood next to the vehicle with flashing lights on a city street as people rushed to help. Another video showed three ambulances standing in a line, with about a dozen people lying either motionless or barely moving next to them, the news agency reports. Blood was pooled nearby. As we’ve reported, the World Health Organisation director general, Tedros Adhanom Ghebreyesus, said in a social media post he was “utterly shocked by reports of attacks on ambulances evacuating patients”, adding that patients, health workers and medical facilities must be protected. Israel’s military has said it hit an ambulance “being used by a Hamas terrorist cell” and that Hamas fighters were killed in the northern Gaza strike. Hamas said its fighters were not present. Israel’s military said in a statement: “We emphasise that this area is a battle zone. Civilians in the area are repeatedly called upon to evacuate southwards for their own safety.” Earlier on Friday, Ashraf al-Qidra, a spokesperson for Gaza’s Hamas-run health ministry, said ambulances would send critically injured Palestinians who urgently needed to be taken to Egypt to be treated from besieged Gaza City to the south of the territory.\nUpdated at 01.43 CET\n4 Nov 2023 01.23 CET Fifteen killed in Israeli strike on Gaza ambulance, says Gazan ministry The Israeli air strike on an ambulance being used to evacuate the wounded from besieged northern Gaza on Friday killed 15 and injured 60, the Hamas-controlled territory’s health ministry said. Reuters reports Israel’s military said it had identified and hit an ambulance “being used by a Hamas terrorist cell”. It said Hamas fighters were killed in the strike, and accused the group of transferring militants and weapons in ambulances. Hamas official Izzat El Reshiq said allegations its fighters were present were “baseless”. Ashraf al-Qidra, a spokesperson for Gaza’s health ministry, said the ambulance was part of a convoy that Israel targeted near Gaza City’s al-Shifa Hospital. Qidra said Israel had targeted the convoy of ambulances in more than one location, including at al-Shifa Hospital gate and at Ansar Square a kilometre (0.6 miles) away. In a statement on the incident, Israel’s military gave no evidence to support its assertion that the ambulance was linked to Hamas but said it intended to release additional information. This is Adam Fulton picked up our rolling live coverage of the Israel-Hamas war. It’s just passed 2.20am in Gaza City and Tel Aviv\nUpdated at 01.27 CET\n3 Nov 2023 00.48 CET The Palestine Red Crescent Society (PCRS) has accused Israeli forces of targeting a convoy of ambulances which it said was transporting injured Palestinians towards the Rafah border crossing into Egypt. In a statement, the PCRS – which is part of the International Red Cross – said a convoy of five ambulances departed from al-Shifa hospital at approximately 4pm on Friday towards the southern area of the Gaza Strip. The ambulances then had to turn back towards the hospital, after finding the road blocked by rubble and rocks from shelling, it said. During the return, at a distance of not more that 1 KM away from Al-Shifa hospital, the leading ambulance (belonging to [Ministry of Health]) in the convoy was directly targeted by a missile, resulting in its immediate and direct damage, as well as injuring its crew and the injured inside. The statement said the other ambulances – one of which belonged to the PCRS – continued towards al-Shifa hospital. It said that its ambulance was struck by a missile fired by Israeli forces “only at a distance of about two meters” from the gate of al-Shifa hospital. It said the ambulance was carrying an injured 35-year-old who was destined to receive medical treatment in an Egyptian hospital. The strike resulted in the deaths of 15 civilians and more than 60 were wounded, the PCRS said. It added that a medic sustained minor shrapnel injuries to the leg and bruises, and that the ambulance driver suffered chest bruises and “extreme panic”. 🔴 PRCS Statement on The Israeli Occupation Forces shelling of the Ambulance Convoy transporting the injured from the aggression on #Gaza towards Rafah crossing border on November 3rd 2023. pic.twitter.com/pzVEMeOo23 — PRCS (@PalestineRCS) November 3, 2023\n3 Nov 2023 00.32 CET US flying unarmed drones over Gaza in search of hostages The US has confirmed for the first time that it has been flying unarmed surveillance drones over Gaza. In a statement on Friday, Pentagon spokesperson Brig Gen Pat Ryder said: In support of hostage recovery efforts, the US is conducting unarmed UAV [unmanned aerial vehicle] flights over Gaza, as well as providing advice and assistance to support our Israeli partner as they work on their hostage recovery efforts. The US began flying UAV flights after the 7 October attack by Hamas on Israel, he added.\n3 Nov 2023 00.28 CET Honduras has recalled its ambassador to Israel for consultations on what it described as the “serious humanitarian situation” facing Palestinians in Gaza. Honduras’s foreign minister, Enrique Rein, posted to social media: Amid the serious humanitarian situation the Palestinian civilian population suffers in the Gaza Strip, the government … has decided to immediately call Mr. Roberto Martinez, Ambassador of the Republic of Honduras in Israel, to consultations in Tegucigalpa. Ante la grave situación humanitaria que sufre la población civil palestina en la franja de Gaza, él Gobierno de la Presidenta @XiomaraCastroZ ha decidido llamar inmediatamente a consultas a Tegucigalpa al Señor Roberto Martinez, Embajador de la República de Honduras en Israel. — Enrique Reina (@EnriqueReinaHN) November 3, 2023 The decision follows similar moves from other Latin American countries to register diplomatic protests against Israel in response to its latest conflict with Hamas. Bolivia’s leftwing government earlier this week announced that it was cutting ties entirely and attributing its decision to alleged war crimes and human rights abuses being committed in the Gaza Strip. Hours later, the governments of Chile and Colombia recalled their ambassadors from Israel, while Brazil’s president criticised the continued airstrikes on Gaza.\nUpdated at 00.35 CET", "source_domain": "www.theguardian.com", "text": null, "title": "UN says agency in Gaza ‘practically out of business’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/03/israel-hamas-war-live-updates-un-blinken-expected-call-for-pauses-fighting-allow-aid-gaza-tel-aviv-visit"}