{"authors": ["Elizabeth Haigh", "Jon Brady"], "date_download": "2024-02-05 15:45:17", "date_modify": "None", "date_publish": "2023-11-04 08:39:51", "description": "A protester at a pro-Palestine demonstration in Trafalgar Square, London has held a placard appearing to celebrate Hamas bulldozing into Israeli territory.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12709639%2FPolice-pro-Palestinian-Day-Action-thousands-London-40-marches-five-arrested-Kings-Cross.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/04/16/77402715-0-image-m-189_1699116994519.jpg", "language": "en", "localpath": null, "maintext": "Pro-Palestinian protesters have waved placards that appear to celebrate Hamas terrorists bulldozing their way into Israel during the October 7 attacks - as thousands of demonstrators took to the streets once again across the UK.\nThe sign, depicting a bulldozer flying a Palestinian flag as it ploughs through a chain link fence, appears to be inspired by a photo taken on the day of Hamas' incursion into Israel in which 1,400 people- mostly civilians - were slaughtered.\nIt used the slogan 'from the river to the sea Palestine will be free' - considered by some to be a call for the destruction of Israel - and was slammed on social media; police say they are making 'active enquiries' to identify those responsible.\nThe sign was spotted in Trafalgar Square, where protesters laid dozens of effigies of dead children; the Hamas-controlled Gazan health ministry claims 9,500 people have been killed in Israel's ceaseless retaliatory strikes since October 7, including more than 3,700 youngsters.\nThe messaging marred pro-Palestine marches taking place in 40 towns and cities across the UK - as thousands marched to call for a ceasefire. At least three people were arrested in London's Piccadilly Circus and eight arrests were made elsewhere in the capital, the Met Police said.\nLONDON: The Met Police said it is 'actively' trying to identify those behind the sign, which appears to celebrate Hamas' attack on Israel on October 7\nLONDON: Police officers detain a demonstrator taking part in a sit-down protest in Piccadilly Circus in solidarity with Palestinians in Gaza\nGLASGOW: A woman screams at a person holding an Israeli flag while at a pro-Palestine protest on Saturday\nNEWCASTLE: People hold banners expressing solidarity with Palestinians during a protest in the northern city\nMANCHESTER: Pro-Palestinian protesters occupy Manchester Piccadilly station late on Saturday afternoon\nBELFAST: Two young children hold signs in front of a display of teddy bears outside the US Consulate in Northern Ireland\nLONDON: Police officers tussle with demonstrators in London after thousands descended on the capital for a 'Day of Action'\nLONDON: Police officers move to detain a protester amid demonstrations in solidarity with Palestinian civilians\nLONDON: A police officer clashes with a demonstrator during a protest in solidarity with Palestinians in Gaza on Saturday\nLONDON: A woman cradles an effigy of a dead baby covered in red paint on Saturday in Trafalgar Square\nLONDON: A woman places candles around child body effigies during a Pro-Palestine 'Ceasefire Now' demonstration at Trafalgar Square\nLONDON: Police officers detain a protester around Piccadilly Circus during the pro-Palestine march\nLONDON: Protesters struggle with police officers in the centre of the capital on Saturday\nLONDON: Protesters scuffle with officers as they stage a sit-in protest at Piccadilly Circus\nLONDON: Police intervene as protestors demanding a ceasefire hold a sit down protest at Piccadilly Circus\nLONDON: An officer grabs a protester's arm after demonstrators allegedly blocked the path of a police van\nLONDON: Poppy vendors are surrounded by pro-Gaza protesters during a sit-in at Charing Cross Station on Saturday\nLONDON: Officers scuffled as they detained one person in Piccadilly Circus on Saturday\nLONDON: Met Police officers were seen detaining protesters in central London on Saturday\nLONDON: Protesters gather outside the BBC headquarters before marching to a rally in Trafalgar Square on Saturday\nLONDON: Those at the protest outside the BBC held signs accusing the government of being complicit in war crimes\nOne person was arrested on suspicion of assaulting a police officer while a second was detained for allegedly displaying a placard that could incite hated contrary to Section 12 of the Terrorism Act. A third person was arrested for breaching conditions of Section 12 of the Public Order Act.\nProtesters holding banners and waving Palestinian flags amassed outside the BBC on Saturday, many masked, as they called for an immediate ceasefire to protect human life. Protesters then staged sit-ins at major London junctions and Charing Cross and Manchester Piccadilly stations.\nAt least one protester was seen carrying a banner which read \"Let's keep the world clean\" with a picture of an Israeli flag being thrown into a bin.\nA similar banner displayed at a protest in Warsaw was condemned by the Israeli ambassador to Poland as \"blatant antisemitism\".\nThe Met Police said its policing operation today involves officers from its emergency response and neighbourhoods teams, as well as volunteer special constabulary officers and those from Kent Police.\nBy 12pm, hundreds of people had gathered outside the BBC's offices in central London ahead of a planned march through the capital.\nMany held signs and placards, as well as Palestinian flags, and many posters accused the government and the BBC of being 'guilty'.\nOne group of protesters gathered on Kensington High Street on Saturday afternoon with banners and flags - just metres from the Israeli embassy.\nA speaker told those assembled: 'Victory to the Palestinian resistance, until there is a free Palestine from the river to the sea and zionism, the repressive, monstrous state of Israel is smashed and torn down, brick by brick, rule by rule.\n'The flag of Palestine, if we stand with Palestinians, if we build a revolutionary, anti-imperialist movement in our communities from the grass roots, if this movement stands with the people of Palestine, imagine in our lifetimes, someday, the flag of Palestine will fly high and proud above the city of Jerusalem.'\nChants from the crowd included 'free, free Palestine', 'long live Palestine' and 'from the river to the sea, Palestine will be free.'\nPosters from those in the crowd included slogans such as 'victory to the Intifada' and 'Zionism is racism.'\nIn a separate incident, British Transport Police said they are aware of an incident filmed on a Tube train in which pro-Palestine demonstrators repeatedly shouted: 'Smash the Zionist settle state'.\nThe force said: 'British Transport Police are aware of footage circulating on social media showing chanting on a tube train. Enquiries into the incident are ongoing.\n'We urge anyone wishing to make a report related to this incident to text 61016 or call 0800 40 50 40 with reference 26 of 4/11/23.'\nThe same group could also be heard chanting: 'One, two, three, four, occupation no more. Five, six, seven, eight, Israel is a terrorist state.'\nLater in Trafalgar Square, a young girl sitting on the shoulders of an adult could be heard leading the same chant to hundreds of people, as well as saying 'from the river to the sea.'\nMANCHESTER: A man speaks into a microphone during a sit-in protest at Manchester Piccadilly station on Saturday\nMANCHESTER: Hundreds of people gathered in the centre of Manchester on Saturday to demonstrate in solidarity with Palestinian civilians\nMANCHESTER: Protesters wave flags inside Manchester Piccadilly train station on Saturday\nMANCHESTER: Activists packed out the transport hub on Saturday\nLONDON: Protesters take part in a protest inside Charing Cross station following the 'London Rally For Palestine' on Saturday\nLONDON: Pro-Palestinian protesters climbed up onto the fountains in Trafalgar Square to wave flags\nLONDON: People protest in support of Gaza on November 4, 2023 in Trafalgar Square\nLONDON: Thousands gathered in Trafalgar Square late on Saturday afternoon to call for an end to violence in Gaza\nLONDON: Protesters let off flares and waved flags as they marched through the centre of the capital\nLONDON: Photographs of dead Palestinian children are laid out at Trafalgar Square during a Pro-Palestine 'Ceasefire Now' demonstration\nLONDON: A child holds a sign reading 'Sunak, London does not stand with you' at the BBC's HQ on Saturday\nLONDON: Thousands of people gathered in Trafalgar Square after marching through the capital on Saturday\nLONDON: Masked demonstrators stand opposite police officers in Oxford Circus on Saturday\nLONDON: Demonstrators sat in the road at Piccadilly Circus in central London on Saturday\nLONDON: Police officers talk to demonstrators at Piccadilly Circus as activists staged a sit-in protest\nLONDON: A significant police presence was seen trying to keep protesters off the road in central London\nLONDON: Flags and placards reading 'Freedom for Palestine' and 'End the Genocide' were waved in the air\nLONDON: Protesters gathered on Kensington High Street just metres from the Israeli embassy\nLONDON: Police officers monitor a sit-in protest at Oxford Circus on Saturday before moving protesters on\nLONDON: Pro Palestine protesters gather at Trafalgar Square after marching through central London\nThe Met Police said that protesters briefly blockaded Oxford Circus, sharing aerial photos showing dozens of people appearing to stage a sit-in on the road.\nThe force said: 'Officers are responding to a group of protestors who have sat down and blocked Oxford Circus. This behaviour clearly impacts on London's ability to function normally and we are working quickly to reopen the road.\n'After swift intervention by officers, Oxford Circus is now clear. The demonstration is moving along Regent Street towards Trafalgar Square and is being closely monitored.'\nBut soon afterwards images on social media showed hundreds of protesters staging a second sit-in protest at Piccadilly Circus.\nElsewhere, hundreds of people gathered in Newcastle, Glasgow, Belfast and Manchester.\nIn Glasgow, people were pictured screaming and shouting angrily towards a person holding an Israeli flag, as police officers stood by to protect the individual.\nIn Belfast on Saturday afternoon, pro-Palestinian activists marched from Queen's University to the US consulate building in the south of the city.\nA rally was held at a barrier on the road leading to the consulate, while five organisers were permitted to walk up to the gates of the building to hand a letter of protest to a police officer - who took it inside.\nThe rally heard speeches and chants condemning Israel's actions in Gaza and US support for the Israeli stance.\nAt the close of the event, several children left teddy bears close to the barrier to signify the young lives lost in the conflict.\nIn Newcastle, several women were pictured holding bloody effigies of dead babies while one dressed in a white shroud covered in fake blood.\nBloodied children's dolls were held aloft as hundreds of Palestine supporters marched through the city centre to protest against the ongoing war.\nThe demonstrators congregated at the Civic Centre before passing through Northumberland Street in large numbers.\nFlags and placards reading 'Freedom for Palestine' and 'End the Genocide' were waved in the air by members of the Newcastle Palestine Solidarity Campaign (NPSC) and Newcastle Stop the War, who organised the event.\nMen, women and children could be heard shouting pro-Palestine chants as the group made their way across the city before coming to a stop at Grey's Monument.\nSome could be seen carrying fake baby toys covered in blood which were held high to mark the deaths of children during the conflict. One woman was pictured dressed in white with red paint smeared on her clothes.\nMeanwhile Celtic fans were seen holding Palestinian flags ahead of their cinch Premiership match at the Global Energy Stadium in Dingwall.\nAnd in Charing Cross and Manchester Piccadilly station, hundreds of people staged a sit-in protest taking up the entire concourse while chanting pro-Palestine slogans.\nGLASGOW: A man dressed in military-style uniform joins a pro-Palestine protest in Glasgow\nGLASGOW: People take part in a Scottish Palestinian Solidarity Campaign protest in Glasgow on Saturday\nGLASGOW: Police officers are seen monitoring a Scottish pro-Palestine protest\nGLASGOW: People take part in a Scottish Palestinian Solidarity Campaign protest outside BBC Scotland at Pacific Quay\nGLASGOW: Police officers stand in front of members of the public holding an Israeli flag amid a large pro-Palestine demonstration in Glasgow\nGLASGOW: Supporters of Palestine react to people holding an Israeli flag in the Scottish city\nGLASGOW: Police keep pro-Palestine and pro-Israel activists apart during action on Saturday\nNEWCASTLE: A woman holds a bloody effigy of a dead baby while wearing a white shroud covered in red paint in Newcastle-upon-Tyne on Saturday\nNEWCASTLE: Two women comfort one another, one wearing a shawl covered in red paint, on Saturday\nNEWCASTLE: In Newcastle, people held placards reading 'Jews say ceasefire now' and 'Not in our name'\nNEWCASTLE A protest march in support of Palestine taking place this afternoon saw hundreds of people show up\nLONDON: People let off flares in the colours of the Palestinian flag on Saturday in London\nLONDON: Activists briefly held a sit-in protest in Oxford Circus before moving on towards Trafalgar Square\nLONDON: Many held signs and placards, as well as Palestinian flags and flares\nLONDON: Demonstrators protest in solidarity with Palestinians in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas on Saturday\nLONDON: Thousands of Pro Palestinian supporters perform a sit-in at Oxford Circus on Saturday\nLONDON: Demonstrators hold smoke flares as they protest in solidarity with Palestinians in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in London\nLONDON: Protesters gather outside the BBC headquarters before marching to a rally in Trafalgar Square\nLONDON: A protester holds signs reading 'Starmer is guilty' and 'BBC is guilty'\nLONDON: Many protesters wore masks and held Palestinian flags as they demanded an end to the violence\nThe Metropolitan Police said it has imposed a condition under Section 14 of the Public Order Act to prevent demonstrators gathering near the country's embassy in Kensington, west London.\nThe Met also said it is 'aware' of plans for a static protest in Trafalgar Square, but is not anticipating any need for 'significant' road closures.\nIt added on social media site X, formerly Twitter: 'We expect to see further pro-Palestinian protests in central London tomorrow.\n'Officers will be on duty to provide reassurance - and to deal with anyone who breaks the law.\n'We also have to maintain the integrity of diplomatic premises.'\nLast night five people were arrested during a sit-in protest in solidarity with Palestinians currently living in a war zone and facing near-constant bombardment by Israeli forces.\nAs many as several hundred people turned up with videos on social media showing protesters sitting on the station concourse chanting 'ceasefire now', 'free, free Palestine' and 'in our thousands, in our millions, we are all Palestinians'.\nThe demonstration had been banned before it began, as Transport Secretary Mark Harper gave an order to allow police to stop the demonstration on Friday evening under Section 14a of the Public Order Act 1986.\nLukas Slothuus, 33, an academic from London who attended the sit-in, said: 'Over 9,000 Palestinians have been killed by Israel and everyone should protest whenever they can at our government's complicity with the catastrophe Israel is causing.\n'The protest was huge, with many hundreds of Londoners, and it shows the popular opinion in support of calling for a ceasefire.'\nBritish Transport Police said its officers told protesters about the notice and advised them to leave.\nFive people were later arrested for failing to comply with the notice, the force said.\nMost protesters left 'without incident' by 7.15pm, the force added, and some then joined a demonstration outside the station.\nLONDON: Tens of thousands of people are expected at marches across the UK today (pictured: protesters at King's Cross on Friday)\nLONDON: Five people were arrested at a banned sit-in protest in King's Cross Station on Friday\nLONDON: As many as several hundred people turned up with videos on social media showing protesters sitting on the station concourse chanting 'ceasefire now', 'free, free Palestine' and 'in our thousands, in our millions, we are all Palestinians'\nCAMBERWELL: Protesters in south London on Friday held banners and Palestinian flags\nCAMBERWELL: Locals protested to demand a ceasefire in Gaza in South London on Friday night\nLONDON: The King's Cross protest came despite the Transport Secretary's attempt to ban it, citing disruption risk\nLONDON: Pro-Palestine protesters perform a sit in at Kings Cross station on Friday evening as part of an ongoing series of demonstrations calling for a ceasefire in the Israel/Hamas conflict\nLONDON: Protesters were seen with flags in the station before the demonstration was moved outside\nHalf an hour later officers from BTP and the Met escorted around 50 protesters away from the area to Euston.\nA man was arrested near Euston station on suspicion of common assault before protesters left the area.\nAssistant Chief Constable Sean O'Callaghan said: 'I am pleased that the use of the public order legislation, which applied to the operation of the railway, worked well tonight.\n'While initial arrests were necessary, the rest of the protesters then complied with the prohibition order and quickly left the station.\n'This was a good operation where partners from BTP, Network Rail and the Metropolitan Police worked together to keep London safe and moving.'\nThe Transport Secretary said: 'While the right to peaceful protest is a key part of our democratic society, it cannot be at the expense of other people's right not to be seriously disrupted or intimidated.\n'That's why I have granted consent for the British Transport Police (BTP) to make an order under Section 14a of the Public Order Act 1986 prohibiting the planned protest at King's Cross station this evening.\n'This means protest activity at the station is classified as unlawful and anyone taking part will be subject to arrest.\n'Officers must have the powers they need for our stations to remain safe places for people to go about their journeys, protecting public safety and preventing disorder.'\nProtests also took place in Camberwell, south London, as did a vigil for those kidnapped by Hamas in Borehamwood, north London.\nThose in attendance brought soft toys and Israeli flags, laid down posters of those missing and lit candles.\nCommander Karen Findlay, who will oversee policing in London this weekend, said the pro-Palestine rallies come on top of a campaign of 'action' by Just Stop Oil as well as sporting fixtures and dozens of other events scheduled for Bonfire Night.\nShe said the force will use facial recognition technologies and social media 'analytics' in an attempt to bring sharper policing this weekend, after previous marches have seen isolated anti-Semitic incidents mar a wider peaceful event.\nSpeaking in an online media briefing, Commander Findlay said: 'We are going to be using a sharper focus to inform sharper interventions to make arrests in big crowds.\n'We have included faster-time analysis capability of social media and we are going to be employing retrospective facial recognition, so I want to make it clear that we will be doing everything within our power this weekend to make sure there is that fast-time, really robust response to emerging incidents that cause really grave concern to communities.'\nA total of 133 people have been arrested for crimes including racially aggravated public order offences, assaulting police and criminal damage since October 7.\nIn addition, three women have been held for terrorism offences, two after being seen wearing images of paragliders and a third suspected of supporting Hamas online.\nOf the 133 arrested, 26 people have been charged, 14 for allegations of anti-Semitism and six for allegations of Islamophobia.\nThe others are charged with faith hate, criminal damage and other matters.\nBOREHAMWOOD: A vigil was held for hostages kidnapped by Hamas in north London on Friday\nBOREHAMWOOD: Those in attendance brought soft toys and pictures of those being held in Gaza\nPlacards waved in Trafalgar Square on Saturday appeared to directly reference a moment in the October 7 attacks when Palestinians used a bulldozer to open a hole in the border fence between Gaza and Israel\nSmoke rises after an Israeli attack as the attacks continue on the 29th day in Gaza City\nBlack smoke rises from an Israeli airstrike on the outskirts of Aita al-Shaab, a Lebanese border village with Israel in south Lebanon\nIsraeli forces have been condemned for their response to the Hamas massacre, which has included bombing residential areas\nSmoke rises from the town of Beit Hanon, located in the northern part of the Gaza Strip\nPeople search through buildings that were destroyed during Israeli air raids in the southern Gaza Strip on Saturday\nTeams rescue a woman from under the rubble after an Israeli attack hits en-Neccar family apartment in Khan Yunis, Gaza\nA Palestinian child reacts following a strike at a UN-run school sheltering displaced people\nWomen and children cry after a strike on a UN-run school in the Jabalia refugee camp in the northern Gaza Strip\nThe protests today come as Israeli Prime Minister Benjamin Netanyahu yesterday ruled out a temporary ceasefire in Gaza until hostages are released.\nWhere are protests happening on Saturday? Protests are taking place in around 40 different towns and cities on Saturday in solidarity with the people of Gaza. According to the Palestine Solidarity Campaign, these locations include: Bristol\nCambridge\nCanterbury\nCarlisle\nChatham\nCoventry\nDorchester\nDumfries\nDurham\nEastbourne\nExeter\nGuildford\nHalifax\nHereford\nHitchin\nKingston\nKirkwall\nLeamington Spa\nLeeds\nLincoln\nLiverpool\nLondon (Brent)\nLondon (Brixton)\nLondon (Camden)\nLondon (Central)\nLondon (Ealing)\nLondon (Hackney)\nLondon (Harrow)\nLondon (Islington)\nLondon (Kingsbury)\nLondon (Lewisham)\nLondon (Redbridge)\nLondon (Wimbledon)\nLondon (Tower Hamlets)\nLuton\nMiltton Keynes\nNewcastle\nNorthampton\nNottingham\nOxford\nPenzance\nPlymouth\nPortsmouth\nSheffield\nSouthampton\nSouthend\nStoke\nTunbridge Wells\nWoking\nWolverhampton\nWorthing\nWrexham\nYork Further protests are scheduled for Sunday, including in: Barnstaple\nBirmingham\nBrighton and Hove\nChester\nHastings\nLeicester\nLondon (Herne Hill)\nLondon (Waltham Forest) Advertisement\nMore than 200 were reportedly taken after Hamas - the de facto governing authority in Gaza - swept into Southern Israel and attacked civilians and military personnel.\nMore than 1,400 people were killed, the majority of whom were civilians.\nIsrael has responded with a devastating siege of Gaza and made repeated raids into the beleaguered territory.\nThe Israel Defense Forces (IDF) have also been condemned for attacks on civilian areas and strikes killing combatants.\nOvernight, the Israeli military confirmed it targeted an ambulance outside Gaza's largest hospital.\nThe IDF claimed it was being used by Hamas militants while Hamas health officials said it was transporting the wounded, and that 15 people had been killed and 60 wounded.\nIsraeli 'aircraft struck an ambulance that was identified by forces as being used by a Hamas terrorist cell in close proximity to their position in the battle zone,' a military statement said.\nWorld Health Organization chief Tedros Adhanom Ghebreyesus said he was 'utterly shocked' by a deadly Israeli strike on an ambulance near Gaza's largest hospital on Friday.\nGhebreyesus said he was 'utterly shocked by reports of attacks on ambulances evacuating patients close to Al-Shifa hospital in Gaza, leading to deaths, injuries and damage'.\n'We reiterate: patients, health workers, facilities and ambulances must be protected at all times. Always,' the WHO chief wrote on X, formerly Twitter.\nIt comes as Prime Minister Rishi Sunak said holding a similar rally on Armistice Day next weekend would be 'provocative and disrespectful.'\nRishi Sunak said there is a 'clear and present risk that the Cenotaph and other war memorials could be desecrated' amid reports that tens of thousands of demonstrators are planning to take to the streets to call for an immediate ceasefire in Israel's attacks on Gaza on Saturday November 11.\nThere are fears the march could disrupt the two-minute silence commemorating the war dead and the daytime and evening Festival of Remembrance at the Royal Albert Hall, with the latter performance usually attended by royals.\nWriting on X, formerly Twitter, Mr Sunak said: 'To plan protests on Armistice Day is provocative and disrespectful, and there is a clear and present risk that the Cenotaph and other war memorials could be desecrated, something that would be an affront to the British public and the values we stand for.\n'The right to remember, in peace and dignity, those who have paid the ultimate sacrifice for those freedoms must be protected.\n'I have asked the Home Secretary (Suella Braverman) to support the Met Police in doing everything necessary to protect the sanctity of Armistice Day and Remembrance Sunday.'\nMs Braverman and the immigration minister, Robert Jenrick, backed the Prime Minister's assessment, with the Home Secretary branding such a demonstration a 'hate march'.\nShe tweeted: 'I agree with the Prime Minister. It is entirely unacceptable to desecrate Armistice Day with a hate march through London.\n'If it goes ahead there is an obvious risk of serious public disorder, violence and damage as well as giving offence to millions of decent British people.\n'I have full confidence in the Metropolitan Police to ensure public safety and take all factors into account as they have done in similar situations in the past.'\nMr Jenrick wrote: 'Armistice Day is sacrosanct. These disrespectful and often hate-filled marches, routinely intimidating our fellow citizens, must not be permitted to demean our national moments of remembrance.'\nIsraeli military vehicles cross the security fence between Israel and the northern part of the Gaza Strip on Saturday\nLocals carry out search and rescue operations after an Israeli attack hits en-Neccar family apartment in Khan Yunis\nThe aftermath of an Israeli airstrike on a residential building in Khan Yunis\nSecurity minister Tom Tugendhat has written to the Mayor of London, Westminster Council and the Metropolitan Police, 'asking them to look very carefully at the powers that they have and to consider what options they have available'.\n'Personally, I don't think this is an appropriate moment for a protest,' Mr Tugendhat told the BBC.\nThe Met, which will be responsible for on-the-day policing of the demonstration, could ask the Home Secretary for temporary powers to ban protests from happening in certain areas of London, but only if it believes there is a risk of 'serious public disorder'.\nLondon Mayor Sadiq Khan, whose role gives him influence over policing priorities in the capital, said Mr Tugendhat should stop 'posturing'.\nHe said agency: 'If this security minister knew his brief, he would know the only person in the country that can ban marches is the Home Secretary - his colleague in cabinet.'\nMr Khan said it is 'incredibly important' that demonstrators understand the importance of Remembrance events and the Met Police was speaking to protest organisers to 'make sure they stay away from the Cenotaph'.\nHe added: 'I'd encourage the organisers to work with the police to stay away from the Cenotaph.'\nThe Met has vowed to use all its powers to stop the disruption of commemorations and said officers will be deployed across the capital that weekend as part of a 'significant policing and security operation'.\nIt said protest groups have not indicated plans to march on Remembrance Sunday on November 12 but a significant demonstration is expected on the Saturday.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pro-Palestine protesters in London hold up banner of Hamas bulldozer with the slogan 'From the river to the sea, Palestine will be free' as Met make first arrests in 'Day of Action' march", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12709639/Police-pro-Palestinian-Day-Action-thousands-London-40-marches-five-arrested-Kings-Cross.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}