{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:45:20", "date_modify": "None", "date_publish": "2023-11-04 03:43:42", "description": "The Pentagon press secretary confirmed on Friday that the U.S. is flying drones over Gaza to help in the search for hostages, as U.S. officials said talks about a pause in fighting are ongoing.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12709285%2Fdrones-gaza-surveillance-hostages-pause-fighting.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/04/03/77390071-0-image-m-63_1699068978367.jpg", "language": "en", "localpath": null, "maintext": "The US has deployed drones above Gaza to help search for Hamas-held hostages, the Pentagon confirmed on Friday, as talks were underway for a pause in fighting to allow the hostages to be released.\nThe hostages, seized on October 7, are from some 40 countries, with some reports saying 14 Americans are among them.\n'In support of hostage recovery efforts, the U.S. is conducting unarmed UAV flights over Gaza, as well as providing advice and assistance to support our Israeli partner as they work on their hostage recovery efforts,' said Brig. Gen. Patrick Ryder, Pentagon press secretary, at a briefing on Friday.\n'These UAV flights began after the October 7 attack by Hamas on Israel.' It is unclear how valuable the aerial surveillance will be, given that the hostages are believed to be being held underground.\nBrig. Gen. Patrick Ryder, Pentagon press secretary, on Friday confirmed that drones were being deployed over Gaza to help look for hostages\nThe drones are MQ-9 Reaper drones, piloted remotely from the United States\nFour have been released so far, and said they were kept in tunnels.\nThe information obtained by the MQ-9 Reapers is being shared with Israel but is focused on finding the estimated 242 hostages, not locating Hamas terrorists for targeted air strikes, Ryder stressed.\nHe said the United States was 'not participating in IDF target development' or 'helping them run their campaign' in Gaza.\n'We the US military are not participating in IDF target development, helping them run their campaign — just to be crystal clear that it is their operation,' Ryder said.\n'That planning element is providing planning and intelligence support as it relates to hostage recovery.'\nChristopher Maier, an assistant secretary of defense, suggested earlier this week that U.S. special forces commandos have also been deployed to help the Israelis find them.\n'We're actively helping the Israelis to do a number of things,' said Maier, speaking at a special operations conference in Washington DC.\nIsrael has been bombing Gaza relentlessly since the Hamas terror attacks, which killed 1,400 people.\nThe death toll in Gaza has risen to 9,000, according to Gazan health authorities, operating in the Hamas-controlled enclave.\nThe shocking scenes of devastation in Gaza have sparked protest around the world and seen calls for a ceasefire.\nA map from Turkey's Anadolu agency shows where Israeli forces have advanced in Gaza\nThe U.S. is not backing demands for a ceasefire - which would represent a long term downing of arms - but instead promote the idea of a 'humanitarian pause', to allow aid in and wounded people and hostages out.\nA senior U.S. official on Friday said that talks are being held on a 'very significant' pause to win the release of dozens of the hostages.\n'It is something that is under a very serious and active discussion. But there is no agreement as of yet to actually get this done,' the official said.\nTo get that many people out 'is going to require a fairly significant pause in hostilities.'\nBut the official warned: 'There's absolutely no guarantee a) that is going to happen or b) when it's going to happen.'\nJoe Biden has backed 'temporary, localized' pauses.\nAt a fundraiser earlier this week, he said: 'I think we need a pause. A pause means giving time to get the prisoners out.'\nIsraeli Prime Minister Benjamin Netanyahu, however, has warned that there could be no 'temporary truce' in Gaza unless Hamas releases the hostages.\nPresident Joe Biden, pictured in Minnesota on Wednesday, was heckled by a rabbi demanding a ceasefire in Gaza\nBenjamin Netanyahu is seen on October 14 speaking to soldiers preparing to invade Gaza\nAntony Blinken, the Secretary of State, was in Tel Aviv on Friday and told the Israelis that a humanitarian pause would buy Israel more time for its Gaza operation, Axios reported.\nBlinken said that the United States accepts that Israel's routing of Hamas in Gaza will be a long process, but there needs to be a pause now to allow the hostages out.\nHe also reportedly told them that the Biden administration was facing rising domestic anger over their support for the Israeli actions, and Israel needed to be more mindful of civilian casualties.\n'The Biden administration is with us but they have their constraints — also domestically. We want to help them,' a senior Israeli official told Axios.\nBlinken on Saturday will travel to Jordan and meet the foreign ministers of Jordan, Egypt, Qatar, Saudi Arabia, and the United Arab Emirates, as well as Hussein al-Sheikh, Palestinian President Abbas' chief adviser.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US surveillance drones are deployed over Gaza to help find Hamas-held hostages - as US calls for 'significant pause' to allow release of captives", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12709285/drones-gaza-surveillance-hostages-pause-fighting.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}