{"authors": ["Charlie Bradley"], "date_download": "2024-02-05 15:45:22", "date_modify": "None", "date_publish": "2023-11-04 08:32:00", "description": "The Israeli Defense Force says 15 Hamas militants engaged in combat with their forces before their tunnels were destroyed.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1831411%2Fisrael-defense-force-gaza-war-hamas-terrorists-tunnel-ambushes.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5049019.jpg", "language": "en", "localpath": null, "maintext": "Israeli Air Force target Hamas commander\nSeveral Hamas terrorists have been killed in a tunnel raid in Gaza, the Israel Defense Force (IDF) has claimed. The IDF has said that infantry and tank forces engaged in combat with Hamas militants who were coming out of their complex tunnel network to ambush Israeli troops. Israeli forces took out several Hamas gunmen and the tunnels they used will be destroyed, the IDF added. One reported encounter involved IDF forces fighting 15 Hamas militants, killing them, and shelling their observation posts. The IDF has not yet provided any detail on whether its forces suffered any casualties during this fight. READ MORE: Hezbollah's vicious threat to wider war as leader says 'all scenarios are open'\nIsraeli soldiers in Gaza preparing targeted raid\nAn ambulance convoy was struck on Friday sparking international outcry\nThis comes as the IDF continues its ground operations in northern Gaza. They also carried out a \"targeted raid\" in southern Gaza overnight, carried out to map out buildings and clear explosive devices. People in Gaza have also reported continued Israeli strikes. Despite the IDF's pleas to Gazans to move to the south of the strip, strikes have continued to hit this area Raed Mattar, who had fled northern Gaza early in the war and is sheltering in a school, said he heard explosions from airstrikes. He told reporters: “People never sleep. The sound of explosions never stops.” On Friday, the IDF confirmed that an Israeli strike hit an ambulance convoy near a hospital in Gaza as they claimed the vehicles were being used by a Hamas cell. DON'T MISS\nIraq's Popular Mobilization Forces preparing to retaliate against Israel [INSIGHT]\nCalls for an inquiry into the BBC after it is fooled by famous Hamas actor [UK]\nNetanyahu warns Hezbollah terror chief ‘don’t test us, you will pay dearly’ [NEWS]\nIsraeli soldiers are ramping up operations\nThe IDF said a \"number of Hamas terrorist operatives were killed in the strike\". The Gaza Health Ministry claimed that 15 people were killed and 60 were wounded in the strike. The Hamas-led health ministry said: \"We had notified the Red Cross, the Arab Republic of Egypt, and the entire world through communication channels and the media of the movement of ambulances carrying the injured transferred to Egypt, but the occupation committed its crime in all brazenness.\" The IDF also released a statement: \"An IDF aircraft struck an ambulance that was identified by forces as being used by a Hamas terrorist cell in close proximity to their position in the battle zone. \"A number of Hamas terrorist operatives were killed in the strike. We intend to release additional information... We have information which demonstrates that Hamas's method of operation is to transfer terror operatives and weapons in ambulances. \"We emphasise that this area is a battle zone. Civilians in the area are repeatedly called upon to evacuate southwards for their own safety.\"", "source_domain": "www.express.co.uk", "text": null, "title": "IDF says several Hamas terrorists killed in tunnel ambushes", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1831411/israel-defense-force-gaza-war-hamas-terrorists-tunnel-ambushes"}