{"authors": [], "date_download": "2024-02-05 15:45:22", "date_modify": "None", "date_publish": "2023-11-04 03:21:25", "description": "Israeli airstrike on Gaza ambulance convoy kills at least 15, says Hamas-run Gaza ministry; US working ‘hard’ to secure release of hostages", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F04%2Fisrael-and-hamas-at-war-what-we-know-on-day-29.json", "image_url": "https://i.guim.co.uk/img/media/79cf92f43de8ef473bbd4bef0a1a506357dbf82f/0_187_4259_2556/master/4259.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d3335af7bae78986235fd05d9ef5025", "language": "en", "localpath": null, "maintext": "At least 15 people were killed and 60 injured after an Israeli strike on a convoy of ambulances near the beseiged territory’s biggest hospital, al-Shifa, Gaza’s Hamas-run health ministry said. Israeli forces on Friday targeted the convoy “transporting the wounded” from Gaza City towards Rafah in the south, according to the Hamas government in Gaza. The Palestine Red Crescent Society said its ambulance was struck by a missile fired by Israeli forces. The Israel Defense Forces said it carried out an airstrike on an ambulance it said was being used by Hamas, and that “a number of Hamas terrorist operatives” were killed. The World Health Organisation director general Tedros Adhanom Ghebreyesus said he was “utterly shocked” by reports of attacks on ambulances evacuating patients.\nIsraeli strikes on Gaza have killed at least 9,227 Palestinians, including 3,826 children, since 7 October, the Gaza health ministry said on Friday. The Israeli offensive on Gaza followed attacks launched by Hamas into Israel on 7 October which killed 1,400 people.\nThe UN agency for Palestinian refugees (UNRWA) has warned it cannot provide safety to the hundreds of thousands of Palestinians “sheltering under a UN flag”. More than 50 UN facilities have been “impacted” by the conflict – including “five direct hits” – and 38 people had died in UN shelters, Thomas White, the director of UNRWA affairs, said on Friday. “Let’s be very clear, there is no place that is safe in Gaza right now.”\nUNRWA “is practically out of business”, the UN’s humanitarian chief said on Friday, as he paid tribute to at least 72 UNRWA staff killed in Gaza since 7 October. Martin Griffiths told UN member states in New York that what had unfolded over the past 26 days of conflict “is nothing short of … a blight on our collective conscience”.\nThe leader of Lebanon’s Hezbollah has said his powerful militia is engaged in cross-border fighting with Israel and has threatened further “realistic escalation”. Hassan Nasrallah stopped short of announcing that Hezbollah had fully joined the Israel-Hamas war but warned that fighting on the Lebanon-Israel border would not be limited to the scale seen so far. The White House said Hezbollah should not try to take advantage of the conflict between Israel and Hamas.\nTalks are being held on a “very significant” pause in the Israel-Hamas war to win the release of hostages taken by Hamas, Agence France-Presse quoted a senior US official as saying. “It is something that is under a very serious and active discussion. But there is no agreement as of yet to actually get this done,” the official said on Friday. Reuters quoted a US official saying there was “indirect engagement” aimed at finding a way to get the hostages out and “it’s something we’re working on extremely hard”, but there was “absolutely no guarantee” it would happen. An estimated 240 Israeli and foreign hostages were kidnapped by Hamas during its 7 October assault.\nIsrael will continue its offensive in Gaza “with full force” and refuse any temporary ceasefire that does not include the release of the hostages held by Hamas, the Israeli prime minister, Benjamin Netanyahu, has said, rejecting US calls for a pause in the fighting. “I made clear that we are continuing full force and that Israel refuses a temporary ceasefire which does not include the release of our hostages,” he said on Friday.\nIsraeli forces have surrounded Gaza City and are attacking Hamas infrastructure and destroying tunnels used by militants to launch attacks, the Israeli military said on Friday. Airstrikes continued alongside the intensifying ground offensive in what Netanyahu described as the second stage of the war.\nThe US secretary of state, Antony Blinken, flew into Israel on Friday to urge Netanyahu to temporarily stop Israel’s military offensive to allow aid into the territory. The US’s top diplomat applied the greatest pressure yet on the Israeli government to rethink its strategy in Gaza, calling for localised humanitarian pauses and insisting Israel cannot achieve long-term security solely through military means.\nTurkey’s president, Recep Tayyip Erdoğan, has called for an immediate ceasefire between Israel and Hamas, saying “crimes against humanity” are being committed in Gaza. “There is no concept that could explain or excuse the brutality that we have witnessed since 7 October,” Erdogan said during a summit of Turkic states in the Kazakh capital, Astana.\nFrance has reacted with “astonishment” and “incomprehension” after it said that an Israeli airstrike had hit the Institut Français in Gaza, and that the Gaza office of Agence France-Presse (AFP) news agency was also hit. AFP said its Gaza City office was significantly damaged by a strike on the building on Thursday. No injuries have been reported.\nIsraeli forces on Friday killed six Palestinians in raids across the West Bank, the Palestinian health ministry said, as violence surged in the occupied territory in tandem with the Gaza war. The Israeli army said its forces were “operating against Hamas” across the West Bank, with operations in Jenin and the northern city of Nablus.\nThe US has confirmed for the first time that it has been flying unarmed surveillance drones over Gaza. The flights were “in support of hostage recovery efforts”, the Pentagon said.\nThe first people in a group of about 100 Britons due to leave Gaza on Friday have made the crossing into Egypt, amid concerns about whether individuals in the north of the Palestinian territory will be able to make it to the southern Rafah crossing. By Friday, there were 127 people on the UK list to be evacuated into Egypt since the crossing opened on Wednesday. The parents-in-law of Scotland’s first minister, Humza Yousaf, were among the Britons able to leave Gaza. It is understood hundreds of British nationals remain trapped in Gaza.\nThe White House has said 100 American citizens and family members left Gaza on Thursday. Another large group of Americans were expected to leave the territory on Friday, it said.\nThirty-four French citizens were evacuated from the Gaza Strip on Friday, according to the French foreign ministry.\nDoctors and aid workers in Gaza say they have been abandoned by the international community to a “humanitarian tragedy” as they “fight to survive” after almost four weeks of war.\nThousands of Palestinian workers from Gaza who were stranded in Israel when war broke out last month have been deported back to the war-torn strip after being expelled by the Israeli government. The UN Human Rights Office said it was “deeply concerned” about the expulsions.\nRishi Sunak has described pro-Palestinian protests planned for London on Armistice Day as “provocative and disrespectful”. The UK prime minister’s intervention on Friday came as two women pictured at a pro-Palestinian march in London carrying photos of paragliders have been charged with terrorism offences.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel and Hamas at war: what we know on day 29", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/04/israel-and-hamas-at-war-what-we-know-on-day-29"}