{"authors": [], "date_download": "2024-02-05 15:16:45", "date_modify": "None", "date_publish": "2024-01-21 18:01:53", "description": "Lebanese state media and health officials say an Israeli airstrike has hit two vehicles near a Lebanese army checkpoint in south Lebanon", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhezbollah-ap-lebanon-israeli-sidon-b2482328.html.json", "image_url": "https://static.independent.co.uk/2024/01/21/18/Lebanon_Israel_Palestinians_35657.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAn Israeli airstrike hit two vehicles near a Lebanese army checkpoint in south Lebanon on Sunday, killing a Hezbollah member and wounding several other people, including civilians, Lebanese state media and health officials reported.\nThe strike appeared to be part of a shift in Israeli strategy toward targeted killings in Lebanon after more than three months of near-daily clashes with Hezbollah militants on the border against the backdrop of the war in Gaza.\nHezbollah announced that one of its members, identified as Fadel Shaar, had been killed in the strike in the town of Kafra. Local civil defense and hospital officials said seven people were wounded, including two women, one of whom was in critical condition.\nVideo from the scene showed a passenger sedan in flames next to a small truck stopped in the middle of the road.\nThe Israeli military did not comment on the strike.\nSince the outbreak of the Israel-Hamas war on Oct. 7, Hezbollah forces have engaged in near-daily clashes with Israeli troops along the border.\nWhile the clashes had previously been limited mainly to a narrow strip within a few kilometers (miles) from the border, Israel in recent weeks appears to have moved to a strategy of targeted killings of figures from Hezbollah and allied groups, sometimes hitting in areas relatively far from the border, as was the case in Sunday’s strike.\nOn Saturday, another strike near the Lebanese port city of Tyre killed two people in a car — one of them a Hezbollah commander — and two people in a nearby orchard. The commander, Ali Hudruj, was buried Sunday in south Lebanon. The other occupant of the car, tech sector businessman Mohammad Baqir Diab, was identified as a civilian and was buried in Beirut on Sunday.\nOn Jan. 2, a presumed Israeli airstrike killed a top Hamas official, Saleh Arouri, in a suburb of Beirut, the first such strike in Lebanon’s capital since Israel and Hezbollah fought a brutal one-month war in 2006.\nSpeaking at Hudruj’s funeral Sunday, Hezbollah Member of Parliament Hussein Jeshi said Israel had “resorted to the method of assassinating some members of the resistance\" to compensate for being unable to reach a military victory against Hamas after more than 100 days of war in Gaza.\nThe Lebanese militant group said in a statement later Sunday that it had launched an attack against the town of Avivim in northern Israel in retaliation for a civilian woman killed in the Israeli strike in Kafra and for other “attacks that targeted Lebanese villages and civilians.”\nIt later modified the statement to remove the reference to the civilian death after hospital officials and family members said the woman was still alive.\nIsrael did not comment on the strike in Kafra but announced it had struck Hezbollah targets in several locations in Lebanon on Sunday. It later said that an anti-tank missile had hit a house in Avivim and no injuries were reported.\nWith dangers of a regional conflict flaring on multiple fronts, officials from the United States and Europe have engaged in a flurry of shuttle diplomacy in recent weeks between Israel and Lebanon, attempting to head off an escalation of the conflict into a full-on war on the Lebanese front.\n___\nSewell reported from Beirut. Associated Press journalists Ahmad Mantash in Sidon, Ali Sharaffedine in Beirut and Melanie Lidman in Jerusalem contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Strike kills Hezbollah official in Lebanon, amid apparent Israeli shift to targeted killings", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hezbollah-ap-lebanon-israeli-sidon-b2482328.html"}