{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:45:31", "date_modify": "None", "date_publish": "2023-11-03 13:54:21", "description": "Secretary of State Antony Blinken called for making arrangements for 'humanitarian pauses' and urged Israel to 'do more' to protect Palestinian civilians amid Israel's bombardment of Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12707095%2FAntony-Blinken-says-need-protect-Palestinian-civilians-meeting-Netanyahu-Israeli-officials-Israel-says-humanitarian-pauses-needed-hostages-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/03/13/77366339-0-image-a-11_1699019156599.jpg", "language": "en", "localpath": null, "maintext": "Secretary of State Antony Blinken issued a public call to protect Palestinian civilians during a critical visit to Israel Friday and upped calls for 'humanitarian pauses' to strikes on Gaza to get hostages out and allow aid in.\nBlinken spoke in Tel Aviv after meeting with Israel's President Benjamin Netanyahu, and said he raised the issue humanitarian pauses.\nHe said the two discussed how to make sure Hamas doesn't uses such breaks 'to its own advantage' and 'how to connect the pause to the release of hostages.'\nHis comments came as Israel's Defense Minister Gallant reportedly told him Israel wouldn't agree to any pause that does not also include the release of hostages.\nHezbollah's chief Hassan Nasrallah also broke his silence to warn of 'further escalation on the Lebanese front' and called the October 7 attack a 'glorious jihad operation'.\n'We need to do more to protect Palestinian civilians,' Blinken said. He called it the right and lawful thing to do. 'Failure to do so plays into the hands of Hamas and other terror groups,' Blinken said.\n'We need to do more to protect Palestinian civilians,' said Secretary of State Antony Blinken Friday during his trip to Israel\nHe also called for hastening relief supplies into Gaza to help people in 'desperate need' through 'no fault of their own.' That comes as the Israel Defense Forces and its government have faced increased calls, including from Senate Democrats, to exercise restraint as it unleashes withering air attacks on Gaza in what it says is a bid to eliminate the Hamas power structure.\nWithout taking civilians into consideration, there will be 'no partners for peace' later, he warned, resuming his call for a two-state solution to the Israel-Palestinian conflict.\nBlinken's words of caution came during a press event where he also recalled the slaughter of 1,400 Israelis after the Hamas terror attack.\n'The brutality of the slaughter has receded so quickly in the memories of so many. But not in Israel and not in America,' he said.\nBlinken said that during his visit he was thrown additional videos, from security cameras and even from videos shot by Hamas attackers, depicting some of the brutality wreaked on Israelis civilians during the attack. During his first visit to Israel after the Oct. 7 attack, Blinken had an emotional meeting with survivors of the attack and friends and family members of victims.\nBlinken once again met Israeli Prime Minister Benjamin Netenyahu (R) in Tel Aviv\nBlinken also met Israeli President Isaac Herzog during his visit\nBlinken says he and Netanyahu discussed the need to protect civilians in the Gaza Strip\nBlinken repeatedly invoked the uses of 'humanitarian pauses' in the effort to bring back American and other Israeli and foreign nationals seized by Hamas.\n'A humanitarian pause could help that effort,' he said.\n'This is a very important piece,' he said.\nBlinken again defended Israel's 'right and indeed obligation' to defend itself. But he repeatedly pointed to the 'imperative' of 'doing everything possible to protect civilians.'\nIt comes after two repeated Israel Defense Forces strikes on the Jabalya refugee camp.\nHe also call to reign in violence by Israeli settlers inside the West Bank, which is controlled by the Palestinian Authority.\nHe said heard a 'clear commitment' to deal with extremist conduct on the West Bank.\nAnd Blinken repeated President Biden's warnings against anyone seeking to expand the conflict, amid fears of Hezbollah opening up a second front with Israel amid repeated exchanges of rocket fire with Israeli forces.\n'We are determined that there not be a second or third front opened in this conflict,' Blinken said, mentioning that the U.S. had dispatched two aircraft carrier strike groups to the region.\nIt came on a day Sayyed Hassan Nasrallah, secretary general of Hezbollah, issued his first remarks since the attack, amid fears Israel could face an expanded war.\nHe said the Israel-Hamas battle had 'extended to more than one front' and called the brutal attack inside Isreal a 'glorious jihadi operation.'\nBlinken used personal and emotional language about civilians came after Netanyahu addressed the nation this week and invoked the Old Testament, calling it a 'time for war.' It came at the end of a week when U.S. forces in the region continued to fall under attack, and when Biden was heckled at a Minnesota by a rabbi calling for a cease fire.\n'We need to do more to protect Palestinian civilians. We've been clear that as Israel conducts his campaign to defeat Hamas, how it does so matters. It matters because it's the right and lawful thing to do. It matters because failure to do so plays into the hands of Hamas and other terror groups,' Blinken said.\n'There will be no partners for peace if they're consumed by humanitarian catastrophe, and alienated by any perceived indifference to their plight. This is what binds us as human beings. I've seen images of Palestinian children, young boys and girls pulled from the wreckage of buildings. When I see that when I look into their eyes through the TV screen I see my own children.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Blinken pushes Israel 'to do more to protect Palestinian civilians' after Netanyahu talks: Secretary of State ramps up calls for 'humanitarian pause' in Gaza strikes - as Bibi rejects calls for a temp", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12707095/Antony-Blinken-says-need-protect-Palestinian-civilians-meeting-Netanyahu-Israeli-officials-Israel-says-humanitarian-pauses-needed-hostages-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}