{"authors": ["Mattha Busby", "Martin Belam"], "date_download": "2024-02-05 15:45:32", "date_modify": "None", "date_publish": "2023-11-03 18:50:39", "description": "Ukraine’s foreign minister says president is considering the ‘pros and cons’ of holding spring elections", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F03%2Frussia-ukraine-war-live-us-raises-nuclear-test-concerns-as-putin-withdraws-ratification-of-nuclear-test-ban-treaty.json", "image_url": "https://i.guim.co.uk/img/media/b94017d025a99e3d4988dfa1291bbf7d123aee21/0_166_3000_1801/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=1ea7539362ee0a1dbe4e55b47210d994", "language": "en", "localpath": null, "maintext": "From 3 Nov 2023 14.48 CET Zelenskiy weighs up presidential elections in spring, minister says Ukrainian president Volodymyr Zelenskiy is considering the “pros and cons” of holding presidential elections next spring, his foreign minister has said. “We are not closing this page. The president of Ukraine is considering and weighing the different pros and cons,” Dmytro Kuleba told a briefing, adding that holding elections during the war with Russia would entail “unprecedented” challenges. In August, Zelenskiy, responding to calls by a US senator to announce elections in 2024, said that voting could take place during wartime if partners shared the cost, legislators approved, and everyone got to the polls. However, he also expressed concerns. “The logic is that if you are protecting democracy, then you have to think about this protection even during times of war,” he reportedly said. “Elections are one of the protections. But there is a reason why elections are prohibited by law during wartime – it is very difficult to hold them.” In 2019, the former actor and comedian had no political experience other than playing the role of president in a TV series when he won a landslide victory in Ukraine’s presidential election.\nUpdated at 19.26 CET\n3 Nov 2023 19.12 CET The UK ministry of defence has released its latest update on the situation in Ukraine. In the south, the Ukrainian advance remains relatively static between the two main lines of Russia’s well prepared defensive positions. Around the Donbas town of Avdiivka, a large-scale Russian assault has floundered on strong Ukrainian defences. A major factor in this phenomenon has highly likely been the relative side-lining of tactical air power: both sides have maintained credible air defences, preventing combat jets from providing effective air support for assaults. Above all, the geographic size of the conflict has hampered the offensives: both sides have struggled to assemble uncommitted striking forces capable of a breakthrough because most of their mobilised troops are needed to hold the 1,200km line of contact. Latest Defence Intelligence update on the situation in Ukraine – 03 November 2023.\nFind out more about Defence Intelligence's use of language: https://t.co/tkqrs5h78q\n🇺🇦 #StandWithUkraine 🇺🇦 pic.twitter.com/97t9scVat6 — Ministry of Defence 🇬🇧 (@DefenceHQ) November 3, 2023\n3 Nov 2023 19.00 CET The US has begun sending smaller military aid packages to Ukraine to stretch out support given a stalemate in Congress over providing funding for Ukraine, the White House said on Friday. White House press secretary Karine Jean-Pierre said the intention was to extend the ability to support Ukraine for as long as possible while Congress debates new aid.\nUpdated at 19.37 CET\n3 Nov 2023 18.54 CET The US has announced a new $425 m (£343m) military assistance package for Ukraine that features air defence, artillery munitions and anti-tank weapons. That equipment, which also includes small arms ammunition, demolitions munitions and other items, is part of $125m in gear drawn from existing military stocks. The package also includes $300m in laser-guided munitions to counter drones, which will be funded via the Ukraine security assistance initiative (USAI). That means it will not immediately arrive on the battlefield, as the munitions need to be procured from the defence industry or partners, rather than drawn from American stockpiles. The Pentagon said in a statement that the USAI funding was provided by a continuing resolution passed by Congress in late September to temporarily fund the government. But it is now gone – the package “exhausts the remaining USAI funds currently available to support Ukraine”, the statement said. The Pentagon also made the case for Ukraine aid, saying it is “a smart investment in our national security”. It said: “It helps to prevent a larger conflict in the region and deters potential aggression elsewhere, while strengthening our defense industrial base and creating highly skilled jobs for the American people.” The US is by far the biggest donor of security assistance to Ukraine, committing more than $44.2bn since Moscow invaded Ukraine in February 2022. But some Republicans oppose continued assistance for Kyiv, putting the future of American aid for Ukraine in doubt.\nUpdated at 19.03 CET\n3 Nov 2023 18.39 CET Ukrainian shelling of the Russian-occupied part of the southern Kherson region killed seven people today, the Moscow-installed occupational authorities said. “The Ukrainian army attacked civilian infrastructure in the Chaplynskiy district,” local Moscow-backed Konstantin Basyuk said on Telegram. “According to preliminary information, seven people are dead and seven wounded. Medics are fighting for the life of another two people.” The town of Chaplynka lies around 100 kilometres (62 miles) south-east of Kherson, the regional capital controlled by Ukrainian forces. Basyuk said the strikes had targeted the local pensions office. Ukraine retook Kherson from Russian forces last year, but Moscow still controls most of the Kherson region.\n3 Nov 2023 18.06 CET Serbia’s intelligence chief, who has fostered closer ties with Russia and is under sanctions by the US, resigned today after less than a year in the post, saying he wanted to avoid possible further embargos against the Balkan nation. In July, the US imposed sanctions on Aleksandar Vulin, accusing him of involvement in illegal arms shipments, drug trafficking and misuse of public office. The US treasury department’s office of foreign assets control said that Vulin used his public authority to help a US-sanctioned Serbian arms dealer move illegal arms shipments across Serbia’s borders. Vulin is also accused of involvement in a drug trafficking ring, according to US authorities. Vulin became the director of Serbia’s intelligence agency BIA in December 2022. The close associate of Serbia’s populist president, Aleksandar Vučić, had previously served as the army and police chief, according to AP. Vulin is known for advocating close ties with Russia instead of the west, and promoting the concept of a “Serbian World” – a carbon copy of the “Russian World” advocated by Vladimir Putin – that would be made up of all ethnic Serbs living in neighbouring states. Vučić has said the real reason why Vulin has faced US sanctions is his position toward Russia and not corruption allegations. The US and the EU are looking for my head as a precondition for not imposing sanctions on Serbia. I will not allow myself to be the cause of blackmail and pressure on Serbia and the Serbian world. That is why I submit my irrevocable resignation. My resignation will not change the policy of the USA and the EU towards Serbia, but it will slow down new demands and blackmail,” Vulin said, adding that he won’t stop believing in “the inevitability of the unification of Serbs and the creation of a Serbian world. In August 2022, Vulin visited Moscow in a rare visit by a European government official to the Russian capital since the start of the war. The trip underscored Belgrade’s refusal to join western sanctions against Russia over its full-scale invasion of Ukraine. View image in fullscreen Serbian spy chief Aleksandar Vulin listens during a press conference of Serbian president Aleksandar Vucic, in Belgrade, Serbia, on 8 October. Photograph: Darko Vojinović/AP\nUpdated at 19.07 CET\n3 Nov 2023 17.51 CET German chancellor Olaf Scholz has spoke with Chinese president Xi in a video conference today, a German government spokesperson said. The leaders discussed economic cooperation, as well as the Hamas attack on Israel and the situation in the region, the spokesperson said in a statement. Scholz and Xi also discussed the war in Ukraine. Their conversation served to stress that nuclear war must not happen there and cannot be won, according to the statement reported by Reuters.\n3 Nov 2023 17.37 CET Ukraine has harvested more than 67m tonnes of grain and oilseeds from the new 2023 harvest so far, the agriculture ministry said today. It said 47.2m tonnes of grain and about 20m tonnes of oilseeds had been threshed. The harvest ends late this year, depending on the weather. The volume included 22.4m tonnes of wheat, 5.9m tonnes of barley, 398,200 tonnes of peas, 17.1m tonnes of corn and smaller contributions from other cereals. The ministry also said farmers had harvested 4m tonnes of rapeseed and 11.3m tonnes of sunseed, reports Reuters. Last year’s grain harvest was set to fall to 44.3m tonnes from 53.1m in 2022 as less acreage was sown due to the Russian invasion, according to a forecast. At the same time, gross production of oilseeds was expected to increase to 19.2m tonnes from 18.2m tonnes in 2022 due to a larger sowing area for the more lucrative crop. If the forecasts were correct, it would have added up to 62.5m tonnes – suggesting a bounceback for the harvest this year.\nUpdated at 17.47 CET\n3 Nov 2023 17.10 CET The US has sanctioned a Russian national for helping Russian elites to launder and transfer hundreds of millions of dollars using virtual currency in contravention of existing sanctions imposed after Moscow’s invasion of Ukraine. Ekaterina Zhdanova helped a Russian client hide their source of wealth to transfer more than $2.3m (£1.8m) into western Europe through a fraudulently opened investment account and real estate purchases in 2022, allowing for sanctions evasion, the treasury department said. Zhdanova also used virtual currency exchanges to help oligarchs who had relocated internationally, it said. In one example listed by the department, a Russian oligarch asked Zhdanova to move more than $100m to the United Arab Emirates. She also established a UAE tax residency service for Russian clients and may have helped to obfuscate their identities, the statement said. To facilitate large cross-border transactions, the department said Zhdanova used virtual currency entities, including Garantex, a prominent Russia-based darknet market site and cryptocurrency exchange that was sanctioned by the US in 2022 for operating in Russia’s financial services sector, Reuters reported. The department did not say where it believes Zhdanova is located. “Our action today highlights the consequences of supporting corrupt Kremlin proxies, underscores the United States’s efforts to address the abuse of virtual currency to launder illicit funds, and exposes an illicit actor’s money laundering activities,” state department spokesperson Matthew Miller said. Under the US sanctions program that targets certain harmful Russian foreign activities, all of Zhdanova’s assets in the US are blocked and US citizens are prohibited from dealing with her.\nUpdated at 18.02 CET\n3 Nov 2023 16.50 CET Russia intends to stick to nuclear test ban moratorium, Moscow says Russia intends to stick to a nuclear test ban moratorium despite withdrawing its ratification of the Comprehensive Nuclear Test Ban Treaty, the foreign ministry has said. “We intend to keep the moratorium that was introduced more than 30 years ago in place,” said a ministry statement. The US formally withdrew from the landmark 1987 Intermediate-range Nuclear Forces (INF) Treaty with Russia in 2019 after claiming that Moscow was violating the accord, an accusation the Kremlin denied. The Russian president, Vladimir Putin, proposed to the US and several western European Nato members that there should be a moratorium on the development of missiles previously banned by the INF treaty. But Russian deputy foreign minister, Sergei Ryabkov, who leads on arms control talks, said the US was “moving rapidly” towards the deployment of such missiles in both Asia and Europe. “Accordingly, our moratorium, which was announced by the president of the Russian Federation, in the light of such developments, of course, cannot be maintained,” Ryabkov told the Kommersant newspaper. “The Americans think it doesn’t matter. We believe that they are thereby delivering a new powerful blow to global stability and the security of the respective regions.” The US publicly blamed Russia‘s development of the 9M729 ground-launched cruise missile, known in Nato as the SSC-8, as the reason for it leaving the INF treaty.\nUpdated at 17.28 CET\n3 Nov 2023 16.39 CET Russia launched its largest drone attack on Ukraine for weeks early this morning, hitting critical infrastructure in the west and south of Ukraine and destroying private houses and commercial buildings in Kharkiv. The Ukrainian air force said it shot down 24 Shahed drones out of 40 launched by Russia, with Kharkiv, Odesa, Kherson, Ivano-Frankivsk and Lviv among the targets. Oleh Syniehubov, Kharkiv’s governor, said drones had hit civilian infrastructure and caused fires in and near the city of Kharkiv. He said eight people, including two children, required medical help due to acute stress. 00:00:49 Ukraine: buildings on fire in Kharkiv after biggest Russian drone strike in weeks – video\nUpdated at 16.49 CET\n3 Nov 2023 16.27 CET Meloni adviser quits over prank call A diplomatic adviser to Italian prime minister Giorgia Meloni has resigned, taking responsibility for a prank call fiasco, according to the PM. Earlier this week, Meloni’s office said she had a phone conversation with a Russian comedian who successfully posed as a high-ranking African Union official. During the call, which took place in September, Meloni spoke of international “fatigue” with the war in Ukraine and complained that Italy had little support from European partners in dealing with migration. Ukraine’s counteroffensive is not going as expected … It has not changed the fate of the conflict, and everyone understands that [the conflict] could last many years if we don’t find a solution. The Ukrainians are doing what they have to do and we are trying to help them. “This matter was not handled well, we are all sorry, Ambassador [Francesco] Talo took responsibility for it,” Meloni said, announcing that her aide had quit. ‘Tiredness on all sides’ over war in Ukraine, Italian PM tells prank caller Read more\nUpdated at 17.22 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Zelenskiy ‘weighing up presidential elections in spring’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/03/russia-ukraine-war-live-us-raises-nuclear-test-concerns-as-putin-withdraws-ratification-of-nuclear-test-ban-treaty"}