{"authors": ["Robert Tait"], "date_download": "2024-02-05 15:45:33", "date_modify": "None", "date_publish": "2023-11-03 21:19:59", "description": "Congressional progressives say proposed $14.3bn breaches 1997 Leahy act as assault on Gaza has overwhelmingly harmed civilians", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fnov%2F03%2Fisrael-aid-democrats-leahy-act-congress.json", "image_url": "https://i.guim.co.uk/img/media/f88a11ff41d3c2191660fdb5d77c49894279f35d/0_0_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9353d849728c3769b4854a3ab86af619", "language": "en", "localpath": null, "maintext": "Leftwing Democrats in Congress have invoked a landmark law barring assistance to security forces of governments deemed guilty of human rights abuses to challenge the Biden administration’s emergency military aid program for Israel.\nMembers of the Democratic party’s progressive wing say the $14.3bn package pledged by the White House after the 7 October attack by Hamas that killed more than 1,400 Israelis breaches the Leahy Act because Israel’s retaliatory assault on Gaza has overwhelmingly harmed civilians. An estimated 9,000 people have been killed in Gaza so far, among them 3,700 children, according to the Gaza health ministry, run by Hamas.\nThe act, sponsored by the former Democratic senator Patrick Leahy and passed in 1997, prohibits the US defence and state departments from rendering security assistance to foreign governments facing credible accusations of rights abuses. The law was originally designed only to refer to narcotics assistance, but was later expanded, with amendments covering assistance from both state department and Pentagon budgets\nSeveral governments, some of them key US allies, are believed to have been denied assistance under the law, including Turkey, Colombia and Mexico.\nProponents of applying the act to Israel point to the rising death toll in Gaza from military strikes on the territory, the displacement of more than 1 million people from their homes and a surging humanitarian crisis after Israeli authorities cut water, food, fuel and electricity supplies.\n“I am very concerned that our taxpayer dollars may be used for violations of human rights,” said the congressman Andre Carson of Indiana in an email to the Guardian, in which he accused Israel of “war crimes”, citing this week’s deadly bombing of the Jabalia refugee camp and the Israeli Defense Forces’ (IDF) alleged use of white phosphorus.\n“Last year, I voted to provide $3 billion dollars of strategic and security assistance to Israel. But we must absolutely make sure that none of those funds are used inappropriately, in violation of US law like the Leahy Act, or in violation of international law.”\nBut earlier this week, the Biden administration said it was not placing any limits on how Israel uses the weapons provided to it by the US. “That is really up to the Israel Defense Force to use in how they are going to conduct their operations,” a Pentagon spokesperson, Sabrina Singh, said on Monday. “But we’re not putting any constraints on that.”\nThe Israeli government and its prime minister, Benjamin Netanyahu, have so far not responded to calls for a humanitarian pause and have rejected calls for a ceasefire, as demanded by some progressive Democrats.\nJoe Biden promised a lavish military aid package to Israel in an Oval Office speech after visiting the country following the Hamas attack. US commandos are currently in Israel helping to locate an estimated 240 hostages, the number given by IDF, including American citizens, seized in the assault, the Pentagon has confirmed.\nCarson, one of three Muslims in Congress, said he previously raised concerns about possible Leahy Act violations last year after the shooting death of the US-Palestinian journalist Shireen Abu Akleh in the West Bank. An Israeli investigation subsequently admitted there was a “high probability” that she had been killed by Israeli gunfire, after initially blaming Palestinians.\nUsamah Andrabi, the communications director for Justice Democrats – a political action committee that helped elect leftwing House members nicknamed “the Squad”, which include some of Congress’s most vocal advocates for Palestinian rights – also invoked the Leahy legislation.\n“I think the Leahy Act should absolutely be looked into right now, when we are seeing gross violations of human rights,” he said. “[The Israelis] are targeting refugee camps, hospitals, mosques all under the guise of self-defense or that one or other member of Hamas is hiding there. It doesn’t matter whether Hamas is there or not, because you are targeting civilians. No amount of tax dollars should be justified for that.”\nView image in fullscreen Congresswoman Alexandria Ocasio-Cortez: ‘Deployment of white phosphorus near populated civilian areas is a war crime.’ Photograph: Drew Angerer/Getty Images\nLike Carson, Alexandria Ocasio-Cortez, one of the most high-profile members of “the Squad”, specifically identified the supposed use of white phosphorus – as claimed by Human Rights Watch (HRW) and Amnesty International – as a transgression that should disqualify Israel from receiving US assistance. The IDF had said it does not use white phosphorus against civilians, but didn’t clarify whether it was used at the time.\n“Deployment of white phosphorus near populated civilian areas is a war crime,” she said. “The United States must adhere to our own laws and policies, which prohibit US aid from assisting forces engaged in gross violations of human rights and international humanitarian law.”\nCongressional calls for scrutiny over US funding for Israel predate the current war in Gaza.\nLast May, Betty McCollum, a Democrat from Minnesota, introduced the Defending the Human Rights of Palestinian Children and Families Living Under Israeli Military Occupation bill, designed to prohibit US funds from being used to enforce Israeli occupation policies in the West Bank.\n“Not $1 of US aid should be used to commit human rights violations, demolish families’ homes, or permanently annex Palestinian lands,” McCollum said at the time. “The United States provides billions in assistance for Israel’s government each year – and those dollars should go toward Israel’s security, not toward actions that violate international law and cause harm.”\nThe bill, which has not passed, was co-sponsored by 16 other House Democrats – including some who have not supported the current calls for a ceasefire – and endorsed by 75 civil society groups, including Amnesty, HRW and J Street.\nMcCollum’s office did not respond to questions over whether she now supported extending her bill to Gaza or using the Leahy Act to block Biden’s emergency fund package.\nIn a speech on the Senate floor this week, the senator Bernie Sanders of Vermont called Israel’s Gaza campaign “morally unacceptable and a violation of international law” but stopped short of opposing Biden’s assistance program.\nInstead, he demanded a “clear promise” from Israel that displaced Palestinians will be allowed to return to their homes after fighting stops and for the abandonment of efforts to annex the West Bank, a territory claimed by Palestinians as part of a future state.\nView image in fullscreen Palestinians check the damages after a convoy of ambulances was hit, at the entrance of Shifa hospital in Gaza City on Friday. Photograph: Reuters\n“The United States must make it clear that these are the conditions for our solidarity,” he said.\nIn a letter to the Senate majority leader, Chuck Schumer, and the minority leader, Mitch McConnell, Sanders and five other Democratic senators – Elizabeth Warren, Jeff Merkley, Ed Markey, Peter Welch and Mazie Hirono – said they supported approving Biden’s proposed overall $106bn aid package to Israel, Ukraine and other foreign crisis areas “without delay”.\nBut they demanded that an equal sum be allocated to “domestic emergencies”, including childcare, primary health care and the opioid epidemic.\nA separate letter the six sent to Biden asks a series of searching questions about Israel’s invasion of Gaza.\n“We have serious concerns about what this invasion and potential occupation of Gaza will mean, both in terms of the long-term security of Israel and the well-being of the Palestinian residents of Gaza,” it says. “Congress needs more information about Israel’s long-term plans and goals, as well as the United States Government’s assessments of those prospects.”", "source_domain": "www.theguardian.com", "text": null, "title": "Leftist Democrats invoke human rights law in scrutiny of Israel military aid", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/nov/03/israel-aid-democrats-leahy-act-congress"}