{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:45:34", "date_modify": "None", "date_publish": "2023-11-03 19:08:39", "description": "It comes amid a devastating bombardment of Gaza in retaliation for the October 7 attacks on southern Israel by Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12708345%2FHundreds-pro-Palestinian-protesters-stage-sit-demonstration-Kings-Cross-Station-demand-ceasefire-Gaza-amid-Israeli-bombardment-despite-Transport-Secretary-banning-protest.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/03/19/77378591-0-image-a-30_1699038561013.jpg", "language": "en", "localpath": null, "maintext": "Hundreds of pro-Palestinian protesters on Friday staged a demonstration at London's King's Cross Station to call for a ceasefire.\nIt came amid a devastating bombardment and siege of Gaza in retaliation for the October 7 attacks on southern Israel by Hamas.\nBritish Transport Police last night confirmed two arrests had been made for 'failure to comply with a Section 14 notice' - prohibiting the planned protest.\nThe Transport Secretary cited a risk to train services in the decision to ban the event and said all in attendance would be subject to arrest.\nVideo shared on X, formerly known as Twitter, appeared to show police arresting protesters congregating in the station on Friday night.\nA little before 7pm, individuals purportedly at the sit-in said they had been moved outside by the police - and were continuing to demonstrate on the streets.\nPro-Palestine protesters perform a sit in at Kings Cross station on Friday evening as part of an ongoing series of demonstrations calling for a ceasefire in the Israel/Hamas conflict\nPro-Palestine protesters perform a sit in at Kings Cross station on Friday evening as part of an ongoing series of demonstrations calling for a ceasefire in the Israel/Hamas conflict\nThe protest came despite the Transport Secretary's attempt to ban it, citing disruption risk\nProtesters were seen with flags in the station before the demonstration was moved outside\nOne video posted on X, formerly known as Twitter, appears to show a man draped in a Palestinian flag shouting 'free, free Palestine' while being carried away from the station by three officers.\nOthers appear to show the controversial slogan 'from the river to the sea' being shouted with demonstrators replying 'Palestine will be free'.\nREAD MORE: Police brace for pro-Palestine 'Day of Action' as tens of thousands prepare to take to the streets tomorrow: Met will use facial recognition and social media 'analytics' to arrest hate protesters with more than 40 rallies organised across UK Protesters on Westminster Bridge last Saturday Advertisement\nIn videos, protesters can be seen sitting on the station concourse chanting 'ceasefire now', 'free, free Palestine' and 'in our thousands, in our millions, we are all Palestinians'.\nSome chanted 'let him go!' as one was detained by police.\nA banner accusing Israel of genocide can also be seen in some clips.\nLukas Slothuus, 33, an academic from London who attended the sit-in, told the PA news agency: 'Over 11,000 Palestinians have been killed by Israel and everyone should protest whenever they can at our government's complicity with the catastrophe Israel is causing.\n'The protest was huge, with many hundreds of Londoners, and it shows the popular opinion in support of calling for a ceasefire.'\nOn X, a Novara Media journalist claiming to be at the station reported: 'I've just got to King's Cross, and police are handing out printed notices telling people to move - despite the fact that protesters aren't disrupting anything.'\nMs Hymer shared what she said was a notice from police calling on protesters to move on.\nIt said there was in place, from 5pm to 11pm, 'an order prohibiting the holding of a trespassory assembly'.\nIt banned members of the public from 'gathering in groups of 20 or more with the intent to cause serious disruption to the provision of railway services or serious disruption to life of the community.\n'A person who organises or takes part in an assembly the holding of which he knows is prohibited by an order under section 14A is guilty of an offence.'\nAnother user replied: 'Seems like a welcome shift in policing these intimidating protests. At last.'\nCommenting on this evening's protest at Kings Cross Station, Transport Secretary Mark Harper said: 'While the right to peaceful protest is a key part of our democratic society, it cannot be at the expense of other people's right not to be seriously disrupted or intimidated.\n'That's why I have granted consent for the British Transport Police to make an order under Section 14A of the Public Order Act 1986 prohibiting the planned protest at Kings Cross Station this evening. This means protest activity at the station is classified as unlawful and anyone taking part will be subject to arrest.\n'Officers must have the powers they need for our stations to remain safe places for people to go about their journeys, protecting public safety and preventing disorder.'\nThe Metropolitan Police this evening confirmed to MailOnline that some 100 officers were supporting the British Transport Police in managing the situation at King's Cross.\nBritish Transport Police confirmed just after 7:20pm that the protest in the station had ended and a small group had moved outside.\n'Passengers can access the station as normal and trains are not disrupted,' a statement read.\nEarlier this evening, Sean O'Callaghan, assistant chief constable with the British Transport Police, said: 'We fully respect the rights of people to protest lawfully but where we believe this could cause serious disruption to railway services, we must take action...'\n'We continue to work closely with our partners to manage the impact of protests for those who travel on the railways.'\nThe protest came as Israeli Prime Minister Benjamin Netanyahu earlier today ruled out a temporary ceasefire in Gaza until hostages are released.\nMore than 200 were reportedly taken after Hamas - the de facto governing authority in Gaza - swept into Southern Israel and attacked civilians and military personnel.\nIsrael has responded with a siege of Gaza and made repeated raids into the beleaguered territory.\nThe Israel Defense Forces (IDF) have also been condemned for attacks on civilian areas and strikes killing combatants - as well as the alleged use of White Phosphorous on the civilian population.\nToday, the Israeli military confirmed it targeted an ambulance outside Gaza's largest hospital.\nThe IDF claimed it was being used by Hamas militants while health officials said it was transporting the wounded.\nIsraeli 'aircraft struck an ambulance that was identified by forces as being used by a Hamas terrorist cell in close proximity to their position in the battle zone,' a military statement said.\nWorld Health Organization chief Tedros Adhanom Ghebreyesus said he was 'utterly shocked' by a deadly Israeli strike on an ambulance near Gaza's largest hospital on Friday.\nGhebreyesus said he was 'utterly shocked by reports of attacks on ambulances evacuating patients close to Al-Shifa hospital in Gaza, leading to deaths, injuries and damage'.\n'We reiterate: patients, health workers, facilities and ambulances must be protected at all times. Always,' the WHO chief wrote on X, formerly Twitter.\nAs the war rages on, calls have increasingly come from outside of the southern Levant to arrange a ceasefire.\nQatari mediators are among those working to agree terms, including the release of hostages.\nA number of captives have been freed by Hamas in recent weeks - and Israel has allowed some humanitarian aid to enter the Strip via the southern border with Egypt.\nProtesters called for a ceasefire amid Israel's devastating bombardment of the Gaza Strip\nPro-Palestine protesters perform a sit in at Kings Cross station on Friday evening as part of an ongoing series of demonstrations calling for a ceasefire in the Israel/Hamas conflict\nThe protests comes despite a ban by the Transport Secretary , who cited a risk to train services in the decision\nOnly on Tuesday, demonstrators locked down London's Liverpool Street Station with a similar protest.\nPictures and videos posted on X shows the crowd of protesters chanting, cheering and clapping. Many were waving large Palestinian flags inside the station.\nDemonstrators could also be heard shouting: 'Palestine will be free.'\nAt the protest on Tuesday, Hundreds of campaigners chanted: 'What do we want? Ceasefire. When do we want it? Now.'\nPolice officers were filmed attempting to move commuters along as curious onlookers stopped to see what was happening at the sit-down protest.\nSisters Uncut, a feminist group who organised the protest, posted on X: 'Sit-in taking over Liverpool Street Station in solidarity with the Palestinian people - no business as usual until genocide ends. Ceasefire now.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hundreds of pro-Palestinian protesters stage sit-in demonstration in King's Cross Station and demand ceasefire for Gaza amid Israeli bombardment - as police arrest two demonstrators after protest was", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12708345/Hundreds-pro-Palestinian-protesters-stage-sit-demonstration-Kings-Cross-Station-demand-ceasefire-Gaza-amid-Israeli-bombardment-despite-Transport-Secretary-banning-protest.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}