{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com"], "date_download": "2024-02-05 15:45:36", "date_modify": "None", "date_publish": "2023-11-03 01:08:39", "description": "Wagner is sending the Hezbollah the Russian SA-22 Greyhound system, which uses surface-to-air missiles and anti-aircraft artillery to intercept aircraft, two US officials said Thursday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12704883%2FRussias-Wagner-Group-Hezbollah-air-defense-Israel-Hamas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/03/01/77345709-0-image-a-24_1698973506955.jpg", "language": "en", "localpath": null, "maintext": "Russia's paramilitary Wagner Group plans to provide advanced anti-aircraft defense systems to Hezbollah for deployment near Israel's northern border, according to a new report.\nWagner wants to send the Iran-backed Hezbollah terror group the Russian SA-22 Greyhound system, which uses surface-to-air missiles and anti-aircraft artillery to intercept aircraft, two US officials told the Wall Street Journal on Thursday.\nHezbollah, a US-designated terror group backed by Iran, has been exchanging fire with Israeli forces across the country's northern border while Israel wages a ground and air war against Hamas in the southern enclave of Gaza.\nThe new air defense systems would undoubtedly escalate tensions in the region where Israel's air force is able to operate with relative impunity as Hamas and Hezbollah lack the hardware to shoot its aircraft out of the skies.\nPentagon spokesman Brig. Gen. Pat Ryder told the Journal that the report was 'very concerning' if true.\nFighters from the Lebanese terror group Hezbollah are seen training in a file photo. Russia's Wagner Group reportedly plans to provide anti-aircraft defense systems to Hezbollah\nRussian Pantsir-S1 (NATO reporting name SA-22 Greyhound) units are seen in Moscow during a 2012 parade. The system uses both surface-to-air missiles and anti-aircraft artillery\nRussia's DC embassy and the US National Security Council did not immediately respond to requests for comment from DailyMail.com on Thursday night.\nOne official told they Journal that it wasn't clear whether the anti-aircraft system had already been delivered, but officials said they were monitoring talks between Wagner and Hezbollah, and considered the issue one of major concern.\nWagner Group, which launched a failed mutiny against Russian leader Vladimir Putin in June, is a state-financed private military company previously led by Yevgeny Prigozhin.\nPrigozhin died in a plane crash in August, in what US intelligence assessed was a likely a Russian-backed assassination, and his 25-year-old son Pavel Prigozhin has reportedly taken command of the organization.\nThe Greyhound anti-aircraft system, a NATO designation for what Russia calls the Pantsir-S1, could give Hezbollah advanced capabilities to repel Israeli aircraft, cruise missiles, and precision munitions.\nRussian developers claim that it is capable of engaging stealthy jets, such as the F-22 and F-35. The latter is the most advanced fighter jet deployed by the Israelis.\nThe Greyhound system consists of a missile launcher, radar truck, and command post, and is designed for point air defense against manned and unmanned aircraft, as well as some missiles.\nDelivery of the system could raise tensions on Israel's northern border, where Israeli Defense Forces (IDF) troops have been exchanging fire with Hezbollah.\nSince the death of Wagner Group leader Yevgeny Prigozhin (left) in August, the group has reportedly been led by his 25-year-old son Pavel Prigozhin (right)\nThe Greyhound anti-aircraft system (above), a NATO designation for what Russia calls the Pantsir-S1, could give Hezbollah advanced capabilities to repel Israeli aircraft\nThe system consists of a missile launcher (above), radar truck, and command post, and is designed for point air defense against aircraft, as well as some missiles\nHezbollah fighters are seen with more primitive artillery in a file photo. The group has exchanged fire with Israel repeatedly in recent weeks\nIsrael, which has launched a ground assault against Hamas in Gaza, hopes to avoid opening a second front in the war on its northern border.\nThe US has positioned the USS Gerald R. Ford aircraft carrier strike group in the Eastern Mediterranean in a bid to deter Iran and Hezbollah from further aggression.\nThe USS Dwight D. Eisenhower aircraft carrier and its strike group are also in the Eastern Mediterranean, and are expected to transit the Suez Canal this weekend on its way to the Middle East.\nOn Thursday, there was a major escalation along the Lebanon-Israel border with Hezbollah attacking Israeli positions with drones, mortar fire and suicide drones.\nHezbollah reportedly attacked 19 Israeli posts along the border, including one that was struck with two suicide drones.\nThe Israeli military said it had retaliated with warplanes and helicopter gunships on Hezbollah command centers, arms depots and sites from where the rockets were fired.\nTwo people were injured after rockets fired from Lebanon hit the northern Israeli town of Kiryat Shmona, Israeli medical services said.\nIsraeli police inspect the scene of a rocket strike in the Israeli border town Kiryat Shmona, Israel on Thursday\nIsraeli rescuers and firefighters check the debris of burnt out vehicles following a rocket attack from southern Lebanon on the Israeli city of Kiryat Shmona in northern Israel on Thursday\nAn Israeli artillery unit fires during a military drill in the annexed Golan Heights near the border with Lebanon on Thursday. Lebanon's southern border has seen tit-for-tat exchanges, mainly between Israel and Hamas ally Hezbollah, since Hamas launched its October 7 attack\nChadia Kaddouh, stands amid rubble of her house that was destroyed by what she said was Israeli shelling, in the southern town of Yater, Lebanon on Wednesday\nVideos released by the fire department and circulating on social media showed a street ablaze, a wrecked car and a damaged building in the town that had been mostly evacuated at the beginning of the Israel-Hamas war.\nLebanon's state-run National News Agency also said four civilians were killed on Thursday in an Israeli bombardment of the Saluki Valley region, a border area in southern Lebanon.\nThe latest deaths raise to 10 the number of civilians killed on the Lebanese side of the border since tension began to rise there following the October 7 Hamas attack in southern Israel, which left 1,400 Israelis dead.\nIsrael has responded with relentless airstrikes in Gaza, which the enclave's Hamas-run heath authority say have now killed more than 9,000 people, including many children. Hamas does not distinguish between civilians and combatants in casualty figures.\nThe IDF on Thursday continued to expand its ground war against Hamas in Gaza, where around 240 hostages were taken from Israel into Gaza by the militant group.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Russia's Wagner Group 'plans to give Hezbollah high tech air-defenses' to deploy along the border with Israel in 'major concern' to US intelligence", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12704883/Russias-Wagner-Group-Hezbollah-air-defense-Israel-Hamas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}