{"authors": ["Katherine Fidler", "Lucia Botfield"], "date_download": "2024-02-05 15:45:37", "date_modify": "None", "date_publish": "2023-11-03 16:14:00", "description": "WhatsApp’s AI sticker generator has been found to create images of a young boy and a man with guns when given Palestine-related prompts.", "filename": "https%3A%2F%2Fmetro.co.uk%2F2023%2F11%2F03%2Fwhatsapp-ai-creates-images-of-gun-wielding-boy-from-palestine-prompts-19768060%2F.json", "image_url": "https://metro.co.uk/wp-content/uploads/2023/10/GettyImages-1244052147_1699028658.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "language": "en", "localpath": null, "maintext": "WhatsApp’s AI sticker generator has created an image of a boy with a rifle following a Palestine-related prompt\nWhatsApp’s AI sticker generator has been found to create images of a young boy and a man with guns when given Palestine-related prompts – while a search for ‘Israel army’ returned pictures of soldiers smiling and praying.\nAn investigation by the Guardian revealed the prompts returned the same results for a number of different users.\nSearches by the paper found the prompt ‘Muslim boy Palestine’ generated four images of children, one of which is a boy holding an AK-47 style rifle. The prompt ‘Palestine’ returned an image of a hand holding a gun.\nOne WhatsApp user also shared screenshots showing a search for ‘Palestinian’ resulted in an image of a man with a gun.\nA source said employees at WhatsApp owner Meta have reported the issue and escalated it internally.\nWhatsApp’s AI image generator, which is not yet available to all, allows users to create their own stickers – cartoon-style images of people and objects they can send in messages, similar to emojis.\nA search for ‘Palestinian’ generated an image of a man with a gun\nWhen used to search for ‘Israel’, the tool showed the Israeli flag and a man dancing, while explicitly military-related prompts such as ‘Israel army’ or ‘Israeli defense forces’ did not include any guns, only people in uniforms, including a soldier on a camel. Most were shown smiling, one was praying – but was flanked by swords.\nA search for ‘Israeli boy’ returned images of children smiling and playing football. ‘Jewish boy Israeli’ showed two boys wearing necklaces with the Star of David, one standing, and one reading while wearing a yarmulke.\nAddressing the issue, Meta spokesperson Kebin McAlister told the paper: ‘As we said when we launched the feature, the models could return inaccurate or inappropriate outputs as with all generative AI systems.\n‘We’ll continue to improve these features as they evolve and more people share their feedback.’\nA search for theIsrael army did not return any guns\nIt is not the first time Meta has faced criticism over its products during the conflict.\nInstagram has been found to write ‘Palestinian terrorist’ when translating ‘Palestinian’ followed by the phrase ‘Praise be to Allah’ in Arabic posts. The company called it a ‘glitch’ and apologised.\nMany users have also reported having their content censored when posting in support of Palestinians, noting a significant drop in engagement.\nInstagram users complain of Palestine shadow bans As the Israel-Hamas war continues, many Instagram users have been ‘reposting’ content on their stories to inform their followers with information such as upcoming protests, petitions and letters to send to their MPs, writes Lucia Botfield. However, those expressing support for Palestine have witnessed a drastic drop in engagement – with up 98% fewer views seen in some cases. ‘Every time I post about Palestine this happens, even a few years back,’ said one user who has been affected by the algorithmic issue. To get around this, they said the only way was to ‘share some personal content’, as it ‘tricks’ Instagram into getting your views up again. Last year supermodel Bella Hadid shared that she has also been affected by the issue, known as ‘shadow banning’. ‘My Instagram has disabled me from posting on my story – pretty much only when it is Palestine based I’m going to assume,’ she said. ‘When I post about Palestine I get immediately shadow banned and almost 1 million less [sic] of you see my stories and posts.’ Instagram stories supporting Palestine have been shown to receive lower views than other content Ms Hadid, whose father is Palestinian and was born in Nazareth, is a vocal supporter of the Free Palestine movement – and has reportedly suffered a loss of brand deals as a result. An investigation by Metro.co.uk verified that posts featuring pro-Palestine views received only a fraction of the views compared to normal, reposting on a number of occasions and generating the same result.\nIn a statement, Meta said that ‘higher volumes of content being reported’ during the conflict, ‘content that doesn’t violate our policies may be removed in error’.\nA study commissioned by Meta into Facebook and Instagram found during attacks on Gaza in May 2021 its own policies ‘appear to have had an adverse human rights impact … on the rights of Palestinian users to freedom of expression, freedom of assembly, political participation, and non-discrimination, and therefore on the ability of Palestinians to share information and insights about their experiences as they occurred.’\nMORE : Fake news spreads like wildfire after Israel attacks\nMORE : X under fire over spread of ‘terrorist content and hate speech’\nMORE : Bella Hadid finally speaks on Gaza and Israel terror attack: ‘Forgive me for my silence’", "source_domain": "metro.co.uk", "text": null, "title": "WhatsApp's AI has shocking ideas about Palestinian children", "title_page": null, "title_rss": null, "url": "https://metro.co.uk/2023/11/03/whatsapp-ai-creates-images-of-gun-wielding-boy-from-palestine-prompts-19768060/"}