{"authors": ["Rob Crilly", "Senior U.S. Political Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:45:38", "date_modify": "None", "date_publish": "2023-11-03 18:09:54", "description": "The U.S. Navy said it had fired 'lethal munitions' from an unmanned vessel for the first time in international waters in the Middle East in an exercise it said took its capabilities to the 'next level.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12707803%2FNavy-launches-missile-robot-boat-Middle-East-Pentagon-releases-video-test-unmanned-vessel-strike-deadly-precision.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/03/18/77374791-0-image-m-15_1699034976959.jpg", "language": "en", "localpath": null, "maintext": "The U.S. Navy said it had fired 'lethal munitions' from an unmanned vessel for the first time in international waters in the Middle East in an exercise it said took its capabilities to the 'next level.'\nA target boat was destroyed in the drill, which was captured on video.\nIt was carried out last month by U.S. Naval Forces Central Command (NAVCENT) Task Force 59, the Navy's first unmanned and artificial intelligence task force.\nExercise Digital Talon was conducted in international waters surrounding the Arabian Peninsula.\n'We are focused on the operational application of new, cutting-edge unmanned systems and artificial intelligence technologies,' said Vice Adm. Brad Cooper, Navcent's commander.\nThe U.S. Navy said Thursday it had fired 'lethal munitions' from an unmanned vessel for the first time in international waters in the Middle East, destroying a target boat\n'During Digital Talon, we took a significant step forward and advanced our capability to the \"next level\" beyond just maritime domain awareness, which has been a traditional focus with Task Force 59.\n'We have proven these unmanned platforms can enhance fleet lethality. In doing so, we are strengthening regional maritime security and enhancing deterrence against malign activity.'\nThe video shows an unmanned 38ft twin-hulled speedboat, equipped with two outboard motors, plowing through the waves.\nTwo naval operators monitor the operation from a remote location.\nOnce the target is acquired, the 'lethal miniature aerial missile system' is activated, firing a projectile. The video shows it homing in on the target, destroying it.\nIn a statement, the Navy said it scored direct hits during multiple tests.\nAnd it said it was the second time in recent weeks it had demonstrated advanced unmanned capabilities in the region.\nOnce the target is acquired, the 'lethal miniature aerial missile system' at the rear of the U.S. Navy MARTAC T38 Devil Ray USV is activated, firing missiles\nThe missile homes in on the target boat\nWhich is destroyed in what the US Navy said was a successful test\nIt said that in September unmanned underwater surface and aerial vehicles were able to track Iranian Navy and Islamic Revolutionary Guard Corps Navy ships and small boats over several days during routine patrols in and around the Strait of Hormuz.\nTask Force 59 has tested 15 different types of drones, according to Capt. Colin Corridan, its commander.\n'We have a kind of a startup mentality here,' he told Defense One in a recent interview. 'We try to really create an environment where innovation is key, and ideas are coming from every level of the organization, because otherwise I think we would seriously be missing out.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Navy launches missile from robot boat in the Middle East: Pentagon releases video of test from unmanned vessel that can strike with deadly precision", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12707803/Navy-launches-missile-robot-boat-Middle-East-Pentagon-releases-video-test-unmanned-vessel-strike-deadly-precision.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}