{"authors": ["Helen Sullivan", "Léonie Chao-Fong", "Ashifa Kassam", "Jonathan Yerushalmy"], "date_download": "2024-02-05 15:45:40", "date_modify": "None", "date_publish": "2023-11-03 05:06:32", "description": "This blog is closed.Israel and Hamas at war: what we know on day 28", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F02%2Fisrael-hamas-war-live-updates-gaza-jabalia-refugee-camp-strikes-today-latest-news.json", "image_url": "https://i.guim.co.uk/img/media/6b35ade7029aa3b4915aba38fc02b1d9f3d9bb28/0_419_5082_3050/master/5082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5de23f8f01bbe8868e13065a25ac7a7b", "language": "en", "localpath": null, "maintext": "From 2 Nov 2023 22.00 CET Israeli troops have 'completed the encirclement of Gaza City', says IDF Israeli forces are fighting “with full force” in Gaza and focused on “destroying” Hamas and “making every effort” to bring all of the hostages home, Israel Defense Forces (IDF) spokesperson Daniel Hagari said. A statement from Hagari on Thursday said IDF troops “completed the encirclement of Gaza City, which is the focal point of the Hamas terror organisation”. Israeli forces are “killing terrorists in close combat, in any place in which fighting is required”, he said.\nUpdated at 22.06 CET\n3 Nov 2023 05.35 CET Troops ‘completed the encirclement of Gaza City’, says IDF Here is another look at the IDF’s announcement that it has “completed the encirclement of Gaza City” via AFP: Israeli ground troops encircled Hamas stronghold Gaza City on Friday, after close ally the United States urged “concrete steps” to minimise civilian casualties. Ahead of top US diplomat Antony Blinken’s scheduled visit to Israel Friday, the country’s military said it had “completed the encirclement” of Gaza’s largest city – signalling a new phase in the month-long war against Hamas. Israel’s military describes Gaza City as “the centre of the Hamas terror organisation”. But it is also home to some half a million Palestinians who have endured weeks of withering aerial bombardments, dwindling supplies and daily bloodshed on an unprecedented scale. Outside Gaza City’s Al-Quds hospital, displaced residents seeking shelter from Israeli strikes told AFP that civilians would not withstand the barrage much longer. “This is not a life. We need a safe place for our kids,” said 50-year-old Hiyam Shamlakh.\n“Everybody is terrified, children, women and the elderly.” The conflict is turning to urban and underground warfare, with Hamas fighting from a tunnel complex believed to span hundreds of kilometres. A new video posted by Hamas sought to illustrate the devastating impact of its underground network, with a gunman seemingly emerging from a tunnel to plant an explosive on a nearby and unsuspecting Israeli tank. The Ezzedine Al-Qassam Brigades, the military wing of Hamas, insisted invading Israeli soldiers would go home “in black bags”. “Gaza will be the curse of history for Israel,” spokesman Abu Obeida said.\n3 Nov 2023 05.22 CET Prime Minister Benjamin Netanyahu told group of elite soldiers on Thursday that Israeli forces were “advancing” despite “painful losses”, AFP reports. “We are in the midst of the campaign. We have very impressive successes” he said at a base near Tel Aviv. “We are already more than on the outskirts of Gaza City. We are advancing.”\n3 Nov 2023 05.05 CET Johana Bhuiyan A WhatsApp feature that generates images in response to users’ searches returns a picture of a gun or a boy with a gun when prompted with the terms “Palestinian”, “Palestine” or “Muslim boy Palestinian”, the Guardian has learned. The search results varied when tested by different users, but the Guardian verified through screenshots and its own tests that various stickers portraying guns surfaced for these three search results. Prompts for “Israeli boy” generated cartoons of children playing soccer and reading. In response to a prompt for “Israel army” the AI created drawings of soldiers smiling and praying, no guns involved. Meta’s own employees have reported and escalated the issue internally, a former Meta employee with knowledge of the discussions said. WhatsApp’s AI shows gun-wielding children when prompted with ‘Palestine’ Read more\n3 Nov 2023 04.46 CET US calls for ‘temporary, localized’ pauses in Israel-Hamas war In case you missed this earlier: US President Joe Biden is calling for humanitarian pauses in the Israel-Hamas conflict that would involve a “temporary, localised” cessation of hostilities - well short of a general ceasefire – a senior White House official said Thursday. At a campaign event on Wednesday Biden was urged by a member of the audience to call for a ceasefire in the war. Biden replied: “I think we need a pause.” Talking to reporters Thursday National Security Council spokesman John Kirby clarified what such a pause would entail. “A humanitarian pause... is temporary, localized and focused, focused on a particular objective or objectives, humanitarian aid in, people out,” Kirby said. He added: “The general idea is that in that geographic space, for that limited time, there would be a cessation of hostilities, enough to allow whatever it is you’re trying to allow.” The White House has previously called for “humanitarian pauses” to allow aid to be delivered into Gaza or to carry out evacuations, but has so far refused to discuss a ceasefire, believing it would exclusively play into the hands of Hamas.\n3 Nov 2023 04.37 CET Hezbollah on Wednesday published a letter from its fighters addressed to Palestinian groups in Gaza, saying they had their “finger with you on the trigger... to support Al-Aqsa mosque and our oppressed brothers in Palestine”, AFP reports. The Shiite Muslim group has mainly restricted itself to targeting Israeli observation posts, military positions and vehicles near the border as well as drones, using what it says have been anti-tank missiles, guided missiles and even surface-to-air missiles. Israel has responded by bombing sites along the border, while drones have targeted fighters near the frontier. The border tensions have revived memories of Hezbollah’s devastating 2006 war with Israel that killed more than 1,200 people in Lebanon, mostly civilians, and 160 in Israel, largely soldiers.\n3 Nov 2023 04.26 CET More now on what analysts expect ahead of Nasrallah’s speech, via AFP: Some analysts believe that Hezbollah has little interest in becoming fully embroiled in a conflict that Israeli officials have threatened could destroy Lebanon. Others say the decision lies with Iran, which leads the regional “axis of resistance” against Israel, which alongside Hezbollah includes armed groups from Syria, Iraq and Yemen, some of which have attacked Israel and US interests in the region in recent weeks. How Iran uses proxy forces across the region to strike Israel and US Read more But Amal Saad, a Hezbollah expert at Cardiff University, said: “Hezbollah is not a proxy of Iran, it’s an ally of Iran ... Hezbollah doesn’t need anyone’s permission to intervene.” “Hezbollah has much more experience obviously fighting Israel than Iran does - Iran has not had a direct confrontation with Israel,” Saad added.\n3 Nov 2023 04.09 CET Hezbollah leader to speak on Friday AFP reports that Lebanon’s Hezbollah leader, Hassan Nasrallah, will speak on Friday, in his first comments since 7 October. Lebanon’s southern border has seen escalating tit-for-tat exchanges in recent weeks, mainly between Israel and Iran-funded Hezbollah, a Hamas ally, stoking fears of a broader conflagration. The cross-border attacks heated up on Thursday, as Israel responded with a “broad assault” after Hezbollah attacked 19 Israeli positions simultaneously, according to the group. View image in fullscreen Hezbollah flags flutter atop a poster depicting Lebanon’s Hezbollah leader Sayyed Hassan Nasrallah, in Kfarchouba, near the border with Israel, southern Lebanon 8 October 2023. Photograph: Aziz Taher/Reuters Rockets also hit the Israeli town of Kiryat Shmona near the border in a barrage claimed by the Lebanese section of Hamas’s armed wing. Nasrallah’s highly anticipated speech will be broadcast as part of an event in Beirut’s southern suburbs, a Hezbollah stronghold, at 3pm (13.00 GMT) on Friday, in memory of fighters killed in Israeli bombardments. Iranian foreign minister Hossein Amir-Abdollahian has warned that “the region is like a powder keg” and that “anything is possible” if Israel does not stop attacking Gaza. US national security council spokesman John Kirby told reporters, “I don’t believe we’ve seen any indication yet specifically that Hezbollah is ready to go in full force. So we’ll see what he has to say.”\nUpdated at 04.10 CET\n3 Nov 2023 04.00 CET Reuters reports that Chilean President Gabriel Boric, who this week condemned Israeli military’s air bombardment of Gaza and recalled his envoy to Israel, on Thursday said he told President Joe Biden that Israel’s actions were violating international law. Boric said he condemned the 7 October attack on Israel by the Hamas militant group that killed 1,400 people, and called for the release of Israeli hostages, but added Israel’s retaliatory bombardment of Gaza had been disproportionate and was violating international law. “These Hamas attacks are without justification, they deserve global condemnation, but the response by Benjamin Netanyahu’s government also deserves our clearest condemnation,” he told reporters after his meeting with Biden at the White House. There’s no doubt we can say the response has been disproportionate and is violating international humanitarian law,” he said. “The right of a state to defend itself has limits, and those limits imply respecting the lives of innocent civilians, especially children, and respecting civil humanitarian law.” Asked about Biden’s response, Boric said it was not his place to speak for the American president. The White House issued a statement later on Thursday that said Biden had “reaffirmed our continued efforts to urgently increase and sustain the delivery of life-saving humanitarian assistance * including food, water, and medical care * to civilians in Gaza.” View image in fullscreen US President Joe Biden meets with Chile's President Gabriel Boric in the Oval Office Photograph: Andrew Caballero-Reynolds/AFP/Getty Images\n3 Nov 2023 03.40 CET Four Indonesians evacuated from Gaza Indonesia’s Foreign Minister Retno Marsudi said on Friday that four Indonesians and one wife of an Indonesian national had been evacuated from Gaza on 2 November.\nThe evacuees had arrived in Cairo, she said in a press conference.\n3 Nov 2023 03.35 CET Here is another profile of one of the 3,760 children killed by Israeli strikes on Gaza, from the Associated Press: Aseel Hassan, 13 years old\nAseel Hassan was an excellent student, said her father, Hazem Bin Saeed. She devoured classical Arabic poetry, memorizing its rigid metric and rhyme scheme, and reveling in its mystical images and metaphors.\nDuring the war, when Israeli bombardments came so close that their walls shook, she would regale her relatives by reciting famous verses from Abu Al Tayyib al-Mutanabbi, a 10th-century Iraqi poet, her father said. ‘When I asked her what she wanted to do when she grew up, she would say, read,’ said 42-year-old Bin Saeed. ‘Poems were Aseel’s escape.’ An airstrike on 19 October leveled his three-story home in Deir al-Balah, killing Aseel and her 14-year-old brother, Anas.\nUpdated at 03.36 CET", "source_domain": "www.theguardian.com", "text": null, "title": "WHO says ‘almost impossible’ to bring aid into Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/02/israel-hamas-war-live-updates-gaza-jabalia-refugee-camp-strikes-today-latest-news"}