{"authors": ["Jason Burke", "Sufian Taha"], "date_download": "2024-02-05 15:16:46", "date_modify": "None", "date_publish": "2024-01-21 07:00:22", "description": "With the IDF now routinely using armed drones to watch and target militants, the worst wave of violence for almost 20 years is sweeping the West Bank", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F21%2Fbattle-on-third-front-palestinians-in-west-bank-vow-to-fight-on-after-israeli-raids.json", "image_url": "https://i.guim.co.uk/img/media/f407e80d3f6123f1629120bb10183b118cd69dbf/0_0_3955_2373/master/3955.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=73ec4e24c356e86c6b66c98aa695559c", "language": "en", "localpath": null, "maintext": "For days earlier this month, many of the young men of Nur Shams refugee camp on the outskirts of the town of Tulkarm in the occupied West Bank were engaged in a potentially lethal race against time.\nScaling precarious ladders, they stretched between rooftops vast plastic sheets used in more peaceful times to collect the olive harvest. Soon, hundreds of metres of winding lanes were in deep shadow, the sun and the sky obscured. The hill behind the buildings, from which you can see the Mediterranean less than 20km away, was no longer visible.\n“Hamas have their tunnels in Gaza. We now have ours too,” said one resident, who guided the Observer through the camp.\nThese “tunnels” may not be as deep, expensive or robust as those of Hamas, which governed Gaza for 17 years and invested huge sums in an underground network that extends for hundreds of kilometres under the territory. But they are almost as effective in blunting Israeli efforts to deploy its potent air power against enemies.\nWith the Israel Defense Forces (IDF) now routinely using armed drones to watch and target militants, the young men were hurrying in the knowledge that their tunnels would soon be needed.\nSince the bloody surprise attacks launched by Hamas from Gaza into southern Israel, killing 1,200, mostly civilians, the worst wave of violence for almost 20 years has swept the West Bank, with 358 Palestinians and five Israelis killed across the territory.\nMany of these have died in a series of massive raids launched by the IDF against strongholds of armed Palestinian factions. Convoys of armoured vehicles carrying hundreds of troops have rolled into Jenin, Nablus and other towns in the West Bank. Massive waves of detention, often without charge, have swept thousands into Israeli jails.\nIsraeli analysts and senior military officers have described the West Bank as Israel’s “third front” after Gaza and the confrontation with Hezbollah, the Lebanon-based Islamist militant organisation across its disputed northern border.\nA senior Israeli military officer told the Observer last month that both raids and detentions were essential to rooting out networks planning attacks on Israeli civilians. Last week, two Palestinians were arrested in the West Bank in connection with a car ramming that killed one and injured 17 about 20 miles near Tel Aviv.\n“When we go in we get hit by hidden homemade bombs and if they fire on us, we fire back,” he said.\nMany analysts blame the raids, harsh economic conditions, a security clampdown and a surge in violence by extremist Jewish settlers in the West Bank for the new violence. They argue destruction accompanying the raids feeds radicalisation and recruitment to armed factions.\nIn Nur Shams camp, the damage done during a recent Israeli operation was clear. Hundreds of metres of the main highway outside the camp had been destroyed. So too had the road into the camp. Where a social and sports club once stood, there was rubble. A wedding hall had been half reduced to ruins. Walls were pocked with shrapnel and bullet scars. Water pipes were shattered and electricity lines trailed.\nOutside one house, its front wall torn away, the owner shrugged.\n“I saw the bulldozer coming and ran with my family. When we got back it was like this. We were just in the way,” he told the Observer.\nIsraeli officials say the bulldozers are used to unearth buried homemade bombs.\nView image in fullscreen Israeli forces carry out a raid in the West Bank town of Tulkarm on 17 January. Photograph: Alaa Badarneh/EPA\nA few hundred metres away, Ahmed Ishad, 25, showed the charred interior of his bakery, where much of his equipment had been destroyed by a fire ignited by an Israeli drone-fired missile that hit nearby.\nFawzi Shahada, who owns a toy shop in the camp, said troops had raided his home looking for weapons. “They smashed everything and ordered me to clean a picture of a gun drawn by my children off a wall,” the 63-year-old said.\nDuring the raid, many men were rounded up, handcuffed, blindfolded and transported to a military base, where they were held outside for between 24 and 48 hours, several claimed.\nMany fighters have been recruited from families with long histories of violent activism. The first inhabitants of refugee camps such as Nur Shams were forced to leave their homes during the wars surrounding Israel’s creation in 1948. Since the West Bank was taken from Jordan by Israel in 1967, there have been successive uprisings, known as intifadas, against the occupation. Current levels of violence are approaching that of the years 2000 to 2005.\nMore than 30 have been killed in Nur Shams since 7 October by air strikes and in raids. Local people claim that only two were involved in the “Resistance” – a claim dismissed as laughable by Israeli officials.\nLast week, the IDF launched new raids in Tulkarm causing further damage. Israeli military officials said they seized more than 400 explosive devices, 27 weapons, and several senior members of a local terror network. An Israeli soldier was seriously wounded.\nOne operation targeted the Nur Shams camp. In all, at least eight Palestinians were killed and a dozen injured, raising the overall death toll across the West Bank last Wednesday to the highest single daily total for many months.\nArmed factions such as Palestine Islamic Jihad (PIJ), an ally and sometime rival of Hamas, maintain a powerful grip on the camps. Two men who were accused of collaborating with Israeli security services were executed in public in Tulkarm in November, their bodies thrown over a wall after an abortive effort to hang them from an electricity pole.\nWhen asked who was paying for the large quantities of plastic sheeting, militants said the community would “donate”.\nLike many in the West Bank, militants are scathing about the Palestinian Authority (PA), set up to administer parts of the territory and Gaza following the peace process of the 1990s.\n“We are not fighting the PA so far but they should support us or step aside,” said Abu Adir, a commander of PIJ, the dominant local armed faction.\nSpeaking in a lane deep in the camp, Abu Adir said that the raids would not deter him or other militants.\n“What hurts us is that we are away from our homeland,” the 38-year-old said. “Our path is that of Gaza, towards liberation from the river to the sea.”\nSpeaking as the raid continued last week, R Adm Daniel Hagari, a senior IDF spokesperson, said the IDF would “continue to act to thwart terror wherever required”.", "source_domain": "www.theguardian.com", "text": null, "title": "Battle on ‘third front’: Palestinians in West Bank vow to fight on after Israeli raids", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/21/battle-on-third-front-palestinians-in-west-bank-vow-to-fight-on-after-israeli-raids"}