{"authors": [], "date_download": "2024-02-05 15:45:42", "date_modify": "None", "date_publish": "2023-11-02 14:16:39", "description": "Rights groups say in new reports that security forces and armed groups are committing alleged war crimes against civilians in Africa’s Sahel region where extremists and rebels are increasingly fighting to exert dominance and control resources in communities", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-burkina-faso-amnesty-international-human-rights-watch-mali-b2440495.html.json", "image_url": "https://static.independent.co.uk/2023/11/02/14/Sahel_Violence_War_Crimes_52384.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nSecurity forces and armed groups are committing war crimes against civilians in Africa's Sahel region, where extremists and rebels are increasingly fighting to exert dominance and control resources in communities, according to new reports from two rights groups.\nCivilians are increasingly being killed, abducted or abused, including in Burkina Faso, where jihadi groups have fought for many years, and Mali, where militants and ethnic rebels are expanding their reach, Human Rights Watch and Amnesty International said.\nThe Amnesty report was released on Thursday, while the HRW one came out on Tuesday.\nSpread across the vast arid expanse south of the Sahara Desert, the Sahel region has been a hot spot for violent extremism, with armed groups often taking advantage of little or no government and security presence to target helpless communities.\nBut the conflict has worsened in recent months and analysts blame the trend on the absence of institutional reforms, failed peace efforts as well as rampant coups by militaries in places like Burkina Faso and Mali. The violence also includes alleged war crimes, which rights groups say are often covered up.\nIn Mali, both the armed forces and extremist rebels have killed and abused numerous civilians in the country’s central and northern regions for allegedly collaborating with either side of the conflict, Human Rights Watch said in its report. Malian security forces were responsible for at least 40 civilian deaths, nearly half of whom were children, the report said.\n“The targeted killing of civilians by Islamist armed groups and the Malian army are war crimes that should be thoroughly and impartially investigated,” Ilaria Allegrozzi, senior Sahel researcher at Human Rights Watch, said in the report based on interviews with 40 people, including more than 30 witnesses.\nHRW's findings were communicated to Mali’s justice and defense ministers who never responded, the group said.\nIn Burkina Faso, where HRW had previously accused the military of war crimes, Amnesty said it found that the Ansaroul Islam extremist group and other armed groups are killing and abducting women and girls, while also disrupting key infrastructure in communities to carry out “brutal sieges.”\n“They have not only enforced sieges across the country, but they have also killed thousands of civilians and destroyed civilian infrastructure, including bridges and water points,” said Samira Daoud, Amnesty International’s regional director for West and Central Africa.\nThe tactics to enforce the sieges have also limited residents’ access to health and education, forcing one in 12 people across the country to flee their homes, the organization said.\nThe lives of millions are “hanging in the balance” because of the abuses in Burkina Faso, Amnesty said, as it called on the international community to step up efforts to ensure that ”those responsible for (the) war crimes and human rights abuses are held accountable.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Rights groups report widespread war crimes across Africa’s Sahel region with communities under siege", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-burkina-faso-amnesty-international-human-rights-watch-mali-b2440495.html"}