{"authors": [], "date_download": "2024-02-05 15:45:44", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "UK Prime Minister Rishi Sunak fired a ministerial aide from his administration after the staffer called for a \"permanent\" ceasefire in Gaza Read Full Article at RT.com", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274016267%2Fuk-official-fired-after-urging-gaza-truce.json", "image_url": "https://cdn.bignewsnetwork.com/MmExM2Y5NDMtMjQ.jpg", "language": "en", "localpath": null, "maintext": "The PM's office said the staffer violated the cabinet's rule of \"collective responsibility\"\nUK Prime Minister Rishi Sunak has fired a ministerial aide for calling for a \"permanent\" ceasefire in Gaza. London has stopped short of urging for an end to the war, proposing only limited \"pauses\" to allow aid to reach the Palestinian enclave.\nConservative MP Paul Bristow was removed from his position as parliamentary private secretary (PPS) at the Department for Science on Monday, days after he penned a letter to Sunak pressing for a long-term truce between Israel and Palestinian militants in Gaza.\n\"Paul Bristow has been asked to leave his post in government following comments that were not consistent with the principles of collective responsibility,\" a spokesperson for 10 Downing Street said, referring to a rule requiring government officials to publicly support all cabinet policy decisions.\nIn his two-page letter to the prime minister, Bristow argued that a \"permanent ceasefire\" would \"save lives and allow for a continued column of humanitarian aid [to] reach the people who need it the most.\" Sunak, however, has vocally defended Israel's military action against Hamas following the group's deadly October 7 terrorist attack and urged against a full-on truce, instead calling for brief humanitarian \"pauses\" that are \"distinct from a ceasefire.\"\nFollowing his firing, Bristow went on to tell Sky News that he \"completely understand[s] the PM's decision,\" but added that he can \"now talk openly about an issue so many of my constituents care deeply about.\"\n\"I believe I can do this better from the backbenches rather than as part of the government payroll,\" he continued.\nWhile the UN General Assembly passed a non-binding resolution calling for an immediate ceasefire in Gaza on Saturday, London abstained in the vote, along with 44 other member states. Just 14 countries opposed the measure, among them Israel and the US, though it appeared to have had little effect as Israeli forces continued the early phase of their ground assault on Gaza.\nIsraeli Prime Minister Benjamin Netanyahu has categorically rejected the idea of a ceasefire, telling reporters on Monday that \"calls for a ceasefire are calls for Israel to surrender to Hamas.\" Following weeks of heavy airstrikes, the Israel Defense Forces (IDF) have gradually expanded ground operations in the Palestinian enclave, with officials saying the mission will aim to eliminate Hamas entirely.\nSome 1,400 Israelis and more than 8,000 Palestinians have been killed in the latest bout of violence, in addition to thousands injured on both sides, according to local officials. The UN has warned of a dire humanitarian crisis in Gaza should the conflict continue, though only a slow trickle of aid has been allowed into the territory in recent weeks.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "UK official fired after urging Gaza truce", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274016267/uk-official-fired-after-urging-gaza-truce"}