{"authors": ["Tobi Thomas", "Caroline Davies", "Alexandra Topping"], "date_download": "2024-02-05 15:45:48", "date_modify": "None", "date_publish": "2023-11-02 18:47:08", "description": "Nine drones shot down near nuclear power station that is now held by Russia after coming under attack from invading force", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F02%2Frussia-ukraine-war-latest-updates-live-kyiv-moscow-volodymyr-zelenskiy-vladimir-putin.json", "image_url": "https://i.guim.co.uk/img/media/df89138beb98f3cac6408f609fffe946733846d6/0_141_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=0cf63dba371e122ab3f4d006499d5328", "language": "en", "localpath": null, "maintext": "From 2 Nov 2023 15.12 CET Russia accuses Kyiv of risking nuclear disaster after Ukrainian drones shot down near Zaporizhzhia power plant Russia has said Ukraine was risking a nuclear disaster after nine Ukrainian drones were shot down by Russian forces near the Zaporizhzhia nuclear station, Europe’s largest atomic power plant. Reuters reports: The Zaporizhzhia plant, which has been under Russian control since early March 2022, has six Soviet-designed VVER-1000 V-320 water-cooled and water-moderated reactors containing Uranium 235. Four of the reactors are shut down while two of the reactors – No. 4 and No. 5 – are in so-called ‘hot shutdown’ mode, according to the Russian operator of the plant. Russia’s defence ministry said in a statement: The Kyiv regime continues to carry out provocations with the aim of creating the threat of a disaster at the Zaporizhzhia nuclear power plant and disrupting the rotation of employees of the International Atomic Energy Agency (IAEA). The ministry said Russian air defence forces had shot down nine Ukrainian drones near the Russian-held city of Enerhodar. The IAEA has repeatedly said that the world is fortunate that no nuclear accident has yet happened at the Zaporizhzhia plant, where it says nuclear safety remains extremely fragile. Shortly after sending troops into Ukraine in 2022, Russian forces took control of the Zaporizhzhia station. Ukraine and Russia have accused each other of attacking the station.\nUpdated at 16.26 CET\n2 Nov 2023 19.47 CET Summary Russia has said Ukraine was risking a nuclear disaster after nine Ukrainian drones were shot down by Russian forces near the Zaporizhzhia nuclear station, Europe’s largest atomic power plant.\nIn relation to Russia ’s claims about the Zaporizhzhia nuclear station , Maria Zakharova, a spokesperson for Russia’s foreign ministry said: “Kyiv is continuing to ‘play with fire’ and is carrying out criminal and irresponsible provocations.”\nPolish truckers will block several border crossings with Ukraine starting next week in protest at what they say is Ukrainian hauliers’ free rein in Poland that is hurting their business, a co-organiser of the protest told Reuters.\nAn 81-year-old woman and a 60-year-old man were killed by Russian shelling in southern Ukraine’s Kherson region on Thursday, local authorities said.\nMike Johnson , the US Republican House of Representatives speaker, has said that a bill pairing Ukraine aid with border security “will come next”, after the body’s vote on a standalone Israel aid measure.\nThe Biden administration today added 12 Russian companies to a trade blacklist for supplying Russia’s military with drones that could be used to aid Moscow’s invasion of Ukraine, the commerce department said in a statement.\nAnnalena Baerbock, the German foreign minister, said on Thursday she was confident that the European Union next month would advance Ukraine’s bid to join the bloc at a summit seen as a key milestone in Kyiv’s efforts to integrate with the west.\nUkraine’s commander-in-chief of the armed forces, Gen Valery Zaluzhny, has said the war in Ukraine is “at a stalemate” and there is likely to be “no deep and beautiful breakthrough” soon in the counteroffensive against Russia.\nUkraine’s army should have been able to push back at a pace of 18 miles a day as it breached Russian defensive lines, the general said.\nThe UK’s Ministry of Defence has issued its latest defence intelligence update on the situation in Ukraine as of today, saying Russian air defence has suffered significant losses.\nRussia is preparing to attack Ukraine’s critical infrastructure once the temperatures drop, according to Ukraine’s national security and defence council secretary, Oleksiy Danilov.\nUpdated at 19.56 CET\n2 Nov 2023 18.07 CET Polish truckers will block several border crossings with Ukraine starting next week in protest at what they say is Ukrainian hauliers’ free rein in Poland that is hurting their business, a co-organiser of the protest told Reuters. Reuters reports: The protest, planned to start on November 6, comes amid an economic slowdown in Europe and a relaxation of regulations for Ukrainian transport companies in 2022 by the European Union to ease the transport of goods to and out of the country invaded by Russia. “Ukrainian transport companies are … entering without restrictions and carrying out transport operations they have no right to perform,” said Jacek Sokol, protest co-organizer and deputy head of the Committee to Protect Transporters and Transport Employers. According to Sokol, prior to Russia’s invasion, Ukrainian transport companies were granted 160,000-180,000 permits per year for specific shipments requiring entrance or transit through Poland, but not for shipments within the country. “Now these companies are doing whatever they want. There is a complete, uncontrolled influx, just like with grain.” The blockade is just an opportunity to block the border for Ukrainian competitor truckers, Ukraine’s Deputy Infrastructure Minister Serhiy Derkach was quoted by local media as saying. They account for 85% of those who cross the Ukrainian-Polish border to bring goods into Ukraine or export goods, he added. According to the Ukrainian Infrastructure Ministry, an average of 40,000-50,000 trucks cross the border with Poland per month via eight existing crossings, twice as many as before the war. Most of the goods are carried by Ukraine’s transport fleet. An owner of a Polish haulage company and head of a driver association in the eastern Polish city of Siedlce told Reuters the protest was a grassroots initiative and reflected a wider issue of Polish transport companies losing markets east of Poland, due to Russian counter-sanctions since the February 2022 invasion. “This is actually the result of the despair of the (Polish) carriers, those who have actually lost these mainly eastern markets. I mean Ukraine and Belarus, Russia and all other countries to which Russia transits,” Karol Rychlicki said.\n“These are usually small family companies, not some large businesses… In trying to find alternative jobs, they are destabilising the transport services market by running below costs.” Rychlicki said Polish truckers had first issued their demands to the government in July, but a response from the likely outgoing government only came in late October and was unsatisfactory. “These carriers have taken matters into their own hands and are trying to demand justice,” he said of the planned protest.\nUpdated at 18.18 CET\n2 Nov 2023 16.37 CET In response to Russia’s claims that Ukraine was risking a nuclear disaster after nine Ukrainian drones were shot down by Russian forces near the Zaporizhzhia nuclear station, Maria Zakharova, a spokesperson for Russia’s foreign ministry said: “Kyiv is continuing to ‘play with fire’ and is carrying out criminal and irresponsible provocations.”\nUpdated at 17.42 CET\n2 Nov 2023 16.14 CET Mike Johnson, the US Republican House of Representatives speaker, has said that a bill pairing Ukraine aid with border security “will come next” after the body’s vote on a standalone Israel aid measure.\nUpdated at 16.29 CET\n2 Nov 2023 15.47 CET More on the United States’ new measures against Moscow over the war. Reuters reports: The United States on Thursday imposed sweeping new measures against Moscow over the war in Ukraine targeting Russia’s future energy capabilities, sanctions evasion and a suicide drone that has been a menace to Ukrainian troops and equipment, among others, in sanctions on hundreds of people and entities. The latest measures target a major entity involved in the development, operation and ownership of a massive project in Siberia known as Arctic-2 LNG, the State Department said in a statement. The project expected to ship chilled natural gas, known as liquefied natural gas to global markets. Washington also targeted the KUB-BLA and Lancet suicide drones being used by the Russian military in Ukraine, designating a network it accused of procuring items in support of their production as well as the creator and designer of the drones. The U.S. also cracked down on sanctions evasion in the United Arab Emirates, Turkey and China, as the Treasury Department said companies based in the countries continue to send high priority dual-use goods to Russia, including components Moscow relies on for its weapons systems. Seven Russia-based banks and dozens of industrial firms were also hit with sanctions by the Treasury Department, including Gazpromneft Catalytic Systems LLC, which Treasury said manufactures chemical agents for advanced oil refining in Russia. The Kremlin said on Thursday ahead of the action that it expected the West to impose ever tougher sanctions on it over the war, but that there was a growing sense that such penalties hurt Western interests while Russia’s economy was adapting well. LNG, LANCET DRONE. Arctic-2 LNG has been expecting to start exporting soon and it is uncertain how much Russian LNG would be blocked by the new measures. The largest Russian LNG producer Novatek said in September it would start shipments from Arctic-2 LNG early next year. Thursday’s action marks the first measures Washington has taken directly targeting the Lancet drone, an angular grey tube with two sets of four wings that has been an increasing threat on Ukraine’s frontlines, according to Ukrainian solders. Washington targeted limited liability company ZALA Aero, a Russia-based manufacturer the State Department said designs, manufactures and sells loitering munition and suicide drones to the Russian Ministry of Defense, as well as A Level Aerosystems CST, a Russia-based entity manufacturing and selling drones under the ZALA brand. The owner of the companies, Aleksandr Zakharov, was also targeted, as were his wife, daughter and sons, and companies they own. The State Department said Zakharov is the creator and designer of the drones. SANCTIONS EVASION. Washington has stepped up diplomatic pressure on countries and private companies globally to ensure enforcement of the barrage of sanctions it has unleashed on Moscow over its invasion of Ukraine. Among those designated on Thursday were Turkish and UAE firms, including companies that sent high-priority goods to Russia and firms that have shipped aviation parts and equipment. Three Chinese entities – two that the Treasury said have conducted hundreds of shipments of electro-optical equipment, cameras and other items, and one that has shipped radar components to Russia-based firms – were also targeted. The State Department also imposed sanctions on multiple defence-related entities and procurement companies in the UAE. Construction companies, Russian officials and a metals and mining company implementing a project to develop the largest titanium ore deposit in the world located in Russia were also hit with sanctions.\nUpdated at 16.42 CET\n2 Nov 2023 15.24 CET The Biden administration today added 12 Russian companies to a trade blacklist for supporting Russia’s military with drones that could be used to aid Moscow’s invasion of Ukraine, the commerce department said in a statement. Reuters reports that the companies added to the list, which include Hartis DV LLC and Alfakomponent, will effectively be barred from receiving items from suppliers except for possibly food and medicine. The companies did not immediately respond to requests for comment. The Biden administration has been aggressively using its trade blacklist, formally known as the entity list, to thwart Vladimir Putin’s war in Ukraine by making it harder for its military to get key technology from abroad. Critics have questioned how effective it has been, Reuters reports.\nUpdated at 15.33 CET\n2 Nov 2023 15.12 CET Russia accuses Kyiv of risking nuclear disaster after Ukrainian drones shot down near Zaporizhzhia power plant Russia has said Ukraine was risking a nuclear disaster after nine Ukrainian drones were shot down by Russian forces near the Zaporizhzhia nuclear station, Europe’s largest atomic power plant. Reuters reports: The Zaporizhzhia plant, which has been under Russian control since early March 2022, has six Soviet-designed VVER-1000 V-320 water-cooled and water-moderated reactors containing Uranium 235. Four of the reactors are shut down while two of the reactors – No. 4 and No. 5 – are in so-called ‘hot shutdown’ mode, according to the Russian operator of the plant. Russia’s defence ministry said in a statement: The Kyiv regime continues to carry out provocations with the aim of creating the threat of a disaster at the Zaporizhzhia nuclear power plant and disrupting the rotation of employees of the International Atomic Energy Agency (IAEA). The ministry said Russian air defence forces had shot down nine Ukrainian drones near the Russian-held city of Enerhodar. The IAEA has repeatedly said that the world is fortunate that no nuclear accident has yet happened at the Zaporizhzhia plant, where it says nuclear safety remains extremely fragile. Shortly after sending troops into Ukraine in 2022, Russian forces took control of the Zaporizhzhia station. Ukraine and Russia have accused each other of attacking the station.\nUpdated at 16.26 CET\n2 Nov 2023 14.05 CET Annalena Baerbock, the German foreign minister, said on Thursday she was confident that the European Union next month would advance Ukraine’s bid to join the bloc at a summit seen as a key milestone in Kyiv’s efforts to integrate with the west. Reuters reports: Presenting EU enlargement as a geo-strategic necessity, Baerbock told a conference in Berlin that the 27-nation bloc also needed to plough ahead with “tedious” internal reforms to be able to function with 30-plus members. “We want to see Ukraine a member of our European Union,” said Baerbock, who is from the Greens party that forms part of Germany’s ruling coalition. “The European Union has to be enlarged. That is the geo-political consequence of Russia’s war of aggression against Ukraine.” EU leaders will decide at a December 14-15 summit whether to grant Ukraine the formal start of membership talks, which for Kyiv is a top priority on a par with Western military and financial support. “I am convinced that the European Council in December is going to send out that signal,” said Baerbock. “However, an enlarged EU will only be stronger if we do what we have been so hesitant to do for so long – review and rethink the way in which our union functions.” Membership negotiations – in which a candidate country must meet extensive legal, economic and political conditions – take many years. Ukraine’s case is further complicated by the war, which Russia launched on February 24, 2022. Ukraine would become the EU’s fifth most populous member state, as well as its poorest, meaning that – under current rules – it would absorb much of the bloc’s generous agriculture and development aid at the expense of current members. Baerbock said a step-by-step enlargement must run in parallel with reforms to prevent the further growth of central EU institutions and reduce the use of national vetos.\nUpdated at 15.01 CET\n2 Nov 2023 13.41 CET An 81-year-old woman and a 60-year-old man were killed by Russian shelling in southern Ukraine’s Kherson region on Thursday, local authorities said. AP reports: The deaths were the latest civilian casualties in Moscow’s recent ramped-up bombardment of the front-line area. Kherson is a strategic military region located on the Dnieper River near the mouth of the Black Sea. Unconfirmed reports say attacking Ukrainian troops have gained a foothold on the Russian-held side of the river during Kyiv’s monthslong counteroffensive. The two civilians died when Russian artillery targeted Kherson region villages, according to Gov. Oleksandr Prokudin. Four others were injured in the strikes, which also damaged residential and public buildings, authorities said. On Wednesday, one person died in Russian shelling that caused extensive damage in the Kherson region’s capital city of the same name. Prokudin called it “an apocalyptic scene.” A 91-year-old local woman was killed in her apartment last weekend in what Prokudin described as a “terrifying” nighttime barrage. The Kherson region is a key gateway to the Crimean Peninsula, which Russia annexed from Ukraine in 2014 and is now home to a lot of Moscow’s war logistics operations and rear supply depots. Ukrainian forces recaptured the city of Kherson last November after nearly nine months of Russian occupation following Moscow’s full-scale invasion on Feb. 24 2022. The Kremlin’s forces retreated across the river to the eastern side of the Dnieper. The developments placed the city on the southern front line and at the mercy of Russian drone and artillery attacks from across the river that frequently target civilian areas. The current counteroffensive, which started four months ago, so far has fallen short of the Ukrainian military’s goal of dislodging Russian forces from large areas. The war now appears set for another winter of grinding attrition. But Kremlin spokesman Dmitry Peskov dismissed claims by Ukraine’s commander-in-chief that the war had reached a stalemate. Gen. Valerii Zaluzhnyi made that observation to The Economist. Russia is steadfastly pursuing its war goals, Peskov said. “It’s absurd to talk about any prospect for the victory of the Kyiv regime on the battlefield,” he added. “The sooner the Kyiv regime comes to realize that, the earlier some other perspectives will open up.” Russian authorities commonly use the term “Kyiv regime” when referring to Ukraine’s democratically elected government.\nUpdated at 14.11 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Moscow says Kyiv risking nuclear disaster after Ukrainian drones shot down near Zaporizhzhia - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/02/russia-ukraine-war-latest-updates-live-kyiv-moscow-volodymyr-zelenskiy-vladimir-putin"}