{"authors": [], "date_download": "2024-02-05 15:45:49", "date_modify": "None", "date_publish": "2023-11-02 17:06:23", "description": "The Senate has circumvented a hold by Alabama Republican Sen. Tommy Tuberville and confirmed Adm. Lisa Franchetti to lead the Navy", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-tommy-tuberville-senate-pentagon-chuck-schumer-b2440619.html.json", "image_url": "https://static.independent.co.uk/2023/11/02/17/Congress_Military_Nominations_42328.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Senate circumvented a hold by Alabama Republican Sen. Tommy Tuberville on Thursday and confirmed Adm. Lisa Franchetti to lead the Navy, making her the first woman to be a Pentagon service chief and the first female member of the Joint Chiefs of Staff.\nFranchetti's historic confirmation as the chief of naval operations comes as Tuberville has drawn bipartisan criticism for holding up almost 400 military nominations in an effort to protest Pentagon abortion policy. In a remarkable display, several Republican senators angrily held the floor for more than four hours on Wednesday evening and called up 61 of the nominations for votes, praising each nominee for their military service. Tuberville showed no signs of letting up, standing and objecting to each one.\nThe Senate confirmed Franchetti with an overwhelming 95-1 vote. Senators are scheduled to confirm two other top officers on Thursday — Gen. David Allvin to be chief of staff of the U.S. Air Force and Lt. Gen. Christopher Mahoney to serve as assistant commandant for the U.S. Marine Corps.\nIf confirmed, Mahoney could immediately step in as acting commandant, temporarily taking over after Gen. Eric Smith, the commandant, was hospitalized on Sunday after suffering a medical emergency at his official residence in Washington.\nSmith, who is listed in stable condition and is recovering, was confirmed to the top job last month, but he had been holding down two high-level posts for several months because of Tuberville’s holds.\nWhen Senate Majority Leader Chuck Schumer, D-N.Y., announced the vote this week on Mahoney’s nomination to be assistant commandant, he said Smith’s sudden medical emergency is “precisely the kind of avoidable emergency that Sen. Tuberville has provoked through his reckless holds.”\nTuberville has challenged Schumer to put each nomination on the floor — a process that could take weeks or months as each nomination requires multiple days and multiple votes to get around the objection. Schumer has so far resisted, hoping to force Tuberville's hand, but he has relented in the case of some top military officers.\nFranchetti, the vice chief of operations for the Navy, has broad command and executive experience. A surface warfare officer, she has commanded at all levels, heading U.S. 6th Fleet and U.S. Naval Forces Korea. She was the second woman to be promoted to four-star admiral, and she did multiple deployments, including as commander of a naval destroyer and two stints as aircraft carrier strike group commander.\n“She has worked her way up the ranks of the United States Navy. She has commanded at sea,” said Senate Armed Services Committee chairman Sen. Jack Reed ahead of the vote. “She has accepted and excelled at every challenge presented to her. She is superbly prepared to be the chief of naval operations.”\nReed said that Franchetti’s nomination also marks an important point in history. “I’m glad we’ve reached this moment,” he said. “At every step of her career, Adm. Franchetti has been a trailblazer.”\nDefense Secretary Lloyd Austin recommended that President Joe Biden select Adm. Samuel Paparo, the current commander of the Navy’s Pacific Fleet, several U.S. officials said earlier this year. But instead, Biden nominated Paparo to lead U.S. Indo-Pacific Command.\nSeveral women have served as military service secretaries as political appointees, but never as their top uniformed officer. Adm. Linda L. Fagan is the commandant of the Coast Guard, but she is not a member of the Joint Staff.\nTuberville said Wednesday there is “zero chance” he will drop the holds, which he first announced in February. Despite several high-level vacancies and the growing backlog of nominations, he has said he will continue to hold the nominees up unless the Pentagon ends — or puts to a vote in Congress — its new policy of paying for travel when a servicemember has to go out of state to get an abortion or other reproductive care. Biden’s Democratic administration instituted the policy after the Supreme Court overturned the nationwide right to an abortion, and some states have limited or banned the procedure.\n“I cannot simply sit idly by while the Biden administration injects politics in our military from the White House and spends taxpayers’ dollars on abortion,” Tuberville said.\nConfronting Tuberville publicly for the first time since he announced the holds, the Republican senators — Alaska Sen. Dan Sullivan, Iowa Sen. Joni Ernst, South Carolina Sen. Lindsey Graham, Indiana Sen. Todd Young and others — read lengthy biographies, praised nominees and lashed out at Tuberville as they called for vote after vote. They said they agree with the Alabama senator in opposing the abortion policy but questioned — as Democrats have for months — why he would hold up the highest ranks of the U.S. military.\nSullivan said Tuberville is “100% wrong” that his holds are not affecting military readiness. Ernst said the nominees are being used as “political pawns.” Utah Sen. Mitt Romney advised Tuberville to try to negotiate an end to the standoff. All of them warned that good people would leave military service if the blockade continues.\nAs Wednesday night wore on, Sullivan, a colonel in the U.S. Marine Corps Reserve, and Ernst, a former commander in the U.S. Army Reserve and Iowa Army National Guard, continued to bring up new nominations and appeared to become increasingly frustrated. They noted that they were bringing up the nominations “one by one” as Tuberville had once called for, and they asked why he wouldn’t allow them to go forward. Tuberville did not answer.\n“I do not respect men who do not honor their word,” Ernst said.\nSullivan said “China is smiling” as the United States holds up its own military heroes. “As an American,\" Sullivan said, \"it almost wants to make you weep.”\nThe GOP effort to move the nominations came after Schumer said Wednesday morning they are trying a new workaround to confirm the officers. Schumer said the Senate will consider a resolution in the near future that would allow the quick confirmation of the now nearly 400 officers up for promotion or nominated for another senior job.\nThe resolution by Reed and independent Sen. Kyrsten Sinema of Arizona would tweak the rules until the end of this session of Congress next year to allow a process for the Senate to pass multiple military nominations together. It would not apply to other nominations.\nTo go into effect, the Senate Rules Committee will have to consider the temporary rules change and send it to the Senate floor, where the full Senate would have to vote to approve it. That process could take several weeks and would likely need Republican support to succeed.\n“Patience is wearing thin with Senator Tuberville on both sides of the aisle,” Schumer said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Senate sidesteps Tuberville's hold and confirms new Navy head, first female on Joint Chiefs of Staff", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-tommy-tuberville-senate-pentagon-chuck-schumer-b2440619.html"}