{"authors": ["Reporter"], "date_download": "2024-02-05 15:45:50", "date_modify": "None", "date_publish": "2023-11-02 07:46:25", "description": "Rep. Brian Mast's dehumanizing comments come as Israel's continuous attacks on Gaza have killed more than 8,000 Palestinians.", "filename": "https%3A%2F%2Fwww.huffingtonpost.co.uk%2Fentry%2Frepublican-compares-palestinian-civilians-to-nazis-as-gaza-death-toll-climbs_uk_6543538de4b06bc01e22f16f.json", "image_url": "https://img.huffingtonpost.com/asset/6542c8462200003500ceee03.jpeg?cache=tI0GDH4Czo&ops=1200_630", "language": "en", "localpath": null, "maintext": "LOADING ERROR LOADING\nA Republican lawmaker who is pushing to slow down any humanitarian aid to Gaza compared Palestinian civilians to Nazis, as Israel’s continuous airstrikes and ground invasion have left more than 8,000 dead, over a million displaced, and nearly all of them without basic necessities.\nRep. Brian Mast (R-Fla.) spoke Wednesday on the House floor about his bill, the Hamas International Financing Prevention Act, which would impose sanctions with respect to foreign support for militant groups like Hamas and the Palestinian Islamic Jihad.\nAdvertisement\nThe bill’s original text included a provision that exempted humanitarian aid to Gaza civilians from broader restrictions, but Mast himself removed the exemption’s language and replaced it with a provision that would require President Joe Biden to issue a case-by-case waiver to approve humanitarian aid.\n“I think when we look at this, as a whole, I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians, as is frequently said,” Mast said. “I don’t think we would so lightly throw around the term ‘innocent Nazi civilians’ during World War II.”\nMast: I think when we look at this, as a whole, I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians. I don't think we would so lightly throw around the term innocent Nazi civilians pic.twitter.com/OqDpJHZiHV — Acyn (@Acyn) November 1, 2023\nAdvertisement\nFamilies also don’t have their basic needs met after Israel shut down Gaza’s access to food, water, fuel and medicine. Recently, a humanitarian corridor has opened up, but very few trucks have come in with aid.\nDespite the White House and much of Congress providing unwavering support for Israel in its attacks, Mast’s dehumanizing rhetoric still drew swift backlash from Democrats and civil rights organizations.\n“Racist and bigoted comments like this are why 6-year-old Palestinian-American Wadea Al Fayoume was murdered by being stabbed 26 times. Disgusting and disgraceful,” Rep. Maxwell Frost (D-Fla.) tweeted, referring to the killing in Plainfield, Illinois, that’s being investigated as a hate crime.\nIfNotNow, a Jewish American organization focused on ending U.S. support for Israeli apartheid, tweeted that Mast’s comments are “dangerous, wrong and a craven attempt to justify more bombings & more killings.”\n“Every member of Congress should be condemning this vile rhetoric & taking action,” the group said. “Demanding a ceasefire has never been more urgent.”\nAdvertisement\nEarlier this month, Mast arrived at a GOP conference meeting dressed in an Israeli Defense Forces uniform. Asked why the lawmaker was wearing the uniform of another country’s military, Mast said it was in response to Palestinian American Rep. Rashida Tlaib (D-Mich.) displaying a Palestinian flag outside her office.", "source_domain": "www.huffingtonpost.co.uk", "text": null, "title": "GOP Lawmaker Compares Palestinian Civilians To Nazis", "title_page": null, "title_rss": null, "url": "https://www.huffingtonpost.co.uk/entry/republican-compares-palestinian-civilians-to-nazis-as-gaza-death-toll-climbs_uk_6543538de4b06bc01e22f16f"}