{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:45:51", "date_modify": "None", "date_publish": "2023-11-02 17:33:10", "description": "President Joe Biden announced Thursday that 74 U.S. citizens who have been trapped inside Gaza had been able to evacuate.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12703631%2FBiden-says-74-American-dual-citizens-trapped-Gaza-got-hundreds-stuck-inside-war-zone.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/02/17/77331637-0-image-a-9_1698946263724.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden announced Thursday that 74 U.S. citizens who have been trapped inside Gaza had been able to evacuate.\nIt is the second consecutive day Americans had been able to leave the besieged territory, as Israel continues to carry out air strikes while continuing a limited ground operation in the north. It comes after the White House announced on Wednesday that a handful of American had been able to leave, following delicate multi-party talks.\n'Good news we got out today 74 American folks, dual citizens,' Biden told reporters in the Oval Office while meeting with President Luis Abinader of the Dominican Republic.\nThat number is still only a fraction of the Americans who have been enduring difficult conditions inside Gaza amid Israel Defense Force since the October 7 Hamas attack inside Israel.\n'Good news': President Joe Biden said 74 U.S. citizens had been able to get out of Gaza on Thursday\nThe State Department says about 400 dual citizens have expressed a desire to leave, a number that grows to about 1,000 including family members.\nThe development came a day after Biden called for a 'pause' in the fighting after being heckled at a Minneapolis fundraiser, and as Israeli ground forces advanced toward Gaza City.\nIn addition, a group the White House has described as a handful of U.S.-Israeli duel citizens kidnapped during the Hamas attacks is still believed to be held inside Gaza.\nWhite House national security spokesman John Kirby said that there would 'hopefull'y' be more who get out today. He put the number who got out Wednesday at 5, which would make the total released 79, although he said the numbers were fluid and being updated.\n'But certainly we’re looking for them to depart at a similar pace, if not better, than what we’ve seen,' he said at the White House press briefing.\nEgypt will help evacuate 'about 7,000' foreigners and dual nationals, its foreign ministry said, indicating a potential major evacuation was underway.\nOn Wednesday, Kirby said the U.S. had been able to secure safe passage for wounded Palestinians and for foreign nationals 'including Americans' to depart through the Rafah Crossing into Egypt.\n'This is an important first step in a process that we expect to see continue over the coming days,' Kirby said. 'The situation remains very fluid, but this is a significant breakthrough. It’s the direct result of weeks of effort and personal diplomacy by the President, as well as the Secretary of State and, of course, our special envoy on the ground, David Satterfield.'\nSecretary of State Antony Blinken is flying Thursday to Tel-Aviv to meet with Israeli Prime Minister Benjamin Netanyahu, with a planned Friday trip to Jordan\nThe State Department has been contacting Americans telling them to be 'ready to go and to await further instruction.'\nKirby told DailyMail.com en route to Minneapolis with President Biden the number represented just a 'first step in what we consider to be a multi-step process, which will take — which will unfold over coming days.'\n'We do expect to be able to get all our Americans out. But it’ll take ... a few days. It will take some time,' he added, following the release of the initial 'handful' of Americans.\nThere have been myriad challenges, with Hamas for weeks refusing to allow departures. Communications blackouts amid Israel's insertion of troops inside Gaza have also caused challenges.\nThe administration has faced growing pressure to get Americans out, with Israel cutting off fuel and water immediately after the October 7 attack, and the resumption of humanitarian aid deliveries via truck following US pressure.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden says 74 American dual citizens who were trapped in Gaza got out - with hundreds more still stuck inside war zone", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12703631/Biden-says-74-American-dual-citizens-trapped-Gaza-got-hundreds-stuck-inside-war-zone.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}