{"authors": ["Nick Craven"], "date_download": "2024-02-05 15:45:52", "date_modify": "None", "date_publish": "2023-11-02 20:32:30", "description": "Senior Israel Defence Forces (IDF) commanders said they had the terrorists surrounded as they closed in with tanks, bombers, helicopters, warships and ground troops.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12704201%2FIsrael-forces-height-battle-says-Netanyahu-commanders-close-Hamas-bases-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/02/20/77337595-0-image-a-6_1698957113088.jpg", "language": "en", "localpath": null, "maintext": "Israeli Prime Minister Benjamin Netanyahu said last night that his forces were 'at the height of the battle' as they pushed deeper into the Hamas strongholds of Gaza City.\nSenior Israel Defence Forces (IDF) commanders said they had the terrorists surrounded as they closed in with tanks, bombers, helicopters, warships and ground troops.\nBut they were facing stiff resistance from Hamas fighters emerging from the 'spider's web' of tunnels beneath the enclave nicknamed the 'Gaza metro'.\n'We've had impressive successes and have passed the outskirts of Gaza City,' said Mr Netanyahu. 'We are advancing.'\nLater he told a group of troops: 'I want to make one thing clear – nothing will stop us. We will advance and win, and we will do so with God's help and the help of our heroic soldiers.'\nBenjamin Netanyahu speaks during a press conference with Defense Minister Yoav Gallant and Cabinet Minister Benny Gantz in the Kirya military base in Tel Aviv, Israel, Oct. 28, 2023\nSmoke rises following Israeli strikes in Tal Al Hawa neighborhood in Gaza City, 2 November\nMore than 9,000 Palestinians and at least 1,400 Israelis have been killed, according to the Israeli Defense Forces (IDF) and the Palestinian health authority, since October 7\nPeople check buildings destroyed in an Israeli strike on the Bureij refugee camp in the central Gaza Strip on November 2\nThe prime minister also said that the government had not made any decision about transferring fuel to Gaza, despite desperate pleas from hospital chiefs there – even urging locals to donate a litre of fuel if they had it.\n'We haven't made any decision about transferring fuel. I haven't given any instruction and the war cabinet has not authorised any decision,' he told reporters.\nNetanyahu's comments came as Hamas' and their Iranian-backed allies in Lebanon, Hezbollah, fired their heaviest barrage of rockets since the war began at the northern Israeli border town of Kiryat Shmona, injuring two people.\nThe intensity of the combat in Gaza was illustrated by the loss of Israel's highest-ranking officer so far in the conflict, Lt Col. Salman Habaka, the 18th soldier to die since the beginning of the ground operation.\nTank commander Col Habaka, 33, a member of Israel's Druze Arab minority, was heavily involved in the fight against Hamas' murderous attack on October 7 which killed 1,400 people. He fought at Kibbutz Be'eri, one of the deadliest massacre sites, and killed dozens of terrorists that day.\nFour further soldiers were also seriously wounded in combat yesterday.\nBrigadier General Iddo Mizrahi, chief of Israel's military engineers, said troops were in a first stage of opening access routes in Gaza but were encountering mines and booby-traps.\n'Hamas has learned and prepared itself well,' he said.\nHamas and allied Islamic Jihad fighters were emerging from tunnels to fire at tanks, then disappearing back into the network, residents said and videos from both groups showed.\nThe Palestinian death toll from nearly four weeks of Israeli air and artillery strikes on the blockaded enclave meanwhile rose past 9,000 on Thursday, Gaza health authorities said.\nUnited Nations experts warned that the Palestinian people of Gaza were at 'grave risk of genocide' as time was running out for them and demanded an immediate ceasefire.\nMore than 9,000 Palestinians have been killed since the war broke out, health officials of the Hamas government said.\nMore than 3,600 Palestinian children have been reported killed in 25 days of fighting, and bombings have driven more than half the territory's 2.3 million people from their homes, while food, water and fuel run low.\n'We remain convinced that the Palestinian people are at grave risk of genocide,' the group of experts, made up of seven U.N. special rapporteurs, said in a statement.\n'We demand a humanitarian ceasefire to ensure that aid reaches those who need it the most.'\nAn Israeli artillery unit fires during a military drill in the annexed Golan Heights near the border with Lebanon, 2 November\nPeople check buildings destroyed in an Israeli strike on the Bureij refugee camp in the central Gaza Strip on November 2\nIsraeli rescue crew inspect a house which was hit by a rocket fired from the Gaza Strip on November 2, 2023 near Lod, Israel\nA victim who was injured in Israeli bombardment is carried on a stretcher at Al-Shifa hopsital in Gaza City on November 2\nA Palestinian girl smiles on a hospital bed at Al Arish hospital after arriving from Gaza, amid the ongoing conflict between Israel and Hamas, in Egypt on November 2\nThe Israeli mission to the U.N. in Geneva said it was preparing a response to the experts' remarks.\nAs international calls for a humanitarian pause in hostilities went unheeded, Palestinians were reported to be suffering shortages of food, fuel, drinking water and medicine.\n'Water is being used as a weapon of war,' said Juliette Touma, a spokesperson for the U.N. agency for Palestinian refugees UNRWA.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel forces are at 'the height of battle' says Netanyahu as commanders close in on Hamas bases in Gaza", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12704201/Israel-forces-height-battle-says-Netanyahu-commanders-close-Hamas-bases-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}