{"authors": ["Ashleigh Gray", "Ashleigh Gray For Dailymail.Com"], "date_download": "2024-02-05 15:45:54", "date_modify": "None", "date_publish": "2023-11-02 06:51:34", "description": "Gal Gadot was spotted out and about in Los Angeles on Wednesday with one of her three children, daughter Alma, 11.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ftvshowbiz%2Farticle-12700843%2FGal-Gadot-cuts-casual-figure-steps-daughter-Alma-11-Los-Angeles.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/02/04/77304617-0-image-m-99_1698900702085.jpg", "language": "en", "localpath": null, "maintext": "Gal Gadot was spotted out and about in Los Angeles on Wednesday with one of her three children, daughter Alma, 11.\nThe 38-year-old silver screen superstar — who was seen filming her next movie last month — was dressed in all black as they stepped out in Studio City.\nGadot held her phone to her ear as she obscured her eyes with oval-shaped onyx sunglasses.\nShe was clad in a short-sleeved crew neck T-shirt and loose-fitting, straight-leg leather trousers.\nOn the move: Gal Gadot wore all black and chatted on the phone as she walked around Los Angeles on Wednesday\nMother-daughter date: She was spotted out and about in with one of her three children, daughter Alma, 11\nHer dark hair was arranged in a fuss-free, slightly tousled ponytail set at the mid-point of her head.\nThe Heart of Stone star wore small stud earrings, a couple of beaded bracelets, and brown understated flip-flops.\nShe appeared to go without makeup underneath her stylish shades as she spent one-on-one time with her firstborn child.\nAt one point she carried a bright-colored canned beverage along with her phone in one hand, while holding a white paper bag in the other.\nMissing from the scene were her two other kids, daughters Maya, six, and Daniella, two.\nGadot shares her brood with husband Jaron Varsano, whom she wed in 2008.\nThe day out and about in the City of Angels comes after last month the entertainer shared her opinion about the conflict between Palestine and Israel.\nPosting to her 109 million followers, the Israel native pledged her support to the victims of the October 7 Hamas attack.\nItems: At one point she carried a bright-colored canned beverage along with her phone in one hand, while holding a white paper bag in the other\nBackground: The Wonder Woman star famously served in the Israeli Defense Forces as a combat trainer over a decade ago\nOutspoken: The Miss Israel 2004 pageant queen said 'I stand with Israel' and shared an image of the country's flag\nThe post received more than one million likes, but there was pushback from some fans in the comments section.\nOne followers simply wrote, 'I stand with Palestine,' with a red heart emoji while another stated: 'Palestine has been attacked by Israel 323 times since 2008.'\nShe also signed an open letter condemning the 'barbaric acts' of Hamas fighters who carried out the early October assault.\n'Our thoughts are with all those experiencing unfathomable levels of fear and violence, and we hope for the day when Israelis and Palestinians can live side by side in peace,' the open letter concluded.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Gal Gadot cuts a casual figure as she steps out with daughter Alma, 11, in Los Angeles", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/tvshowbiz/article-12700843/Gal-Gadot-cuts-casual-figure-steps-daughter-Alma-11-Los-Angeles.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}