{"authors": ["Yelena Mandenberg", "Image", "Afp Via Getty Images"], "date_download": "2024-02-05 15:16:46", "date_modify": "None", "date_publish": "2024-01-20 22:14:47", "description": "The base hosted American forces in western Iraq and was attacked with \"at least a dozen missiles,\" according to a US defense source and an Iraqi police official.", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Ftroops-injured-rocket-attack-air-31930168.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31930178.ece/ALTERNATES/s1200/0_Oil-Fires-Burn-In-Iraq.jpg", "language": "en", "localpath": null, "maintext": "The base hosted American forces in western Iraq and was attacked with \"at least a dozen missiles,\" according to a US defense source and an Iraqi police official.\nUS troops injured in rocket attack on air base in Iraq as tension in region explodes\nSeveral US troops and an Iraqi security member were hurt in a missile attack on Iraq's Ain al-Asad air base, where American forces are based.\nThe base was hit with \"at least a dozen missiles,\" according to a US defense source and an Iraqi police official.\nAn anonymous Iraqi police official told AFP that \"Al-Asad airbase was targeted by 15 rockets\" fired from Anbar province, where the military base is located. He said that 13 of the projectiles were intercepted by anti-air defenses, but \"two fell on the airbase.\"\nA US defense official confirmed that \"missiles impacted Al-Asad airbase.\" They added that a joint damage assessment was being conducted with coalition and Iraqi forces.\nUS officials are still trying to figure out if the attack was carried out using missiles or rockets. There are approximately 2,500 American troops in Iraq and around 900 in Syria.\nAn American official suggested that initial reports indicated that the base was hit by ballistic missiles. However, they didn't rule out the possibility that the base was hit by rockets. An assessment is ongoing.\nREAD MORE: Donald Trump's bloody red hands 'are syphilis' says ex-Clinton advisor in wild claim\nImage: AFP via Getty Images) AFP via Getty Images)\nSince the start of the Israel-Hamas conflict in October, U.S. forces have been attacked at least 58 times in Iraq and another 83 times in Syria. It's widely believed that the militants are backed by Iran.\nReports have emerged that an Israeli strike on the Syrian capital, Damascus, destroyed a building used by Iran's Revolutionary Guard.\nThis attack reportedly killed at least five Iranians, according to Syrian and Iranian state media. The Syrian army stated that the building in the Mazzeh neighborhood of Damascus was completely destroyed by missiles fired from Israeli aircraft over the Golan Heights.\nIn another incident, an Israeli drone strike near the southern Lebanese city of Tyre killed two Hezbollah members and two others. The victims were in a car and a nearby orchard when the attack occurred. One of those killed was identified as Ali Hudruj, a local Hezbollah commander.\nMeanwhile, the U.S. has been retaliating against the Houthis with multiple strikes, the latest of which targeted missile launchers in Yemen. The Houthis, who are armed and supported by Iran, have a slogan that reflects their worldview: \"God is the greatest, death to America, death to Israel, curse the Jews, victory to Islam.\"\nHouthi spokesman Muhammed al-Bukhaiti criticized the US and UK for their role in operations against Gaza. He assured that all vessels in the region are safe as long as they have no links to Israel.\nBukhaiti told Russian paper Izvestia: \"The madness and idiocy of the USA and UK have played against themselves - now their ships will not be able to use one of the key trade arteries in the world,\"\nHe added: \"The US and UK will need to stop aggression against Yemen, stop the war in the Gaza Strip and ensure the uninterrupted flow of medicine, fuel and food. Only then will we immediately stop all our operations in the Red Sea.\"\nBukhaiti also said: \"The war we are waging today is one of a kind in terms of its moral and ethical frontier. The whole world sympathizes with Yemen's heroic stand to end the genocide of the Palestinian people.\"\nHe concluded by saying: \"As for all other countries, including Russia and China, their shipping in the region is not threatened.\"", "source_domain": "www.mirror.co.uk", "text": null, "title": "US troops injured in rocket attack on air base in Iraq as tension in region explodes", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/troops-injured-rocket-attack-air-31930168"}