{"authors": ["Nick Allen", "Nick Allen For Dailymail.Com"], "date_download": "2024-02-05 15:45:57", "date_modify": "None", "date_publish": "2023-11-02 13:51:00", "description": "Netanyahu has been accused of underestimating the threat Hamas posed and being too focused on overhauling Israel's judicial system.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12695877%2FGaza-Israel-Hamas-Palestine-Palestinian-Netanyahu.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/01/13/77269063-0-image-a-22_1698845550263.jpg", "language": "en", "localpath": null, "maintext": "Four days after Israel's 9/11 Ofir Shai was clear whose failings were to blame for not preventing it - Benjamin Netanyahu and his government.\nShai, a son of Israel's former economy minister Izhar Shai, delivered a heartfelt eulogy for his brother Yaron, who was among the 1,400 Israelis killed by Hamas terrorists invading from Gaza on October 7.\nIn front of a large crowd, interrupted by sirens, he condemned what he called Netanyahu's 'government of shame,' describing it as 'clownish'.\nHe said: 'My little brother was killed by murderous terrorists filled with hate, and the one who opened the door for them, with its debased actions, was the government of Israel.\n'You abandoned the soldiers of the IDF (Israel Defense Forces). You abandoned the people who live along the Gaza border. You abandoned the state of Israel. You abandoned my beloved brother. I expect you all to take responsibility and resign.'\nIsraeli Prime Minister Benjamin Netanyahu has faced criticism over his policies prior to the Hamas terrorist atrocity on Oct. 7\nLeft-wing opponents of Netanyahuduring a rally calling on him to resign in Tel Aviv, Israel, 28 October 2023\nNetanyahu has urged that any political reckoning be postponed until after the war, and the destruction of Hamas, but when that time comes he will face a wave of anger.\nPolls show the Israeli Prime Minister'’s already plunging popularity imploded in the wake of the Hamas atrocity. His approval rating is down to 30 percent.\nThe criticisms being leveled at him over actions before October 7, are fourfold.\nFirst, that he underestimated the threat Hamas posed. Second, that his focus on overhauling Israel's judiciary left the country distracted and vulnerable.\nThird, that he did not heed warnings from senior security figures. And, fourth, that, as Prime Minister, he bears responsibility for a series of operational mistakes.\nIn addition, there has been further criticism of Netanyahu's actions since the Hamas attack - including his public attempt to blame the security services rather than take responsibility, and his response to those impacted by the horrific onslaught.\nUnderestimating the threat of Hamas\nIn recent years, Netanyahu, his critics say, focused more on the threat from Iran and its Lebanese proxy Hezbollah, than that of Hamas.\nHe and his officials came to see Hamas and its leader in Gaza, Yahya Sinwar, as more interested in governing and seeking to develop the economy, improving the living standards of Gaza's 2.3 million population.\nTel Aviv allowed about 18,000 Palestinian laborers from Gaza to work in Israel, where they were able to earn 10 times more money working in industries like construction.\nHamas, Netanyahu and his officials believed, was contained in Gaza.\nNetanyahu was said to be focused on the threat of Ayatollah Ali Khamenei's Iran\nSupporters of Iranian proxy terror group Hezbollah at a funeral in Lebanon on October 27\nInstead, they turned their attention to the existential threat of Iran, the potential for an attack from Lebanon by Hezbollah, and also to events in the West Bank.\nNetanyahu's government included supporters of Jewish West Bank settlers who demanded a security crackdown amid a rising tide of violence there.\nForces were stationed more heavily in the West Bank, home to half a million settlers, and Israel's military was then caught off guard by the attack from Gaza on its southern flank.\nIn the wake of Oct. 7 retired general Yaakov Amidror, former national security adviser to Netanyahu, admitted there had been a 'huge failure' of the 'military apparatus in the south.'\nHe said that, before the attack, some of Israel's allies had been suggesting to Tel Aviv that Hamas was becoming 'more responsible' in its governing of Gaza.\n'We stupidly began to believe that it was true,' he said. 'So, we made a mistake.'\nDennis Ross of the Washington Institute for Near East Policy, a former Middle East negotiator, said Israel had been focused on the violence in the West Bank, and left a 'thin, under-prepared presence' in the south near Gaza.\nPalestinian youths in Ramallah, West Bank clash with Israeli Defence Forces during skirmishes at a checkpoint on October 27, 2023\nThe funeral of Yaron Shai, who was killed by Hamas on October 7. In a eulogy his brother, Ofir, (center) criticized he government of Benjamin Netanyahu\nAt the same time, Israel had also turned its attention away from Hamas as it pushed to normalize relations with Saudi Arabia.\nWhen unusual movement of Hamas forces in Gaza began in the middle of the night Shin Bet, Israel's internal security service, still didn't know what was about to unfold, and there was even a delay in waking up Netanyahu.\nIt turned out to be the worst worst breach of Israel's defenses in 50 years, with Hamas using bulldozers, hang gliders and motorbikes to attack.\nNetanyahu's administration had fallen for two years of Hamas subterfuge, and was tricked.\nDuring that time the terror group had indicated it did not want to fight, all the while keeping its true plans secret.\nAn Israeli army spokesman said: 'We believed the fact they (Gazans) were coming in to work and bringing money into Gaza would create a certain level of calm. We were wrong.'\nIsrael 'distracted' due to Netanyahu's overhaul of the justice system\nFor much of this year Israel had been in turmoil over Netanyahu’s plan to overhaul the judiciary.\nHe argued the country’s unelected judges had too much power over parliament, and he was backed by an alliance of ultranationalist and religious parties.\nOpponents argued the plan would push the country toward authoritarian rule by concentrating power in the hands of Netanyahu and his parliamentary allies.\nPolice use a water cannon on a road leading to the Prime Minister's office as protesters demonstrated following a parliament vote on a contested bill that limits Supreme Court powers to void some government decisions, in Jerusalem July 24,\nNetanyahu had received repeated warnings from his defense chiefs that the crisis of the judicial system was impacting the work of the security services.\nRonen Bar, the head of Shin Bet, warned publicly that the situation was a 'shot of encouragement' to the 'terrorist organizations and the axis of evil countries'.\nMartin Indyk, President Barack Obama's former special envoy for Israeli-Palestinian negotiations, said it was an additional factor in Israel being caught off guard by Hamas.\n'That roiled the IDF in a way that was, I think we discovered, was a huge distraction,' he said.\nCritics of Netanyahu claimed his government neglected basic functions while focusing on attacking the Supreme Court, and that terrorists saw weakness amid the chaos.\n'They wasted a whole year on nonsense,” Arnon Bar David, head of Israel’s Histadrut trade union, said. 'Government offices haven’t been functioning for a year now, so obviously they can’t cope with emergency situations.'\nIntelligence warnings missed\nOn Sept 11, less than a month before the Hamas attack, Herzi Halevi, the IDF chief of staff for the IDF, gave a public speech and his message was clear - don't be over-confident and do be prepared for an attack.\n'We must consider every statement of our enemies, in words or deeds. Not to underestimate them, nor to glorify ourselves,' he said. 'We must be more prepared than ever for a multi-aspect and extensive military conflict.'\nSix weeks earlier Halevi had reportedly turned up at the Knesset with classified information suggesting that Hamas and others would see the crisis over the judiciary as an opportunity.\nHowever, Netanyahu and other politicians did not meet with him, the New York Times reported.\nHerzi Helevi, Chief of the General Staff of the Israel Defense Forces, had warned against underestimating the threat\nThere were also warnings emanating from Egypt, which has in the past mediated between Israel and Hamas.\nSpeaking in the days after the Hamas attack an Egyptian official said: 'We warned them an explosion of the situation is coming, and very soon, and it would be big. But they underestimated such warnings.'\nOperational failings\nIsrael withdrew troops and settlers from the Gaza Strip in 2005, and Hamas took over in 2007.\nSince then it has built up hi-tech surveillance systems and spy networks,\nIt knew where Hamas leaders were and successfully carried out surgical strikes while they slept, also destroying many miles of underground tunnels.\nHowever, despite that, Hamas was able to keep a lid on its planned atrocity for months, training hundreds of terrorists to carry it out.\nAmir Avivi, a retired Israeli general, said Israel relied to heavily on technology, and in response Hamas had gone back to 'stone age' tactics.\nIts terrorists stopped using cell phones and computers.\n'The other side learned to deal with our technological dominance and they stopped using technology that could expose it,' he said.\nA salvo of rockets is fired from the Gaza Strip towards Israel on November 1, 2023\nThat fueled a belief among Israeli officials that Hamas would not attack.\nIn turn, that led to operational mistakes such as deciding a year ago not to monitor radios used by Hamas because there did not appear to be a threat.\nNetanyahu blames his own security services\nThree weeks after the Hamas attack, in a tweet at 1am, Netanyahu said he had not been warned by his own security chiefs.\nThe post read: 'Contrary to the false claims: Under no circumstances and at no stage was Prime Minister Netanyahu warned of Hamas’s war intentions.\n'On the contrary, all the security officials, including the head of military intelligence and the head of the Shin Bet, assessed that Hamas had been deterred and was looking for a settlement.\n'This assessment was submitted again and again to the prime minister and the cabinet by all the security forces and intelligence community, up until the outbreak of the war.'\nNetanyahu visits Israeli police after publicly criticizing his own security services\nNetanyahu faced an immediate backlash, including from his own allies, for throwing Shin Bet under the bus.\nBenny Gantz, a member of Netanyahu's war cabinet, responded: 'The prime minister must retract his statement and stop addressing this matter.\n'When we are at war, leadership must display responsibility, make the correct decisions and strengthen the forces.'\nYossi Cohen, former head of Mossad, the Israeli intelligence agency, and an ally of Netanyahu, said: 'Responsibility is something you take at the start of your job, not midway.'\nYossi Cohen (r), former head of Mossad, said the Prime Minister should take responsibility\nNine hours after he posted it, Netanyahu deleted the tweet.\nHe wrote: 'I was wrong. The things I said...should not have been said and I apologize for that.\n'I give full backing to all the heads of the security services.'\nNetanyahu criticized for response to crisis\nThe heads of the army and Shin Bet, and other members of the government, quickly apologized and took responsibility for the failure to detect the attack before it happened.\nBut it was 18 days before Netanyahu came close to doing so.\nAt that point he told the nation: 'This failure will be investigated thoroughly. Everyone will need to provide answers, myself included, but all of this will happen only after the war.'\nIn the days after the attack he did not make public visits to the injured in hospitals or go to funerals of victims.\nHe did not meet with families of the 200 Israeli hostages being held in Gaza until more than a week after the attack.\nThat was two days after Joe Biden spoke to families of U.S. citizens being held.\nPrime Minister Benjamin Netanyahu meets with representatives of Israeli hostages' families in Tel Aviv on October 28, 2023\nSenior Israeli officials defended Netanyahu from criticism, saying he was 'fully focused on winning the war.'\nBut he also faced criticism from those who said his government had failed to come to their aid in the wake of Hamas's murderous rampage.\nRuvi Dar, a clinical psychologist giving counseling to Israeli survivors, said: 'The government is completely incompetent. Any support that the refugees are getting right now is completely grassroots. Absolutely nothing by the state.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "The failures Benjamin Netanyahu will have to answer to after the war", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12695877/Gaza-Israel-Hamas-Palestine-Palestinian-Netanyahu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}