{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:45:59", "date_modify": "None", "date_publish": "2023-11-02 08:15:46", "description": "Some social media posts claimed that the fast food chain had given out 100,000 free meals to IDF soldiers during the first week of the war against Hamas.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fmcdonalds-comes-under-fire-giving-out-free-meals-israeli-soldiers-1721232.json", "image_url": "https://d.ibtimes.co.uk/en/full/1717587/mcdonalds-had-signed-legally-binding-agreement-britains-equality-human-rights-commission.jpg", "language": "en", "localpath": null, "maintext": "Several people on social media have been calling for a boycott of McDonald's after it came to light that its stores in Israel gave out free food to the Israel Defense Forces.\nThe fast food chain decided to give free meals to IDF soldiers during the first week of the war against Hamas.\nIn a statement issued after Hamas' October 7 attack on Israel, it said that it was donating meals to \"all those who are involved in the defence of the state, hospital, and surrounding areas\".\nSome social media posts claimed that it had given out 100,000 free meals. The move has sparked protests in the UK as well. On Wednesday, a man dumped dozens of live rodents dyed in the colours of the Palestinian flag at a McDonald's restaurant in Birmingham.\nA third mice released in a McDonald's this time in small heath Birmingham McDonald's https://t.co/7k6Y9c9Q5c pic.twitter.com/gqP8L96acU — London & UK Street News (@CrimeLdn) November 1, 2023\nThe video, which went viral on social media, shows the man draped in a Palestinian flag as he carried a box into the restaurant. He can also be heard shouting \"F*ck Israel\" as he drops the rodents on the floor.\n\"Boycott McDonald's. But don't punish the workers who are earning minimum wage. It's not fair on them to deal with this,\" a social media user commented.\n\"Throwing mice into a packed McDonald's in London while shouting Free Palestine, will not— in fact— free Palestine,\" wrote another.\n\"#BoycottMcDonalds\" is currently trending on TikTok with more than 30.5 million views under the hashtag.\nMeanwhile, its franchises in Saudi Arabia, Oman, Kuwait, the United Arab Emirates, Jordan, and Turkey have issued statements clarifying that they are in no way associated with what has been done at its stores in Israel. They have pledged support for Gaza.\n\"In regard to the news that McDonald's in Israel was donating meals. We affirm that it was an individual decision on their part,\" the Saudi McDonald's franchise said in a statement. \"Neither global McDonald's nor us nor any other country had a role or relationship with that decision, neither directly nor indirectly.\"\nThe Israeli franchise of the fast food chain is owned by Alonyal Ltd., according to a company statement. However, not much information is available about the company in question, per a Reuters report.\nThe October 7 attack and its aftermath:\nThe massive assault by Hamas militants resulted in the deaths of 1,400 people in Israel. They also took more than 200 people as captives. The Hamas gunmen crossed over into Israel by land, sea, and air, attacking the southern and central parts of Israel, including Tel Aviv and Jerusalem.\nIn retaliation for the Hamas attacks, Israel's prime minister formally declared war against the militant outfit.\nMore than 8,000 Palestinians, have since been killed in retaliatory Israeli strikes after the Hamas attack, according to the Gaza Health Ministry, which is also controlled by Hamas.\nNearly 30,000 buildings in northern Gaza have been damaged in Israeli airstrikes, while thousands have sustained injuries. A United Nations report has claimed that entire neighbourhoods have been reduced to rubble and over a million Palestinians have been displaced.\nUN experts have accused Israel of committing \"crimes against humanity\" and have called the Gaza blockade \"unspeakably cruel\".\nIt has called for an urgent ceasefire and the free movement of humanitarian aid, but to no avail.\nThe death toll has surpassed that of the third war between Israel and Hamas in 2014, according to the United Nations. It is the deadliest war for Israel since the 1973 conflict with Egypt and Syria.\nDozens of Hamas operatives were also killed in the targeted strikes, the Israeli armed forces said. Israel has vowed to continue to wipe out Hamas until they return all hostages to Israel and surrender.\nHowever, the catastrophic air strikes and increasing civilian death toll have caused concern regarding war crimes across the globe.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "McDonald's Comes Under Fire For Giving Out Free Meals to Israeli Soldiers", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/mcdonalds-comes-under-fire-giving-out-free-meals-israeli-soldiers-1721232"}