{"authors": ["Morgan Phillips", "Congress Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:45:59", "date_modify": "None", "date_publish": "2023-11-01 20:10:26", "description": "Florida Republican Rep. Brian Mast compared Palestinians to Nazis and said 'very few' of them are innocent in a wild tirade on the House floor.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12699193%2FRepublican-compares-Palestinian-civilians-Nazis-controversial-speech-House-floor-shortly-wearing-IDF-uniform-Congress.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/01/21/77288781-0-image-m-19_1698875095011.jpg", "language": "en", "localpath": null, "maintext": "Florida Republican Rep. Brian Mast compared Palestinians to Nazis and said 'very few' of them are innocent in a wild tirade on the House floor.\nWeeks ago Mast wore his military uniform from his time with the Israeli Defense Forces (IDF) to work on Capitol Hill.\n'As the only member to serve with both the United States Army and the Israel Defense Forces, I will always stand with Israel,' he wrote on X.\nMast, who lost both of his legs during a blast while serving in Afghanistan, volunteered with the IDF in 2015.\n'I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians. I don't think we would so lightly throw around the term innocent Nazi civilians,' the congressman said in a speech Wednesday.\nFlorida Republican Rep. Brian Mast compared Palestinians to Nazis and said 'very few' of them are innocent in a wild tirade on the House floor\n'I would encourage the other side to not so lightly throw around the idea of innocent Palestinian civilians. I don't think we would so lightly throw around the term innocent Nazi civilians,' the congressman said in a speech Wednesday\n'There are very few innocent Palestinian civilians. I haven't seen the videos of the innocent Palestinian civilians who were out there trying to protect the Israelis, that were out there trying to stop the attacks,' Mast went on.\nSince 2006, Hamas has ruled over the Gaza strip and its two million residents. Hamas won elections in a shock victory, winning 44 percent of the vote over Fatah's 41 percent, and no elections have been held since. Instead of sharing power with Fatah, Hamas began murdering Fatah members and the party largely fled to the West Bank.\nThe median age in Gaza is 18, meaning most of its residents were not eligible to vote in the last election.\nStill, there is a sentiment among some that Palestinians have not done enough to rise up against their brutal regime.\n'It’s an entire nation out there that is responsible,' Israeli President Isaac Herzog said last month. 'This rhetoric about civilians not aware, not involved, it’s absolutely not true. They could’ve risen up, they could have fought against that evil regime.'\nRep. Brian Mast spoke on the House floor on Wednesday\nPalestinians search for bodies and survivors among the rubble of the Jabalia refugee camp one day after an airstrike hit the area, in northern Gaza, 01 November 2023\nA man carries the body of a child killed in Israeli air strikes on Wednesday in Khan Yunis, Gaza\nA Palestinian man and a child injured in Israeli air raids arrive at Nasser Medical Hospital on Wednesday in Khan Yunis, Gaza\nAn October 7 attack by Hamas left 1,400 Israelis murdered and over 200 kidnapped, the IDF says. Israel's counter-offensive has killed some 8,500 Palestinians - according to the Gaza Health Ministry - though those figures have not been independently verified.\nOn Tuesday an Israeli strike on a refugee camp in northern Gaza that Hamas claims has killed more than 50 civilians. The IDF claimed the attack took out a senior Hamas commander and crumbled underground Hamas infrastructure.\nIsrael claims Hamas intentionally hides among civilians and it warned Palestinians to move south days ago.\nCongress is currently grappling with emergency Israeli aid. The House is set to vote Thursday on a $14 billion package that would be offset by cuts in funding to the IRS.\nThe Democratic-led Senate is unlikely to take it up, as Democrats argue the aid should not be offset and should be tied in with Ukraine and Taiwan military funding.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Republican compares Palestinian civilians to Nazis in controversial speech on the House floor - shortly after wearing an IDF uniform in Congress", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12699193/Republican-compares-Palestinian-civilians-Nazis-controversial-speech-House-floor-shortly-wearing-IDF-uniform-Congress.html?ns_mchannel=rssns_campaign=1490ito=1490"}