{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com In Minneapolis"], "date_download": "2024-02-05 15:46:03", "date_modify": "None", "date_publish": "2023-11-01 23:53:37", "description": "President Joe Biden was heckled by a rabbi protester at a closed Minneapolis where he defended his own efforts to tamp down Israel as it wages war on Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12700127%2FBiden-heckled-rabbi-Minneapolis-fundraiser-demands-ceasefire-takes-credit-tempering-Benjamin-Netanyahu-calls-pause.html.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/01/15/77271959-0-image-a-9_1698851196976.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden was last night confronted by a bearded female rabbi who demanded a ceasefire in Gaza - leaving the president claiming he had asked for a 'pause.'\nRabbi Jessica Rosenberg stood up during his speech in Minnesota and told the president: 'As a rabbi, I need you to call for a ceasefire right now.'\nBiden told her: 'I think we need a pause. A pause means give time to get the prisoners out.'\nHe added: 'I'm the guy that convinced Bibi (Netanyahu) to call for a ceasefire to let the prisoners out. I'm the guy that talked to (Egyptian President) Sisi to convince him to open the door.'\nThe White House later clarified that Biden was referring to the hostages - not prisoners - held by Hamas after its Oct. 7 attack on Israel in which 1,400 people were killed and more than 200 taken hostage.\nHe was heckled by Rosenberg while speaking to a crowd of 200 donors at a private Minneapolis fundraiser. The rabbi's striking appearance gave rise to questions as to whether she is trans, but Rosenberg herself deliberately avoids the issue.\nRabbi Jessica Rosenberg's striking appearance gave rise to questions as to whether she is trans, but Rosenberg herself deliberately avoids the issue\nPresident Joe Biden, pictured in Minnesota on Wednesday, was heckled by a rabbi demanding a ceasefire in Gaza\nRabbi Jessica Rosenberg stood up during his speech in Minnesota and told the president: 'As a rabbi, I need you to call for a ceasefire right now.'\nHer biography, which appears on various websites, states she is 'a Reconstructionist rabbi born, raised, and based in Philadelphia and the surrounding suburbs.\nShe became a rabbi in order to learn our people's diverse and nuanced histories, and create spaces, ritual, and organizing that helps transform our relationship to past, present and future.'\nShe describes herself as 'a queer Jewish woman obsessed with Jewish history', and has championed LGBTQ+ rights, as well as Palestinian issues.\nThe White House initially resisted calling for any reduction in Israel's bombing campaign, but on October 24 Antony Blinken, the Secretary of State, called for the first time for a 'humanitarian pause'.\nBlinken said 'humanitarian pauses must be considered' so that food, water, medicine and other essential humanitarian assistance can flow into Gaza.\nThe White House is now backing the idea of a 'pause' of indeterminate duration to allow for more aid to get to Gaza and to help those trying to gain safe passage out of the enclave.\nBut it does not back a ceasefire - a total cessation of hostilities - although in practical terms, the difference between a 'pause' and a 'ceasefire' is academic.\nNetanyahu has rejected all demands for a ceasefire.\nHe has, however, allowed in ambulances on Wednesday to remove injured people from Gaza, and paused the bombing campaign while the casualties are taken out.\nAs Rosenberg was removed, she chanted: 'Ceasefire now.'\nThe audience cheered Biden's answer and booed the protester.\n'I understand the emotion,' Biden told his supporters.\nThe protester identified herself to DailyMail.com as Jessica Rosenberg\nBenjamin Netanyahu is seen on October 14 speaking to soldiers preparing to invade Gaza\nIsraeli soldiers with armored fighting vehicles assemble along the Israeli border with Gaza as the IDF prepares for a massive ground invasion of its hostile neighbor\nA view of the remains of a mosque and houses destroyed by Israeli strikes in the central Gaza Strip\nThe drama came hours after Biden spoke to the 'devastating' images he has seen of children crying for their parents in Gaza on Wednesday, in one of his most powerful appeals yet to Israel, amid its assault on the territory.\nHe made the comment after the Israel Defense Forces struck a refugee camp for the second day in a row, in a bombing the government said took out a leading Hamas terror target.\nThe Biden administration has repeatedly spoken about the importance of following the 'rules of war' - while refusing to respond to individual incidents, or tell Israel publicly how to conduct the offensive.\nThe tightrope walk comes as the United States is preparing to send billions in new military aid to Israel.\n'We're going to continue to affirm that Israel has right to – and responsibility – to defend citizens from terror and needs to do so in a manner consistent with international and humanitarian law, but that prioritizes the protection of citizens,' Biden said.\nHe described the wrenching scenes coming out of Gaza, just weeks after 1,400 Israelis were killed during the October 7 Hamas attack.\nHamas, which controls Gaza, claims that 8,000 Gazans have been killed in the last three weeks by the bombing.\n'We've seen the devastating images from Gaza,' said Biden.\n'Palestinian children crying out for lost parents and parents reasoning and writing their children's names on their hands and legs to be identified.'\nA child in the crowd inside a barn at the Dutch Creek Farms in Northfield, Minnesota then let out cry of her own.\n'It's okay. Kids are allowed to do that. Don't worry about it,' Biden joked.\nHe asked if it was a boy or a girl who issued the cry.\nHe made the comment after the Israel Defense Forces struck a refugee camp for the second day in a row, in a bombing the government said took out a leading Hamas terror target\n'I don't blame her,' he joked, getting a laugh even amid the dark news.\nBiden also spoke about the breakthrough in negotiations to finally get some dual citizens out of Gaza, after the White House said a 'handful' of Americans were among those who got out on Wednesday as part of a broader deal.\n'This is a result of intense and urgent American diplomacy with our partners in the region,' Biden said.\n'I personally spent a lot of time speaking with the Prime Minister Netanyahu of Israel and President Sisi of Egypt and others to make sure that we could open this access for people to get out.'\nHe thanked partners in the region and singled out Qatar for working 'closely with us' in the talks.\nQatar has provided financial support to Hamas and hosts former Hamas leaders, but has also worked as a mediator for hostage negotiations. Hamas has freed four hostages so far.\n'At the same time, we're continuing to work to significantly step up the flow of critical humanitarian assistance in Gaza,' said Biden.\nIsrael has cut water and energy amid the start of its incursions into the territory, where Israeli troops are vulnerable to Hamas fighters above ground, and a network of miles of underground tunnels.\nEn route to Minnesota, national security spokesman John Kirby called the deal an 'important first step' and a 'significant breakthrough' to start getting the estimated 1,000 U.S. citizens who remain in Gaza out amid the fighting.\nBiden had a mostly uneventful flight to Minnesota, although the same can't be said of the reporters who followed him there.\nA Nighthawk helicopter ferrying reporters to the farm experienced four loud pops while taking off, and had to make an unscheduled landing at a public airport after smoke filled the cabin.\nThe reporters and photographers, including DailyMail.com, who follow Biden switched to a separate Osprey helicopter and quickly caught up with the president.\nBiden flew by helicopter to a Minnesota farm, where he spoke about his rural agenda and the situation in Gazas\nThe White House said an 'electrical issue' had triggered some preventative alarms, including an automatic fire suppressant.\nThe remarks came on a trip where Biden touted rural investments at an event that his White House team insists has nothing to do with his new primary challenger - who just happens to hail from the state.\nBiden's visit puts him back on the road amid a brewing international crisis overseas and an unexpected bump in his road to the Democratic presidential nomination.\nLast week, Rep. Dean Phillips, who represents the state's third congressional district, filed to run against Biden in the New Hampshire primary.\nWhite House Deputy Press Secretary Emilie Simons told reporters on Air Force One the event had been planned months in advance, after she was asked about a statement by Phillips welcoming Biden to the state for what Phillips called a 'last-minute trip.'\nBiden, with more than $71 million in his campaign war-chest, ordinarily might not have to sweat a challenge from a third-term Democrat who has backed much of his policy agenda.\nBut Biden helped rearrange the Democratic primary schedule this year, and as a consequence of New Hampshire jumping the gun on Democratic Party calendar rules, his name won't appear on the ballot.\nThat forces his party to organize a write-in campaign to avoid the potential humiliation of a loss to Phillips.\nThe state's primary is expected to buck a party-sanctioned calendar that lets South Carolina break tradition and go first.\nU.S. President Joe Biden is welcomed by Minnesota Governor Tim Walz and Gwen Walz, first lady of Minnesota, as he arrives in Northfield, Minnesota, U.S., November 1, 2023\nDown on the farm: President Biden heads to rural Minnesota Wednesday. His trip comes after Minnesota Democratic Rep. Dean Phillips announced he is running against Biden in New Hampshire\nAsked Tuesday if the visit had anything to do with Phillips, White House Press Secretary Karine Jean-Pierre once again invoked the Hatch Act as a shield.\n'I said this last week, and I'll say this again: We are very proud of – or very thrilled and thankful to – to the Congressman for voting with the President almost 100 percent of the time in the last two years, and I'll leave it there,' she said.\nThe Hatch Act limits politicking on government property or on government time.\nInstead, Jean-Pierre said the trip was about pushing Biden's rural agenda – while failing to mention Biden also has a fundraiser scheduled with a Democratic hedge funder set for Minneapolis before his return trip.\n'The President says this all the time. He's the president for everyone. Again, I just said this at the top earlier when I was answering this question to one of your colleagues. It doesn't matter if it's a red state, blue state -- it doesn't matter. He is a president for everyone,' she said.\nThe trip comes days after Rep. Dean Phillips (D-MN) announced he was challenging Biden in New Hampshire\nU.S. President Joe Biden visits a family farm in Kankakee, Illinois, U.S., May 11, 2022. He is set to be back on the farm in Minnesota Wednesday\n'So, it is important. It's not the first time he's going to a rural area to talk to Americans there. And so, he's going to do that tomorrow and talk about what he's done on behalf of this community, but on behalf of Americans across the country,' said Jean-Pierre.\nShe called Biden a 'president for everyone.'\n'You know, just as he goes to urban parts of the country, suburban parts of the country, to also visit rural areas of the country too,' she said.\nPhillips is experiencing his own problems.\nDemocrats from his state have been lining up behind Biden.\nAnd Rep. James C. Clyburn (D-South Carolina) accused him of not 'respecting' the head of the party by going against the new calendar.\nBiden allies aren't waiting to pile on Phillips.\nFormer Sen. Doug Jones (D-Ala.) told Politico: 'The reality is [Phillips'] bizarre effort running for president in the only state without delegates and with virtually zero support appears to be floundering less than a week after its launch — and throwing insults at one of the most revered and accomplished members of our party certainly isn't going to revive it.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden is heckled by rabbi at Minneapolis fundraiser who demands 'ceasefire now!'- then takes credit for tempering Israel's Benjamin Netanyahu and calls for a 'pause'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12700127/Biden-heckled-rabbi-Minneapolis-fundraiser-demands-ceasefire-takes-credit-tempering-Benjamin-Netanyahu-calls-pause.html"}