{"authors": ["Sayan Bose"], "date_download": "2024-02-05 15:16:48", "date_modify": "None", "date_publish": "2024-01-20 20:24:36", "description": "BALTIC states are racing to bolster defences on their borders with Russia and Belarus as Europe braces for an all-out war.Admiral Rob Bauer, chief of", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25429565%2Fbaltic-bunkers-trenches-dragons-teeth-putins-war-nato%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/2015-narva-estonia-town-estonias-154059022_cf0010.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "BALTIC states are racing to bolster defences on their borders with Russia and Belarus as Europe braces for an all-out war.\nAdmiral Rob Bauer, chief of NATO's military committee, has called on the West to \"prepare for an era of war\" - adding that the alliance \"needs a warfighting transformation\".\n7 Baltic Nations are preparing their borders with Russia and Belarus to defend against an attack from Moscow Credit: AFP\n7 Putin has made dozens of threats to the West since his invasion of Ukraine nearly two years ago Credit: Getty\n7 'Dragon's Teeth' tank barriers, along with a labyrinth of bunkers and trenches will be built as a part of the defence installations Credit: Reuters\n7\nEstonia, Latvia and Lithuania have agreed to build a series of bunkers on their borders with Russia and Belarus to protect their forces in the event of an attack, Estonia’s Defence Ministry announced on Friday.\nThe three NATO and EU members signed an agreement on the construction of \"anti-mobility defensive installations\".\nBaltic states are seen as most at risk from a potential Russian attack as they share their border with Russia and its ally Belarus.\nEstonia’s Defense Ministry said in a statement: \"The Baltic countries are one area of operations, and therefore [our] defence installations will be built in coordination with Latvia and Lithuania.\"\nHanno Pevkur, Estonian Defence Minister, said Russia's invasion of Ukraine has demonstrated the \"need for physical defensive installations on the border” as a firing war could soon be launched by Russia against Europe.\nPutin has made dozens of threats to the West since his invasion of Ukraine nearly two years ago.\nAnd recently, a leaked military report revealed what could be the Kremlin top's step-by-step plan to bring the West to the brink of World War 3 - and it starts in weeks.\nThe secret docs detail the despot's possible \"path to conflict\" which reaches its climax in the summer of 2025 on \"Day X\" when half a million Nato and Russian soldiers will face each other.\nTo counter the potential threat from Moscow, Estonia is planning to build 600 concrete bunkers with distribution lines - costing more than £55million - on its side of the border with Russia.\nEach bunker will be designed to accommodate 10 military troops for extended periods - and will also have life-support equipment.\nAccording to the sketches provided by the Estonian ministry, the wide range of bunkers will consist of T-shaped trenches, camouflaged by foliage.\nThese trenches are designed to withstand 152mm projectiles as well as direct enemy fire.\nIn addition to the labyrinth of bunkers, \"dragon's teeth\" tank barriers, barriers, minefields and barbed wire would also be stockpiled for installation if need be.\nIt comes as chances of World War Three continue to rise after the growing concerns about the escalations of regional wars.\nIt is feared that Putin's invasion of Ukraine could see Russian troops going beyond Ukrainian borders to launch attacks on Europe, forcing NATO to join the war.\nRussia's warmongering foreign minister Sergei Lavrov vowed a \"New World Order\" was emerging and promised the West that their time of \"global domination\" was over.\nIn a major press conference, the Kremlin crony blamed the US and its allies for launching a \"war\" against Russia and claimed Moscow and its pariah pals have now \"surpassed\" NATO on the world stage.\nJust a few days ago, Germany's Defence Minister made a bombshell claim, saying Putin could launch an attack on NATO \"in less than a decade\".\nHe added: \"We hear threats from the Kremlin almost every day... so we have to take into account that Vladimir Putin might even attack a Nato country one day.\"\nSweden - who could soon join the North Atlantic alliance - also issued a chilling warning, urging its citizens to \"brace for a war\".\nThe Swedish commander-in-chief Micael Bydén said: \"Russia’s war against Ukraine is just a step, not an end game.\"\nNATO has now announced its biggest call-up since the Cold War as 90,000 troops prepare to begin World War Three drills in a matter of days.\nDubbed Steadfast Defender, the military drill will begin next week and run to late May - and will involve units from all 31 NATO member countries plus candidate-member Sweden.\nTop commander Chris Cavoli said: \"The Alliance will demonstrate its ability to reinforce the Euro-Atlantic area by a transatlantic movement of forces from North America.\"\nTroops will be mobilised throughout Europe until the end of May in what is being called \"a simulated emerging conflict scenario with a near-peer adversary\" – essentially Russia.\nBaltic states - which are seen as most at risk from a potential Russian attack - will remain one of the most important locations for the drill.\nOn Monday, Defence Secretary Grant Shapps announced the deployment of all three Armed Forces to the 31-nation drill on Monday.\nSome 16,000 British troops will be sent with tanks, artillery and helicopters to deploy in eastern Europe from next month.\nTroops from the UK will be sent alongside the Royal Navy's two new aircraft carriers and eight warships.\nThe RAF's F-35 lightning attack aircraft will also be present and tested with imitated conflict scenarios.\n7 Estonia will build 600 concrete bunkers with distribution lines costing more than £55million Credit: Getty\n7 NATO has now announced its biggest call-up since the Cold War as 90,000 troops prepare to begin World War Three drills Credit: NATO/IMS/Polaris", "source_domain": "www.thesun.co.uk", "text": null, "title": "Baltic states unveil plan for labyrinth of bunkers, trenches & dragon's teeth on Vlad's border as Europe braces for war", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25429565/baltic-bunkers-trenches-dragons-teeth-putins-war-nato/"}