{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:46:06", "date_modify": "None", "date_publish": "2023-11-01 23:58:20", "description": "The United States 'shares the blame' for failing to predict the Hamas attack, an ex-CIA official has said, because it took its eye off the terror group after 9/11 and focused on al-Qaeda instead.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12700135%2Fhamas-attack-intelligence-failure-cia-blame.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/02/02/77299455-0-image-a-43_1698892003735.jpg", "language": "en", "localpath": null, "maintext": "The United States 'shares the blame' for failing to predict the Hamas attack on Israel, an ex-CIA official has said, because it took its eye off the terror group after 9/11 and focused on al-Qaeda instead.\nMarc Polymeropoulos, a retired CIA operations officer with extensive counterterrorism experience, told The Wall Street Journal the U.S. was wrong to leave surveillance of Hamas to the Israelis.\n'In terms of intelligence failures, which really do lie mostly on Israel, I think we should also share some blame for missing this event,' he said.\n'Ceding the target to the Israelis now looks to have had consequences.'\nHamas militants snatched 230 hostages from kibbutz communities, a music festival, towns and military bases across southern Israel during the October 7 attack\nHamas terrorists are seen on October 7 in Gaza, driving towards the border fence with Israel\nHamas terrorists are pictured on October 7 taking selfies in front of a burning Israeli tank by the Gaza border wall\nMarc Polymeropoulos, a retired CIA operations officer with extensive counterterrorism experience, told The Wall Street Journal the U.S. was wrong to leave surveillance of Hamas to the Israelis\nThe United States kept an eye on Hamas, with a few analysts at the CIA tasked with monitoring the group - which was elected to control Gaza in 2006.\nBut the bulk of their efforts went on watching al-Qaeda and then Islamic State, because U.S. officials calculated that those two in particular posed a threat to the United States.\nIt should have been 'a well-placed bet,' one senior counterterrorism official told The Wall Street Journal.\nU.S. intelligence agencies have a budget of $90 billion, but even so must prioritize their targets.\nThe demands in recent years have swung towards surveillance on China, with less emphasis on the Middle East, officials have said.\nJonathan Schanzer, who tracked Hamas as a U.S. Treasury terrorism finance analyst, said that the focus on Hamas' financing reduced after 9/11, as first Barack Obama, and then Biden, sought to build trust with Iran.\nSchanzer, who now works at the Foundation for Defense of Democracies, said there needed to be a review of what the U.S. was doing to combat Iranian-backed terror groups.\n'There should be one. If there isn't, it's foreign policy malpractice,' he said.\nIntelligence experts said it was not easy to determine where the money and resources should be allocated.\n'There's a really hard prioritization exercise that has to go on,' a second former counterterrorism official said.\n'The reality is that you don't have collection resources that you can exploit all over the world.\n'We have to rely on partners for areas where we think we can take a little risk.'\nOne source told The Wall Street Journal that Hamas was not on the 'bottom rung' of the list of priorities - but they were not in the top half.\nSome defended the U.S. approach, pointing out that after 9/11 al-Qaeda was significantly more of a threat to U.S. lives.\nThe terror group killed nearly 3,000 Americans in September 2001, bombed American embassies and conducted many other deadly terrorist attacks.\n'I don't recall at the time anybody saying you were focusing too much on al-Qaeda,' a former senior CIA official said.\nThe debate within the U.S. intelligence community comes as Israel's own spy agencies face serious questions about the massive lapse.\nPrime Minister Benjamin Netanyahu in the early hours of Sunday appeared to blame security and intelligence officials for failing to detect signs that Hamas's devastating invasion was imminent - and was then forced to apologize.\n'Never, under any circumstance, was prime minister Netanyahu alerted to Hamas' intent to launch a war,' wrote Netanyahu, in the now-deleted post.\n'On the contrary, all security officials, including the head of military intelligence and the head of Shin Bet (Israel's internal security agency), believed Hamas was deterred.\n'This was the evaluation that was submitted time and again to the prime minister and the (security) cabinet by all security officials and the intelligence community, right until the war broke out.'\nPrime Minister Benjamin Netanyahu appeared to blame security and intelligence officials for failing to detect signs of Hamas 's devastating invasion\nThe post was published on X hours after Netanyahu gave a press conference late on Saturday, in which he was asked if he had been warned about the danger of an attack.\nNetanyahu said there had been a 'terrible failure' before the attacks, during which Hamas militants also snatched 230 hostages from kibbutz communities, a music festival, towns and military bases across southern Israel.\n'There was a terrible failure and this will be examined intensively,' he told the press conference.\n'No stone will be left unturned. For the moment, my mission is to save the country, and lead the soldiers to a total victory over Hamas and the forces of evil.'\nHis post was deleted on Sunday morning and replaced a few minutes later.\n'I was wrong,' he declared in the new post.\n'Things I said following the press conference shouldn't have been said, and I apologise for that.\n'I fully back all the heads of the security establishment. I back the military chief of staff, and the commanders and soldiers of the IDF (Israel Defense Forces) who are on the front and fighting for our home. Together we will win,' he wrote.\nBenny Gantz, a retired general and member of Israel's war cabinet, urged Netanyahu to retract the statement.\nIsrael's opposition politician Yair Lapid also slammed Netanyahu, saying the PM 'crossed a red line'.\nLapid criticized the government for not being 'present' and 'failing to emerge from the shock' of October 7.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US 'shares the blame' for failing to predict the Hamas attack on Israel, ex-CIA official says", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12700135/hamas-attack-intelligence-failure-cia-blame.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}