{"authors": ["Robert Tait"], "date_download": "2024-02-05 15:46:13", "date_modify": "None", "date_publish": "2023-11-01 01:23:39", "description": "In hearing interrupted by protesters, Antony Blinken and Lloyd Austin try to beat Republican attempts to kill $106bn package", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Foct%2F31%2Fbiden-administration-republicans-israel-ukraine-emergency-military-aid.json", "image_url": "https://i.guim.co.uk/img/media/faa02899487e3ae12441ddde18835891a2cde11e/0_0_4944_2966/master/4944.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c34880c4767d8b5b7a4d812a6566d9d2", "language": "en", "localpath": null, "maintext": "The Biden administration took its quest for emergency military aid for Israel and Ukraine to Capitol Hill on Tuesday in an all-out effort to overcome House Republican attempts to decimate a $106bn package while cutting key parts of the White House’s domestic policy.\nIn a stormy session interrupted several times by demonstrators, the US secretary of state, Antony Blinken, and defense secretary Lloyd Austin, told a Senate hearing that assistance to both countries was closely linked and should not be decoupled, as demanded by leading Republicans who are keen to back Israel but oppose any further help for Ukraine.\nBlinken and Austin said this after Mike Johnson, the new rightwing speaker of the House of Representatives, introduced a bill proposing that aid be limited to $14.3bn for Israel and linked to budget cuts for the Internal Revenue Service (IRS), the US tax authority, which the Biden administration has beefed up as part of its Inflation Reduction Act.\nThe legislation would also make no provision for continuing to help Ukraine as it tries to repel Russian forces.\nJohnson’s plan was in line with growing opposition among Republicans for support for Ukraine and a direct response to the aid program outlined by Joe Biden in the wake of Hamas’ attack on Israel on 7 October, in which at least 1,400 Israelis were killed and more than 200 taken hostage. The US president called for increased aid to both countries, arguing it would safeguard “American security for generations”.\nThe Republican bill was supported by most of the hard-right faction that promoted Johnson’s elevation to the House speakership last week. The Florida congressman, Matt Gaetz, one of Johnson’s most vocal backers, had tweeted earlier: “Israel is a land with a 4,000-year connection to our faith. Ukraine is a former Soviet state. These are not the same thing, and should be considered independently.”\nBut the move came under concerted attack from Democrats and also put the new speaker at odds with many members of his own Republican conference, as well as the party’s leader in the Senate, Mitch McConnell, who has backed Biden’s aid plan, which includes $61bn for Ukraine, defense funding for US allies in the Indo-Pacific, and $14bn to shore up the southern border.\nThe Democratic Senate majority leader, Chuck Schumer, said the Republican proposal had “the hard-right’s fingerprints all over it”.\nBut Johnson defended his bill on Tuesday, telling Fox News: “If you put this to the American people and weigh the two needs, I think they will say standing with Israel and protecting the innocent is a more immediate need than IRS agents,” he said.\nBlinken – who was heckled several times by members of the Code Pink group protesting the administration’s support for Israel and refusal to back a ceasefire in Gaza – linked aid to Israel and Ukraine to Iran, a country known to support Hamas and maintain an alliance with Russia.\n“The conflicts in Ukraine and the Middle East have clear links,” he told senators. “Since we cut off Russia’s traditional means of supplying its military, it’s turned more and more to Iran for assistance. In return, Moscow has supplied Iran with increasingly advanced military technology, which poses a threat to Israel’s security. Allowing Russia to prevail with Iran’s support will simply embolden both Moscow and Iran.”\nskip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThe secretary of state later met Johnson in an attempt to lay out the administration’s case, telling reporters it was “a really positive meeting”.\nJohnson had earlier received a letter from a bipartisan group of congressional Republicans and Democrats urging him to back down.\n“The United States must not shrink from the burdens of our responsibilities as we and our fellow democracies across the world face threats not seen in decades,” said the letter, signed by House Republican Joe Wilson, plus three Democrats, Marcy Kaptur, Brad Schneider and Debbie Wasserman Schultz.\n“We beseech you not to separate aid for Israel’s fight to rescue its hostages and secure its borders from Ukraine’s fight to do the same, or from Taiwan’s efforts to deter a war.”\nBiden would veto a House of Representatives Republican bill to provide aid to Israel but not Ukraine, which includes cuts to funding for the IRS, were it to pass both chambers, the White House said on Tuesday.", "source_domain": "www.theguardian.com", "text": null, "title": "Top Biden officials urge Congress to pass military aid for Israel and Ukraine", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/oct/31/biden-administration-republicans-israel-ukraine-emergency-military-aid"}