{"authors": ["Chris Stein"], "date_download": "2024-02-05 15:46:18", "date_modify": "None", "date_publish": "2023-11-01 20:01:32", "description": "Nonpartisan Congressional Budget Office estimates new speaker’s plan would increase borrowing by $12.5bn over the 10 years from 2024", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2Flive%2F2023%2Fnov%2F01%2Fhouse-republicans-expel-censure-israel-ukraine-funding-biden-politics-latest.json", "image_url": "https://i.guim.co.uk/img/media/1b0024e269042319655098957f05c2d8d5574a5a/0_86_5700_3420/master/5700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=f8be0a61097fdd6d55e349a41300414a", "language": "en", "localpath": null, "maintext": "From 1 Nov 2023 17.40 CET Johnson 'not surprised' proposal to cut IRS would cost taxpayers more NBC News caught up with Mike Johnson, who chalked up the nonpartisan Congressional Budget Office’s determination that his Israel aid proposal would actually cost taxpayers money to the machinations of Washington: .@SpeakerJohnson said he was “not surprised at all” by the nonpartisan Congressional Budget Office score.\n“Only in Washington when you cut spending do they call it an increase in the deficit,” Johnson said. https://t.co/4CvOtEsSdd — Kyle Stewart (@KyleAlexStewart) November 1, 2023 Punchbowl News separately caught two rightwing senators heading into Johnson’s office, and report they are expected to support his bill: NEWS -- Sens. RON JOHNSON and RICK SCOTT are meeting with Speaker @SpeakerJohnson to discuss israel/ukraine package -- they will express their support for Johnson's bill.\nThey will then walk to the Mansfield Room for the Senate GOP lunch — Jake Sherman (@JakeSherman) November 1, 2023 But it is the Senate’s Democratic leader, Chuck Schumer, who will decide whether the measure comes to the floor, and he has said he will not do that.\nUpdated at 19.40 CET\n1 Nov 2023 20.53 CET We’ve talked plenty about the resolution to expel George Santos on this blog today, so let’s dive in to the dueling efforts to censure progressive Democrat Rashida Tlaib and far-right Republican Marjorie Taylor Greene. Greene introduced the resolution targeting Tlaib, one of two Muslims in the House and the only Palestinian American, accusing her of antisemitism and participating in an insurrection: Rashida Tlaib is an anti-Semite, pro-Hamas, and led an insurrection into the Capitol complex.\nEvery member of Congress will be on record. Including every Democrat.\nWill they condemn Rashida Tlaib’s hatred or support her sympathy for terrorists? pic.twitter.com/vRBjGlH3Hz — Rep. Marjorie Taylor Greene🇺🇸 (@RepMTG) October 26, 2023 Greene is an enthusiastic supporter of Donald Trump’s lie that he won the 2020 election, and has taken part in efforts to downplay the severity of the January 6 attack on the Capitol. The insurrection she accuses Tlaib of participating in was a protest in a House office building where hundreds of people were arrested in what organizers described as planned acts of civil disobedience. Tlaib spoke to the protesters before they entered the building, which, unlike the Capitol building that rioters stormed on January 6, is open to the public. Tlaib, who is a vocal opponent of Israel’s government and its treatment of the Palestinians, rejected the charge of antisemitism in a statement: My statement on Marjorie Taylor Greene’s effort to censure me. pic.twitter.com/dzUNflJPh2 — Congresswoman Rashida Tlaib (@RepRashida) October 26, 2023 The same day Greene introduced her resolution to censure Tlaib, Vermont Democrat Becca Balint introduced a separate resolution to censure the Georgia congresswoman, accusing her of spreading racist conspiracy theories, Islamophobia and also being antisemitic: There is no place for anti-semitic, Islamophobic, anti-LGBTQ, racist rhetoric and conspiracy theories in the House of Representatives.\nI move to censure Marjorie Taylor Greene. https://t.co/MIFuM5Ip8b — Rep. Becca Balint (@RepBeccaB) October 26, 2023 Ever since assuming the majority in the House at the start of the year, Republicans have moved to retaliate against Democrats who attracted their ire. The party censured Adam Schiff, a prominent Donald Trump antagonist, and booted Ilhan Omar, the second Muslim in the chamber and a prominent progressive, off the foreign affairs committee.\nUpdated at 20.56 CET\n1 Nov 2023 20.26 CET Votes on Santos expulsion, Tlaib, Greene censure expected this evening The House is expected to vote on whether to expel Republican congressman and admitted fabulist George Santos sometime after 6.30pm this evening, Democratic whip Katherine Clark’s office has announced. Lawmakers will also consider resolutions to censure far-right Republican congresswoman Marjorie Taylor Greene and progressive Democrat Rashida Tlaib. Congress’s lower chamber is currently in session, with lawmakers debating several pieces of legislation proposed in response to Hamas’s attack on Israel last month. Speaking of which, we have a separate live blog covering the latest events in the spiraling conflict, and you can follow it here: Israel-Hamas war live: hundreds of foreign nationals leave Gaza; rights violations against children ‘mounting by the minute’, says UN Read more\nUpdated at 20.36 CET\n1 Nov 2023 20.04 CET Judge appears willing to delay Trump classified documents case Hugo Lowell At a hearing in Florida today, federal judge Aileen Cannon seemed open to extending legal deadlines in Donald Trump’s classified documents case, potentially delaying his trial. Opening arguments in the case are set to start in May 2024, but Cannon noted that timetable could conflict with the former president’s trial on separate charges related to trying to overturn the 2020 election, which is scheduled to begin in March. In addition to those federal cases, Trump has also been indicted in Georgia for trying to overturn the 2020 election there, and for falsifying business documents in Manhattan. For more details, here’s our rundown of Trump’s legal problems: Donald Trump case tracker: where does each investigation stand? Read more\nUpdated at 20.09 CET\n1 Nov 2023 19.42 CET Donald Trump Jr may testify today in family’s fraud trial Meanwhile in New York City, the civil fraud trial of Donald Trump and his family members is continuing. Donald Trump Jr may at some point today take the witness stand in the proceedings, in which a judge is determining what penalties to impose after finding the Trump family committed fraud in their organization’s business practices. We have a live blog covering the latest in the case, which could potentially lead to the dismantling of the former president’s business empire. Follow along here: Trump fraud cost lenders $168m, witness for prosecution argues at trial – live Read more\nUpdated at 19.49 CET\n1 Nov 2023 19.22 CET Another House Republican has decided against standing for re-election next year. Ken Buck told MSNBC he won’t stand again to represent his eastern Colorado district: Rep. Ken Buck (R-CO) won't seek reelection.\n“I always have been disappointed with our inability in Congress to deal with major issues & I’m also disappointed that the Republican Party continues to rely on this lie that the 2020 election was stolen & rely on the 1/6 narrative.” pic.twitter.com/YStr3QjFy7 — The Recount (@therecount) November 1, 2023 A member of the rightwing Freedom Caucus, Buck made waves in September when he penned a Washington Post column saying he did not believe impeaching Joe Biden was a good idea. His district is seen as strongly Republican, and Democrats will have an uphill battle to claim the vacant seat in 2024.\n1 Nov 2023 19.00 CET Martin Pengelly In cricket – and stick with me here – the “corridor of uncertainty” is a channel just outside off stump, which bowlers try to ply and in which batsmen must decide whether to play a shot or leave the ball alone, weighing up risk in the blink of an eye. View image in fullscreen Manu Raju. Photograph: Jonathan Ernst/Reuters In Congress, the corridors of uncertainty might be said to be any corridors in which Manu Raju, chief congressional correspondent for CNN, might decide to linger, thereby to catch congressmen and women and senators for a quick question about the issue of the day. Today, Raju, a master of the form, has been asking Republican senators about the proposal from the House GOP, newly under speaker Mike Johnson, to split Israel aid from Ukraine aid and to target the Internal Revenue Service for linked cuts. Here are some results: Rick Scott, Florida: “We have a Republican majority in the House. And so we have to listen to what they want to do.” Josh Hawley, Missouri: “I think it’s notable that [Republican Senate leader Mitch McConnell] is standing with [Democratic majority leader Chuck] Schumer against the Republicans. [It’s] a mistake.” Lindsey Graham, South Carolina: “I like paying for things but in emergencies, we normally don’t. Democrats could put a ‘pay-for’ that I would disagree with. So when it gets over here, we’ll hopefully put a package together that includes Israel, Ukraine and border security.” Raju, to camera: “So that last comment from Lindsey Graham is a significant one, saying he’s concerned about including those measures to suddenly pay for that Israel package, saying that typically is not done on Capitol Hill and considering the number of concerns about the precedent it would set if that were to happen time and time again. On the other side of the equation, concerns about the sky-high national debt. “So that is the tension that is now playing out within the Republican party, but in the middle of all this is: what is the future of Israel aid? What’s the future of Ukraine [aid]? No one knows for certain how this will play out amid major concerns … both of those issues could get stalled or potentially fall by the wayside.”\nUpdated at 19.04 CET\n1 Nov 2023 18.38 CET Martin Pengelly In a Guardian exclusive, Dharna Noor reveals plans for climate groups to tour the US, pushing for a Green New Deal … One year after the passage of the much-lauded Inflation Reduction Act, a coalition of organizers and representatives are relaunching the push for a Green New Deal with a national tour. “The Inflation Reduction Act was the largest climate investment in US history,” said John Paul Mejia, a national spokesperson for the youth-led climate justice organization the Sunrise Movement, one of the groups hosting the tour. “But for the next 10 years, we should work to make [it] the smallest by winning stuff that’s much larger.” The tour, which kicks off with an event in Michigan this month, will aim to showcase widespread support for even bolder federal climate action, and will feature Green New Deal champions including Senator Ed Markey of Massachusetts and the representatives Ilhan Omar, Jamaal Bowman, Cori Bush and Summer Lee alongside local advocates. It will be led by the Green New Deal Network, a coalition of progressive environmental groups that includes the Sunrise Movement, Greenpeace and Climate Justice Alliance, social justice organizations such as People’s Action and the Movement for Black Lives, and the liberal-left Working Families political party. Supporters are calling for stronger executive action as well as the passage of a suite of proposals in Congress. “With our Green New Deals for public schools, housing, cities and more, we can make historic investments that transform our communities by repairing damage done by the fossil fuel-driven climate crisis and giving every person the resources they need to thrive,” said Bowman. The Green New Deal – a plan to rapidly and fairly decarbonize the US economy and create millions of jobs in the process – swept the US progressive political scene during Donald Trump’s presidency. The Sunrise Movement in 2018 held sit-ins on Capitol Hill calling for its implementation, and months later, Markey and the New York representative Alexandria Ocasio-Cortez unveiled an official resolution fleshing out the proposal. The ambitious, sweeping vision hinged on the idea that tackling the climate crisis could entail the remaking of US society to be more just, prioritizing communities most affected by inequality, climate disasters and pollution. It sharply contrasted with previous national decarbonization plans, such as the failed 2009 attempt to create a cap-and-trade system for planet-heating pollution known as Waxman-Markey. “During that Inconvenient Truth era, climate advocacy was very technocratic in some ways,” said Kaniela Ing, the national director of the Green New Deal Network and a former Hawaii state legislator, referring to the 2006 documentary on the climate crisis by the former US vice-president Al Gore. “But the Green New Deal was about how all these things are connected, how climate is connected to schools, better infrastructure … things that people actually want.” Read on… Climate groups launch national tour for Green New Deal Read more\nUpdated at 18.46 CET\n1 Nov 2023 18.17 CET Martin Pengelly The new Republican speaker of the US House, Mike Johnson, is “dangerous”, the former Wyoming congresswoman and January 6 committee vice-chair Liz Cheney said, considering Johnson’s role in Donald Trump’s attempt to overturn the 2020 election. View image in fullscreen Liz Cheney. Photograph: Mark J Terrill/AP “He was acting in ways that he knew to be wrong,” Cheney told Politics Is Everything, a podcast from the University of Virginia Center for Politics. “And I think that the country unfortunately will come to see the measure of his character. “… One of the reasons why somebody like Mike Johnson is dangerous is because … you have elected Republicans who know better, elected Republicans who know the truth but yet will go along with the efforts to undermine our republic: the efforts, frankly, that Donald Trump undertook to overturn the election.” Johnson voiced conspiracy theories about Joe Biden’s victory in 2020; authored a supreme court amicus brief as Texas sought to have results in key states thrown out, attracting 125 Republican signatures; and was one of 147 Republicans who voted to object to results in key states, even after Trump supporters attacked the Capitol on 6 January 2021, a riot linked to nine deaths and which has produced thousands of arrests and hundreds of convictions, some for seditious conspiracy. Cheney was one of two anti-Trump Republicans on the House January 6 committee, which staged prime-time hearings and produced a report last year. She lost her seat to a pro-Trump challenger. The other January 6 committee Republican, Adam Kinzinger of Illinois, chose to quit his seat. Like Kinzinger, Cheney has written a book. She has also declined to close down speculation that she might run for president, as a representative of the Republican establishment – her father is Dick Cheney, the former defense secretary and vice-president – determined to stop Trump from seizing the White House again. Johnson ascended to the House speakership last month, elected unanimously after three candidates failed to gain sufficient support to succeed Kevin McCarthy, who was ejected by the far-right, pro-Trump wing of his party. Johnson’s hard-right, Christianity-inflected views and past positions have been subjected to widespread scrutiny. Cheney told Larry Sabato, her podcast host and fellow UVA professor, that Johnson “was willing to set aside what he knew to be the rulings of the courts, the requirements of the constitution, in order to placate Donald Trump, in order to gain praise from Donald Trump, for political expedience. “So it’s a concerning moment to have him be elected speaker of the House.”\nUpdated at 18.32 CET\n1 Nov 2023 17.40 CET Johnson 'not surprised' proposal to cut IRS would cost taxpayers more NBC News caught up with Mike Johnson, who chalked up the nonpartisan Congressional Budget Office’s determination that his Israel aid proposal would actually cost taxpayers money to the machinations of Washington: .@SpeakerJohnson said he was “not surprised at all” by the nonpartisan Congressional Budget Office score.\n“Only in Washington when you cut spending do they call it an increase in the deficit,” Johnson said. https://t.co/4CvOtEsSdd — Kyle Stewart (@KyleAlexStewart) November 1, 2023 Punchbowl News separately caught two rightwing senators heading into Johnson’s office, and report they are expected to support his bill: NEWS -- Sens. RON JOHNSON and RICK SCOTT are meeting with Speaker @SpeakerJohnson to discuss israel/ukraine package -- they will express their support for Johnson's bill.\nThey will then walk to the Mansfield Room for the Senate GOP lunch — Jake Sherman (@JakeSherman) November 1, 2023 But it is the Senate’s Democratic leader, Chuck Schumer, who will decide whether the measure comes to the floor, and he has said he will not do that.\nUpdated at 19.40 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Johnson ‘not surprised’ his proposal to cut IRS budget to fund Israel would cost taxpayer money - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/live/2023/nov/01/house-republicans-expel-censure-israel-ukraine-funding-biden-politics-latest"}