{"authors": ["Adam Cailler", "Image", "Eyepress News Rex Shutterstock", "Afp Getty Images", "Afp Via Getty Images"], "date_download": "2024-02-05 15:46:20", "date_modify": "None", "date_publish": "2023-11-01 09:43:38", "description": "The dad of Liverpool's Colombian star Luis Diaz has been taken hostage while his mum was also captured and realised as the realities of one of the country's most gang-ridden areas have been revealed", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fworld-news%2Finside-cartel-torn-ganglands-prem-31330907.json", "image_url": "https://i2-prod.dailystar.co.uk/incoming/article31331027.ece/ALTERNATES/s1200/3_Members-of-the-Colombian-National-Liberation-Army.jpg", "language": "en", "localpath": null, "maintext": "Never miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nThe realities of life inside one of gang-ridden Colombia's most dangerous areas has been revealed, with abductions and cartel battles a common sight.\nLa Guajira, part of the country's northern desert region, is the home of Liverpool star Luis Diaz, and is now the site of a huge search after his parents were abducted last week. The Colombian international's mother is now free but authorities have stepped up the search for his missing dad Luis Manuel Diaz, and have been carrying out aerial patrols across the Perija mountain range, which straddles the border with Venezuela and is covered by a forest.\nA reward of up to £40,000 for information leading to the release or rescue of him has been offered, but so far the football remains in Liverpool awaiting news. However, the area has been described as a place where “illegal coexists with legal” by an expert in armed conflicts in La Guajira.\nREAD MORE: Chechen warlord demands Russian police shoot 'Jew hunt' rioters 'in the head' next time\nFor more news, click here.\n(Image: AFP/Getty Images)\nSpeaking to BBC's Spanish news website, Luis Fernando Trejos said: “In La Guajira there has always been some type of illegal bonanza that has coexisted, in a normal way, with what is legal. To the humanitarian drama we must add the structural corruption that has generated a culture of deep-rooted illegality.\"\n“Colombia was the country in the world where the most kidnappings took place and that is why there is a certain normalizsation of the fact – all the illegal subsidiaries had a kidnapping industry.\"\n(Image: AFP via Getty Images)\nThe area is run by two main cartel groups – the Gaitanista Self-Defense Forces of Colombia which is part of the Colombian National Liberation Army, and the Luciana Ariza and 6 de Diciembre group. The former has 4,000 gang members across around half of Colombia's 32 regions, while the latter is thought to have around 2,000 fighters and is official designated as a terrorists group by the United States and European Union, killing 21 police cadets with a car bomb in 2019.\n(Image: AFP/Getty Images)\nSpeaking to The Sun, Elizabeth Dickinson, an expert on Colombia's organised crime scene said: “They are seeking to consolidate its corridor for trafficking along the Atlantic coast, as well as to engage in lucrative extortion and protection rackets. Increasingly, the groups use social control as a means to dominate territory.\n\"Extortion is one example; everyone from a small businessperson to a large landowner will be asked to pay a fee to the group. Other examples include curfews, setting rules on commerce, and penalising allegedly socially deviant behaviour.\n(Image: AFP via Getty Images)\n“Then there are the violent punishments for those who fail to comply with these and other rules.”\nAs it stands, no word has been given on which group is responsible for the kidnapping of the Liverpool player's parents – and continued hostage situation with his father – but he remains in the UK after being advised not to go, with his club giving him compassionate leave to do so. A club spokesman said: “\"It is our fervent hope that the matter is resolved safely and at the earliest possible opportunity. In the meantime, the player’s welfare will continue to be our immediate priority.”\nTo stay up to date with all the latest news, make sure you sign up to one of our newsletters here.", "source_domain": "www.dailystar.co.uk", "text": null, "title": "Inside cartel-torn ganglands where Prem star Luis Diaz's parents were snatched", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/world-news/inside-cartel-torn-ganglands-prem-31330907"}