{"authors": ["Fiona Parker", "Nataliya Vasilyeva", "Dominic Penna", "Middle East Correspondent", "In Jerusalem", "Political Correspondent"], "date_download": "2024-02-05 15:46:21", "date_modify": "None", "date_publish": "2023-11-01 00:00:00", "description": "Strict border controls to Egypt lifted after tense negotiations, but process for departures is mired in confusion", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2023%2F11%2F01%2Fforeign-nationals-released-gaza-in-stages%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/news/2023/11/01/TELEMMGLPICT000355212339_16988729416670_trans_NvBQzQNjv4BqLFvFcbCCSSPOPEZoCZQZEkikPYR0xYwuEBLwP9UFqPg.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "The first British citizens left Gaza on Wednesday night – but many more were turned away as the border was partially opened in a deal to allow trapped foreign nationals to leave.\nAfter more than three weeks of tense diplomatic negotiations, strict border controls to Egypt were lifted, enabling selected civilians to flee three weeks of war.\nAt least 320 foreign passport holders out of some 9,000 trapped in the Hamas-controlled Gaza Strip, which has been under constant bombing, are understood to have crossed into Egypt.\nOn Wednesday night, Rishi Sunak said it was crucial to bring foreign nationals and hostages home, but the Government faced criticism for failing to provide clear instructions to stranded Britons and their families.\nText messages sent to Britons in Gaza by the Foreign Office on Tuesday night said there were “credible reports” that the border crossing would be open for “limited exits” the following day, prompting many to make the perilous journey to Rafah the next day.\nUpon arrival, many were turned away because their names were not included on a list of those approved for leaving.\nBy Wednesday night, it is thought as few as two British citizens had been evacuated – both understood to work for non-governmental organisations in Gaza.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "First Britons leave Gaza - but others are turned back", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/news/2023/11/01/foreign-nationals-released-gaza-in-stages/"}