{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Gloria Oladipo", "Tom Bryant", "Amy Sedghi", "Kevin Rawlinson"], "date_download": "2024-02-05 15:16:49", "date_modify": "None", "date_publish": "2024-01-20 02:43:52", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F19%2Fmiddle-east-crisis-live-news-updates-israel-gaza-war-houthi-rebels-yemen-russia-china-ships-red-sea-crisis-attacks.json", "image_url": "https://i.guim.co.uk/img/media/a4c5a61b5cf7d871723f92f22bc3554f6d5fe6b7/0_216_6400_3839/master/6400.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=de8b897268f6aafcdfc0ed71c4bb7b9d", "language": "en", "localpath": null, "maintext": "From 19 Jan 2024 20.51 CET US says 'we don't support a ceasefire at this time' The US still opposes a ceasefire in Gaza, the White House said on Friday. Kirby said that the US still opposes a ceasefire, believing that such a move would help Hamas militants. “We do support humanitarian pauses, as I said, to try to get hostages out and more aid in, but we don’t support a ceasefire at this time,” Kirby said during a news briefing on Friday. “I think it’s important to remember that there was ceasefire in place on 6 October,” Kirby added.\nUpdated at 21.40 CET\n20 Jan 2024 02.51 CET Here’s more on the White House saying Israel will allow shipments of flour for Palestinians through the Israeli port of Ashdod, north of Gaza. The move comes after the US president, Joe Biden, and Israel’s prime minister, Benjamin Netanyahu, spoke for the first time in nearly a month and follows the UN calling on Israel to allow access to the port for the urgent delivery of humanitarian aid for besieged Gaza, Agence France-Presse reports. Biden welcomed the Israeli decision on the port, the White House said, adding that US teams would “separately work on options for more direct maritime delivery of assistance into Gaza”. Three UN agencies – the World Food Programme (WFP), Unicef and the World Health Organisation – pushed for the opening of Ashdod in a joint statement on Monday. The use of Ashdod, about 40km (25 miles) north of the Gaza border, was “critically needed by aid agencies”, they said, while calling for a “fundamental step change in the flow of humanitarian aid into Gaza”. The Israel-Hamas war has sparked a humanitarian catastrophe for Gaza’s 2.4 million people, who are struggling to get food, water, fuel and medical care. Opening the Ashdod port would reduce the time it took to transport food from the north to Palestinians in Gaza, WFP’s regional director for the Middle East, Corinne Fleischer, said this month.\n20 Jan 2024 02.19 CET Hezbollah warns Israel of 'slap in face' if cross-border strikes escalate A leader in the Lebanese militant group Hezbollah has warned that Israel would “receive a real slap in the face” if it expanded the conflict along the Lebanon-Israel border. Since Hamas’s deadly 7 October attack on Israel there have been near daily exchanges of cross-border fire between the Israeli army and Iran-backed Hezbollah, an ally of the Palestinian militants. Hezbollah’s number two, Naim Qassem, said in a statement on Friday: If Israel decides to expand its aggression, it will receive a real slap in the face in response. Any restoration of stability on the border was contingent on “the end of the aggression in Gaza”, he added, in comments reported by Agence France-Presse. The enemy must know the party is ready, that we are preparing based on the principle that an endless aggression can happen, just like our will to push back the aggression is infinite. His remarks came after Israeli airstrikes “completely destroyed” at least three houses in southern Lebanon on Friday, the official Lebanese news agency NNA and the mayor of the affected border community said. View image in fullscreen Smoke billows after an Israeli air raid on the southern Lebanese village of Kfar Kila, near the Israel border, on Friday. Photograph: Hasan Fneich/AFP/Getty Images The Israeli army said on Friday it had “conducted air strikes and carried out artillery and tank fire against Hezbollah observation posts and terrorist infrastructure” in the Kfar Kila sector. On Friday afternoon, Hezbollah claimed three attacks, including two against “deployments of soldiers of the Israeli enemy” on the border, including using Burkan missiles, which can carry a large explosive payload. Since 7 October, Israel has repeatedly bombarded Lebanese border villages, with the violence killing more than 195 people in Lebanon, including at least 142 Hezbollah fighters, according to an AFP tally. On the Israeli side, 15 people have been killed, of whom nine were soldiers and six civilians, according to the Israeli army.\nUpdated at 03.24 CET\n20 Jan 2024 01.48 CET An American drone crashed north of Baghdad, a US defence official said, after Iran-backed militants claimed they fired on an unmanned aircraft flying over Iraq. “A US UAV crashed near Balad airbase, Iraq” on Thursday night local time, the official told Agence France-Presse, without identifying the type of drone that was lost. Iraqi security forces recovered the aircraft. There were no injuries reported. The official also said an investigation into the cause of the crash was under way. The Islamic Resistance in Iraq, a loose alliance of Iran-linked armed groups that oppose US support for Israel, said on Friday that it fired on a US MQ-9 – a type of drone that can be used for both surveillance and strikes - which was operating over Iraq the day before. “Mujahideen yesterday targeted... an MQ-9 drone belonging to the American occupation,” the group said in a statement. View image in fullscreen An MQ-9 drone. Photograph: James Lee Harper/US air force/AFP/Getty Images US and allied forces in Iraq and Syria have been hit by about 140 attacks since mid-October, according to the Pentagon – many of which have been claimed by the Islamic Resistance in Iraq. Washington has carried out retaliatory strikes in both countries. On 4 January, a US strike in central Baghdad killed a pro-Iran commander who Washington said was involved in attacks on American troops – a move that infuriated the Iraqi government. The prime minister, Mohammed Shia al-Sudani, whose government is backed by Tehran-aligned parties, has called for the US-led international coalition against the Islamic State jihadist group to depart the country.\nUpdated at 01.52 CET\n20 Jan 2024 01.11 CET Democrats urge US to reaffirm opposition to 'forced' Gaza displacements Dozens of President Joe Biden’s fellow Democrats have signed a letter urging his administration to reaffirm that the US strongly opposes “the forced and permanent displacement” of Palestinians from Gaza. The letter to the secretary of state, Antony Blinken, led by US representatives Ayanna Pressley and Jamie Raskin, was signed by 60 Democratic members of the House of Representatives, reflecting concern – especially on the left – over the steep toll on Palestinian civilians of Israel’s campaign against Hamas, Reuters reports. The letter said: We urge you to continue to reiterate the United States’ firm commitment to this position and ask that you provide clarification regarding certain provisions of the administration’s supplemental humanitarian and security funding request View image in fullscreen US representative Ayanna Pressley, who co-led the Democrats’ letter to Antony Blinken. Photograph: Elizabeth Frantz/Reuters A State Department spokesperson said the department did not typically comment on congressional correspondence. But on the broader issue of displacement, the spokesperson said in an email: We have been clear. There must be no enduring forced displacement of Palestinians, whether inside of Gaza or outside. The spokesperson said the state department had rejected statements by some Israeli officials calling for resettlement of Palestinians outside of Gaza and understood from the prime minister, Benjamin Netanyahu, that was not the Israeli government’s policy. Earlier, we reported that leading progressive and Jewish members of Congress have criticised the US’s “unconditional support” for Israel after Netanyahu declared bluntly that he was opposed to a Palestinian state after the war in Gaza and directly rejected American policy. This is Adam Fulton picking up our live coverage. It’s just passed 2.10am in Gaza City and Tel Aviv\nUpdated at 02.27 CET\n19 Jan 2024 00.59 CET 16,000 women and children killed in Gaza, including two mothers every hour, says UN An estimated 16,000 women and children have been killed in Gaza since the war began, including about two mothers every hour, a UN agency has said. In a report released on Friday on “The Gendered Impact of the Crisis in Gaza,” UN Women estimated that at least 3,000 women may have become widows and heads of households since 7 October. At least 10,000 children may have lost their father, it said. Of the territory’s 2.3 million population, 1.9 million are displaced and “close to one million are women and girls” seeking shelter and safety in a territory where no place is safe, it said. Sima Bahous, UN Women’s executive director, said in a statement: We have seen evidenced once more that women and children are the first victims of conflict and that our duty to seek peace is a duty to them … That failure, and the generational trauma inflicted on the Palestinian people over these 100 days and counting, will haunt all of us for generations to come.\n19 Jan 2024 00.26 CET Jason Burke The blistering attack by Gadi Eisenkot, a senior minister in the Israeli war cabinet, on Benjamin Netanyahu’s handling of the campaign against Hamas was the latest sign of deep disagreement among political and military leaders over the direction of Israel’s offensive. Eisenkot, a former chief of staff of the Israel Defense Forces, said late on Thursday that only a ceasefire deal can win the release of Israeli hostages held by Hamas in Gaza, and that Israel was unlikely to achieve its aim of “total victory” over the militant Islamist group. Central to the disputes inside the war cabinet is the question of how to free the more than 130 hostages who remain in Gaza. Not all of them are believed to be alive and there is a growing sense in Israel that time is running out. View image in fullscreen Eisenkot is a former chief of staff of the Israel Defense Forces whose 25-year-old son was killed in December fighting in Gaza. Photograph: Clodagh Kilcoyne/Reuters The arguments are mirrored in wider Israeli society. Lilach Shoval in Israel Hayom, a rightwing newspaper, wrote: Fifteen weeks have elapsed since Hamas forced this war on Israel on that Black Saturday of October 7, and Israel remains far from achieving the goals it set for itself: toppling Hamas’s military and governing ability, and returning the captives, not necessarily in that order. Others have described a “quagmire”. Mairav Zonszein, an Israel analyst with the International Crisis Group, said: There is no lack of support for the war but it is increasingly clear that the release of the hostages is in conflict with other goals. A poll published in Ma’ariv newspaper found that if elections were held now, Netanyahu’s Likud party would be reduced to 16 of the 120 seats in the national assembly, the Knesset.\nUpdated at 00.36 CET\n19 Jan 2024 00.11 CET Here are some of the latest images from Gaza, the West Bank, Israel and Yemen. View image in fullscreen Relatives mourn during the funerals of some of the Palestinians, who were killed during a days-long Israeli raid, in a refugee camp in Tulkarm in the occupied West Bank. Photograph: Zain Jaafar/AFP/Getty Images View image in fullscreen Destroyed houses and building in Al Maghazi refugee camp during an Israeli military operation in southern Gaza Strip. Photograph: Mohammed Saber/EPA View image in fullscreen Displaced Palestinians using eSIM cards attempt to get a signal in order to contact their relatives on a hill in Rafah, on the southern Gaza Strip on the border with Egypt. Photograph: AFP/Getty Images View image in fullscreen Jewish women sing together as they visit the site where hundreds of revelers were killed or captured by Hamas on 7 October at the Nova music festival in Re'im, southern Israel. Photograph: Maya Alleruzzo/AP View image in fullscreen Houthi supporters hold up a banner depicting a slain Houthi fighter who was killed in recent US-led bombing of Houthi positions, and placards reading in Arabic 'Allah is the greatest of all, death to America, death to Israel, a curse on the Jews, victory to Islam' during a protest against the 'terrorist' designation of the Houthis by the US government, in Sana'a, Yemen. Photograph: Yahya Arhab/EPA\n19 Jan 2024 00.02 CET Here’s some more detail on Joe Biden’s remarks to reporters after his call with Benjamin Netanyahu. The US president said he spoke with the Israeli prime minister about possible solutions for creation of an independent state for Palestinians, noting that not all countries have their own militaries. Asked if he would reconsider conditions on US military aid to Israel given Netanyahu’s comments rejecting a two-state solution, Biden said: I think we’ll be able to work something out ... I think there’s ways in which this could work. Asked if he believed Netanyahu would ever support a two-state solution, Biden replied “Yes, given the right one,” a CNN reporter said. Reporters asked President Joe Biden at the White House if he believed Israeli PM Benjamin Netanyahu would ever support two-state solution.\n\"Yes, given the right one,\" Biden told @albamonica.\nI asked if he thought he'd be able to convince Netanyahu-- he told me, \"Yes.\" pic.twitter.com/pBKQrPCG6I — DJ Judd (@DJJudd) January 19, 2024", "source_domain": "www.theguardian.com", "text": null, "title": "US says it conducted strikes against three Houthi missiles - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/19/middle-east-crisis-live-news-updates-israel-gaza-war-houthi-rebels-yemen-russia-china-ships-red-sea-crisis-attacks"}