{"authors": [], "date_download": "2024-02-05 15:46:25", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "US Secretary of State Antony Blinken held a telephonic conversation with his UK counterpart James Cleverly. The two leaders held talks on the Israel-Hamas confl", "filename": "http%3A%2F%2Fwww.theuknews.com%2Fnews%2F274014984%2Fantony-blinken-james-cleverly-hold-talks-on-israel-hamas-conflict-humanitarian-access-to-gaza-civilians.json", "image_url": "https://cdn.bignewsnetwork.com/ani1698615105.jpg", "language": "en", "localpath": null, "maintext": "Washington DC [US], October 30 (ANI): US Secretary of State Antony Blinken held a telephonic conversation with his UK counterpart James Cleverly. The two leaders held talks on the Israel-Hamas conflict, humanitarian access for Palestinian civilians in Gaza, and the need for all hostages to be released immediately.\nDuring their talks, Blinken and Cleverly affirmed Israel's right to self-defence and discussed their engagement with regional partners to stop the spread of the conflict and secure the release of the hostages.\nIn a statement shared on Sunday, US Department of State Matthew Miller stated, \"Secretary of State Antony J. Blinken spoke yesterday with UK Foreign Secretary James Cleverly. Secretary Blinken and Foreign Secretary Cleverly affirmed Israel's right to self-defense, discussed their engagement with regional partners to prevent the spread of the conflict and secure the release of hostages. They reiterated the need to ensure sustained delivery of humanitarian assistance to civilians in Gaza.\"Meanwhile, James Cleverly also held talks with Israeli counterpart Eli Cohen and reiterated the UK's support for Israel's self-defence in line with international humanitarian law.\nTaking to X, Cleverly stated, \"Today @JamesCleverly spoke to @elicoh1 and reiterated our support for Israel's self-defence in line with international humanitarian law. The Foreign Secretary also spoke to @SecBlinken to help prevent regional escalation and called for humanitarian pauses to allow lifesaving aid to reach civilians.\"The US and UK have condemned Hamas's attack on Israel. Both nations have supported Israel's right to defend itself after Hamas's action on October 7. Earlier this month, US President Joe Biden and UK Prime Minister Rishi Sunak visited Israel to show their support for Tel Aviv amid its ongoing conflict with Hamas.\nIsrael's ground forces continue to operate in the northern section of the Gaza Strip, killing Hamas terrorists and destroying the facilities of the terror group, The Times of Israel reported citing Israel Defence Forces.\nAccording to the IDF, troops killed a number of Hamas gunmen who opened fire on ground forces in Gaza, as well as other terrorists identified on a beach in Gaza near the southern Israeli village of Zikim. Ground soldiers, including tanks, hit anti-tank guided missile positions, observation posts, and other Hamas infrastructure, The Times of Israel reported, citing the Israeli Defence Forces.\n\"The forces also directed the Air Force to carry out strikes against buildings used by the terror group,\" the IDF added. The IDF has also released a video depicting forces operating in Gaza today, as well as some of the most recent attacks on the territory.\nTaking to social media platform X, the IDF posted a video and wrote, \"As we continue to expand our ground operations in northern Gaza: IAF aircraft, guided by IDF troops, struck Hamas structures. Anti-tank missile launch postsobservation posts were struck. Multiple terrorists were eliminated.\n\"Israel Defense Forces (IDF) has re-issued urgent calls for civilians in Gaza to relocate to the south as the ground forces move to the next phase of its war with the terrorist group Hamas.\"The Israel Defense Forces (IDF) is expanding its operations. We are moving to the next phase of our war against Hamas in Gaza, from the air, land, and sea.\nOn October 7, Hamas committed a crime against humanity. Israel is in a war, it did not start, and it did not sink. Hamas is attacking Israeli civilians while firing from among dozens of civilians. These are both war crimes. Our fight is with Hamas. Not with the people of Gaza,\" IDF Spokesman Rear Admiral Daniel Hagari said in a video posted to the IDF's profile on 'X'.\n\"Civilians in northern Gaza and Gaza City should temporarily move south of Wadi Gaza to a safer area where they can receive water, food and medicine. Tomorrow, the humanitarian efforts to Gaza led by Egypt in the United States will be expanding,\" he added.\nThe IDF spokesperson said Hamas was using the people of Gaza as human shields amid the ongoing offensive. \"Hamas operated inside and under civilian buildings, precisely because they know the IDF distinguishes between terrorists and civilians,\" he said.\nIsrael Defence Forces (IDF) said that multiple terrorists were eliminated as forces continue to expand ground operations in northern Gaza.\n\"As we continue to expand our ground operations in northern Gaza: IAF aircraft, guided by IDF troops, struck Hamas structures. Anti-tank missile launch postsobservation posts were struck. Multiple terrorists were eliminated,\" IDF posted on X.\nRecently, an Israel Air Force aircraft attacked a terrorist cell that was identified in the Mount Dov region, which launched missions towards Israeli territory on Sunday, according to Israel Air Force.\nTaking to X, Israel Air Force stated, \"An Air Force aircraft recently attacked a terrorist cell that was identified in the Mount Dov region, which launched missions towards Israeli territory earlier today. In the attack, many weapons were also destroyed with which the terrorists planned to carry out additional launches towards Israeli territory.\" (ANI)", "source_domain": "www.theuknews.com", "text": null, "title": "Antony Blinken, James Cleverly hold talks on Israel-Hamas conflict, humanitarian access to Gaza civilians", "title_page": null, "title_rss": null, "url": "http://www.theuknews.com/news/274014984/antony-blinken-james-cleverly-hold-talks-on-israel-hamas-conflict-humanitarian-access-to-gaza-civilians"}