{"authors": [], "date_download": "2024-02-05 15:46:34", "date_modify": "None", "date_publish": "2023-10-31 09:56:59", "description": "Israeli forces are attacking Hamas militants and infrastructure in northern Gaza as warplanes strike across the sealed-off territory", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhamas-ap-gaza-israeli-gilad-erdan-b2438939.html.json", "image_url": "https://static.independent.co.uk/2023/10/31/10/Israel_Palestinians_40007.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsraeli ground forces are attacking Hamas militants and infrastructure in northern Gaza as warplanes strike across the sealed-off territory. Buoyed by the first successful rescue of a captive held by Hamas, Prime Minister Benjamin Netanyahu has rejected calls for a cease-fire and again vowed to crush the militant group’s ability to govern Gaza or threaten Israel.\nMore than half of Gaza’s 2.3 million Palestinians have fled their homes, with hundreds of thousands sheltering in packed U.N.-run schools-turned-shelters or in hospitals alongside thousands of wounded patients.\nThe Palestinian death toll in the Israel-Hamas war has reached 8,306, according to the Hamas-run Health Ministry in Gaza. In the occupied West Bank, more than 122 Palestinians have been killed in violence and Israeli raids.\nMore than 1,400 people in Israel have been killed, most of them civilians slain in the initial Hamas rampage that started the fighting Oct. 7. In addition, 240 hostages were taken from Israel into Gaza by the militant group. One of the captives, a female Israeli soldier, was rescued in a special forces operation.\nCurrently:\n1. A UN envoy says the Israel-Hamas war is spilling into Syria, adding to instability there\n2. UN agency in Gaza says urgent cease-fire is a matter of life and death for Palestinians\n3. An Israeli ministry proposes transferring Gaza civilians to Egypt’s Sinai\n4. This war might hit Israel’s economy harder than past wars with Hamas\n5. Biden’s Cabinet secretaries will push Congress to send aid to Israel and Ukraine\n6. Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war\nHere’s what is happening in the latest Israel-Hamas war:\nUN HUMANITARIAN CHIEF SAYS HE FELT HELPLESS WHILE TALKING TO TRAPPED PALESTINIANS\nCAIRO -- The United Nations humanitarian chief said he felt helpless as he spoke by phone Tuesday with Palestinian families trapped in the war between Israel and Hamas militants in Gaza.\n“We don’t want to die,” Martin Griffiths quoted families telling him, adding that, “What they’ve endured since October 7 is beyond devastating,”\n“And when an 8-year-old tells you that she doesn’t want to die, it’s hard not to feel helpless,” he wrote on X, formerly known as Twitter.\nOn Monday, the head of the U.N. agency for Palestinian refugees told a U.N. emergency meeting that “an immediate humanitarian cease-fire has become a matter of life and death for millions” in Gaza.\nHOLOCAUST MEMORIAL HEAD DERIDES AMBASSADOR FOR WEARING YELLOW STAR OF DAVID\nJERUSALEM -- The chairman of Israel’s Holocaust memorial, Yad Vashem, derided Israel’s ambassador to the United Nations for putting on a yellow Star of David patch during his address to the Security Council on Monday, saying it “belittles both the victims of the Holocaust and the State of Israel.”\n“The yellow patch symbolizes the helplessness of the Jewish people when it was at the mercy of others,” Dayan posted on X, formerly called Twitter. “Today we have an independent state and a strong army. We are masters of our fate. Today we put on our lapels the blue and white flag (of Israel), not a yellow patch.”\nNazis forced Jews to wear yellow six-pointed Star of David patches during the Holocaust.\nAmbassador Gilad Erdan donned the patch during a council meeting on the humanitarian situation in the Gaza Strip, where more than 8,300 people have been killed, according to the Hamas-run Gaza Health Ministry, hundreds of thousands have been displaced, and food and basic supplies have dwindled sharply since Israel went to war against the Palestinian territory’s Hamas rulers.\nErdan told the Security Council that he would wear the patch, inscribed with the words “Never Again,” until the council condemns Hamas’s bloody Oct. 7 incursion into southern Israel, which touched off the war. More than 1,400 people were killed and about 240 taken hostage during the attack.\nBIDEN ADMINISTRATION URGES IMMEDIATE AID FOR ISRAEL AND UKRAINE\nWASHINGTON — U.S. Defense Secretary Lloyd Austin and Secretary of State Antony Blinken will make the case Tuesday that the United States should immediately send aid to Israel and Ukraine, testifying at a Senate hearing as the administration’s massive $105 billion emergency aid request for conflicts in those countries and others has already hit roadblocks in the divided Congress.\nPresident Joe Biden’s Cabinet secretaries will be advocating for the foreign aid to a mostly friendly audience in the Senate, where majority Democrats and many Republicans support tying aid for the two countries together. But it faces much deeper problems in the Republican-led House, where new Speaker Mike Johnson has proposed cutting out the Ukraine aid and focusing on Israel alone, and cutting money for the Internal Revenue Service to pay for it.\nThe drastically narrowed House proposal, which would cost more than $14 billion, faced immediate resistance among Senate Democrats -- and put pressure on Senate Republicans who support the Ukraine aid but are conscious of growing concerns about it within their party. The differing approaches signal problems ahead for the aid as both countries engage in long-simmering, defining conflicts that Biden and many U.S. lawmakers say could have fundamental ramifications for the rest of the world.\nCANADA SAYS HUMANITARIAN ACCORD URGENTLY NEEDED\nTORONTO — Canadian Foreign Affairs Minister Melanie Joly said Monday that a humanitarian agreement is urgently needed to help people in the Gaza Strip.\nSpeaking to the Economic Club of Canada, Joly called for a temporary pause in hostilities in the Israel-Hamas war to allow more aid to get into Gaza.\n\"The humanitarian situation facing the Palestinian people, facing Palestinian women and children, is dire,” she said.\nJoly reiterated Canada’s unequivocal condemnation of Hamas for its attacks on Israelis and said Israel has a right to defend itself against terrorism ``in accordance with international law.″ She also criticized attacks by extremist Israelis on Palestinians in the West Bank.\nUNWRA HEAD SAYS CIVIL ORDER BREAKDOWN ENDANGERS AGENCY'S OPERATIONS\nUNITED NATIONS — The head of the U.N. agency for Palestinian refugees is warning that “an immediate humanitarian cease-fire has become a matter of life and death for millions,” stressing that “the present and future of Palestinians and Israelis depend on it.”\nPhilippe Lazzarini warned during an emergency meeting of the U.N. Security Council on Monday that a further breakdown of civil order, following the recent break-ins at the agency's warehouses by panicked Palestinians searching for food and other aid, will make it extremely difficult for the largest U.N. agency in Gaza to continue operating.\nHe said in a virtual briefing that he is worried about a spillover of the conflict and urged all 193 U.N. member nations “to change the trajectory of this crisis.\"\nThe commissioner-general of the agency known as UNRWA, also said 64 of its staff have been killed in just over three weeks — the latest only two hours prior when UNRWA’s head of security in mid-Gaza was killed with his wife and eight children.\nLazzarini said most Palestinians in Gaza “feel trapped in a war they have nothing to do with” and “they feel the world is equating all of them to Hamas.” He stressed that the Oct. 7 Hamas atrocities in Israel don’t absolve Israel from its obligations under international humanitarian law, starting with the protection of civilians.\nISRAEL BACKTRACKS ON REFUSING TO GRANT ENTRY VISAS TO UN OFFICIALS\nGENEVA — Israeli officials are going back on their promised refusal to grant entry visas to U.N. officials.\nMartin Griffiths, the head of the U.N. Office for the Coordination of Humanitarian Affairs, tweeted Monday that he was in Israel — less than a week after Israel’s U.N. ambassador said it had “refused” to grant Griffiths a visa.\nIsraeli officials had expressed outrage over comments last Wednesday by U.N. Secretary-General Antonio Guterres that the deadly Oct. 7 attack by Hamas militants “did not happen in a vacuum.”\nGilad Erdan, Israel’s U.N. ambassador, accused Guterres on Israel’s Army Radio of justifying a slaughter, called for his resignation and said Israel would “refuse to grant visas to U.N. representatives.”\nU.N. spokesman Stephane Dujarric said Guterres stood by his remarks.\nOn Monday, Israel’s ambassador in Geneva, Meirav Eilon Shahar, said, “We haven’t said categorically that we’re not giving visas. We are … We understand their need to be there.”\nEilon Shahar confirmed that Griffiths was in Israel, as well as other officials, including Han Kluge, the regional head of the World Health Organization.\nBut she continued to voice Israel’s frustration that U.N. institution chiefs didn’t speak out more forcefully against Hamas militants for “butchering civilians and women in such a vicious way.”\n“The United Nations has let down the people of Israel,” Eilon Shahar added. “When I say the United Nations, I’m talking about the multilateral organizations have let down the people of Israel.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Israeli ground forces attack Hamas targets in north as warplanes strike across Gaza", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hamas-ap-gaza-israeli-gilad-erdan-b2438939.html"}