{"authors": [], "date_download": "2024-02-05 15:46:36", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Russia said Sunday that it shot down 36 drones overnight over the Black Sea and the Crimean Peninsula. Ukraine, which has stepped up its campaign against", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274014934%2Frussia-says-it-shot-down-36-drones-overnight.json", "image_url": "https://cdn.bignewsnetwork.com/voa1698608162.jpg", "language": "en", "localpath": null, "maintext": "Russia said Sunday that it shot down 36 drones overnight over the Black Sea and the Crimean Peninsula. Ukraine, which has stepped up its campaign against Russia, has not commented on the overnight attack.\nFrom their meeting in Japan Sunday, the G7 trade ministers issued a joint statement about Russia's invasion of Ukraine, calling it \"brutal, unprovoked, unjustifiable and illegal war of aggression.\"\nRussian universities have reportedly been instructed to stop any negative discussions during academic activities about any Russian political, economic and social trends, the British Defense Ministry said Sunday.\nThis move marks yet another \"restriction of the information space in wartime Russia,\" the ministry said, \"making it more difficult to openly discuss policy issues.\"\nThis restriction, the ministry said, will likely further add to \"the trend of Russian policy-making taking place in an echo-chamber of politically acceptable, pro-Kremlin perspectives\" in the runup to President Vladimir Putin's anticipated bid for reelection in March, the British ministry said.\nZelenskyy: Saturday Date for Malta Summit 'Very Symbolic'\nUkrainian President Volodymyr Zelenskyy said in his daily address Saturday that it was \"very symbolic\" that the Malta summit was being held that day because that is also the day Ukraine commemorates World War II and the anniversary of the expulsion of the Nazis from its territory.\nThe summit in Malta is the third round of the Ukrainian-backed peace talks in which more than 60 countries are meeting to consider Zelenskyy's 10-point plan to end the war. Similar meetings were held earlier this year in Jeddah, Saudi Arabia, and Copenhagen, Denmark.\nIn his daily address, Zelenskyy also thanked Ukraine's border guards who are now \"fighting on the front lines\" along with the nation's defense and security forces \"to bring a time of peace closer to Ukraine.\"\nRussia accused Ukraine of damaging a nuclear waste storage warehouse in a drone attack on the Kursk nuclear power plant and claimed its air defenses shot down eight Ukrainian drones.\nThe Russian Foreign Ministry said on Saturday that three explosive-laden drones targeted the power plant on Thursday night, striking its administration building and a facility storing nuclear waste. The press service for the Kursk nuclear power plant confirmed the strike Friday, but told journalists there was no significant damage or casualties and that operations were continuing as normal.\nRussia Says Ukraine Drone Hit Nuclear Waste Storage Site\nIntense fighting has continued around the key city of Avdiivka in the Donetsk region of eastern Ukraine.\nUkraine's air force said it destroyed three of four Iskander cruise missiles over the country's Dnipropetrovsk region Saturday night.\nA dearth of reported aerial attacks this weekend follows several weeks of fierce fighting close to Avdiivka. Ukrainian Defense Minister Rustem Umerov told his U.S. counterpart Lloyd Austin on Saturday that Russia had lost about 4,000 troops in Avdiivka, according to Kyiv's Defense Ministry.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Russia Says It Shot Down 36 Drones Overnight", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274014934/russia-says-it-shot-down-36-drones-overnight"}