{"authors": [], "date_download": "2024-02-05 15:46:37", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "LATEST DEVELOPMENTS: Israeli Prime Minister Benjamin Netanyahu says the country is entering the next phase of its operation to counter Hamas. Israel ex", "filename": "http%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274014303%2Fprime-minister-tells-israelis-war-will-be-long-and-hard.json", "image_url": "https://cdn.bignewsnetwork.com/voa1698537971.jpg", "language": "en", "localpath": null, "maintext": "LATEST DEVELOPMENTS:\nIsraeli Prime Minister Benjamin Netanyahu says the country is entering the next phase of its operation to counter Hamas.\nIsrael expands air, ground operations on Gaza, striking dozens of underground tunnels, bunkers, and telecommunications equipment.\nIsrael is 'advancing in the stages of war' and 'troops still remain in the field,' its military spokesman said.\nIsraeli Defense official: Tel Aviv will allow trucks carrying food, water and medicine to enter Gaza on Saturday\nThe war will be 'long and hard,' warned Israeli Prime Minister Benjamin Netanyahu as he announced the launch of Israel's second phase in its war against Hamas militants in the Gaza Strip.\n'This is the second stage of the war whose goals are clear - to destroy Hamas' governing and military capabilities and to bring the hostages home,' Netanyahu told reporters Saturday night in Tel Aviv. He vowed that every effort would be made to rescue the more than 200 hostages held by Hamas.\nIsraeli Prime Minister Benjamin Netanyahu speaks during a press conference with Defense Minister Yoav Gallant and Cabinet Minister Benny Gantz in the Kirya military base in Tel Aviv, Israel, Oct. 28, 2023.\n'We are only at the start,' he said. 'We will destroy the enemy above ground and below ground.'\nNetanyahu reiterated Israel's appeal to Palestinian civilians to evacuate the northern Gaza Strip as Israel intensifies its ground operation in the area.\nGaza has been under constant bombardment since shortly after Hamas militants attacked southern Israel on October 7, massacring more than 1,400 people, most of them civilians.\nRear Admiral Daniel Hagari, the Israel Defense Forces spokesperson, told reporters early Saturday that fighter jets had struck 150 underground targets in the northern Gaza Strip, including Hamas tunnels, underground combat spaces and other underground infrastructure, while killing key members of the group.\n'Their killing, their elimination is a good progress in the stages of war and gives the forces on the ground a fight against a weaker enemy,' Hagari said.\n'Overnight, IDF fighter jets struck Asem Abu Rakaba, the leader of Hamas' Aerial Array,' IDF officials posted on social media platform X, indicating it may have killed the militant group's air chief.\n'Abu Rakaba was responsible for Hamas' UAVs, drones, paragliders, aerial detection and defense,' the post continued. 'He took part in planning the October 7 massacre and commanded the terrorists who infiltrated Israel on paragliders and was responsible for the drone attacks on IDF posts.'\nHamas on Saturday pledged to confront the Israeli attacks with 'full force.' The al-Qassam brigades, an armed wing of Hamas, said its fighters were clashing with Israeli troops in Gaza's northeastern town of Beit Hanoun and in the central area of al-Bureij.\nFILE -- Egyptian Red Crescent members coordinate aid for Gaza, after United Nations Secretary-General Antonio Guterres visited the Rafah border crossing between Egypt and the Gaza Strip, at Al Arish Airport, Egypt, Oct. 20, 2023\nPleas for help\nIsraeli strikes knocked out Gaza's communications infrastructure, causing a near-blackout of information and severing Gaza's estimated 2.3 million residents from contact with the outside world.\nThe United Nations human rights chief warned Saturday of 'possibly catastrophic consequences' of large-scale ground operations in the Gaza Strip, where thousands have already died in Israeli air strikes.\n'Given the manner in which military operations have been conducted until now, in the context of the 56-year-old occupation, I am raising alarm about the possibly catastrophic consequences of large-scale ground operations in Gaza and the potential for thousands more civilians to die,' Volker Turk, the United Nations High Commissioner for Human Rights, said in a statement.\n'Continued violence is not the answer,' he said.\nHagari said Israel would allow trucks carrying food, water and medicine to enter Gaza on Saturday, indicating a possible pause in bombing, at least along its border with Egypt, where small amounts of aid have been arriving.\nUnited Nations trucks carrying supplies cross into Rafah town through the Kerem Shalom crossing between Israel and the southern Gaza Strip, 16 Jun 2010\nThe delivery of the aid is being delayed, Egypt's Foreign Ministry said Saturday, by what it called Israeli obstacles, including extensive truck inspection procedures, through the Rafah Border Crossing between Egypt and the Gaza Strip\nBefore the conflict, about 500 trucks a day were crossing into Gaza, but in recent days, an average of 12 trucks a day have entered, U.N. Secretary-General Antonio Guterres said Friday.\nThe World Health Organization has appealed to 'the humanity in all those who have the power to do so to end the fighting now' in Gaza.\n'There are more wounded every hour. But ambulances cannot reach them in the communications blackout. Morgues are full. More than half of the dead are women and children,' it said.\nWorld Health Organization chief Tedros Adhanom Ghebreyesus tweeted Saturday that his organization has no communication with its staff and health facilities in Gaza, adding: 'I'm worried about their safety.'\nHealth authorities in the Hamas-ruled Gaza Strip of 2.3 million people say that since the war began, the death toll among Gazans, mostly women and children, has passed 7,700 in Israel's campaign to obliterate the militants. The figures could not be independently verified.\nMany buildings are reduced to rubble, and Gazans are struggling to find shelter, food, water, fuel and medicine. Their plight worsened Friday night when phone and internet services were cut, followed by heavy bombing through the night.\nProtesters hold placards and wave Palestinian flags as they walk over Westminster Bridge with the Palace of Westminster, home of the Houses of Parliament behind during a 'March For Palestine' in London on October 28, 2023, to call for a ceasefire in the c\nWorld reaction\nWestern countries have generally backed what they say is Israel's right to self-defense, but there has been mounting international concern over the toll from the bombing and growing calls for a pause to allow aid to reach Gaza civilians.\nDemonstrations took place Saturday in Paris, London, Indonesia, Pakistan, Italy, Norway and Switzerland, and a crowd of protesters filled New York City's Grand Central Station Friday night. Many were wearing black T-shirts saying, 'Jews say cease-fire now' and 'Not in our name.'\nIsraeli Defense Minister Yoav Gallant attends a press conference in the Kirya military base in Tel Aviv, Israel, Oct. 28, 2023.\nU.S. Defense Secretary Lloyd Austin spoke with Israeli Defense Minister Yoav Gallant on Friday to discuss Israel's operations in Gaza. Austin underscored the importance of protecting civilians during the Israel Defense Forces' operations and focusing on the urgency of humanitarian aid delivery for civilians in Gaza. He also reiterated the need for Hamas to release all of the hostages, according to a Pentagon statement.\nThe United Arab Emirates, the first Gulf country to normalize relations with Israel in 2020, on Saturday expressed 'its deep concern over the Israeli military escalation and exacerbation of the humanitarian crisis that threatens more loss of civilian lives.'\nPresident Mahmoud Abbas, whose Palestinian Authority governs parts of the occupied West Bank, while Hamas rules Gaza, said, 'Our people in the Gaza Strip are facing a war of genocide and massacres committed by the Israeli occupation forces in full view of the entire world.'\nThe United States and other Western countries had urged Israel to delay a ground offensive for fear of greater Palestinian casualties and a widening conflict in the region.\nHamas is backed by Iran, which also supports militias in Lebanon, Syria, Iraq and Yemen. U.S. troops have come under fire from Iran-backed groups in Iraq and Syria. Washington has been moving more military assets to the region.\nOman's Foreign Ministry said Israel's siege and bombardment of Gaza amount to war crimes and crimes against humanity, while Turkish President Recep Tayyip Erdogan told a mass pro-Palestinian rally in Istanbul on Saturday that his country was making preparations to proclaim Israel a 'war criminal' for its actions in Gaza.\nA woman holds a sign during a demonstration by family members and supporters of hostages who are being held in Gaza by Hamas gunmen, in Tel Aviv, Israel, Oct. 28, 2023.\nHostages held\nHundreds of family members demonstrated in Tel Aviv earlier Saturday, carrying pictures of the captives, chanting 'return them now.'\n'The families feel like they're left behind and no one is really caring about them,' said Miki Haimovitz, a former lawmaker.\nHamas said on Saturday that it was nearing an agreement with Israel over the more than 200 hostages it has in Gaza, but Israel 'stalled' on that.\nIsrael's military spokesman dismissed the reports, saying Hamas was 'cynically' attempting to sway public opinion. Netanyahu said contacts to secure the hostages' release would continue even during a ground offensive in Gaza.\nGallant said Hamas had to be forced to the negotiating table.\n'The more military pressure, the more firepower and the more we strike Hamas,' he said, 'the greater our chances are to bring it to a place where it will agree to a solution that will allow the return of your loved ones.'\nIsrael said Wednesday that more than half the hostages held by Hamas have foreign passports from 25 different countries. Many are believed to have dual Israeli nationality.\nThe hostages are believed to be hidden in the Gaza Strip, possibly in a warren of tunnels Hamas has built there.\nSome information for this report came from The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Prime Minister Tells Israelis War Will Be 'Long and Hard'", "title_page": null, "title_rss": null, "url": "http://www.unitedkingdomnews.net/news/274014303/prime-minister-tells-israelis-war-will-be-long-and-hard"}