{"authors": ["Perkin Amalaraj"], "date_download": "2024-02-05 15:46:39", "date_modify": "None", "date_publish": "2023-10-31 11:20:06", "description": "Currently thought to be living in southern Lebanon, Arouri, the deputy to Hamas leader Ismail Haniyeh, is among a group of leaders singled out by Israeli officials who have vowed to destroy Hamas", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12692607%2FIsrael-blows-home-senior-Hamas-leader-West-Bank-IDF-continues-target-Islamist-groups-men.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/11/77215931-0-image-a-205_1698750507519.jpg", "language": "en", "localpath": null, "maintext": "Israeli troops on Tuesday destroyed the family home of Saleh al-Arouri, the exiled commander of Hamas forces, in the occupied West Bank as security forces continued their crackdown on leaders of the Islamist group.\nCurrently thought to be living in southern Lebanon, Arouri, the deputy to Hamas leader Ismail Haniyeh, is among a group of leaders singled out by Israeli officials who have vowed to destroy Hamas in retaliation for the deadly October 7 attack on southern Israel.\nA video shared by the IDF on X showed the white two-storey house in the village of Arora being levelled, with ash and dust flying out of windows and doors after explosions were set off throughout the building.\nThe video also shows demolitions experts from the IDF setting up in the middle of the night.\nSeveral masked and armed soldiers can be seen unspooling detonation cord and sticking explosives into the walls of the empty house, which are covered in Arabic writing.\nAsh and dust flew out of the home of Saleh al-Arouri, the exiled commander of Hamas forces as IDF forces demolished it\nSaleh al-Arouri (pictured) is among a group of leaders singled out by Israeli officials as high-priority targets\nal-Arouri's West Bank home was reduced to rubble in seconds after IDF engineers demolished it\nThe two-storey home was flattened after IDF engineers set off several explosives inside\nWhich Hamas leaders have been targeted by the IDF after it attacked Israel on October 7? Shadi Barud, deputy head of Hamas' Intelligence Directorate, was killed in an IDF airstrike on October 26. He was reportedly one of the main architects of Hamas' surprise attack on southern Israel on October 7.\nJamil Baba, commander of the naval force in the central camps, Muhammad Safadi, 'the commander of the anti-tank formation in the Tafah battalion,' Muwaman Hegazi, who was part of the 'anti-tank system in the Tafah battalion', and Muhammad Awadallah, a 'senior' official in Hamas' production HQ, were all reportedly killed in an airstrike on October 30\nIDF airstrikes over the weekend reportedly killed Asem Abu Rakaba, the Head of Hamas' Aerial Array. He reportedly led Hamas' paraglider assault on Israel on October 7.\nThe IDF said Ali Qadhi, a company commander in the so-called Nukhba commando unit who led one of the assaults on October 7, was killed in a drone strike on October 14. It also killed the head of Hamas’s aerial array, Murad Abu Murad, on the same night.\nThe head of Hamas' North Khan Younis rocket array, Hassan al-Abdullah, was killed alongside several other Hamas members in an Israeli airstrike on October 26.\nTwo members of Hamas' political office, Jawad Abu Shammala and Zakaria Abu Maamar, were killed in an air strike in Khan Younis on October 10.\nOsama Mazini, the head of the Shura Council, the highest political decision-making body of Hamas, was killed in an airstrike in Gaza on October 17 Sources: IDF, Reuters, EFE Advertisement\nal-Arouri's house, which local residents said was not occupied, had been scheduled for demolition since last week and security forces blew it up in the early hours of the morning, according to witnesses.\nA veteran Hamas leader who has spent 17 years in Israeli jails, Arouri rose to prominence in 2014 by admitting to the abduction and killing of three Israeli teenagers from a West Bank settlement.\nSince then he has been behind a steady expansion of Hamas political cadres and gunmen throughout the West Bank, where the rival Fatah faction of Palestinian President Mahmoud Abbas controls the Palestinian Authority.\nFollowing 18 months of steadily escalating violence in the West Bank, Israeli forces have clamped down further since the October 7 attack, making hundreds of arrests and conducting regular raids that have resulted in clashes.\nAt least 121 Palestinians have been killed there in the three weeks since the attack.\nOn Tuesday, a 14-year-old boy hit during a confrontation near the northern West Bank city of Nablus died of his wounds and in a separate incident, a 70 year-old man was killed during a clash in the city of Tubas.\nOver in Gaza, the Hamas-run Health Ministry said on Tuesday it registered the deaths of at least 219 people in the past day, bringing the death toll to 8,525 since the war began.\nSpokesperson Ashraf al-Qidra said in a televised news conference that the fatalities include 3,542 children and 2,187 women.\nHe said the main power generator in the Indonesian Hospital in Beit Lahia, north of Gaza, has stopped working due to a lack of fuel.\nHe warned that more hospitals could go out of service in the coming days if fuel isn't allowed into the besieged territory.\nThe warning came as Israel said its forces battled Hamas gunmen inside the terrorists' vast tunnel network beneath Gaza and struck 300 targets overnight after Prime Minister Benjamin Netanyahu categorically ruled out a ceasefire to ease the humanitarian crisis.\nThe tunnels are a key objective for Israel as it expands ground operations inside Gaza to wipe out Hamas following its gun rampage three weeks ago that killed over 1,400 people.\nIn the fourth night of major ground operations inside northern Gaza, the army said it hit around 300 targets including missile and rocket launch posts and 'military compounds inside underground tunnels' belonging to Hamas terrorists.\nA Palestinian man from al-Badrasawi family carries the body of his child who was killed in Israeli strikes, at Shuhada Al-Aqsa hospital in the central Gaza Strip on Tuesday\nIsrael Defense Forces (IDF) soldiers fire a 155 mm howitzer at an undisclosed location near the border with Gaza, southern Israel on Tuesday\nIsrael Defense Forces (IDF) soldiers fire a 155 mm howitzer at an undisclosed location near the border with Gaza, southern Israel on Tuesday\nIn response, Hamas gunmen attacked Israeli forces with machine gun fire and anti-tank missiles. 'The soldiers killed terrorists and directed air forces to real-time strikes on targets and terror infrastructure,' the IDF said.\nThe fighting came after Netanyahu on Monday evening slapped aside a call from 120 countries for a sustained humanitarian truce, saying such a ceasefire would be 'surrendering' to Hamas.\n'This will not happen,' the premier said, vowing Israel would 'fight until this battle is won'. 'Calls for a ceasefire are calls for Israel to surrender to Hamas,' he said.\nIsrael launched the war on October 7 in retribution for Hamas-led raids on Israeli homes, farms and villages that killed an estimated 1,400 people, according to Israeli officials.\nA Palestinian man wounded in Israeli strikes holds a body of a child killed in the strikes, at Shuhada Al-Aqsa hospital in the central Gaza Strip on Tuesday\nPalestinians look for survivors after an Israeli strike in Rafah, Gaza Strip, on Tuesday\nPictured: Israeli soldiers amid their ground offensive in Gaza\nInjured relatives of the Palestinians, who lost their lives after Israeli attacks, mourn as the bodies are carried for burial from Al Aqsa Martyrs Hospital in Gaza on Tuesday\nMore than three weeks of massive and sustained Israeli aerial bombardments have been followed by a large-scale ground offensive inside Gaza.\nOn Monday, witnesses said Israeli forces targeted Gaza's main north-south road on Monday and attacked Gaza City from two directions. They said they saw 'dozens' of Israeli tanks operating on the southern outskirts of Gaza City.\nJonathan Conricus, an Israeli military spokesman, said ground operations are focused on northern Gaza, including Gaza City, which he said was the 'center of gravity of Hamas.'\n'But we also continue to strike in other parts of Gaza. We are hunting their commanders, we are attacking their infrastructure, and whenever there is an important target that is related to Hamas, we strike it,' he said.\nThe withering aerial bombardment has obliterated homes and entire neighbourhoods, leaving the territory's 2.4 million residents have little access to water, food, fuel and other essentials.\nThe mounting death toll has drawn calls from the U.S., Israel's top ally, 120 governments and the UN for a pause in fighting to allow more humanitarian aid to reach the enclave.\n'Nearly 70 percent of those reported killed are children and women,' said Philippe Lazzarini, who heads the UN agency for Palestinian refugees UNRWA. 'This cannot be 'collateral damage'.'\nOn Monday, the UNRWA said the limited number of aid trucks entering Gaza was insufficient to meet the 'unprecedented humanitarian needs' and civil order has broken down with people storming UN warehouses in search of food.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel blows up home of senior Hamas leader in West Bank as the IDF continues to target the Islamist group's top men", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12692607/Israel-blows-home-senior-Hamas-leader-West-Bank-IDF-continues-target-Islamist-groups-men.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}