{"authors": ["Nick Allen", "Nick Allen For Dailymail.Com"], "date_download": "2024-02-05 15:46:40", "date_modify": "None", "date_publish": "2023-10-31 14:14:49", "description": "Amid chaotic scenes Secretary of State Antony Blinken and Defense Secretary Lloyd Austin were forced to sit silently as demonstrators chanted 'Ceasefire now!'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12693421%2FGaza-Israel-Antony-Blinken-ceasefire-blood-congress.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/14/77224593-0-image-a-10_1698761789263.jpg", "language": "en", "localpath": null, "maintext": "Protesters drenched in fake blood caused chaos in Congress on Tuesday by interrupting Antony Blinken's testimony on Israel to demand a ceasefire in Gaza and call for the U.S. to stop 'supporting genocide'.\nDemonstrators called the Secretary of State a 'murderer' who has 'blood on his hands' during mayhem at the start of the hearing on Middle East and Ukraine aid in front of the Senate Appropriations Committee.\nA dozen protesters were arrested for disrupting the hearing.\nBlinken's comments were cut off multiple times by members of the audience waving signs calling for an end to the 'siege' of Gaza.\nHe and Defense Secretary Lloyd Austin were forced to sit in silence as protesters chanted 'ceasefire now' and held up their hands covered in red paint.\nProtesters caused chaos in Congress on Tuesday by interrupting Antony Blinken's testimony to demand a ceasefire in Gaza and call for the U.S. to stop 'supporting genocide'\nSecretary of State Antony Blinken (foreground) looks ahead as demonstrators with 'bloody' hands derail the hearing\nCapitol Police were seen dragging at least five demonstrators out as the disarray led to the suspension of the hearing, before officers could restore order.\nOne woman called the officers 'terrorists' and demanded to know why 'they' weren't being handcuffed.\nThe latest stunt follows a string of similar demonstrations on Capitol Hill over the Israel-Hamas war and comes less than 24 hours after Republicans announced a plan to send $14.3billion to Israel.\n'Stop the brutal, brutal massacre in Gaza…Ceasefire now! Ceasefire now,' one heckler shouted.\nThey also held signs saying: 'All the walls have got to go' and 'Free Gaza'.\nAnother shouted: 'Blinken, you have blood on your hands! Murderer.\nBlinken restarted his testimony when order restored inside the hearing room. He referenced the demonstrators by saying the U.S. is committed to 'protecting civilian life.'\n'I also hear very much the passions expressed in this room and outside this room. All of us are committed to the protection of civilian life,' he said\nJust before the hearing began, Israel said it has killed 'dozens' of Hamas terrorists during 'fierce' fighting 'deep' inside Gaza with video showing soldiers scouring the streets for the gunmen amid raging battles.\nIsraeli troops attacked Hamas positions within the terrorists' vast tunnel network - a key objective for Israel as it expands ground operations inside Gaza to wipe out Hamas following its gun rampage three weeks ago that killed over 1,400 people.\nAmid chaotic scenes Secretary of State Antony Blinken and Defense Secretary Lloyd Ausitn were forced to sit silently as demonstrators chanted 'Ceasefire now!\nCapitol Police remove one of the protesters after she joined the demonstration that derailed Blinken's testimony\nCapitol Police dragged at least five demonstrators out as the chaos suspended the hearing\nBlinken was able to resume his testimony and insisted the U.S. is focused on 'protecting civilian lives'\nOn the fifth day of major ground operations inside northern Gaza, the army said it had engaged in 'fierce battles' with Hamas terrorists, with footage showing columns of tanks and soldiers advancing further into the besieged enclave.\nThe IDF said its forces 'struck a Hamas terrorist outpost' in the northern Gaza Strip in the last few hours where they killed 'dozens' of gunmen and destroyed anti-tank missile launch and observation posts.\nVideo released by the IDF shows Israeli troops walking through the bombed out streets of northern Gaza while raising their guns at the destroyed buildings - ready to pounce at any movement of Hamas terrorists potentially hiding within.\nThe army said it had hit around 300 targets and confiscated 'numerous weapons' such as guns and bombs as well as 'military compounds inside underground tunnels' belonging to Hamas terrorists.\nA protester shows off their hands covered in blood during the demonstration in Congress\nThe latest stunt follows a string of similar demonstrations on Capitol Hill over the Israel-Hamas war\nA Capitol Police officer approaches a woman holding a sign saying 'no to the siege of Gaza'\nAn Israeli tank is seen pushing through Gaza amid Israel's ground invasion on Tuesday\nBlinken was all smiles on Monday night when his children received candy from President Biden during the White House Halloween party\nIn response, Hamas gunmen attacked Israeli forces with machine gun fire and anti-tank missiles. 'The soldiers killed terrorists and directed air forces to real-time strikes on targets and terror infrastructure,' the IDF said.\nThe fighting came after Netanyahu on Monday evening slapped aside a call from 120 countries for a sustained humanitarian truce, saying such a ceasefire would be 'surrendering' to Hamas.\n'This will not happen,' the premier said, vowing Israel would 'fight until this battle is won'.\n'Calls for a ceasefire are calls for Israel to surrender to Hamas,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Protesters calling Antony Blinken a 'murderer' demand ceasefire in Gaza and derail hearing: Demonstrators hauled out and put up hands covered in 'blood' amid chaos in Congress", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12693421/Gaza-Israel-Antony-Blinken-ceasefire-blood-congress.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}