{"authors": ["Juliana Cruz Lima", "Neha Dhillon"], "date_download": "2024-02-05 15:16:50", "date_modify": "None", "date_publish": "2024-01-20 15:39:50", "description": "SEVERAL US troops have suffered \"traumatic brain injuries\" after an Iraqi airbase was hit by a barrage of rockets from Iran-backed militants.Several U", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25430645%2Frockets-attack-usa-airbase-army-iraq%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/newspress-collage-kxzzpdsrg-1705766395699.jpg?1705766405&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "SEVERAL US troops have suffered \"traumatic brain injuries\" after an Iraqi airbase was hit by a barrage of rockets from Iran-backed militants.\nSeveral US personnel are undergoing evaluation after multiple missiles and rockets were fired at the Ain al-Asad air base.\n3 A barrage of rockets was fired at the US airbase in Ain al-Asad in Iraq Credit: PA\n3 The reported attack took place on Saturday and is said to have left Iraqi officials 'seriously injured' Credit: Reuters\n3 A clip shared on social media appears to show the cloud trail of reported rockets Credit: X\nThe base, home to American forces in western Iraq, came under fire from multiple ballistic missiles and rockets at 6.30 pm (Baghdad time), the US Central Command said in a statement posted to X.\nIt added: \"Most of the missiles were intercepted by the base’s air defence systems while others impacted on the base.\n\"Damage assessments are ongoing.\n\"A number of U.S. personnel are undergoing evaluation for traumatic brain injuries.\n\"At least one Iraqi service member was wounded.\"\nThe Islamic Resistance in Iraq, an alliance of Iranian-backed militants that oppose the conflict between Israel and Hamas, has claimed that it carried out the attack in a press release.\nThe group initially attempted to launch a drone strike on the al-Asad base on October 18, but it was quickly intercepted.\nThey have also claimed responsibility for the drone strikes on al-Omar oil field, a US base in eastern Syria, the drone strikes on Al-Harir airbase, Iraq, and shooting down a US MQ-9 Reaper drone in Kuwait.\nThere are roughly 2,500 American troops in Iraq and some 900 in Syria.\nSaturday's air base attack comes amid soaring tensions in the Middle East following the outbreak of the Israel-Hamas war on October 7.\nEarlier in the day, the US Central Command forces carried out air strikes against a Houthi anti-ship missile.\nIt was aimed into the Gulf of Aden and was prepared to launch, the US military said.\n“US forces determined the missile presented a threat to merchant vessels and US Navy ships in the region, and subsequently struck and destroyed the missile in self-defense,” the US Central Command said in a statement on X.\nThe Middle East has become a powder keg unsettled by Israel's ongoing war against Hamas, Iran-backed Houthi rebel attacks in the Red Sea, and recent clashes and strikes between Iran and Pakistan.\nThe Yemeni rebel group has also guaranteed safe passage for Chinese and Russian ships in the Red Sea, as they continue to wage war on US ships.\nHouthi spokesman Muhammed al-Bukhaiti has criticised the US and UK for their role in the operations against Gaza, saying that all vessels in the region are safe as long as they have no links to Israel.\n\"The madness and idiocy of the USA and UK have played against themselves - now their ships will not be able to use one of the key trade arteries in the world,\" Bukhaiti said to Russian paper Izvestia.\n\"The US and UK will need to stop aggression against Yemen, stop the war in the Gaza Strip and ensure the uninterrupted flow of medicine, fuel and food.\n\"Only then will we immediately stop all our operations in the Red Sea.\n\"The war we are waging today is one of a kind in terms of its moral and ethical frontier.\n\"The whole world sympathises with Yemen's heroic stand to end the genocide of the Palestinian people.\n\"As for all other countries, including Russia and China, their shipping in the region is not threatened.\n\"Moreover, we are ready to ensure the safety of the passage of their ships in the Red Sea, because free navigation plays a significant role for our country.\"\nSoon after, the Houthis launched a fresh attack on an American ship in the Gulf of Aden.\nIn a statement posted to social media, the Houthis claimed that their naval forces carried out an operation against the Chem Ranger \"with several appropriate naval missiles, resulting in direct hits\".\nThe US has since denied this.\nThe US military's Central Command said the Houthis \"launched two anti-ship ballistic missiles at M/V Chem Ranger, a Marshall Island-flagged, US-Owned, Greek-operated tanker\" on Thursday night.\n\"The crew observed the missiles impact the water near the ship. There were no reported injuries or damage to the ship,\" the command said in a post on X.\nDownload our fantastic, new and improved free App for the best ever Sun Online experience. For iPhone click here, for Android click here.", "source_domain": "www.thesun.co.uk", "text": null, "title": "US troops suffer 'traumatic brain injuries' after Iraqi airbase is hit by missiles from 'Iranian-backed militants'", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25430645/rockets-attack-usa-airbase-army-iraq/"}