{"authors": ["Paul Withers"], "date_download": "2024-02-05 15:46:45", "date_modify": "None", "date_publish": "2023-10-31 11:29:00", "description": "Vladimir Putin's defence minister Sergei Shiogu issued a horrifying warning during a speech alongside Chinese counterparts at a security conference in Beijing.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1829887%2Fsergei-shiogu-russia-nuclear-threat-china.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5041548.jpg", "language": "en", "localpath": null, "maintext": "Sergei Shoigu warned over the 'threat of a direct military clash between nuclear powers'\nRussia has frequently boasted about its huge arsenal of nuclear weapons\nRussia's defence minister described his country's decision to withdraw from the Comprehensive Nuclear-Test-Ban Treaty earlier this month as a way to restore \"parity with the United States, which has not ratified this treaty.\" The Putin mouthpiece also tore into the US and NATO by accusing them of continuing \"to try to undermine Russia's security and deprive us of the will to resist,\" according to Russian state news agency Tass. Shiogu accused the West of trying to expand the war in Ukraine to Asia-Pacific and claimed NATO members are bolstering their military presence in the region under the cover of an \"ostentatious desire for dialogue.\" He also alleged the support from the West for Ukraine during the current conflict showed that it is seeking a \"strategic defeat of Russia.\"\nVladimir Putin followed by his Defence Minister, Sergei Shoigu\nZhan Youxia, the vice chairman of China’s Central Military Commission, also appeared to back up Shiogu's claims by taking a veiled swipe at the US. He said: \"Some countries deliberately create turbulence and interfere in other countries’ internal affairs.\" China is officially neutral on Russia's war in Ukraine but has previously opposed the Kremlin's nuclear rhetoric. Both remain close allies, with trade between the two countries recently surging. Earlier this month, Putin began preparing a \"massive\" retaliatory nuclear strike to wipe out Russia's enemies in the event of a rival nuclear attack.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nRussia and the US have by far and away the biggest nuclear weapons arsenals in the world\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Sergei Shiogu warns China of 'catastrophic' nuclear threat", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1829887/sergei-shiogu-russia-nuclear-threat-china"}