{"authors": [], "date_download": "2024-02-05 15:46:51", "date_modify": "None", "date_publish": "2023-10-31 10:25:29", "description": "A Philippine navy patrol ship has been shadowed by Chinese forces near a disputed shoal in the South China Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-china-scarborough-shoal-manila-united-states-b2438956.html.json", "image_url": "https://static.independent.co.uk/2023/10/31/10/Philippines_China_Disputed_Shoal_06708.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA Philippine navy patrol ship was shadowed by Chinese forces near a disputed shoal in the South China Sea, sparking a fresh exchange of accusations and warnings between the Asian neighbors Tuesday.\nChinese and Philippine security officials gave conflicting accounts of Monday's encounter near Scarborough Shoal. China has surrounded the shoal with its navy and coast guard ships since a tense standoff with Philippine vessels more than a decade ago.\nA rich fishing atoll and a safe mooring area during storms, Scarborough off the northwestern Philippines coast is one of most fiercely contested territories in the South China Sea, where Chinese and Philippine forces have faced off in recent months.\nThe frequent confrontations, which led to an Oct. 22 collision of Chinese and Philippine vessels near another disputed shoal, have prompted the United States to repeatedly renew a warning that it’s obligated to defend the Philippines, its oldest treaty ally in Asia, if Filipino forces, ships or aircraft come under an armed attack in the Pacific, including in the South China Sea.\nChinese air force Col. Tian Junli, a spokesperson for the Southern Theater Command of the People’s Liberation Army, said a Philippine warship trespassed into what he said were Chinese waters around Scarborough Shoal on Monday and was “tracked, monitored, warned and restricted” by the Chinese navy and air force for seriously violating “China’s sovereignty and international law.\"\n“We urge the Philippine side to immediately stop its infringement and provocation to avoid further escalation,” he said in a statement. “The troops assigned to the PLA Southern Theater Command remain on high alert at all times to resolutely defend China’s national sovereignty and security and peace and stability in the South China Sea.”\nPhilippine National Security Adviser Eduardo Año, however, said in Manila that the Philippine navy ship carried out a routine patrol of the waters in the vicinity of Scarborough “without any untoward incident,” but added that “Chinese vessels, as usual, conducted shadowing on the movement” of the Philippine navy ship.\nAño accused China of hyping up the encounter and “creating unnecessary tensions between our two nations.”\n\"The Armed Forces of the Philippines and the Philippine coast guard will not be deterred by the aggressive and illegal activities” of China’s navy, coast guard and militia forces, he added. \"We will protect our territory and sovereign rights at all cost,” Año said, citing the orders of Philippine President Ferdinand Marcos Jr. to Filipino forces.\nThe territorial disputes in the South China Sea, which also involve Vietnam, Malaysia, Taiwan and Brunei, have long been feared as an Asian flashpoint and have become a delicate fault line in the regional rivalry between the U.S. and China.\nIn Beijing on Tuesday, Singapore Defense Minister Ng Eng Hen underscored the importance of efforts to prevent conflicts from escalating, including by establishing defense hotlines.\nSoutheast Asian diplomats expressed concern over recent flare-ups of the disputes in the South China Sea in a new round of talks with their Chinese counterparts in Beijing last week, two regional diplomats told The Associated Press on condition of anonymity because they were not authorized to discuss the issue publicly.\nDuring the talks on a proposed nonaggression pact, the Chinese and Philippine delegations had a “tense exchange” of renewed accusations over recent confrontations, one of the diplomats said.\nThe proposed pact aims to prevent occasional spats from degenerating into a major armed conflict, but the negotiations have been stymied by differences, including whether the agreement should be legally binding and what areas of the strategic sea passage it should cover.", "source_domain": "www.independent.co.uk", "text": null, "title": "China's forces shadow a Philippine navy ship near disputed shoal, sparking new exchange of warnings", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-china-scarborough-shoal-manila-united-states-b2438956.html"}