{"authors": ["James Callery"], "date_download": "2024-02-05 15:46:53", "date_modify": "None", "date_publish": "2023-10-31 17:01:28", "description": "Army officials confirmed this morning that Nasim Abu Ajina, the commander of the Beit Lahia Battalion of Hamas' Northern Brigade, died in an airstrike on Monday night in Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12693919%2FIsraeli-airstrike-kills-Hamas-commander-set-terror-groups-paraglider-unit-used-carry-October-7-atrocities.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/16/77233213-0-image-m-30_1698771312911.jpg", "language": "en", "localpath": null, "maintext": "The IDF said an Israeli airstrike has killed a Hamas commander who set up the terror group's paraglider unit used to carry out the October 7 assault.\nArmy officials confirmed this morning that Nasim Abu Ajina, the commander of the Beit Lahia Battalion of Hamas's Northern Brigade, died in an airstrike in Gaza on Monday night.\nFootage shared by the IDF showed Israeli jets striking the building, setting off a series of explosions.\nThey said that Abu Ajina sent out the Kibbutz Erez and Moshav Netiv Hathara attacks that took place during the October 7 invasion, which saw around 1,400 killed and 240 taken hostage.\nThe day of terror began with paragliders descending on the Nova music festival near kibbutz Re'im at dawn and slaughtering scores of revellers.\nArmy officials confirmed this morning that Nasim Abu Ajina, the commander of the Beit Lahia Battalion of Hamas' Northern Brigade, died in an airstrike on Monday night\nFootage shared by the IDF showed Israeli jets striking his home, setting off a series of explosions\nFestivalgoers saw people falling all around them as more than 250 were killed in the surprise cross-border attack.\nThe IDF said Abu Ajina's death is a significant blow to Hamas's ability to disrupt IDF operations on the ground.\nIn a post on X, formerly Twitter, the IDF said: 'Fighter jets guided by intelligence information from the Amman and the Shin Bet, killed last night the commander of the Beit Lahia battalion in the northern division of Hamas, Nasim Abu Ajina, who sent the murderous attacks of Hamas on October 7 to Kibbutz Erez and the Moshav Netiv Hathara.\n'In the past, he commanded the Hamas air force, and took part in the development of the terrorist organization's drone and paraglider capabilities. His elimination constitutes a significant damage to the efforts of the terrorist organization Hamas in disrupting the ground operations of the IDF.'\nAnother devastating Israeli strike on the Jabalia refugee camp in northern Gaza left more than 50 dead and 150 wounded.\nThe IDF's spokesperson Rear Admiral Daniel Hagari confirmed that Israel's fighter jets had carried out the attack, which he said caused the terrorist group's underground infrastructure to collapse.\nThe IDF said the airstrike had also killed Hamas commander Ibrahim Biari, who they say is another of the leaders behind the October 7 assault.\nImages showed dozens of Palestinians walking around the banks of one of the crater as they continued their search for missing relatives among the ruined buildings.\nLines of white body bags also filled nearby streets, set for burial at a hospital near the encampment.\nIsrael said its forces attacked Hamas gunmen inside the terrorist's vast tunnel network beneath the Palestinian enclave of Gaza over the last day.\nThe tunnels are a prime objective for Israel as it expands ground operations inside Gaza to wipe out Hamas, which rules Gaza, following the October 7 massacre.\n'Over the last day, combined IDF (Israel Defense Forces) struck approximately 300 targets, including anti-tank missile and rocket launch posts below shafts, as well as military compounds inside underground tunnels belonging to the Hamas terrorist organization,' the Israeli military said in a statement.\nThe explosions on the building. The IDF said that Abu Ajina sent out the Kibbutz Erez and the Moshav Netiv Hathara attacks that took place during the October 7 invasion, which saw around 1,400 killed and 240 taken hostage\nPanic swept through the crowd who were partying in the north-western Negev desert, about 5 miles from the city of Ofakim\nIsraeli festivalgoers run for their lives through the desert after being warned of an incoming rocket attack just as Hamas invaded the country on October 7\nTerrorists responded with anti-tank missiles and machine gun fire, it added.\n'The soldiers killed terrorists and directed air forces to real-time strikes on targets and terror infrastructure,' the Israeli military said.\nIsraeli troops and Hamas terrorists today engaged in fierce battles in Gaza, where the dire humanitarian crisis spiralled and tearful Palestinian families scoured the rubble in a desperate search for loved ones.\nFootage from the Israeli military showed tanks and armoured bulldozers churning up bomb-scarred dirt tracks and troops searching shattered buildings for Hamas terrorists and the missing persons.\nWarplanes kept up a relentless barrage of strikes on Gaza, where the bombing campaign has now killed 8,525, according to the latest count given by the Hamas-run health ministry, with 3,542 of those children.\nIsrael's Prime Minister Benjamin Netanyahu has dismissed growing international calls for a ceasefire, saying it would be 'surrender' to the Hamas group he has vowed to destroy.\nHamas also released footage of battles within Gaza, including what it said was a military vehicle on fire.\nA picture taken from Israel's southern city of Sderot shows smoke rising during Israeli bombardment of the Gaza Strip on October 31, 2023\nPalestinians search for casualties at the site of Israeli strikes on houses in Jabalia refugee camp in the northern Gaza Strip, on October 31, 2023\nPalestinians search for casualties at the site of Israeli strikes on houses in Jabalia refugee camp in the northern Gaza Strip, on October 31, 2023\nPalestinians search for casualties at the site of Israeli strikes on houses in Jabalia refugee camp in the northern Gaza Strip, on October 31, 2023\nPalestinians search for casualties after houses in the Jabalia refugee camp were hit in the northern Gaza Strip, on October 31, 2023\nA view from the area after Israeli airstrikes on Jabalia refugee camp in northern Gaza, on October 31, 2023\nDevastated Palestinians assess the damage following a suspected Israeli airstrike on Nuseirat refugee camp in central Gaza, on October 31, 2023\nRelatives of the Palestinians, who lost their lives after Israeli attacks, mourn as the bodies are carried for burial from Indonesian Hospital on the 25th day Gaza City, Gaza on October 31, 2023\nRelatives of the Palestinians, who lost their lives after Israeli attacks, mourn as the bodies are carried for burial from Al Aqsa Martyrs Hospital on the 25th day Deir Al-Balah, Gaza on October 31, 2023\nPalestinian children mourn relatives killed in the Israeli bombardment of the Gaza Strip, in front of the morgue in Deir al Balah, on October 31, 2023\nThe IDF claimed that Ibrahim Biari (pictured in image supplied by IDF), the commander of Hamas's Central Jabaliya Battalion who they say was one of the leaders behind the October 7 massacre in Israel, was killed in the intense blast\nNone of this footage could be independently verified but images showed plumes of smoke rising above Gaza and Israeli helicopters raining down rockets on the northern Gaza Strip.\nThe humanitarian toll has sparked a global backlash, with aid groups and the United Nations warning time is running out for many of the territory's 2.4 million people denied access to food, water, fuel and medicine.\n'Gaza has become a graveyard for thousands of children. It's a living hell for everyone else,' said children's aid agency UNICEF, urging an 'immediate humanitarian ceasefire'.\nSurgeons are conducting amputations on hospital floors without anaesthetic, and children are forced to drink salty water, said Jean-Francois Corty, vice-president of Medecins Sans Frontieres, which has 20 staff on the ground.\nIsrael has accused Hamas of using hospitals as military headquarters and civilians as 'human shields', charges the group dismisses as 'baseless' propaganda.\nAs even Israel's staunchest allies voiced concern about the humanitarian crisis in southern Gaza, the UN agency for Palestinian refugees UNRWA said there was not nearly enough aid to meet the 'unprecedented' needs.\n'When an eight-year-old tells you that she doesn't want to die, it's hard not to feel helpless,' said UN humanitarian chief Martin Griffiths.\nHisham Adwan, Gaza director of the Rafah crossing with Egypt where some aid has been allowed in, said 36 trucks had been waiting there since the previous day.\n'I feel that it's extremely slow and there's disruption to UNRWA's work, and we don't know why,' he said.\nIsrael said it is inspecting cargo to make sure weapons are not being smuggled in, and monitoring it to guarantee Hamas does not seize the supplies.\nA picture taken from Israel's southern city of Sderot shows smoke rising during Israeli bombardment of the Gaza Strip on October 31, 2023\nThis picture taken on October 31, 2023 from a position along the border with the Gaza Strip in southern Israel shows smoke plumes billowing during Israeli bombardment\nAn Israeli army armoured tracked vehicle is deployed at a position along the border with the Gaza Strip in southern Israel on October 31, 2023\nThe incursion scored an early victory on Monday: the rescue of Private Ori Megidish, an Israeli soldier in Hamas captivity who was reunited with her family.\nBut there was heartbreak for relatives of another missing woman, 23-year-old German-Israeli Shani Louk, who was abducted from a music festival and then paraded around Gaza.\nHer remains were found on Monday, with her sister Adi voicing her 'great sorrow' as she shared news of her death on social media.\nOther families have endured an unbearable wait for news of relatives seized by Hamas terrorists and thought to be held in a labyrinth of tunnels in Gaza.\nHadas Kalderon walked through the scorched homes of the Nir Oz kibbutz, near Israel's border with Gaza, where gunmen killed her mother and niece and kidnapped her 12-year-old son and 16-year-old daughter.\n'I don't have any control and knowledge about army actions, I just know my children are still there in the middle of a war,' said the 56-year-old.\n'It's a disaster. It's really hell. There is no word to express this.'\nHamas on Monday released a video of what it said were three women hostages, seated against a tile wall. One urged Israel to agree to a Hamas-demanded prisoner swap.\nNetanyahu dismissed the clip, the time and place of which could not be verified, as 'cruel psychological propaganda'.\nIn a televised address today, Abu Obeida, a spokesman for Ezzedine Al-Qassam Brigades, said: 'We have informed intermediaries that we will release a certain number of foreigners in the next few days.' Five hostages have so far been released.\nMeanwhile, in a sign that the conflict risked spreading throughout the region, Yemen's Iran-backed Huthi rebels fired drones and missiles towards Israel and vowed to keep up attacks.\nIsrael's army also said it had intercepted a missile fired from the Red Sea region.\nIsrael's military has struck targets in Syria and traded cross-border fire with Hezbollah militants in Lebanon, whose caretaker prime minister Najib Mikati said it was his 'duty to prevent Lebanon from entering the war'.\nAnis Abla, head of Lebanon's Civil Defense Centre in Marjayoun, near the Israeli border, said they were completely unprepared for war.\n'Our equipment is very primitive and there is a shortage of all tools, such as fire suits and extinguisher cylinders,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli airstrike 'kills Hamas commander who set up terror group's paraglider unit used to carry out October 7 atrocities'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12693919/Israeli-airstrike-kills-Hamas-commander-set-terror-groups-paraglider-unit-used-carry-October-7-atrocities.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}