{"authors": ["Aurora Bosotti"], "date_download": "2024-02-05 15:46:54", "date_modify": "None", "date_publish": "2023-10-31 16:18:00", "description": "The Hamas-run Gazan Ministry of Interior branded the blast a 'horrific massacre' as it reported more than 150 people were injured.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1830054%2Fisrael-hamas-war-dozens-killed-Jabaliya-refugee-camp-gaza-hit.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5042415.jpg", "language": "en", "localpath": null, "maintext": "Video claims to show Israeli tank attack in Gaza strip\nDozens of people have been killed after a new wave of Israeli airstrikes collapsed apartment blocks in a refugee camp in Gaza, a hospital director has claimed. The chief of the Indonesian Hospital reported several people died after the Jabaliya refugee camp, in the north of the strip, was struck on Tuesday. Israeli Defence Forces (IDF) spokesman Daniel Hagari confirmed on Tuesday evening that Israeli fighter jets struck the refugee camp. Hagari added that a senior Hamas commander died in the strike and the group's underground infrastructure collapsed. The Hamas-run interior ministry of the enclave claimed apartment blocks inside the camp were struck in the latest wave of Israeli Defense Forces-led shelling, according to The Associated Press.\nJabaliya has been housing hundreds of civilians displaced since the start of Israel's war on Hamas\nFootage from Jabaliya showed four craters where buildings used to be\nMinistry spokesman Ayed al Bazm reported six bombs struck the area. They claimed at least 50 people were killed in the blast and 150 were wounded. This website could not independently verify the number of victims at the time of publication as rescue operations are underway. Footage of the scene from Al-Jazeera TV showed at least four large craters where buildings once stood, amid a large swath of rubble surrounded by partially collapsed structures. Dozens of rescue workers and bystanders dug through the wreckage, searching for survivors beneath the pancaked buildings. A group of young men pulled two children from the upper floors of a damaged apartment block, cradling them as they climbed down. More than half the territory's 2.3 million Palestinians have fled their homes, with hundreds of thousands sheltering in packed UN-run schools-turned-shelters or in hospitals alongside thousands of wounded patients.\nMore than a million Palestinian have had to flee their homes since the start of the war\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial", "source_domain": "www.express.co.uk", "text": null, "title": "Israel-Hamas war: Dozens killed in devastating refugee camp blast in Gaza", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1830054/israel-hamas-war-dozens-killed-Jabaliya-refugee-camp-gaza-hit"}