{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:46:55", "date_modify": "None", "date_publish": "2023-10-31 12:20:54", "description": "Iran today boasted its powerful proxies 'won't stay silent' and hinted the fighting between Israel and Hamas could engulf the Middle East.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12692691%2FIran-backed-Huthi-rebels-fire-drones-Israel-Yemen-boast-allegiance-axis-resistance-aiding-Hamas-fresh-sign-conflict-broadening-region.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/12/77215963-0-image-a-11_1698754401190.jpg", "language": "en", "localpath": null, "maintext": "Follow MailOnline's live blog for all the latest updates on the Israel-Hamas war.\nIran today warned the situation in the Middle East could 'get out of control'\nHuthi rebels said they fired a series of drones towards Israeli city of Eilat\nIran today boasted its powerful proxies 'won't stay silent' and hinted the fighting between Israel and Hamas could engulf the Middle East after the Tehran-backed Huthi rebels fired drones into the Jewish state from Yemen.\nThe Huthis, who seized Yemen's capital Sanaa in 2014 and control large swathes of the country, said they fired a series of drones towards the Red Sea city of Eilat this morning in retaliation to Israel's war against Hamas.\n'These drones belong to the state of Yemen. We are fighting with words and drones,' Abdelaziz bin Habtour, prime minister of the Huthi government, said.\nThe addition of yet another Iran-backed group fighting against Israel marks a terrifying escalation in the war and heightens fears the fighting in Gaza could engulf the Middle East.\nIt means that Israel is facing attacks by Tehran-backed groups from every direction - from Hamas to its east, Hezbollah terrorists from the north in Lebanon, Syria's National Defence Forces to the west and now Yemen's Huthis from the south.\nAnd adding yet more fuel to the fire, Iran today warned the situation in the Middle East could 'get out of control' if a ceasefire isn't reached and said it was 'natural' for Tehran-backed groups like Hezbollah and the Huthis to attack Israel.\n'It is natural that the resistance groups and movements do not remain silent against all these crimes' committed by Israel, Iran's top diplomat Hossein Amir-Abdollahian Amir-Abdollahian said during a visit to Qatar.\n'They will not wait for anyone's advice, therefore we need to use the last political opportunities to stop the war,' he said, warning of a wider spillover if no ceasefire is reached.\nHabtour meanwhile boasted the Huthis are 'part of the axis of resistance' against Israel, referring to Iran and the Tehran-backed terror group Hezbollah in Lebanon, which has been clashing with Israeli forces on the northern border.\nHuthi fighters fire anti-tank grenades during a military manoeuvre near Sanaa, Yemen\nThe Huthis, who seized Yemen's capital Sanaa in 2014 and control large swathes of the country, said they fired a series of drones towards the Red Sea city of Eilat\nIsraeli army tracked medical vehicles move along a road near the northern town of Kiryat Shmona close to the border with Lebanon on Tuesday amid increasing cross-border tensions between Hezbollah and Israel\nIsraeli military forces operate near the Israel-Gaza border in Israel on Tuesday\nAn Israeli army soldier puts on his helmet as he mans a turret in an armoured tracked vehicle is deployed at a position along the border with the Gaza Strip in southern Israel on Tuesday\nHuthi fighters gather to discuss manoeuvres as they hold Palestinian flags aloft\nA Huthi fighter fires an RPG grenade from the back of a motorcycle. Abdelaziz bin Habtour, prime minister of the Huthi government, boasted that they are 'part of the axis of resistance'\nAir sirens blared across Eilat today amid warnings of a 'hostile aircraft' soaring towards the city, sending terrified residents of the popular tourist resort running for shelter.\nThe Israeli military said its forces intercepted a missile over the Red Sea with their 'Arrow' aerial defence system and shot down what appeared to be a drone near Eilat. The IDF added neither entered Israeli airspace and 'there is no threat in this region and no danger'.\nIt did not say who launched them, but earlier this month, a U.S. Navy destroyer in the Red Sea intercepted three cruise missiles and several drones launched toward Israel by Huthi rebels in Yemen.\nSix people were lightly injured in neighbouring Egypt when debris hit a building in the Sinai resort of Taba, just across the border from Eilat, the Egyptian army said at the time.\nAnd on October 19, the US Navy said it shot down three land-attack cruise missiles and 'several' drones that had been fired by the Huthis, possibly at Israel.\nThe rising number of attacks on Israel by the Huthi rebels, who are backed by Iran, comes amid heightened fears the Israel-Hamas conflict will engulf the Middle East in an all-out war.\nIsrael has been pounding the Gaza Strip relentlessly since gunmen from Hamas stormed across the border on October 7 and slaughtered more than 1,400 people, most of them civilians.\nSince then, more than 8,300 people have been killed, many of them children, according to the health ministry in Hamas-run Gaza, an impoverished slice of land which is home to 2.4 million people.\nThe war has also threatened to ignite even heavier fighting on other fronts, especially as Iran, which financially and militarily backs Hamas has loyalists and proxy fighters in Iraq, Syria, Lebanon and Yemen.\nLebanon's Hezbollah militant group, which has a massive arsenal of long-range rockets, has traded fire with Israel along the border on a near-daily basis and hinted it might join the war if Israel seeks to annihilate Hamas.\nCivil defense teams conduct operations with the help of civilians at the scene after an Israeli airstrike caused destruction in Rafah, Gaza, on Tuesday\nSmoke rises following an Israeli airstrike in the Gaza Strip, as seen from southern Israel, on Tuesday\nAnd Israel and the US have struck targets in Syria linked to Iran, which supports Hamas, Hezbollah and other armed groups in the region.\nIsraeli Prime Minister Benjamin Netanyahu has warned Iran and Hezbollah that they will pay a 'high price' if they enter the conflict and join Hamas in its war against Israel.\n'Don't test us in the north. Don't make the mistake of the past. Today, the price you will pay will be far heavier,' Netanyahu threatened Hezbollah and Iran, referring to Israel's 2006 war with terror group.\nHezbollah terrorists have vowed to 'respond' to any move by Israel to invade Gaza with the group's chief saying they are 'fully prepared' to fight alongside Hamas, raising already heightened fears of an all-out conflict.\nAn Israeli army armoured tracked vehicle moves near a stationed artillery howitzer at a position along the border with the Gaza Strip in southern Israel on Tuesday\nAn Israeli tank is seen pushing through Gaza amid Israel's ground invasion on Tuesday\nIsrael Defense Forces (IDF) soldiers fire a 155 mm howitzer at an undisclosed location near the border with Gaza, southern Israel on Tuesday\nIsrael Defense Forces (IDF) soldiers fire a 155 mm howitzer at an undisclosed location near the border with Gaza, southern Israel on Tuesday\nIsraeli forces entered Gaza on tanks in the fourth night of major ground operations inside northern Gaza overnight\nA Palestinian man from al-Badrasawi family carries the body of his child who was killed in Israeli strikes, at Shuhada Al-Aqsa hospital in the central Gaza Strip on Tuesday\nIn the occupied West Bank, where Israeli-Palestinian violence has also surged, the army demolished the family home of Saleh al-Arouri, a senior Hamas official exiled over a decade ago. Ali Kaseeb, head of the local council in the village of Aroura, said the home had been vacant for 15 years.\nThe regional violence comes as Israel said its forces battled Hamas gunmen inside the terrorists' vast tunnel network beneath Gaza and struck 300 targets overnight.\nThe tunnels are a key objective for Israel as it expands ground operations inside Gaza to wipe out Hamas following its gun rampage three weeks ago that killed over 1,400 people.\nIn the fourth night of major ground operations inside northern Gaza, the army said it hit around 300 targets including missile and rocket launch posts and 'military compounds inside underground tunnels' belonging to Hamas terrorists.\nIn response, Hamas gunmen attacked Israeli forces with machine gun fire and anti-tank missiles. 'The soldiers killed terrorists and directed air forces to real-time strikes on targets and terror infrastructure,' the IDF said.\nThe fighting came after Netanyahu on Monday evening slapped aside a call from 120 countries for a sustained humanitarian truce, saying such a ceasefire would be 'surrendering' to Hamas.\n'This will not happen,' the premier said, vowing Israel would 'fight until this battle is won'. 'Calls for a ceasefire are calls for Israel to surrender to Hamas,' he said.\nBut Israel's withering airstrikes have continued to obliterate entire neighbourhoods across the densely populated territory, leaving death and destruction in its wake.\nExhausted Palestinians desperately searched through the rubble of their homes for loved ones across Gaza this morning, their screams piercing the air as they found the lifeless bodies of their children, wives and parents.\nIn the three weeks since Israel began its ruthless aerial bombardment, thousands of homes have been destroyed across the 25-mile enclave and 8,525 Palestinians killed, including 3,542 children.\nThe aerial bombardments have been followed by a large-scale ground offensive inside Gaza.\nOn Monday, witnesses said Israeli forces targeted Gaza's main north-south road on Monday and attacked Gaza City from two directions. They said they saw 'dozens' of Israeli tanks operating on the southern outskirts of Gaza City.\nIsraeli soldiers jump from an armoured personnel carrier (APC), amid the ongoing conflict between Israel and Hamas, near the border between Israel and Gaza Strip in Israel on Tuesday\nIsraeli soldiers aboard armored personnel carriers (APC) on patrol at a main road near the town of Kiryat Shmona, near the Israel-Lebanon border in Israel on Tuesday\nJonathan Conricus, an Israeli military spokesman, said ground operations are focused on northern Gaza, including Gaza City, which he said was the 'center of gravity of Hamas.'\n'But we also continue to strike in other parts of Gaza. We are hunting their commanders, we are attacking their infrastructure, and whenever there is an important target that is related to Hamas, we strike it,' he said.\nConricus said some 800,000 people have heeded the Israeli military's orders to flee from the northern part of the strip to the south. But tens of thousands of people remain in and around Gaza City, and casualties are expected to mount on both sides as the battle moves into dense, residential neighbourhoods.\nThe mounting death toll has drawn calls from the U.S., Israel's top ally, 120 governments and the UN for a pause in fighting to allow more humanitarian aid to reach the enclave.\n'Nearly 70 percent of those reported killed are children and women,' said Philippe Lazzarini, who heads the UN agency for Palestinian refugees UNRWA. 'This cannot be 'collateral damage'.'\nOn Monday, the UNRWA said the limited number of aid trucks entering Gaza was insufficient to meet the 'unprecedented humanitarian needs' and civil order has broken down with people storming UN warehouses in search of food.\nThat has put four U.N. aid distribution centres and a storage facility out of action, the United Nations agency for Palestinian refugees (UNRWA) said on Monday.\n'It's a disaster on top of a disaster. Health needs are soaring and our ability to meet those needs is rapidly declining,' World Health Organization regional emergencies chief Rick Brennan said, reiterating international calls for a ceasefire to enable a larger humanitarian operation.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Iran boasts its proxies 'won't stay silent' and hints of war across the region as Tehran-backed Huthi rebels fire drones into Israel from Yemen and pledge allegiance to the Hamas 'axis of resistance'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12692691/Iran-backed-Huthi-rebels-fire-drones-Israel-Yemen-boast-allegiance-axis-resistance-aiding-Hamas-fresh-sign-conflict-broadening-region.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}