{"authors": [], "date_download": "2024-02-05 15:46:56", "date_modify": "None", "date_publish": "2023-10-31 12:40:48", "description": "Nine arrests have been made, according to Palestine Action US", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Felbit-systems-protest-boston-palestine-b2438583.html.json", "image_url": "https://static.independent.co.uk/2023/10/30/17/Screenshot%202023-10-30%20at%2017.50.10.png?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPro-Palestine activists have claimed they shut down a Boston arms company that supplies Israel.\nPalestine Action US posted on X alleging it “completely halted” the business of Elbit Systems in Boston after a protest on Monday.\nElbit Systems, an Israel-based international defense electronics company, is the largest weapons supplier to Israel.\nThe company’s American subsidiary, Elbit Systems of America, has operational facilities in Texas, New Hampshire, Alabama, Virginia and Florida, according to the company’s website.\nVideo footage posted on social media appears to show activists from the group Palestine Action protesting outside the headquarters of Elbit Systems in Boston on Monday.\nAround 200 protestors could be heard chanting “Elbit Systems has got to go”. Some protestors could also be heard telling officers “You’re defending genocide of children”, and calling them “f***ing pigs” as police shouted “get back”.\nThe protestors then began chanting “Who do you protect? Who do you serve?” as officers appeared to restrain a protestor and lead them away.\nProtestors could also be heard shouting “Free, free Palestine”.\nElbit America denied claims that it or its Cambridge plant had been shut down and said operations were still under way.\nA statement from Elbit America’s leadership said: “Our extraordinary office in Cambridge works with bio-tech and local academic communities and has played a vital role in combatting COVID-19 in the US by designing and manufacturing COVID testing instruments for hospitals and frontline medical workers. In this time of anguish and sorrow, we stand with the people of Israel as they defend their country and safeguard their citizens.”\nNine arrests were made, Cambridge police said, after protestors broke through barricades protecting the building and blocked the entrance.\nPolice said the protest was initially peaceful, but erupted into chaos when protestors began vandalising the building, which has been the site of numerous protests in recent weeks.\nCambridge PD said protestors threw “smoke pellets”, eggs and other projectiles at the building and at police officers, leading to police attempting to place numerous people under arrest for defacing the building.\nPolice are seen restraining a protestor outside the headquarters of Elbit Systems in Boston (Palestinian Action US VIA Twitter)\nAt this point, police said, some of the protestors became hostile and assaulted police officers. One officer was knocked to the ground, while another was hit in the chest with a “smoke pellet,” Cambridge PD said.\nMultiple protestors were pepper sprayed by Cambridge PD officers, the force confirmed.\nA busy roadway nearby was shut by police “to ensure the safety of the protestors and the public in the area,” Cambridge PD added.\nNine people were arrested and now face several charges including Disorderly Conduct. The protestors are due to be arraigned in Cambridge District Court on Tuesday.\nCambridge PD said the protestors’ actions “created an extremely hazardous situation for everybody present, including themselves, passersby, and the officers.”\nBut the force insisted it is “committed to providing ample space and opportunities for protestors to engage in freedom of speech.”\nMonday’s protest came after Palestine Action activists threw red paint and blockaded the entrance to Elbit’s Boston facility earlier in the month.\nThe group claims Elbit Systems “arm the genocide of the Palestinian people.”\nHamas militants launched a surprise attack on Israel on 7 October, killing more than 1,400 people and taking dozens hostage across the Gaza border.\nSince then, Israel has launched retaliatory airstrikes on Gaza, resulting in the death of over 8,000 Palestinians.\nThe Israeli government ordered the “complete siege” of Gaza as authorities cut off electricity and blocked the entry of food and fuel.\nThe Israeli Defence Forces (IDF) ordered all Gaza civilians to leave the area and head southward — a command that the United Nations said is “impossible” to carry out.\nOver the weekend, Israel widened its air and ground assault, cutting all telecommunications in the city, leaving millions of residents without power or means of contact.\nInternational humanitarian organisations said the blackout, which began late on Friday, was worsening an already desperate situation by impeding life-saving operations and preventing contact with their staff on the ground.\nAid organisations also said the blackout caused citizens in Gaza to be unable to call ambulances.", "source_domain": "www.independent.co.uk", "text": null, "title": "Pro-Palestine activists claim to have shut down Boston arms company that supplies Israel", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/elbit-systems-protest-boston-palestine-b2438583.html"}