{"authors": ["Alex Croft", "Image", "Afp Via Getty Images"], "date_download": "2024-02-05 15:47:00", "date_modify": "None", "date_publish": "2023-10-31 14:47:03", "description": "Protestors with their hands covered in blood disrupted a hearing in Congress today, with protestors accusing Secretary of State Antony Blinken of having blood on his hands", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-protestors-bloody-hands-storm-31326164.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31326145.ece/ALTERNATES/s1200/3_US-POLITICS-CONGRESS-SECURITY-BLINKEN-AUSTIN.jpg", "language": "en", "localpath": null, "maintext": "Protestors with their hands covered in blood disrupted a hearing in Congress today, with protestors accusing Secretary of State Antony Blinken of having blood on his hands\nIn dramatic scenes, protestors calling for a ceasefire in Gaza took over a Congress hearing and accused Secretary of State Antony Blinken of being a \"murderer\".\nDemonstrators chanted “Ceasefire now!\" as Secretary of State Blinken and Defense Secretary Lloyd Austin sat in silence, until at least five protestors who interrupted the hearing were escorted out by security. One sign said “All the walls have got to go,\" while a protestor shouted: “Blinken, you have blood on your hands. Murderer!” It is one of a series of demonstrations on Capital Hill concerning the Israel-Hamas war.\nThe protest comes as the Israeli bombardment and military action in Gaza continues, following the deadly attack by Hamas on southern Israel on October 7. The Israeli response has now turned into a ground offensive, with Israeli authorities saying there have been large clashes on the ground with Hamas in North Gaza.\nREAD MORE: Israel Palestine LIVE: Yemen and Lebanon fire missiles across border amid rising tensions\nImage: AFP via Getty Images) AFP via Getty Images)\nWhile Blinken was issuing a speech, he was interrupted regularly by people in the audience calling for the US to stop \"supporting the genocide of the people in Gaza\". He was issuing a testimony to the testimony to the Senate Appropriations Committee.\nAt the hearing, Blinken was set to make the case that the US must immediately send $105billion emergency aid to conflict zones around the world. This aid package included support for Ukraine and Israel - but it has faced serious roadblocks in a divided Congress. Just yesterday, however, Republicans announced a plan to send $14.3billion to Israel.\nImage: AFP via Getty Images) AFP via Getty Images)\nOver 50 people have this afternoon been killed at the Jabalia refugee camp in northern Gaza, according to the Hamas-run Health Ministry and the director of a nearby Indonesian hospital. They claim the blast came from an Israeli air strike - a claim which is as yet without verification. Since Hamas killed 1,400 people and kidnapped 239 in their attack on 7 October, over 8,500 have been killed in Gaza due to Israel's retaliatory airstrikes and military action.\nOne heckler at the protest shouted: \"'Stop the brutal, brutal massacre in Gaza…Ceasefire now! Ceasefire now.\" Once the protestors had been removed from the building, Blinken resumed his testimony. He referenced the protest, saying: \"I also hear very much the passions expressed in this room and outside this room. All of us are committed to the protection of civilian life.\"\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US\nEarlier today, the Israeli Defense Force said they had killed \"dozens\" of terrorists on the fifth day of the ground offensive in northern Gaza. Along with video footage of IDF forces on the ground they claimed their forces had engaged in \"fierce\" fighting \"deep\" inside Gaza. The IDF claimed they successfully destroyed anti-tank missile launch cells, destroyed observation posts, and confiscated \"numerous weapons\" including bombs.\nImage: AFP via Getty Images) AFP via Getty Images)\nViolence has also continued in the occupied West Bank, with at least 121 Palestinians and one Israeli soldier having so far been killed. Forced evictions of West Bank residents from their homes and settler violence against West Bank civilians have both ramped up since October 7, according to the OCHA. The OCHA has recorded 171 settler attacks, with almost half of the incidents involving Israeli forces, either accompanying or supporting the settlers in their attacks.\nUS bases in the Middle East have also come under attack as concern grows that the conflict in Gaza could spread across the region. Antony Blinken has warned that any attacks on US forces - a number of which are believed to have come from Iranian-backed militias - will be met with a response by the US military.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Protestors with 'bloody' hands storm Congress shouting 'murderer' and demanding Gaza ceasefire", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/breaking-protestors-bloody-hands-storm-31326164"}