{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:47:03", "date_modify": "None", "date_publish": "2023-10-31 13:58:30", "description": "U.S. forces deployed to the Middle East have come under fire once again, this time at the Ain al-Asad air base in western Iraq. Forces have come under repeated attacks since Oct. 7.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12693187%2FAmerican-troops-Middle-East-targeted-25TH-TIME-Iraq-base-hit-drone-strike-hours-White-House-said-holding-Iran-accountable.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/14/77223415-0-image-a-3_1698763060685.jpg", "language": "en", "localpath": null, "maintext": "U.S. forces deployed to the Middle East have been targeted for the 25th time since the Hamas attack on Israel October 7, amid fears of a widening conflict.\nThe attack came as two armed drones targeted the Ain al-Asad airbase in Iraq, which U.S. and international forces use in western Iraq to go after remnants of ISIS.\nIt follows repeated attacks on U.S. forces in the region, and came on a day Israeli Prime Minister Benjamin Netanyahu quoted the Old Testament and declared 'this is a time for war,' rejecting calls for a cease fire.\nIsraeli Defense Forces have been pounding Gaza, and Israeli forces have also begun operations inside Gaza as part of their effort to root out Hamas following the terror attacks earlier this month.\nThe attack is the 25th on U.S. forces in Iraq and Syria since Oct. 17 – which prompted the U.S. to unleash airstrikes on targets inside eastern Syria used by Iran's Islamic Revolutionary Guard Corps (IRGC) last week.\n'I think we proved pretty clearly last night that we're holding Iran accountable,' White House national security spokesman John Kirby said Friday.\nTwo armed drones targeted the Ain al-Asad airbase in Iraq, in the latest in a series of attacks on US forces since the Hamas attack inside Israel October 7\nThe methods of attack have included rockets and 'kamikaze' drones, and have injured 24 troops while killing an American contractor, and come amid terse warnings from President Biden to any nations or factions not to exploit the turmoil in the Middle East.\nThe attack did not cause either casualties or damage, sources told Reuters.\nU.S. and coalition troops have been attacked at least two dozen times by rockets and drones in Iraq and Syria between October 17 and 30, according to the U.S. Defense Department website citing a senior U.S. defense official.\nThe Biden administration has repeatedly vouched for Israel's right to defend itself, even while facing calls to pressure Israel into a cease fire or pause of its offensive into Gaza.\nNetanyahu's response at a press conference in Israel Monday rejected the idea, saying a ceasefire in Gaza 'will not happen' and would amount to 'surrender to Hamas, to surrender to terrorism, to surrender to barbarism'. He vowed to 'resign Hamas to the dustbin of history,' even as military experts warned of the daunting threat posed by Hamas' network of miles of tunnels under Gaza.\n'The Bible says there is a time for peace and a time for war. This is a time for war,' the Israeli PM said.\nThere has been a marked increase in attacks on U.S. forces since the conflict in Israel broke out on Oct. 7 and Iraqi armed groups aligned with Iran threatened to target U.S. interests with missiles and drones if Washington intervened to support Israel against Hamas in Gaza.\nThe Pentagon has dispatched US Army Terminal High Altitude Area Defense (THAAD) to the region as a form of force protection\nThe Pentagon has dispatched the USS Gerald R. Ford (pictured) and USS Dwight D. Eisenhower to the region\nIsraeli forces have exchanged fire with Hezbollah forces in Lebanon, raising fears of a wider war\nThe Ain al-Asad airbase in western Iraq sustained rocket damage in 2020 following the US killing of Iranian General Qasem Soleimani. It came under fire yet again\nSmoke rises from hills above the souther Lebanese village of Maroun Al Ras, opposite the Israeli Moshav of Avivim during Israeli artillery shelling on October 25, 2023. President Biden has warned nation states and factions against exploiting the conflict\nAlthough the US has pulled back from its substantial presence in Baghdad (seen here in 2003), there are still American troops battling ISIS from inside Iraq and Syria\nA group called the 'Islamic resistance in Iraq' has endorsed Tuesday's attack.\nOn Monday, four Katyusha rockets were fired at Iraq's Ain al-Asad air base, an attack also claimed by the same group.\nIran-backed militia groups in Iraq have consistently demanded the expulsion of American troops after a U.S. air strike in Baghdad killed senior Iranian general Qassem Soleimani and Iraqi militia commander Abu Mahdi al-Muhandis in 2020. The militia groups since then resorted to rocket attacks on U.S. forces in the country and the embassy in Baghdad.\nThese attacks stopped when Prime Minister Sudani - nominated by the coordination framework, the largest parliamentary bloc composed of an alliance of Iran-aligned factions - assumed power last year.\nCalls for the expulsion of U.S. troops have also been relatively quiet since then. But these demands, along with the attacks, have resumed in connection with increased Israeli bombardment on Gaza.\nIn the latest such call, on Monday, Iraqi politician Hadi Al-Amiri, leader of the Political and Military Badr organization close to Iran, urged the government to 'take all necessary measures to set a serious, specific, and short-term timetable for the exit of international coalition forces from Iraq.'\nAmiri's call comes a few days after Iraq's Shi'ite cleric Muqtada al-Sadr called on the Iraqi government and lawmakers to close the U.S. embassy in Baghdad in response to Washington's 'unfettered support' for Israel.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "American troops in the Middle East targeted for the 25TH TIME: Iraq base hit by drone strike hours after White House said it's holding Iran 'accountable'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12693187/American-troops-Middle-East-targeted-25TH-TIME-Iraq-base-hit-drone-strike-hours-White-House-said-holding-Iran-accountable.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}