{"authors": ["Kelly Laco", "Executive Editor Of Politics For Dailymail.Com"], "date_download": "2024-02-05 15:47:06", "date_modify": "None", "date_publish": "2023-10-31 17:12:59", "description": "Republican senators are demanding Chuck Schumer reject President Biden's ask for $9 billion in humanitarian assistance to civilians in Gaza because it will land in the hands of Hamas terrorists.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12693621%2FTen-GOP-senators-urge-Democrat-Chuck-Schumer-REJECT-Bidens-9BILLION-Gaza-humanitarian-aid-ask-gift-Hamas-murderers.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/17/77229827-0-image-m-19_1698772370978.jpg", "language": "en", "localpath": null, "maintext": "Republican senators are demanding Democratic Leader Chuck Schumer reject President Biden's ask for $9 billion in humanitarian assistance to civilians in Gaza because it will land in the hands of Hamas terrorists.\nThe lawmakers warned in a letter to Schumer Tuesday obtained by DailyMail.com that 'sending aid to the Palestinians in Gaza is akin to funneling aid directly to Hamas' because there is no way for the U.S. to have proper oversight of their funds. In addition, Hamas has stolen aid from the UN's Palestine refugees agency over over a decade - and as recently as last week.\nThe senators went on to say that the aid will 'inevitably end up in the hands' of Hamas, a 'genocidal Palestinian terrorist organization' and will only strengthen their ability to 'murder more Jews.'\n'Sending aid to the Palestinians would be a gift to Hamas, the same group that slaughtered over 1,400 Israelis and abducted over 200 hostages, including Americans,' they state.\nBiden's $106 billion request to Congress for aid to Israel and Ukraine and other humanitarian purposes comes after Hamas murderers killed over 1,400 civilians on Oct. 7 - including over 30 Americans.\nHundreds of hostages were taken and remain in Gaza and Israeli forces are ramping up a ground invasion to rescue those taken.\nCivil defense teams conduct operations with the help of civilians at the scene after an Israeli airstrike caused destruction in Rafah, Gaza\nPalestinians search for casualties at the site of Israeli strikes on houses in Jabalia refugee camp in the northern Gaza Strip\nSchumer has said that the Senate 'must pass' Biden's supplemental request as soon as possible\nThousands of families and individuals in Gaza have been displaced from their homes and are trying to leave the small strip of land. Israel has warned all civilians to evacuate as they continue their advance.\nThat includes as many as 600 Americans currently in the Gaza strip. Reports show that civilians are running out of clean water and other supplies.\nThe Pentagon said that Hamas is not allowing those Americans trapped in Gaza to escape. The U.S., Israel and its allies are working to allow civilians to exit Gaza through the Rafah crossing into Egypt.\nSchumer has said that the Senate 'must pass' Biden's supplemental request as soon as possible.\n'And in Gaza, we must ensure that humanitarian aid gets to civilians who need it urgently,' he said on the Senate floor Monday.\n'This was one of the things that I pushed strongly for President Biden to include in his supplemental request,' he continued.\nBiden's aid request includes $60 billion to support Ukraine in its war with Russia and $14 billion earmarked for Israel.\nA further $14 billion is allocated to border security, $10 billion to humanitarian aid and $7 billion for the Indo-Pacific region, including to bolster Taiwan.\nBiden addressed the American people last Thursday night from the Oval Office and urged Congress to pass the spending package.\nNew Speaker Mike Johnson unveiled a House bill that would give $14 billion to Israel, taking money from the already-passed Inflation Reduction Act.\nBiden's aid request includes $60 billion to support Ukraine in its war with Russia and $14 billion earmarked for Israel\nDemocrats have pushed back, saying Johnson is 'playing politics' with money desperately needed.\nThe bill is 'clearly designed to divide Congress,' Schumer said Tuesday.\nThe top Democrat is also working to confirm Biden's pick as U.S. ambassador to Israel - which is currently empty.\nJack Lew has received criticism from Republicans who say he is too soft on Iran.\nRepublican Sens. Marco Rubio, Fla., Markwayne Mullin, Okla., Rick Scott, Fla., Steve Daines, Mont., Cynthia Lummis, W.Y., Pete Ricketts, Neb., John Cornyn, Texas, Ron Johnson Wis., and Tommy Tuberville, Ala., also signed onto the letter Tuesday.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Ten GOP senators urge top Democrat Chuck Schumer to REJECT Biden's $9BILLION Gaza humanitarian aid ask because it will be a 'gift' to Hamas murderers", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12693621/Ten-GOP-senators-urge-Democrat-Chuck-Schumer-REJECT-Bidens-9BILLION-Gaza-humanitarian-aid-ask-gift-Hamas-murderers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}