{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:47:07", "date_modify": "None", "date_publish": "2023-10-31 10:42:28", "description": "The top Marine Corps general has been hospitalized after 'falling face-first' when he suffered a heart attack while out jogging.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12692335%2FMarine-Corps-General-Eric-Smith-hospitalized-suffering-heart-attack-jogging.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/10/31/10/77213881-0-image-m-20_1698748923070.jpg", "language": "en", "localpath": null, "maintext": "The Marine Corps commandant and top officer is being treated in a hospital after suffering a heart attack on Sunday night while out jogging.\nGeneral Eric M. Smith, 58, was running close to Marine Barracks Washington when the medical emergency occurred. There has been no update on Smith's condition.\nA spokesperson for the District of Columbia Fire and Emergency Medical Services Department told The New York Times that witnesses saw Smith 'stumble' and then 'fall face-first on the sidewalk.'\nEmergency services responded to the scene, performed chest compressions on Smith, and then rushed him to a local hospital. In its report on Smith's heart attack,\nThe Washington Post reported that it was 'unseasonably warm' in he nation's capital with temperatures up over 80 degrees.\nHours before his collapse, Smith made an appearance at the Marine Corps Marathon in Arlington. He did not participate but was pictured motivating runners from the sidelines. The race began at 7:55am.\nGen Eric Smith, the top Marine Corps general, has been hospitalized after 'falling face-first' when he suffered a heart attack while out jogging\nHours before his collapse, Smith was seen cheering on runners at the annual Marine Corps Marathon\nIn accordance with federal law, Lt. General Karsten Heckl is acting commandant as there is currently no number two under Smith due to Republican Senator Tommy Tuberville holding up promotions due to the Pentagon's policy of allowing staffers to travel for abortions.\nHeckl is the deputy commandant for combat development and integration.\nSmith is a member of the joint chiefs of staff. Prior to his confirmation in September, he had been acting commandant.\nThe Marine Corps Times reported in September that Smith was acting as both the number one and number two commandant.\nHe told the website that his day entailed of waking at 5:30am to read intelligence reports from a secure setup in his home.\n'Nobody should feel bad for me. I make plenty of money, and nobody usually yells at me, so that's good. But it is not a sustainable thing when the last thing you do is flip your computer off at 11:30 at night and you're getting up at 5 o'clock in the morning,' Smith said.\n'I don't mind breaking my own back. It's just, I have to make good decisions,' he added. 'Working on five hours of sleep over periods of time, there will be sloppiness.'\nCNN reports that Tuberville's protests have led to 378 Pentagon nominations being held up.\nGeneral Smith pictured with his wife, Patrisha, in Japan in 2018\nRepublican Senator Tommy Tuberville has blocked appointing Smith's second in command because of the Pentagon's abortion policies\nIn accordance with federal law, Lt. General Karsten Heckl is acting commandant\nSmith, a career infantry officer, has commanded at every level, serving multiple tours in Afghanistan and Iraq, including time in Fallujah and Ramadi during heavy combat in 2004 and 2005 in Operation Iraq Freedom.\nHe later was the senior military adviser to Defense Secretary Ash Carter and in in 2019 took over as the deputy commandant for combat development.\nIn that post, Smith worked with his predecessor General David Berger on a broad campaign to transform the Marine Corps to better be able to fight amphibious wars in the Pacific after years of battling terrorist groups in the Middle East.\nThe plan was lauded by many in the Pentagon and Congress as a critical way for the Marines to prepare for a potential conflict with China.\nSmith and Berger argued that the changes will improve the Marine Corps' ability to fight in contested areas, particularly within striking range of an enemy.\nThat element is critical in the Indo-Pacific, where thousands of U.S. and allied forces are easily within missile — or even rocket — range of both China and North Korea.\nBut some of the moves, including the transfer of Marine tanks to the Army, triggered sharp criticism from a group of retired Marine generals.\nDuring a speech at a naval conference in February, Smith defended the decision as critical to modern warfare against highly capable enemies.\n'I love tanks, I used them in Iraq, I used them in Afghanistan,' Smith said. But he said they are more vulnerable and can't move quickly enough to avoid new, high-tech attacks.\n'When an enemy can hit a tank 90 kilometers away with long-range fire,' he said, 'I can't move them on time to be in a position to do something that I need them to do ... . It's not that they're bad, it's that I can't afford to use them in my current mission.'\nSmith was promoted to four-star general in 2021 and took over as assistant commandant, where he has focused on recruiting, retention and managing the development of Marine forces.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Marine Corps General Eric Smith, 58, is hospitalized 'after suffering a heart attack while out jogging'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12692335/Marine-Corps-General-Eric-Smith-hospitalized-suffering-heart-attack-jogging.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}