{"authors": ["Joe Faretra", "Image", "Cpo Stephen Lehmann Uscg Swns", "Eric Rodriguez Uscg Swns", "Laticia Sims Uscg Swns"], "date_download": "2024-02-05 15:47:09", "date_modify": "None", "date_publish": "2023-10-31 16:14:13", "description": "US Coast Guard crew have offloaded a huge confiscated drugs haul to Florida's Port Everglades with 13 cases of confiscated cocaine and marijuana worth a whopping $448 million", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fus-news%2Fcoast-guard-shows-exactly-what-31326485.json", "image_url": "https://i2-prod.dailystar.co.uk/incoming/article31327220.ece/ALTERNATES/s1200/1_SWNS_DRUGS_MILLIONS_04.jpg", "language": "en", "localpath": null, "maintext": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nSomething went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nThe US Coast Guard crew have unloaded a whopping $448 million worth of seized drugs, nabbed from 13 cases – and here it is in all it's glory.\nThe team from the USCGC James shifted more than 33,200 pounds of cocaine and 12,400 pounds of marijuana to Florida's Port Everglades on Thursday (26 Oct). They were collected over 13 different cases in the international waters of the Eastern Pacific Ocean and Caribbean Sea, thanks to the combined efforts of other cutter vessels and helicopter units.\n\"This offload is about national security,\" said Vice Adm. Kevin Lunday, commander U.S. Coast Guard Atlantic Area. He added: \"It represents one part of a very large and strong interagency team that works closely with our allies and international partners to interdict maritime smuggling of dangerous and illegal drugs into the United States.\"\nREAD MORE: 'Street Demon' biker weaves between traffic on busy road before insane 140mph crash\nRead more USA news by clicking here.\nThe Coast Guard explained that numerous U.S. agencies from the Departments of Defense, Justice and Homeland Security joined forces in this effort to combat transnational organised crime.\n(Image: PO3 Eric Rodriguez/USCG/SWNS)\nThey said: \"The Coast Guard, Navy, Customs and Border Protection, Federal Bureau of Investigation, Drug Enforcement Administration, and Immigration and Customs Enforcement, along with allied militaries and international partner agencies, play a role in counter-drug operations.\n\"Our success hinges on our people. For the past 113 days, the women and men of James worked around the clock in support of the counter-narcotics mission,\" said Capt. Donald Terkanian, commanding officer of James.\n(Image: PO2 Laticia Sims/USCG/SWNS)\nTo stay up to date with all the latest news, make sure you sign up to one of our newsletters here .\nHe added: \"That being said, we cannot do this mission alone. We appreciate the immense support and dedication from our interagency and international partners that join us here today.\"\nA USCG statement added: \"The fight against drug cartels in the Eastern Pacific Ocean and the Caribbean Sea requires a unity of effort in all phases, from detection and monitoring to interdiction and apprehension, through criminal prosecutions by international partners and U.S. Attorneys' Offices in districts across the nation.\"\nFollow the Daily Star US on Facebook All the news, entertainment, sport and fun stuff you love about the Daily Star, brought to you by our American team. Give the Daily Star US Facebook page a follow to make sure you're not missing out.\n* This article was crafted with the help of an AI tool, which speeds up Daily Star's editorial research. An editor reviewed this content before it was published. You can report any errors to starletters@dailystar.co.uk", "source_domain": "www.dailystar.co.uk", "text": null, "title": "US Coast Guard shows us exactly what $448m worth of cocaine and marijuana looks like", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/us-news/coast-guard-shows-exactly-what-31326485"}