{"authors": [], "date_download": "2024-02-05 15:47:11", "date_modify": "None", "date_publish": "2023-10-31 05:00:46", "description": "The United Nations special envoy for Syria is warning that the Israel-Hamas war is spilling into the neighboring country", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fsyria-ap-israel-hamas-iran-b2438825.html.json", "image_url": "https://static.independent.co.uk/2023/10/31/05/Israel_Palestinians_UN_Syria_30951.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Israel-Hamas war is spilling into Syria, fueled by growing instability, violence and a lack of progress toward a political solution to its 12-year conflict, the United Nations special envoy for the country said Monday.\nGeir Pedersen told the Security Council that, on top of violence from the Syrian conflict, the Syrian people now face “a terrifying prospect of a potential wider escalation” following Hamas’ Oct. 7 attacks on Israel and the ongoing retaliatory military action.\n“Spillover into Syria is not just a risk; it has already begun,” the U.N. envoy for Syria said.\nPedersen pointed to airstrikes attributed to Israel hitting Syria's airports in Aleppo and Damascus several times, and retaliation by the United States against what it said were multiple attacks on its forces “by groups that it claims are backed by Iran, including on Syrian territory.”\nWith the region “at its most dangerous and tense,” he said, “fuel is being added to a tinderbox that was already beginning to ignite” in Syria, which was seeing a surge in violence even before Oct. 7.\nPedersen said the number of Syrians killed, injured and displaced is at its highest since 2020, citing a significant intensification of attacks in government-controlled areas, including an unclaimed attack on a graduation ceremony at a military academy in Homs, which the government attributes to terrorist organizations.\nHe also reported government rocket attacks throughout October on Hayat Tahrir al Sham — the insurgent group that rules much of rebel-held northwest Syria — as well as a major escalation of Turkish strikes in the northeast following an attack on Turkish government facilities in Ankara. The Turkish strikes have killed dozens, damaged health facilities, schools and camps, and displaced more than 120,000 civilians, he said.\nU.S. Ambassador Linda Thomas-Greenfield accused “terrorist groups,” some backed by Syria and Iran, of threating to expand the Gaza conflict “by using Syrian territory to plot and launch attacks against Israel.” She also accused Syria of allowing Iran and terrorist groups to use its international airports for military purposes.\n“We call on the regime to curb the activities of Iran-backed militias in Syria, stop the flow of foreign arms and fighters through its territory, and cease escalatory actions in the Golan Heights,” she said.\n“The United States has warned all actors not to take advantage of the situation in Gaza to widen or deepen the conflict,” Thomas-Greenfield said. “And we’ve made clear that we will respond to attacks on our own personnel and facilities in Syria or against U.S. interests, and where appropriate exercise our right to self-defense forcefully, proportionately and in a manner that minimizes civilian harm.”\nAmbassador Vassily Nebenzia of Russia, Syria’s closest ally, accused Israeli forces of striking sites in Syria, including civilian airports, and called U.S. attacks in the country “illegitimate actions” and “a gross violation of Syria’s sovereignty.” He also claimed U.S. economic interests and involvement “in contraband with Syrian grain and oil” have prevailed over political interests.\nNebenzia said there is a sharp increase in tensions around the Israel-Hamas conflict and attacks like the ones by the U.S. might provoke spillover to the entire region. “This must not be deemed acceptable,\" he said.\nIran’s U.N. Ambassador Amir Iravani refuted all U.S. claims, saying his country is in Syria at Damascus' request to fight terrorism. He accused Washington of attempting “to shift the blame from the culprit to the victim.”\nIravani told the council the United States’ “unwavering support” for Israel “has rendered it part of the problem.” He said the U.S. and some Western countries were attempting to give Israel an unjust right to self-defense while ignoring the Palestinian people’s right to self-determination, and equating the Palestinian resistance with terrorism.\n“Iran’s primary objective is to avoid any escalation in the region,” the ambassador stressed, which is why it has endorsed international calls for an immediate cease-fire and humanitarian aid for people in Gaza.\nHowever, Iravani said Iran will respond to any threat, attack or aggression endangering its security.", "source_domain": "www.independent.co.uk", "text": null, "title": "A UN envoy says the Israel-Hamas war is spilling into Syria, adding to growing instability there", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/syria-ap-israel-hamas-iran-b2438825.html"}