{"authors": ["Pratiti Nath"], "date_download": "2024-02-05 15:47:11", "date_modify": "None", "date_publish": "2023-10-31 22:00:26", "description": "Israel prepared a 10-page concept paper to systematically permanently displace Gaza civilians to Egypt's Sinai peninsula within a week after the Hamas attack on Israel which could harm Egypt-Israel", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fisrael-talks-eu-displace-gaza-civilians-egypt-amidst-us-attempts-fund-it-1721159.json", "image_url": "https://d.ibtimes.co.uk/en/full/1720574/palestinian-civil-defence-members-carry-body-person-killed-during-israeli-bombardment-khan.jpg", "language": "en", "localpath": null, "maintext": "As the Israel-Hamas war intensifies in the Gaza Strip, Israel's Intelligence Ministry has secretly launched a concept paper that seeks to transfer civilians along the Gaza Strip to Sinai in Egypt.\nThis comes at a time when the Gaza Ministry of Health has published a paper listing the names of those killed in Israeli attacks. They have alleged that over 8300 Palestinians including 3000 children have been killed since Israel declared war on Hamas.\nThe Israeli Prime Minister's office has downplayed the concept paper as hypothetical. However, Prime Minister Benjamin Netanyahu has been reportedly lobbying with EU governments to pressure Egypt into taking Palestinian refugees.\nAs per the concept paper, Israel has put forward a wartime proposal to transfer 2.3 million Palestinian people from the Gaza Strip to the Sinai Peninsula in Egypt which Palestine has condemned. The move has worsened the tensions between Egypt and Palestine.\nEgypt fears that Israel wants to portray Gaza as Egypt's problem and revive Palestinian memories of the great trauma of uprooting thousands of people in 1948 when Israel was created.\nPalestinian President Mahmoud Abbas' spokesman Nabil Abu Rudeineh said Palestine won't let a repeat of 1948 happen again.\n\"We are against transfer to any place, in any form, and we consider it a red line that we will not allow to be crossed,\" said Rudeineh.\nPalestine said that mass displacement is like \"declaring a new war\".\nIsrael created the concept paper on October 13, six days after the Hamas attack. Its main objective is to preserve the security of Israel, revealed the local news website Sicha Mekomit where it was first published.\nThe Intelligence Ministry of Israel has offered three alternatives for the current humanitarian crisis unfolding along the Gaza Strip due to Israel declaring war on Hamas. The alternatives offered by Israel are \"to effect a significant change in the civilian reality in the Gaza Strip in light of the Hamas crimes that led to the Sword of Iron War\". Notably, the document used the Israel Defense Forces or IDF label \"the Sword of Iron War\".\nThis comes at a time when the IDF reportedly killed aid workers trying to help the Gaza civilians\nAs per the concept paper, the Netanyahu government is planning to relocate the Gaza civilians to tent cities in northern Sinai and then build an undefined corridor for their displacement and make permanent cities for them in Sinai. Israel will also create a security zone preventing the return of the displaced Palestinians.\nHowever, the paper doesn't underline what Israel plans to do after the Palestinians are displaced. It only says it's important for Israel's security.\nMeanwhile, Egypt has made it clear that it doesn't want to take another wave of Palestinian refugees after the latest war with Palestine. The country had feared this since it ruled Gaza between 1948 and 1967 when Israel captured it.\nThe Gaza civilians are descendants of Palestinian refugees from that time.\nDisplacing the Gaza civilians is unrealistic and a threat to the Sinai\nThe President of Egypt Abdel Fattah El-Sissi termed Israel's plan to displace Gaza civilians as a military threat to Sinai as it can bring militants to the region along with eliminating the Palestinian nationalist cause. Egypt reminded Israel of the 1979 peace treaty and urged them to house the Gaza civilians in the Negev Desert, neighbouring the Gaza Strip as long as the military operation continues.\nMeanwhile, experts like Yoel Guzansky from the Institute for National Security Studies in Tel Aviv underlined that Israel's plan to displace the Palestinians could worsen Israel-Egypt bilateral relations.\n\"Egypt is a valuable partner that cooperates behind the scenes with Israel. If it is seen as overtly assisting an Israeli plan like this, especially involving the Palestinians, it could be devastating to its stability,\" said Guzansky.\nThe Israeli concept paper goes on to explain that Palestinian refugees' last stop might not be Egypt as it mentions Turkey, Saudi Arabia, the UAE and Qatar.\nThis comes at a time when UK Defence Secretary Grant Shapps visited the Middle East and urged the Gulf nations to act as mediators in the Israel-Hamas war.\nThese countries could either take in the Gaza civilians or offer them financial support. The document even suggests Canada as a possible resettlement target because of its lenient immigration policy.\nExperts say that Israel's proposal is complicated in terms of international legitimacy but it could lead to fewer civilian casualties.\nMeanwhile, the Israeli Prime Minister's Office said: \"The issue of the 'day after' has not been discussed in any official forum in Israel, which is focused at this time on destroying the governing and military capabilities of Hamas\"\nHowever, the concept paper by Israel rejected both the options of reinstating the West Bank-based Palestinian Authority or reinstatement of the Palestinian Authority, which was ejected from Gaza after a weeklong 2007 war with Hamas.\nAccording to the concept paper, the first option is a security threat for Israel as it can't deter Hamas attacks on Israel while the second one would mean \"an unprecedented victory of the Palestinian national movement, a victory that will claim the lives of thousands of Israeli civilians and soldiers, and does not safeguard Israel's security\"\nPalestinian Prime Minister Mohammad Shtayyeh has made it clear that Palestine will take over the Gaza Strip only if the creation of a Palestinian state is promised.\nThe Netanyahu government secretly discussed the issue with European government officials last week where Austria and the Czech Republic relayed the idea while the UK, Germany and France rejected the proposal calling it \"unrealistic\".\nEgypt has hardened its stance on Palestinian refugees in the absence of a public promise from Israel that they would be allowed to return.\nPressure on the US to stop funding Israel's displacement plan with aid\nMeanwhile, pressure is mounting on the US to take action against Israel's proposal to displace the Gaza civilians. The Democracy for the Arab World Now (DAWN) has urged the US Congress to \"reject a supplementary funding bill that proposes funding humanitarian aid to Palestinians who have been displaced from Gaza to neighbouring countries\".\nSpeaking about the matter, the DAWN Executive Director Sarah Leah Whitson said: \"The Biden administration isn't just giving a green light for ethnic cleansing—it's bankrolling it.\"\n\"Gaslighting Americans into facilitating long-held Israeli plans to depopulate Gaza under the cover of 'humanitarian aid' is a cruel and grotesque hoax,\" Whitson added.\nEarlier on October 20, the White House requested the US Congress to include logistical, infrastructural and material support to house displaced Palestinian refugees from the Gaza Strip and the adjoining areas. This funding is part of supplemental funding for the current fiscal year of the US government.\nThe directive states that \"these resources would support displaced and conflict-affected civilians, including Palestinian refugees in Gaza and the West Bank, and to [sic] address potential needs of Gazans fleeing to neighbouring countries\".\nIt would include food and nonfood items, healthcare, emergency shelter support, water and sanitation assistance, and emergency protection. \"Potential critical humanitarian infrastructure costs needed for the refugee population to provide access to basic, life-sustaining support\" are also part of the funding.\nThe US government underlined in the request that the present humanitarian crisis in Gaza could result in displacement across the region which in turn can trigger higher humanitarian needs, and the funds would fulfil the evolving requirements in Gaza and outside of it.\nPro-Palestinian activists like the DAWN's advocacy director Raed Jarrar, spoke against this US funding when he said: \"The best way to protect Palestinian civilians from the wrath of war is to announce and enforce a ceasefire.\"\n\"Rather than pushing Palestinians to Egypt, Israel should allow Palestinian civilians to cross the apartheid fence into Israel. Maybe Palestinians can set up tent cities in the same towns and villages they were displaced from during the first Nakba 75 years ago,\" Jarrar added.\nSarah Lee Whitson drew attention to Article 8 of the Rome Statute of the International Criminal Court which designates the \"Deportation or forcible transfer of population\" as a war crime and Israel is doing the same.\nWhitson explained how the Netanyahu government is trying to forcefully and permanently displace the Gaza civilians \"both by word and by deed\".\n\"Israeli officials are pursuing a broader strategy to permanently remove Palestinians from their native lands, and counting on the US to pay for it,\" said Whitson.\n\"Congress should vote against any aid package that could support these acts, which amount to violations of human rights and grave breaches of the laws of war,\" Whitson further added.\nAccording to the United Nations Office for the Coordination of Humanitarian Affairs (OCHA), Israeli attacks have destroyed 42 per cent of housing units along the Gaza Strip, making Palestinians live without food, water and shelter.\nThe United Nations Relief and Works Agency or UNRWA revealed that the Hamas attack on Israel and subsequent declaration of war by Israel has displaced 613,000 Palestinians so far – which is 12 times the number the Palestinian refugee camps are designed to handle. The entire 2.3 million population along the Gaza Strip are at risk of being displaced.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Israel In Talks With EU To Displace Gaza Civilians To Egypt Amidst US Attempts To Fund It", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/israel-talks-eu-displace-gaza-civilians-egypt-amidst-us-attempts-fund-it-1721159"}