{"authors": ["Helena Smith"], "date_download": "2024-02-05 15:16:55", "date_modify": "None", "date_publish": "2024-01-20 05:00:50", "description": "President accused of allowing country to become a target because of ‘complicity in bloodshed of Gaza’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F20%2Fcyprus-faces-backlash-over-use-of-british-bases-to-bomb-houthis.json", "image_url": "https://i.guim.co.uk/img/media/885dd41a4e444c6c01dc92faa1f4ac039aa37e2c/0_167_4997_2998/master/4997.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f9d16f427513f4eeaa3a597602d5d7b", "language": "en", "localpath": null, "maintext": "The Cyprus government is facing growing criticism over British military bases on the island being used by UK and US forces to stage airstrikes on Iran-backed Houthi rebels in Yemen.\nPresident Nicos Christodoulides has been accused by activists of turning a blind eye to the risks the EU’s most easterly state might confront if the strategic facilities on the island continue to be deployed in military operations.\nThe Guardian has learned that both the US ambassador and British high commissioner briefed the Cypriot president of imminent military action in Yemen before the first round of airstrikes last week.\n“There are ever more war planes taking off every day,” Tassos Costeas, a prominent Greek Cypriot peace activist, told the Guardian. “The dangers of Cyprus becoming a target are evident.”\nThe two installations, retained by the British after the country won independence in 1960 to end decades of colonial rule, operate as sovereign overseas territories beyond the reach of the republic. Both extend across 3% of Cyprus’s land mass, or 98 sq miles.\nAlthough never confirmed, EU diplomats in Nicosia, the island’s war-split capital, say US forces are present on the military installation. “If you look over the fence at Akrotiri you’ll see US military surveillance and other aircraft,” one said.\nOn Tuesday, the Cyprus government’s spokesperson, Konstantinos Letymbiotis, emphasised the eastern Mediterranean island was not involved in any military operations, intimating that under the bases’ treaty of establishment, the UK was not obliged to inform Cypriot authorities about activity in the facilities. “The government is in constant communication with the UK within the framework established in relation to the bases’ use,” he said.\nProtests mounted last week after RAF Akrotiri was used as a launch pad for Typhoon fighter jets conducting targeted airstrikes on Houthi strongholds in Yemen in retaliation for attacks on commercial shipping in the Red Sea. The pro-Palestinian militia has justified its assaults – with one of its missiles recently hitting a Greek-owned cargo ship – by saying it was acting in response to Israel’s ongoing offensive.\nIn an apparent attempt to calm nerves in Cyprus, the British defence minister, Grant Shapps, was on the island on Friday meeting the president. “We want to do everything possible to ensure the security of Cyprus, which is in everyone’s best interests. We appreciate that you are in a difficult neighbourhood and want to do everything possible to make it easier,” he said. The Houthis, he claimed, “do not pose an immediate threat to Cyprus”.\nThe US and UK strikes have exacerbated concerns of the Israel-Gaza war becoming a wider regional conflagration. Washington and London have vowed to continue the airstrikes if necessary.\nCypriot activists say they are deeply concerned the British bases may also be used by the US and UK to send military aid to Israel, a claim neither country has confirmed.\nAt Sunday’s protest, demonstrators chanted “out with the bases of death” outside the entrance of RAF Akrotiri, close to the coastal city of Limassol in the island’s south.\n“Put simply, we don’t want our country to be used in a war that has left more than 24,000 dead, the vast majority women and children,” said Costeas who presides over the Cyprus Peace Council, a bi-communal NGO that helped organise the rally. “We know what conflict means. Fifty years ago Cyprus was split by war.”\nSince the start of the Gaza war following the 7 October incursion by Hamas militants that left about 1,200 people dead, witnesses have spoken of a sharp increase in the number of military transport planes making the 40-minute journey from Akrotiri to Tel Aviv.\nWithin weeks of the Hamas attack, Israel’s Haaretz newspaper reported that “more than 40 US transport aircraft, 20 British transport aircraft and seven heavy transport helicopters [had] arrived at the British Akrotiri base on the island. They carried equipment, arms and forces.”\nThe UK’s defence ministry has denied it is using the facilities – which also serve a surveillance-gathering role as a station for signals intelligence – to help Israel with “lethal cargo”. Instead, a defence ministry spokesperson sought at the weekend to highlight the EU member state’s humanitarian role in the region.\n“British Forces Cyprus continue to support the delivery of humanitarian aid to Gaza,” the official said.\nActivists in Cyprus, however, believe US aircraft have sent weaponry to Israel via Cyprus from depots at its bases around Europe.\nAsked about the claims, a US department of defense spokesperson said: “It is our policy to not discuss specific details of military logistics, to include aircraft movements for security reasons. All US military activities are fully compliant with international law and are coordinated closely with our allies.”\nCosteas, the peace activist, claimed there was evidence that spy planes were also operating out of Akrotiri. London and Washington have denied direct involvement in Israel’s war but said they have launched drones from Cyprus to Gaza to help search for hostages.\nPresident Christodoulides has been vocal in his desire to use the island’s proximity to Gaza to establish a maritime aid corridor between the port of Larnaca and the besieged coastal strip – a plan that, as yet, has not come to fruition, although a Royal Navy landing ship delivered 90 tons of air-freighted supplies bound for the Palestinian territory, via Egypt, last month.\nBoth Greek and Turkish Cypriot peace activists have joined forces to denounce the role of the bases, with the main leftist AKEL party urging the government to do more to ensure the island “has no complicity in the bloodshed of Gaza”.\n“The government of Cyprus should have done more to stop the bases being used in this way,” said Vera Polycarpou, who heads AKEL’s international relations. “There have been protests against the bases’ presence here since 1964. It really is a joke, a sick joke, to hear that aid, and not weapons, are being carried by planes out of Akrotiri when all the evidence is to the contrary.”", "source_domain": "www.theguardian.com", "text": null, "title": "Cyprus faces backlash over use of British bases to bomb Houthis", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/20/cyprus-faces-backlash-over-use-of-british-bases-to-bomb-houthis"}