{"authors": ["Helen Sullivan", "Léonie Chao-Fong", "Gloria Oladipo", "Martin Belam", "Helen Davidson"], "date_download": "2024-02-05 15:47:12", "date_modify": "None", "date_publish": "2023-10-31 03:46:24", "description": "This blog is now closed.See all our Israel-Hamas war coverage", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Foct%2F30%2Fisrael-hamas-war-live-updates-aid-trucks-enter-gaza-strikes-casualties-israel-targets-hit-syria-lebanon.json", "image_url": "https://i.guim.co.uk/img/media/65a24c924857bf94d4a46cf06de6aea383f64889/0_0_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=55ba096d6c05bd8ec224ed78f31cf26d", "language": "en", "localpath": null, "maintext": "From 31 Oct 2023 02.45 CET Hamas claims it is 'firing machine guns and anti-tank missiles' towards Israeli forces in Gaza Reuters: Hamas said its militants fired machine guns and anti-tank missiles toward Israeli forces in north and south Gaza early on Tuesday as Israel’s tanks and infantry attacked the enclave’s main city, raising concerns about the plight of Palestinian civilians.\nIsrael has expanded ground operations in Gaza as it seeks to punish Hamas for a deadly gun rampage three weeks ago that Israeli authorities say killed over 1,400 people.\nWitnesses said Israeli forces targeted Gaza’s main north-south road on Monday and attacked Gaza City from two directions.\nThe al-Qassam brigades, the armed wing of Gaza’s ruling Hamas movement, said militants clashed early on Tuesday with Israeli forces “invading the southern Gaza axis, (including) with machine guns, and targeted four vehicles with al-Yassin 105 missiles,” referring to locally produced anti-tank missiles.\nThe militants also targeted two Israeli tanks and bulldozers in northwest Gaza with the missiles, al-Qassam said.\nNeither Reuters nor the Guardian were able to confirm the reports of fighting. Israel’s military had no immediate comment.\n31 Oct 2023 04.14 CET In Gaza, where communications have been all but impossible in recent days, the reporter Hazem Balousha tells Michael Safi on Today in Focus that the intensifying assault is making everywhere in Gaza unsafe. As he speaks, the boom of aerial attacks plays out behind him and at one point he is able to catch a leaflet dropped by the Israeli Defence Forces warning him and others to evacuate the area. In Jerusalem, the Guardian’s Middle East correspondent, Bethan McKernan, reports on the latest Israeli offensive and how the latest actions are being explained to Israelis and the wider world: ‘We’re totally isolated’: inside Gaza as Israel’s war intensifies – podcast Read more\n31 Oct 2023 03.54 CET AP: A watchdog group advocating for press freedom said that the strikes that hit a group of journalists in southern Lebanon earlier this month, killing one, were targeted at the area, rather than accidental, and that the journalists were clearly identified as press. Reporters Without Borders, or RSF, published preliminary conclusions Sunday in an ongoing investigation, based on video evidence and witness testimonies, into two strikes that killed Reuters videographer Issam Abdallah and wounded six journalists from Reuters, AFP and Al Jazeera as they were covering clashes on the southern Lebanese border on 13 October. The head of RSF’s Middle East desk, Jonathan Dagher, said there is not enough evidence at this stage to say the group was targeted specifically because they were journalists. However, the report noted that the journalists wore helmets and vests marked “press,” as was the vehicle, and cited the surviving journalists as saying that they had been standing in clear view for an hour and saw an Israeli Apache helicopter flying over them before the strikes. The first strike killed Abdallah, and the second hit a vehicle belonging to an Al Jazeera team, injuring journalists standing next to it. Both came from the direction of the Israeli border, the report said, but it did not explicitly name Israel as being responsible. “What we can prove with facts, with evidence for the moment, is that the location where the journalists were standing was explicitly targeted...and they were clearly identifiable as journalists,” Dagher told The Associated Press Monday. “It shows that the killing of Issam Abdallah was not an accident.”\n31 Oct 2023 03.27 CET Japan has imposed a fresh set of sanctions on individuals and a company connected to the Gaza-based militant group Hamas, according to a statement released by the Japanese foreign ministry on Tuesday.\nThe sanctions consist of freezing the assets of individuals and a company that have helped fund Hamas, and is in line with new sanctions announced by the United States government earlier this month.\nIt is the first set of sanctions Japan has imposed on Hamas since 7 October.\nIndividuals including Hamas operatives Muhammad Ahmad ‘Abd Al-Dayim Nasrallah and Ayman Nofal were newly added to the list of people and organisations deemed as terrorists by Japan.\n31 Oct 2023 02.45 CET Hamas claims it is 'firing machine guns and anti-tank missiles' towards Israeli forces in Gaza Reuters: Hamas said its militants fired machine guns and anti-tank missiles toward Israeli forces in north and south Gaza early on Tuesday as Israel’s tanks and infantry attacked the enclave’s main city, raising concerns about the plight of Palestinian civilians.\nIsrael has expanded ground operations in Gaza as it seeks to punish Hamas for a deadly gun rampage three weeks ago that Israeli authorities say killed over 1,400 people.\nWitnesses said Israeli forces targeted Gaza’s main north-south road on Monday and attacked Gaza City from two directions.\nThe al-Qassam brigades, the armed wing of Gaza’s ruling Hamas movement, said militants clashed early on Tuesday with Israeli forces “invading the southern Gaza axis, (including) with machine guns, and targeted four vehicles with al-Yassin 105 missiles,” referring to locally produced anti-tank missiles.\nThe militants also targeted two Israeli tanks and bulldozers in northwest Gaza with the missiles, al-Qassam said.\nNeither Reuters nor the Guardian were able to confirm the reports of fighting. Israel’s military had no immediate comment.\n31 Oct 2023 02.28 CET US ambassador to UN repeats calls for humanitarian pause US Ambassador Linda Thomas-Greenfield has urged the divided UN Security Council to come together, saying “the humanitarian crisis in Gaza is growing more dire by the day.” Stressing that all innocent civilians must be protected, she said the council must call “for the immediate and unconditional release of all hostages, address the immense humanitarian needs of Palestinian civilians in Gaza, affirm Israel’s right to defend itself from terrorism, and remind all actors that international humanitarian law must be respected.” She reiterated President Joe Biden’s call for humanitarian pauses to get hostages out, allow aid in, and safe passage for civilians. In a sign of increasing US concern at the escalating Palestinian death toll, Thomas-Greenfield told the council Biden reiterated to Israeli Prime Minister Benjamin Netanyahu on Sunday “that while Israel has the right and responsibility to defend its citizens from terrorism, it must do so in a manner consistent with international humanitarian law.” “The fact that Hamas operates within and under the cover of civilians areas creates an added burden for Israel, but it does not lessen its responsibility to distinguish between terrorists and innocent civilians,” she stressed.\n31 Oct 2023 02.22 CET US House Republicans plan to give Israel $14.3bn by cutting IRS funds Republicans in the US House of Representatives on Monday introduced a plan to provide $14.3bn in aid to Israel by cutting funding for the Internal Revenue Service, setting up a showdown with Democrats who control the Senate. In one of the first major policy actions under new House speaker Mike Johnson, House Republicans unveiled a standalone supplemental spending bill only for Israel, despite Joe Biden’s request for a $106bn package that would include aid for Israel, Ukraine and border security. Johnson, who voted against aid for Ukraine before he was elected House speaker last week, had said he wanted aid to Israel and Ukraine to be handled separately. He has said he wants more accountability for money that has been sent to the Kyiv government as it fights Russian invaders. “Israel is a separate matter,” Johnson said in an interview on Fox News last week, describing his desire to “bifurcate” the Ukraine and Israel funding issues. Johnson has said bolstering support for Israel should top the US national security agenda in the aftermath of the 7 October attack by Hamas that killed more than 1,400 people and saw more than 200 others taken hostage. Democrats accused Republicans of stalling Congress’ ability to help Israel by introducing a partisan bill. US House Republicans plan to give Israel $14.3bn by cutting IRS funds Read more\n31 Oct 2023 01.57 CET Here are some recent images out of Gaza, where nearly 3,200 children have been killed in three weeks: View image in fullscreen A Palestinian man mourns over the bodies of loved ones killed in Israeli strikes, in Rafah in the southern Gaza Strip, 30 October 2023. Photograph: Reuters View image in fullscreen A Palestinian man holds his injured daughter at the Najjar hospital following an Israeli air strike on a home in Rafah, in the southern Gaza Strip, on Monday, 30 October 2023. Photograph: Ismael Mohamad/UPI/Shutterstock View image in fullscreen Flames and smoke rise in Tel al-Hawa neighborhood as Israeli attacks continue on the 24th day in Gaza City, Gaza on 30 October 2023. Photograph: Anadolu Agency/Anadolu/Getty Images\n31 Oct 2023 01.46 CET AAP: Australian Prime Minister Anthony Albanese says the government is working with international counterparts to provide humanitarian access to Gaza and establish a safe corridor at the Rafah crossing into Egypt to allow citizens to get to safety. Asked whether he supported a statement from six former prime ministers who called for an end to religious hatred amid rising tensions over Israel’s response against Hamas in Gaza, Mr Albanese said his position had been clear. View image in fullscreen Australian Prime Minister Anthony Albanese. Photograph: Brent Lewin/AAP “It is important that we recognise that the attacks from Hamas on Israel are worthy of absolute condemnation in an unequivocal way,” Mr Albanese told reporters in Bundaberg on Tuesday. “It’s also important to recognise that Israel has a right to defend itself, but how it does that matters. “We need to make sure, as well, that every civilian life is valued, whether it be Israeli or Palestinian - every innocent loss of life is a tragedy.”\n31 Oct 2023 01.02 CET Here is our video report after Israel forces announced the liberation of a hostage in Gaza. Ori Megidish, an Israel Defence Forces soldier, was freed during an escalating offensive in Gaza, the IDF said on Monday night. It said she had undergone medical checks and was doing well: 00:01:27 Hostage rescued in Gaza as Hamas issues video of others still in captivity – video\n30 Oct 2023 00.53 CET Aid system 'geared to fail' says UN More now from Philippe Lazzarini. “The system in place to allow aid into Gaza is geared to fail unless there is political will to make the flow of supplies meaningful, matching the unprecedented humanitarian needs,” Lazzarini said, calling for the Security Council to demand an immediate humanitarian ceasefire. According to UN spokesman Stephane Dujarric, 33 trucks carrying water, food and medical supplies entered Gaza through Rafah on Sunday. Prior to the war, some 500 trucks carrying aid and other goods entered Gaza every day.\n30 Oct 2023 00.51 CET In this opinion piece, addiction and trauma specialist Diane Young gives some advice for how to stay informed about this conflict while looking after your mental health. The ongoing conflict in Israel and Gaza has once again brought to the forefront the grim realities of war and its impact on innocent civilians. As we’re flooded with images and stories of destruction, suffering, and loss, it’s natural to feel a deep sense of sadness, empathy, helplessness and, of course, anger and dismay at what we are witnessing. Many are finding it increasingly challenging to balance their desire to stay informed with the emotional toll this crisis can take. Unfortunately, this can lead to secondary trauma. Secondary trauma, also known as vicarious trauma, is a phenomenon where individuals experience symptoms of trauma as a result of witnessing or hearing about traumatic events happening to others, even if they aren’t directly involved. In the context of the Israel-Gaza crisis, secondary trauma can manifest as feelings of grief and extreme sadness, anxiety and depression, helplessness, and even physical symptoms like headaches or stomach aches. For those trying to stay informed, the distressing images and videos can take a toll on their mental and emotional wellbeing. The line between being an informed and empathic global citizen and subjecting oneself to secondary trauma can be quite thin, and many of us find it difficult to turn away from the images flashing on our screens. We are in a state of disbelief. So, how can you navigate this difficult terrain while staying informed without succumbing to secondary or vicarious trauma? Here are some strategies: Distressing images and videos can take a toll on our mental health. How can we stay informed without being traumatised? | Diane Young Read more\n30 Oct 2023 00.27 CET Patrick Wintour Lazzarini added that there is no place is safe in Gaza, and warned that a further breakdown of civil order in the territory would make it “extremely difficult if not impossible” to deliver more aid. “Most of the people of Gaza felt abandoned. They feel the world is equating all of them to Hamas. This is dangerous – an entire population is being dehumanised. The atrocities of Hamas do not absolve the state of Israel from its obligations under international humanitarian law. Every war has rules and this one is no exception,” he said.\nUpdated at 00.57 CET\n30 Oct 2023 00.16 CET 64 UNRWA staff among the thousands of people killed in Gaza Patrick Wintour Philippe Lazzarini, the commissioner general for the UN relief and works agency (UNRWA), has accused Israel of “collective punishment” of the people of Gaza, and of forcing their displacement from the north of the territory to the south – where they are still not safe. More than 8,000 Palestinians have now been killed in Israel’s attack, who Lazzarini said included 64 UNRWA staff. He said that a UN worker named Samir, as well Samir’s wife and eight children, were killed just hours before the meeting. The Swiss-Italian official said: My UNRWA colleagues are the only glimmer of hope for the entire Gaza Strip … but they are running out of fuel, water, food and medicine and will soon be unable to operate Entire population of Gaza becoming ‘dehumanised’ says UN commissioner Read more\nUpdated at 02.20 CET\n30 Oct 2023 00.06 CET Entire population of Gaza becoming ‘dehumanised’ says UN commissioner Patrick Wintour The entire population of Gaza is becoming “dehumanised” the commissioner general for the main UN agency in Palestine has told the UN security council, adding that a ceasefire has become a matter of life and death for millions. Philippe Lazzarini, the commissioner general for the UN relief and works agency (UNRWA) was one of three speakers to starkly describe the scale of the damage being inflicted on Gaza, as UN agencies piled pressure on the security council to set aside its divisions and back some form of immediate humanitarian ceasefire. The speakers detailed a breakdown in civil order, the loss of clean water and a death rate of children that matches the total number of children killed in conflict in the last four years. The debate called by the United Arab Emirates was intended to build on the momentum created by Friday’s vote by the UN general assembly calling for a humanitarian truce, a vote seen as a way of shaming the superpowers to abandon their arguments for not backing a form of ceasefire. Four previous draft UN security council resolutions on the crisis have been vetoed either by Russia or the US. Efforts are now being made by the 10 elected members of the security council – including Brazil, the current security council president – to frame a resolution that the five permanent members would feel forced to adopt.\nUpdated at 00.56 CET\n30 Oct 2023 23.58 CET Israel’s expansion of its ground operations in Gaza has complicated US efforts to secure the release of hostages being held in the Palestinian territory, according to a report. A senior US official told CNN on Monday that they believed the prospects of getting hostages out could be described as “50/50”. “The parameters are all there,” the official said about a potential deal, but efforts to negotiate with Hamas have been slow, they said. A spokesperson for Qatar’s foreign affairs ministry told the outlet that Israel’s escalation on the ground is making the situation “considerably more difficult”. Ongoing talks involving Israel, Qatar, Egypt, the US and Hamas have centered on freeing hostages in exchange for prisoners being held by Israel, according to a source. They have also included getting Hamas to open the Rafah gates for dual nationals to get out of Gaza, they said.\nUpdated at 00.40 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Hamas reports clashes with IDF - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/oct/30/israel-hamas-war-live-updates-aid-trucks-enter-gaza-strikes-casualties-israel-targets-hit-syria-lebanon"}