{"authors": [], "date_download": "2024-02-05 15:47:14", "date_modify": "None", "date_publish": "2023-10-31 17:36:19", "description": "Five hostages of Hamas are free, offering some hope to the families of more than 200 others snatched in southern Israel during the militants' deadly rampage on Oct. 7", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-hamas-israel-israelis-family-b2439253.html.json", "image_url": "https://static.independent.co.uk/2023/10/20/22/CORRECTION_Israel_Palestinians_29646.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFive hostages of Hamas are free, offering some hope to the families of more than 200 others snatched in southern Israel during the militants’ deadly rampage on Oct. 7.\nBut the families of those still in captivity have questions, such as why progress has been so slow, why some and not others are being released and whether Israel's punishing bombardment of the Gaza Strip puts their loved ones in danger.\nIsrael on Monday announced its first hostage rescue — that of army Pvt. Ori Megidish. Hamas had earlier released Americans Judith Raanan, 59, and her daughter, Natalie, 18. Also let go were Yocheved Lifshitz, 85, along with Nurit Cooper, 79. Their husbands remain in captivity.\nHamas has said it would let the others go in return for thousands of Palestinian prisoners held by Israel, which has dismissed the offer.\nHere are stories of some of the more than 200 still held in captivity.\nBIBAS FAMILY\nLARNACA, Cyprus — Ofri Bibas couldn’t bring herself to tell her brother, Yarden, she loved him when his home came under attack, fearing that might signal some kind of irreversible finality, she said.\nYarden Bibas, his wife, Shiri, and their sons, 4-year-old Ariel and 9-month-old Kfir, were snatched from their home in the Nir-Oz Kibbutz during the Oct. 7 Hamas onslaught.\nHer brother initially believed the volley of rocket fire was “just another bombing like we’re used to,” said Ofri Bibas, who lives elsewhere in Israel.\nBut he soon realized it was “something much bigger and much worse,\" she said, speaking earlier this month at a rally in support of Israel in Larnaca, Cyprus, that she and other relatives of the hostages attended to raise attention to their loved ones' plights.\nOfri Bibas said she communicated with her brother in a flurry of texts as the Hamas gunmen roamed around outside his home. She said her brother and his wife did their best to keep their sons quiet.\n“Try to imagine keeping a 9-month-old and a 4-year-old kid quiet so the terrorists won’t come in,” she said.\nYarden Bibas told his sister he had a gun in the house, but couldn’t use it to defend his family against so many gunmen armed with automatic rifles.\nThen her brother said he loved her. But Ofri Bibas didn’t respond she loved him too. “I just said, ‘Shut up it’s going to be okay, shut up. Just be quiet and follow the security and everything will be all right.’”\nLater that night, Yarden sent a final text that the gunmen had entered the family's home.\nOfri Bibas said she and her family learned that Shiri and the boys were taken by Hamas through a video released by the Islamic militants on social media. Later, Hamas released an image showing her wounded brother held by his throat by a militant holding a hammer in his other hand.\nOfri Bibas said every time she hears children playing, she thinks of her little nephew, Kfir, hungry and afraid.\n“They must be terrified. We just ask everyone to help us bring them back home,” she said.\n— Menelaos Hadjicostis\nOmer Neutra\nA small forest of candles melted into the chocolate icing of a birthday cake in New York’s Long Island last week, but the guest of honor wasn’t there.\nOmer Neutra, an Israeli soldier, turned 22 seven days after Hamas ′ attack on Israel on Oct. 7. Israeli officials told his parents that Hamas took Neutra and his unit hostage, Orna and Ronen Neutra said in a telephone interview. They were told he was seen on video footage released by Hamas.\nAt their home in the U.S. on Oct. 14, the family took a break from doing what they can to secure Omer’s release by celebrating his birthday. They did not blow out the candle flames, because, they said, Omer wasn’t there to do so.\nThe scene is a glimpse of the difficult limbo in which the Neutras find themselves as they and the families of more than 200 other Israeli hostages — and dozens more people who remain missing — await word on their loved ones’ fates, with hope.\n“Omer is tough,” said his dad, Ronen. “We feel that he is well.”\nOmer Neutra was born in Manhattan a month after the Sept. 11, 2001, attacks, the son of Israeli-born parents. Also a dual citizen, he attended a conservative Jewish school and “knew all of the statistics of the New York Knicks,” Ronen said.\nHe lists Omer’s leadership positions as captain of the basketball, soccer and volleyball teams at the Schechter School of Long Island, as well as a regional president of United Synagogue Youth. Omer, Ronen said, was offered admission to the State University of New York at Binghamton — but instead deferred, took a gap year and then moved to Israel to join the army.\nThe Neutras last spoke to their son on Oct. 6, the night before the incursion, as he patrolled the Gaza border. Omer was looking forward to Shabbat, which on that weekend was also the start of a weeklong celebration of the harvest season in Israel.\n“He was tired — motivated but tired — after a few weeks of lots of action on the border,” Ronen said. “He was hoping for a peaceful weekend to relax a little bit.”\n— Laurie Kellman\nHaran family\nFor days after the brutal Hamas attack, Shaked Haran sought any clues she could about the fate of her missing parents, sister, little niece and nephew, two aunts, an uncle, a cousin — 10 family members in all, spanning three generations.\nThere were strong signs that at least some had been taken hostage. Her parents’ house at Kibbutz Be’eri was burned but the shelter was intact and there were no bodies found in it. Phone locations were tracked to Gaza. Haran’s brother-in-law had been seen being put in a Hamas car. And after a friend called the father’s phone more than 100 times, someone finally answered in Arabic and then referred in Hebrew to a hostage situation.\nIf captivity was a terrible outcome, the alternative would be worse.\nBut earlier this week, Haran, a 34-year-old attorney who grew up on the kibbutz but now lives in Beersheba, got the devastating news that the body of her father, Avshalom Haran, had been identified — he’d died in the terrible violence at Be’eri. The news came shortly after her uncle, Eviatar Kipnis, had also been confirmed dead.\nNow, Haran can only pray her other relatives are alive — and tell the world their stories. They include her mother, Shoshan, a longtime social activist who founded the nonprofit Fair Planet, which works to fight food insecurity in the developing world by helping farmers.\n“She’s really dedicated her time to this, trying to get as many people out of the poverty cycle as possible,” Haran said, adding that her family had been committed to peace, with many active in peace organizations, and raised her “to think about the person on the other side of the situation.”\nAlso missing: Haran’s sister, Adi, a psychologist; her husband Tal and their children Naveh, 8, “a bright, open-hearted boy that makes friends in an instant,” and Yahel, 3, “creative and full of life.” Also believed abducted are Haran’s aunt, Sharon, her 12-year-old daughter, Noam, and another aunt, Lilach Kipnis.\nAsked if she has a message on behalf of her family, Haran preferred to speak about all the hostages and victims.\n“I love my family, but they’re one small story in this huge catastrophe,” Haran said. “They’d want the message to be that they’re part of the family of the kibbutz – and the family of Israel.”\n— Jocelyn Noveck\nOr and Eynav Levy\nFor at least a week, 2-year-old Almog Levy has been asking for his mom and dad, and no one knows what to tell him.\nHis parents, Or and Eynav Levy, did everything together. They kept a tent in their car for spontaneous road trips, and they recently took a family trip to Thailand. They also loved music festivals, and drove to the Tribe of Nova festival in the Israeli desert.\nThey arrived minutes before Hamas militants carried out the deadliest civilian massacre in Israeli history. Eynav Elkayam Levy, 32, was confirmed dead. Or, 33, is missing.\n“How can you tell a 2-year-old boy he won’t see his mother anymore?” said Or’s older brother, Michael Levy. The family is stuck between heartbreak and hope, and they pray that Or makes it home alive.\nPhotos from happier times show the couple beaming at the beach and cafes.\n“Or is always smiling, always happy, not just in the pictures,” said Michael Levy, 40, who thinks of his brother as a child genius who would would break things so he could fix them. Or taught himself computer programming and is part of a successful startup, and he and Eynav dreamed of having a bigger family.\nA patchwork of text messages captures the couple’s chaotic final minutes together. Eynav texted her mother, who was babysitting Almog, shortly after daybreak to say they’d arrived at the festival site.\nSoon after, Or texted his mother to say they were driving back home. It was 6:51 a.m. and sirens were sounding as Hamas rockets flew over the desert party.\nOr’s mother texted back: “Watch out and call me when you can.” He called at 7:39 a.m. to say they were hiding in a bomb shelter. She asked how they were. “Mom, you don’t want to know,” he replied, before phone service cut off. The family hasn’t heard from him since.\nSeveral days later, the Israeli army informed the family that Eynav’s body was found inside the shelter, and that Or had been kidnapped and taken hostage. The family has no other details.\nAlmog’s grandparents are taking turns watching the boy, Michael said. They are trying to stay positive, for Almog’s sake. “He is calling out for his mom and dad all the time.”\n— Jocelyn Gecker\nSagui Dekel-Chen\nSagui Dekel-Chen is a builder of things. He's as gifted with his hands as he is at managing community development projects, his father says.\nEarly on the morning of Oct. 7, Sagui was tinkering with an engine in the machine shop at Nir Oz, in southern Israel, when he saw intruders on the grounds and sounded the alarm. After running home, he rigged the door of the safe room so it couldn’t be opened from the outside, kissed his pregnant wife and told her to lock herself and their two daughters inside.\nThen the 35-year-old father borrowed a gun and tried to protect his community. He hasn’t been seen since. His family believes that the Israeli-American, like several members of the kibbutz, was abducted by the Hamas militants.\n“This is a guy who has so much to give,’’ said his father, Jonathan Dekel-Chen. “He’s already proven it. Ironically not just to Israelis and his family, his children, but to all of our neighbors.”\nSagui Dekel-Ch is a project manager for the U.K. branch of the Jewish National Fund, organizing the construction of schools and youth centers in the underdeveloped Negev Desert. That included collaboration with both Jewish and Muslim nonprofits that worked in Arab communities near the kibbutz.\n“Every day was something different. Every day he was helping other people make their nonprofit goals come alive,” his father said.\nThe work was an avenue for Sagui Dekel-Chen’s “extraordinary creativity” as he advised non-profits, launched his own projects and built coalitions to get things done, his father said.\n“It is a crime that Hamas has made it so that Palestinian people will never be able, I fear, to benefit themselves from my son and people like him because their brains have been poisoned,” he added.\n— Danica Kirka\nRomi Gonen\nMeirav Leshem Gonen says she feels like she has failed to do her job as a mother to protect her 23-year-old daughter, Romi Gonen, who vanished on the day Hamas unleashed its onslaught inside Israel.\nSpeaking in Cyprus at a support rally for Israel, Gonen fought back tears as she recounted her daughter’s frantic call from an outdoor music festival and her description of missiles falling followed by volleys of automatic gunfire.\n“We assumed, OK, a few terrorists, the army will come and everything will be finished in a few minutes,\" Gonen said. “But the shooting kept on and on, and we are on the phone hearing the shootings, and Romi is terrified.”\nGonen and her eldest daughter spent nearly five hours speaking to Romi, who told them that roads clogged with abandoned cars made escape impossible and that she would instead seek shelter in some bushes to hide from roaming Hamas gunmen.\n“She’s afraid and she has to hide from bush to bush so the terrorists will not find her. Just imagine where she was, what she felt,” Gonen said.\nAmid the carnage a ray of hope emerged, as a friend who rescued a few other revelers went back in search of Romi and her friends.\nBut then, the call came that changed everything. “Mommy I was shot, the car was shot, everybody was shot. … I am wounded and bleeding. Mommy, I think I’m going to die,” said Romi.\nTrying to lift her daughter’s spirits, Gonen told Romi as if by command that she wasn’t going to die, to stop crying, start breathing and to treat her wounded friends.\n“And they knew I was lying because I didn’t have anything, anything I could do to help her,” Gonen said.\n“If I cannot help her, I will tell her how much I love her. She’s my kid. I wanted her to remember my words, and then told her how much I love her and how much she’s loved, and what we will do when she comes back home.”\nRomi’s last word during the call was “Mommy,” as approaching gunfire and the men's shouts drowned out everything.\nThen the phone shut off.\nGonen said she thinks she's a strong mother, \"But I feel that I didn’t do my job. And since that day, all I do is make sure that nobody will forget Romi and any others of the kidnapped.”\n— Menelaos Hadjicostis\nJudith Weinstein and Gad Haggai\nJudih Weinstein and her husband, Gad Haggai, were on their morning walk when gunfire erupted and missiles streaked across the sky. Taking cover in a field, they could hear a recorded voice from an alert system for their kibbutz in southern Israel.\n“What did she say?” Weinstein, 70, asked in Hebrew as she captured the scene on video.\n“Red alert,” her 72-year-old husband said.\nWeinstein shared the 40-second video clip in a group chat Oct. 7, when Hamas attacked Kibbutz Nir Oz. That has been their last contact with their family.\nMore than a week later, Weinstein and Haggai are still missing. Their family used the video to pinpoint the couple’s last known location and shared it with the Israeli army, but a search came up empty. Their fate remains a mystery to their four grown children.\nA daughter, Iris Weinstein Haggai, has been relentlessly looking for answers from her home in Singapore. The family heard ominous news from a paramedic, who said Weinstein had called for medical help.\n“She said they were shot by terrorists on a motorcycle and that my dad was wounded really bad,” said Weinstein Haggai, 38. “Paramedics tried to send her an ambulance. The ambulance got hit by a rocket.”\nThe paramedic lost contact with Weinstein, leaving her family grappling with worst-case scenarios.\nHaggai is a retired chef and jazz musician. Weinstein, a New York native, is a retired teacher. Both are pacifists who raised their children at the kibbutz, where everybody knows their neighbors.\n— Michael Kunzelman\nYaffa Adar\nYaffa Adar loved reading, writing and keeping connected. Even at 85 she often sent her family messages and GIFs on WhatsApp. She was active on Facebook, her granddaughter recalls.\nKeeping in close touch online became especially important in recent years as she found it harder to walk beyond her home in Nir Oz. Amid that physical struggle, she kept her mind busy and knew what she wanted, her granddaughter said.\n“She loved reading,” Adva Adar recalled. “So we were like, ”We’re going to get you a Kindle.” What did her grandmother say? \"‘No, I like the smell of the paper in books.’”\nWhen Hamas’ Oct. 7 massacre at Nir Oz ended and no one could find Adar, her family worried. That concern turned to horror when video surfaced showing her being driven in a golf cart in Gaza, wrapped in a pink flowered blanket.\nThe footage was among the first evidence that Hamas fighters had not only killed Israelis — more than 1,400, the vast majority civilians — but had dragged dozens back to Gaza regardless of age in the most complex hostage crisis the country has ever faced.\nSome people speculated that Yaffa Adar’s unflinching demeanor in the video perhaps meant she didn’t understand what was happening.\nNot her family, which includes three children, eight grandchildren and seven great-grandkids.\n“She absolutely knew what was going on around her. She wasn’t going to panic,” her granddaughter said.\nWhat’s frightening now is that her grandmother doesn’t have her medication for blood pressure and chronic pain.\n“She was really the glue of our family. She loved her life,” Adva Adar recalls. “She liked good food and she liked good wine. She was very young-minded.”\n— Laurie Kellman\nRoni Eshel\nRoni Eshel, a 19-year-old Israel Defense Forces soldier, was stationed at a military base near the Gaza border when Hamas attacked. Although she didn’t answer her phone when her mother called to check on her that morning, she later texted to say that she was busy but OK.\n“I love you so much,” Eshel told her mother, Sharon, about three hours after the attack started.\nHer parents haven’t heard from her since. More than a week later, Eshel’s family is desperate to know happened to their daughter. Her father, Eyal Eshel, describes the wait for news as “hell.”\n“I don’t know what to do. I don’t know what to think, actually. Where is she? What is she eating? If it’s cold for her? If it’s hot? I don’t know nothing,” Eyal Eshel said.\nHer father says IDF has told them she is considered missing; he believes she has been kidnapped.\n“Otherwise, where is she?” he asked.\nEshel grew up in a small village north of Tel Aviv. She reported for military service two weeks after finishing school. She was three months into her second year of mandatory military service.\n“It’s part of our life here in Israel,” her father says.\nRoni Eshel was in a communications unit at a base near Nahal Oz. She had returned to the base from a brief vacation on the Wednesday before the attack.\nEshel was proud to be a third generation of her family to join the Israeli military. Her father, uncle and grandfather also served.\n“She was very happy to serve the country,” her father said.\nHer father said she has planned to travel and enroll in a university after completing her two years of service. But he can’t think about her future while she’s missing. Eyal Eshel says he isn’t sleeping, eating or working while he waits.\n“I’m not ashamed to ask (for) help. Please help us,” he said.\n— Michael Kunzelman\nMaya and Itay Regev\n“Mom, I’ll unpack my suitcase when I get back,” Maya Regev told her mother that Friday night, in a rush to get going. “See you tomorrow.”\nAnd within a half-hour of returning to Israel from a family trip overseas, 21-year-old Maya and her brother Itay, 18, were on their way to the Tribe of Nova music festival, planning to dance the night away.\nIt was a typical activity for the duo, who both love to be on the move, gather with friends, and especially to travel, said their parents, Ilan and Mirit Regev. Maya had already bought her ticket for an extended trip to South America in December.\nBut early the next morning, Ilan Regev’s phone rang. It was a frantic Maya. “Dad, they shot me, they shot me!” she screamed in a recording the family has released. “He is killing us, Dad, he is killing us.”\nHer father begged her to send her location, to find a place to hide. “I’m coming,” he said.\nIlan Regev jumped in his car from his home in Herzliya, near Tel Aviv, and sped south to the festival site, where he was barred from entering. Soon, the Regev family discovered a Hamas video that showed Itay in captivity in Gaza.\nMaya was not pictured, but the army has told the family both were hostages in Gaza. Officials gave no further information.\n“I want to know that my kids are alive,” said Ilan Regev. Added their mother: “We don’t know if they are eating. We don’t know if they are drinking. If they are hurt.”\n— Jocelyn Noveck\nHersh Goldberg-Polin\nHis mother describes Hersh Goldberg-Polin as like a lot of other young people.\nThe 23-year-old from Jerusalem loves music, wants to see the world and, now that he’s finished his military service, has plans to go to university, his family says. But first he has to come home.\nGoldberg-Polin was last seen on Oct. 7, when Hamas militants loaded him into the back of a pickup with other hostages abducted from the music festival where at least 260 people were killed.\nDespite those harrowing accounts, his mother, Rachel Goldberg, holds out hope she will see him again.\n“He’s a survivor,” Goldberg said of her son, whose grin beams out from behind a sparse, youthful beard in family photos. “He’s not like this big, bulky guy. But I think that survival has a lot to do with where you are mentally.”\nBorn in Berkeley, California, Goldberg-Polin moved to Israel with his family when he was 7 years old.\nAs a child, he wanted to learn about the world, poring over maps and atlases to learn the names of capital cities and mountains. Later he became a fan of psychedelic trance music and once took a nine-week trek through six European countries so he could attend a series of raves.\nNot surprising then, that he and some friends headed to the Tribe of Nova music festival, billed as a place “where the essence of unity and love combines forces with the best music.”\nThat vibe was shattered by gunmen who stormed into Israel from the nearby Gaza Strip.\nWitnesses said Goldberg-Polin lost part of an arm when the attackers tossed grenades into a temporary shelter where he and others had taken refuge, but he tied a tourniquet around it and walked out before being bundled into the truck.\nFamily and friends have organized the “Bring Hersh Home” campaign on social media, hoping he will still be able to take a planned backpack trip through southern Asia.\nBut first his mother hopes someone helps her son.\n“It will require like the biggest heroism and strength and courage, but I want someone to help out and I want someone to help all of those hostages.”\n— Danica Kirka\nAda Sagi\nAda Sagi was getting ready to travel to London to celebrate her 75th birthday with family when Hamas militants attacked her kibbutz and took her hostage.\nThe trip was supposed to be a joyous occasion after a year of trauma. Her husband died of cancer last year, she had struggled with allergies and was recovering from hip replacement surgery. But the grandmother of six was getting through it, even though it was hard.\n“They had a very, very, very strong bond of 54 years,” her son Noam, a psychotherapist in London, told The Associated Press. “And my mum, this is her main thing now, really, just getting her life back after dealing with the loss of my dad.”\nAda Sagi was born in Tel Aviv in 1948, the daughter of Holocaust survivors from Poland. She moved to a kibbutz at the age of 18 because she was attracted by the ideals of equality and humanity on which the communal settlements were built.\nA mother of three, Ada decided to learn Arabic so she could make friends with her neighbors and build a better future for her children. She later taught the language to other Israelis as a way to improve communication with the Palestinians who live near Kibbutz Nir Oz, on the southeastern border of the Gaza Strip.\nThat was, for many years, her mission, Noam said.\nWhile he hopes his mother’s language skills will help her negotiate with the hostage-takers, he is calling on the international community for assistance.\n“The only hope I have now is ... for humanity to do something and for me to see my mother again and for my son to see his grandmother again,” he said. “I think we need humanity to actually flex its muscle here, and” — by telling her story — “that is all I’m trying to do.”\n— Danica Kirka\nAdina Moshe\nDavid Moshe was born in Iraq. Decades later in Israel, his wife, Adina, cooked his favorite Iraqi food, including a traditional dish with dough, meat and rice.\nBut what really delighted the family, their granddaughter Anat recalls, was Adina’s maqluba — a Middle Eastern meal served in a pot that is flipped upside-down at the table, releasing the steaming goodness inside. Pleasing her husband of more than a half-century, Anat Moshe says, was her grandmother’s real culinary priority.\n“They were so in love, you don’t know how in love they were,” the 25-year-old said. Adina Moshe “would make him his favorite food, Iraqi food. Our Shabbat table was always so full.”\nIt will be wracked with heartbreak now.\nOn Oct. 7, Hamas fighters shot and killed David Moshe, 75, as he and Adina huddled in their bomb shelter in Nir Oz, a kibbutz about 2 miles from the Gaza border. The militants burned the couple’s house. The next time Anat Moshe saw her grandmother was in a video, in which Adina Moshe, 72, in a red top, was sandwiched between two insurgents on a motorbike, driving away.\nHer grandmother hasn’t been heard from since, Anat Moshe said. She’d had heart surgery last year, and is without her medication.\nStill, Anat Moshe brightened when she recalled her family life in Nir Oz. The community was the birthplace and landscape of Adina and David’s romance and family. The two met at the pool, Anat said. Adina worked as a minder of small children, so generations of residents knew her.\nBut all along, low-level anxiety hummed about the community’s proximity to Gaza.\n“There was always like some concern about it, like rumors,” Anat Moshe recalled. “She always told us that when the terrorists come to her house, she will make her coffee and put out some cookies and put out great food.”\n— Laurie Kellman\nMoran Stela Yanai\nDelicate pearls peek out from silver and stainless steel chains — bits of brightness and optimism among Moran Stela Yanai’s jewelry designs that reflected cultures around the world.\nCreating art to wear has been Yanai’s passion, but not the only one, her brother-in-law Dan Mor said. Yanai, a 40-year-old Israeli who disappeared after a desert rave, also fiercely protected people and animals.\n“Moran is the softest soul,” recalls Dan Mor, whose wife, Lea, is Moran’s sister. “She could almost be annoying with how much she was so kind and sensitive to animals. You couldn’t eat meat because she was so sensitive to animals being harmed — not just pets but farm animals and wild animals.”\nThe family was horrified to recognize her in a video on TikTok that surfaced after the attack on southern Israel. In it, Yanai is sitting on the ground, looking terrified, amid derogatory Arabic text about Jews.\nDays earlier, Yanai had posted a video on Instagram on her way to the rave, where she hoped to sell her designs. She posted a second video, recorded by a friend, of her designs displayed on a table at the festival.\n“Moran, kind-hearted, never caused pain to anyone, not even a fly,” reads the accompanying text. Her work, Mor said, is inspired by cultures around the world, including Chinese and Arab.\nMor, an actor, said his family in Tel Aviv is feeling Moran’s absence deeply and trying to fill the wait by telling the world about her.\n“My beautiful dear sister-in-law, auntie to my kids,” he said. “She had a big heart, she has a big heart, and I’m hoping that heart is still pumping.”\n— Laurie Kellman", "source_domain": "www.independent.co.uk", "text": null, "title": "5 hostages of Hamas are free, offering some hope to families of more than 200 still captive", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-hamas-israel-israelis-family-b2439253.html"}