{"authors": [], "date_download": "2024-02-05 15:47:15", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "People with banners and flags marched through the center of the British capital calling for a ceasefire in Gaza\r\n\r\n\r\nA huge crowd of pro-Palest", "filename": "http%3A%2F%2Fwww.britainnews.net%2Fnews%2F274014140%2Fthousands-of-pro-palestinian-demonstrators-hit-streets-of-london.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1698516854.jpg", "language": "en", "localpath": null, "maintext": "People with banners and flags marched through the center of the British capital calling for a ceasefire in Gaza\nA huge crowd of pro-Palestinian demonstrators took to the streets of central London to call for an immediate ceasefire in Gaza. Videos of the event have gone viral on social media.\nThe march was reportedly organized by the Palestine Solidarity Campaign. According to its Facebook page, the official route of the demonstration began at Victoria Embankment and ended at Parliament Square.\nTens of thousands of protesters have gathered in the capital and across the country for rallies to denounce Israel's attack on Gaza and urge an immediate ceasefire, the BBC reports. According to the outlet, over 1,000 Metropolitan Police officers have been deployed across the capital amid the mass demonstrations.\nOn Wednesday, Prime Minister Rishi Sunak called for the release of hostages taken by Hamas during the October 7 attack on Israel and for humanitarian aid to be brought into Gaza. He added, however, that \"for all of that to happen, there has to be a safer environment, which of course necessitates specific pauses as distinct from a ceasefire.\"\nSince the Palestinian militant group launched its surprise attack, killing over 1,400 and taking more than 200 hostages, Gaza has been subjected to heavy bombardment and a total blockade by Israel. According to Palestinian officials, the death toll in the enclave has exceeded 7,000, including 3,000 children.\nThough Gaza's healthcare system has reportedly collapsed, Israel continues to attack the densely populated enclave. On Friday, Israel Defense Forces (IDF) spokesperson Daniel Hagari announced that ground forces are expanding their operations in Gaza, in addition to the attacks of the past few days.\nLater that day, Gaza's largest telecommunications provider, Paltel, reported that the most recent bombardment destroyed \"all remaining international routes\" connecting the enclave to the outside world.\nFollow LIVE UPDATES for more information\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Thousands of pro-Palestinian demonstrators hit streets of London", "title_page": null, "title_rss": null, "url": "http://www.britainnews.net/news/274014140/thousands-of-pro-palestinian-demonstrators-hit-streets-of-london"}