{"authors": ["Yohannes Lowe", "Charlie Moloney"], "date_download": "2024-02-05 15:47:17", "date_modify": "None", "date_publish": "2023-10-31 18:47:47", "description": "Lloyd Austin ‘guarantees Putin will be successful’ if US support for Kyiv ends during Senate hearing on Joe Biden’s request for funding", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Foct%2F31%2Frussia-ukraine-war-live-biden-officials-to-make-case-for-ukraine-funding-russia-bulks-up-forces-around-bakhmut-says-kyiv.json", "image_url": "https://i.guim.co.uk/img/media/96a3e63e2cce425924ef23e0c9891af6a7e762cf/0_201_4761_2858/master/4761.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=63876eedfeada550b23e45045a527c93", "language": "en", "localpath": null, "maintext": "From 31 Oct 2023 16.44 CET Russia will succeed in Ukraine unless American support continues, warns US defence secretary The US defence secretary, Lloyd Austin, has said that Russia would be successful in Ukraine unless the US’s support for Kyiv continued, Reuters reports. “I can guarantee that without our support Putin will be successful,” Austin said during a Senate hearing on President Joe Biden’s request for $106bn to fund plans for Ukraine, Israel and American border security. “If we pull the rug out from under them now, Putin will only get stronger and he will be successful in doing what he wants to do,” Austin added, sitting next to US secretary of state, Antony Blinken. Mitch McConnell has offered a strong endorsement of the White House’s $106bn aid proposal to Israel and Ukraine, saying he and the president were essentially “in the same place” on the issue. McConnell, the powerful Republican leader in the Senate, has rebuffed some of his GOP colleagues in the Senate who have called for a package separating assistance for the two countries, saying it would be “a mistake”. Lloyd Austin testifies at a Senate Appropriations Committee hearing on Capitol Hillin Washington DC. Photograph: Drew Angerer/Getty Images\nUpdated at 16.57 CET\n31 Oct 2023 19.46 CET Closing summary The US defence secretary, Lloyd Austin , said that Russia would be successful in Ukraine unless the US’s support for Kyiv continued. “I can guarantee that without our support Putin will be successful,” Austin said during a Senate hearing on President Joe Biden’s request for $106bn to fund plans for Ukraine, Israel and American border security.\nNato’s secretary general, Jens Stoltenberg , said he was certain that Sweden would join the defence alliance but declined to predict an exact time for when this would happen, Reuters reported.\nTwo Russian soldiers have been arrested on suspicion of killing a family of nine, including two young children, in their home in the Russian-occupied eastern Ukrainian town of Volnovakha .\nRussia’s Federal Security Service (FSB) has detained an accomplice in the attempted killing of former Ukrainian politician and pro-Russian politician and businessman Oleg Tsaryov , Russian state news agencies reported.\nThe UN human rights office has found “reasonable grounds” to conclude a missile strike that killed 59 people in a cafe in the Ukrainian village of Hroza was launched by Russia’s armed forces, the office said.\nPolice in France have detained the Russian tycoon Alexey Kuzmichev and raided two of his properties in connection with alleged tax evasion, money laundering and sanctions violations.\nUpdated at 19.47 CET\n31 Oct 2023 19.24 CET Ukraine’s president, Volodymyr Zelenskiy, has said he has spoken with Bulgaria’s prime minister, Nikolai Denkov, on ways to bolster Black Sea security “in the face of Russian militarisation and threats to freedom of navigation”. Posting on X, formerly Twitter, he said: The Ukrainian-Bulgarian partnership is getting stronger and this is exactly the kind of Black Sea unity that allows us to counter Russian aggression, strengthen global food security, advance Ukraine’s EU integration, and support the peace formula. I spoke with Bulgarian Prime Minister Nikolai Denkov on ways to further strengthen Black Sea security in the face of Russian militarization and threats to freedom of navigation.\nUkraine strengthens global food security with the alternative Black Sea export corridor. I appreciate… pic.twitter.com/1vMWCnkoaH — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) October 31, 2023\n31 Oct 2023 18.11 CET A UN humanitarian official has urged the UN security council to “not lose focus” on Ukraine. “While much international attention is rightly concentrated on the grave events in the Middle East, it is important that we do not lose focus on other crises,” Ramesh Rajasingham, director of coordination for the UN’s humanitarian office, OCHA, said. Speaking to the UN security council, Rajasingham said the humanitarian situation in Ukraine remained dire, especially in the face of “relentless attacks on civilians”, AFP reports. “Significant damage and destruction of critical infrastructure continues to severely impact access of the civilian population to electricity, heating, water and telecommunications,” he added.\nUpdated at 18.30 CET\n31 Oct 2023 17.56 CET US defence secretary, Lloyd Austin, said the Biden administration wanted Ukraine to continue operations through the winter, but Kyiv could not do that if they were forced to pause because of a lack of US support (see earlier post at 15.44 more details).\nUpdated at 18.30 CET\n31 Oct 2023 17.39 CET Serhiy Lysak, the governor of the Dnipropetrovsk region, has said that “three communities” within the Nikopol region have come under attack from Russian forces. He posted on Telegram on Tuesday to say that during the day there were four artillery strikes and two kamikaze drone attacks. “The main thing is that people survived,” he said.\nUpdated at 17.56 CET\n31 Oct 2023 17.05 CET Russia said three captured Ukrainian soldiers had been sentenced to life imprisonment on a range of crimes including murder and the “cruel treatment” of civilians, AFP reports. The three soldiers were found guilty of the “cruel treatment of civilians”, the “use of prohibited methods in an armed conflict” and “murder and attempted murder”, according to Russia’s investigative committee. Moscow has repeatedly handed captured Ukrainian soldiers long prison terms in court proceedings that Kyiv does not recognise on territory that Russia has seized.\nUpdated at 17.06 CET\n31 Oct 2023 16.44 CET Russia will succeed in Ukraine unless American support continues, warns US defence secretary The US defence secretary, Lloyd Austin, has said that Russia would be successful in Ukraine unless the US’s support for Kyiv continued, Reuters reports. “I can guarantee that without our support Putin will be successful,” Austin said during a Senate hearing on President Joe Biden’s request for $106bn to fund plans for Ukraine, Israel and American border security. “If we pull the rug out from under them now, Putin will only get stronger and he will be successful in doing what he wants to do,” Austin added, sitting next to US secretary of state, Antony Blinken. Mitch McConnell has offered a strong endorsement of the White House’s $106bn aid proposal to Israel and Ukraine, saying he and the president were essentially “in the same place” on the issue. McConnell, the powerful Republican leader in the Senate, has rebuffed some of his GOP colleagues in the Senate who have called for a package separating assistance for the two countries, saying it would be “a mistake”. View image in fullscreen Lloyd Austin testifies at a Senate Appropriations Committee hearing on Capitol Hillin Washington DC. Photograph: Drew Angerer/Getty Images\nUpdated at 16.57 CET\n31 Oct 2023 16.32 CET Nato chief certain that Sweden will become member of alliance Nato’s secretary general, Jens Stoltenberg, said he was certain that Sweden would join the defence alliance but declined to predict an exact time for when this would happen, Reuters reports. Earlier this month, Turkey’s president, Recep Tayyip Erdoğan, removed one of the final hurdles blocking Sweden from joining Nato by submitting a bill approving membership to parliament for ratification. The move was in line with a commitment Erdoğan made to Nato at its summit in July when he said he would send the bill to parliament for ratification when parliament restarted in October. The Turkish leader has previously demanded that Sweden tighten up on the extradition of Kurdish asylum seekers living in Sweden. Turkish officials have also previously said the steps Sweden had taken to clamp down on the outlawed Kurdistan Workers’ party militia were insufficient.\nUpdated at 16.33 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia will succeed in Ukraine unless American support continues, warns US defence secretary - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/oct/31/russia-ukraine-war-live-biden-officials-to-make-case-for-ukraine-funding-russia-bulks-up-forces-around-bakhmut-says-kyiv"}