{"authors": [], "date_download": "2024-02-05 15:47:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "LATEST DEVELOPMENTS: Shortly after Israeli Prime Minister Benjamin Netanyahu says the country is entering the next phase of its operation to counter Ha", "filename": "http%3A%2F%2Fwww.theuknews.com%2Fnews%2F274014596%2Fisrael-again-urges-gazans-to-head-south-amid-expanding-war-effort.json", "image_url": "https://cdn.bignewsnetwork.com/voa1698577567.jpg", "language": "en", "localpath": null, "maintext": "LATEST DEVELOPMENTS:\nShortly after Israeli Prime Minister Benjamin Netanyahu says the country is entering the next phase of its operation to counter Hamas, IDF spokesperson urges residents away from Hamas strongholds, saying 'our fight is with Hamas, not the people of Gaza'\nIsraeli fighter jets strike some 450 Hamas targets in the Gaza Strip over past 24 hours, the IDF says, following airstrikes and ground troops surge into the besieged enclave\nFor the second time in as many days, Tel Aviv vows to allow aid to enter Gaza amid U.N. report that thousands raided aid warehouses for food, 'basic survival items'\nUNRWA confirms internet connections partially restored in Gaza after communications blackout stalled aid convoys\nTwo days after Israel sent soldiers into the Gaza Strip, Israel's military is again urging residents to head south as airstrikes continue in northern Gaza as part of its expanded war effort against Hamas militants.\nThe Israel Defense Forces said early Sunday that its fighter jets struck 450 Hamas targets in Gaza over the past 24 hours, including strikes near Shifa Hospital, one of Gaza's largest, which is packed with patients and a destination for those seeking shelter.\n\"Hamas terrorists operate inside and under civilian buildings, precisely because they know the IDF distinguishes between terrorists and civilians,\" IDF spokesman Daniel Hagari said in a video address posted to X, formerly Twitter, early Sunday.\nThe IDF is 'expanding its operations,' he said, before urging residents away from \"Hamas strongholds.\"\n'We are moving to the next phase of our war against Hamas in Gaza,\" he said, largely echoing Saturday comments by Israeli Prime Minister Benjamin Netanyahu, who warned the war would be \"long and hard.\"\n\"Hamas is attacking Israeli civilians while firing from among Gazan civilians,\" he said. \"Our fight is with Hamas, not with the people of Gaza.'\nHagari's comments, which concluded with the second vow in as many days to allow aid to enter southern Gaza later Sunday, come amid widespread international pleas for a humanitarian cease-fire.\nThe U.N. agency for Palestinian refugees, known as UNRWA, said thousands of people broke into its Gaza aid warehouses to take food and other \"basic survival items\" early on Sunday. Thomas White, the agency's director in Gaza, said the break-in was \"a worrying sign that civil order is starting to break down.\"\nGaza has been under constant bombardment since shortly after Hamas militants attacked southern Israel on October 7, massacring more than 1,400 people, most of them civilians. Hamas is a U.S.-designated foreign terrorist organization.\nOn Saturday, the Gaza-based Ministry of Health, which is controlled by Hamas but has historically provided reliable data on casualties, said some 7,700 Gazans, mostly women and children, have died since Israel's campaign to obliterate the militant organization started. The figures could not be independently verified.\nThe New York Times reported early Sunday that the IDF said two of its soldiers were evacuated with injuries - one severe, one moderate - as its first officially announced casualties of the operation, which is expected to see fierce resistance.\nHamas on Saturday pledged to confront the Israeli attacks with 'full force.' The al-Qassam brigades, an armed wing of Hamas, said its fighters were clashing with Israeli troops in Gaza's northeastern town of Beit Hanoun and in the central area of al-Bureij.\nPleas for help\nThis weekend's bombardment - described by Gaza residents as the most intense of the war - knocked out most communications in the territory late Friday, largely cutting off the besieged enclave's 2.3 million people from the world. Communications were restored to many people in Gaza early Sunday, according to local telecommunications companies, Internet-access advocacy group NetBlocks.org and confirmation on the ground.\nThe communications blackout stalled aid convoys entering southern Gaza from Egypt's Sinai Peninsula, but Egypt's Foreign Ministry on Saturday also blamed what it called Israeli obstacles, including extensive truck inspection procedures, at the Rafah Border Crossing between Egypt and the Gaza Strip.\nBefore the conflict, about 500 trucks a day were crossing into Gaza, but in recent days, an average of 12 trucks a day have entered, U.N. Secretary-General Antonio Guterres said Friday.\nThe World Health Organization has appealed to 'the humanity in all those who have the power to do so to end the fighting now' in Gaza.\n'There are more wounded every hour. But ambulances cannot reach them in the communications blackout. Morgues are full. More than half of the dead are women and children,' it said.\nWorld Health Organization chief Tedros Adhanom Ghebreyesus tweeted Saturday that his organization has no communication with its staff and health facilities in Gaza, adding: 'I'm worried about their safety.'\nMany buildings are reduced to rubble, and Gazans are struggling to find shelter, food, water, fuel and medicine. Their plight worsened Friday night when phone and internet services were cut, followed by heavy bombing through the night.\nWorld reaction\nWestern countries have generally backed what they say is Israel's right to self-defense, but there has been mounting international concern over the toll from the bombing and growing calls for a pause to allow aid to reach Gaza civilians.\nDemonstrations took place Saturday in Paris, London, Indonesia, Pakistan, Italy, Norway and Switzerland, and a crowd of protesters filled New York City's Grand Central Station Friday night. Many were wearing black T-shirts saying, 'Jews say cease-fire now' and 'Not in our name.'\nU.S. Defense Secretary Lloyd Austin spoke with Israeli Defense Minister Yoav Gallant on Friday to discuss Israel's operations in Gaza. Austin underscored the importance of protecting civilians during the Israel Defense Forces' operations and focusing on the urgency of humanitarian aid delivery for civilians in Gaza. He also reiterated the need for Hamas to release all of the hostages, according to a Pentagon statement.\nThe United Arab Emirates, the first Gulf country to normalize relations with Israel in 2020, on Saturday expressed 'its deep concern over the Israeli military escalation and exacerbation of the humanitarian crisis that threatens more loss of civilian lives.'\nPresident Mahmoud Abbas, whose Palestinian Authority governs parts of the occupied West Bank, while Hamas rules Gaza, said, 'Our people in the Gaza Strip are facing a war of genocide and massacres committed by the Israeli occupation forces in full view of the entire world.'\nThe United States and other Western countries had urged Israel to delay a ground offensive for fear of greater Palestinian casualties and a widening conflict in the region.\nHamas is backed by Iran, which also supports militias in Lebanon, Syria, Iraq and Yemen. U.S. troops have come under fire from Iran-backed groups in Iraq and Syria. Washington has been moving more military assets to the region.\nOman's Foreign Ministry said Israel's siege and bombardment of Gaza amount to war crimes and crimes against humanity, while Turkish President Recep Tayyip Erdogan told a mass pro-Palestinian rally in Istanbul on Saturday that his country was making preparations to proclaim Israel a 'war criminal' for its actions in Gaza.\nHostages held\nHundreds of family members demonstrated in Tel Aviv earlier Saturday, carrying pictures of the captives, chanting 'return them now.'\n'The families feel like they're left behind and no one is really caring about them,' said Miki Haimovitz, a former lawmaker.\nHamas said on Saturday that it was nearing an agreement with Israel over the more than 200 hostages it has in Gaza, but Israel 'stalled' on that.\nIsrael's military spokesman dismissed the reports, saying Hamas was 'cynically' attempting to sway public opinion. Netanyahu said contacts to secure the hostages' release would continue even during a ground offensive in Gaza.\nGallant said Hamas had to be forced to the negotiating table.\n'The more military pressure, the more firepower and the more we strike Hamas,' he said, 'the greater our chances are to bring it to a place where it will agree to a solution that will allow the return of your loved ones.'\nIsrael said Wednesday that more than half the hostages held by Hamas have foreign passports from 25 different countries. Many are believed to have dual Israeli nationality.\nThe hostages are believed to be hidden in the Gaza Strip, possibly in a warren of tunnels Hamas has built there.\nSome information for this report came from The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.theuknews.com", "text": null, "title": "Israel Again Urges Gazans to Head South Amid Expanding War Effort", "title_page": null, "title_rss": null, "url": "http://www.theuknews.com/news/274014596/israel-again-urges-gazans-to-head-south-amid-expanding-war-effort"}