{"authors": [], "date_download": "2024-02-05 15:47:23", "date_modify": "None", "date_publish": "2023-10-31 19:16:28", "description": "Over the past five days, Israeli ground troops have pushed deeper and deeper into Gaza in their war against Hamas, launched in response to a bloody Oct. 7 cross-border raid by the Islamic militant group", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-israel-hamas-islamic-b2439313.html.json", "image_url": "https://static.independent.co.uk/2023/10/31/19/Israel_Palestinians_Ground_War_Explainer_11955.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nOver the past five days, Israeli ground troops have pushed deeper and deeper into Gaza in their war against Hamas, launched in response to a bloody Oct. 7 cross-border raid by the Islamic militant group.\nA growing array of units, including naval, air and ground forces, have joined the effort. The army says it has killed scores of militants and damaged Hamas’ strategic tunnel network. Soldiers have taken over abandoned Palestinian homes to stake out positions.\nYet even as the operation expands each day, the army refuses to call it an invasion.\nIts vague choice of words is more than an issue of semantics. It appears to be a deliberate strategy aimed at keeping its enemy off balance and preserving its options as a lengthy war unfolds.\nHere is a closer look at what Israel is doing inside Gaza.\nIS IT AN INVASION?\nIn the classic sense of the word, an Israeli invasion appears to be underway.\nGround forces have moved into enemy territory and operated continuously since last Friday. While the army has given few specifics about the operations, it has acknowledged that tanks, artillery, infantry, bulldozers and special forces have taken part, all backed by aerial support.\nThe army has been vague about the location or size of its forces. But its announcements indicate that thousands of troops have joined the effort, with those numbers seeming to grow by the day.\nThe Palestinians have used far stronger language, referring to Israel’s ongoing bombing with terms like “massacre” and “genocide.” The ongoing offensive has killed over 8,000 Palestinians, according to the Health Ministry in Hamas-ruled Gaza, and reduced thousands of buildings to rubble.\nWHAT DOES THE ARMY CALL IT?\nThe army refuses to say it has invaded Gaza, referring to its activities as “raids” and “operations.”\nThis reflects what is a fluid situation, as the number of troops fluctuates and, for the time being at least, Israel avoids trying to overwhelm Hamas with an overpowering number of ground troops.\nThese tactics appear to be aimed at confusing Hamas and leaving options for further action open. Still, Israel has made clear it will maintain a presence inside Gaza for a long time to come.\nOver the weekend, Defense Minister Yoav Gallant and Prime Minister Benjamin Netanyahu said that operation had moved into a new phase.\n“We have reached a new stage in the war,\" Gallant said. \"The ground in Gaza is shaking. The operation will continue until a new order.”\nWhile visiting troops on Tuesday, Gallant added: “We are deploying forces on a large scale in the depths of Gaza.”\nWHAT IS THE PLAN?\nIsrael has set two objectives: the return of all hostages and the destruction of Hamas, a militant group armed with thousands of fighters, rockets, bombs, anti-tank missiles and significant public support.\nIsrael’s chief military spokesman, Rear Adm. Daniel Hagari, routinely refers to a methodical plan to achieve these goals, even if he does not call it an invasion. “Our offensive operations will continue and intensify according to plan,” he said Tuesday.\nAmir Avivi, a retired general and former deputy commander of the military’s Gaza division, says the vague terminology is intentional. “They don’t want the enemy to know what they are doing,” he said.\nBut Avivi, who now heads the Israel Defense and Security Forum, a group of hawkish former military commanders, said it is clear what will be needed to achieve the objectives.\n“There is only one way to do this. They will have to conquer the whole Gaza Strip and spend months and months and months dismantling all the capabilities,” he said. “What does it matter what the army is saying?”", "source_domain": "www.independent.co.uk", "text": null, "title": "Has Israel invaded Gaza? The military has been vague, even if its objectives are clear", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-israel-hamas-islamic-b2439313.html"}