{
    "authors": [
        "Vassia Barba",
        "Alex Croft",
        "Image",
        "Dod",
        "Planet Labs Afp Via Getty Images",
        "Afp Via Getty Images",
        "Iranian Army Office Handout Epa-Efe Rex Shutterstock",
        "Us Central Command",
        "Centcom",
        "Afp"
    ],
    "date_download": "2024-02-05 15:14:39",
    "date_modify": "None",
    "date_publish": "2024-01-30 16:19:12",
    "description": "As tensions in the Middle East escalate to levels not seen in years, Joe Biden has said that further escalation is unnecessary. It comes after three US troops were killed over the weekend",
    "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-president-joe-biden-says-32004361.json",
    "image_url": "https://i2-prod.mirror.co.uk/incoming/article31999947.ece/ALTERNATES/s1200/0_Joe-Biden-briefed-by-members-of-the-national-security-team-Washington-DC-USA-30-Jan-2024.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As tensions in the Middle East escalate to levels not seen in years, Joe Biden has said that further escalation is unnecessary. It comes after three US troops were killed over the weekend\nPresident Joe Biden has said that \"we don't need a wider war in the Middle East\", after the US suffered its first fatal attack since the war in the Gaza Strip began on October 7. The President was expected to authorise retaliatory military action in the area, potentially against Iran.\nWhen met with reporters today, the President said: \"I don't think we need a wider war in the Middle East. That's not what I'm looking for.\" Asked if Iran was responsible for the deaths of the three Americans, he replied: \"I do hold them responsible in the sense that they're supplying the weapons to the people who did it.\"\nBiden previously vowed that the US “will respond” after three troops were killed at a base in Jordan near the Syrian border, blaming the attack on the same Iran-backed militias which have been striking US bases for months. The strikes have been ongoing since October 17, ten days after the outbreak of Israel’s war with Hamas.\nREAD MORE: Iran 'has their fingerprints' all over drone strike that killed 3 American servicemen\nImage: DoD) DoD)\n30 troops were injured, some seriously, in the attack on the Tower 22, situated near the demilitarized zone between Jordan and Syria and . But Tehran distanced itself from the attack and described America’s accusations of Iranian involvement as “baseless”, stating they “believe the region does not need more tension or a new war”.\nThe deceased were named as Sgt. William Jerome Rivers, 46, of Georgia, Spc. Kennedy Ladon Sanders, 24, and Spc. Breonna Alexsondria Moffett, 23. All three were reservists assigned to the 718th Engineer Company in Fort Moore, Georgia. The drone that killed them evaded Tower 22’s air defence system after being mistaken for a US drone, reportedly arriving at the base at the same time as a US drone was expected to return.\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US.\nImage: Planet Labs/AFP via Getty Images) Planet Labs/AFP via Getty Images)\nSince the outbreak of Israel’s war on Gaza following Hamas’ October 7 attacks, the US has been engaged in tit-for-tat strikes on multiple fronts in the Middle East. US bases in Syria, Jordan and Iraq have all been struck in response to the US’ support for Israel’s bombardment and subsequent invasion. US ships in the Red Sea have been attacked by the Yemeni Houthi rebels, who claimed they were trade ships bound for Israel.\nDozens of US troops have been injured in the strikes which include strikes on al-Asad Airbase, Al-Tanf garrison, Al-Harir Airbase, and an IED attack on a patrol near the Mosul Dam. 350 staff were relocated out of the Hemo base in the north of the Hasakah province into the Tal Baidar base, following a strike on January 10.\nImage: AFP via Getty Images) AFP via Getty Images)\nUS forces have repeatedly responded to the attacks with strikes of their own, beginning strikes ordered by the Pentagon and conducted by two F-16 fighter jets on a weapons storage facility and ammunition plant near Abu Kamal. The US claims these bases were linked with the Iranian Revolutionary Guard Corps.\nAt the time, Defense Secretary Lloyd Austin said in a statement that the US does not “seek conflict” and has no “desire to engage in further hostilities”. He added that Iranian-backed attacks on the US military are “unacceptable”, saying: “If attacks by Iran's proxies against U.S. forces continue, we will not hesitate to take further necessary measures to protect our people.”\nImage: IRANIAN ARMY OFFICE/HANDOUT/EPA-EFE/REX/Shutterstock) IRANIAN ARMY OFFICE/HANDOUT/EPA-EFE/REX/Shutterstock)\nThroughout November, December and January, US strikes have killed dozens in Iraq and Syria, including the assassination of a top Iraqi militant, Mushtaq Talib Al-Saeedi, 43, who was a senior militant in Harakat Hezbollah al-Nujaba and senior commander of the Popular Mobilization Forces, which was formed to fight ISIS. Iraqi Prime Minister Mohammed Shia' Al Sudani afterwards announced the process of removing US troops from the country would begin, with talks between the states set to begin soon.\nUS and UK forces have also issued multiple rounds of strikes against the Houthi rebels in Yemen, following attacks on trade ships passing through the Red Sea. In a joint statement issue by the Pentagon, the allies claimed to be acting to “protect the free flow of commerce”.\nImage: US Central Command (CENTCOM)/AFP) US Central Command (CENTCOM)/AFP)\n\"Our aim remains to de-escalate tensions and restore stability in the Red Sea, but let us reiterate our warning to Houthi leadership: we will not hesitate to defend lives and the free flow of commerce in one of the world's most critical waterways in the face of continued threats,” the statement adds. The strikes were supported by Australia, Bahrain, Canada, and the Netherlands.",
    "source_domain": "www.mirror.co.uk",
    "text": null,
    "title": "President Joe Biden says wider war in the Middle East 'not needed'",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.mirror.co.uk/news/us-news/breaking-president-joe-biden-says-32004361"
}