{"authors": ["Eric Blum", "Eric Blum For Dailymail.Com"], "date_download": "2024-02-05 15:16:56", "date_modify": "None", "date_publish": "2024-01-20 17:18:11", "description": "After several wrong bets on athletes and teams, rapper Drake has made another wager. This time, his money is on Sean Strickland to defeat Dricus Du Plessis at UFC 297 in Toronto.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsport%2Fmma%2Farticle-12986637%2FDrake-bets-700K-Strickland-Du-Plessis-UFC-297-Toronto-curse.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/20/16/80256883-0-image-m-43_1705769918023.jpg", "language": "en", "localpath": null, "maintext": "Drake has become known for picking all the wrong teams and athletes\nThe UFC Middleweight Championship match is the latest sports bet from Drake\nDrake confirmed on Instagram he dropped a $700K bet on Sean Strickland to successfully defend his UFC Middleweight Championship against Dricus Du Plessis in the UFC 297 main event on Saturday night.\nThe UFC pay-per-view takes place from Drake's hometown of Toronto with his attendance at the show unconfirmed. Although, the rapper getting a ringside seat would not be shocking.\nShould Strickland win, Drake would take home $1.379 million, as the champion has -110 odds to retain the strap in his first title defense.\nDrake's massive bet has made some UFC fans put money on Du Plessis to win, knowing the rapper's infamous sports 'curse' when picking teams and athletes.\nThe 'Hotline Bling' rapper picked his hometown Maple Leafs to win Game 7 of their 2019 playoff series against the Boston Bruins. Toronto lost.\nDrake placed a massive bet on Strickland to retain his championship at UFC 297 in Toronto\nStrickland and Du Plessis headline the UFC pay-per-view in a five-round championship bout\nEarlier in 2019, Drake strongly supported Alabama to win the CFP National Championship over Clemson. The Tigers dominated the Crimson Tide 44-16 in a star-making performance for Trevor Lawrence.\nDrake's awful sports takes have happened before inside The Octagon too.\nThe rapper backed Conor McGregor for his lightweight title fight against Khabib Nurmagomedov, with the Irishman and Canadian joining forces at the weigh-in before UFC 229.\nNurmagomedov tapped out McGregor in the fourth round before the infamous crowd brawl after the fight.\nDrake's massive bet will net the rapper nearly $700K if his prediction comes true on Saturday\n🚨| Drake has confirmed that he will be in attendance at #UFC297 tonight in his hometown of Toronto, Canada. 🇨🇦\nThe Canadian music artist has bet $700,000 on Sean Strickland to defeat Dricus Du Plessis in the main event. 😳🏆#UFC297 #UFC #MMA pic.twitter.com/csCAqXm9dJ — MMA Orbit (@mma_orbit) January 20, 2024\nThose are just three examples of Drake's awful history when it comes to sports betting.\nStrickland hopes to buck that curse instead of becoming another statistic attached to the Canadian star.\nDue to how high-profile Drake is, and the card taking place in his hometown, his bet is sure to be mentioned throughout tonight's UFC show.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Drake bets $700K on Sean Strickland to beat Dricus Du Plessis at UFC 297 in his hometown of Toronto... leading fans to counter that wager over rapper's infamous 'curse'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sport/mma/article-12986637/Drake-bets-700K-Strickland-Du-Plessis-UFC-297-Toronto-curse.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}