{"authors": ["Edward Helmore"], "date_download": "2024-02-05 15:16:58", "date_modify": "None", "date_publish": "2024-01-20 19:36:15", "description": "Ukrainian president invited Trump to Ukraine but says if he returns to White House he could make unilateral concessions to Russia", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F20%2Fzelenskiy-trump-rhetoric-very-dangerous-invitation-ukraine.json", "image_url": "https://i.guim.co.uk/img/media/1af8a66950d30bf7da165701d199b9936fcf7100/3_363_4397_2639/master/4397.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1ec9d1b602d218e4fbe1bc3e441d2022", "language": "en", "localpath": null, "maintext": "The Ukrainian president, Volodymyr Zelenskiy, fears that if Donald Trump returns to the White House next year he could make unilateral concessions to Russia that override Ukraine’s interests and branded the former US president’s claims he could stop the war in 24 hours as “very dangerous”.\nIn an interview with the UK’s Channel 4 News, Zelenskiy said he was “stressed” that the former president “is going to make decisions on his own, without … I’m not even talking about Russia, but without both sides, without us.”\n“If he says this publicly, that’s a little scary. I’ve seen a lot, a lot of victims, but that’s really making me a bit stressed,” he said.\n“Even if his idea [for ending the war] – that no one has heard yet – doesn’t work for us, for our people, he will do anything to implement his idea anyway. And this worries me a little,” he added.\nZelenskiy said he would invite Trump to Ukraine – an offer he has previously declined to extend – but only if the former president comes through on his promise to stop the war.\n“Donald Trump, I invite you to Ukraine, to Kyiv. If you can stop the war during 24 hours, I think it will be enough to come,” Zelenskiy said.\nThe Ukrainian leader’s comments come after the Republican presidential frontrunner has claimed he is well positioned to negotiate an end to the war that has raged without any attempt at a negotiated settlement between the two countries for almost two years.\nIn September, Trump said that if re-elected president, he would resolve the war within 24 hours but declined to outline his peace plan. “If I tell you exactly, I lose all my bargaining chips. I mean, you can’t really say exactly what you’re going to do. But I would say certain things to Putin. I would say certain things to Zelenskiy,” he said.\nTrump has also said he has a good relationship with both Russian and Ukrainian leaders, and repeatedly made flattering comments about the Russian president, Vladimir Putin, including describing him as a “smart” political player who had taken over a “great piece of land” with only minor economic sanctions.\nZelenskiy’s comments come as the Biden administration has signaled it is prepared to make concessions around security at the US-Mexico border to obtain a multibillion-dollar military arms package to Ukraine currently held up by Republicans in Congress.\nTop aides to Joe Biden reportedly told lawmakers at a meeting last week that if Congress fails to authorize additional aid, Russia could win the war in a matter of weeks or months at best.\nAccording to NBC News, the national security adviser, Jake Sullivan, and the director of national intelligence, Avril Haines, told the meeting that Ukraine will run out of certain air defense and artillery supplies in the coming weeks. A White House official described the situation as “incredibly stark”.\nThey also warned that failing to supply Ukraine with more weapons could prompt US allies, including Japan and South Korea, to rethink their alliances and that a Russian victory in Ukraine “will reverberate around the world”.\nSeparately, the head of the UN atomic watchdog warned that Russian mines had been re-planted in the buffer zone around the Russian-occupied Zaporizhzhia nuclear power plant after they were removed in November.\nThe head of Ukraine’s state nuclear company described the alleged planting of mines around Zaporizhzhia, which is one of world’s 10 biggest nuclear power stations, as “another crime” by Russian forces. Its six nuclear reactors are currently offline.\nThe Associated Press contributed reporting", "source_domain": "www.theguardian.com", "text": null, "title": "Zelenskiy slams Trump’s rhetoric on stopping the war as ‘very dangerous’", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/20/zelenskiy-trump-rhetoric-very-dangerous-invitation-ukraine"}