{"authors": ["James Callery"], "date_download": "2024-02-05 15:16:59", "date_modify": "None", "date_publish": "2024-01-20 17:53:14", "description": "An explosion at the bow of the Malta-flagged and Greek-owned MT Zografia bulk carrier was captured on the onboard camera", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12986755%2FDramatic-moment-Houthi-missile-smashes-merchant-ship-Red-Sea-UK-explore-ways-step-military-campaign-against-militants.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/20/17/80257935-0-image-m-32_1705772430528.jpg", "language": "en", "localpath": null, "maintext": "This is the dramatic moment a Houthi missile smashes into a merchant ship in the Red Sea.\nAn explosion at the bow of the Malta-flagged and Greek-owned MT Zografia bulk carrier on Tuesday was captured on the onboard camera.\nThe United Kingdom and U.S. are looking in to methods of ramping up their campaign against Houthi rebels in Yemen without it leading to a broader war, with a focus on striking Iranian resupplies and launching more ferocious pre-emptive strikes, people familiar with the matter have said.\nThe proposals could signal an escalation in the allied attempts to bring to a close the chaos in the Red Sea, which handled around 12 per cent of global trade before the Houthis began striking commercial ships in response to Israel's attacks on the Gaza Strip.\nThe Houthi attacks have given rise to higher insurance costs and sparked fears of added inflationary pressure as vessels take a longer and more expensive route around the southern tip of Africa.\nThe Malta-flagged and Greek-owned MT Zografia bulk carrier was targeted in the Red Sea on Tuesday\nFootage captured on the on board camera shows a huge explosion at the bow of the boat\nDefence Secretary Grant Shapps today wrote on X, formerly Twitter, in a post that was accompanied by a video: 'In less than 24 hours, the UK took action against the Houthis & uplifted our support to Ukraine to record levels.\n'In doing so we dashed the hopes of tyrants like Putin, who naively believed we could be distracted by multiple crises. The UK can and will act wherever we need to.'\nU.S. Central Command forces on Saturday struck a Houthi anti-ship missile that was aimed into the Gulf of Aden and prepared to launch, the U.S. military said, with the latest round of strikes coming hours after the United States struck three other Houthi anti-ship missiles.\n'U.S. forces determined the missile presented a threat to merchant vessels and U.S. Navy ships in the region, and subsequently struck and destroyed the missile in self-defense,' the U.S. Central Command said in a statement on X.\nThe incident, the latest amid growing tensions in the Red Sea and Gulf of Aden that have disrupted global trade and raised fears of supply bottlenecks, took place around 4 a.m. Yemen time (1 a.m. GMT), the U.S. Central Command added.\nLate on Friday, U.S. Central Command forces conducted strikes against three Houthi anti-ship missiles that they said were aimed into the Southern Red Sea.\nThe explosion ripping across the front of the vessel. The UK and U.S. are looking in to methods of ramp up their campaign against Houthi rebels in Yemen without it leading to a broader war\nDefence Secretary Grant Shapps today wrote on X, formerly Twitter, in a post that was accompanied by a video: 'In less than 24 hours, the UK took action against the Houthis & uplifted our support to Ukraine to record levels'\n'U.S. forces identified the missiles in Houthi-controlled areas of Yemen and determined that they presented an imminent threat to merchant vessels and the U.S. Navy ships in the region. U.S. forces subsequently struck and destroyed the missiles in self-defense,' the U.S. Central Command said in the post on X.\nThe incident took place around 6:45 p.m. Yemen time (1545 GMT), the U.S. Central Command added.\nAttacks by the Iran-aligned Houthi militia on ships in and around the Red Sea for the past several weeks have slowed trade between Asia and Europe and alarmed major powers in an escalation of the war in Gaza.\nThe Houthis, who control most of Yemen, say their attacks are in solidarity with Palestinians under attack from Israel in Gaza.\nHouthi fighters brandish their weapons during a protest following U.S. and British forces strikes, on January 12, 2024\nThis photograph provided by the Indian Navy shows U.S.-owned ship Genco Picardy that came under attack Wednesday from a bomb-carrying drone launched by Yemen's Houthi rebels in the Gulf of Aden, on January 18, 2024\nHouthi supporters attend a protest against the United States-led airstrikes on January 12, 2024, in Sanaa, Yemen\nU.S. Navy sailors (File Photo). U.S. forces conducted new strikes against Iran-backed Houthi rebels in Yemen on Thursday\nA Houthi fighter is pictured standing aboard a cargo ship in the Red Sea\nSince last week, the United States has been launching strikes on Houthi targets in Yemen, and this week returned the militia to a list of 'terrorist' groups.\nPresident Joe Biden said on Thursday that air strikes would continue even as he acknowledged they may not be halting the Houthi attacks.\nSaturday's strikes were the fifth in the past week by the U.S. against Houthi missile launchers that were prepared to launch attacks.\nThe Houthis launched two anti-ship ballistic missiles at a U.S.-owned tanker ship late on Thursday that hit the water near the vessel but caused no injuries or damage, according to the U.S. military.\nThe confrontation risks an expansion of the conflict beyond Hamas-governed Gaza, where the local health ministry says over 24,000 people - or more than 1 per cent of Gaza's 2.3 million population - have been killed in Israel's assault.\nIsrael launched its offensive following October 7 attacks on Israel by the Palestinian Islamist group, which Israeli officials say killed 1,200 people.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Dramatic moment Houthi missile smashes into merchant ship in the Red Sea - as US and UK explore ways to step up military campaign against the militants", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12986755/Dramatic-moment-Houthi-missile-smashes-merchant-ship-Red-Sea-UK-explore-ways-step-military-campaign-against-militants.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}