{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:17:01", "date_modify": "None", "date_publish": "2024-01-19 18:25:54", "description": "Prospect of close combat in overpopulated area ‘deeply concerning’ say aid officials, while Gaza’s largest functioning hospital may have to close", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F19%2Falarm-as-israeli-forces-move-closer-to-crowded-areas-in-southern-gaza.json", "image_url": "https://i.guim.co.uk/img/media/452f6827644e1cf63dd318f72d45273de0f443f4/0_5_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6bb1cfb994dc9a3bcb4ab55d05d38167", "language": "en", "localpath": null, "maintext": "As Israeli forces have moved further into southern Gaza, airstrikes and close-combat fighting are approaching areas crowded with more than a million people seeking refuge from the destruction across the rest of the territory.\nThe prospect of major operations taking place in territory with such a dense and vulnerable population is “deeply concerning”, say aid officials, who fear Gaza’s largest remaining hospital may have to be closed or evacuated.\nWitnesses reported the sound of ground combat and explosions throughout Friday in western Khan Younis, the main city in the south of Gaza, where Israel says many members and leaders of the Palestinian Islamist movement Hamas are hiding.\nMedical staff said the fighting had come within metres of Nasser hospital, the biggest hospital still partly working in Gaza, over the past week. The facility has been receiving hundreds of wounded patients every day since the fighting shifted to the south last month. There are fears that it could be forced to close because of Israeli bombardments and evacuation orders.\nWitnesses reported automatic weapons fire, an orange fireball above rooftops in the afternoon, and smoke above much of the city.\nView image in fullscreen An injured man is brought into Nasser hospital. Photograph: Haitham Imad/EPA\nIsraeli officials said soldiers in Khan Younis had “eliminated dozens of terrorists in close-quarters combat and with the assistance of tank fire and air support”.\nThe Israel Defense Forces (IDF) are now fighting at their southernmost point yet in the offensive, which was launched after Hamas attacked Israel on 7 October and killed 1,200 people.\nA total of 24,762 Palestinians, mostly women and children, have been killed in Gaza since then, according to the territory’s health ministry. Thousands more are thought to be buried under the rubble of destroyed buildings and tens of thousands more have been wounded.\nSo far the conflict has displaced roughly 85% of Gaza’s 2.4 million people. Many fled to Khan Younis and Rafah after Israel ordered civilians in the north to evacuate at the beginning of the war. Most are packed into UN-run shelters, where food, water, fuel and medical care are limited. Others are living in crowded private apartments, makeshift camps, under plastic sheeting pegged to poles on wasteland, or even on roads.\nAid officials who have visited Gaza say the crowding in the south is almost unprecedented. Humanitarian convoys have difficulty travelling along roads half-blocked by displaced families, and a journey that might once have taken 10 minutes now takes an hour.\nIsraeli officials say they try to avoid civilian casualties and issue evacuation orders designed to clear areas of residents before they attack. They accuse Hamas of using the population as a human shield. Hamas denies the charge.\nAnalysts in Israel say securing control of Khan Younis and Rafah is essential to achieving its war aims of destroying the military capabilities of Hamas and freeing more than 132 hostages abducted by the group in the 7 October attacks. About half of the 240 hostages seized by Hamas were freed in November during a short-lived ceasefire in exchange for 240 Palestinian prisoners in Israeli jails. Some of the remaining hostages are thought to have been killed.\nMany of the hostages are thought to be held in Khan Younis, possibly in tunnels below the city. Control of Rafah is seen as essential to cutting off Hamas from its supply routes from Egypt, the analysts said.\nThe prospect of a major Israeli assault in or near Rafah, a town on the border with Egypt that has become a refuge for almost a million displaced people, has alarmed humanitarian officials.\n“Everybody is deeply, deeply anxious. Many have been displaced multiple times. People don’t see anywhere else to go. There is no real shelter anywhere else,” said Philippe Lazzarini, head of the United Nations Relief and Works Agency for Palestine Refugees, shortly after returning from a three-day visit to Gaza earlier this week.\nAn airstrike in the town on Thursday killed 16 people, half of them children, medics said.\nView image in fullscreen Palestinian children cook a meal among makeshift tents while Israel’s attacks continue. Photograph: Anadolu/Getty Images\n“The situation is very difficult. Four-fifths of Gaza is here now. It is very, very crowded. Everywhere is full of tents. The displaced are even living in our small hospital here,” said Dr Subhi Sukeyk, a senior oncologist who lives in Rafah. “We cannot do pathology, or surgery, and we have no drugs for treatment. Our patients are dying.”\nRelative calm in northern Gaza has allowed a new effort to reopen al-Shifa hospital, Gaza’s largest, which became the centre of a fierce propaganda war last year when Israel was accused of deliberately targeting the site. Israeli officials denied this, and said Hamas had built a command complex underneath.\nThe hospital, which the World Health Organization described as “a death zone” when it largely ceased operations after raids and occupation by Israeli troops in November, has restarted basic services.\nDr Marwan Abu Saada, the director of surgery at Shifa hospital, said he was hoping to open an ICU next week and that some basic services had been restored, but that fuel, power and medicine were still in short supply. “The major oxygen generators are destroyed, so we are relying on cylinders,” he said.\nSome people displaced from northern Gaza have returned home.\nIn Gaza City’s Rimal district, rubble has been ploughed to the sides of some dirt roads, but others are still clogged with the remnants of collapsed buildings. “Everything is destroyed and the people are dying of hunger,” said Ibrahim Saada, who said he had lost his whole family.\nThe IDF confirmed on Thursday that it had removed bodies from An Namsawi cemetery near Nasser hospital, after reports that the graveyard had been destroyed by tanks and graves emptied. The IDF told the broadcaster CNN it had taken the bodies to identify whether any Israeli hostages were among them.\nFootage also emerged on Thursday of Israeli troops blowing up the main campus of a university outside Gaza City in a controlled detonation – one of multiple universities they have destroyed.\nIn a briefing note, the UN said the explosion had taken place on Wednesday and said reports suggested it had “been used by the Israeli military as a military base and an ad hoc detention facility for interrogating Palestinian detainees before their transfer to an unknown location”.\nA US state department spokesperson, Matthew Miller, said at a press briefing that Washington had raised the issue of the destruction of the university with Israel.\nIsrael has also been accused of mistreating Palestinian detainees in Gaza. Ajith Sunghay, a UN human rights official in Gaza, told reporters he had met men who described being held for weeks, beaten and blindfolded, and being released in diapers. “These are men who were detained by the Israeli security forces in unknown locations for between 30 and 55 days,” Sunghay said.\nIsrael’s military said it was detaining and questioning suspects involved in militant activity – without disclosing a number – as part of its operations in combat areas in Gaza. Detainees were “treated in accordance with international law”, the Israeli military’s Spokesperson’s Unit said, adding that those found not to be involved in the fighting were released.\nA communications blackout continues in Gaza, which internet monitor NetBlocks said has stretched into its eighth day, the longest outage of the war.", "source_domain": "www.theguardian.com", "text": null, "title": "Alarm as Israeli forces move closer to crowded areas in southern Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/19/alarm-as-israeli-forces-move-closer-to-crowded-areas-in-southern-gaza"}