{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:17:05", "date_modify": "None", "date_publish": "2024-01-19 15:43:55", "description": "Ben Hodges, former Commanding General of US Army Europe, said if Trump is elected as US president in November, it would weaken NATO and leave Europe vulnerable to a Russian attack.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12983501%2FA-Trump-presidency-leave-Europe-sitting-ducks-Putin-lack-support-NATO-Chilling-warning-former-General-says-weakened-alliance-prompt-Russia-think-attack.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/19/15/80228093-0-image-m-84_1705678688528.jpg", "language": "en", "localpath": null, "maintext": "A Trump presidency could leave Europe as 'sitting ducks' for Vladimir Putin and his forces because of his lack of support for NATO, a retired US General has warned.\nBen Hodges, the former Commanding General of US Army Europe, said if Donald Trump is elected as US president in November, it would weaken NATO and leave Europe vulnerable to a Russian attack.\nHodges said if Putin believes that NATO is becoming 'disunified' due to a Trump presidency, the Russian warmonger would think 'we can attack now'.\nHis comments came just days after it emerged that Trump, who won the Republican's Iowa caucus on Monday, had told European officials he would never help Europe if it came under attack and that 'NATO is dead' while he was president.\nHodges said that if Trump was president, the likelihood of Putin launching an invasion and sparking WW3 would massively increase.\nSpeaking from his home in Frankfurt, Germany, Hodges told MailOnline: 'The likelihood of an all-out war starting increases the more chaotic, disunified and unprepared we in the West are.\n'A Trump presidency, where he has openly talked about taking the US out of NATO, would erode the cohesion and trust inside NATO. Russia would look at this and think, maybe now their European allies can be hit.'\nBen Hodges, the former Commanding General of US Army Europe, said if Donald Trump (pictured on January 15) is elected as US president in November, it would weaken NATO and leave Europe vulnerable to a Russian attack\nA Ukrainian serviceman attends an anti-sabotage mock drills at the border with Belarus, amid Russia's attack on Ukraine, in Chernihiv region, Ukraine\nU.S. Soldiers assigned to the 1st Battalion, 9th Cavalry Regiment, 2nd Armored Brigade Combat Team, 1st Cavalry Division participate in the distinguished-visitors day as part of Griffin Shock 23 held at Bemowo Piskie, Poland, in May 2023\nHodges (pictured) said if Putin believes that NATO is becoming 'disunified' due to a Trump presidency, the Russian warmonger would think 'we can attack now'\nHodges pointed to how Trump had been quoted by a high-level EU official as telling European Commission President von der Leyen in 2020: 'You need to understand that if Europe is under attack, we will never come to help you and support you.'\nHodges added: 'A lack of cohesion in the allice would cause Russia to think, ok we could attack Europe now. We will be seen as sitting ducks by Putin.\n'If we are disunified, that would mean we aren't prepared, we don't enough forces in the regions that need it to respond effectively to an attack on NATO soil.'\nHodges warnings of what a Trump going back to the White House in November would mean for Europe and NATO comes after a senior official said the alliance's forces are bracing for an all-out war with Russia in the next two decades.\nAdmiral Rob Bauer, the chairman of NATO's Military Committee, yesterday urged both civilians and governments to prepare for cataclysmic conflicts and the chilling prospect of being conscripted.\n'We have to realise it's not a given that we are in peace. And that's why we [NATO forces] have the plans, that's why we are preparing for a conflict with Russia,' Bauer told reporters after a meeting of NATO defence chiefs in Brussels.\n'But the discussion is much wider. It is also the industrial base and also the people that have to understand they play a role.'\nBauer added: 'We need public and private actors to change their mindset for an era in which everything was plannable, foreseeable, controllable and focused on efficiency to an era in which anything can happen at any time. An era in which we need to expect the unexpected.'\nHodges said Bauer is right to issue such a warning, saying it's not 'alarmist' in the least.\nThe former General said: 'If you want to prevent war, you have to demonstrate that you are prepared for war.\n'Bauer is reminding us what we did for 40 years during the Cold War. We lived with the possibility of a nuclear war starting that night for 40 years. The culture and mindset was: \"Be prepared to fight tonight\".'\n'People shouldn't be alarmed by what Bauer is saying, they should be saying thank you for reminding us that what we enjoy right now is not a guarantee or a given.\n'We have the power to change that now. That is not inevitable.'\nThis comes as NATO is planning to mobilise 90,000 troops in its largest military manoeuvre since the Cold War, with the war games aimed at deterring Vladimir Putin from targeting a member country.\nThe alliance announced the exercise would begin next week, with the months of drills aimed at showing the alliance can defend all of its territory up to its border with Russia.\nUkrainian servicemen dressed in Russian uniforms attend anti-sabotage mock drills at the border with Belarus, amid Russia's attack on Ukraine, in Chernihiv region, Ukraine on Wednesday\nNATO is planning to mobilise 90,000 troops in its largest military maneuver since the Cold War in a bid to deter Vladimir Putin. Pictured: British soldiers take part in a major drill as part of the EFP NATO operation at the Tapa estonian army camp near Rakvere, on February 6, 2022\nThe exercises - dubbed 'Steadfast Defender' - will run until late May and involve units from all 31 NATO member countries plus candidate-member Sweden, NATO's Supreme Allied Commander Europe, US General Christopher Cavoli, said.\nThe wargames are meant as a fresh show of strength from NATO and its commitment to defend all allied nations from attack.\n'The Alliance will demonstrate its ability to reinforce the Euro-Atlantic area by a transatlantic movement of forces from North America,' Cavoli told reporters in Brussels after a two-day meeting of national chiefs of defence.\nBauer said the scale of the exercise was a demonstration of the alliance's new readiness.\n'That is a record number of troops that we can bring to bear and have an exercise within that size, across the alliance, across the ocean, from the US to Europe,' he said.\nIt was announced last week the UK would be sending 20,000 troops with the Royal Navy's two new aircraft carriers, eight warships, as well as the RAF's F-35 lightning attack aircraft, which will practice flying in imitated conflict scenarios.\nUK Defense Secretary Grant Shapps announced the deployment on Monday.\nThe war games come after UK ministers announced a further £2.5billion support package to Ukraine and the RAF airstrikes, with the US, on the Houthis in Yemen.\nAccording to German newspaper Bild, Germany will send 12,000 soldiers along with 3,000 vehicles and 30 aircraft.\nCiting the German Press Agency, Bild said the exercise will simulate a Russian attack on NATO territory, a scenario which would trigger Article 5. The article states that if any NATO country is attacked, all other alliance countries will mobilise to defend it.\nEarlier this week, at a meeting of the 31-nation alliance's top brass in Brussels, Adm Bauer, also said that behind Russian president Putin's rationale for the war is a fear of democracy.\nAdm Bauer said NATO would continue to support Ukraine long-term.\n'Today is the 693rd day of what Russia thought would be a three-day war. Ukraine will have our support for every day that is to come because the outcome of this war will determine the fate of the world,' he said.\n'This war has never been about any real security threat to Russia coming from either Ukraine or NATO,' Adm Bauer added.\n'This war is about Russia fearing something much more powerful than any physical weapon on earth - democracy. If people in Ukraine can have democratic rights, then people in Russia will soon crave them too.'\nThe largest NATO exercise since the cold war took place in 2018 when around 51,000 troops were involved in 'Trident Juncture 2018' in Norway.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "A Trump presidency could leave Europe 'sitting ducks' for Putin", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12983501/A-Trump-presidency-leave-Europe-sitting-ducks-Putin-lack-support-NATO-Chilling-warning-former-General-says-weakened-alliance-prompt-Russia-think-attack.html?ns_mchannel=rssns_campaign=1490ito=1490"}