{"authors": ["Mabel Banfield-Nwachi", "Geneva Abdul"], "date_download": "2024-02-05 15:17:07", "date_modify": "None", "date_publish": "2024-01-19 16:02:04", "description": "Huge inferno at oil depot in western Russia in latest of series of cross-border attacks by Ukraine", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F19%2Frussia-ukraine-war-live-putin-victory-would-not-end-well-for-europe-lithuanias-foreign-minister-says.json", "image_url": "https://i.guim.co.uk/img/media/6f57380d38f51c8d26ac2ae0c07842d838c7263b/163_0_3271_1964/master/3271.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=140c12cf134a3a9e1f278a90cd3e4484", "language": "en", "localpath": null, "maintext": "From 19 Jan 2024 12.32 CET Kyiv says attack on Russian oil depot in Klinsty part of 'fair' retaliation for Moscow strikes on Ukraine infrastructure Ukraine said it was behind a drone strike that sparked a huge inferno at an oil depot in western Russia on Friday, the latest in a series of escalating cross-border attacks. The strike is the second on a Russian oil depot in as many days, part of what Kyiv has called “fair” retaliation for Moscow’s strikes on Ukrainian energy infrastructure. Friday’s strike targeted a Rosneft oil storage facility about 50 kilometres (30 miles) from the Ukrainian border, in the Russian town of Klintsy, officials said. It was carried out by the Main Intelligence Directorate of the Ukrainian Ministry of Defence, a Ukrainian security source confirmed to AFP, without elaborating. Videos showed a huge fireball tearing through the oil depot’s storage tanks, while a cloud of black smoke billowed over the town of some 60,000 inhabitants. Regional governor Alexander Bogomaz said: Four oil tanks are burning in Klintsy. For safety reasons 32 residents of the private sector were temporarily evacuated to relatives. A temporary accommodation centre has been prepared. There were no casualties, but 13 fire trucks were deployed to battle the blaze, Bogomaz announced earlier. The fire started after a drone dropped “munitions” on the depot, he said but claimed the drone had been intercepted. Two other drones targeting the region were shot down by air defences.\nUpdated at 12.41 CET\n19 Jan 2024 17.02 CET Summary It is now approaching 6pm in Kyiv. Here is a quick roundup of the main updates from today: Ukraine said it was behind a drone strike that sparked a huge inferno at an oil depot in western Russia on Friday, the latest in a series of escalating cross-border attacks. The strike is the second on a Russian oil depot in as many days, part of what Kyiv has called “fair” retaliation for Moscow’s strikes on Ukrainian energy infrastructure.\nA fire tore through Ryazan oil refinery, Russia’s third-largest, on Friday, the Komsomolskaya Pravda newspaper said, quoting emergency services. The fire at the oil refinery, controlled by Rosneft, has been put out and there were no injuries, RIA news agency reported.\nA delegation of members of the Hamas militant movement has visited Russia, the Foreign Ministry said on Friday. Reuters reports the Russian side emphasised the need to release hostages during talks, the Foreign Ministry said.\nFinland does not see any immediate military threat from Russia, the country’s prime minister Petteri Orpo said on Friday at a press conference with European Commission president Ursula von der Leyen and Sweden’s prime minister Ulf Kristersson .\nA Russian state prosecutor on Friday asked a court to jail Darya Trepova, a woman accused of killing a prominent military blogger by blowing him up at Ukraine’s behest, to 28 years in jail, the RIA news agency reported.\nBritain brushed off a Russian plan to ban UK ships from fishing in Moscow’s waters on Friday as an example of Russia’s “self-imposed isolation” , while an industry body said it would have no impact because Britain’s fleet doesn’t fish there anyway.\nThe EU has started discussions on a new sanctions package for Russia that it aims to approve by 24 February, Bloomberg News reported on Friday.\nBelgium will supply a marine ship to an EU mission to protect ships from attacks by Yemen’s Iran-backed Houthi militia in the Red Sea , Belgian broadcaster VRT reported on Friday, citing government sources.\nAbout 160 people who applied for asylum at Finland’s eastern border last year have since disappeared , amid a sudden surge of asylum seekers arriving via Russia, Finland’s immigration authority said.\nThe Kremlin on Friday said there was no prospect of reviving the Black Sea grain deal and that alternative routes for shipping Ukrainian grain carried huge risks, Reuters reports.\nNato will launch its biggest military exercises in decades next week with about 90,000 personnel set to take part in months of drills aimed at showing the alliance can defend all of its territory up to its border with Russia, top officers said Thursday.\nPolice in the central Russian republic of Bashkortostan on Friday arrested more protesters incensed over the jailing of local activist Fail Alsynov, who campaigns for the protection of the Bashkir language, as a court sentenced nine demonstrators to short jail terms, reports AFP.\nA Russian official says a Ukrainian drone has struck an oil storage depot in western Russia, causing a massive fire. Russian officials and news reports said four oil reservoirs with a total capacity of 6,000 cubic meters (1.6m gallons) were set on fire Friday after the drone reached Klintsy, a city of 70,000 people located about 60 kilometres (40 miles) from the Ukrainian border. Thank you for following our live blog. You can read more of our coverage of the war here.\n19 Jan 2024 16.43 CET The official page of the Ministry of Defence of Ukraine posted a picture of tank Bradley’s crew members, Serhii and Oleksandr after a video of a Ukrainian M2A2 Bradley IFV destroying a russian T-90M tank went viral. Recently, a video of a Ukrainian M2A2 Bradley IFV destroying a russian T-90M tank went viral.\nHere are that Bradley's crew members, Serhii and Oleksandr.\nTrue legends!\n📷: 47th Mechanized Brigade pic.twitter.com/7FX9R434Hv — Defense of Ukraine (@DefenceU) January 19, 2024\n19 Jan 2024 15.14 CET A fire tore through Ryazan oil refinery, Russia’s third-largest, on Friday, the Komsomolskaya Pravda newspaper said, quoting emergency services. The fire at the oil refinery, controlled by Rosneft, has been put out and there were no injuries, RIA news agency reported. Separately, oil tanks at a storage facility in the town of Klintsy in Russia’s Bryansk region caught fire after Russian forces brought down an incoming Ukrainian drone, Reuters reports.\n19 Jan 2024 14.49 CET A delegation of members of the Hamas militant movement has visited Russia, the Foreign Ministry said on Friday. Reuters reports the Russian side emphasised the need to release hostages during talks, the Foreign Ministry said.\n19 Jan 2024 14.30 CET Finland does not see any immediate military threat from Russia, the country’s prime minister Petteri Orpo said on Friday at a press conference with European Commission president Ursula von der Leyen and Sweden’s prime minister Ulf Kristersson. Orpo told reporters in Stockholm: I don’t see any immediate military threat from Russia against Finland. We in Finland sleep peacefully at night because we are well prepared.\n19 Jan 2024 14.05 CET A Russian state prosecutor on Friday asked a court to jail Darya Trepova, a woman accused of killing a prominent military blogger by blowing him up at Ukraine’s behest, to 28 years in jail, the RIA news agency reported. Pro-war blogger Vladlen Tatarsky was killed by a bomb hidden in a figurine that Trepova, 26, gave him at a cafe in St Petersburg where he was giving a talk to an audience of up to 100 people in April last year, Reuters reports. The figurine was a crude likeness of Tatarsky, who accepted it as a gift. Witnesses told the court that he had jokingly called it “Golden Vladlen” and turned it over in his hands before it had exploded, killing him on the spot and injuring dozens. At the last court hearing on 16 January, Trepova told the court that she had believed that the package she handed to him had contained a listening device, not a bomb. Trepova said she was acting under orders from a man in Ukraine whom she knew as “Gestalt” (German for “Shape”), who had been sending her money and instructions for several months before the killing. Russia accused Ukraine immediately after the attack of organising Tatarsky’s murder. Senior Ukrainian officials have neither claimed responsibility nor denied involvement, with presidential aide Mykhailo Podolyak describing it as “internal terrorism”.\n19 Jan 2024 14.03 CET Britain brushed off a Russian plan to ban UK ships from fishing in Moscow’s waters on Friday as an example of Russia’s “self-imposed isolation”, while an industry body said it would have no impact because Britain’s fleet doesn’t fish there anyway. The Russian government said on Thursday it had approved a plan to revoke a fishing agreement dating to 1956 that lets UK vessels fish in Russian’s waters in the Barents Sea, a vast part of the Arctic Ocean rich in cod and haddock. The announcement prompted headlines in British tabloids that Moscow was threatening Britain’s traditional dish of fish and chips. But Mike Cohen, chief executive officer of the National Federation of Fishermen’s Organisations, told Reuters he was not aware of any UK vessels that fish in the sea’s Russian sector. He said: I am not clear that it will have any practical impact. Russia has sought to disentangle its economy from the West since western countries imposed sanctions in the wake of Moscow’s invasion of Ukraine in 2022. Russia’s Izvestiya newspaper, which reported the planned fishing move on Thursday, said it was in response to Britain’s attempts to damage the Russian economy. A British government spokesperson said London had not received any official notification from Moscow on such a decision. “However, Russia’s continued unilateral withdrawal from a number of international cooperation treaties is symptomatic of its self-inflicted isolation on the world stage as a result of its illegal invasion of Ukraine.”\n19 Jan 2024 13.42 CET The EU has started discussions on a new sanctions package for Russia that it aims to approve by 24 February, Bloomberg News reported on Friday. According to Reuters, the potential measures could include further listings, more trade restrictions and cracking down on Moscow’s continued ability to get around the bloc’s sanctions both through third countries and companies within the EU, the report said citing people familiar with the matter.\n19 Jan 2024 13.34 CET Belgium will supply a marine ship to an EU mission to protect ships from attacks by Yemen’s Iran-backed Houthi militia in the Red Sea, Belgian broadcaster VRT reported on Friday, citing government sources. Many commercial shippers have diverted vessels to other routes after attacks in the Red Sea by the Houthi militants, who control much of Yemen and say they are acting in solidarity with the Palestinians as Israel and Hamas wage war in Gaza, Reuters reports.\n19 Jan 2024 13.12 CET About 160 people who applied for asylum at Finland’s eastern border last year have since disappeared, amid a sudden surge of asylum seekers arriving via Russia, Finland’s immigration authority said. Finland closed its eastern border with Russia late last year amid a growing number of arrivals from countries including Syria and Somalia. Reuters reports that it accused Moscow of funnelling migrants to the border, a claim the Kremlin has denied. The immigration authority Migri said it got 1,323 asylum applications at the eastern border between August and December last year, about 900 of those in November and more than 300 in December. Now 160 people are missing from reception centres, most with unknown whereabouts, Migri’s Director of the Asylum Unit, Antti Lehtinen told Reuters. Eighteen people have turned up in other European countries, including the Netherlands, Belgium, Norway, Sweden, France, Germany and Switzerland, to refile an asylum application. Lehtinen said: It’s of course possible that of these 160 most of them have continued to another country, but they haven’t yet applied for asylum in that country. Every asylum seeker in Finland has their fingerprint taken to the Eurodac-system, Europe’s shared fingerprint database, Lehtinen added. Under EU rules, the EU country where a migrant first applies for asylum is responsible for processing the application. Earlier in January, Finland extended the closure of its border with Russia until 11 February, saying it was likely that the inflow of asylum seekers would restart if the border opened. In response to the situation at the eastern border, Finnish president Sauli Niinisto called last year for an EU-wide solution to stop uncontrollable entry to Europe’s passport-free Schengen area. On Thursday, a coast guard unit of the Finnish Border Guard said it was investigating several cases of “assisting illegal immigration” related to the eastern border, suspecting criminal organisations of large-scale human smuggling. “Smuggling activities have taken advantage of the border security disruptions on the eastern border,” the coast guard said in a statement.\n19 Jan 2024 12.32 CET Kyiv says attack on Russian oil depot in Klinsty part of 'fair' retaliation for Moscow strikes on Ukraine infrastructure Ukraine said it was behind a drone strike that sparked a huge inferno at an oil depot in western Russia on Friday, the latest in a series of escalating cross-border attacks. The strike is the second on a Russian oil depot in as many days, part of what Kyiv has called “fair” retaliation for Moscow’s strikes on Ukrainian energy infrastructure. Friday’s strike targeted a Rosneft oil storage facility about 50 kilometres (30 miles) from the Ukrainian border, in the Russian town of Klintsy, officials said. It was carried out by the Main Intelligence Directorate of the Ukrainian Ministry of Defence, a Ukrainian security source confirmed to AFP, without elaborating. Videos showed a huge fireball tearing through the oil depot’s storage tanks, while a cloud of black smoke billowed over the town of some 60,000 inhabitants. Regional governor Alexander Bogomaz said: Four oil tanks are burning in Klintsy. For safety reasons 32 residents of the private sector were temporarily evacuated to relatives. A temporary accommodation centre has been prepared. There were no casualties, but 13 fire trucks were deployed to battle the blaze, Bogomaz announced earlier. The fire started after a drone dropped “munitions” on the depot, he said but claimed the drone had been intercepted. Two other drones targeting the region were shot down by air defences.\nUpdated at 12.41 CET\n19 Jan 2024 12.13 CET Nato will launch its biggest military exercises in decades next week with about 90,000 personnel set to take part in months of drills aimed at showing the alliance can defend all of its territory up to its border with Russia, top officers said Thursday. The exercises come as Russia’s war on Ukraine bogs down. Nato as an Organization is not directly involved in the conflict, except to supply Kyiv with non-lethal support, although many member countries send weapons and ammunition individually or in groups, and provide military training. In the months before president Vladimir Putin ordered Russian troops into Ukraine in February 2022, Nato began beefing up security on its eastern flank with Russia and Ukraine. It’s the alliance’s biggest buildup since the cold war. The war games are meant to deter Russia from targeting a member country. The exercises – dubbed Steadfast Defender 24 – “will show that Nato can conduct and sustain complex multi-domain operations over several months, across thousands of kilometres (miles), from the High North to Central and eastern Europe, and in any condition,” the 31-nation Organisation said, according to AP. Troops will be moving to and through Europe until the end of May in what Nato describes as “a simulated emerging conflict scenario with a near-peer adversary.” Under Nato’s new defense plans, its chief adversaries are Russia and terrorist organisations. “The alliance will demonstrate its ability to reinforce the Euro-Atlantic area via transatlantic movement of forces from North America,” Nato’s Supreme Allied Commander, US Gen Christopher Cavoli, told reporters. Cavoli said it will demonstrate “our unity, our strength, and our determination to protect each other.” The chair of the Nato Military Committee, Adm Rob Bauer, said that it’s “a record number of troops that we can bring to bear and have an exercise within that size, across the alliance, across the ocean from the US to Europe.” Bauer described it as “a big change” compared to troop numbers exercising just a year ago. Sweden, which is expected to join Nato this year, will also take part. UK Defence Secretary Grant Shapps has said that the government in London would send 20,000 troops backed by advanced fighter jets, surveillance planes, warships and submarines, with many being deployed in eastern Europe from February to June.\nUpdated at 16.54 CET\n19 Jan 2024 11.53 CET The Kremlin on Friday said there was no prospect of reviving the Black Sea grain deal and that alternative routes for shipping Ukrainian grain carried huge risks, Reuters reports. The original deal, which facilitated safe grain exports from Ukraine via the Black Sea, expired last year after Moscow refused to renew it, saying its interests had been ignored.\n19 Jan 2024 11.38 CET Police in the central Russian republic of Bashkortostan on Friday arrested more protesters incensed over the jailing of a popular activist as a court sentenced nine demonstrators to short jail terms, reports AFP. Thousands have taken to the streets of the small town of Baymak in freezing temperatures this week, clashing with riot police in a rare display of public outrage. They are supporting Fail Alsynov, a local activist who campaigns for the protection of the Bashkir language and was sentenced to four years in prison on Wednesday for “inciting hatred.” Alsynov had publicly criticised Moscow’s mobilisation drive for the offensive in Ukraine launched nearly two years ago and also opposes mining in the region on environmental grounds. Videos on social media showed police arresting protesters at a small rally in the regional capital of Ufa on Friday. Hundreds of protesters clash with police in Russian republic of Bashkortostan Read more\n19 Jan 2024 11.25 CET Australia is being criticised this morning for allowing itself to drop from being the biggest non-Nato contributor of help to Ukraine, to sixth on that list. Specifically, a storm has blown up around the government’s refusal to hand over a fleet of European-designed NH90-type army helicopters to Ukraine, having retired them from service after a troubled history. The NH90 was assembled in Australia as the MRH90 Taipan. The government in Canberra has decided not to send its unwanted Taipans, preferring to strip them for spare parts before burying them. The co-chair of the Australian Federation Ukrainian Organisations, Stefan Romaniw, on Friday called on the government to reverse its decision. “[The helicopters] would significantly boost Ukraine’s air power, which will help defend freedom and democracy and save lives,” he said. “[But] Australia now risks simply standing by instead of standing up for what’s right.” Australia’s defence industry minister, Pat Conroy, defended the decision. He said none of the aircraft were in flying condition, the fleet had been grounded for three months before Ukraine made its request, and repairs would have required a significant investment in time, resources and taxpayer funds. Safety questions also remained after a Taipan crash claimed the lives of four Australian defence personnel in July, he said – although the safety issue has been disputed by former military officers. The Australian government has previously been criticised for refusing to donate its retired, mothballed fleet of F/A-18 Hornet fighter jets to Ukraine – a plane that is considered more rugged than the F-16 fighters Ukraine will soon receive. Retired Maj Gen Fergus McLachlan agreed the cost of making the Taipan helicopters airworthy would be prohibitive, but he said the government had acted “in a fair bit of haste”. “This is over a billion dollars worth of our tax money in a capability that, while it disappointed, was not an unsafe aircraft,” he told ABC radio. He said they were “very capable helicopters”, with at least 12 countries still flying them, though he would not recommend them for the Ukrainian effort. “All of the user nations in Nato are affluent nations with all of the resources needed to maintain and operate a complex helicopter, [but they] struggle to get this aircraft in the air reliably,” he said. “For an army at war, who needs high availability, high reliability, in my opinion, this is not the aircraft that they needed.” But Romaniw said the 45 Taipans could have replaced the Ukrainian helicopters that had gone missing since the start of Russia’s offensive. “Words won’t help us win this war,” he said. The Australian government has provided $910m worth of support to Ukraine, including $730m of military assistance.\n19 Jan 2024 10.52 CET A Russian official says a Ukrainian drone has struck an oil storage depot in western Russia, causing a massive fire. Russian officials and news reports said four oil reservoirs with a total capacity of 6,000 cubic meters (1.6m gallons) were set on fire Friday after the drone reached Klintsy, a city of 70,000 people located about 60 kilometres (40 miles) from the Ukrainian border. Ukraine has recently intensified its efforts to unnerve Russians and undermine president Vladimir Putin’s claims that life in Russia is going on as normal before its 17 March presidential election.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Kyiv says attack on Russian oil depot in Klinsty ‘fair’ retaliation for Moscow strikes on Ukraine infrastructure - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/19/russia-ukraine-war-live-putin-victory-would-not-end-well-for-europe-lithuanias-foreign-minister-says"}