{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:17:08", "date_modify": "None", "date_publish": "2024-01-19 20:50:23", "description": "President Joe Biden 'still believes' in a two-state solution between Israel and the Palestinians, the White House said Friday after Benjamin Netanyahu appeared to reject the idea in Thursday comments.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12984709%2FBiden-doubles-wanting-Palestinian-state-President-bucks-Bibis-desire-Israel-control-territory-west-Jordan-speak-time-months.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/19/20/80237731-0-image-a-10_1705697394419.jpg", "language": "en", "localpath": null, "maintext": "The White House on Friday reaffirmed President Biden's belief in a two-state solution after Israeli Prime Minister's language rejecting the idea.\nWhite President Joe Biden spoke by phone with Israeli Prime Minister Benjamin Netanyahu Friday. It was their first call in a month, amid Israel's war on Hamas with backing by the U.S., amid a series of public and private calls for Israeli forces to be mindful of civilian casualties and refocus operations.\nThe call came after Netanyahu rejected calls for a two-state solution with the Palestinians that are a central Biden administration policy.\nWhite House national security spokesman John Kirby reaffirmed Biden's continued belief in a two-state solution, amid discussions about governance of Gaza after Israel's war against Hamas following the brutal October 7 attacks inside Israel.\n'It’s not going to change president Biden’s mind one bit, he still believes in it,' Kirby said.\n'They also still both believe in the importance of getting these hostages home to their families. And that's why we're continuing to work at this,' he continued.\nHe was asked about Netanyahu's comments echoing the controversial Palestinian chant 'from the River to the sea,' which some consider a call to wipe Israel off the map.\nNational Security Council Coordinator for Strategic Communications John Kirby restated President Biden's support for a two-state solution after Israeli Prime Minister Benjamin Netanyahu's comments that appeared to reject the idea\n'There's a there's a connotation with that phrase ... But when when you use the phrase \"River to the sea,\" it speaks basically to the mantra of Hamas and in their manifesto where they basically describe the geographic bounds of what they believe to be Palestine. And if you look at it on the map, if you go look at the four corners that they describe it, it's basically the State of Israel. They just don't believe it should exist,' Kirby said.\n'It's not a phrase that that we recommend using because of that context,' he said.\nWhen a reporter reminded him it was Netanyahu who used a variation of the phrase this time, he responded: 'I understand, I don't have anything more on that. And I certainly don't have anything more in the conversation to read out with respect to that.'\nKirby spoke after Netanyahu during a Thursday news conference said that 'In any future arrangement ... Israel needs security control over all territory west of Jordan. This clashes with the idea of (Palestinian) sovereignty. What can you do?'\nNetanyahu continued: 'This conflict is not about the absence of a (Palestinian) state but about the existence of a state, the Jewish state.\n'Israel needs security control over all territory west of Jordan,' said Israeli Prime Minister Benjamin Netanyahu\nSmoke rises over the residential areas following the Israeli attacks on Khan Yunis, Gaza on January 19, 2024\nPresident Biden and Netanyahu spoke Friday for the first time in a month\nKirby also called reports that Israeli Defense Forces killed a Palestinian American in the West Bank 'deeply concerning.'\n'We are seriously concerned about these reports,' White House national security spokesman John Kirby said Friday when asked about Israeli media reports of the shooting. He said information was 'scant at this time.'\nThe measured approach from the White House comes amid fury among some congressional Democrats about Netanyahu's comments.\n'I think people are at the end of their ropes with the Netanyahu coalition … which includes pretty right-wing extremists,' Maryland Democratic Sen. Chris Van Hollen told Politico. 'It’s pretty clear that Netanyahu is listening much more to the extremists in his government than the president of the United States and the Biden administration,' he said.\nU.S. Secretary of State Antony Blinken said in Davos this week Israel can only gain 'genuine security' if there is a pathway to a Palestinian state.\nA White House readout of the call indicated that President Biden spoke about the fraught topic, but is silent on what Netanyahu may have said.\n'The President also discussed his vision for a more durable peace and security for Israel fully integrated within the region and a two state-solution with Israel’s security guaranteed,' according to the readout provided by the White House.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden doubles down on wanting a Palestinian state: President bucks Bibi's desire for Israel to control 'all territory west of Jordan' as they speak for the first time in months", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12984709/Biden-doubles-wanting-Palestinian-state-President-bucks-Bibis-desire-Israel-control-territory-west-Jordan-speak-time-months.html?ns_mchannel=rssns_campaign=1490ito=1490"}