{"authors": [], "date_download": "2024-02-05 15:17:10", "date_modify": "None", "date_publish": "2024-01-19 21:07:42", "description": "Statement from Germany’s defence minister, Boris Pistorius, comes after top Nato commander warns of possible all-out war with Moscow within the next 20 years", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fnato-war-with-russia-admiral-bauer-b2481278.html.json", "image_url": "https://static.independent.co.uk/2024/01/19/12/newFile-3.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nVladimir Putin could launch an attack on Nato in the next five to eight years, Germany’s defence minister has said – with one top officer within the alliance even calling on nations to be ready for an all-out war with Moscow within two decades.\nWith the Russian president’s rhetoric towards Nato nations becoming increasingly hostile, conflict could come at any time.\n“We hear threats from the Kremlin almost every day ... so we have to take into account that Vladimir Putin might even attack a Nato country one day,” Boris Pistorius said.\nWhile a Russian attack is not likely “for now”, the minister told German outlet Der Tagesspiegel, he added: “Our experts expect a period of five to eight years in which this could be possible.”\nOn Thursday, top Nato military commander Admiral Rob Bauer said private citizens need to be ready for a possible conflict within 20 years.\n“We have to realise it’s not a given that we are in peace. And that’s why [Nato forces] are preparing for a conflict with Russia,” Admiral Bauer, a Dutch naval officer who chairs the Nato Military Committee, said. He warned that a large number of civilians will have to be mobilised if a wider war breaks out in Europe and the process of recruiting much larger reserve forces should be put in place by governments now.\n“The discussion is much wider... people that have to understand they play a role... The realisation that not everything is plannable and not everything is going to be hunky dory in the next 20 years.”\nUkrainian soldiers on the eastern frontline against Russia’s forces (AP)\nAdmiral Bauer was speaking after a committee meeting in Brussels. It comes with Nato set to launch its biggest military exercises in decades next week. Around 90,000 personnel are set to take part in months of drills aimed at showing the alliance can defend all of its territories up to the Russian border.\nThe admiral praised Sweden for asking all of its citizens to brace for war ahead of the country formally joining the alliance. Stockholm’s move, announced earlier this month, has led to a surge in volunteers for the country’s civil defence organisation and a spike in sales of torches and battery-powered radios.\nCarl-Oskar Bohlin, Sweden’s minister for civil defence, had told a security conference that “war could come to Sweden”. The commander-in-chief, Micael Bydén, then warned the same gathering that “Russia’s war against Ukraine is just a step, not an end game”.\n“We need to realise how serious the situation really is, and that everyone, individually, need to prepare themselves mentally,” he said. Opposition politicians accused the government of seeking to play up the threat of war for political gain.\nIn his interview with Der Tagesspiegel, Mr Pistorius said the Swedish warnings were “understandable from a Scandinavian perspective”, adding that Sweden faced “an even more serious situation”, given how close it is to Russia. Stockholm has applied to join Nato but is waiting for approval from Turkey and Hungary to join. Finland was approved last year.\n“We also have to learn to live with danger again and prepare ourselves – militarily, socially and in terms of civil defence,” Mr Pistorius warned.\nStockpiles of weapons and ammunition have been drained across Europe, the US and beyond in supporting the defence of Ukraine, and will take years to replenish at the current rate of production.\n“We need to be readier across the whole spectrum,” Admiral Bauer said. “You have to have a system in place to find more people if it comes to war, whether it does or not. Then you talk mobilisation, reservists or conscription.\n“You need to be able to fall back on an industrial base that is able to produce weapons and ammunition fast enough to be able to continue a conflict if you are in it.”\nThe Nato exercises next week – dubbed Steadfast Defender 24 – “will show that Nato can conduct and sustain complex multi-domain operations over several months, across thousands of kilometres, from the high north to central and eastern Europe, and in any condition,” a statement from the 31-member organisation said.\nTroops will be moving to and through Europe until the end of May in what is described as “a simulated emerging conflict scenario with a near-peer adversary” – essentially Russia.\n“The alliance will demonstrate its ability to reinforce the Euro-Atlantic area via transatlantic movement of forces from North America,” Nato’s supreme allied commander, US General Christopher Cavoli, said earlier this week. General Cavoli said it will demonstrate “our unity, our strength, and our determination to protect each other”.\nBritain’s defence secretary, Grant Shapps, has said that the UK will send 20,000 troops backed by advanced fighter jets, surveillance planes, warships and submarines, to take part in the exercises – with many being deployed in eastern Europe from February to June.\nA day earlier, Admiral Bauer said the alliance needed a “warfighting transformation” and asked the public and private actors in the West to gear up for an era in which anything could happen at any time, including fighting a war.\nNato governments and companies should adjust their thinking to “an era in which anything can happen at any time, an era in which we need to expect the unexpected, an era in which we need to focus on effectiveness in order to be fully effective”, he said.\nAdmiral Bauer also pledged the alliance’s backing for Ukraine and said that the nation facing a Russian invasion “will have our support for every day that is to come, because the outcome of this war will determine the fate of the world”.\nNato as an organisation is not directly involved in the conflict, except to supply Kyiv with non-lethal support, although many member countries send weapons and ammunition individually or in groups, and provide military training.", "source_domain": "www.independent.co.uk", "text": null, "title": "Germany warns Putin could launch attack on Nato in less than a decade", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/nato-war-with-russia-admiral-bauer-b2481278.html"}