{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:17:10", "date_modify": "None", "date_publish": "2024-01-19 17:18:58", "description": "Gadi Eisenkot launches blistering attack on Netanyahu’s campaign, saying ‘total victory’ over Hamas is unlikely", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F19%2Fisraeli-minister-says-only-ceasefire-can-free-hostages-as-cabinet-rift-deepens.json", "image_url": "https://i.guim.co.uk/img/media/3d8b3af7a8145272e8703f395eed70df5aa689d9/0_53_2687_1612/master/2687.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e93201801c4b4b0da18ff8749bc972b7", "language": "en", "localpath": null, "maintext": "A senior minister in the Israeli war cabinet has said that only a ceasefire deal can win the release of Israeli hostages held by Hamas in Gaza, and that Israel is unlikely to achieve its aim of “total victory” over the militant Islamist group.\nGadi Eisenkot, a former chief of staff of the Israel Defense Forces, launched a blistering attack on the prime minister, Benjamin Netanyahu’s handling of the campaign against Hamas and failure to take responsibility for the failures that led to the bloody attack into Israel in October that triggered the current conflict.\nWith Israeli military casualties approaching 200, rockets fired by Hamas continuing to fall on Israel and a bitter rift with Washington increasingly evident, concern is mounting in Israel at the apparent lack of progress towards the “total victory” that Netanyahu has said is the aim of the campaign.\nNetanyahu invited Eisenkot, a political opponent, to be part of a five-man war cabinet formed shortly after the attacks, in which 1,200 Israelis died, mostly civilians. A second former general and political rival, Benny Gantz, the leader of National Unity, also joined.\nEisenkot, whose 25-year-old son was killed in December while fighting in Gaza, told the investigative programme Uvda on Israel’s Channel 12 television channel that “the hostages will only return alive if there is a deal, linked to a significant pause in fighting”.\nHe said dramatic rescue operations like the famous raid that freed more than 200 Israelis held at Entebbe airport in Uganda in 1976 were unlikely because the hostages were apparently spread out, many of them in underground tunnels.\nClaiming hostages could be freed by means other than a deal “is to spread illusions”, he said.\nIn a thinly veiled criticism of Netanyahu, Eisenkot said strategic decisions about the war’s direction must be made urgently, and that a discussion about an endgame should have begun immediately after the war began.\nThe former general also dismissed suggestions that the military had delivered a decisive blow against Hamas. “Whoever speaks of absolute defeat [of Hamas] is not speaking the truth,” Eisenkot said in the interview. “That is why we should not tell stories … Today, the situation already in the Gaza Strip is such that the goals of the war have not yet been achieved.”\nEisenkot’s comments late on Thursday were the latest sign of deep disagreement among political and military leaders over the direction of Israel’s offensive on Hamas.\nThe Israeli assault has destroyed much of the Gaza Strip, displacing more than three-quarters of its 2.3 million people and killing 25,000, mostly civilians, according to Palestinian officials.\nCentral to the disputes inside the war cabinet is the question of how to free the more than 130 hostages who remain in Gaza. Not all of them are believed to be alive and there is a growing sense in Israel that time is running out.\nThe arguments are mirrored in wider Israeli society.\nLilach Shoval in Israel Hayom, a rightwing newspaper, wrote: “Fifteen weeks have elapsed since Hamas forced this war on Israel on that Black Saturday of October 7, and Israel remains far from achieving the goals it set for itself: toppling Hamas’s military and governing ability, and returning the captives, not necessarily in that order.” Others have described a “quagmire”.\nMairav Zonszein, an Israel analyst with the International Crisis Group, said: “There is no lack of support for the war but it is increasingly clear that the release of the hostages is in conflict with other goals.”\nA poll published in Ma’ariv newspaper found that if elections were held now, Netanyahu’s Likud party would be reduced to 16 of the 120 seats in the national assembly, the Knesset.\nThe US, Israel’s closest ally, has provided strong military and political support for the campaign, but has been increasingly calling on Israel to scale back its assault and accept the establishment of a Palestinian state after the war, a suggestion Netanyahu has soundly rejected.\nSpeaking during a nationally televised news conference Thursday, Netanyahu said that a Palestinian state would become a launchpad for attacks on Israel – an argument that is popular in Israel.\nIsrael “must have security control over the entire territory west of the Jordan River”, Netanyahu said, adding: “That collides with the idea of sovereignty. What can we do?”\nThe US has said the internationally recognised Palestinian Authority, which governs semi-autonomous zones in the Israeli-occupied West Bank, should be “revitalised” and return to Gaza. Hamas ousted the authority from Gaza in 2007.\nNetanyahu’s opponents accuse him of delaying any discussion of postwar scenarios in order to avoid looming investigations of governmental failures, keep his coalition intact and put off elections.\nWhen asked if Netanyahu might be prolonging the war for political gain, Eisenkot paused before answering: “I hope not.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli minister says only ceasefire can free hostages, as cabinet rift deepens", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/19/israeli-minister-says-only-ceasefire-can-free-hostages-as-cabinet-rift-deepens"}