{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:17:13", "date_modify": "None", "date_publish": "2024-01-18 15:27:56", "description": "The alliance announced the exercise would begin next week, and will test allies' ability over months to engage in a conflict with an adversary as capable as Russia.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12979205%2Fnato-prepares-vladimir-putin-thousands-largest-military-exercise.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/18/15/80180735-0-image-m-10_1705591671339.jpg", "language": "en", "localpath": null, "maintext": "NATO is planning to mobilise 90,000 troops in its largest military manoeuvre since the Cold War in a bid to deter Vladimir Putin.\nThe alliance announced the exercise would begin next week, and will test allies' ability over months to engage in a conflict with an adversary as capable as Russia.\n'Steadfast Defender' will run until late May and involve units from all 31 NATO member countries plus candidate-member Sweden, NATO's Supreme Allied Commander Europe, US General Christopher Cavoli, told journalists.\nThe wargames are meant as a fresh show of strength from NATO and its commitment to defend all allied nations from attack.\n'The Alliance will demonstrate its ability to reinforce the Euro-Atlantic area by a transatlantic movement of forces from North America,' the US general told reporters in Brussels after a two-day meeting of national chiefs of defence.\nNATO is planning to mobilise 90,000 troops in its largest military maneuver since the Cold War in a bid to deter Vladimir Putin. Pictured: British soldiers take part in a major drill as part of the EFP NATO operation at the Tapa estonian army camp near Rakvere, on February 6, 2022\nIt was announced last week the UK would be sending 20,000 troops with the Royal Navy's two new aircraft carriers, eight warships, as well as the RAF's F-35 lightning attack aircraft, which will practice flying in imitated conflict scenarios.\nUK Defense Secretary Grant Shapps announced the deployment on Monday.\nThe war games come after UK ministers announced a further £2.5billion support package to Ukraine and the RAF airstrikes, with the US, on the Houthis in Yemen.\nAccording to German newspaper Bild, Germany will send 12,000 soldiers along with 3,000 vehicles and 30 aircraft.\nCiting the German Press Agency, Bild said the exercise will simulate a Russian attack on NATO territory, a scenario which would trigger Article 5. The article states that if any NATO country is attacked, all other alliance countries will mobilise to defend it.\nEarlier this week, at a meeting of the 31-nation alliance's top brass in Brussels, the chair of the NATO Military Committee, Admiral Bob Bauer, also said that behind Russian president Putin's rationale for the war is a fear of democracy.\nBauer said NATO would continue to support Ukraine long-term.\n'Today is the 693rd day of what Russia thought would be a three-day war. Ukraine will have our support for every day that is to come because the outcome of this war will determine the fate of the world,' he said.\n'This war has never been about any real security threat to Russia coming from either Ukraine or NATO,' Bauer added.\n'This war is about Russia fearing something much more powerful than any physical weapon on earth - democracy. If people in Ukraine can have democratic rights, then people in Russia will soon crave them too.'\nThe largest NATO exercise since the cold war took place in 2018 when around 51,000 troops were involved in 'Trident Juncture 2018' in Norway.\nGermany is preparing for Vladimir Putin 's forces to attack NATO in 2025, according to leaked secret plans\nAnnouncement of the NATO exercise comes after it was revealed that Germany is preparing for Putin's forces to attack NATO in 2025.\nSecret documents from the German Ministry of Defence reveal a step-by-step doomsday guide on how Russia will escalate the conflict in Ukraine to an all-out war in just 18 months.\nThe leaked plans, published by Bild, reveal in detail the path to a Third World War with Putin using Belarus as a launching pad for an invasion - as he did in February 2022 for his war in Ukraine.\nThe release of the terrifying documents come just days after Sweden's civil defence minister warned that his country could soon face the prospect of war and urged citizens to join voluntary defence organisations in preparation for a Russian attack.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "NATO prepares for Putin: 90,000 troops are called up for alliance's largest military exercise for decades that will run for four months", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12979205/nato-prepares-vladimir-putin-thousands-largest-military-exercise.html?ns_mchannel=rssns_campaign=1490ito=1490"}