{"authors": ["Stephanie Kirchgaessner"], "date_download": "2024-02-05 15:17:14", "date_modify": "None", "date_publish": "2024-01-18 11:00:35", "description": "Revealed: review of internal state department documents shows special mechanisms have been used to shield Israel from US human rights laws", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F18%2Fus-supply-weapons-israel-alleged-abuses-human-rights.json", "image_url": "https://i.guim.co.uk/img/media/a4a9acdb61531815cbbb140bd059bdfe91f90550/0_0_2999_1800/master/2999.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a8cadb64c5d09630a3e09fb3872a676d", "language": "en", "localpath": null, "maintext": "Top US officials quietly reviewed more than a dozen incidents of alleged gross violations of human rights by Israeli security forces since 2020, but have gone to great lengths to preserve continued access to US weapons for the units responsible for the alleged violations, contributing – former US officials say – to the sense of impunity with which Israel has approached its war in Gaza.\nAn estimated 24,000 Palestinians, mostly women and children, have been killed by Israeli forces since Hamas’s 7 October attack on Israel, a death toll that has spurred condemnation of the Israeli prime minister, Benjamin Netanyahu, and the US president, Joe Biden, who has been criticized for failing to rein in Israel’s “indiscriminate” bombing of Gaza.\nAn investigation by the Guardian, which was based on a review of internal state department documents and interviews with people familiar with sensitive internal deliberations, reveals how special mechanisms have been used over the last few years to shield Israel from US human rights laws, even as other allies’ military units who receive US support – including, sources say, Ukraine – have privately been sanctioned and faced consequences for committing human rights violations.\nView image in fullscreen Palestinians mourn the death of relatives who were killed in an Israeli bombing on a house in Rafah on 10 January. Photograph: Ismael Mohamad/UPI/Rex/Shutterstock\nState department officials have in effect been able to circumvent the US law that is meant to prevent US complicity in human rights violations by foreign military units – the 1990s-era Leahy law, named after the now retired Vermont senator Patrick Leahy – because, former officials say, extraordinary internal state department policies have been put in place that show extreme deference to the Israeli government. No such special arrangements exist for any other US ally.\nThe lack of enforcement of the Leahy law in Israel appears especially troubling to its namesake. In a statement to the Guardian, the former Vermont senator said the purpose of the Leahy law was to shield the US from culpability for gross violations of human rights by foreign security forces that receive US aid and deter future violations.\n“But the law has not been applied consistently, and what we have seen in the West Bank and Gaza is a stark example of that. Over many years I urged successive US administrations to apply the law there, but it has not happened,” Leahy said.\nAmong the incidents that have been reviewed since 2020 were the killing of Shireen Abu Akleh, the Palestinian-American journalist who was shot by Israeli forces in May 2022; the death of Omar Assad, a 78-year-old Palestinian-American, who died in January 2022 after being held in Israeli custody; and the alleged extrajudicial killing of Ahmad Abdu, a 25-year-old who was shot at dawn by Israeli forces in May 2021 while sitting in his car.\nView image in fullscreen A mural of slain of Al Jazeera journalist Shireen Abu Akleh, who was shot dead during an Israeli military raid in the West Bank town of Jenin, adorns a wall in Gaza City on 15 May 2022. Photograph: Adel Hana/AP\nA report in Haaretz describes how, after opening fire on the car, Israeli troops pulled Abdu out, dragged him a few meters down the road, then left his bloody body in the road and departed.\nIn the review into Abdu’s death, which reports suggest may have been a case of mistaken identity, internal state department documents note that Israel declined to respond to questions by state department officials about the shooting.\nIn Omar Assad’s case, the Israeli military said last June it was not bringing criminal charges against soldiers who were involved in his death, even after he was alleged to have been dragged from a car, bound and blindfolded after being stopped at a checkpoint. The army said the soldiers would not face prosecution because their actions could not directly be linked to Assad’s death from cardiac arrest, the Associated Press reported. Assad, a US citizen, had spent about 40 years in the midwest before retiring home to the West Bank in 2009.\nView image in fullscreen People mourn during the funeral of Omar Assad, in the occupied West Bank on 13 January 2022. Photograph: Jaafar Ashtiyeh/AFP via Getty Images\nInternal state department documents show that the incidents were reviewed under a little-known process established by the state department in 2020 known as the Israel Leahy Vetting Forum (ILVF), in which representatives from relevant state department bureaus examine reports of alleged human rights violations by Israeli forces.\nUnder the Leahy law, for most countries and in most cases, a foreign military unit is granted US military assistance or training after it is vetted by the state department for any reported human rights violations. The law prohibits the Department of State and the Department of Defense from providing funds, assistance or training to foreign security force units where there is “credible information” that the forces have committed a gross violation of human rights.\nIn the case of at least three countries – Israel, Ukraine and Egypt – the scale of foreign assistance is so great that US military assistance can be difficult to track, and the US often has no knowledge of where specific weapons end up or how they are used.\nView image in fullscreen Senator Patrick Leahy during a hearing on Capitol hill in Washington in March 2022. Photograph: Kent Nishimura/LA Times via Getty Images\nTo close what was seen as a loophole in the law, Congress updated the process in 2019, by putting a system in place that prohibits the foreign government from providing US assistance to any unit of its security forces that the US identifies as being ineligible under the Leahy law due to a gross violation of human rights. The state department set up working groups to examine those countries where military assistance is considered “untraceable”.\nBut people familiar with the process who spoke on the condition of anonymity, said Israel had benefited from extraordinary policies inside the ILVF, details of which have not previously been reported.\n“Nobody said it but everyone knew the rules were different for Israel. No one will ever admit that, but it’s the truth,” said one former state department official.\nFirst, under the Israel process, all of the parties involved in an ILVF review must reach a consensus that a potential violation has occurred, and must then be approved by the deputy secretary of state, according to three people familiar with internal deliberations. In theory, a single bureau could raise a potential violation to the deputy secretary of state level as part of a “split memo”, in which other bureaus would air their disagreement, but no such thing has occurred. Among the groups that are involved in the process are the bureau of near eastern affairs, the bureau of democracy, human rights and labor, the bureau of political-military affairs and the US embassy in Jerusalem.\nView image in fullscreen A dog walks near Israeli battle tanks deployed at a position along the border with the Gaza Strip. Photograph: Jack Guez/AFP/Getty Images\nFor other countries, former officials said, such a Leahy law determination is made by state department staff, does not require the consensus of all parties, and would not require notification of and approval by the secretary of state or deputy.\nSecond, Israel must be consulted about alleged human rights violations that are under review and has 90 days to respond to claims, creating what some former officials said were significant delays. No other country’s government must be consulted under state department procedures, former officials said.\n“Part of the reason why the ILVF has never worked is that the process is so gummed up with delay mechanisms that exist for no other country,” the former state department official said.\nA state department spokesperson said details of internal department deliberations could not be discussed, but that there was “no requirement that consensus among ILVF participants be reached in order to move forward with an assessment under the Leahy law”.\n“The department conducts Leahy vetting consistent with the law in the case of all countries receiving applicable assistance, including Israel,” the spokesperson added.\nIn response to questions about why consultation with Israel was considered part of the state department’s standard practice in all Israel Leahy vetting cases, the spokesperson said the department “routinely consults foreign governments on Leahy vetting matters, not just Israel”.\n‘A broad impunity’\nSome experts see a connection between the US’s hands-off approach to Israel on human rights violations and Israel’s conduct in the war in Gaza. Israel receives $3.8bn in military assistance annually and the Biden administration twice bypassed Congress last month to deliver an additional $250m in weapons. Progressive Democrats led by Bernie Sanders, the independent Vermont senator, have called on aid to Israel being conditioned on the US investigating potential human rights violations by Israel in its war in Gaza.\n“I think Israel feels a broad impunity when it comes to consequences within the US for its actions,” said Josh Paul, a former state department official who has emerged as a vocal critic of the Biden administration policies on Israel. “We may say that Israel should abide by international humanitarian law. We may say that it should not expand settlements. But when it comes to actual consequences, there aren’t any and I think that has given Israel at senior government levels the sense that it is immune.”\nView image in fullscreen Former state department official Josh Paul speaks at a rally calling for a ceasefire outside the White House in December. Photograph: Brendan Smialowski/AFP/Getty Images\nPaul also sees the lack of Leahy law enforcement having an effect on how Israeli units are conducting themselves. By not pressing Israel on Leahy violations and not designating individual Israeli units as gross violators of human rights, Paul said the US has enabled a culture of impunity at the unit level, which he said “we see on the ground in Gaza today” in the actions of some Israeli soldiers, including videos that have circulated showing Israeli soldiers ransacking private homes in Gaza, destroying civilian property and using racist language.\nNowhere is the US’s double standard on Israel more apparent than in a 2021 agreement that was signed by a senior state department official, Jessica Lewis, who serves as assistant secretary for political affairs, and the Israel ambassador to the US, Michael Herzog.\nThe two-page 2021 agreement, which has received little media attention, formalized changes in the Leahy law and included a statement about how Israel has a “robust, independent and effective legal system, including its military justice system”. The US signed more than two dozen similar agreements with other countries at that time – including Greece, Jordan, Georgia, Ukraine and Latvia – but none contain language endorsing the other countries’ military justice systems.\nView image in fullscreen Jessica Lewis appears before the Senate foreign relations committee in Washington in September. Photograph: Rod Lamkey/CNP/Abaca Press via Alamy\nFormer officials who spoke to the Guardian said they did not know how the language came to be included in the US-Israel agreement, but speculated it was probably added by Israel.\nThe Guardian requested a comment on the matter from the Israeli embassy in Washington, including on the provenance of the statement contained in the agreement, but did not receive a response.\nTim Rieser, a longtime senior adviser to Leahy, who helped write the Leahy law in the 1990s, said the inclusion of the language was probably intended to help Israel avoid scrutiny under the Leahy law, because it suggests as a matter of fact that Israel’s military justice system is independent enough to address any alleged human rights violations.\n“The language added to the US-Israel agreement, without any consultation with Congress, is factually inaccurate and wrongly suggests that the [Leahy] Law doesn’t need to be applied,” Rieser said.\nFew organizations have been as critical of Israel’s military justice system than B’Tselem, an Israeli human rights group.\n“The military law enforcement system is used by Israel as a whitewash mechanism whose purpose is to block any criticism of Israel’s and the army’s policies in the territories. The percentage of convictions of soldiers is close to zero, even for the most serious violations,” said Dror Sadot, B’Tselem spokesperson.\nView image in fullscreen B’Tselem billboards in the West Bank saying ‘Mr President, this is apartheid’ ahead of Joe Biden’s arrival in the region in 2022. Photograph: Mahmoud Illean/AP\nPaul, the former state department official who resigned from his post in protest against the Biden administration’s “blind support for one side”, said he had long argued internally that the US ought not to consider Israel’s military justice system as a “responsible functional justice system” when it comes to abuses.\n“I think the track record is really one of slaps on the wrist, temporary demotions, and short-term suspensions even for really serious violations,” said Paul.\nPaul told the Guardian “numerous people”, including himself, raised concerns over the years inside the state department that the Leahy process “is not working” and that gross violations of human rights were occurring “without accountability”. Indeed, no Israeli unit has ever gotten to the point of being sanctioned under the Leahy law even though credible allegations of gross human rights violations exist.\nPaul declined to name former colleagues and did not want to discuss specific cases that were reviewed by the forum, but said that typically, staff concerns about Israeli human rights violations were ultimately “killed” at what he described as the front office level or bureau leadership-level within several of the bureaus involved in the forum, including the Bureau of Human Rights (DRL).\nOther cases that were reviewed by the ILVF, but where US officials ultimately declined to reach consensus and take action include: the killing of Sanad Salem al-Harbad, a Bedouin man who was allegedly shot twice in the back by Israeli police in March 2022; the killing of Ahmad Jamil Fahd, who was allegedly shot by police and left to bleed to death by a unit of undercover Israeli agents; the alleged assault in Israeli police custody of journalist Givara Budeiri; the 2020 killing of a 32-year-old unarmed autistic man Eyad al-Hallaq by Israeli police in East Jerusalem; the killing of a 15-year-old boy named Mohammed Hamayel; and the shooting of 16-year-old Palestinian Jana Kiswani.\nView image in fullscreen People hold photographs of Eyad al-Hallaq outside the district court of Jerusalem in July after the court verdict acquitting the policeman who killed al-Hallaq. Photograph: Mostafa Alkharouf/Anadolu Agency via Getty Images\nFor advocates of the Leahy law, like Rieser, the lack of accountability for the killing of Abu Akleh, the prominent Al Jazeera journalist, is particularly galling, and has been the subject of criticism by senior Democrats on Capitol Hill.\n“If the US had been willing to apply the Leahy law in Israel the IDF would presumably have been more inclined to hold their soldiers accountable, which would have helped deter killings of civilians like Shireen Abu Akleh and many others, and what we are seeing today,” Rieser said. “Or else they would have faced a cut-off of US aid, which would have been a real black mark and a thorn in US-Israel relations.”\nAbu Akleh was killed by a bullet that hit the back of her head while covering an Israeli operation in the West Bank city of Jenin. A CNN investigation found that there was no active combat or Palestinian militants near Abu Akleh in the moments before she was killed, and footage obtained by the network corroborated witness testimony that suggested Israeli forces had taken aim at the journalist.\nThe Israel Defence Forces (IDF) apologized for the killing last year but the military advocate general’s office in Israel said in a statement that it did not intend to pursue criminal charges or prosecutions of any of the soldiers involved.\nView image in fullscreen Mourners carry the coffin of the Al Jazeera journalist Shireen Abu Akleh during the funeral procession in Jerusalem. Photograph: Eyal Warshavsky/Sopa Images/LightRocket via Getty Images\nIn a July 2023 letter to the secretary of state, Antony Blinken, four Democratic senators – Chris Van Hollen, Leahy (now retired), Chris Murphy and Dick Durbin – criticized the Biden administration for not following through on earlier calls for an “independent, credible investigation”. In questions to the administration, the senators asked what, if any, steps the United States Security Coordinator (USSC), who conducted an independent forensic analysis of the bullet that killed Abu Akleh, took to try to establish who specifically shot her and why.\nEchoing statements by the IDF, the USCC released a short statement that there was “no reason to believe that this was intentional but rather the result of tragic circumstances”. The state department has declined to publicly release a report into Abu Akleh’s death by the USSC coordinator, Lt Gen Michael Fenzel. Citing a senior US official, Axios reported last year that Fenzel’s report did not include any new findings or conclusions.\nWhen the Leahy law was first passed in 1997, it was designed with Central America and Colombia in mind. The US was providing hundreds of millions of dollars in military aid to combat narco-traffickers and insurgents, but human rights groups were documenting serious human rights abuses by Colombian military and police units. While the state department does not publicly announce when it targets specific foreign units, experts say they believe it has been effective in Central America, Colombia, Nepal and other countries.\nIsrael, they say, is the outlier.\n‘A disturbing number of reports’\nRieser said there was a long history of correspondence – from the George W Bush administration through to the Biden administration – between Leahy and successive secretaries of state seeking answers to why the Leahy law was not being implemented in cases involving killings of Palestinians.\nIn a May 2002 letter to then secretary Colin Powell, who served in the Bush administration, Leahy raised concerns that the Leahy law was not being applied to the Middle East.\nIn a January 2009 letter to then secretary Condoleezza Rice, Leahy expressed incredulity that the state department was “unaware” of a single incident involving the IDF that would trigger the Leahy law.\nA month later, Leahy sent a new letter to then secretary Hillary Clinton, who was serving under the Obama administration. He attached copies of correspondence he had sent her predecessor.\nA February 2016 letter from Leahy to the then secretary of state, John Kerry, cited a “disturbing number of reports of possible gross violations of human rights by security forces in Israel and Egypt”, including “extrajudicial killings by Israeli military and police”.\nView image in fullscreen Patrick Leahy’s letters to six secretaries of state – Colin Powell, Condoleezza Rice, Hillary Clinton, John Kerry, Rex Tillerson and Mike Pompeo – about the application of the Leahy law to the IDF yielded no results. Composite: AP, Reuters, Getty Images\nAn October 2017 letter to Rex Tillerson, who served as secretary of state under Donald Trump, queried what steps the US embassy in Israel was taking to ensure the Leahy law was being applied to the IDF.\nLater, in a May 2018 letter from Leahy to the then secretary of state, Mike Pompeo, who served in the Trump administration, Leahy sought a Leahy law review of the shooting deaths of about 100 Palestinian protesters from Gaza who had been killed since March of that year. “If credible information exists to trigger the Leahy law regarding any Israeli unit and the Government of Israel is not taking effective steps to bring the individuals responsible to justice, such a unit is no longer eligible for US assistance,” Leahy wrote.\nIn a follow-up letter in September, Leahy pushed for a “clear answer”, including whether the administration had ever sought the identity of the IDF units who shot the Palestinians. In another letter, sent by Leahy in December, he questioned how many times the US embassy had presented Israel with evidence of gross violations of human rights, and how many times those individuals were barred from receiving US assistance.\nSeveral other letters from Leahy refer to gross violations of human rights by the IDF. None of the cases ever led to a unit being punished.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Different rules’: special policies keep US supplying weapons to Israel despite alleged abuses", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/18/us-supply-weapons-israel-alleged-abuses-human-rights"}