{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com", "Associated Press"], "date_download": "2024-02-05 15:17:15", "date_modify": "None", "date_publish": "2024-01-18 18:33:44", "description": "US forces conducted new strikes against Iran-backed Houthi rebels in Yemen on Thursday, according to a new report. It marked the fifth US strike on Houthi forces in the past week.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12979909%2FHouthi-Yemen-Red-Sea-airstrike-missiles.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/18/18/80191351-0-image-a-17_1705602794515.jpg", "language": "en", "localpath": null, "maintext": "US forces conducted new strikes against Iran-backed Houthi rebels in Yemen on Thursday, marking the fifth such strike since a joint US-UK bombardment a week ago.\nThe American strikes in Houthi-controlled areas of Yemen targeted and destroyed two anti-ship missiles that were loaded and prepared to launch, US Central Command said in a statement.\nCENTCOM said the missiles were 'were aimed into the Southern Red Sea and were prepared to launch' and that US forces 'determined they were an imminent threat to merchant vessels and US Navy ships in the region.'\n'US forces subsequently struck and destroyed the missiles in self-defense,' the statement added.\nSince the allied US-UK strike on January 12, Houthi forces have continued to attack vessels in the Red Sea in a show of solidarity with Hamas in Gaza, bedeviling global shipping.\nUS Navy sailors are seen in a file photo. US forces conducted new strikes against Iran-backed Houthi rebels in Yemen on Thursday\nWhite House national security spokesman John Kirby, during a briefing aboard Air Force One, said the latest strikes were similar to a round on Wednesday taking aim at Houthi missiles that were prepared to fire in the southern Red Sea.\nWednesday's strikes were launched from the Red Sea and hit 14 missiles that the command deemed an 'imminent threat.'\nPresident Joe Biden separately said Thursday that US forces would continue to strike the group, but he acknowledged that the American and British bombardment has yet to stop the militants' attacks.\n'When you say working, are they stopping the Houthis, no. Are they going to continue, yes,' Biden said.\nThe latest US strikes come one day after the US government returned the Yemen-based Houthi rebels to a list of designated terrorist groups.\nThe sanctions that come with the formal designation are meant to sever violent extremist groups from their sources of financing, while also allowing vital humanitarian aid to continue flowing to impoverished Yemenis.\nDespite sanctions and military strikes, including a large-scale operation carried out by US and British warships and warplanes that hit more than 60 targets across Yemen, the Houthis keep harassing commercial and military ships.\nThe US has strongly warned Iran to cease providing weapons to the Houthis.\nHouthi fighters and tribesmen stage a rally against the U.S. and the U.K. strikes on Sunday\nA Houthi fighter hold his rifle at a ceremony celebrating the end of his training\nA Houthi fighter is pictured standing aboard a cargo ship in the Red Sea\nFor months, the Houthis have claimed attacks on ships in the Red Sea that they say are either linked to Israel or heading to Israeli ports.\nThey say their attacks aim to end the Israeli air-and-ground offensive in the Gaza Strip that was triggered by the Palestinian militant group Hamas´ October 7 attack in southern Israel.\nHowever, the links to the ships targeted in the rebel assaults have grown more tenuous as the attacks continue.\nThe attacks have targeted commercial shipping vessels transiting through the critical Bab el-Mandeb Strait that links markets in Asia and Europe since the attack by Hamas and Israel´s subsequent war against the militant group in Gaza.\nSeparately, the US and its allies have formed Operation Prosperity Guardian to protect ship traffic, and currently warships from the United States, France and the United Kingdom are patrolling the area.\n'These strikes will continue for as long as they need to continue,' National Security Council spokesman John Kirby said Thursday, adding, 'I'm not going to telegraph punches one way or another.'\nDeveloping story, more to follow.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US forces strike two Houthi anti-ship missiles that were loaded and prepared to launch, marking the fifth round of attacks in one week", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12979909/Houthi-Yemen-Red-Sea-airstrike-missiles.html?ns_mchannel=rssns_campaign=1490ito=1490"}