{"authors": ["Adam Teicher", "Multiple Contributors", "John Keim", "Stephen Holder", "Kevin Seifert", "Paul Gutierrez", "Associate Press", "Marcel Louis-Jacques", "Nick Wagoner", "Leonard Solms"], "date_download": "2024-02-05 15:17:17", "date_modify": "None", "date_publish": "2024-01-18 11:00:00", "description": "Mahomes will play the first road playoff game of his career Sunday when the Buffalo Bills host the Chiefs at Highmark Stadium.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fnfl%2Fstory%2F_%2Fid%2F39330144%2Fhow-patrick-mahomes-navigated-worst-season-career.json", "image_url": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0117%2Fr1278757_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "ON SATURDAY, THE Kansas City Chiefs opened the postseason the same way they had in every one of quarterback Patrick Mahomes' previous five seasons as their starting quarterback: With a game at Arrowhead Stadium.\nBut how they arrived there was much different.\nThe Chiefs didn't bring with them their usual passing attack and high-scoring offense that was capable of intimidating opponents. Instead, they finished the regular season 15th in scoring.\nThe Chiefs led the league in dropped passes (38), were second in offensive penalties and ninth in turnovers. Mahomes has always been asked to shoulder a heavy burden, but never as much as this season.\nMahomes had some signature moments this season, none better than his 424-yard, four-touchdown game against the Los Angeles Chargers in Week 7. He conquered the sub-zero temperatures, gusty winds and the Miami Dolphins defense last weekend in the wild-card round, throwing for 262 yards and a touchdown in leading the Chiefs to the divisional round.\nBut the late-game magic he is famous for never materialized this season. The Chiefs lost five games by one score, and they had the ball with a chance to tie or take the lead in four of them.\nThey failed every time. Those failures weren't often on Mahomes. Dropped passes and penalties ruined many of those comeback attempts.\nThe Chiefs won enough games to claim an eighth straight division championship, but this season that in and of itself was a meager accomplishment. No other team in the AFC West finished with a winning record.\nThe Chiefs finished the regular season at 11-6, the worst record of Mahomes' career. His QBR (63), passing yards per game (261) and yards per attempt (7.0) were lows. He threw a career-high 14 interceptions, but two were well-placed passes that wide receiver Kadarius Toney deflected to a defender.\nMahomes has had to adapt to problems around him in a way he hasn't before. He'll play in the first road playoff game of his career Sunday when the Buffalo Bills host the Chiefs at Highmark Stadium (6:30 p.m. ET, CBS).\n\"He's smart enough to understand that every year is different,\" offensive coordinator Matt Nagy said. \"And with that comes the ability to adapt.\n\"He completely understands that now [that] we have an exceptional defense that is keeping teams out of the end zone and doing really good things. So let's play complementary football. We're so used to the 40, 45 points at will all the time and that's the goal. But we also have to understand through the course of the season how we're going to win.\"", "source_domain": "www.espn.co.uk", "text": null, "title": "How Patrick Mahomes has navigated the worst season of his career", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/nfl/story/_/id/39330144/how-patrick-mahomes-navigated-worst-season-career"}