{"authors": [], "date_download": "2024-02-05 15:17:18", "date_modify": "None", "date_publish": "2024-01-18 18:41:35", "description": "Editorial: Scores of media professionals have been killed in the last three months. The truth itself is under threat", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F18%2Fthe-guardian-view-on-gaza-journalists-their-lives-and-press-freedom-must-be-protected.json", "image_url": "https://i.guim.co.uk/img/media/44e0f1b5329391070c60b005eac12b96773c997b/0_512_7683_4610/master/7683.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=2ca251ffb04a48b325a9f1d76ddd5e20", "language": "en", "localpath": null, "maintext": "No war has killed so many journalists so quickly. The Committee to Protect Journalists (CPJ) says that at least 83 media workers have died since 7 October. Seventy-six of them were Palestinians killed in Israeli strikes in Gaza, while three Lebanese citizens were also killed, and four Israelis were killed by Hamas in the 7 October attacks.\nEven given the total number of deaths in Gaza – at least 24,600, the Palestinian authorities say – the media toll is shocking and disproportionate. On one estimate, it amounts to a tenth of all journalists there compared with a reported one in 100 of the overall population. Reporters Without Borders has warned that journalism is “being eradicated in the Gaza Strip”. Chillingly, the CPJ describes “an apparent pattern of targeting of journalists and their families” – including at least two cases where journalists reported threats from Israeli officials and Israel Defense Forces (IDF) officers before family members were killed.\nThough the IDF say they do not target journalists, it has been established that they have killed people clearly identified as members of the press, and that they have a record of false claims about and impunity for the deaths of media professionals. Prior to the war, a CPJ report found that 20 journalists had been killed by Israeli military fire in 22 years without anyone being held accountable. They included the renowned Palestinian-American reporter Shireen Abu Akleh.\nReuters says its journalist Issam Abdallah was killed by an Israeli tank shell in Lebanon in October, in an attack which Agence France Press described as “deliberate and targeted”, and which Amnesty International and Human Rights Watch want investigated as a possible war crime. In another case, the IDF said they were targeting a “terrorist” using a drone when they killed two journalists in a car, before suggesting that the men had looked like terrorists because they had a camera drone.\nAttacks on journalists are not only attacks on civilians, as grave as those are. They also strike at the truth itself: at the ability to establish it, and to share it. International news organisations have been able to access Gaza only extremely briefly and under tight restrictions, all but one embedded with the IDF. Those who live there are the eyes of the world.\nBeyond the risk of death, says the CPJ, Palestinian journalists have experienced “arrests … numerous assaults, threats, cyber-attacks and censorship”. Nineteen are in prison – putting Israel on the organisation’s list of the worst jailers of journalists for the first time, alongside China, Myanmar, Russia and Iran. Most are held under “administrative detention”, which allows the Israeli military to detain people in the occupied territories without trial or time limit.\nThe secretary of state, Antony Blinken, has said that the US stands “unequivocally for the protection of journalists during armed conflict”. It should act accordingly, holding Israel accountable for deaths and infringements of press freedom, as several groups urged in a letter to Joe Biden last week. The US, the UK and others should also press Israel to allow proper access for international media.\nReporters in Gaza who have been injured themselves, and who have suffered devastating personal loss, have been swift to return to work to tell the world what is happening to others. They do not want to be the story. But when so many are dying, it is essential to ask why – and to make clear that the carnage must not continue.", "source_domain": "www.theguardian.com", "text": null, "title": "The Guardian view on Gaza’s journalists: their lives, and press freedom, must be protected", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/18/the-guardian-view-on-gaza-journalists-their-lives-and-press-freedom-must-be-protected"}