{"authors": ["Gina Kalsi", "Chris Jewers"], "date_download": "2024-02-05 15:17:18", "date_modify": "None", "date_publish": "2024-01-18 23:18:06", "description": "Admiral Rob Bauer, the chair of the NATO Military Committee, urged both civilians and governments to prepare for conflict and potential conscription.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12981021%2FNato-braced-war-Russia-20-years.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/18/23/80203323-0-image-m-106_1705618820810.jpg", "language": "en", "localpath": null, "maintext": "A top defence chief has revealed that NATO forces are bracing for an all-out war with Russia in the next two decades.\nAdmiral Rob Bauer, the chairman of NATO's Military Committee urged both civilians and governments to prepare for cataclysmic conflicts and the chilling prospect of being conscripted.\n'We have to realise it's not a given that we are in peace. And that's why we [NATO forces] have the plans, that's why we are preparing for a conflict with Russia,' Bauer told reporters after a meeting of NATO defence chiefs in Brussels.\n'But the discussion is much wider. It is also the industrial base and also the people that have to understand they play a role.'\nIn a stark warning, he said civilians must be ready for a conflict in the next 20 years that would require wholesale change in their lives.\nBauer said large numbers of civilians will need to be mobilised in case a global war breaks out and governments must make sure their nations are 'war ready'.\n'We need public and private actors to change their mindset for an era in which everything was plannable, foreseeable, controllable and focused on efficiency to an era in which anything can happen at any time. An era in which we need to expect the unexpected,' Bauer warned.\nAdmiral Rob Bauer, the chair of the NATO Military Committee, urged both civilians and governments to prepare for conflict and potential conscription\nA top defence chief has revealed that NATO forces are bracing for an all-out war with Russia in the next two decades\nThe comments come as conflict in the Middle East threatens to spread out\nThe senior Dutch military boss added: 'You need to be able to fall back on an industrial base that is able to produce weapons and ammunition fast enough to be able to continue a conflict if you are in it.'\nAdm Bauer also praised Sweden for urging all of its citizens to brace for war ahead of the nation joining NATO. The move has seen a surge in volunteers for Sweden's civil defence organisation.\nThis comes as NATO is planning to mobilise 90,000 troops in its largest military manoeuvre since the Cold War, with the war games aimed at deterring Vladimir Putin from targeting a member country.\nThe alliance announced the exercise would begin next week, with the months of drills aimed at showing the alliance can defend all of its territory up to its border with Russia.\nThe exercises - dubbed 'Steadfast Defender' - will run until late May and involve units from all 31 NATO member countries plus candidate-member Sweden, NATO's Supreme Allied Commander Europe, US General Christopher Cavoli, said.\nThe wargames are meant as a fresh show of strength from NATO and its commitment to defend all allied nations from attack.\n'The Alliance will demonstrate its ability to reinforce the Euro-Atlantic area by a transatlantic movement of forces from North America,' Cavoli told reporters in Brussels after a two-day meeting of national chiefs of defence.\nBauer said the scale of the exercise was a demonstration of the alliance's new readiness.\n'That is a record number of troops that we can bring to bear and have an exercise within that size, across the alliance, across the ocean, from the US to Europe,' he said.\nNATO is planning to mobilise 90,000 troops in its largest military maneuver since the Cold War in a bid to deter Vladimir Putin. Pictured: British soldiers take part in a major drill as part of the EFP NATO operation at the Tapa estonian army camp near Rakvere, on February 6, 2022\nIt was announced last week the UK would be sending 20,000 troops with the Royal Navy's two new aircraft carriers, eight warships, as well as the RAF's F-35 lightning attack aircraft, which will practice flying in imitated conflict scenarios.\nUK Defense Secretary Grant Shapps announced the deployment on Monday.\nThe war games come after UK ministers announced a further £2.5billion support package to Ukraine and the RAF airstrikes, with the US, on the Houthis in Yemen.\nAccording to German newspaper Bild, Germany will send 12,000 soldiers along with 3,000 vehicles and 30 aircraft.\nCiting the German Press Agency, Bild said the exercise will simulate a Russian attack on NATO territory, a scenario which would trigger Article 5. The article states that if any NATO country is attacked, all other alliance countries will mobilise to defend it.\nEarlier this week, at a meeting of the 31-nation alliance's top brass in Brussels, Adm Bauer, also said that behind Russian president Putin's rationale for the war is a fear of democracy.\nAdm Bauer said NATO would continue to support Ukraine long-term.\n'Today is the 693rd day of what Russia thought would be a three-day war. Ukraine will have our support for every day that is to come because the outcome of this war will determine the fate of the world,' he said.\n'This war has never been about any real security threat to Russia coming from either Ukraine or NATO,' Adm Bauer added.\n'This war is about Russia fearing something much more powerful than any physical weapon on earth - democracy. If people in Ukraine can have democratic rights, then people in Russia will soon crave them too.'\nThe largest NATO exercise since the cold war took place in 2018 when around 51,000 troops were involved in 'Trident Juncture 2018' in Norway.\nGermany is preparing for Vladimir Putin 's forces to attack NATO in 2025, according to leaked secret plans\nAnnouncement of the NATO exercise comes after it was revealed that Germany is preparing for Putin's forces to attack NATO in 2025.\nSecret documents from the German Ministry of Defence reveal a step-by-step doomsday guide on how Russia will escalate the conflict in Ukraine to an all-out war in just 18 months.\nThe leaked plans, published by Bild, reveal in detail the path to a Third World War with Putin using Belarus as a launching pad for an invasion - as he did in February 2022 for his war in Ukraine.\nThe release of the terrifying documents come just days after Sweden's civil defence minister warned that his country could soon face the prospect of war and urged citizens to join voluntary defence organisations in preparation for a Russian attack.\nElsewhere tensions have been rising in the Middle East, as Pakistan's air force launched retaliatory airstrikes in Iran yesterday.\nPakistan said its strikes had hit 'terrorist hideouts' in Iran's Sistan-Baluchestan province.\nIran condemned the attack and claimed the airstrike killed three women, two men and four children who were not Iranian.\nThis comes after an Iranian missile and drone attack killed two children and injured three others in Balochistan on Tuesday.\nPresident Joe Biden said the clash showed Iran was not 'well-liked' in the region.\nA destroyed residential tower in Al Nuseirat refugee camp, Gaza Strip pictured yesterday\nA Palestinian boy, who fled his house due to Israeli strikes, is pictured sitting on a water bottles at a tent camp in the southern Gaza Strip yesterday\nPalestinians are pictured walking along the streets as they fled their homes due to to Israeli strikes yesterday\nPakistan's Foreign Ministry issued a statement justifying the country's actions.\n'This morning's action was taken in light of credible intelligence of impending large scale terrorist activities,' it read.\n'This action is a manifestation of Pakistan's unflinching resolve to protect and defend its national security against all threats.'\nHowever Islamabad also urged talks with 'brotherly neighbour' Iran to solve their differences.\nThe conflict between the two countries also raises the threat of a full-blown war breaking out in the Middle East - already plagued by Israel's now months-long conflict with Hamas.\nHamas has continued to fight back across Gaza and launch rockets into Israel.\nIt says it will not release any more hostages until there is a permanent cease-fire, something Israel and the US, its top ally, have ruled out.\nHundreds of thousands of Palestinians have heeded Israeli evacuation orders and packed into southern Gaza, where shelters run by the United Nations are overflowing and massive tent camps have gone up.\nIsrael has continued to strike what it says are militant targets in all parts of Gaza.\nEarly Thursday, medics said an Israeli airstrike killed 16 people, half of them children, in the southern Gaza town of Rafah.\nIsrael blames the high civilian death toll on Hamas because it fights in dense residential areas.\nIsrael claimed its forces have killed roughly 9,000 militants and that 193 of its own soldiers have been killed since the Gaza ground offensive began.\nThe rift between Joe Biden and Benjamin Netanyahu has deepened as the Israeli Prime Minister accused the US of trying to 'coerce' Israel.\nIn an interview on national TV, Netanyahu rejected US calls to scale back Israel's military offensive in the Gaza Strip and take steps toward the establishment of a Palestinian state after the war.\nNetanyahu accused the US of trying to 'coerce' Israel into a situation which would 'endanger' the country and said 'we will not settle for anything short of an absolute victory'.\nThe tense back and forth reflected what has become a wide rift between the two allies over the scope of Israel's war and its plans for the future of the territory.\nThe rift between Joe Biden and Benjamin Netanyahu has deepened as the Israeli Prime Minister accused the US of trying to 'coerce' Israel\nSmoke is pictured blowing over Khan Yunis in the southern Gaza Strip yesterday\nA group of Houthis are pictured in Sana'a, Yemen\n'We obviously see it differently,' White House national security spokesman John Kirby said.\nNetanyahu spoke just a day after U.S. Secretary of State Antony Blinken said Israel would never have 'genuine security' without a pathway toward Palestinian independence.\nEarlier this week, the White House also announced that it was the 'right time' for Israel to lower the intensity of its devastating military offensive in Gaza.\nBut in a nationally televised news conference, Netanyahu struck a defiant tone, repeatedly saying that Israel would not halt its offensive until it realises its goals of destroying Gaza's Hamas militant group and bringing home all remaining hostages held by Hamas.\nHe rejected claims by a growing chorus of Israeli critics that those goals are not achievable, vowing to press ahead for many months.\nHe said: 'We will not settle for anything short of an absolute victory.'\nAn Israeli strike on south Lebanon also killed a senior commander in Hezbollah's elite Radwan force on 8 January.\nWissam Hassan Tawil, the deputy head of a unit within the Radwan force, died alongside another Hezbollah fighter when their car, a Honda SUV, was targeted in a strike on the Lebanese village of Majdal Selm.\nHe was the highest-ranking Hezbollah member to be killed since Israel and the Lebanese group began exchanging cross-border fire following Hamas' October 7 attacks.\nThe UK and and its allies also launched a series of airstrikes against Houthi rebels in Yemen following weeks of drone and missile attacks by militants that have disrupted global shipping.\nThe Houthis, backed by Iran, have been attacking ships in the Red Sea since November, purportedly in support of Gazans.\nThe UK and US have repeatedly warned the Houthis to stop attacking the vital shipping route.\nThe strikes saw over 100 missiles launched at more than 60 targets across 16 locations in Yemen, including an airbase, airports and a military camp, officials said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Nato braced for all-out war with Russia in the next 20 years: Top defence chief issues starkest warning yet and says civilians and governments must brace for cataclysmic conflicts and potential conscr", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12981021/Nato-braced-war-Russia-20-years.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}