{"authors": ["Sammy Gecsoyler", "Tom Bryant", "Warren Murray"], "date_download": "2024-02-05 15:14:40", "date_modify": "None", "date_publish": "2024-01-30 16:02:55", "description": "Kyiv says Moscow has provided no evidence to support claim Ukrainian soldiers were on board crashed plane", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F30%2Frussia-ukraine-war-live-ukrainian-drones-target-sevastopol-and-russian-regions.json", "image_url": "https://i.guim.co.uk/img/media/404638362adc77f01a5530b1300f13d1d023e220/269_62_4986_2993/master/4986.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=17204db90c5fbafc0686339e7d373890", "language": "en", "localpath": null, "maintext": "From 6d ago 15.37 CET Volodymyr Zelenskiy reiterates calls for 'air shield' to protect Ukraine from missile and drone attacks Ukrainian president Volodymyr Zelenskiy has reiterated calls for an “air shield” to protect the country from missiles and drone attacks. On X, Zelenskiy said: “Russia has launched over 330 missiles of various types and approximately 600 combat drones at Ukrainian cities since the beginning of the year. “To withstand such terrorist pressure, a sufficiently strong air shield is required. And this is the type of air shield we are building with our partners. “We must ensure Ukraine’s control over its skies, which is also critical to ensuring security on the ground — from frontline positions to hospitals and schools in the rear. Air defense and electronic warfare are our top priorities. Russian terror must be defeated – this is achievable.” In a video embedded in the post, it was noted that an “effective” air shield should contain many layers that extends from the frontline to areas where commercial and civilian infrastructure are based. Russia has launched over 330 missiles of various types and approximately 600 combat drones at Ukrainian cities since the beginning of the year.\nTo withstand such terrorist pressure, a sufficiently strong air shield is required. And this is the type of air shield we are building… pic.twitter.com/t5p1BLAVby — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) January 30, 2024\nUpdated at 15.38 CET\n6d ago 17.02 CET Closing summary This blog is now closing. Below is a summary of today’s stories: A Ukrainian military spy official said on Tuesday that Russia was showing no willingness to return the bodies of dozens of Ukrainian prisoners of war Moscow says died in a military plane crash in Belgorod region last week. “It’s a statement from Russia that our prisoners were there, and so far we can analyse only their words. Now there is no readiness to transfer the bodies from the other side,” Andriy Yusov, the spokesperson, was quoted as saying by Suspilne broadcaster.\nThe Ukrainian president, Volodymyr Zelenskiy, has reiterated calls for an “air shield” to protect the country from missiles and drone attacks.\nJosep Borrell, vice-president of the European Commission and EU foreign policy chief, has said Europe’s safety is at stake if Vladimir Putin wins the war in Ukraine. In a piece written in the French publication L’Obs, Borell said: “We hear again that Ukraine cannot win and that western support will not hold. And once again, the temptations of conciliation resurface. These ideas were wrong in 2022, and they remain wrong today. We must not let them shape our policy towards Ukraine.”\nTwenty-one Ukrainian drones reached Crimea and several Russian regions , Russian media have said this morning. Sevastopol in illegally Russian-held Crimea was targeted, along with the Bryansk, Kaluga and Tula regions, according to Russian officials, who as usual claimed all drones were intercepted and/or destroyed.\nThe US secretary of state, Antony Blinken, warned on Monday that Ukraine’s gains over two years of fighting were in doubt without new US funding , as Nato’s chief visited to lobby Congress.\nThe European parliament is investigating claims that one of its members has spied for Russia’s FSB since at least 2004. Tatjana Ždanoka, a Latvian MEP, has denied allegations published by the Insider, a Russian investigative newspaper, which put together the story along with Estonia’s Delfi, Latvia’s Re:Baltica and Sweden’s Expressen.\nInsider alleged emails between Ždanoka and Russian case officers included reports on her work as a European legislator including fostering pro-Kremlin sentiment. In March 2022, Ždanoka was one of 13 MEPs – out of 705 in the parliament – who voted against condemning Russia’s war on Ukraine .\nPolitico quoted a European parliament official as saying “investigations … have been opened” into the allegations, which were taken “very seriously”. In a video on Facebook, Ždanoka said: “I have never been associated with the KGB … and I have not cooperated with any other intelligence agencies.”\nRussia’s defence ministry said on Monday that its forces had taken control of the village of Tabaivka in Ukraine’s Kharkiv region, but Ukraine denied this. Volodymyr Fityo, the head of communications for Ukraine’s ground forces, said: “This does not correspond to reality. There are battles taking place near this locality.”\nRepresentatives of the EU member states will meet on Monday evening to discuss funding for Ukraine as pressure mounts on Viktor Orbán to agree. An aide to Orbán said the Hungarian PM said he was open to a proposed €50bn ($54bn) aid package and had sent a proposal with “caveats” to Brussels. The Ukrainian foreign minister, Dmytro Kuleba, met his Hungarian counterpart, Péter Szijjártó, in western Ukraine on Monday.\nUpdated at 17.09 CET\n6d ago 16.36 CET Russia is increasing production of air defence missiles,the country’s defence minister, Sergei Shoigu, said in video footage released on Tuesday, adding there were “key issues” that needed to be addressed, Reuters reports. The release of the footage by the defence ministry follows drone strikes launched from Ukraine on Russian cities and energy infrastructure while Moscow presses on with its military campaign against Kyiv. Shoigu was shown inspecting defence industry facilities in the Urals industrial city of Ekaterinburg and touring factories producing sea- and ground-launched cruise missiles and air defence systems. “There has been a significant increase in the volume of production. We have more than doubled production of the missiles we need for air defence,” he said at one factory. “But there are some key issues we need to address. And we need to address them quite vigorously. There is the question of engines, and there is the question of the establishment of launcher production.” The defence ministry published the videos on its Telegram messenger channel. Russian officials have in recent months flagged rapid improvements in the country’s military industrial capacity, aimed at bolstering Russia’s military in its deadlocked campaign against Ukraine. Over the recent weeks, attacks, some of which have been claimed by Ukrainian officials or blamed on Kyiv by the Kremlin, have hit Russian cities and oil and gas facilities.\nUpdated at 16.55 CET\n6d ago 15.39 CET Russia showing no willingness to return PoW bodies, Ukrainian intelligence official says A Ukrainian military spy official said on Tuesday that Russia was showing no willingness to return the bodies of dozens of Ukrainian prisoners of war Moscow says died in a military plane crash in Belgorod region last week, Reuters reports. Kyiv has said Moscow has provided no evidence to support its assertion that 65 captured Ukrainian soldiers were onboard the Russian military transport plane, which crashed last Wednesday in Belgorod in Russia near the border. Moscow says the plane was shot down by Ukraine on its way to a prisoner swap; Ukraine has neither confirmed nor denied that its forces shot it down. “It’s a statement from Russia that our prisoners were there, and so far we can analyse only their words. Now there is no readiness to transfer the bodies from the other side,” Andriy Yusov, the spokesperson, was quoted as saying by Suspilne broadcaster. Russia’s state Investigative Committee said last week that body parts were being collected and removed for genetic testing. Kremlin spokesperson Dmitry Peskov said on Friday he had no information on what would happen to the remains or whether they would be handed to Ukraine. The Russian Investigative Committee has released footage from the site showing a single body in a snowy field as well as items of clothing. Reuters verified the location of the crash site seen in one of the videos but was unable to independently verify the date or other details. Ukraine’s human rights commissioner Dmytro Lubinets told Reuters last week that an unofficial list of Ukrainian PoW casualties circulated in Russian media after the crash included soldiers who had already returned in a previous swap.\nUpdated at 16.04 CET\n6d ago 15.37 CET Volodymyr Zelenskiy reiterates calls for 'air shield' to protect Ukraine from missile and drone attacks Ukrainian president Volodymyr Zelenskiy has reiterated calls for an “air shield” to protect the country from missiles and drone attacks. On X, Zelenskiy said: “Russia has launched over 330 missiles of various types and approximately 600 combat drones at Ukrainian cities since the beginning of the year. “To withstand such terrorist pressure, a sufficiently strong air shield is required. And this is the type of air shield we are building with our partners. “We must ensure Ukraine’s control over its skies, which is also critical to ensuring security on the ground — from frontline positions to hospitals and schools in the rear. Air defense and electronic warfare are our top priorities. Russian terror must be defeated – this is achievable.” In a video embedded in the post, it was noted that an “effective” air shield should contain many layers that extends from the frontline to areas where commercial and civilian infrastructure are based. Russia has launched over 330 missiles of various types and approximately 600 combat drones at Ukrainian cities since the beginning of the year.\nTo withstand such terrorist pressure, a sufficiently strong air shield is required. And this is the type of air shield we are building… pic.twitter.com/t5p1BLAVby — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) January 30, 2024\nUpdated at 15.38 CET\n6d ago 14.58 CET Two teenagers who set fire to a railway equipment box in Moscow have been charged with carrying out sabotage for Ukraine, Russian investigators said Tuesday. The incident is the latest in a spate of suspicious fires and derailments on Russia’s rail network that Moscow has blamed on Kyiv and its supporters, AFP reports. “Two suspects were identified and detained at their homes in the town of Dolgoprudny near Moscow. They turned out to be 17-year-old teenagers,” police told the TASS news agency. According to investigators, a supporter of Ukraine contacted one of the teenagers online and persuaded him to carry out the attack in return for cash. The suspect then asked his friend to help and they both travelled to Mark station in the suburbs of northern Moscow, where they set fire to the cabinet. The pair have been remanded in custody on sabotage charges, which carry a maximum sentence of 20 years in prison, depending on the severity of the crime.\n6d ago 14.37 CET The Russian foreign minister Sergei Lavrov held a meeting with the Chinese deputy foreign minister Ma Zhaoxu on Tuesday to discuss the conflict in Ukraine, the situation in the Asia-Pacific region, the Middle East and the Korean peninsula, his ministry said in a statement, without immediately releasing further details.\n6d ago 14.17 CET European Union nations have decided to approve an outline deal that would keep in reserve the profits from hundreds of billions of dollars in Russian central bank assets that have been frozen in retaliation for Moscow’s war in Ukraine, an EU official told the Associated Press. The tentative agreement, reached late Monday, still needs formal approval but is seen as a first step toward using some of the €200bn (£171bn/$216bn) in Russian central bank assets in the EU to help Ukraine rebuild from Russian destruction. The official, who asked not to be identified since the agreement was not yet legally ratified, said the bloc “would allow to start collecting the extraordinary revenues generated from the frozen assets ... to support the reconstruction of Ukraine.” How the proceeds will be used will be decided later, as the issue remains mired in legal and practical considerations. There is urgency since Ukraine is struggling to make ends meet, and aid plans in the EU and the United States are being held back over political considerations including whether allies will continue helping Ukraine at the same pace as they did in the first two years of the war. EU leaders will meet on Thursday hoping to approve a €50bn ($54bn) support package for Ukraine over the solitary opposition of Hungarian prime minister Viktor Orbán.\nUpdated at 15.55 CET\n6d ago 13.59 CET Summary of the day so far... Josep Borrell, a vice-president of the European Commission and EU foreign policy chief, has said Europe’s safety is at stake if Vladimir Putin wins the war in Ukraine. In a piece written in the French publication L’Obs, Borell said: “We hear again that Ukraine cannot win and that western support will not hold. And once again, the temptations of conciliation resurface. These ideas were wrong in 2022, and they remain wrong today. We must not let them shape our policy towards Ukraine.\nTwenty-one Ukrainian drones reached Crimea and several Russian regions , Russian media have said this morning. Sevastopol in illegally Russian-held Crimea was targeted, along with the Bryansk, Kaluga and Tula regions, according to Russian officials, who as usual claimed all drones were intercepted and/or destroyed.\nThe US secretary of state, Antony Blinken, warned on Monday that Ukraine’s gains over two years of fighting were in doubt without new US funding , as Nato’s chief visited to lobby Congress.\nThe European parliament is investigating claims that one of its members has spied for Russia’s FSB since at least 2004. Tatjana Ždanoka, a Latvian MEP, has denied allegations published by the Insider, a Russian investigative newspaper, which put together the story along with Estonia’s Delfi, Latvia’s Re:Baltica and Sweden’s Expressen.\nInsider alleged emails between Ždanoka and Russian case officers included reports on her work as a European legislator including fostering pro-Kremlin sentiment. In March 2022, Ždanoka was one of 13 MEPs – out of 705 in the parliament – who voted against condemning Russia’s war on Ukraine .\nPolitico quoted a European parliament official as saying “investigations … have been opened” into the allegations, which were taken “very seriously”. In a video on Facebook, Ždanoka said: “I have never been associated with the KGB … and I have not cooperated with any other intelligence agencies.”\nRussia’s defence ministry said on Monday that its forces had taken control of the village of Tabaivka in Ukraine’s Kharkiv region, but Ukraine denied this. Volodymyr Fityo, the head of communications for Ukraine’s ground forces, said: “This does not correspond to reality. There are battles taking place near this locality.”\nRepresentatives of the EU member states will meet on Monday evening to discuss funding for Ukraine as pressure mounts on Viktor Orbán to agree. An aide to Orbán said the Hungarian PM said he was open to a proposed €50bn ($54bn) aid package and had sent a proposal with “caveats” to Brussels. The Ukrainian foreign minister, Dmytro Kuleba, met his Hungarian counterpart, Péter Szijjártó, in western Ukraine on Monday.\nUpdated at 14.13 CET\n6d ago 13.04 CET There is a long road ahead before a meeting between Hungary’s prime minister Viktor Orbán and the Ukrainian president Volodymyr Zelenskiy can happen, the Hungarian foreign minister said at a briefing on Tuesday. Péter Szijjártó, who was speaking a day after meeting his Ukrainian counterpart, said that if Ukraine met Hungary’s conditions that would create a “clean slate” in bilateral relations and allow for a top level meeting.\nUpdated at 13.10 CET\n6d ago 11.52 CET Europe's safety at stake if Putin wins war in Ukraine, says European Commission vice-president Josep Borrell, a vice-president of the European Commission and EU foreign policy chief, has said Europe’s safety is at stake if Vladimir Putin wins the war in Ukraine. In a piece written in the French publication L’Obs, Borell said: “We hear again that Ukraine cannot win and that western support will not hold. And once again, the temptations of conciliation resurface. These ideas were wrong in 2022, and they remain wrong today. We must not let them shape our policy towards Ukraine. “Ukraine’s victory in the face of Russian aggression is the best guarantee of security for Europe,” he added. Nous ne pouvons pas permettre à Vladimir Poutine de l’emporter en Ukraine.\nNotre propre sécurité est en jeu.\nNous devons à tout prix empêcher l’avènement d’un monde où la force prime sur le droit.\nMon éditorial dans @lobshttps://t.co/47z50IwC7x — Josep Borrell Fontelles (@JosepBorrellF) January 30, 2024\nUpdated at 12.08 CET\n6d ago 11.15 CET Reuters reports that senior Russian security official Dmitry Medvedev said on Tuesday that Moscow will deploy new weapons on the Kuril Islands which are at the centre of a territorial dispute with Japan, the TASS state news agency reported. Russia and Japan have never signed a peace treaty formally ending the conflict between them that dates back to the second world war, with the Kuril Islands – which Japan calls the Northern Territories – remaining the primary stumbling block between the two sides. TASS cited Medvedev as saying that Russia was not against signing a peace treaty with Japan, but only if Tokyo no longer disputed the islands' status.\n6d ago 10.28 CET Reuters reports that Russian opposition politician Vladimir Kara-Murza has been transferred to a new penal colony in the Omsk region of Siberia and placed in a punishment block, Novaya Gazeta Europe reported on Tuesday, citing his lawyer. Kara-Murza, who had lobbied for western sanctions against Russia, was sentenced to 25 years last year on treason and other charges that he denied, comparing the case against him to a Stalinist show trial. His wife said on Monday that he had been moved from his previous prison in Omsk and his whereabouts were unknown.\n6d ago 10.03 CET EU leaders will restate their determination to continue to provide \"timely, predictable and sustainable military support\" to Ukraine at a summit on Thursday, according to draft conclusions of the meeting, Reuters reports. \"The European Council also reiterates the urgent need to accelerate the delivery of ammunition and missiles,\" the draft text, seen by Reuters, also says.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Russia showing no willingness to return PoW bodies from plane crash, Kyiv says; Zelenskiy wants ‘air shield’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/30/russia-ukraine-war-live-ukrainian-drones-target-sevastopol-and-russian-regions"}