{"authors": [], "date_download": "2024-02-05 15:17:19", "date_modify": "None", "date_publish": "2024-01-18 16:31:51", "description": "NATO will launch next week its biggest wargames in decades with around 90,000 personnel set to take part in months-long military exercises", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fnato-ap-russia-brussels-eastern-europe-b2480997.html.json", "image_url": "https://static.independent.co.uk/2024/01/18/16/Russia_Ukraine_War_NATO_14730.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNATO will launch next week its biggest military exercises in decades with around 90,000 personnel set to take part in months-long wargames aimed at showing that the alliance can defend all of its territory up to its border with Russia, top officers said Thursday.\nThe exercises come as Russia’s war on Ukraine bogs down. NATO as an organization is not directly involved in the conflict, except to supply Kyiv with non-lethal support, although many member countries send weapons and ammunition individually or in groups, and provide military training.\nIn the months before President Vladimir Putin ordered Russian troops into Ukraine in February 2022, NATO began beefing up security on its eastern flank with Russia and Ukraine. It’s the alliance’s biggest buildup since the Cold War. The wargames are meant to deter Russia from targeting a member country.\nThe exercises – dubbed Steadfast Defender 24 – “will show that NATO can conduct and sustain complex multi-domain operations over several months, across thousands of kilometers (miles), from the High North to Central and Eastern Europe, and in any condition,” the 31-nation organization said.\nTroops will be moving to and through Europe until the end of May in what NATO describes as “a simulated emerging conflict scenario with a near-peer adversary.” Under NATO’s new defense plans, its chief adversaries are Russia and terrorist organizations.\n“The alliance will demonstrate its ability to reinforce the Euro-Atlantic area via transatlantic movement of forces from North America,” NATO’s Supreme Allied Commander, U.S. General Christopher Cavoli, told reporters.\nCavoli said it will demonstrate \"our unity, our strength, and our determination to protect each other.”\nThe chair of the NATO Military Committee, Admiral Rob Bauer, said that it’s “a record number of troops that we can bring to bear and have an exercise within that size, across the alliance, across the ocean from the U.S. to Europe.”\nBauer described it as “a big change” compared to troop numbers exercising just a year ago. Sweden, which is expected to join NATO this year, will also take part.\nU.K. Defense Secretary Grant Shapps has said that the government in London would send 20,000 troops backed by advanced fighter jets, surveillance planes, warships and submarines, with many being deployed in eastern Europe from February to June.", "source_domain": "www.independent.co.uk", "text": null, "title": "NATO to start biggest wargames in decades next week, involving around 90,000 personnel", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/nato-ap-russia-brussels-eastern-europe-b2480997.html"}