{"authors": [], "date_download": "2024-02-05 15:17:21", "date_modify": "None", "date_publish": "2024-01-17 09:35:50", "description": "A top NATO military officer says the war in Ukraine could “determine the fate of the world.”", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-ukraine-nato-russia-vladimir-putin-b2479984.html.json", "image_url": "https://static.independent.co.uk/2024/01/17/09/Russia_Ukraine_War_34073.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nUkraine is locked in an existential battle for its survival almost two years into its war with Russia and Western armies and political leaders must drastically change the way they help it fend off invading forces, a top NATO military officer said on Wednesday.\nAt a meeting of the 31-nation alliance’s top brass, the chair of the NATO Military Committee, Admiral Bob Bauer, also said that behind President Vladimir Putin’s rationale for the war is a fear of democracy, in a year marked by elections around the world.\nOver two days of talks in Brussels, NATO’s top officers are expected to detail plans for what are set to be the biggest military exercises in Europe since the Cold War later this year. The wargames are meant as a fresh show of strength from NATO and its commitment to defend all allied nations from attack.\nAs the war bogs down, and with U.S. and European Union funding for Ukraine’s conflict-ravaged economy held up by political infighting, Bauer appealed for a “whole of society approach” to the challenge that goes beyond military planning.\n“We need public and private actors to change their mindset for an era in which everything was plannable, foreseeable, controllable and focused on efficiency to an era in which anything can happen at any time. An era in which we need to expect the unexpected,” he said as he opened the meeting.\n“In order to be fully effective, also in the future, we need a warfighting transformation of NATO,” Bauer added.\nOn Monday, U.K. Defense Secretary Grant Shapps announced that his government would send 20,000 troops to take part in the NATO military exercises — known as \"Steadfast Defender\" — with many deployed in eastern Europe from February to June.\nThe U.K. will also send advanced fighter jets and surveillance planes, plus warships and submarines.\nWith ammunition stockpiles diminishing as allies send military materiel to Ukraine, the Norwegian government said Wednesday it was earmarking 2 billion kroner ($192 million) to boost defense industry production capacity, saying there is “a need for large quantities of ammunition.”\nNorway’s Defense Minister Bjørn Arild Gram said that “increasing capacity in the defense industry is important, both for Ukraine, but also to safeguard our own security.”\nHalf the funds will go to Nammo, a Norway-based aerospace and defense group that specializes in the production of ammunition, rocket engines and space applications, “to increase the production of artillery ammunition,” Prime Minister Jonas Gahr Støre said.\nIn Brussels, Bauer said NATO would continue to support Ukraine long-term.\n“Today is the 693rd day of what Russia thought would be a three-day war. Ukraine will have our support for every day that is to come because the outcome of this war will determine the fate of the world,” he said.\n“This war has never been about any real security threat to Russia coming from either Ukraine or NATO,” Bauer added. “This war is about Russia fearing something much more powerful than any physical weapon on earth — democracy. If people in Ukraine can have democratic rights, then people in Russia will soon crave them too.”\n___\nJan M. Olsen in Copenhagen contributed to this report.\n___\nFind more of AP’s coverage of Russia and Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Top NATO military officer urges allies and leaders to plan for the unexpected in Ukraine", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-ukraine-nato-russia-vladimir-putin-b2479984.html"}