{"authors": ["James Vituscka", "James Vituscka For Dailymail.Com"], "date_download": "2024-02-05 15:17:21", "date_modify": "None", "date_publish": "2024-01-17 13:14:00", "description": "The rapper, 46, filed nine separate trademark applications with the United States Patent and Trademark Office on Friday under the phrase 'I MISS YOU WHEN I WAKE UP BEFORE YOU.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ftvshowbiz%2Farticle-12966185%2FKanye-West-files-trademark-phrase-inspired-wife-Bianca-Censori-BIZARRE-list-goods-services-moisturizers-plush-toys-wireless-receivers-form-jewelry-biological-CLONING.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/16/15/80049637-0-image-m-11_1705419417374.jpg", "language": "en", "localpath": null, "maintext": "Kanye West has filed paperwork to try and register a new trademark for a phrase inspired by his wife Bianca Censori - revealing plans to use the slogan to launch a bizarre array of good and services including 'biological cloning,' 'moisturizers,' 'plush toys' and 'wireless receivers in the form of jewelry.'\nThe rapper, 46, filed nine separate trademark applications with the United States Patent and Trademark Office on January 11 under the phrase: 'I MISS YOU WHEN I WAKE UP BEFORE YOU.'\nHe had used that same line to caption a picture of Bianca on Instagram in celebration of her 29th birthday on January 5, just days after sharing a slew of near-naked pictures of the designer.\nThe strange goods and services listed include everything from fashion items to precious stones, technology and science.\nThe rapper, 46, filed nine separate trademark applications with the United States Patent and Trademark Office on January 9 under the phrase 'I MISS YOU WHEN I WAKE UP BEOFRE YOU'\nHe was seemingly inspired by his wife Bianca, 29, as he had used the phrase on a picture in celebration of her birthday on January 5\nThe strange and non-related goods and services listed include everything from 'biological cloning' to 'moisturizers' and 'plush toys'\n'Exploration services in the field of the oil, gas and mining industries,' is listed as well as 'chemical research,' 'meteorological research,' 'map drawing,' 'dress design' - and even a 'life-size inflatable dummy with water-filled base.'\nKanye's attorney, Gregory K. Nelson, confirmed exclusively to DailyMail.com that he filed the applications on behalf of Ox Paha, Inc. - the same company used by the musician to file his recent trademarks for YEWS and YEEZY PODS.\nOther goods and services listed include 'floating recreational lounge chairs,' 'squeezable squeaking toys,' 'e furnishing design,' 'providing a social networking website at which a user can give charitable gifts to others,' and 'horological and chronometric instruments.'\nThe trademark application has been accepted by the Office, but has not yet been assigned to an examiner.\nKanye will have to show actual use of the trademark in connection with the examples, or he will not be able to secure protection for each of the nine classes.\nThe Grammy-award winner appeared to leave nothing to chance for his YEWS trademark, which he earmarked for uses across several sectors when he filed on October 2.\nHe had planned to use the phrase on everything from music and audio to entertainment content, financial services, beauty products, restaurants and more.\nOther more bizarre requests included for use on 'common metals and their alloys', as well as 'industrial analysis and research.'\nKanye's attorney, Gregory K. Nelson, confirmed to DailyMail.com that he filed the applications on behalf of Ox Paha, Inc. The rapper pictured with his wife (right) carrying a soft toy\nThe rapper followed the birthday tribute with a slew of near-naked pictures of his wife (pictured)\nKanye sparked outrage last year when he claimed he 'loved' Hitler and denied the Holocaust ever took place.\nThe comments, made on an episode of Alex Jones' Infowars podcast, left even the famously controversial host stunned.\n'I see good things about Hitler... every human being has something of value that they brought to the table, especially Hitler,' he said, before claiming the Germans 'had a really good leader at one point.'\nHe also denied that Hitler had ordered the deaths of six million Jews.\nIt came after he threatened to go 'DEFCON 3 On Jewish People.'\nDEFCON - also known as defense readiness condition - is an alert used by the US Armed Forces to indicate how quickly the military can be deployed during deadly emergencies and attacks.\nOn December 26, he finally apologized for his various anti-Semitic outbursts that resulted in him losing a string of lucrative endorsement deals and being dropped by his talent agency.\nAdidas, Gap, and Def Jam Records also distanced themselves from him, while his honorary alma mater the School of the Art Institute of Chicago rescinded his doctorate.\nKanye shared an apology in Hebrew on his Instagram, which stated: 'I sincerely apologize to the Jewish community for any unintended outburst'\n'I sincerely apologize to the Jewish community for any unintended outburst caused by my words or actions,' he wrote on his Instagram. 'It was not my intention to hurt or demean, and I deeply regret any pain I may have caused.\n'I am committed to starting with myself and learning from this experience to ensure greater sensitivity and understanding More in the future. Your forgiveness is important to me, and I am committed to making amends and promoting unity.'\nThe apology was reportedly a result of a 'smackdown' by his wife Bianca, who is allegedly 'tired' of having to 'babysit' her husband - and fears he is putting them in danger.\n'Bianca was tired of having to babysit Kanye,' an insider told DailyMail.com exclusively. 'She told him that his recent behavior was unacceptable and that he needs to apologize because he was putting them in danger and setting a horrible example for his children.\n'Bianca is really sick of his attention seeking and she knows that this is not who he truly is, but it is making her look like she is anti-Semitic which is so far from the truth.\n'She has many Jewish friends who she loves dearly and he knows this.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Kanye West files to trademark a phrase inspired by wife Bianca Censori for BIZARRE list of goods and services - from moisturizers, plush toys and 'wireless receivers in the form of jewelry' to biologi", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/tvshowbiz/article-12966185/Kanye-West-files-trademark-phrase-inspired-wife-Bianca-Censori-BIZARRE-list-goods-services-moisturizers-plush-toys-wireless-receivers-form-jewelry-biological-CLONING.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}