{"authors": ["Maighna Nanu", "Foreign Reporter"], "date_download": "2024-02-05 15:17:23", "date_modify": "None", "date_publish": "2024-01-17 00:00:00", "description": "A tunnel wide enough for a Hamas leader to drive his car underneath Gaza has reportedly been discovered by Israeli forces.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2024%2F01%2F17%2Fisrael-hamas-war-latest-news-updates-aid-day-103-live%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2024/01/17/TELEMMGLPICT000363037446_17054988724880_trans_NvBQzQNjv4Bq7IPsDfcnTKqeaUJoamuaw3hQ5CEdXUBuA9zgd9qAx_E.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "A tunnel wide enough for a Hamas leader to drive his car underneath Gaza has reportedly been discovered by Israeli forces.\nThe passage was found as troops unearthed more of the terror group’s subterranean network in recent weeks, the New York Times reported.\nUntil last month, the tunnels were assessed to stretch for some 250 miles beneath the enclave.\nBut senior Israeli defence officials, cited by the newspaper, said estimates had been revised upwards in light of recent discoveries, with the network now thought to be between 350 and 450 miles in length.\nThe Gaza Strip itself is only estimated to be around 25 miles long and six miles wide.\nOne tunnel “stretched nearly three football fields long and was hidden beneath a hospital,” the New York Times reported.\nAnother, the newspaper said, “was wide enough for a top Hamas official to drive a car inside”.\nDestroying the underground network has been one of Israel’s key aims of the war, but an official told the newspaper it could take years to destroy the system.\nSenior military officers told The Economist that the Israel Defense Forces (IDF) would not be able to destroy the entirety of the network.\nDoing so would require each tunnel to be mapped, checked for hostages and made irreparable.\nRecent attempts to destroy the network by flooding it with seawater have failed and the IDF previously conceded that it has yet to destroy half of the underground passages in Gaza.\nMilitary leaders have been surprised by the quality and depth of the tunnels, according to the New York Times.\nTwo officials cited by the newspaper assessed that there were nearly 5,700 separate shafts leading down into the network.\nDaphné Richemond-Barak, a tunnel warfare expert at Reichman University in Israel, said Israel’s stated goal of eradicating Hamas was dependent on destroying the tunnels.\n“If you want to destroy the leadership and arsenal of Hamas, you have to destroy the tunnels,” he told the New York Times. “It’s become connected to every part of the military missions.”\nSeveral Israelis who were held hostage by Hamas in the wake of the group’s October 7 attack have spoken about the spider web-like structures stretching beneath Gaza after being freed.\n“We went underground and walked for kilometres in wet tunnels, for two or three hours, in a spider’s web of tunnels,” Yocheved Lifshitz, 85, told reporters in late October.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Israel discovers tunnel 'wide enough for Hamas leader to drive his car down'", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2024/01/17/israel-hamas-war-latest-news-updates-aid-day-103-live/"}