{"authors": ["Matthew Phelan", "Matthew Phelan For Dailymail.Com"], "date_download": "2024-02-05 15:17:25", "date_modify": "None", "date_publish": "2024-01-17 18:43:07", "description": "Rep. Eric Burlison said he views 'angels' as synonymous with 'extradimensional beings.' Rep. Burlison joins Rep. Burchett in citing religious texts for UFO answers", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsciencetech%2Farticle-12974671%2FTwo-Republican-Congressmen-claim-UFOs-angels-sent-GOD-say-sightings-consistent-scriptures-Bible.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/17/17/80140967-0-image-m-142_1705513640232.jpg", "language": "en", "localpath": null, "maintext": "A second Republican congressman has publicly floated the idea that UFOs may be angels sent by God.\nMissouri lawmaker Eric Burlison, who has been privy to classified briefings on the phenomena, advanced the sensational theory on an amateur podcast this week.\n'They may not fit exactly the Biblical narrative, but whenever I use the term \"angels,\"' as he told That UFO Podcast Tuesday, 'to me, it's synonymous with an extradimensional being.'\nHe added: 'In a lot of different scriptures, including the Bible and others, that's really the way that you describe messengers of God or angels.'\nRep Burlison's comments echo statements by fellow GOP Congressman Tim Burchett, who told reporters last year that he believes 'the first chapter of Ezekiel is pretty clear of a UFO sighting.'\nAbove, Rep. Tim Burchett (left) next to fellow 'UAP Caucus' member Rep. Eric Burlison during a press conference held by members of the House Oversight committee last July ahead of the committee's public UFO hearing\nCongressman Eric Burlison told 'That UFO Podcast' Tuesday he believes 'non-human intelligences' described by UFO whistleblower David Grusch might be angelic: 'Whenever I use the term 'angels,' he said, 'to me it's synonymous with an extradimensional being'\nTheir comments highlight the frenzy of UFO speculation in Washington D.C. over the past seven months — provoked by whistleblower David Grusch's testimony that the Government is in possession of off-world craft.\nCongressman and Marine veteran Mike Gallagher, who also serves on the House Oversight committee with Reps. Burlison and Burchett, suggested last June that UFOs might be time-traveling craft piloted by humans from the future.\nRep. Gallagher compared the scenario to the plot of the 1984 film 'The Terminator.'\nThe Wisconsin Republican also floated his hypothesis that UFOs 'could actually be [from] an ancient civilization that's just been hiding here and is suddenly showing itself,' in this same June appearance on ESPN analyst Pat McAfee's sports talk show.\nTennessee Republican Congressman Tim Burchett, who serves on the House Oversight committee, told reporters last year 'the first chapter of Ezekiel is pretty clear of a UFO sighting'\nUFOs and the Bible? Rep. Burchett claimed UFOs are mentioned in the Book of Ezekiel, citing the King James version of the Bible for his analysis (right)\nCongressman Burlison made his statements Tuesday on a program devoted to the subject of these unsolved aerial mysteries, 'That UFO Podcast' hosted by Andy McGrillen in the United Kingdom.\nRep. Burlison had appeared for a 'special update pod' following House Oversight's classified UFO briefing last Friday, which covered a series of allegations made by former intelligence officer Grusch - who testified under oath that both the US military and its defense contractors are stonewalling on evidence of crashed UFOs, recovered 'beings,' and even UFO-related deaths.\n'When I read Grusch's report, that's public, that anyone can read,' Rep. Burlison told McGrillen and his listeners, 'he described that one of the theories is that what we're encountering are beings that are extradimensional or interdimensional.'\nWhile Grusch has publicly discussed theories that what are now called unidentified anomalous phenomena, or UAP, might originate from the higher-order dimensions theorized by physicists, those concepts do not appear in the unclassified version of his complaint.\nREAD MORE: Pentagon ordered to re-investigate 1945 crash of mysterious 'avocado' UFO dubbed 'Roswell before Roswell' - as expert reveals eyewitness accounts of the encounter President Biden signed into law a December 2022 amendment to investigate a UFO case from 1945. The 1945 UFO sighting was dubbed the 'Roswell before Roswell' and involved an 'avocado-shaped' craft that crashed in New Mexico. Jaques Vallée, a former contractor for the government's UFO office, wrote a book about the case and described the August 1945 crash to DailyMail.com. Vallée and his co-author interviewed witnesses who were just young children at the time of the crash, on the edge of the atomic bomb testing site near San Antonio, New Mexico - about 100 miles from the infamous Roswell crash two years later. Advertisement\nThe 'extradimensional or interdimensional' hypothesis also does not appear in what has been made public from Grusch's written statements first submitted for approval to the Pentagon's Defense Office of Prepublication and Security Review (DOPSR).\nNevertheless, Grusch did answer Rep. Burlison's questions on this theory under oath, during the House Oversight committee's public UAP hearing last July.\n'An alien species that is technologically advanced enough to travel billions of light years gets here and somehow is incompetent enough to not survive, is something that I find a little bit farfetched,' as Rep. Burlison opined at the hearing.\n'You have mentioned that there is interdimensional potential,' he continued, asking, 'Could you expound on that?'\nGrusch noted first that 'regardless of your level of sentience, you know, planes crash, cars crash, and a number of sorties [...] a small percentage are going to end in \"mission failure,\" if you will, as we say in the Air Force.'\n'In terms of multidimensionality,' the UFO whistleblower said, 'the framework that I am familiar with, for example, is something called the holographic principle.'\n'It derives itself from general relativity and quantum mechanics and that is if you want to imagine a 3D object such as yourself casting a shadow onto a 2D surface that is the holographic principle.'\n'So, you can be projected — quasi projected — from higher dimensional space to lower dimensional [space],' Grusch explained.\n'It is a scientific trope that you can actually cross, literally, as far as I understand, but there's probably guys with PhDs that could probably argue about that.'\nSpeculation linking UFOs to religious visitations and/or theories about interdimensional beings have been recurring features within the discourse on the topic since the early 20th Century.\nThe concept gained its highest and arguably most reputable profile with the publication of the book 'Passport to Magonia: from Folklore to Flying Saucers' by the astronomer and Internet pioneer Jacques Vallée in 1969.\nVallée, who later served as the inspiration for François Truffaut's character in Steven Spielberg's UFO blockbuster 'Close Encounters of the Third Kind,' had spent years pouring over volumes of ancient texts for the groundbreaking tome.\nHe paired 1180 encounters with 'luminous' flying 'earthenware vessels' reported over Japan, Roman accounts of hovering 'shields' and Native American stories of 'baskets from heaven' to argue a continuity with modern 'flying saucer' cases.\nIn more recent years, Vallée, now a Silicon Valley venture capitalist and computer scientist, published a study of physical evidence from a UFO crash in a peer-reviewed science journal, Progress in Aerospace Sciences.\nAs he told Wired, Vallée hopes that research will become 'a template [...] for what serious UFO research could be in the future, if one plays by the rules.'\nBut similar arguments, linking UFOs to demonic entities or angelic miracles, have also been made in less scholarly form on cable TV shows like 'Ancient Aliens,' and online by conspiracy theorists and evangelical Christians, among others.\nThe editor for Phenomena Magazine, Brian Allan, to cite one account, spoke to Anglican Pastor Ray Boeche who claims that a faction within the Pentagon deeply believes that UFOs are the product of demonic forces.\n'The Defense Intelligence Agency were looking at this demonic element, and they labelled these sorts of aliens as 'non human entities,' Allan said.\n'They believed that there was a demonic component to the UFO phenomenon: they are not invading us, it's Biblical.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Two Republican Congressmen claim UFOs could be 'angels' sent by GOD as they say sightings are consistent with scriptures from the Bible", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sciencetech/article-12974671/Two-Republican-Congressmen-claim-UFOs-angels-sent-GOD-say-sightings-consistent-scriptures-Bible.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}