{"authors": ["James Callery", "Perkin Amalaraj"], "date_download": "2024-02-05 15:17:26", "date_modify": "None", "date_publish": "2024-01-16 12:52:27", "description": "'A Malta-flagged, Greek-owned bulk carrier was reportedly targeted and impacted with a missile while transiting the southern Red Sea,' a maritime risk management company said.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12969041%2FAnother-merchant-ship-struck-missile-passing-Yemen-Houthis-warned-expand-attacks-include-British-vessels-Red-Sea.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/16/09/80072055-0-image-m-24_1705397391065.jpg", "language": "en", "localpath": null, "maintext": "Another merchant ship has today been struck by a missile while passing Yemen, following a string of attacks in the Red Sea by Houthi rebels.\nIt comes after Iran-backed rebels warned that they will expand attacks to include British and US vessels in the Red Sea in steps that would further disrupt global trade.\n'A Malta-flagged, Greek-owned bulk carrier was reportedly targeted and impacted with a missile while transiting the southern Red Sea northbound,' maritime risk management company Ambrey said today in an alert.\nAttacks by the Houthis on ships in the region since November have impacted companies and alarmed major powers - an escalation of Israel's war with Hamas in Gaza, with the Houthis saying they are acting in solidarity with Palestinians.\nOn Sunday, US forces shot down a Houthi cruise missile targeting an American destroyer, and on Monday a US-owned cargo ship in the Gulf of Oman was hit by another rebel missile, following Friday's US and UK retaliatory strikes on scores of sites in rebel-held Yemen.\nHouthis attacked a US-owned ship, the Gibraltar Eagle (pictured), with an anti-ship ballistic missile yesterday\nHouthi rebels have increased the frequency of their attacks against Western ships in recent months\nArmed men stand on the beach as the Galaxy Leader commercial ship, seized by Yemen's Houthis last month, is anchored off the coast of al-Salif, Yemen\nThe ship targeted today, which has visited Israel since the outbreak of war in Gaza and was headed to Suez, changed course and headed to port after the incident, Ambrey said.\nGreek-owned bulk carrier MT Zografia with 24 crew on board was hit by a missile off Yemen, two Greek shipping ministry sources told Reuters on Tuesday, confirming earlier reports.\nThe ship had no cargo on board and sustained only material damage, the Greek Shipping and Island Policy Ministry said.\nThe military spokesperson for Yemen's Houthi movement, Yahya Sarea, said in a statement that the group had targeted the Zografia ship with naval missiles, which resulted in a 'direct hit.'\nThe United Kingdom Maritime Trade Operations also said it received a report of an incident 100 nautical miles northwest of Saleef.\nThe US military said that American forces destroyed four anti-ship missiles in Yemen on Tuesday that threatened civilian and military vessels.\n'These missiles were prepared to launch from Huthi-controlled areas of Yemen and presented an imminent threat to both merchant and US Navy ships in the region,' the US Central Command said in a statement.\nThe US military also announced today that Navy SEALs seized Iranian-made missile parts and other weaponry from a ship bound for Houthi rebels in a raid last week that saw two of its commandos go missing.\nThe SEAL raid happened last Thursday, with the commandos launching from the USS Lewis B. Puller backed by drones and helicopters. The US military's Central Command said it took place in the Arabian Sea.\nThe SEALs found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said. It added that air defense parts also were found.\n'Initial analysis indicates these same weapons have been employed by the Houthis to threaten and attack innocent mariners on international merchant ships transiting in the Red Sea,' Central Command said in a statement.\nThe Houthis have warned that British and American ships in the Red Sea have now become 'legitimate targets', following joint strikes against military sites run by the group recently described by Joe Biden as 'terrorists.'\nThe group's spokesperson, Nasruldeen Amer, told Al Jazeera that it was willing to take military action against ships from the West: 'The ship doesn't necessarily have to be heading to Israel for us to target it; it is enough for it to be American.'\n'The United States is on the verge of losing its maritime security,' he added.\nThe inflammatory comments came just hours after Houthis attacked a US-owned ship, the Gibraltar Eagle, with an anti-ship ballistic missile.\nUS Central Command said yesterday afternoon: 'At approximately 4pm (Sanaa time), Iranian-backed Houthi militants fired an anti-ship ballistic missile from Houthi-controlled areas of Yemen and struck the M/V Gibraltar Eagle, a Marshall Islands-flagged, UA-owned and operated container ship.\n'The ship has reported no injuries or significant damage and is continuing its journey. Earlier in the day, at approximately 2 pm (Sanaa time), US Forces detected an anti-ship ballistic missile fired toward the Southern Red Sea commercial shipping lanes.\n'The missile failed in flight and impacted on land in Yemen. There were no injuries or damage reported.'\nEagle Bulk Shipping, the parent company of the Gibraltar Eagle, yesterday confirmed that the bulk carrier, which measures just under 200m (656ft) long, was hit while it was around 160km (100 miles) offshore in the Gulf of Aden, which flows into the Red Sea via the connecting Bab al-Mandab Strait.\nThe attacks came after the UK and US targeted several military sites in Yemen used by Houthi rebels to attack ships near the Arabian Peninsula last week.\nJoe Biden, who on Friday said Houthi rebels were part of a terrorist organisation despite a lack of an official designation, announced the airstrikes on Thursday night against the Middle Eastern nation as missiles came from fighter jets, destroyers and a submarine.\nBritain and the United States pounded several targets in rebel-held Yemen overnight over a dramatic three-hour period. This graphic shows what the US-UK coalition used to carry out the strikes, and the timeline of the mission as according to official releases\nUS and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in the Red Sea\nThe joint strikes saw more than 100 precision missiles hitting targets at around 2.30am local time on over 60 targets at 16 locations, according to the US air force, with the UK taking on 13 of the targets.\nPrime minister Rishi Sunak has faced flak for not consulting parliament before engaging in international military action, and has refused to comment on whether the UK will engage in further strikes.\nLast night, he told the Commons that he 'won't speculate on further action', adding that last week's strikes were 'a single limited action', but claiming that the UK would not hesitate to 'protect out security and interests when required.'\nHe told MPs: 'I can tell the House today that our initial assessment is that all 13 planned targets were destroyed.\n'I do not take decisions on the use of force lightly. That is why I stress that this action was taken in self-defence. It was limited, not escalatory.'\nHe was also quick to say that the UK's involvement in the strikes were 'entirely distinct' from the ongoing conflict in Gaza between Israel and Hamas.\nHe said in a separate statement following last week's strikes that the UK acted in self-defence to uphold navigational freedom, adding that there was no evidence of civilian casualties.\nFootage taken from an RAF Typhoon PoOD over Yemen, showing a targeted strike\nUK Prime Minister Rishi Sunak and US President Joe Biden, seen together in July, defended the strikes. Sunak said the strikes were 'necessary and proportionate'. Biden called the US and British strikes a 'defensive action', adding he 'will not hesitate' to order further military action\nA map of Yemen including the area that is controlled by the Houthi rebels\n'It was limited, not escalatory,' he said. 'It was a necessary and proportionate response to a direct threat to UK vessels and therefore to the UK itself.'\nThere are fears that an ongoing escalation may affect both the UK's and world's economy.\nMany shipping companies have already chosen to avoid using the Red Sea, which ordinarily sees around 10 per cent of the world's trade pass through its waters, and pass the Cape of Good Hope in South Africa, which typically adds between seven and 20 days to journeys.\nOn Sunday, Qatar, which supplies some gas to Britain, said that it was suspending shipments through the Red Sea, following the escalating attacks. QatarEnergy, the world's second largest exporter of LNG, stopped its shipments of gas through the Bab al-Mandab Strait, and was considering rerouting around the Cape of Good Hope.\nThe move has sparked fears that longer travel times may increase gas prices.\nMarco Forgione, Director General of the Institute of Export and International Trade, told MailOnline that CPI inflation could rise by up to four per cent if the conflict continues or escalates.\nPersonnel onboard HMS Diamond shoot down drones fired by Iranian-backed Houthi rebels\nPersonnel onboard HMS Diamond shoot down drones fired by Iranian-backed Houthi rebels\nMr Forgione told MailOnline: 'Consumers are lightly to see three impacts - price rises, inflation and the possibility of scarcity.\n'You could see a CPI rise of somewhere between three and four per cent if things continue like this and there is an escalation.\n'Inflation right now is going to be on products that come through the Red Sea like wheat, corn, clothing and palm oil.\n'When you're looking at more general CPI the basket of goods contains products that aren't directly impacted, but even those will suffer price pressure because global shipping costs going up.'\nMailOnline has contacted the UK's Ministry of Defence and the US' Department of Defence for comment.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Another merchant ship is struck by a missile while passing Yemen - after Houthis warned they will expand attacks to include British and US vessels in the Red Sea", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12969041/Another-merchant-ship-struck-missile-passing-Yemen-Houthis-warned-expand-attacks-include-British-vessels-Red-Sea.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}