{"authors": ["Léonie Chao-Fong", "Yohannes Lowe"], "date_download": "2024-02-05 15:17:28", "date_modify": "None", "date_publish": "2024-01-16 22:54:16", "description": "The measure is unlikely to win approval, but it’s one of several that progressives proposed to raise concern over Israel’s attacks on Gaza", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2Flive%2F2024%2Fjan%2F16%2Fdonald-trump-iowa-caucus-results-2024-election-latest-news-updates-ron-desantis-nikki-haley-republicans.json", "image_url": "https://i.guim.co.uk/img/media/652e55966bd3006dc127a2dac59f44348005aa44/0_98_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=6b0d7119eb4fbdf58a3e0b09212a79ee", "language": "en", "localpath": null, "maintext": "From 16 Jan 2024 22.35 CET Senate to debate of Sanders' measure on Israel military aid Debate is about to begin on a measure that would condition military aid to Israel on whether the Israeli war effort in Gaza is violating human rights and international accords. Introduced by Bernie Sanders, the measure is unlikely to win approval. But it is one of several measures that progressives have proposed to raise concerns over Israel’s attacks on Gaza, where the death toll surpassed than 24,000. Israel’s bombardment since October has also displaced most of Gaza’s 2.4m residents, and created a humanitarian crisis. The Senate will soon vote on my resolution directing the State Department to report on any human rights violations that may have occurred using U.S. equipment in the Israeli military campaign in Gaza.\nIt should not be controversial to ask how U.S. weapons are used. pic.twitter.com/egtZgBwO5Q — Bernie Sanders (@SenSanders) January 16, 2024 “To my mind, Israel has the absolute right to defend itself from Hamas’ barbaric terrorist attack on October 7, no question about that,” Sanders told AP in an interview. “But what Israel does not have a right to do — using military assistance from the United States — does not have the right to go to war against the entire Palestinian people,” said Sanders, the independent from Vermont. “And in my view, that’s what has been happening.”\nUpdated at 22.36 CET\n16 Jan 2024 23.54 CET Today's recap Donald Trump has won an overwhelming victory in the US’s first election contest of 2024, easily fending off a winnowed field of Republicans in the Iowa caucuses. The former president won 51% of the vote in Iowa, a 30-point lead over Ron DeSantis , the Florida governor. Nikki Haley , a former South Carolina governor and UN ambassador, trailed in third place with 19%.\nTrump’s victory in the Iowa caucuses was heralded as an early beginning to the battle for the White House itself. Using an acronym for Trump’s campaign slogan, “Make America great again”, Joe Biden told followers: “Here’s the thing: this election was always going to be you and me versus extreme Maga Republicans. It was true yesterday and it’ll be true tomorrow.”\nNikki Haley has said she will not appear on the debate stage without Donald Trump or Joe Biden. Ron DeSantis has confirmed he will be attending this week’s GOP presidential debates in New Hampshire. Trump has not participated in any of the Republican primary debates so far.\nE Jean Carroll and Donald Trump faced each other in Manhattan federal court on Tuesday in her defamation trial against the ex-president . The trial started with jury selection. Before selection started, Trump’s lead lawyer on this case, Alina Habba, told the judge that his team intends to call him as a witness.\nThe former Arkansas governor Asa Hutchinson , a stalwart conservative willing to sharply criticize Donald Trump, has suspended his beleaguered bid for the White House the day after he came in sixth place in Monday’s Iowa caucuses.\nDonald Trump is leading Joe Biden by eight percentage points among registered voters in Georgia, according to a new poll. The Atlanta Journal-Constitution poll also showed nearly 20% of voters weren’t ready to support either candidate.\nThe Senate will vote on a resolution that would freeze military aid to Israel unless the Biden administration looks into potential human rights abuses in Gaza. The measure, forced to the floor by Senator Bernie Sanders , has little chance of passing given the overwhelming support for security assistance to Israel in Congress. The chamber is expected to debate and vote tonight.\nThe US supreme court has decided it will not hear a case centering on the debate over bathrooms for transgender students. The decision came on Tuesday despite an appeal from Indiana’s metropolitan school district of Martinsville. – Guardian staff\nUpdated at 00.29 CET\n16 Jan 2024 23.35 CET Speaking on the Senate floor earlier, Republican senator Lindsay Graham said that Hamas has “militarized” schools and hospitals by operating amongst them. Israel has blamed Hamas for using hospitals for military purposes, but has not provided definitive proof backing its claims that Hamas kept a “command center” under Gaza’s main al-Shifa hospital, which the Israeli Defense Forces raided in November. Two-thirds of Gaza’s hospitals have been closed amidst what Joe Biden has characterized as “indiscriminate bombings”, during a time of acute need.\nUpdated at 23.54 CET\n16 Jan 2024 23.24 CET Sanders himself has faced criticism for declining to endorse calls for a ceasefire in Gaza, as some of his progressive colleagues have done. Amid anti-war protests across the US, progressive representatives including Rashida Tlaib, Ilhan Omar, Barbara Lee and Alexandria Ocasio-Cortez have called for a ceasefire. In a letter to Biden, many of these lawmakers stressed that thousands of children had been killed in Israeli bombings.\nUpdated at 23.39 CET\n16 Jan 2024 23.18 CET The measure that Bernie Sanders proposed uses a mechanism in the Foreign Assistance Act of 1961, which allows Congress to provide oversight of US military assistance, which must be used in accordance with international human rights agreements. The Senate will be voting on whether to ask the US state department to create a report on whether Israel has violated human rights accords using US military aid and equipment during its campaign in Gaza. If the measure passes, the state department will have to provide a report within 30 days – and aid to Israel would be cut off if human rights violations are found. Both Democrats and Republicans in congress oppose any conditions on aid to Israel, and Joe Biden has staunchly stood by Israel throughout its campaign against Gaza, so the proposal is very unlikely to be implemented. By forcing senators to vote on the record about whether they are willing to condition aid to Israel, however, Sanders and others lawmakers hope to spark debate on the matter. Progressives and Democrats have increasingly pushed to place conditions on aid to Israel, which has drawn international criticism for its offensive in Gaza. “While it is clear that Israel has the right to go to war against Hamas. It does not have the right to go to war against the Palestinian people and innocent men, women and children in Gaza,” Sanders said, speaking on Senate floor last week.\nUpdated at 23.39 CET\n16 Jan 2024 22.35 CET Senate to debate of Sanders' measure on Israel military aid Debate is about to begin on a measure that would condition military aid to Israel on whether the Israeli war effort in Gaza is violating human rights and international accords. Introduced by Bernie Sanders, the measure is unlikely to win approval. But it is one of several measures that progressives have proposed to raise concerns over Israel’s attacks on Gaza, where the death toll surpassed than 24,000. Israel’s bombardment since October has also displaced most of Gaza’s 2.4m residents, and created a humanitarian crisis. The Senate will soon vote on my resolution directing the State Department to report on any human rights violations that may have occurred using U.S. equipment in the Israeli military campaign in Gaza.\nIt should not be controversial to ask how U.S. weapons are used. pic.twitter.com/egtZgBwO5Q — Bernie Sanders (@SenSanders) January 16, 2024 “To my mind, Israel has the absolute right to defend itself from Hamas’ barbaric terrorist attack on October 7, no question about that,” Sanders told AP in an interview. “But what Israel does not have a right to do — using military assistance from the United States — does not have the right to go to war against the entire Palestinian people,” said Sanders, the independent from Vermont. “And in my view, that’s what has been happening.”\nUpdated at 22.36 CET\n16 Jan 2024 21.59 CET 'Incredibly grotesque and offensive': White House slams Trump for referring to convicted January 6 rioters as 'hostages' The White House has denounced Donald Trump’s description of jailed January 6 rioters as “hostages”, describing the former president’s comments as “incredibly grotesque and offensive”. During a rally earlier this month, Trump called on Joe Biden to “release the J6 hostages”, referring to the people imprisoned for their role in the January 6 insurrection. Trump’s comments were “grotesque and offensive”, White House press secretary Karine Jean-Pierre told reporters on Tuesday. It is offensive to compare those convicted of assaulting cops and attempting to overthrow the American government … to innocent Americans, Israelis and people of other nationalities who were abducted by Hamas on October 7.\n16 Jan 2024 21.47 CET Nikki Haley has downplayed Ron DeSantis’ trip down to South Carolina a day after his second-place finish in Iowa’s caucuses. Haley, the former governor of South Carolina, was speaking to CNN from New Hampshire: It really doesn’t matter to me why he went there. I’m sure he had a great time. South Carolina is a great state. She noted that DeSantis now faced an uphill climb in both South Carolina and New Hampshire after focusing so heavily on Iowa, AP reported. She added: He’s been invisible in both states. He is not my concern. I’m going after Trump.", "source_domain": "www.theguardian.com", "text": null, "title": "Senate to debate Bernie Sanders’ measure requiring Gaza human rights report as condition for Israel aid - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/live/2024/jan/16/donald-trump-iowa-caucus-results-2024-election-latest-news-updates-ron-desantis-nikki-haley-republicans"}