{"authors": ["Rosie Jempson"], "date_download": "2024-02-05 15:14:41", "date_modify": "None", "date_publish": "2024-01-30 09:16:00", "description": "Ukraine are using experimental ground robots equipped with machine guns in their fight against Russia.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1861138%2Fukraine-machine-gun-robots-russia-war.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5187955.jpg", "language": "en", "localpath": null, "maintext": "Ukraine: War going in 'the wrong direction' says Morawiecki\nKyiv is using experimental ground robots equipped with machine guns in the front line against Russian forces, potentially protecting Ukrainian fighters with no end to the war in sight. Pictures and videos lately seem to reveal various Ukrainian ground drones, including robots handling risky demining operations and battle bots entering the frays. Ukraine has put a lot of money into unmanned tech, from its watercrafts and aerial drones frequently spotted targeting Russian assets in the Black Sea or crossing the border into Russian areas, to the less recognised uncrewed ground vehicles (UGVs) that Kyiv continues to develop. In mid-September 2023, Ukraine's drone chief and digital transformation minister, Mykhailo Fedorov, mentioned testing their \"Ironclad\" unmanned robot in battle missions on the frontlines. Outfitted with a machine gun, or robotic combat turret, it's intended to assault enemy spots, carry out recon missions, and offer fire support, according to Fedorov. It can allegedly move at a brisk pace of up to 12 miles per hour. READ MORE: Zelensky faces 'reckoning' after Ukraine-Russia conflict ends, expert warns\nUkraine has invested heavily in unmanned technology\nAn image of a Ukrainian unmanned ground robot (UGV)\n\"The fantastic future has already arrived,\" said the Ukrainian military. They also showed a video of the fighting robot, and Ukraine's defense ministry said it's now being used by the brigade. Russia has made its own robots too, like the \"Marker\" combat robot that uses AI and is meant for fighting in Ukraine. Bendett argued: \"We are witnessing a similar pattern on both sides when it comes to UGV developments,\" He said: \"The vehicles tend to be on the smaller side, to minimize the chances of getting discovered by the ever-present aerial drones,\" adding they are often basic and cheap. \"The overall goal is to perform simple missions like advancing on the adversary position, forcing the enemy to shoot it and therefore reveal his position for subsequent strikes by ground or aerial systems,\" Bendett explained. He suggested that attaching a machine gun to this type of ground drone is a \"relatively simple\" process, and many will work together with airborne drones to guide UGVs to possible striking positions. Follow our social media accounts here on facebook.com/ExpressUSNews and @expressusnews", "source_domain": "www.express.co.uk", "text": null, "title": "Ukraine sends machine-gun mounted robots to frontline to wipe out Russian cannon fodder", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1861138/ukraine-machine-gun-robots-russia-war"}