{"authors": ["Associated Press", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:17:32", "date_modify": "None", "date_publish": "2024-01-16 06:55:11", "description": "Iran said in the early hours of Tuesday that it had fired missiles at targets in the Iraqi city of Erbil. The Iranians said the strikes were on a suspected Mossad HQ and an Islamic State site.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12967827%2Ferbil-airstrikes-iran-mossad-islamic-state.html.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/16/06/80068601-0-image-m-65_1705387020494.jpg", "language": "en", "localpath": null, "maintext": "Iran fired missiles late on Monday at what it claimed were Israeli 'spy headquarters' near the US consulate in the northern Iraqi city of Erbil, and at targets linked to the extremist group Islamic State in northern Syria.\nFour civilians were killed and six injured after missiles hit an upscale area near the U.S. consulate in Erbil, the seat of Iraq's semi-autonomous Kurdish region, according to the security council of the Kurdish regional government.\nIran's Revolutionary Guards said in a statement that it had hit a headquarters of Mossad, the Israeli intelligence agency, in the Kurdish region of Iraq.\nAnother statement said it had fired a number of ballistic missiles at 'terrorist operations,' including Islamic State targets, in Syria and destroyed them.\nPolice and soldiers are seen on Tuesday morning before dawn in Erbil, northern Iraq\nVideo provided by Rudaw TV shows smoke rising from a building hit by a strike in Erbil, Iraq, in the early hours of Tuesday\nAdditional Footage claimed to show the Impact of at least 4 Ballistic Missiles launched by the Iranian-Backed Groups towards the U.S. Consulate and International Airport within the City of Erbil in Northern Iraq. pic.twitter.com/KMYznylXDU — OSINTdefender (@sentdefender) January 15, 2024\nThe strikes come at a time of heightened tensions in the region and fears of a wider spillover of the ongoing war in Gaza.\nSince the outbreak of the Israel-Hamas war on Oct. 7, Iranian-backed militias in Iraq have launched near-daily drone attacks on bases housing U.S. forces in Iraq and Syria, which the groups have said was in retaliation for Washington's support of Israel, and in an attempt to force U.S. troops to leave the region.\nThe United States strongly condemns 'Iran's reckless missile strikes' in Erbil, said State Department spokesman Matthew Miller.\nHe said the attacks 'undermine Iraq's stability.'\nA U.S. defense official told AP the U.S. tracked the missiles, which hit in northern Iraq and northern Syria, and no U.S. facilities were struck or damaged in the attacks.\nThe official said initial indications were that the strikes were 'reckless and imprecise.'\nAn Iraqi security official said Erbil was targeted with 'several' ballistic missiles.\nAn official with an Iranian-backed Iraqi militia said 10 missiles fell in the area near the U.S. consulate.\nHe said the missiles were launched by Iran's Revolutionary Guards.\nSmoke rises over Erbil in the early hours of Tuesday morning\nAn ambulance is pictured arriving at the scene of Monday night's strikes\nPeshraw Dizayi, a prominent local businessman with a portfolio that included real estate and security services companies, was killed in one of the Erbil strikes along with members of his family, according to a post on X by Mashan al-Jabouri, a former Iraqi member of parliament.\nAl-Jabouri said that one of the missiles had fallen on Dizayi's 'palace, next to my house, which is under construction on the road to the Salah al-Din resort.'\nOther regional political figures also confirmed Dizayi's death.\nIn 2022, Iran claimed responsibility for a missile barrage that struck in the same area near the sprawling U.S. consulate complex in Erbil, saying it was retaliation for an Israeli strike in Syria that killed two members of its Revolutionary Guard.\nIran's strike in northern Syria late on Monday came after the Islamic State group claimed responsibility earlier this month for two suicide bombings targeting a commemoration for an Iranian general slain in a 2020 U.S. drone strike.\nThe attack in Kerman killed at least 84 people and wounded an additional 284 at a ceremony honoring Revolutionary Guard Gen. Qassem Soleimani.\nLast month, Iran accused Israel of killing a high-ranking Iranian general, Seyed Razi Mousavi, in an airstrike on a Damascus neighborhood.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Iranian airstrikes rock US consulate in Iraqi city of Erbil as terrifying footage shows four ballistic missiles exploding on nearby compound it claims is Israeli 'spy HQ': Four civilians are killed", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12967827/erbil-airstrikes-iran-mossad-islamic-state.html"}