{"authors": ["Martha Williams", "Martha Williams For Dailymail.Com"], "date_download": "2024-02-05 15:17:35", "date_modify": "None", "date_publish": "2024-01-16 21:45:15", "description": "Iran opened a disturbing government-run amusement park for kids where visitors dress as soldiers and fire AK-47s at U.S. flags and Netanyahu targets to 'learn' about the war.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12970771%2FWorlds-chilling-theme-park-Iran-kids.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/16/21/80100863-0-image-a-40_1705440296944.jpg", "language": "en", "localpath": null, "maintext": "The disturbing theme park is run by Iranian government to 'educate' about war\nAt the park - kids dress as soldiers and fire plastic bullets at a Netanyahu target\nIran opened a disturbing government-run amusement park for kids where visitors dress as soldiers and fire AK-47s at U.S. flags and Netanyahu targets to 'learn' about the war.\nCity of Games for Revolutionary Children is an 'amusement park' near Iran's second largest city, Mashhad.\nThe amusement park is free for visitors and targets boy aged from eight to 13 to come and 'play' soldier with each other.\nAttractions at the concerning landmark include 'attacking Iran's enemies' by shooting plastic bullets at a Prime Minister Benjamin Netanyahu target and U.S. flags.\nThe unsettling children's theme park opened in September and is suspiciously run by the government.\nIran opened a disturbing government-run amusement park for kids where visitors dress as soldiers and fire AK-47s at U.S. flags and Netanyahu targets to 'learn' about the war\nCity of Games for Revolutionary Children is an 'amusement park' near Iran's second largest city, Mashhad\nThe amusement park is free for visitors and targets boy aged from eight to 13 to come and 'play' soldier with each other\nAttractions at the concerning landmark include 'attacking Iran's enemies' by shooting plastic bullets at a Prime Minister Benjamin Netanyahu target and U.S. flags\nChildren can dress up in military fatigues and play with AK47s while they supposedly learn about the Iran-Iraq war of 1980 to 1988 - known to Iranians as 'The Holy Defense.'\nAlso featured at the park is mocking fighting in Syria, which is intended to teach kids about ISIS.\nVisitors can also take part in activities like scaling walls and crawling under barbed wire - while staff members bark orders and speakers blast recorded machine gun fire.\nThe amusement park saw so much popularity that they considered extending the parks planned schedule to keep up with the demand.\nCultural Center Director Hamid Sadeghi discussed the bizarre park in an interview with Iranian Raja News.\n'The children follow various paths simulating fighting the enemy, and at some places, the children learn about simple [combat] methods such as firing plastic artillery shells at a simulated enemy as well as aiming and firing a rifle with plastic bullets at [an effigy] of Netanyahu and at US and Israeli flags.\n'[Afterwards,] the children are blindfolded and asked to throw a ball at an Israeli flag in the form of a puzzle and knock it down, and then to assemble a puzzle of an Iranian flag.\n'The children learn that the most important element[s] for attaining victory are wisdom and intelligence for fighting the enemy,' Sadeghi said.\nWhile playing soldier is just a game for kids in Iran, just across the Persian Gulf in Yemen children are still being recruited into military ranks to fight in the country's civil war.\nThe unsettling children's theme park opened in September and is suspiciously run by the government\nChildren can dress up in military fatigues and play with AK47s while they supposedly learn about the Iran-Iraq war of 1980 to 1988 - known to Iranians as 'The Holy Defense'\nThe Yemeni civil war began in late 2014 - when Houthi forces took over the capital city Sanaa, which was followed by a rapid Houthi takeover of the government.\nThe Iranian-backed group of Houthis were struck by U.S. missiles on Tuesday - the third assault on the rebels in recent days.\nThe strike came as the Iranian-backed Houthis claimed responsibility for a missile attack against the Malta-flagged bulk carrier Zografia in the Red Sea.\nThe ship was hit, but no one was injured. The vessel had been heading north to the Suez Canal when it was attacked, the Greek Shipping and Island Policy Ministry said.\nWitnesses of the war in Yemen reported seeing children as young as seven at checkpoints - and the UN reported that between January 2020 and May 2021, nearly 2,000 children that were recruited by the Houthis died in battle.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "World's most chilling theme park in Iran where kids fire AK-47s at US flags, crawl through barbed wire & 'play' soldier", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12970771/Worlds-chilling-theme-park-Iran-kids.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}