{"authors": [], "date_download": "2024-02-05 15:17:36", "date_modify": "None", "date_publish": "2024-01-16 14:42:05", "description": "Pentagon had not previously disclosed nature of the mission SEALs were involved in", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fnavy-seals-houthi-weapons-missing-b2479477.html.json", "image_url": "https://static.independent.co.uk/2024/01/16/12/Mideast_Tensions_55432.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nTwo US Navy SEALs were lost at sea on a mission targeting Iranian weapons deliveries to Houthis in Yemen, the Pentagon said on Tuesday.\nThe night-time mission ended with the seizure of a small sailing boat that was transporting “advanced lethal aid” to the Yemeni rebel group as part of its “campaign of attacks against international merchant shipping,” the Pentagon said in a statement.\nThe SEALs had been reported missing in the days following the mission, which took place on 11 January off the coast of Somalia, but its purpose had not been revealed. The two SEALs were still lost at sea as of Tuesday morning.\nUS officials told the Associated Press this weekend that the SEALs were on an interdiction mission, and were climbing up onto the vessel when one was knocked off by high waves. The second SEAL then jumped in after the first, following protocol.\n“We are conducting an exhaustive search for our missing teammates,” said General Michael Erik Kurilla, USCENTCOM Commander.\nHouthi forces in Yemen, which are backed by Iran, have conducted regular attacks on cargo ships and fired missiles towards US Navy vessels in the Red Sea in recent months in response to Israel’s war in Gaza.\nThe US and the UK responded to the attacks with dozens of airstrikes across Yemen aimed at deterring the Houthis. The Pentagon said the mission last week was the first time it had seized Iranian-supplied, advanced conventional weapons on their way to the Houthis since the attacks on shipping began in November.\nA team of Navy SEALs operating from the USS Lewis B Puller were supported by helicopters and unmanned aerial vehicles in the mission to seize the vessel.\nThe Pentagon said the shipment included “propulsion, guidance, and warheads for Houthi medium range ballistic missiles (MRBMs) and anti-ship cruise missiles (ASCMs), as well as air defense associated components.”\nIt added that those same weapons had been used by the Houthis to attack international merchant ships passing through the Red Sea.\nGeneral Kurilla said the weapons deliveries were “yet another example of how Iran actively sows instability throughout the region in direct violation of UN Security Resolution 2216 and International law.”\nThe boat was sunk by the US Navy and its 14 crew members were taken into custody.", "source_domain": "www.independent.co.uk", "text": null, "title": "Two Navy SEALs lost at sea were involved in mission targeting Houthi weapons shipment: Pentagon", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/navy-seals-houthi-weapons-missing-b2479477.html"}