{"authors": ["Jack Simpson"], "date_download": "2024-02-05 15:17:39", "date_modify": "None", "date_publish": "2024-01-16 19:18:06", "description": "At least 60 targets in Houthi areas of Yemen were hit but the rebels say attacks will continue until Israel stops its Gaza war", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F16%2Fwhat-impact-have-uk-and-us-strikes-had-on-red-sea-shipping-disruption.json", "image_url": "https://i.guim.co.uk/img/media/fdecc38a33153f94c6fc6d95d17f6d29e7fbd198/253_391_3604_2162/master/3604.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b1e13de523dd79fc6940b635a566f237", "language": "en", "localpath": null, "maintext": "The two-month campaign by Houthi rebels against commercial ships in the Red Sea has caused severe disruption to global shipping.\nThe US and UK have responded with a series of strikes against Houthi targets aimed at stopping further attacks and protecting trade through the crucial shipping route.\nHas it worked? Here, the Guardian has a look at the impact the strikes have had on trade.\nWhat action did the US and UK take?\nIn the early hours of 12 January, the US and UK armed forces launched a string of military strikes in Yemen.\nThe strikes saw 60 targets hit across 28 Houthi-held locations in the west of Yemen, and targeted munitions depots and launching systems, in an effort to limit the rebel group’s ability to launch further attacks.\nThey came after a campaign by the Houthi rebels in the Red Sea in retaliation against Israel’s action in Gaza.\nSome of the largest shipping companies, such as Maersk, Hapag-Lloyd and Mediterranean Shipping Company, have suspended travel along the route.\nHave there been any attacks by the Houthis since the US-UK strikes?\nYes. On Tuesday, a Greek-owned bulk carrier was damaged after being hit by a missile while travelling in the southern part of the Red Sea, the third incident in three days.\nIt came after Houthi rebels hit an American-owned container ship the Gibraltar Eagle with a ballistic missile in the Gulf of Aden on Monday.\nMarco Forgione, the director general of the Institute of Export and International Trade, points out that this attack happened away from the Bab el-Mandeb strait in the Red Sea, the area where most attacks have taken place. “Now we’re seeing an escalation beyond the Red Sea,” he says.\nThe Houthis have said the US-UK strikes had little impact on their ability to carry out further attacks.\nCrucially, the group has explicitly stated that UK and US-linked ships are now targets, alongside Israeli-affiliated ships.\nHow have the US-UK strikes affected traffic?\nTraffic through the Red Sea has nosedived since the first Houthi attack on 17 November.\nAnalysis from the German economic institute IfW Kiel found that the number of containers travelling through the strait fell by 60% in December.\nBloomberg reported on Tuesday that 114 vessels had passed through Bab el-Mandeb strait in the days after the strikes. This was down from 131 a week ago, and 272 a month ago.\nNeil Roberts, the head of marine and aviation at the Lloyd’s Market Association, says a warning by the UK and US Combined Maritime Forces to avoid the area last week has led to caution from shipping operators. “There’s been a pause in some more shipping because of the warning. There are ships either end [of the Red Sea] who are in a holding pattern awaiting developments.”\nThe strikes have also prompted more tankers carrying oil and gas to avoid the strait. Unlike cargo ships, tanker traffic remained largely unchanged in December despite the Houthi attacks, but analysis by Reuters on Monday found that 15 of these tankers heading for the Red Sea had altered course.\nQatar, the world’s second largest exporter of liquified gas, confirmed it would stop sending LNG tankers through the Red Sea after the latest strikes.\nAre some ships still travelling through the area?\nYes, dozens of ships are continuing journeys despite the increased risks. But this comes at a cost, with those opting to sail on facing higher insurance premiums. Vessel insurance for passing the strait has increased to 1% of a ship’s value, from 0.7% last week.\nIt is also adding to labour costs for shipping businesses, as companies have to pay more due to the risk. In December, the International Bargaining Forum, which negotiates seafarer wages, agreed a bonus equal to their basic wage for workers for the duration of their trip through the Red Sea.\nAre these ships doing anything to avoid attacks?\n“Some of the ships are turning off their automatic identification system, other ships are declaring that they are not Israeli affiliated,” says John Stawpert at the International Chamber of Shipping.\nIn extreme cases, some vessels are declaring links to Russia and China, to ward off the Houthis.\nMany of those travelling through the strait are updating the US and UK forces on their positions more regularly, so they can respond quickly if an attack does occur.\nSome vessels are even getting US navy protection. A spokesperson for Maersk told the Guardian a US-flagged vessel owned by a subsidiary had received an escort as it was carrying cargo belonging to the US Department of Defense.\nWhere are ships avoiding the Red Sea going instead?\nThose that want to avoid the Red Sea can take the longer, and more costly, detour around the Cape of Good Hope on the southern tip of South Africa.\nA trip from Rotterdam to Singapore via the Cape of Good Hope is nearly 4,000 nautical miles longer when compared with the Red Sea route, and takes about 10 days more.\nXeneta, an ocean trade analytics platform, has estimated that this could cost up to $3m more per ship, including $1m in additional fuel and $300,000 on insurance and crew.\nWhat is happening to container prices?\nThe effect is already being felt in terms of cargo costs. The average cost of shipping a 40ft container from one location to another increased from $4,300 last weekend to $5,650 on Tuesday. A month ago, these freight rates were $1,875.\nWilliam Bain, the head of trade policy at the British Chamber of Commerce, says: “With no sign of an end to this disruption, it represents a significant challenge, especially when combined with other global headwinds which traders are facing.\n“As the price increases on shipping feed through into business costs, and supply chain disruption deepens, it will almost certainly place upward pressure on inflation.”\nAre there precedents for this disruption?\nThe “tanker wars” between Iraq and Iran, which ran from 1984 to 1988, saw both sides target merchant vessels and oil tankers across the Persian Gulf.\nStawpert says there are some similarities with piracy issues in the Indian Ocean, but adds that the Houthi missile attacks represent a greater potential for damage to vessels. In previous crises, he says, the presence of warships restored confidence for shipping businesses.\nHow long will the disruption last?\nThe answer lies largely with the Houthis. The group has vowed to continue attacks until Israel stops its war in Gaza, and this week’s attacks show it still has the capability and appetite to launch them.", "source_domain": "www.theguardian.com", "text": null, "title": "What impact have UK and US strikes had on Red Sea shipping disruption?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/16/what-impact-have-uk-and-us-strikes-had-on-red-sea-shipping-disruption"}