{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:17:41", "date_modify": "None", "date_publish": "2024-01-16 09:18:16", "description": "The two Koreas remain technically at war with the presence of nearly two million troops at the border.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fnorth-koreas-kim-jong-un-believes-unification-south-korea-no-longer-possible-1722763.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721964/north-korean-leader-kim-jong-un-has-overseen-record-breaking-number-missile-launches-weapons.jpg", "language": "en", "localpath": null, "maintext": "In a speech delivered in North Korea's parliament on Monday, Kim Jong Un made it clear that there is no possibility of the country reuniting with South Korea.\nThe state-run KCNA news agency said that Kim has decided to shut down the agencies that oversee unification efforts and inter-Korean tourism.\nThe Committee for the Peaceful Reunification of the Country, the National Economic Cooperation Bureau, and the (Mount Kumgang) International Tourism Administration will all be shut down.\nHe has also called for a change in the country's constitution so South Korea could be declared a \"hostile state\". The latest call comes days after Kim said that the country is no longer seeking reconciliation and reunification with South Korea in a New Year's day address.\nUntil now, Seoul's Unification Ministry and Pyongyang's Committee for the Peaceful Reunification used to handle the diplomatic relations between the two countries. Kim has now called for a change in the country's constitution so South Korea could be declared a \"hostile state\".\n\"The reunification of Korea can never be achieved with the Republic of Korea (South Korea's official name),\" the decision adopted by the assembly said. Kim added that the North does not want war, but also does not have any intention of avoiding it.\n\"In the event of war on the Korean Peninsula, I think it is also important to reflect on the issue of completely occupying, suppressing, and reclaiming the Republic of Korea and incorporating it into the territory of our Republic,\" Kim said.\n\"The danger of the outbreak of a war to be caused by a physical clash has considerably aggravated,\" he added.\nThe development comes after Pyongyang conducted a series of missile tests. Last week, Kim even instructed the country's army, munitions industry, nuclear weapons and civil defense sectors to accelerate war preparations. He has also vowed to put three new military spy satellites into orbit in 2024, according to a report in CNN.\nThe two Koreas remain technically at war with the presence of nearly two million troops at the border. The Korean War lasted for three years, from June 1950 to July 1953, after communist North Korea, backed by the Soviet Union and China, invaded South Korea, which was supported by United Nations forces led by the US.\nThe war ended with an armistice and the relations between the two have ebbed and flowed over the last few years. However, both countries had previously declared they wished to one day peacefully reunify the peninsula.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "North Korea's Kim Jong-Un Believes Unification With South Korea No Longer Possible", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/north-koreas-kim-jong-un-believes-unification-south-korea-no-longer-possible-1722763"}