{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:14:42", "date_modify": "None", "date_publish": "2024-01-30 18:13:25", "description": "Israeli PM also says he will not accept any truce that would require release of thousands of Palestinian prisoners", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F30%2Fhamas-leader-ismail-haniyeh-discuss-gaza-ceasefire-proposal-cairo-israel-palestine.json", "image_url": "https://i.guim.co.uk/img/media/aac9330f9bee217143b50494fadda00d1674b9af/0_32_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af4184ac9310540bdeb3a51f5f46e822", "language": "en", "localpath": null, "maintext": "Benjamin Netanyahu has said he will not accept any ceasefire deal that requires the release of thousands of Palestinian prisoners or the departure of Israeli troops from Gaza, as the Hamas leader, Ismail Haniyeh, said he was willing to travel to Cairo to discuss the proposals.\nHaniyeh said the group’s aim remained to end Israel’s military offensive in Gaza and secure a full pullout of Israeli forces from the territory.\nAlthough it was known Israel would struggle to accept such terms, Egypt, Qatar and the US are hoping to see if the two sides can be persuaded to accept a ceasefire lasting at least a month, which offers the chance for almost all the hostages to be released.\nThe proposal, described as a framework, was hammered out between Egypt, Qatar, the US and Israel on Sunday during talks in Paris. The location of the talks meant Hamas negotiators could not be present.\nNetanyahu poured cold water on any deal that required Israeli soldiers to leave Gaza permanently without a clear military victory. He said the war in Gaza was not “another round” with Hamas and he would not end it without achieving Israel’s goals.\nIn regard to reports of a potential hostage deal, the Israeli PM said the Israel Defense Forces (IDF) would not leave Gaza, and he said he had no intention of releasing thousands of “terrorists”.\nLeaks suggest the first phase of the proposed ceasefire includes the release of about 35 hostages in return for a six-week pause of the fighting. This group would include civilian women, older men and hostages who are ill or injured. In exchange, Israel would free hundreds of Palestinians from its prisons.\nThe second stage would be focused on male and female soldiers, and the third stage would exclusively involve the release of the bodies of dead hostages.\nView image in fullscreen Ismail Haniyeh said Hamas had received a ceasefire proposal, which it would not accept without the full pullout of Israeli forces from the territory. Photograph: Iranian foreign ministry/AFP/Getty Images\nNetanyahu is facing a deeply divided cabinet and knows the proposals could bring his government down. Speaking during a visit to an Israeli settlement in the West Bank on Tuesday, he said: “We will not compromise on anything less than total victory.”\nHe said Israel would achieve all its objectives, adding: “That means eliminating Hamas, returning all of our hostages and ensuring that Gaza will no longer pose a threat to Israel.” Until then, no Palestinian prisoners would be freed from Israeli jails, Netanyahu said.\nThe senior Hamas official Sami Abu Zuhri said Netanyahu’s comments “prove he isn’t interested in the success of the Paris meeting and doesn’t care about [Israeli] prisoners’ lives”.\nIsrael’s national security minister, Itamar Ben-Gvir, warned that a “negligent” deal would lead to the dissolving of the coalition.\nMeanwhile, Haniyeh said: “Our response to the proposal will be on the basis that the priority is stopping the aggression against Gaza and withdrawing the occupation forces from the strip.\n“The movement is open to discussing any serious and practical initiatives or ideas, provided that they lead to a comprehensive cessation of aggression, securing the shelter and reconstruction process, lifting the siege, and completing a serious prisoner exchange process.”\nPrecise ratios of the number of prisoners released for each category of hostage have not yet been negotiated.\nAntony Blinken, the US secretary of state, said on Monday night that “very important, productive work has been done. And there is some real hope going forward.”\nHe added: “Hamas will have to make its own decisions. I can just tell you that there is good, strong alignment among the countries involved and that this is a good, strong proposal.”\nDavid Cameron, the UK foreign secretary, has said any deal requires the removal of the Hamas military leadership from Gaza.\nMeanwhile, the Israeli army said on Tuesday it was channelling water into Gaza’s tunnels in an attempt to destroy the sprawling underground network used by Hamas to launch attacks on Israel.\nThere were 1,300 tunnels over 500km (310 miles) in Gaza at the start of the war in October, according to a study from the US military academy West Point.\nThe military vowed to destroy them after Hamas’s 7 October attack. In December, some Israeli media reported the military was leaning towards flooding the tunnels with seawater pumped from the Mediterranean. But experts warned the option was dangerous and posed huge risks to Gaza’s besieged civilians.\n“It will cause severe damage to the already fragile water and sewage infrastructure that’s in Gaza,” the then UN humanitarian coordinator for Palestinian territories, Lynn Hastings, said in December. “There’s even a risk to buildings and roads collapsing because of the increased pressure and infiltration of sea water into Gaza.”\nOn Tuesday the Israeli army said it had taken care in a way as to not “damage the area’s groundwater”. “The pumping of water was only carried out in tunnel routes and locations that were suitable, matching the method of operation to each case,” it said. “This tool is one of a range of capabilities developed by the IDF and Israel’s security establishment in recent years in order to operate against Hamas’s underground infrastructure in the Gaza Strip.”\nThe Israeli army says many hostages taken by Hamas have been or continue to be held in the vast network of tunnels.\nThe Gaza health ministry said the death toll in the territory was continuing to rise, with 26,751 Palestinians killed and 65,636 injured.\nLord Cameron spoke by phone with the Jordanian foreign minister, Ayman Safadi, to discuss the ceasefire proposal.\nSafadi warned Cameron about the decision of the UK to suspend payments to UNRWA, the UN relief agency for Palestinians, saying it played an indispensable and irreplaceable role in helping Palestinians confront the humanitarian disaster in Gaza.\nThe UK, in common with at least 10 other donors, has suspended funding after allegations by Israeli intelligence services that nine UNRWA employees were involved in the attacks on Israel on 7 October. The suspension is pending an inquiry being conducted by the UN.\nAFP contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "Netanyahu rules out ceasefire deal that would mean Gaza withdrawal", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/30/hamas-leader-ismail-haniyeh-discuss-gaza-ceasefire-proposal-cairo-israel-palestine"}