{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:17:42", "date_modify": "None", "date_publish": "2024-01-15 03:16:26", "description": "The two Navy SEALs missing off the coast of Somalia after one of them slipped while trying to climb a ladder were attempting to board a ship that was smuggling Iranian weapons to Houthi rebels.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12963283%2FNavy-SEALs-lost-Houthi-weapons-ship-Iran-Yemen.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/15/03/80013553-0-image-a-9_1705288362732.jpg", "language": "en", "localpath": null, "maintext": "The two Navy SEALs missing off Somalia after one of them slipped while trying to climb a ladder were trying to board a ship smuggling Iranian weapons to Houthi rebels in Yemen, it has been revealed.\nThe mission was part of a VBSS - visit, board, search and seizure - and are usually carried out by some of the military's best-trained, elite soldiers.\nNational Security Council spokesman John Kirby told CBS News Sunday they're working on disrupting Iranian shipments of weapons to the Houthis but are not related to the American airstrikes targeting the militant group's facilities.\nKirby said the search was 'still ongoing' but they hoped to get some new information on Sunday.\nThe SEALs often work with military personnel from allied nations to stop groups like the Houthis from being able to smuggle weapons into the region.\nThe first service member slipped off the ladder into the Gulf of Aden on Thursday, according to officials, and the second one dove back in to help them.\nThe two Navy SEALs missing off the coast of Somalia after one of them slipped while trying to climb a ladder were attempting to board a ship that was smuggling Iranian weapons to Houthi rebels in Yemen\nThe SEALs often work with military personnel from allied nations to stop groups like the Houthis from being able to smuggle weapons into the region\nIt is unclear if any other service personnel were on the mission, whether they were able to board the ship and if any weapons were found.\nThe military is continuing to conduct a search-and-rescue mission in the gulf, which is known for it's warmer waters and powerful swells.\nOfficials told the Washington Post there remain hopes to find the still-unidentified personnel alive.\nYemen has become a staging ground for attacks by the rebels on commercial vessels in the Red Sea.\nThe US Navy has conducted regular interdiction missions, where they have intercepted weapons on ships that were bound for Houthi-controlled Yemen.\nThey sometimes include boarding vessels to make sure they have the proper credentials and aren't transporting illegal goods.\nThe mission was not related to Operation Prosperity Guardian, the ongoing U.S. and international mission to provide protection to commercial vessels in the Red Sea.\nIt was also not in connection with the seizure of the oil tanker St. Nikolas by Iran, a third US official said.\nTwo Navy SEALs are missing off the coast of Somalia after one of them slipped while trying to climb a ladder on board a ship\nThe military personnel were on an interdiction mission, climbing up a vessel when one got knocked off by high waves in the rough sea on Saturday, according to US officials. Pictured Navy SEALs on a mission\nJohn Kirby, the spokesman for the National Security Council, told CBS News Sunday that they're working on disrupting Iranian shipments of weapons to the Houthis but are not related to the American airstrikes targeting the militant group's facilities\nBesides the defense of ships from launched drones and missiles shot from Houthi-controlled areas of Yemen, the US military has also come to the aid of commercial ships that have been the targets of piracy.\nIn a statement Saturday, US Central Command said that search and rescue operations are currently ongoing to locate the two sailors.\nThe command said it would not release additional information on the Thursday night incident until the personnel recovery mission is complete.\nThe sailors were forward-deployed to the US 5th Fleet area of operations supporting a wide variety of missions.\nWhile not connected, the mission does coincide as the US has unleashed a new wave of strikes against Houthi targets in Yemen.\nThe blitz on Friday came a day after initial strikes against over 60 targets used by the Iranian-backed rebels to attack ships in waters near the Arabian Peninsula.\nThe second round of bombing was much smaller in scale and targeted a Houthi radar facility, an official confirmed. It came after the Houthis fired at least one anti-ship missile earlier the same day.\nBiden had vowed to continue the bombardment if the Houthis refused to cease attacking vessels in the Red Sea.\nBut in New York City protests erupted after demonstrators swarmed First Avenue near the United Nations Yemen Mission to condemn the attack.\nThe US deployed a new round of strikes against Houthi targets in Yemen on Friday, targeting a radar facility\nShortly after protesters descended on the United Nations Yemen Mission in New York to condemn the strike\nThe raid on the radar facility came after the Houthis launched an anti-ship ballistic missile in retaliation for the overnight strikes by US and British forces on Thursday\nThe latest round of strikes were smaller in scale than the initial wave seen on Thursday. Protesters gathered to demand an end to all strikes.\nThe official confirmed the latest strikes were conducted unilaterally by the US.\nHowever, the Houthi-run al-Masirah TV station claimed that the US and the UK had been involved in the strikes on the Yemeni capital of Sanaa.\nUK Ministry of Defence sources said any suggestions of UK involvement in the second round of strikes against the Houthis were inaccurate. A formal statement confirming the UK's non-involvement is expected later today.\nA source said: 'There was no UK participation in these strikes – it was a unilateral action carried out by the US.'\nBut Thursday's blitz, a response to attacks on cargo ships by Houthis in the Red Sea, was a cooperative effort between the US, UK and other allied nations.\nThe assault struck more than 60 targets, killing five people and wounding six more, a spokesman for the Houthi military told CNN.\nBut US officials determined the additional location, a radar site, still presented a threat to maritime traffic, one official said.\nPresident Joe Biden said on Friday that the American airstrikes against the Houthi in Yemen were a success, adding that he's delivered a message to Iran with them.\n'I don't think there's any civilian casualties — that's another reason why it's a success,' Biden told reporters traveling with him in Pennsylvania.\nThe White House has said the airstrikes in Yemen, most of which is controlled by the Houthis, were in retaliation for months of attacks by the movement on Red Sea shipping that the rebels cat as a response to the ongoing war in Gaza.\nHowever their targets have become increasingly random and caused disruption to global shipping channels.\nWhen asked if he has a message for Iran, Biden said: 'I've already delivered the message to Iran.'\nThe president also noted Tehran 'doesn't want a war with us,' but said he is willing to bomb the Houthi again if they keep striking at American troops.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "REVEALED: Two Navy SEALs lost at sea off the coast of Somalia went missing when one slipped on a ladder while boarding a ship that was taking Iranian weapons to Houthi rebels in Yemen", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12963283/Navy-SEALs-lost-Houthi-weapons-ship-Iran-Yemen.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}