{"authors": [], "date_download": "2024-02-05 15:17:44", "date_modify": "None", "date_publish": "2024-01-15 00:00:00", "description": "IAN SINCLAIR fills in some of the background that’s all too frequently missing from mainstream reports on the Middle East", "filename": "https%3A%2F%2Fmorningstaronline.co.uk%2Farticle%2Fmissing-action-essential-context-israeli-attack-gaza.json", "image_url": "https://morningstaronline.co.uk/sites/default/files/AP24013611370112.jpg", "language": "en", "localpath": null, "maintext": "“MOST studies carried out prior to the current fighting in Gaza… have repeatedly found that it is the Israeli perspective that is favoured” in broadcast news coverage, Greg Philo and Mike Berry from the Glasgow Media Group recently noted in Open Democracy. Moreover, their own research in the 2000s found important historical background was often missing from British media reporting.\nFor example, during the second intifada (the Palestinian uprising from 2000 to 2005) the two academics sampled 3,500 lines of transcribed news text from the first three weeks of the rebellion on BBC1 and ITV1 lunchtime, early evening and late news bulletins. Only 17 lines across both channels mentioned any aspect of the history of the conflict.\nSince the October 7 attack on Israel, the mainstream media has continued to ignore crucial context and information.\nIsrael is using starvation of civilians as a weapon of war in Gaza\nOn October 9 Israeli Defence Minister Yoav Gallant stated Israel was “imposing a complete siege on Gaza. No electricity, no food, no water, no fuel. Everything is closed. We are fighting human animals and we are acting accordingly.”\nPredictably, in December Human Rights Watch reported that “the Israeli government is using starvation of civilians as a method of warfare in the Gaza Strip,” which is a war crime.\nIsrael targets medical facilities in Gaza\nIn December, the United Nations High Commissioner for Human Rights reported “at least 364 attacks on healthcare services have been recorded in the occupied Palestinian territory” since October 7, “resulting in at least 553 people killed and 729 injured.”\nIsrael has declared an “unrelenting war” on the health system in Gaza, UN Special Rapporteur on the Right to Health Tlaleng Mofokeng stated: “The practice of medicine is under attack.”\nIn November, Medecins Sans Frontieres reported one of their evacuation convoys “came under fire in Gaza City in what immediately appeared to be a deliberate attack against clearly identified MSF vehicles” (“all elements point to Israeli army responsibility,” was the report’s title).\nThis is not new. Based on testimony from doctors, nurses and ambulance personnel, in 2014 Amnesty International called for an immediate investigation “into mounting evidence that the Israel Defense Forces launched apparently deliberate attacks against hospitals and health professionals in Gaza, which have left six medics dead.”\nIsrael has a long history of using human shields\n“Since the beginning of the occupation in 1967, Israeli security forces have repeatedly used Palestinians in the West Bank and Gaza Strip as human shields,” B’Tselem, Israel’s premier human rights organisation, confirmed in 2017.\n“As part of this policy, soldiers have ordered Palestinian civilians to remove suspicious objects from roads, to tell people to come out of their homes so the military can arrest them, to stand in front of soldiers while the latter shoot from behind them, and more.”\nAmnesty International have also documented the widespread use of human shields by Israeli forces, and a 2013 United Nations committee on the rights of the child report voiced concern about Israel’s “continuous use of Palestinian children as human shields and informants.”\nIsrael helped to create Hamas\nIn a 2018 video for The Intercept Mehdi Hasan explained that in the 1970s and ’80s Israel empowered the precursor to Hamas, Sheikh Ahmed Yassin’s Mujama al-Islamiya association, in an attempt to undermine the power of the dominant Palestinian force, the secular nationalist Palestinian Liberation Organisation.\nWhen Yassin, who went on to found Hamas, led the building of Islamist schools, clubs, clinics and mosques in Gaza, Israel helped fund some of the projects. “Hamas, to my great regret, is Israel’s creation,” Avner Cohen, the Israeli official responsible for religious affairs in Gaza until 1994, told the Wall Street Journal in 2009.\nAnd it’s not ancient history. In December the New York Times published a bombshell story, reporting that for many years Qatar has been sending millions of dollars month to Gaza, helping to prop up the Hamas government.\nIn September Qatar asked Israel whether they wanted the payments to continue. Israel confirmed they did. According to the New York Times, Israel saw the money as a way of maintaining the peace in Gaza, by keeping Hamas focused on governing rather than fighting.\nHowever, the report also referred to “the Israeli government’s view that Hamas was… a political asset.” Why? We are back to divide and rule. In 2012 Israeli Prime Minister Netanyahu “told the prominent Israeli journalist Dan Margalit that it was important to keep Hamas strong, as a counterweight to the Palestinian Authority in the West Bank… having two strong rivals… would lessen pressure on him to negotiate toward a Palestinian state.”\nHamas has repeatedly offered peace to Israel\nWhile Hamas is generally presented as a intransigent, fanatical organisation dedicated to the destruction of Israel, writing in Peace News recently Milan Rai explained: “Hamas has consistently, repeatedly and publicly offered Israel a 10-year truce or hudna — on condition that Israel withdraw to its 1967 border.”\nRai lists 10 examples of Hamas peace offers over the last 30 years, including when Jimmy Carter met Hamas leaders in Syria in 2008.\nHis reading is broadly confirmed by a 2009 report from the United States Institute of Peace, a think tank funded by the US Congress, which noted Hamas “has sent repeated signals that it may be ready to begin a process of coexisting with Israel” and “indicated on a number of occasions its willingness to accede to a hudna with Israel.”\nIsrael has repeatedly rejected peace with the Palestinians\n“In the speeches of [US] politicians and in [US] newspapers op-eds, it’s a matter of faith that Israel has always yearned for peace but has been constantly rebuffed by the Palestinians,” The Intercept’s Jon Schwarz noted in November. “This is not quite 180 degrees the opposite of reality, but close. In the actual world… Israel could have had peace at many times in the past 75 years.”\nSchwarz continued: this would require “Israel giving up most of the Palestinian land — specifically, Gaza and the West Bank, including East Jerusalem — it conquered in the six-day war in 1967. Israel has always preferred conflict with stateless Palestinians to that.”\nThe crucial obstruction is Israeli opposition to a viable Palestinian state. As liberal icon Israeli prime minister Yitzhak Rabin explained after the much ballyhooed 1993 Oslo Accords, “We do not accept the Palestinian goal of an independent Palestinian state between Israel and Jordan. We believe there is a separate Palestinian entity short of a state.”\nThe US and UK have repeatedly blocked non-violent attempts by Palestinians to protect themselves from Israeli aggression and end the occupation\nIn 2015 the Palestinian Authority (PA) asked permission for the International Criminal Court (ICC) to open an investigation in war crimes committed by Israel in the West Bank. “This led to the US and UK coming down on the PA like a ton of bricks,” the Guardian reported in November. After being urged to drop the ICC investigation by President Joe Biden in 2022, the Guardian noted “[Palestinian President] Abbas refused, saying it was one of the few non-violent routes available to opposing Israeli settlements.”\nDitto the December 2022 request from the United Nations general assembly for an advisory opinion from the International Court of Justice on the legality of Israel’s occupation of the Palestinian territories — also opposed by the US and Britain. Indeed the Guardian disclosed that “even a modest attempt [by the Palestinians] to join the UN’s tourism body” in 2017 “was abandoned due to US pressure.”\nAnd when Hamas defeated Fatah in the 2006 Palestinian parliamentary elections, the US quickly moved to punish the winners of the democratic vote, imposing economic sanctions. More shockingly, the US covertly attempted “to provoke a Palestinian civil war,” Vanity Fair revealed in 2008. “The plan was [to arm Fatah]… with new weapons supplied at America’s behest, to give Fatah the muscle it needed to remove the democratically elected Hamas-led government from power.”\nWriting in his 2010 book Hamas: A Beginner’s Guide, Khaled Hroub explains the ramifications of Israeli, US and British efforts to block Palestinian initiatives to protect themselves from Israeli aggression and end the occupation.\n“When [Palestinian] people have been more hopeful of movement in peace talks with Israel, Hamas’s ‘programme for resistance’ tended to generate more doubt, and a drop in Hamas supporters followed. By contrast, when frustration with fruitless talks has been mounting and exacerbated by continuous Israeli humiliation of Palestinians, in such a charged atmosphere Hamas has tended to gain more support in any elections held.”\nFollow Ian on X @IanJSinclair.", "source_domain": "morningstaronline.co.uk", "text": null, "title": "Missing in action: essential context in the Israeli attack on Gaza", "title_page": null, "title_rss": null, "url": "https://morningstaronline.co.uk/article/missing-action-essential-context-israeli-attack-gaza"}