{"authors": ["Adam Fulton", "Maya Yang", "Yohannes Lowe", "Helen Livingstone"], "date_download": "2024-02-05 15:17:46", "date_modify": "None", "date_publish": "2024-01-15 02:02:13", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F14%2Fmiddle-east-crisis-live-netanyahu-says-world-court-cannot-stop-israel-in-gaza-as-war-enters-100th-day.json", "image_url": "https://i.guim.co.uk/img/media/885dfc9ba3e93987912f6ff40460e85abfe16561/0_491_7363_4418/master/7363.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=84abd2dada8cdc72ff23bc74a862b167", "language": "en", "localpath": null, "maintext": "From 14 Jan 2024 18.45 CET UNRWA: Gaza's humanitarian crisis 'one of the most complex and challenging in the world' The United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) has called the ongoing humanitarian crisis in Gaza caused by Israel’s attacks across the strip – which have killed nearly 24,000 Palestinians and displacing nearly 2 million more Palestinians – one of the world’s “most complex and challenging” operations. In a tweet on Sunday following 100 days of Israel’s war on Gaza, the UNRWA said: The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity. The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity\nThe humanitarian operation has become one of the most complex & challenging in the world\nDue to tight siege on #GazaStrip, aid delivered is not nearly enough to meet the needs pic.twitter.com/5MQn3yNe9I — UNRWA (@UNRWA) January 14, 2024\nUpdated at 18.48 CET\n15 Jan 2024 02.30 CET Closing summary It’s 3.30am in the Gaza Strip and Tel Aviv and we’re about to pause this live coverage. A new blog can be found here. All our reporting on the Israel-Gaza war and wider Middle East crisis can be seen here. A recap of the latest key developments follows. Thanks for reading. A total of 23,968 Palestinians have been killed and another 60,582 injured by Israeli strikes on Gaza since 7 Octobe r, the Hamas-run Gaza health ministry said on Sunday. In the past 24 hours, 125 Palestinians were killed and 265 were injured, the ministry added.\nThree gunmen who crossed into Israel from Lebanon and two Israelis were killed in clashes and a strike along the frontier between the two countries on Sunday, the army and medics said. Five soldiers were wounded in the firefight with the gunmen, the Israeli military said. Earlier, an Israeli man was pronounced dead and a woman, who the local municipality said was his mother, died later after a missile strike in the Israeli border community of Kfar Yuval that reportedly wounded multiple Israelis.\nThe US has denied Houthi reports that it carried out new attacks in Yemen that hit the port city of Hodeidah on Sunday. Speaking to Agence France-Presse on condition of anonymity, a US defence official said: “No US or coalition strike occurred today.”\nArab-Israeli legislator Ahmad Tibi said on social media that three of his relatives , including a 10-year-old boy, had been killed in a strike on Nuseirat refugee camp in central Gaza.\nHamas has aired video footage showing three Israeli hostages it is holding in Gaza in which they urged Israel’s government to stop its offensive against the militant group and bring about their release, as both sides marked the 100th day of the war. The undated 37-second video of the three captives – aged 26, 53 and 38 – aired on Sunday ended with the chyron: “Tomorrow we will inform you of their fate.”\nHezbollah chief Hassan Nasrallah said Israel had “failed” in Gaza and would be forced to negotiate. He made the remarks in a televised address on Sunday.\nBangladesh has voiced its support for South Africa in its genocide case against Israel at the international court of justice. Bangladesh “welcomes the opportunity to file a declaration of intervention in the proceedings in due course”, its ministry of foreign affairs said. Namibia, meanwhile, rejected what it called Germany’s support of the “genocidal intent of the racist Israeli state against innocent civilians in Gaza”. The Namibian presidency pointed to Germany’s “inability to draw lessons from its horrific history”, citing the 20th century’s first genocide – the Herero-Namaqua genocide perpetrated by German forces on Namibian soil from 1904-08.\nThe UN agency for Palestinian refugees (UNRWA) has called the ongoing humanitarian crisis in Gaza caused by Israel’s attacks across the strip – which have displaced nearly 2 million Palestinians – one of the world’s “most complex and challenging” operations. The UNRWA said on X (formerly Twitter) on Sunday: “The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity.”\nThe World Health Organisation and its partners have visited al-Aqsa hospital in central Gaza and Nasser medical complex in Khan Younis , southern Gaza. WHO chief Tedros Ghebreyesus said on X that both hospitals required “sustained support and protection to remain operational” and that they were “vital lifelines for patients and thousands of displaced people in Gaza”.\nThe Palestine Red Crescent Society has set up shelter tents for 315 displaced Palestinian families in the Mawasi Rafah area near the Egyptian border.\nAn Israeli footballer who displayed a message referring to the Israel-Gaza war during a match in Turkey has been arrested, according to reports in Turkish media. Earlier on Sunday, the country’s justice minister announced an investigation into Sagiv Jehezkel for suspected “incitement to hate” after his club, Antalyaspor, sacked him over the matter. Jehezkel scored a goal for his team and then displayed a message reading “100 days. 07/10” on a bandage on his wrist.\nUpdated at 08.44 CET\n15 Jan 2024 01.49 CET China is calling for a larger-scale, more authoritative and effective international peace conference over the Israel-Hamas war and a concrete timetable to implement a two-state solution, its foreign minister has said. Wang Yi made the comments to reporters after talks with the Egyptian foreign minister, Sameh Shoukry, in Cairo on the war, according to a statement from the Chinese foreign ministry late on Sunday. Reuters also reports that separately, Wang also held talks with the secretary general of the League of Arab States and the two sides had an in-depth exchange of views on the conflict, reaching several points on helping to solve the crisis. Wang, China’s top diplomat, is currently travelling through Egypt, Tunisia, Togo and the Ivory Coast until Thursday. View image in fullscreen Wang Yi and Sameh Shoukry at a press conference after their meeting at Tahrir palace in Cairo on Sunday. Photograph: Khaled Elfiqi/EPA After talks with his Egyptian counterpart, Wang said the conflict in Gaza was continuing to escalate and “is causing massive casualties among innocent civilians, leading to serious humanitarian disasters and accelerating the spread of negative spillover effects”, according to the Chinese foreign ministry statement. He said China had decided to provide a third tranche of emergency humanitarian assistance. Wang also said the international community should listen carefully to the legitimate concerns of countries in the region, “and the future governance of Gaza should be an important step towards the two-state solution”.\nUpdated at 02.03 CET\n15 Jan 2024 01.10 CET An Israeli footballer who displayed a message referring to the Israel-Gaza war during a match in Turkey has been arrested, according to reports in Turkish media. Earlier on Sunday, the country’s justice minister announced an investigation into Sagiv Jehezkel over the incident for suspected “incitement to hate”, after his club, Antalyaspor, sacked him over the matter. After scoring a goal for his team against Trabsonspor, Jehezkel revealed a message which read “100 days. 07/10” on a bandage on his left wrist. The message was a reference to the Hamas’s 7 October attack and the number of days that more than 130 Israeli hostages have been held in Gaza. See the full report here: Israeli footballer reportedly arrested after displaying Gaza war message during match in Turkey Read more\n14 Jan 2024 00.50 CET Three militants and two Israelis killed in clashes near Lebanon border, says Israel Three gunmen who crossed into Israel from Lebanon and two Israelis were killed in clashes and a strike along the frontier between the two countries on Sunday, the army and medics said. The Israeli military said troops patrolling a contested border area “identified a terrorist cell who crossed from Lebanon into Israeli territory and fired at the forces” overnight, Agence France-Presse reports. Three gunmen who clashed with troops were shot dead, the army said, revising an earlier statement that said four militants had been killed. The army said five soldiers were wounded in the firefight. A group calling itself Kataeb Al-Ezz Al-Islamiya later said the fighters were from its ranks, Lebanese media reported. The group said the assault was in response to the killing of Hamas deputy chief Saleh al-Aruri in a suburb of Beirut on 2 January. A US defence official has told AFP that Israel carried out the strike that killed Aruri. Later on Sunday, the Israeli military said warplanes struck Hezbollah positions following a missile strike on a house in the border community of Kfar Yuval that wounded multiple Israelis. View image in fullscreen Smoke billows over the Lebanese village of Adayseh during an Israeli bombardment on Sunday. Photograph: Jalaa Marey/AFP/Getty Images The Magen David Adom emergency service said an Israeli man was pronounced dead after the missile strike in Kfar Yuval and a 70-year-old woman was in a serious condition. The local municipality said later that the woman had died and the man who had died was her son. Since the war between Israel and Hamas in the Gaza Strip erupted on 7 October, the Israel-Lebanon border has seen near-daily exchanges of fire between Iran-backed Hezbollah militants and Israeli forces. Hezbollah leader Hassan Nasrallah said in a televised speech on Sunday that the Israelis had “failed” to achieve any of their goals in Gaza.\nUpdated at 02.36 CET\n14 Jan 2024 00.17 CET Hamas airs video of three hostages Hamas has aired video footage showing three Israeli hostages it is holding in Gaza in which they urged Israel’s government to stop its offensive against the militant group and bring about their release, as both sides marked the 100th day of the war. The undated 37-second video of the three captives – aged 26, 53 and 38 – aired on Sunday ended with the chyron: “Tomorrow we will inform you of their fate.” Reuters reports that Hamas said earlier on Sunday it had lost contact with some hostages as Israeli forces shelled Gaza, noting that they might have been killed in the process. At the outset of the war, it also threatened to execute hostages in retaliation for Israeli military strikes. Israeli officials have generally declined to respond to Hamas’s public messaging on the hostages, casting it as psychological warfare. Hagar Mizrahi, a forensic official with Israel’s ministry of health, told local television on 31 December that autopsies of slain hostages who had been recovered found causes of death inconsistent with Hamas’s account they had died in airstrikes. Israel has made clear it is aware of the risks to hostages from its offensive and says is taking precautions. Its operation was being adapted “in accordance with the threats and the hostages who are in the field”, military spokesperson Daniel Hagari said on Sunday. Of about 240 people seized by Hamas in its 7 October killing spree that sparked the war, about half were released in a November truce. Israel says 132 remain in Gaza and that 25 of them have died in captivity. This is Adam Fulton picking up our live coverage. Stay with us for all the latest developments\nUpdated at 00.36 CET\n14 Jan 2024 00.02 CET Summary Here is where things stand: The Palestine Red Crescent Society has set up shelter tents for 315 Palestinian families displaced by Israeli attacks on Gaza in the Mawasi Rafah area near the Egyptian border. Since 7 October, Israeli forces have forcibly displaced nearly 2 million Palestinians across Gaza, leaving many stranded in the southern tip of Gaza amid severe shortages of food, water, medical supplies and fuel.\nBangladesh has voiced its support for South Africa in its genocide case against Israel at the International Court of Justice. In a statement released on Sunday, Bangladesh’s ministry of foreign affairs said that Bangladesh “welcomes the opportunity to file a declaration of intervention in the proceedings in due course”.\nThe US has denied Houthi reports that it carried out new attacks in Yemen on Sunday. Speaking to Agence France-Presse on condition of anonymity, a US defense official said: “No US or coalition strike occurred today.” The official’s statements come in response to Houthi media reporting that US and UK airstrikes hit Yemen’s port city of Hodeidah.\nHezbollah chief Hassan Nasrallah said that Israel has “failed” in Gaza and will be forced to negotiate, Agence France-Presse reports. In a televised address on Sunday, Nasrallah said: “What has the enemy achieved in 100 days, other than killing? … It has failed in achieving its declared, half-declared and implicit objectives … If this path continues … the enemy government will have no other choice but to accept the conditions of the resistance in Gaza, thereby putting an end to the aggression against Gaza and entering into negotiations.”\nNamibia has rejected Germany’s support of the “genocidal intent of the racist Israeli state against innocent civilians in Gaza ”. In a statement released over the weekend, the Namibian presidency pointed to Germany’s “inability to draw lessons from its horrific history”, citing the 20th century’s first genocide – the Herero-Namaqua genocide perpetrated by German forces on Namibian soil from 1904 to 1908 which killed between 24,000 to 100,000 Hereros and 10,000 Nama.\nUNRWA has called the ongoing humanitarian crisis in Gaza caused by Israel’s attacks across the strip – which have killed nearly 24,000 Palestinians and displacing nearly 2 million more Palestinians – one of the world’s “most complex and challenging” operations. In a tweet on Sunday following 100 days of Israel’s war on Gaza, the UNRWA said: “The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity.”\nThe World Health Organization (WHO) and its partners have visited al-Aqsa hospital in central Gaza and Nasser medical complex in Khan Younis, southern Gaza. In a post on Twitter/X, WHO chief Tedros Ghebreyesus said that both hospitals are “vital lifelines for patients and thousands of displaced people in Gaza” and that they require “sustained support and protection to remain operational”.\nUpdated at 00.05 CET\n14 Jan 2024 23.41 CET Tensions in the Red Sea are simmering as all sides, including the US, Yemen’s Houthis and Hezbollah, warn of possible further attacks. The Guardian’s Dan Sabbagh reports: Tensions remained high in the Middle East on Sunday as western leaders, the Houthis and their allies all warned of possible further action in the aftermath of Friday’s US-UK bombing of rebel-held areas in Yemen. As initial briefings from the US suggested that only about a quarter of the Houthis’ missile and drone attack capability had been destroyed, reports emerged of two boats trying to threaten a merchant ship in the southern Red Sea. A Houthi spokesperson said on Sunday that the group’s attacks on merchant shipping travelling the busy waterway south of the Suez Canal would continue “because they are at war with Israel.” Hussain al-Bukhaiti said that if the US and UK continued to bomb Yemen, Houthi forces would attack western warships “maybe using hundreds of drones and missiles,” which would represent a significant escalation. Not all the ships targeted since the Hamas attack on Israel on 7 October have had Israeli links. The UK foreign secretary, David Cameron, told the BBC the west was “prepared to back our words with actions” should Houthi attacks continue, while the US and UK warships remained on high alert in the region. The leader of Hezbollah, a Houthi ally, said all ships in the southern Red Sea were now in danger. Hassan Nasrallah said the US bombing on Friday “will harm the security of all maritime navigation” because “the sea has become a theatre of fighting, missiles, drones and warships.” Read the full story here: Red Sea tensions simmer as all sides warn of possible further attacks Read more\nUpdated at 00.00 CET\n14 Jan 2024 23.18 CET Bangladesh has voiced its support for South Africa in its genocide case against Israel at the International Court of Justice. In a statement released on Sunday, Bangladesh’s ministry of foreign affairs said that Bangladesh “welcomes the opportunity to file a declaration of intervention in the proceedings in due course”. “Bangladesh calls on all states to respect their obligations under the Genocide Convention to prevent and punish the crime of genocide,” it added. #Bangladesh 🇧🇩 stands in support of South Africa 🇿🇦 in its case against #Israel before #ICJ under 1948 #Genocide Convention; welcomes the opportunity to file a declaration of intervention in the proceedings in due course.\nFull press statement👇#StopGazaGenocide #NeverAgain pic.twitter.com/spKO6G86Fz — Bangladesh@UN (@BangladeshUN1) January 14, 2024\nUpdated at 23.19 CET\n14 Jan 2024 22.51 CET The Palestine Red Crescent Society has set up shelter tents for 315 Palestinian families displaced by Israeli attacks on Gaza in the Mawasi Rafah area near the Egyptian border. ⭕️The PRCS National Disaster Response Team set up shelter tents today for 315 displaced families without housing in 📍the Mawasi Rafah area near the Egyptian border. #Gaza#Humantarians pic.twitter.com/mPXkmLfMHi — PRCS (@PalestineRCS) January 14, 2024 Since 7 October, Israeli forces have forcibly displaced nearly 2 million Palestinians across Gaza, leaving many stranded in the southern tip of Gaza amid severe shortages of food, water, medical supplies and fuel.\nUpdated at 22.54 CET\n14 Jan 2024 22.24 CET South Africa's ICJ legal team welcomed back to Johannesburg airport with cheers and praise South Africa’s legal team, which presented its case of genocide against Israel at the International Court of Justice (ICJ) earlier this week, has been welcomed with cheers and praise at Johannesburg airport following their return from The Hague. Videos posted online showed crowds of supporters gathering at OR Tambo international airport over the weekend to welcome the legal team, with many waving South African and Palestinian flags. Other supporters held signs that read: “Not all heroes wear capes” while chanting “Free, free Palestine!” South Africa's legal team in the genocide case against Israel at the ICJ has arrived back at OR Tambo International airport.#Newzroom405 pic.twitter.com/wtS7IN56Lj — Newzroom Afrika (@Newzroom405) January 14, 2024 Speaking to reporters, Tembeka Ngcukaitobi, a legal scholar and one of the lawyers on South Africa’s team, said: “The struggle continues. This is an episode in a long struggle … It is about 75 years of occupation … This week marked an important episode, but it did not mark the culmination. It marked a very crucial turning point in having the world look at the issue through a legal lens, but the overall struggle itself will continue beyond this … We have been very humbled that we have been able to contribute a very small part to an otherwise long and courageous struggle of the Palestinian people.” [WATCH] Advocate Tembeka Ngcukaitobi says South Africa's appearance before the #InternationalCourtofJustice marks a crucial turning point in having the world look at the Israel and Palestine issue through the legal lens. pic.twitter.com/XNNkWB04W7 — Newzroom Afrika (@Newzroom405) January 14, 2024\nUpdated at 22.28 CET\n14 Jan 2024 21.17 CET US denies Houthi reports that it carried out new strikes on Yemen on Sunday The US has denied Houthi reports that it carried out new attacks in Yemen on Sunday. Speaking to Agence France-Presse on condition of anonymity, a US defense official said: “No US or coalition strike occurred today.” The official’s statements come in response to Houthi media reporting that US and UK airstrikes hit Yemen’s port city of Hodeidah. Agence France-Presse reports the Houthi’s Ansar Allah news website saying that “airstrikes from the American-British aggression hit Hodeidah”. The website is reported to have cited a security source saying that the strikes targeted the Jabal Jada area in Hodeidah’s al-Luhaya district. Earlier this week, the US and UK launched airstrikes on Houthis in Yemen following the group’s attacks on shipping in the Red Sea in solidarity with Palestinians in Gaza.\nUpdated at 22.45 CET\n14 Jan 2024 20.49 CET Thousands attended a 24-hour rally in Tel Aviv to mark 100 days of Israel’s ongoing war in Gaza and to call for the release of hostages still held by Hamas in Gaza, where nearly 24,000 Palestinians have been killed by Israeli forces. The Guardian’s Jason Burke reports: Israelis have marked 100 days of war with a 100-minute pause in the working day and rallies to call for the return of hostages held in Gaza, but little relief from the anxiety that has gripped the country since Hamas launched its 7 October attacks. Many Israelis remain deeply shaken by the incursion, in which 1,200 people, mostly civilians, were killed and 240 taken hostage. Israel is “in the middle of a terrible dream, and I want to wake up from this terrible dream and create a new Israel”, Arnon Bar-David, the leader of the Histadrut confederation of trade unions, told a mass meeting in Tel Aviv. “We will rebuild everything they have tried to destroy.” Normal life is returning to the streets of Jerusalem, Tel Aviv and other cities, but many shops and restaurants are still shut and hundreds of thousands of reservists mobilised. Read the full story here: Netanyahu insists on fight until ‘total victory’ as Israel marks 100 days of war Read more\nUpdated at 21.55 CET\n14 Jan 2024 20.23 CET Yemen’s Houthis said US aircraft were observed flying close to Yemeni airspace and coastal areas on Sunday, Reuters reports. According to Houthi spokesperson Mohammed Abdulsalam, the activity by “enemy” aircraft is a blatant violation of national sovereignty.\nUpdated at 20.26 CET\n14 Jan 2024 19.49 CET Hezbollah chief says Israel \"failed\" in Gaza and will be forced to negotiate Hezbollah chief Hassan Nasrallah said that Israel has “failed” in Gaza and will be forced to negotiate, Agence France-Presse reports. In a televised address on Sunday, Nasrallah said: What has the enemy achieved in 100 days, other than killing? … It has not achieved any real victory or semblance of victory. It has failed in achieving its declared, half-declared and implicit objectives. The leader of the Iran-backed group added: If this path continues, be it in Gaza, the West Bank, Lebanon, Yemen or Iraq, the enemy government will have no other choice but to accept the conditions of the resistance in Gaza, thereby putting an end to the aggression against Gaza and entering into negotiations. He also denounced US and UK airstrikes on Yemen that were launched in response to Houthis’ attacks on shipping – which Houthis declared are in solidarity with Palestinians in Gaza and against Israel. Nasrallah said: What the Americans did in the Red Sea will harm the security of all maritime navigation. View image in fullscreen Hassan Nasrallah delivers a televised speech in Kherbet Selm, in southern Lebanon on 14 January 2024. Photograph: Mahmoud Zayyat/AFP/Getty Images\nUpdated at 22.44 CET\n14 Jan 2024 19.11 CET Namibia rejects 'Germany's support of genoicidal intent' of Israel, citing Germany's genocide history Namibia has rejected Germany’s support of the “genocidal intent of the racist Israeli state against innocent civilians in Gaza”. In a statement released over the weekend, the Namibian presidency pointed to Germany’s “inability to draw lessons from its horrific history”, citing the 20th century’s first genocide – the Herero-Namaqua genocide perpetrated by German forces on Namibian soil from 1904 to 1908 which killed between 24,000 to 100,000 Hereros and 10,000 Nama. The statement said: The German government is yet to fully atone for the genocide it committed on Namibian soil. Therefore, in light of Germany’s inability to draw lessons from its horrific history, president Hage Geingob expresses deep concern with the shocking decision communicated by … Germany yesterday, 12 January 2024, in which it rejected the morally upright indictment brought forward by South Africa before the International Court of Justice that Israel is committing genocide against Palestinians in Gaza … Germany cannot morally express commitment to the United Nations Convention against genocide, including atonement for the genocide in Namibia, whilst supporting the equivalent of a holocaust and genocide in Gaza. Various international organizations, such as Human Rights Watch have chillingly concluded that Israel is committing war crimes in Gaza. Namibia rejects Germany’s Support of the Genocidal Intent of the Racist Israeli State against Innocent Civilians in Gaza\nOn Namibian soil, #Germany committed the first genocide of the 20th century in 1904-1908, in which tens of thousands of innocent Namibians died in the most… pic.twitter.com/ZxwWxLv8yt — Namibian Presidency (@NamPresidency) January 13, 2024\nUpdated at 19.14 CET\n14 Jan 2024 18.45 CET UNRWA: Gaza's humanitarian crisis 'one of the most complex and challenging in the world' The United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) has called the ongoing humanitarian crisis in Gaza caused by Israel’s attacks across the strip – which have killed nearly 24,000 Palestinians and displacing nearly 2 million more Palestinians – one of the world’s “most complex and challenging” operations. In a tweet on Sunday following 100 days of Israel’s war on Gaza, the UNRWA said: The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity. The massive destruction, displacement, hunger & loss of last 100 days are staining our shared humanity\nThe humanitarian operation has become one of the most complex & challenging in the world\nDue to tight siege on #GazaStrip, aid delivered is not nearly enough to meet the needs pic.twitter.com/5MQn3yNe9I — UNRWA (@UNRWA) January 14, 2024\nUpdated at 18.48 CET\n14 Jan 2024 18.18 CET The World Health Organization (WHO) and its partners have visited al-Aqsa hospital in central Gaza and Nasser medical complex in Khan Younis, southern Gaza. In a post on Twitter/X, WHO chief Tedros Ghebreyesus said that both hospitals are “vital lifelines for patients and thousands of displaced people in Gaza” and that they require “sustained support and protection to remain operational”. Ghebreyesus said: At al-Aqsa hospital, WHO learned that patients have been fleeing out of fear, and that the number of medical staff is a fraction of what it once was. At Nasser, WHO witnessed a shortage of hospital beds, with 700 patients on the premises along with around 7000 internally displaced people. His statements come as Israeli forces have repeatedly attacked hospitals and ambulances across the Gaza strip, leaving nearly 2 million surviving Palestinians struggling to access medical care and supplies. Yesterday, @WHO and partners visited Al-Aqsa Hospital in the middle area, and Nasser Medical Complex in Khan Younis, vital lifelines for patients and thousands of displaced people in #Gaza.\nThese facilities require sustained support and protection to remain operational. The… pic.twitter.com/ZQlkSj3OYZ — Tedros Adhanom Ghebreyesus (@DrTedros) January 14, 2024\nUpdated at 18.23 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza humanitarian crisis ‘staining our shared humanity’, says UN refugee agency - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/14/middle-east-crisis-live-netanyahu-says-world-court-cannot-stop-israel-in-gaza-as-war-enters-100th-day"}