{"authors": [], "date_download": "2024-02-05 15:17:49", "date_modify": "None", "date_publish": "2024-02-05 14:06:03", "description": "Russia Ukraine war news live: Ukraine says it has uncovered major arms corruption; Kyiv would win war faster if it could fire British weapons: head of navy", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Frussian-ukraine-war-putin-missile-attack-b2478581.html.json", "image_url": "https://static.independent.co.uk/2024/02/05/12/Russia_Ukraine_War_86544.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "✕ Close Moment Russian plane carrying Ukrainian prisoners of war appears to crash\nFor free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nVladimir Putin’s troops have launched heavy attacks along Ukraine’s front line with dozens of clashes as Kyiv hinted at an armed forces leadership reset.\nThere were 78 clashes over the past day, with 43 Russian air strikes carried out in eastern Ukraine, according to Ukraine’s general staff.\nIt comes as Volodymyr Zelensky admitted he was seeking to replace the country’s most senior military commander Valerii Zaluzhnyi.\n“A reset, a new beginning is necessary. If we want to win we must all push in the same direction, convinced of victory, we cannot be discouraged, let our arms fall, we must have the right positive energy,” Zelensky told Rai News.\nThe president and Zaluzhnyi have disagreed over plans for further mobilisation, with Zelensky announcing at the end of last year that he had turned down a request from the military to mobilise up to 500,000 new recruits.\nMeanwhile, at least 28 people have been killed after Ukrainian shelling destroyed a bakery in the Russian-occupied city of Lysychansk, Moscow officials claimed.", "source_domain": "www.independent.co.uk", "text": null, "title": "Ukraine-Russia war live: 28 killed in Kyiv strike on bakery in occupied east, Moscow claims", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/russian-ukraine-war-putin-missile-attack-b2478581.html"}