{"authors": [], "date_download": "2024-02-05 15:17:53", "date_modify": "None", "date_publish": "2024-01-15 13:46:54", "description": "The heads of three major U.N. agencies are warning that Gaza urgently needs more aid or its desperate population will suffer widespread famine and disease", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-hamas-israel-cindy-mccain-b2478855.html.json", "image_url": "https://static.independent.co.uk/2024/01/15/13/Israel_Palestinians_68105.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nGaza urgently needs more aid or its desperate population will suffer widespread famine and disease, the heads of three major U.N. agencies warned Monday, as authorities in the enclave reported that the death toll in the Israel-Hamas war had surpassed 24,000.\nWhile the U.N. agency chiefs did not directly point a finger at Israel, they said aid delivery is hobbled by the opening of too few border crossings, a slow vetting process for trucks and goods going into Gaza, and continuing fighting throughout the territory — all of which Israel plays a deciding factor in.\nIsrael’s war against Hamas in Gaza, sparked by the militant group’s Oct. 7 attack on southern Israel, has prompted unprecedented destruction in the tiny coastal enclave and triggered a humanitarian catastrophe that has displaced most of Gaza’s 2.3 million population and pushed more than a quarter into starvation, according to the U.N.\nCivilians have become desperate. Video posted Monday to X by Al Jazeera showed hundreds of people rushing toward what appeared to be an aid truck in what the news outlet said was Gaza City. The Associated Press could not immediately independently verify the video and it was not clear when the video was filmed.\nA day after the White House said it was time for Israel to scale back its military offensive, the World Food Program, UNICEF and the World Health Organization said new entry routes need to be opened to Gaza, more trucks need to be allowed in each day, and aid workers and those seeking aid need to be allowed to move around safely.\n“People in Gaza risk dying of hunger just miles from trucks filled with food,” said WFP Executive Director Cindy McCain. “Every hour lost puts countless lives at risk.”\nDEATH TOLL RISES\nThe Health Ministry in Hamas-ruled Gaza said Monday that the bodies of 132 people killed in Israeli strikes were brought to Gaza hospitals over the past day, raising the death toll from the start of the war to 24,100.\nThe ministry, which does not distinguish between fighters and noncombatants in its tally, says two-thirds of those killed in the war were women and children. Israel says its forces have killed roughly 8,000 militants, without providing evidence.\nOn Monday, the military said its forces and aircraft targeted militants in the second-largest city Khan Younis, a current focus of the ground offensive, as well as in northern Gaza, where the Israeli military says it continues to expand its control.\nIsrael blames Hamas for the high death toll, saying its fighters make use of civilian buildings and launch attacks from densely populated urban areas.\nUNPRECEDENTED HUMANITARIAN CRISIS\nThe fighting, now in its 101st day, has set off an unprecedented humanitarian crisis in the territory, which was already struggling from a lengthy blockade imposed by Israel and Egypt after Hamas took power in 2007.\nThe crisis has been especially severe in northern Gaza: The U.N. said Sunday that less than a quarter of aid convoys have reached their destinations in the north in January because Israeli authorities denied most access. Israeli officials had no immediate comment.\nThe U.N. agencies said they want access to the Israeli port of Ashdod some 40 kilometers (24 miles) north of Gaza, which they say would allow larger amounts of aid to be shipped in and then sent directly to northern Gaza, much of which Israel levelled in the opening weeks of the war.\nIsrael has blamed the U.N. and other groups for the problems with aid delivery.\nMoshe Tetro, an Israeli official with COGAT, a defense body in charge of civilian Palestinian affairs, said last week that aid delivery would be more streamlined if the U.N. would increase the amount of workers able to receive and pack the supplies. He said more trucks were needed to transfer the aid to Israel for security checks and that the working hours at the Rafah crossing between Gaza and Egypt needed to be extended.\nAfter Hamas’ attack on Oct. 7, in which 1,200 people, mostly civilians, were killed and roughly 250 taken hostage, Israel sealed off the territory from aid. It relented after its top ally, the U.S., pressed it to loosen its restrictions. The U.S., as well as the U.N., have continued to push Israel to ease the flow of aid.\nU.S. NOTCHING UP PRESURE\nThe U.S. has also been notching up pressure on Israel to move to a lower-intensity level of fighting. On Sunday, White House National Security Council spokesman John Kirby said the U.S. has been speaking to Israel “about a transition to low-intensity operations” in Gaza.\n“We’re not saying let your foot up off the gas completely and don’t keep going after Hamas,\" he said on CBS’ “Face the Nation.” \"It’s just that we believe the time is coming here very, very soon for a transition to this lower-intensity phase.”\nPrime Minister Benjamin Netanyahu, however, has vowed to press on with the war, until Hamas’ governing and military capabilities are destroyed and until the hostages are returned home.\n___\nMagdy reported from Cairo and Goldenberg from Tel Aviv, Israel.\n___\nFind more of AP’s coverage at https://apnews.com/hub/israel-hamas-war", "source_domain": "www.independent.co.uk", "text": null, "title": "UN agency heads say Gaza needs more aid to arrive faster, warning of famine and disease", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-hamas-israel-cindy-mccain-b2478855.html"}