{"authors": ["Nic White", "Nic White For Dailymail.Com"], "date_download": "2024-02-05 15:14:42", "date_modify": "None", "date_publish": "2024-01-30 14:00:41", "description": "MSNBC pundit Joy Reid was airing a clip of President Joe Biden giving a speech about the border crisis when she said 'starting another f**king war' in reference to fallout from the attack in Jordan.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13023339%2FMSNBC-Joy-Reid-Jordan-attack-Donald-Trump-Congress-border-crisis.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/30/13/80632011-0-image-m-47_1706622935114.jpg", "language": "en", "localpath": null, "maintext": "Joy Reid has been caught swearing about the prospect of another war in the Middle East when she forgot to turn her microphone off.\nThe MSNBC pundit was airing a clip of President Joe Biden giving a speech about the border crisis when she said 'starting another f**king war'.\nHer remark to others in the studio was presumably about the fallout from a drone strike by Iran-backed militants on a US base in Jordan that killed three soldiers.\nBiden has not yet launched any retaliatory strikes but there is discussion in Washington about a military response.\nBefore the hot mic moment, Reid was attacking Republican leaders who vote against White House policies, then take credit for the benefits afterwards.\nJoy Reid has been caught swearing about the prospect of another war in the Middle East when she forgot to turn her microphone off\nShe said a good example of this was negotiations on a comprehensive border security and immigration bill.\n'Case in point – fixing what they say is a crisis at the border with congressional negotiators continuing work on a bipartisan deal to tie border policy changes to funding for Ukraine,' she said.\n'Over the weekend, President Biden said he's ready to take action if Congress is serious about solving the border issue.'\nThese efforts are being hampered by Donald Trump trying to scuttle them and make the border crisis worse so he can campaign on it at the election.\nReid aired the clip of Biden speaking at Columbia, South Carolina, on Saturday, telling the crowd he would fix the border today if Congress finally passed the bill.\nHer mic was cut after she swore and the first few words of what she said after the clip finished were inaudible.\n'Still trying to kill the deal,' she said when it came back on, she said - almost certainly about Trump.\n'He bragged about blocking progress and said, please, please, blame him if it fails.'\nReid aired a clip of Biden speaking at Columbia, South Carolina, on Saturday, telling the crowd he would fix the border today if Congress finally passed the bill\nNegotiations are underway in Congress on a comprehensive border security and immigration bill as thousands of asylum-seekers cross the border every day\nReid gave a quick apology for swearing later in the program after she was told her remark went live to air.\n'Before we go, I just want to apologize very quickly. I was chatting during a clip that was playing, and you know, we try to keep this show very PG-13, so I just want to apologize to anyone who was listening to my \"behind the scenes\" chatter. I deeply, deeply apologize for that,' she said.\nUS forces may have mistaken an enemy drone for an American one and let it pass unchallenged into the desert base in Jordan where it killed three US troops and wounded dozens more.\nBiden faced a difficult balancing act, blaming Iran and looking to strike back in a forceful way without causing any further escalation of the Gaza conflict.\nAs the enemy drone was flying in at a low altitude, an American drone was returning to the small installation known as Tower 22, according to a preliminary report.\nAs a result, there was no effort to shoot down the enemy drone that hit the outpost.\nA drone strike by Iran-backed militants on this US base in Jordan killed three staff\nThe drone attack late Saturday night impacted a US outpost located in the northeast part of the country known as Tower 22, near the Syria border, and resulted in at least 34 other injuries\nOne of the trailers where troops sleep sustained the brunt of the strike, while surrounding trailers got limited damage from the blast and flying debris.\nWhile there are no large air defense systems at Tower 22, the base does have counter-drone systems, such as Coyote drone interceptors.\nAside from the soldiers killed, the Pentagon said more than 40 troops were wounded in the attack, most with cuts, bruises, brain injuries and similar wounds.\nEight were medically evacuated, including three who were going to Landstuhl Regional Medical Center in Germany.\nThe other five, who suffered 'minor traumatic brain injuries,' were expected to return to duty.\nThe Pentagon identified those killed in the attack as Sergeant William Jerome Rivers, 46, of Carrollton, Georgia; Specialist Kennedy Ladon Sanders, 24, of Waycross, Georgia; and Specialist Breonna Alexsondria Moffett, 23, of Savannah, Georgia.\nThe three US Army Reserve soldiers were assigned to the 718th Engineer Company, 926th Engineer Battalion, 926th Engineer Brigade in Fort Moore, Georgia.\nThe explanation for how the enemy drone evaded U.S. air defenses came as the White House said Monday it's not looking for war with Iran even as Biden vows retaliatory action.\nThe reservists killed were Specialist Kennedy Ladon Sanders, 24, of Waycross, Georgia; Sergeant William Jerome Rivers, 46, of Carrollton, Georgia; and Specialist Breonna Alexsondria Moffett, 23, of Savannah, Georgia\nThe Democratic administration believes Tehran was behind the strike.\nThe brazen attack, which the Biden administration blames on Iranian-based proxies, adds another layer of complexity to an already tense Mideast situation as the Biden administration tries to keep the Israel-Hamas war from expanding into a broader regional conflict.\n'The president and I will not tolerate attacks on U.S. forces, and we will take all necessary actions to defend the U.S. and our troops,' Defense Secretary Lloyd Austin said as he met at the Pentagon with NATO Secretary General Jens Stoltenberg.\nThe drone attack was one of dozens on U.S. troops in the Middle East since Hamas launched attacks on Israel on October 7, igniting the war in Gaza. But it's the first in which American service members have been killed.\nBiden promised on Sunday to 'hold all those responsible to account at a time and in a manner (of) our choosing' but said the U.S. wasn't seeking to get into another conflict in the Middle East.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "MSNBC host Joy Reid drops F-bomb in hot mic gaffe about drone strike on US military base as she blames Trump and Congress for border crisis", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13023339/MSNBC-Joy-Reid-Jordan-attack-Donald-Trump-Congress-border-crisis.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}