{"authors": ["Pratiti Nath"], "date_download": "2024-02-05 15:17:55", "date_modify": "None", "date_publish": "2024-01-15 22:26:22", "description": "Defence Secretary Grant Shapps announces the largest UK deployment to NATO since the Cold War which adds 2000 sailors, 400 royal marines, and 16000 British troops to the NATO forces.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Flargest-uk-deployment-nato-since-cold-war-announced-1722743.json", "image_url": "https://d.ibtimes.co.uk/en/full/1693491/transport-secretary-grant-shapps.jpg", "language": "en", "localpath": null, "maintext": "Britain is increasing its presence in the NATO forces with new additions of troops from British forces to counter global threats.\nThis comes at a time when the Russian Invasion of Ukraine is in its second year and the Israel-Hamas attack has entered the fourth month.\nUK Defence Secretary Grant Shapps revealed on Monday (January 15) the UK's vision to deter global threats and leading efforts with its allies to defend the country's interest in a statement given at Lancaster House.\nAs per the Ministry of Defense (MOD) announcement the Royal Navy, the Royal Air Force and the British Army's presence in NATO will be increased.\nAs per the UK government statement, Britain is adding \"20,000 service personnel from the Royal Navy, the British Army, and the Royal Air Force\" to be deployed across Europe to take part in Exercise Steadfast Defender 24 in the first half of 2024.\nEarlier last week, the Royal Air Force conducted strikes against the Houthis in the Red Sea along with the US to protect ships being attacked. The Houthis claimed that their action was against the Israelis and the joint air strikes by the US and the UK are being seen as an attempt to defend Israel. The new British troop allotments to NATO are a follow-up of that and the £2.5 billion support package to Ukraine announced by Prime Minister Rishi Sunak last week.\nThe Steadfast Defender 24 Exercise will see the British Armed Forces join thousands of personnel from NATO allies working together in different countries. This is part of the 75th NATO Alliance celebrations.\nThe new UK deployment to NATO includes some advanced arms and ammunition including the most up-to-date fighter jets and surveillance aircraft from the Royal Air Force, along with the most advanced submarines and warships from the Royal Navy. A full range of British Army capabilities will also be added including special operation forces, armour and logistics.\nBritain will be deploying its seventh Light Mechanised Brigade Combat Team (7LMBCT) which was used in the recent NATO Strategic Reserve Force in Kosovo last year. This will be to send Europe in the largest NATO deployments by the British since the Cold War.\nNew UK deployment to NATO to battle a shaking world order?\nThe UK Defence Secretary Grant Shapps said: \"We are in a new era and we must be prepared to deter our enemies, prepared to lead our allies and prepared to defend our nation whenever the call comes.\"\nTerming the recent developments in Ukraine and Israel as shaking the \"world order\", Grant Shapps said: \"Today our adversaries are busily rebuilding their barriers. Old enemies are reanimated. Battle lines are being redrawn. The tanks are literally on Ukraine's lawn. And the foundations of the world order are being shaken to their core. We stand at a crossroads.\"\n\"I can announce today that the UK will be sending some 20,000 personnel to take part in one of NATO's largest deployments since the end of the Cold War. Exercise Steadfast Defender. It will see our military joining forces with counterparts from 30 NATO countries plus Sweden, providing vital reassurance against the Putin menace,\" the Defence Secretary added.\nShapps further added how this will fulfil promises made to the Vilnius NATO summit as it will help in \"enhancing the coalition between the UK and her NATO allies\", and bring NATO nations together in the Steadfast Defender 24 Exercise.\nThe Royal Navy will deploy over 2000 sailors, eight warships and submarines, along with the Queen Elizabeth Class aircraft carrier, with her group of F-35B Lightning jets and helicopters, and surrounded by escort frigates and destroyers in the Baltic Sea, the North Atlantic and the Norwegian Sea.\nAn additional 400 Royal Marines or more will be deployed in the Arctic Circle as part of the allied amphibious task group.\nMeanwhile, the British Army will be deploying 16,000 troops across Eastern Europe between February and June this year. This will also include tanks, helicopters, parachutes, artillery, and fire manoeuvres along with an Army and Navy joint helicopter force, and Army Special Operations Forces.\nThe army is planning to test its land forces in defending NATO through this deployment so that its ability to operate jointly with allied armed forces is strengthened.\nAdditionally, the most-cutting edge aircraft from the Royal Air Force will be sent in the largest UK deployment to NATO since the Cold War including F35B Lightning attack aircraft and Poseidon P8 surveillance aircraft. The flying capacity of these aircraft in simulated conflict scenarios against similar adversaries will be tested here to make them usable in global threats.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "The Largest UK Deployment To NATO Since the Cold War Announced", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/largest-uk-deployment-nato-since-cold-war-announced-1722743"}