{"authors": ["Dominic Yeatman", "Dominic Yeatman For Dailymail.Com"], "date_download": "2024-02-05 15:17:58", "date_modify": "None", "date_publish": "2024-01-15 21:12:29", "description": "The US has earmarked $113billion for Ukraine, with President Biden warning a victory for Russia would leave Moscow able to attack NATO allies.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12965951%2Fus-taxpayers-money-ukraine-war-zelensky-peace-treaty.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/15/21/78881419-0-President_Joe_Biden_shakes_hands_with_Ukrainian_President_Volody-a-44_1705352789035.jpg", "language": "en", "localpath": null, "maintext": "The United States has spent $113billion trying to secure Ukraine's freedom, leaving Russia's imperiled neighbor with one of the best-equipped militaries in the world.\nPresident Joe Biden has warned a victory for Russia over Ukraine would leave Moscow in position to attack NATO allies and could draw US troops into a war.\nBut his attempt to unlock another $61billion has been logjammed in Congress amid rows over whether it should be tied to security funding for America's own southern border.\nAs the war enters its third year, growing US concerns over whether it should cut its losses have become central to the Republican presidential contest with Ron DeSantis slamming Nikki Haley for supporting Biden's 'open ended commitment'.\nNow, it all might be moot as Ukrainian president Volodymyr Zelensky has asked the Swiss to organize a 'high-level peace conference' - but without Russia being invited.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky during a meeting in the Oval Office of the White House last month\nFlorida Gov. Ron DeSantis (left) and former U.N. Amb. Nikki Haley (right) got into a tense exchange over whether the U.S. should continue funding the war in Ukraine during Wednesday night's GOP debate in Des Moines\n'We don't have enough resources being $35 trillion in debt to continue doing hundreds of billions of dollars,' Florida Governor Ron DeSantis told the GOP debate in Des Moines on Wednesday.\n'We've got to focus on our issues here at home, and we've got to deal with the top threat that we face, which is China.'\n'This is about preventing war,' America's former UN ambassador shot back.\n'If we support Ukraine, that's only 3.5 percent of our defense budget,' she added.\n'You have to be a friend to get a friend, and we needed a lot of friends on September 12th.\n'We've got to make sure that we're having the backs of the right friends because if Russia wins, China wins.'\nThe US ramped up military aid to Ukraine after the Russian invasion of Crimea in 2014 but it reached levels seldom seen since the Second World War when Putin tried to seize the rest of the country in February 2022.\nMore than $47billion has been allocated for military assistance by the US alone, helping restrict the Russian invaders to areas in the south and east of Ukraine.\nAmerican generosity has armed Ukraine with 39 Himars artillery rocket systems, 76 tanks and 186 Bradley infantry fighting vehicles.\nMore than 100,000 anti-tank missiles have spearheaded the country's defense along with a state-of-the-art Patriot air defense battery.\nPhoeniz Ghost and Switchblade UAS systems are among the drones patrolling Ukrainian skies, and laser-guided rocker systems have helped draw the sting of the Russian attack.\nAnd billions more have been spent providing humanitarian and financial assistance to the besieged country.\nDeSantis claimed that 'globalist' Haley supported funding 'salaries for Ukrainian government bureaucrats' and 'paid pensions for Ukrainian retirees' with taxpayer dollars.\n'You can take the ambassador out of the United Nations, but you can't take the United Nations out of the ambassador,' he said.\nAccording to the Congressional Budget Office, just half of the existing funds will have been spent by the end of 2024, and just three-quarters by the end of 2026.\n'Increasingly, the provision of security assistance to Ukraine has focused on improving the Ukraine's medium to long-term capabilities, including transitioning toward more NATO-standard weaponry, and on helping develop Ukraine's domestic defense industry,' reported the Congressional Research Service earlier this month.\nBut President Biden accused Republicans of giving Russia's president Putin 'the greatest gift he can hope for' as they voted down his bid for a fresh $61 billion package for Ukraine last month.\n'They are willing to literally kneecap Ukraine on the battlefield and damage our national security in the process,' he declared.\nGermany is preparing for Vladimir Putin 's forces to attack NATO in 2025, according to leaked secret plans that emerged today.\nSenate Republican Leader Mitch McConnell - seen with President Zelensky and Senate Majority Leader Chuck Schumer in the Capitol last month - told his senators that talks on a further package of aid to Ukraine are going nowhere\nA third of Americans say Russia's invasion of Ukraine is a 'major threat' to US interests, according to a Pew Research poll last month.\nBut a poll for the Telegraph earlier this month found that a third of voters in six swing states said the US had spent too much on supporting Ukraine, while a large minority in five of the six said aid should now be cut.\n'Russia will not lose this war. You have to recognize that reality,' GOP Senator Ron Johnson, a member of the Senate Homeland Security Committee, said after last month's vote.\n'I don't like that reality, but it's true. The only way this war ends is in a negotiated settlement.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US taxpayers have spent $113 in Ukraine war - as Zelensky asks for 'high-level' peace talks", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12965951/us-taxpayers-money-ukraine-war-zelensky-peace-treaty.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}