{"authors": ["Emily Goodin", "Senior U.S. Political Reporter"], "date_download": "2024-02-05 15:18:02", "date_modify": "None", "date_publish": "2024-01-15 16:29:58", "description": "Defense Secretary Lloyd Austin was released from Walter Reed Medical Center on Monday after 15 days in the hospital due to complications from his prostate cancer surgery.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12965667%2FLloyd-Austin-RELEASED-hospital-prostate-cancer.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/15/16/79699165-0-image-m-9_1705336168422.jpg", "language": "en", "localpath": null, "maintext": "Defense Secretary Lloyd Austin was released from Walter Reed Medical Center on Monday after 15 days in the hospital due to complications from his prostate cancer surgery.\n'The secretary continues to recover well and, on the advice of doctors, will recuperate and perform his duties remotely for a period of time from home,' the Pentagon said in a statement.\nHe will have to do physical therapy and regular follow ups but is expected to make a full recovery, his doctors said. He needs no further treatment for his cancer.\n'I'm grateful for the excellent care I received at Walter Reed National Military Medical Center and want to thank the outstanding doctors and nursing staff for their professionalism and superb support,' Austin said in a statement.\n'Now, as I continue to recuperate and perform my duties from home, I'm eager to fully recover and return as quickly as possible to the Pentagon,' he said.\nAustin, 70, caused a political firestorm for President Joe Biden's administration when he kept his original surgery and subsequent hospitalization a secret - including from the White House. Several lawmakers - both Republicans and Democrats - called for his resignation.\nDefense Secretary Lloyd Austin, 70, was hospitalized on January 1 and released on January 15th. He is pictured December 20 in this most recent pic\nBiden stood by his defense secretary but did admonish him for a lapse in judgement.\nWhile visiting small businesses in Allentown, Pa., on Friday, Biden was asked if he has confidence in Austin, to which he responded: 'I do.' Asked if it was a lapse in judgment for Austin to not inform him of his hospitalization, Biden said: 'Yes.'\nAustin had surgery for prostate cancer on Dec. 22nd and went home the next day. On New Year's Day he was rushed to the hospital with complications.\nBiden wasn't told of defense secretary's whereabouts until Jan. 4th. Austin didn't disclose the cause of his surgery - his prostate cancer - until Jan. 9th after facing days of questions about his hospitalization.\nBiden previously has indicated he will stand by his defense secretary but White House officials agreed the situation was a head-scratcher.\nThe White House is conducting a review of the matter.\nThe Pentagon's inspecter general also is investigating the mishandling of Austin's secret hospitalization as the firestorm around the defense secretary continues.\nInspector General Robert Storch said his office would examine any breaches of protocol surrounding Austin's surgery for prostate cancer, his rehospitalization for complications and the lack of disclosure to the White House and general public.\n'The objective of the review is to examine the roles, processes, procedures, responsibilities, and actions related to the Secretary of Defense's hospitalization in December 2023-January 2024, and assess whether the DoD's policies and procedures are sufficient to ensure timely and appropriate notifications and the effective transition of authorities as may be warranted due to health-based or other unavailability of senior leadership,' Storch wrote in a memo to senior Defense Department officials.\nPresident Joe Biden admonished Lloyd Austin for his lapse in judgment when the defense secretary chose not to reveal his hospitalization, but said he still has confidence in him\nAustin has faced a barrage of criticism from Republicans and Democrats alike for failing to disclose he was in the hospital while the country was facing national security situations in the Ukraine and Middle East. Some lawmakers have called for his resignation.\nOfficials have blamed the communications breakdown on key officials being out of the office. Austin Chief of staff Kelly Magsamen had the flu and public affairs chief Chris Meagher was at doctors' appointments with his pregnant wife, who gave birth to their first child on Friday.\nAustin kept his original surgery on Dec. 22 a secret from President Biden and his administration. At the time Austin underwent anesthesia and was unconscious. Deputy Defense Secretary Kathleen Hicks was given Austin's powers at that time but not told the reason.\nBut Pentagon officials also didn't tell the White House for four days that Austin had returned to the hospital on Jan. 1 after experiencing severe pain. He was taken there by ambulance.\nPentagon Inspector General Robert Storch is conducting an independent review of Lloyd Austin's hospitalization\nBiden was told Austin had prostate cancer on Tuesday of last week - the same day the public was informed, sparking more questions about the transparency of the administration and whether the public can trust their government.\n'Nobody at the White House knew that Secretary Austin had prostate cancer until this morning and the President was informed immediately after we were,' White House spokesman John Kirby said at the daily press briefing.\nKirby got defensive as he was repeatedly queried about why the commander-in-chief didn't know the conditions or the where abouts of his top military officer.\n'We all recognize that this didn't unfold the way it should, on so many levels, not just the notification process of the chain of command, but the transparency issue. We all recognize that. And I think we all want to make sure we learn from that,' Kirby said.\n'It's certainly not good, which is why we want to learn from this and we want to make sure that it doesn't happen again.'\nHe also conceded: 'It is not optimal for a situation like this to go as long as it did without the commander-in-chief knowing about it or the national security adviser knowing about it, or frankly other leaders at the Department of Defense. It's not the way this is supposed to happen.'\nPresident Joe Biden was informed about Lloyd Austin's cancer the same day the public was\nAustin was hospitalized to be treated for prostate cancer, the Pentagon revealed on Tuesday after days of criticism for hiding the defense secretary's secret hospitalization. Biden was told by his chief of staff Jeffrey Zients.\n'On Dec 22 after consultation with his medical team, he was admitted to Walter Reed National Military Medical Center and underwent a minimally invasive surgical procedure called a prostatectomy to treat and cure prostate cancer,' the hospital said in a statement about Austin.\nHis cancer was 'diagnosed early and his prognosis is excellent.' But he also suffered complications on Jan. 1 that required an ambulance to take him to the hospital.\nHis complications included 'nausea with severe abdominal, leg and hip pain.' The early diagnosis was a urinary tract infection but further examination showed Austin, 70, had a fluid build up in his abdomen that was impairing the function of his small intestines.\nThe infection was treated by a tube placed through is nose that went down to his stomach. The infection has cleared, the statement said, and Austin 'continues to make progress.' He 'never lost consciousness and never underwent general anesthesia,' the statement said although it also said Austin underwent anesthesia for the Dec. 22 surgery.\nThe announcement came as more lawmakers began to question why Austin was hospitalized and why it took the Pentagon four days to inform President Biden and five days to inform the public. Senior administration and defense officials were not told for days about his hospitalization or his cancer.\nWhite House spokesman John Kirby got defensive as he was repeatedly queried about why the commander-in-chief didn't know the conditions or the where abouts of his top military officer\nAbout Prostate Cancer Secretary Austin was diagnosed in December when doctors noticed changes in routine blood tests. The tests looked for prostate specific antigens (PSA), which measures the amount of a protein linked to cancer. Austin, 70, was considered high risk for prostate cancer because of his age and the fact he is an African-American, who are more likely to develop the disease. Austin had part of his prostate gland removed via a procedure known as a prostatectomy - effectively cutting out the cancer before it can grow and spread. Doctors have given him an 'excellent' prognosis. Outcomes after prostate cancer surgery can vary - in some men the cancer never returns, while in up to one in four it does. In 2023, the American Cancer Society estimates there were 288,300 new cases of prostate cancer and 34,700 deaths. The cancer develops in the prostate gland - a part of the reproductive system in men. The walnut-sized gland is responsible for secreting fluid that keeps sperm healthy. The Centers for Disease Control and Prevention estimates 13 in 100 men will develop prostate cancer in their lifetimes. Risk factors include smoking, having obesity, sexually transmitted infections, genetics and exposure to Agent Orange, a chemical used during the Vietnam War. Early stages of prostate cancer rarely show symptoms, but as the disease progresses, people may develop frequent urination, weak urine flow, pain during urination, loss of bladder and bowel control, painful ejaculation and erectile dysfunction and pain in the low back, hips or chest. Advertisement\nEight in ten men and six in ten black men are diagnosised with prostate cancer every year. The risk grows for men as they age. It is the most common cancer among men in the United States, according to the Centers for Disease Control and Prevention.\nThe 5-year relative survival rate for prostate cancer in the United States is 97%.\nMeanwhile, the White House on Tuesday ordered cabinet secretaries to keep it informed when they may not be able to perform their duties as the fallout from Austin's hospitalization continues.\nWhite House Chief of Staff Jeffrey Zients, in a memo, directed cabinet officers to examine their policies for delegating authority when a secretary is out of commission and to send those procedures to the White House for review.\nHe also made clear that White House officials expected to be kept up to date about developments like major medical issues.\n'Notify the Offices of Cabinet Affairs and White House Chief of Staff in the event of a delegation of authority or potential delegation,' Zients wrote in the memo, which was obtained by The New York Times. 'This notification should occur when agencies anticipate or are preparing for a delegation of authority and again when the delegation occurs.'\nThe Pengaton said on Tuesday it is correcting its procedures.\n'The department is taking immediate steps to correct our notification procedures,' Pentagon press secretary Major General Patrick Ryder said at his briefing.\n'Nothing is more important to the Secretary of Defense and the Department of Defense than the trust and confidence of the American people and the public we serve and will continue to work every day and work hard every day to earn and deserve that trust,' he said.\nHe noted the Pentagon was conducting an internal review of the matter.\n'We want to make sure that notifications are happening in a timely way. And this way, as we've acknowledged, there were some shortfalls and so it's important that we go back and look at what those shortfalls work. What could have been done better and make sure that going forward. We're improving those processes,' he said.\n'We're committed to making sure that we don't do this again. And then we do a better job next time.'\nSecretary Austin was treated at Walter Reed National Military Medical Center\n'The department is taking immediate steps to correct our notification procedures,' Pentagon press secretary Major General Patrick Ryder said Tuesday\nDefense Secretary Lloyd Austin kept his hospitalization a secret for days; above he is seen with President Joe Biden and Vice President Kamala Harris in May\nZients also directed Cabinet officials to ensure power is transferred 'when a cabinet member is traveling to areas with limited or no access to communication, undergoing hospitalization or a medical procedure requiring general anesthesia, or otherwise in a circumstance when he or she may be unreachable.'\nThe memo was sent out as President Biden and his team continue to deal with the political headache left to them after Austin failed to inform them of his hospitalization until four days after it occurred.\nAustin could have broken the law by failing to report his absence, the Pentagon has launched a full investigation into the matter and one Republican lawmaker filed articles of impeachment against the defense secretary.\nAnd Pennsylvania Rep. Chris Deluzio on Wednesday became the first Democratic voice in Congress to call for Austin's resignation.\nAustin remains at Walter Reed Medical Center but is out of the ICU and has retaken control of his authorities as the head of U.S. armed forces. The White House has said President Biden backs him but lawmakers in both parties are questioning the Pentagon's handling of the situation. The White House also had said they would be conducting a review of the situation.\nMeanwhile on Tuesday, four Republican lawmakers who are former military pilots - August Pfluger, Mike Garcia, Scott Franklin and Jake Ellzey - called on Austin to resign, accusing him of a 'dereliction of duty.'\nDefense Secretary Lloyd Austin could have broken the law by failing to report his absence - he is seen above participating in the Virtual Red Sea Security Summit at NAVCENT headquarters in Manama, Bahrain, on December 19\nTimeline on Lloyd Austin's illness Dec. 22: Defense Secretary Lloyd Austin has procedure at Walter Reed Dec. 23: Austin returns home Dec. 27: President Biden leaves for St. Croix for New Year's vacation Jan. 1: Austin participates in national security phone call Jan. 1: Austin admitted to ICU Jan. 2: Austin top staffers informed of his hospitalization Jan. 2: Biden returns to White House Jan. 2: Deputy Defense Secretary Kathleen Hicks takes some of Austin's duties Jan. 4: Biden and Hicks told Austin is in hospital Jan. 5: Congress informed Jan. 6: Biden and Austin speak via phone Jan. 9: Pentagon announces Austin was being treated for prostate cancer Advertisement\nThe Pentagon has said that it's still unclear when Austin will be released from the hospital but vowed to give daily updates until he is out.\nMany officials remain uncleared for days about what elective procedure Austin went to the hospital for on December 22nd and what he suffered from in its after affects. It is unclear when President Biden was told.\nAs part of the fallout, Kelly Magsamen, Austin's chief of staff, ordered a 30-day investigation into the events surrounding Austin's hospitalization, the Pentagon announced late Monday night.\nBut the matter was not referred to the Defense Department inspector general's office for an independent review. It will be led by Jennifer Walsh, the Pentagon's director of administration and management.\nMagsamen had been ill with the flu and was unaware that Austin had been hospitalized. Officials have cited her illness as one of the reasons the White House wasn't informed about the secretary's condition.\nAustin's top staffers knew about his hospitalization on Jan. 2, the day after it occurred, however. Biden wasn't told until Jan. 4.\nThe review will establish a timeline of events beginning Jan. 1 when Austin was taken by ambulance to Walter Reed and examine how decisions were made about informing officials of his condition.\n'This review will help to ensure clarity and transparency when a determination has been made that certain authorities have been transferred,' Magsamen wrote. 'And that proper and timely notification has been made to the President and White House and, as appropriate, the United States Congress and the American public.'\nKelly Magsamen (left), Lloyd Austin's chief of staff, ordered a 30-day investigation into the events surrounding the defense secretary's hospitalization\nThe White House announced President Biden backs Defense Secretary Lloyd Austin (seen above with Biden and Homeland Security Secretary Alejandro Mayorkas at the White House on August 30th)\nKirby pledged the White House would investigate the matter, looking at the 'process and procedure' regarding the location and health of senior officials after Biden was not told for four days that his defense secretary was in the hospital.\nHe said the administration would perform a 'hot wash,' which is a military term to describe an intense, quick review.\n'As you might expect, we'll take a look at process and procedure here. And try to learn from this experience and if there's some changes that need to be made, in terms of process and procedure, we'll do that,' Kirby said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Lloyd Austin RELEASED from hospital after 15 days: Defense secretary heads home from Walter Reed after secretive trip during his prostate cancer treatment", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12965667/Lloyd-Austin-RELEASED-hospital-prostate-cancer.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}