{"authors": [], "date_download": "2024-02-05 15:18:05", "date_modify": "None", "date_publish": "2024-01-14 10:08:20", "description": "Top foreign policy advisers from Western countries, Ukraine and others are meeting to help push forward Ukrainian President Volodymyr Zelenskyy’s peace formula that aims to end Russia’s war on his country", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-davos-ukraine-russia-switzerland-b2478364.html.json", "image_url": "https://static.independent.co.uk/2024/01/14/10/Switzerland_Davos_Forum_74501.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nTop foreign policy advisers from Western countries and Ukraine are meeting Sunday to help push forward Ukrainian President Volodymyr Zelenskyy's peace formula that aims to end Russia's war on his country.\nThe fourth such meeting of national security advisers takes place in the Swiss town of Davos, where Zelenskyy is set to attend the World Economic Forum's annual meeting starting Tuesday. He will endeavor to keep up international focus on Ukraine's defense amid eroding support for Kyiv in the West and swelling distractions like conflict in the Middle East.\nAndriy Yermak, the Ukrainian president’s chief of staff, and Swiss Foreign Minister Ignazio Cassis are hosting Sunday's conference attended by more than 80 delegations that aims to build on the previous closed-door efforts in Denmark, Saudi Arabia and Malta last summer and fall.\nZelenskyy has presented a 10-point peace formula that, among other things, seeks the expulsion of all Russian forces from Ukraine — at a time when both sides are fighting from largely static positions along a roughly 1,500-kilometer (930-mile) front line.\nRussian forces have recently stepped up missile and drone attacks that have stretched Ukraine’s air defense resources, leaving the country vulnerable in the 22-month war unless it can secure further weapons supplies.\n“The war is far from over and peace is still nowhere in sight,\" the Swiss department of foreign affairs said in a statement previewing Sunday's talks.", "source_domain": "www.independent.co.uk", "text": null, "title": "Top Western envoys review Ukraine peace formula to end Russia's war as Zelenskyy plans Davos visit", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-davos-ukraine-russia-switzerland-b2478364.html"}