{"authors": ["Maya Yang", "Amy Sedghi", "Adam Fulton"], "date_download": "2024-02-05 15:18:10", "date_modify": "None", "date_publish": "2024-01-14 00:20:58", "description": "This blog is now closing. You can read our full report on the latest developments in the Middle East here and all our coverage of the Israel-Gaza war here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F13%2Fmiddle-east-crisis-live-us-targets-houthi-site-in-renewed-raid-yemen-rebels-red-sea-shipping.json", "image_url": "https://i.guim.co.uk/img/media/43f976922c449447b411741b35e5e4542b5c6826/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=4677b927d70fe025ac2712695f0a4ca6", "language": "en", "localpath": null, "maintext": "From 13 Jan 2024 20.20 CET Thousands gather in Washington DC in protests for Gaza ceasefire Thousands of demonstrators have gathered in Washington DC on Saturday in calls for a ceasefire in Gaza, where Israeli forces have killed nearly 24,000 Palestinians since 7 October. Pictures posted online showed demonstrators holding various signs including some saying “Stop funding apartheid now” and “Free Palestine”. We’re in DC for the March on Washington for Gaza🇵🇸🇵🇸\nGenocide Joe, you can’t hide!#CeasefireNOW #FreePalestine pic.twitter.com/If1azYs4an — Dissenters 🌊 (@wearedissenters) January 13, 2024 One picture showed demonstrators commuting by bus from Boston to Washington DC to attend the pro-ceasefire rallies. Boston is on its way to the National #March4Gaza in Washington DC! Join us for this massive protest at 1pm at Freedom Plaza to demand an end to the U.S.-Israeli genocide in Gaza! pic.twitter.com/DTJoURNKVm — ANSWER Coalition (@answercoalition) January 13, 2024 Another video showed demonstrators holding a massive Palestinian flag. #marchforgaza in Washington DC\npic.twitter.com/fAQ2BuQYGm — Wajd Waqfi وجد وقفي (@WajdWaqfi) January 13, 2024\nUpdated at 20.23 CET\n13 Jan 2024 00.56 CET Summary Here is where the day stands: UNRWA chief Philippe Lazzarini has released a statement on the humanitarian crisis in Gaza caused by Israel’s attacks across the strip. In his statement, Lazzarini said: “The crisis in Gaza is a man-made disaster compounded by dehumanizing language and the use of food, water and fuel as instruments of war.”\nThousands of demonstrators gathered in Washington DC on Saturday calling for a ceasefire in Gaza, where Israeli forces have killed nearly 24,000 Palestinians since 7 October. Pictures posted online showed demonstrators holding various signs including some saying “Stop funding apartheid now” and “Free Palestine”. Guest speakers who condemned Israel’s attacks on Gaza and urged for a ceasefire in Gaza included Cornel West, Imam Omar Suleiman and Wael al-Dahdouh (who spoke via a video feed).\nPalestinian journalist Wael al-Dahdouh, who works for Al Jazeera and whose family members were killed by Israeli strikes while he also was recently wounded by an Israeli strike himself, addressed the protest in Washington DC via a video feed from Gaza. He spoke up about the dire conditions in which Palestinians are struggling to exist in Gaza while under Israeli bombardment. “The people are paying an exorbitant price, and are living a disastrous life,” he told the crowds in Washington DC.\nA Hamas official thanked Qatar on Saturday for sending medicine to Gaza “in light of the many risks that threaten the lives of Palestinians”, Reuters reports. Speaking at a news conference in Beirut, the Lebanon-based Hamas leader Osama Hamdan said: “Some medicine will be used to treat Israeli prisoners.”\nThe first lady of Namibia, Monica Geingos, has spoken out against Germany’s defense of Israel in South Africa’s case against Israeli genocide in Gaza at the International Court of Justice. In a statement on X, Geingos cited the Herero-Nama genocide, which was waged by German forces from 1904 to 1908 and killed between 24,000 and 100,000 Hereros and 10,000 Nama in Namibia (then known colonially as German South West Africa). Geingos said: “The absurdity of Germany, on 12 January 2024, rejecting genocide charges against Israel and warning about the ‘political instrumentalisation of the charge’ is not lost on us.”\nThe Committee to Protect Journalists has renewed its calls for the protection of journalists in Gaza and urged for “the killings of journalists by the Israeli army” to stop. CPJ’s Middle East and North Africa program coordinator, Sherif Mansour, said: “After 100 days of fighting, Israel’s longstanding record of impunity in journalist killings must face public scrutiny by allowing international media and international investigators uncensored access to Gaza. The killings of journalists by the Israeli army must stop now.”\nUpdated at 01.10 CET\n13 Jan 2024 00.38 CET UNRWA: \"The crisis in Gaza is a man-made disaster\" UNRWA chief Philippe Lazzarini has released a statement on the humanitarian crisis in Gaza caused by Israel’s attacks across the strip. In his statement, which marks “100 days of death, destruction and displacement”, Lazzarini said: The crisis in Gaza is a man-made disaster compounded by dehumanizing language and the use of food, water and fuel as instruments of war. The humanitarian operation has fast become one of the most complex and challenging in the world; largely due to cumbersome procedures for the entry of aid into the Gaza Strip and a myriad of obstacles to the safe and orderly distribution of aid, including ongoing hostilities. Humanitarian aid alone will not be sufficient to reverse a looming famine. A flow of commercial goods must also be allowed in. International humanitarian law, put in place to protect civilians and regulate the conduct of hostilities, is regularly flouted. Civilians and civilian infrastructure, including hospitals and UNRWA shelters, were hit over the last three months, killing hundreds of civilians and injuring thousands. UNRWA installations should be protected at all times, and provide the protection civilians are seeking. They should never be used for military purposes by any party.\nUpdated at 01.06 CET\n13 Jan 2024 00.17 CET Israel is planning a “huge” addition to its defense budget as part of a build-up designed to cover its military requirements for the next few years, Israeli prime minister Benjamin Netanyahu said on Saturday, Reuters reports. Netanyahu said that an inter-ministerial panel will present a plan in eight weeks for “the huge additional [funding], to create that independence in force build-up and in other things required to ensure our security in the coming years”, he said.\nUpdated at 01.05 CET\n13 Jan 2024 23.59 CET The ongoing conflict in the Red Sea and escalating regional tensions surrounding Israel’s war on Gaza are raising concerns about the global economic recovery. The Guardian’s Toby Helm, Emma Graham-Harrison, Phillip Inman and Edward Helmore report: A prolonged conflict in the Red Sea and escalating tensions across the Middle East risk having devastating effects on the global economy, reigniting inflation and disrupting energy supplies, some of the world’s leading economists warn this weekend. Before a statement expected on Monday by Rishi Sunak in the House of Commons about UK and US airstrikes on Houthi sites in Yemen, economists at the World Bank say the crisis now threatens to feed through into higher interest rates, lower growth, persistent inflation and greater geopolitical uncertainty. After a second night of strikes against the Iranian-backed rebels in Yemen, President Joe Biden said that the US had sent a private message to Tehran that “we’re confident we’re well-prepared”. Speaking to reporters on the White House lawn on Saturday, on his way to Camp David, Biden declined to go into further detail. But there is now growing concern in government circles in London and Washington that as Sunak and Biden fight for re-election, events in the Middle East could dash what had looked like improved prospects for economic recovery and therefore their chances at the ballot box. For the full story, click here: Red Sea crisis could shatter hopes of global economic recovery Read more\nUpdated at 01.03 CET\n13 Jan 2024 23.27 CET Osama Abu Irshaid, the executive director of American Muslims for Palestine, also addressed the crowd in Washington DC, calling for further solidarity with Palestinians in Gaza while also condemning American politicians including Joe Biden, House minority leader Hakeem Jeffries and Senate majority leader Chuck Schumer. Abu Irshaid said: We are proud of who we are. We are proud of what we stand for and we are proud of who we stand for and who we stand against. Let the deaf hear, let the blind see that we are here in the tens of thousands, from all over America … History will celebrate you. History will register your names. History will register the victory of Gaza. And history will disregard Genocide Joe, Hakeem Jeffries, [Chuck] Schumer and the rest of the gang, the corrupt gang … My dear brothers and sisters, this is not one activity for Palestine … It didn’t start today. It’s not going to end tomorrow. We have to continue this walk. We are entering a new era in America, an era for a free Palestine.\nUpdated at 01.02 CET\n13 Jan 2024 22.47 CET Muslim civil rights activist Imam Omar Suleiman also spoke at the pro-Palestine rally in Washington DC, saying: I want you to appreciate that in this country, this isn’t our first protest. We have taken to the streets in the name of one victim of state violence for months at a time. If we were to take to the streets for every single casualty and every single person that is under the rubble for the last three months, it would take us a hundred years to honor each and every single one of those victims. And if we were to collectively take to the streets for the rest of our lives for just one of the people on these posters, for just one Wael al-Dahdouh, it would be worth it. They ask us where our Nelson Mandelas are. We say that our Mandelas are suing criminals at the Hague right now for genocide. We say that our Mandelas are the children that have resisted over seven decades of occupation, standing in front of Israeli tanks. We say that our Mandelas are the Wael al-Dahdouhs and the Motazes [Azaiza] of the world who continue to hold up cameras to your genocide, unintimidated.\nUpdated at 01.01 CET\n13 Jan 2024 22.20 CET Joanna Walters Cornel West has just been addressing the protest in Washington and speaking of Martin Luther King Jr, while saying he embraces his “Palestinian brothers and sisters” in the massive crowd and predicting a free Palestine “is going to happen”. The former Harvard and Princeton professor is running in this year’s presidential election as an independent candidate. “Martin Luther King Jr would have been 95 years old on Monday,” he said. “MLK said: ‘I would rather be dead than afraid … we need courage,’” he said to huge cheers. “We need love and freedom and freedom in love,” he said. “When I talk about free Palestine, it’s going to happen. I may not see it for myself but I will have done everything I can with every bone in my body [to make it happen],” said the 70-year-old. He finished with: “We want equality, we want equality, we want equality.” View image in fullscreen Cornel West speaks at a campaign rally for Bernie Sanders in 2020 in New Hampshire. Photograph: Andrew Harnik/AP\nUpdated at 00.58 CET\n13 Jan 2024 22.01 CET Joanna Walters Palestinian journalist Wael al-Dahdouh, who works for Al Jazeera and has lost multiple members of his immediate family in Gaza since October, while also recently being wounded himself, has addressed the protest in Washington via a video feed from the Middle East. He spoke up about the dire conditions in which Palestinians are struggling to exist in Gaza while under Israeli bombardment. “The people are paying an exorbitant price, and are living a disastrous life,” he told the crowds in Washington. “People do not have sustenance, food or drink, a place to sleep, a bathroom, and what is necessary for a life, not for a decent life, rather what is basically necessary to maintain life,” he said. View image in fullscreen Wael Dahdouh holds the hand of his dead son Hamza, who also worked for Al Jazeera and was killed in an Israeli airstrike in Rafah, Gaza Strip, on 7 January 2024. Photograph: Hatem Ali/AP He added: “Throughout such terrible circumstances, such hardship, it is true that the Gaza Strip pays a terrible price.” He said that 112 journalists and photographers had been killed in the three months of the conflict. “Throughout all of this hurt, all of this pain, all of this cost... We have not ceased to persist. We guarantee you that we will persist in carrying this message,” he said.\nUpdated at 00.16 CET\n13 Jan 2024 20.49 CET In another video posted online, a demonstrator in Washington DC can be seen adding a gallon of fake blood to a tank to mark the lives of Palestinians killed by Israeli strikes. A sign in front of the tank reads “Gaza blood is flowing – we will add a gallon of blood every 15 minutes to honor the 247 lives killed today.” Since 7 October, Israeli forces have killed nearly 24,000 Palestinians across Gaza, leaving nearly 2 million survivors displaced across the strip amid shortages in food, water, fuel and medical supplies. 📍 Washington DC\n“Gaza blood is flowing - we will add a gallon of blood every 15 minutes to honor the 247 lives killed today” pic.twitter.com/EU4ouVrXl6 — missfalasteenia (@missfalsteenia) January 13, 2024\nUpdated at 20.53 CET\n13 Jan 2024 19.55 CET A Hamas official thanked Qatar on Saturday for sending medicine to Gaza “in light of the many risks that threaten the lives of Palestinians”, Reuters reports. Speaking at a news conference in Beirut, Lebanon-based Hamas leader Osama Hamdan said: “Some medicine will be used to treat Israeli prisoners.” On Friday, Israel announced that it had reached an arrangement with Qatar that will allow medicine to be delivered to hostages currently held by Hamas in Gaza. Since 7 October, nearly 2 million Palestinians have been forcibly displaced from their homes by Israeli strikes, leaving them with severe shortages in food, water, fuel and medical supplies.\nUpdated at 20.02 CET\n13 Jan 2024 19.28 CET US and UK attacks on Yemen are fueling regional tensions amid Israel’s deadly war in Gaza, which has already killed more than 23,000 Palestinians. The Guardian’s Patrick Wintour reports: Last summer, as Washington tried quietly to coax Saudi Arabia towards the grand bargain of normalisation of its relations with Israel, diplomats in Riyadh were much more focused on securing a different peace deal on its southern borders with one of the most successful insurgencies of ­modern times – the one led by the Houthi rebels of Yemen, also known as Ansar Allah, the supporters of God. With an informal ceasefire holding inside Yemen, and after months of private talks mainly mediated in Oman, on 14 September a Houthi ­delegation flew to Riyadh, where they met Prince Khalid bin Salman, the defence minister and brother of the crown prince. Major differences remained to be settled, but it seemed as if, after decades of various forms of fighting, peace was to come to the country, and largely on the terms dictated by a group that did not really exist as a political force inside Yemen until the early 2000s. Saudi Arabia was finally going to cut its losses on the disastrous offensive it launched in 2015 to push back the Houthis. Yet 23 days after the Riyadh meeting, Hamas broke through the border with Israel, massacring Israelis and sparking a chain of events that this week left Yemen exposed to a two-day attack mounted from US and British submarines and warships on the Red Sea. For the full story, click here: How Houthi anger with Israel is reshaping the Middle East conflict Read more\nUpdated at 19.30 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Protesters in Washington call for Gaza ceasefire - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/13/middle-east-crisis-live-us-targets-houthi-site-in-renewed-raid-yemen-rebels-red-sea-shipping"}