{"authors": ["Chiara Fiorillo", "Image", "Afp Via Getty Images", "Planet Labs Afp Via Getty Images", "Anadolu Via Getty Images"], "date_download": "2024-02-05 15:14:30", "date_modify": "None", "date_publish": "2024-01-30 11:50:08", "description": "Joe Biden said the US 'shall respond' after a drone strike killed three American troops and injured dozens more - and an expert told The Mirror which areas might be targeted", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fjoe-biden-could-target-strikes-31999874.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article32001121.ece/ALTERNATES/s1200/0_Top-pic-Template-copy-Recovered-copy.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden said the US 'shall respond' after a drone strike killed three American troops and injured dozens more - and an expert told The Mirror which areas might be targeted\nExclusive: Where Joe Biden could target with strikes after three US troops killed in Jordan\nJoe Biden has promised that the US \"shall respond\" after three American troops were killed and dozens more were injured in a drone strike in northeast Jordan near the Syrian border.\nThe US president blamed Iran-backed militias for the first American fatalities after months of strikes by such groups across the Middle East since the start of the war in Gaza. Biden, who was travelling in South Carolina, asked for a moment of silence during an appearance at a Baptist church's banquet hall.\n\"We had a tough day last night in the Middle East. We lost three brave souls in an attack on one of our bases,\" he said. After the moment of silence, Biden added: \"And we shall respond.\" Currently, it is not clear where the US will aim to strike in response to the attack, as the first thing the country has to do is establish who launched the drone, world affairs expert Professor Anthony Glees told The Mirror.\nREAD MORE: Jordan attack mapped as Iran drones kill 3 US troops amid World War 3 fears\nImage: AFP via Getty Images) AFP via Getty Images)\nProfessor Glees, from the University of Birmingham, said Kataib Hezbollah an Iranian Revolution Guard trained and equipped Shia militia based in Iraq, are rumoured to be behind the drone strike. If this is proved to be the case, it would mean that the US might launch strikes against them in Iraq, the expert added.\nIt would also mean that Biden will not have to escalate tensions in the Middle East by attacking Iran. However, professor Glees said we will need to wait for \"definitive intelligence\" before knowing for sure who was responsible for the attack.\nThe expert told us: \"The $64,000 question is who launched the drone. That will tell the Americans where to strike. We're told Kataib Hezbollah, an Iranian Revolution Guard trained & equipped Shia militia based in Iraq are likely responsible. Sounds entirely plausible.\n\"That'd mean strikes against them in Iraq. That'd also mean Biden won't have to further escalate the conflict by attacking Iran. However, we await definitive intelligence which will be forthcoming. Whether the public will get to know what the intelligence says is another matter.\"\nAreas US could strike\nKataib Hezbollah's stronghold in Iraq\nIranian personnel in Syria\nIranian personnel in Iraq\nIranian naval assets in the Persian Gulf\nImage: Planet Labs/AFP via Getty Images) Planet Labs/AFP via Getty Images)\nIraq's Kataib Hezbollah militia has a stronghold in Jurf Al-Sakhar, located some 50 kilometres south of Baghdad. On January 24, the US struck several targets in the area in retaliation for drone and missile attacks. The exact areas the US might decide to strike currently remain unclear.\nAccording to Politico, other options on the table for the Pentagon include striking Iranian personnel in Syria or Iraq or Iranian naval assets in the Persian Gulf. It is believed that once Biden makes his decision, retaliation would likely begin a few days later and possibly come in waves.\nBiden said in a written statement that the United States \"will hold all those responsible to account at a time and in a manner (of) our choosing.\" Defense Secretary Lloyd Austin said: \"We will take all necessary actions to defend the United States, our troops, and our interests.\"\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US.\nIran-backed fighters in east Syria began evacuating their posts, fearing US airstrikes, according to Omar Abu Layla, a Europe-based activist who heads the Deir Ezzor 24 media outlet. He said the areas are the strongholds of Mayadeen and Boukamal.\nUS Central Command said at least 34 troops were injured by the one-way attack drone, with eight flown out of Jordan for follow-up care. It described the eight as being in stable condition.\nThe large drone struck a logistics support base in Jordan known as Tower 22. It is along the Syrian border and is used largely by troops involved in the advise-and-assist mission for Jordanian forces.\nImage: AFP via Getty Images) AFP via Getty Images)\nCentral Command said approximately 350 US Army and Air Force personnel were deployed to the base. The three who were killed and most of the wounded were Army soldiers, according to several US officials, who spoke on condition of anonymity to give details not yet made public.\nThe small installation, which Jordan does not publicly disclose, includes US engineering, aviation, logistics and security troops. Austin said the troops were deployed there \"to work for the lasting defeat of ISIS\". Three officials said the drone struck near the troops' sleeping quarters, which they said explained the high casualty count.\nThe US military base at al-Tanf in Syria is just 20 kilometres (12 miles) north of Tower 22. The Jordanian installation provides a critical logistical hub for US forces in Syria, including those at al-Tanf, which is near where the borders of Iraq, Syria and Jordan intersect.\nIn a statement on Jordan's state-run Petra news agency, the country \"condemned the terrorist attack\" that targeted the US troops. That report described the drone strike as targeting \"an outpost on the border with Syria\" and said it did not wound any Jordanian troops.\n\"Jordan will continue to counter terrorism and the smuggling of drugs and weapons across the Syrian border into Jordan, and will confront with firmness and determination anyone who attempts to attack the security of the kingdom,\" the statement attributed to Muhannad Mubaidin, a government spokesman, said. US troops long have used Jordan, a kingdom bordering Iraq, Israel, the Palestinian territory of the West Bank, Saudi Arabia and Syria, as a basing point. Some 3,000 American troops typically are stationed across Jordan.\nSince the war in Gaza began October 7, Iranian-backed militias have struck American military installations in Iraq more than 60 times and in Syria more than 90 times, with a mix of drones, rockets, mortars and ballistic missiles. The attack Sunday was the first targeting American troops in Jordan during the Israel-Hamas war and the first to result in the loss of American lives. Scores of US personnel have been wounded, including some with traumatic brain injuries, during the attacks.\nThe militias have said that their strikes are in retaliation for Washington’s support for Israel in the war in Gaza and that they aim to push US forces out of the region. On Monday, Iran's foreign ministry dismissed the US accusation that Tehran was behind the drone strike, according to the official IRNA news agency.\nIt quoted ministry spokesman Nasser Kanaani as saying that the \"Islamic Republic of Iran has no role in decisions by resistance groups on how they support the Palestinian nation or defend their people.\" Iran, Kanaani said, is closely watching developments in the region and stressed that the \"responsibility for the consequences of provocative accusations against Iran will be on those who raise the baseless allegations.\"", "source_domain": "www.mirror.co.uk", "text": null, "title": "Where Joe Biden could target with strikes after three US troops killed in Jordan", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/joe-biden-could-target-strikes-31999874"}