{"authors": ["Perkin Amalaraj"], "date_download": "2024-02-05 15:18:12", "date_modify": "None", "date_publish": "2024-01-14 09:49:26", "description": "Video footage shows an eruption took place at 7.57am local time today, with magma, smoke and ash spurting high into the sky above the Icelandic town of Grindavik", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12961521%2FIceland-volcano-erupts-Grindavik-residents-ordered-evacuate-just-weeks-returning-homes.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/14/09/79989069-0-image-m-13_1705225673394.jpg", "language": "en", "localpath": null, "maintext": "Lava has creeped within 500m of homes in the fishing town\nAn Icelandic volcano has spewed lava within 500m of homes in the town of Grindavik, just weeks after residents were allowed to return to their homes following a major eruption.\nVideo footage shows an eruption took place at 7.57am local time today, with magma, smoke and ash spurting high into the sky above the town of Grindavik, 25 miles away from Iceland's capital Reykjavik.\nThe fissure grew many times its initial size within just thirty minutes, meteorologists reported. Geologist Magnús Tumi Guðmundsson told local media that the crack is currently a kilometre (3,280 ft) long, adding that he wasn't certain when it would stop growing.\nPictures show the lava slowly creeping towards the fishing town, with officials saying that the flow is just 500m (1,500 ft) away from hitting the northernmost buildings. Video posted to X shows a second eruption taking place just after midday today.\nIceland's president, Gudni Johannesson, said in a post to X: 'No lives are in danger, although infrastructure may be under threat.'\nThe January 14 eruption (pictured) began north of the fishing town of Grindavik, and photos appear to show lava slowly flowing towards the town itself\nThe lava from this morning's eruption was seen creeping towards homes in the northernmost part of the town of Grindavik. Officials said the lava is currently just 1,500 ft away\nThe Icelandic Meteorological Office said that lava is currently just 1,500 ft away from the northernmost houses in the town of Grindavik\nAnalysis of departure and arrival schedules for nearby Keflavik Airport shows that flights do not appear to be affected by the news of this morning's eruption, with no arrivals or departures showing signs of being delayed or cancelled at time of publication.\nIceland Air, the country's national carrier, said today: 'Our schedule and the operation of Keflavík airport are not affected.'\nLocal tourism hotspot, the Blue Lagoon hotel, however was evacuated last night, after reopening just a week ago.\nSeismic activity intensified overnight and residents of Grindavik were evacuated around 3am local time, Icelandic public broadcaster RUV reported. The broadcaster also reported that around 200 of the town's 4,000 residents have elected to stay, despite the warnings.\nThe Public Safety Department of the National Police reported that last night, 200 earthquakes were recorded, and the town of Grindavik is understood to have lost power at around 5am.\n'A crack has opened up on both sides of the dikes that have begun to be built north of Grindavik,' the Icelandic Meteorological Office said, with an official adding that this morning's eruption is about a quarter of the size of the one in December.\nA coast guard helicopter has been dispatched to assess the situation, Iceland's Civil Protection agency said, adding that the evacuation order will likely be in place for the 'upcoming three weeks.'\nThe eruption began north of the fishing town of Grindavik, and photos appear to show lava slowly flowing towards the town itself, having bypassed the eruption defences that were set up in the weeks after the December eruption.\nThe Icelandic Meteorological Office said that lava is currently just 1,500 ft away from the northernmost houses in the town of Grindavik.\nPolice have asked Icelanders not to go anywhere near the eruption\nAnalysis of departure and arrival schedules for nearby Keflavik Airport shows that flights do not appear to be affected by the news of this morning's eruption\nToday's eruption is understood to be around a quarter of the size of the one in December\nAround 200 residents still remain in nearby Grindavik\nIceland Air, the country's national carrier, said today: 'Our schedule and the operation of Keflavík airport are not affected.'\nREAD MORE: Scientists reveal just how bad the eruption could get as bubbling lava and smoke are spewed into the sky at Reykjanes peninsula after weeks of activity Advertisement\nPolice have asked Icelanders not to go anywhere near the eruption, with local police saying: 'We ask people not to go to the eruption on foot. It is extremely cold outside and the walk is long and the ground is unstable in terms of cracks and other things.\n'In addition, all responders are busy and do not have the manpower to pick up people who leave on foot.\n'The area is dangerous in terms of fissures, gas and more.'\nIceland's prime minister Katrín Jakobsdóttir has admitted that today's eruption was 'frightening.'\nShe told local media: 'It is, of course, frightening to see how close this is to the town.\n'The Civil Defense has of course been very keen to observe from day to day. Once again, I want to say that it was the right decision to evacuate tonight, even though we expected it wouldn't happen until tomorrow.\nGeneral view of the lava field near the evacuated town of Grindavik, in Iceland, December 22, 2023\nPeople watch as the night sky is illuminated caused by the eruption of a volcano in Grindavik on Iceland's Reykjanes Peninsula on December 18 2023\n'Of course, we have all eyes on this area to ensure the safety of the residents. However, it is quite clear that this is a huge burden for the townspeople. Naturally, the pressure is starting to take its toll on people.\n'As the situation is now, we are seeing that the lava is flowing towards Grindavík. The ramparts, however, may be useful even if the southern part of the fissure extends into them. We are monitoring the situation from minute to minute.'\nIceland's president, Guðni Thorlacius Jóhannesson, meanwhile said in a statement posted to social media: 'We are still reminded of the power of the forces of nature.\n'And still we hope for the best, as we do everything in our power to ensure people's lives.\n'[We are trying] to protect structures to the best of our ability.\nMembers of a rescue team watch a volcanic eruption north of the southwestern Icelandic town of Grindavik.\nIceland's president, Guðni Thorlacius Jóhannesson, said in a statement posted to social media: 'We are still reminded of the power of the forces of nature.'\nA police car blocks the access to the road that leads to Grindavik, after a volcano erupted in Iceland on Sunday January 14 2024\nA massive plume of gas was seen rising from the site of today's eruption\n'Together we Icelanders think warmly of [residents of Grindavik], and everyone who takes care of public protection and operations on the scene. Now we are all tested.'\nThe last eruption on the peninsula started in the Svartsengi volcanic system on December 18, following the complete evacuation of the town of Grindavik's 4,000 inhabitants and the closing of the Blue Lagoon geothermal spa, a popular tourist spot.\nGrindavik was ultimately spared as the lava flowed in a different direction from the town.\nIceland is home to 33 active volcano systems, the highest number in Europe. While volcanic eruptions aren't uncommon in Iceland, volcanoes on the Reykjanes peninsula were dormant for 800 years until 2021.\nLying between the Eurasian and North American tectonic plates, two of the largest on the planet, Iceland is a seismic and volcanic hot spot as the two plates move in opposite directions.\nThe residents of Grindavik were forced to evacuate overnight, following a series of earthquakes\nThe first eruption on January 14 is understood to have taken place at 7:57am today\nLava from today's eruption was seen slowly creeping towards infrastructure in Grindavik\nIn December, thrill-seekers were criticised for venturing towards, not away, from the eruption that forced thousands to flee their homes.\n'It's just something from a movie!' Robert Donald Forrester III, a tourist from the United States, said at the time.\nFour boys named Jói, Halli, Stefán and Stefán, told local media in December that they always head towards eruptions in Reykjanes.\n'We are trying to see the eruption. Unfortunately, we didn't get any closer. It's a hobby that we've had for four years, attending every single eruption, and we'll continue to do so.'\nFor local residents, the emotions are mixed. 'The town involved might end up under the lava,' said Ael Kermarec, a French tour guide living in Iceland. 'It's amazing to see but, there's kind of a bittersweet feeling at the moment.'\nThe Reykjanesbraut, a key Icelandic highway in the area, was lit up with white headlights from cars travelling towards, not away from, the crater (left) while cars were parked nearby (right) in December\nDespite the obvious dangers, the Ministry of the Environment was forced to issue repeated warnings to those thinking about getting close to the volcano in December\nA group watches as smoke billows into the sky from the volcano explosion in December\nDespite the obvious dangers, the Ministry of the Environment was forced to issue repeated warnings to those thinking about getting close to the volcano.\n'Think about someone other than yourself and follow the guidelines of the public safety. Please,' one spokesman begged.\nIcelandic Police added: 'An eruption has begun. We ask people not to be in front of the responders and not to go in the direction of the eruption. It is important that roads and other things are as accessible as possible.'\nPolice said they had raised their alert level and the country's civil defence warned the public not to approach the area while emergency personnel assessed the situation.\nThe December eruption began around 2.4 miles from the town of Grindavik at the Sundhjuka crater, on the Reykjanes peninsula.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Volcano eruption in Iceland sends lava spewing just 500 metres away from Grindavik as smoke seen billowing into the sky - as country's president reassures lives are not in danger and flights still run", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12961521/Iceland-volcano-erupts-Grindavik-residents-ordered-evacuate-just-weeks-returning-homes.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}