{"authors": [], "date_download": "2024-02-05 15:18:13", "date_modify": "None", "date_publish": "2024-01-14 16:34:23", "description": "As the Committee to Protect Journalists says more than 80 reporters have been killed in 100 days of the Israel-Hamas conflict, Maryam Zakir-Hussain speaks to reporters on the ground", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fgaza-palestine-israel-journalists-killed-b2468465.html.json", "image_url": "https://static.independent.co.uk/2023/12/22/15/2023-12-15T145706Z_1690347407_RC2OX4AVMULX_RTRMADP_3_ISAREL-PALESTINIANS-JOURNALISTS.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWearing their press jackets, a group of journalists sit together as they sing a haunting melody: “We will remain here in our homes, until the pain goes away.”\nSitting among the circle of Palestinians is Wael al-Dahdouh, an Al Jazeera correspondent all too familiar with pain and loss. The world watched as he learnt that his wife, son, daughter and grandson had been killed in an Israeli air strike on 25 October.\nJust two months later, al-Dahdouh was hit by shrapnel while he was reporting from the scene of a bombarded school in Khan Younis. Weeks later, his other son, Hamza – also a journalist – was killed in an airstrike by Israeli forces.\nWael al-Dahdouh buries his son, who was killed in an Israeli strike (Getty)\nThe same group that have been singing together gather around al-Dahdouh as he buries his son with one hand gripping a press helmet. Despite his unimaginable losses, he has continued reporting, saying: “All the world needs to see what is happening here.”\nAs Sunday marks the 100th day of the war, data from the Committee to Protect Journalists (CPJ) shows that more journalists have been killed in the first 10 weeks of the Israel-Hamas war than have ever been killed in a single country over an entire year.\nThe CPJ places the death toll at at least 82 – 75 of them Palestinian, four Israeli, and three Lebanese. The four Israeli journalists were killed in the 7 October Hamas attacks that left more than 1,200 people dead. Among them was Yaniv Zohar, a former Associated Press videojournalist, who was killed along with his wife and two daughters.\nThe International Criminal Court has announced it is investigating alleged offences against Palestinian journalists since the Hamas attacks, after Paris-based NGO Reporters Without Borders (RSF) filed a second complaint in December. RSF described the targeting of journalists as “intentional homicides of civilians”.\nThe United Nations said Gaza has seemingly become the deadliest place in the world for journalists and their families, as it raised concerns once again following the killings of Hamza Dahdouh and Mustafa Thuraya, a freelance videographer working for Agence France-Presse.\n“Very concerned by high death toll of media workers in Gaza,” the UN rights office wrote on X, adding: “Killings of all journalists, including Hamza Wael Dahdouh and Mustafa Abu Thuria in reported IDF strike on car must be thoroughly, independently investigated to ensure strict compliance with international law, and violations prosecuted.”\nMotee’ Masbhah says he feels obliged to continue reporting despite the danger posed (Supplied)\nEfforts to document the war are already being hindered by frequent communication blackouts and the refusal to allow journalists to rotate in and out of the Gaza Strip. Only a handful of international journalists have been permitted to enter Gaza with Israel Defense Forces (IDF) troops.\nSpeaking from al-Aqsa Hospital in Deir al-Balah, reporter Motee’ Masbhah tells The Independent: “No journalist here knows if they will live until the evening.\n“We are under deliberate and intentional targeting by the occupation,” he claims. “Israel wants to stop the Palestinian people from learning what is happening on the ground. It is blatant.”\nIsrael has denied targeting journalists, and said it does everything it can to avoid harming civilians in its war on Hamas.\nReuters journalist Issam Abdallah was killed while stationed 1km from the northern Israeli border with Lebanon (Reuters)\nFollowing the strike on Hamza Dahdouh and Mustafa Thuria, Israel initially claimed that its forces had “identified and struck a terrorist who operated an aircraft that posed a threat to IDF troops”.\n“We are aware of the reports that, during the strike, two other suspects who were in the same vehicle as the terrorist were also hit,” it added. However, the Israeli military’s chief spokesperson appeared to contradict this statement when he was asked by NBC to provide evidence to support the claims, as he responded: “We understand they were putting a drone, using a drone. And using a drone in a war zone, it’s a problem. It looks like the terrorists.”\nHe added that the incident would be investigated. The families of the journalists strongly rejected the claims. Al-Dahdouh’s family told the BBC they were “fabrications” made to justify the targeting of journalists.\nAbeer (centre), the sister of Abdallah, weeps at his funeral (AP)\nRamy Abdu, the founder of non-profit organisation Euromed Monitor, paid tribute to Bilal Jadallah, the director of Press House-Palestine, who was killed when an airstrike hit his car on 19 November. His most recent work, for the CPJ, documented a deadly pattern of journalist killings by the IDF.\n“No foreign press got into Gaza without Bilal’s help,” Abdu says. “But he was killed without any word of condemnation from Europe. They forgot about him.”\nJournalists documenting developments in the West Bank say they have also found themselves under threat while doing their job. Asif Nawfal, 28, describes dodging bullets as he and other journalists tried to cover settler attacks on the village of Deir Sharaf, west of Nablus, on 2 November.\nAbd Elkader Abd Elhalim, a Palestinian journalist based in Nazareth, calls the press climate “militant” as he describes a marked shift in his reporting.\nAsif Nawfal describes dodging bullets while reporting in the West Bank (Supplied)\n“The news I write is not at the same level that it used to be before, because we are afraid,” he says. “We are not as courageous as the people of Gaza. We are afraid of being detained or arrested, while others are facing death to tell their stories.\n“No one should have to show this level of bravery. No one should have to go through this. They are doing what has never been done before.\n“The world chooses to see what they want, and chooses to ignore what they want. If these stats were coming out of any other country outside of the Middle East, you would find condemnations and unbelievable efforts to stop this.”\nThe Israeli military has been contacted for comment.", "source_domain": "www.independent.co.uk", "text": null, "title": "Gaza journalists killed: The reporters risking their lives to cover the Israel-Hamas conflict in the deadliest modern war for journalists", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/gaza-palestine-israel-journalists-killed-b2468465.html"}