{"authors": [], "date_download": "2024-02-05 15:18:14", "date_modify": "None", "date_publish": "2024-01-14 12:53:27", "description": "The U.S. military isn't immune to the country’s deep political polarization and the service academies are trying to update how they teach future officers to navigate that divide", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-donald-trump-joe-biden-mark-milley-west-point-b2478411.html.json", "image_url": "https://static.independent.co.uk/2024/01/14/12/Democracy_Military_Academies_68155.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFor 75 minutes, Maj. Joe Amoroso quizzed his students in SS202, American Politics, about civilian leadership of the military, the trust between the armed forces and the public, and how the military must not become a partisan tool.\nThere was one answer, he said, that would always be acceptable in his class filled with second-year students at the U.S. Military Academy. Hesitantly, one cadet offered a response: “The Constitution.”\n“Yes,” Amoroso said emphatically.\nHis message to the students, known as yearlings, was simple: Their loyalty is “not about particular candidates. It’s not a particular person or personality that occupies these positions. It’s about the Constitution.”\nThe emphasis for the next generation of military officers that their loyalty must be focused on the nation’s democratic underpinnings rather than on any individual is a reflection of how the armed forces are being forced to deal with America's deep political polarization at a time when trust in traditional institutions is eroding.\nThe role of the military in particular has come under scrutiny as former President Donald Trump runs to reclaim the White House and has laid out an aggressive agenda should he win. It includes potentially using the military in ways other presidents have not. That could mean invoking the Insurrection Act to send units to the border or patrol the streets of predominantly Democratic cities.\nTrump's rhetoric about top commanders also has raised concerns. While in office, Trump once referred to the military leaders in his administration as “my generals.” Earlier this year, he suggested that a former chairman of the Joint Chiefs of Staff, retired Army Gen. Mark Milley, be put to death for treason.\nPresident Joe Biden, in his first campaign address of the year, warned about Trump's rhetoric on the military and its leadership.\nWith cadets and midshipmen drawn from across the United States, students at West Point and other service academies are aware of the national mood and the potential for political divisions to seep into the military.\nThey encounter an array of classes on the Constitution and, in some cases, the history of the civilian-military relationship. Each graduate who is commissioned takes multiple oaths at school and during their service. Milley emphasized the significance of the oaths in his retirement address last fall, appearing to take aim at Trump.\n“We don’t take an oath to a king or a queen or to a tyrant or a dictator. And we don’t take an oath to a wannabe dictator,” he said.\nAt the Air Force Academy, the Jan. 6, 2021, attack on the U.S. Capitol was a top subject of discussion in the Civil-Military Relations class when junior and senior-year cadets began the spring semester the next day.\nThe coincidental timing “brought introspection about their oath as future officers,” said the instructor, Marybeth Ulrich. One result was a cadet-driven initiative, the Oath Project.\n“Instigation of potential uprising or any issues on Capitol Hill creates immediate concern for the military and for the larger public as a whole. So we were very aware of the events as they were unfolding,” said 1st Lt. Darrell Miller, now stationed with the Space Force at Buckley Space Force Base near Denver, and one of the 13 students in the class who started the project.\nDozens of former and active duty military members have been charged in the Jan. 6 assault, an attempt to stop Congress from certifying the 2020 presidential election that Democrat Biden won over Republican Trump. A recent Defense Department inspector general report showed that dozens of military members were suspected of extremist activities that included conspiring to overthrow the government, though the number represents a tiny fraction of the more than 2 million U.S. service members.\nWhen the students examined the three oaths they had sworn to, Miller said they realized there had not been much education about them -- “a line by line breakdown. What does it mean? What are you really swearing your allegiance to essentially.”\nThe group suggested more emphasis on the history and purpose of their oaths and also “what you are actually swearing your allegiance to,” he said. One point was showing the distinction between countries where the military professed allegiance to sovereigns or individuals as opposed to the U.S. military's oath to the Constitution.\n“We knew what it was and the do’s and don’ts, but we didn’t really go into the why,” said 1st Lt. Bryan Agustin, another of the students behind the Oath Project who is stationed at Goodfellow Air Force Base in Texas.\nAlthough the seniors had a short time before graduation, they were able to change some of the language in their commissioning ceremony, adding more history about the oath before it was administered. The incoming basic class that fall also had the history added to their ceremony. According to copies provided by the academy, the phrasing in both cases noted that the oath had its roots in the Revolutionary War and was given to support “the democratic processes and civil liberties that our Founders enumerated in the Constitution.”\nSince then, the Oath Project has been instrumental in further changes, including to basic training for new students and to their handbooks. The group's work also is integrated throughout cadets' academic and military training. Future plans include symposiums for other service academies and ROTC units.\nAt West Point, the Constitution and the oaths are not only embedded throughout the curriculum, they also permeate the campus.\nConstitution Corner Monument is near student housing and a place cadets pass daily. Dedicated by members of the class of 1943 to their fallen classmates, it contains several markers that include inscriptions of their oaths and parts of the Constitution.\nInside Grant Hall, two of the alumni portraits that look down on diners and visitors loom large in the history of the oath and the civilian-military relationship. Ulysses S. Grant, who later became president, led the Union Army through the Civil War after an estimated 300 of his fellow graduates had rejected their oaths and fought for the Confederacy. Dwight D. Eisenhower was the Supreme Allied Commander in World War II who later became president and used the Insurrection Act to call on the 101st Airborne to help integrate Central High School in Little Rock, Arkansas.\n“The Constitution remains absolutely central to all the things that we teach, whether it’s expressly or it’s tangentially connected in the courses,” said Brig. Gen. Shane Reeves, dean of the academic board and a 1996 graduate.\nThe goal is training officers to win wars, but current events are intertwined, including Jan. 6, which routinely comes up in class discussions. Avoiding it would not be an option, said Reeves, whose family ties to West Point date to the 19th century. His son is due to graduate in May.\nHe said if newly minted officers cannot answer questions from their units about current events, “we would have failed.”\n“We want the cadets to be thoughtful and to think through and to understand what their obligations are,” he said. “They have some really important obligations — trust of the American people, trying to stay nonpartisan.”\nIn Amoroso’s American Politics class, the only mention of Biden and Trump, who so far has dominated the 2024 GOP primary campaign, came up in scenarios he presented about service members -– even retired ones -– speaking out in support of candidates and how that can be interpreted as the position of the military as a whole. While individuals retain the right to express themselves, it’s important that the military not be seen as partisan, he said.\n“Whether you like it or not, you’re going to be thrust into these political conflicts,” he told the cadets. No matter the circumstance, he added, their foundation should never change – loyalty to the Constitution.\n__\nThe Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.", "source_domain": "www.independent.co.uk", "text": null, "title": "US military academies focus on oaths and loyalty to Constitution as political divisions intensify", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-donald-trump-joe-biden-mark-milley-west-point-b2478411.html"}