{"authors": ["Caroline Davies"], "date_download": "2024-02-05 15:18:15", "date_modify": "None", "date_publish": "2024-01-14 15:59:50", "description": "President Volodymyr Zelenskiy represented by chief of staff as Switzerland says talks aim to finalise principles ‘for lasting and just peace’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F14%2Frussia-ukraine-war-live-frances-new-foreign-minister-pledges-continued-support-for-ukraine-in-visit.json", "image_url": "https://i.guim.co.uk/img/media/8a6e0d13a52943e24c1ef29a98c34554bd138e98/0_425_6960_4176/master/6960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=4c7a24794ba3ceca0dd4b9a0f8a4e248", "language": "en", "localpath": null, "maintext": "From 14 Jan 2024 13.05 CET Ukraine presents peace formula to meeting of national security advisers at Davos Ukraine pushed ahead with its peace formula to end nearly two years of war with Russia with a meeting of national security advisers from around the world in Davos on Sunday. President Zelenskiy, who is scheduled to address the World Economic Forum (WEF) in Davos later in the week, was not in the opening morning session, which included 81 participants from countries and international organisations. He was represented by his chief of staff Andriy Yermak at Sunday’s talks, which were also attended by the US special representative for Ukraine’s economic recovery, Penny Pritzker, as well as James O’Brien, the US assistant secretary of state for European and Eurasian affairs. As concerns grow about ongoing US support for the war during an election year, national security adviser Jake Sullivan and secretary of state Antony Blinken are both expected to address the WEF, which officially starts on Monday evening, Reuters reports. Switzerland, which hosted the NSA representatives, said the Ukraine peace talks aimed to finalise principles “for a lasting and just peace in Ukraine” at the level of national security advisers. The principles, it said in a statement last week, should form the basis for the next stages of the peace process. It is the fourth such meeting of national security advisers (NSA). Zelenskiy has presented a 10-point peace formula that, among other things, seeks the expulsion of all Russian forces from Ukraine – at a time when both sides are fighting from largely static positions along a roughly 1,500km (930-mile) frontline. “The war is far from over and peace is still nowhere in sight,” the Swiss department of foreign affairs said in a statement previewing Sunday’s talks. Andriy Yermak (left), head of the Ukrainian president’s office, and the Swiss federal councillor Ignazio Cassis participate in the fourth meeting of the national security advisers on the peace formula for Ukraine, in Davos, Switzerland. Photograph: Gian Ehrenzeller/EPA\nUpdated at 14.25 CET\n14 Jan 2024 16.59 CET The main developments today: Ukraine pushed ahead with its peace formula to end nearly two years of war with Russia with a meeting of national security advisers from around the world in Davos on Sunday.\nPresident Volodymyr Zelenskiy, who is scheduled to address the World Economic Forum in Davos later in the week, was not in the opening morning session, which included 81 participants from countries and international organisations. He was represented by his chief of staff, Andriy Yermak.\nChina needs to be involved in efforts to end the war between Ukraine and Russia, Switzerland’s co-chair of the Davos meeting Ignazio Cassis told a news conference after a session.\nRussian billionaire Oleg Deripaska said on Sunday in a Telegram post there was unlikely to be peace in Ukraine until at least May 2025 , and constructive discussion at Davos on ending the conflict would not be possible because no Russian delegation would attend.\nNorth Korea is forging closer ties with Moscow. Foreign minister Choe Son-hui will visit Russia from Monday to Wednesday at the invitation of her counterpart Sergei Lavrov, the North’s KCNA news agency said.\nFrance’s newly appointed foreign minister, Stéphane Séjourné, met Zelenskiy in Kyiv on Saturday on his first official visit abroad, vowing that Paris would maintain its support . “Despite the multiplying crises, Ukraine is and will remain France’s priority,” Séjourné told Ukraine’s foreign minister, Dmytro Kuleba, at a joint news conference earlier.\nZelenskiy said he and Séjourné had discussed Ukraine’s defence needs including joint production of drones and artillery.\nUkrainians are being urged to create drones for the military at home as part of the “People’s Drone ” project. Participants can take a free engineering course to teach themselves how to assemble a 7-inch FPV (first-person-view) drone at home.\nDenmark will allocate a new $21m (£16.5m) aid package to Ukraine for the restoration of the southern Ukrainian city of Nikolaev . The assistance package, among other things, includes projects for demining agricultural land and reconstructing the dormitory of the Nikolaev State Agrarian University.\nIn its latest defence intelligence update, the UK Ministry of Defence said the impact of the war with Ukraine on healthcare in Russia was “highly likely” being felt by Russia’s civilian population as they struggled to access hospital services and experience shortages of medical products due to treatment of wounded personnel.\nUkraine suffered a massed Russian missile attack in the early hours of Saturday, its air force said, adding that Moscow had fired some of its most fearsome hypersonic missiles . Air defences shot down Russian missiles in at least five regions across Ukraine, according to local officials from those provinces.\nRussian shelling of Kherson has injured at least six residents, according to reports by local and national officials. Russian forces fired 28 shells at Kherson on Saturday, hitting residential neighbourhoods and port infrastructure.\nA prominent liberal priest faces expulsion from the Russian Orthodox church for refusing to read out a prayer asking God to guide Russia to victory over Ukraine . In a verdict, a church court said Aleksiy Uminsky should be “expelled from holy orders” for violating his priestly oath.\nThe US president, Joe Biden, said during a press briefing on Saturday that Republicans would have “an awful lot to pay for” if they did not help pass military aid for Ukraine. This blog is now closing for today. Thank you for reading.\nUpdated at 17.25 CET\n14 Jan 2024 15.43 CET There is unlikely to be peace in Ukraine until at least May 2025 and constructive discussion at Davos on ending the conflict will not be possible because no Russian delegation will attend, Russian billionaire Oleg Deripaska said on Sunday. Antony Blinken, the US secretary of state, President Emmanuel Macron of France and several Middle East leaders are expected to attend next week’s World Economic Forum, where talks to end wars in Gaza and Ukraine are at the top of the agenda. “It is a pity that a constructive talk about the situation in Ukraine will not happen – there will be no Russian delegation,” Deripaska said in a post on the Telegram app, according to Reuters. “Don’t await peace before May 2025.” Deripaska, who is reported to have made his fortune by buying up stakes in aluminium factories, has been sanctioned by Britain for his alleged ties to Vladimir Putin. He has mounted a legal challenge against the sanctions.\nUpdated at 16.15 CET\n14 Jan 2024 15.35 CET Summary China needs to be involved in efforts to end the war between Ukraine and Russia, Switzerland’s co-chair of a meeting in Davos of top diplomats to prepare the ground for a peace plan said on Sunday. “China plays a significant role. We must find ways to work with China on this,” Swiss federal councillor Ignazio Cassis told a news conference after a session of the meeting, Reuters reports. China was not represented at the gathering of national security advisers before the World Economic Forum in Davos. The meeting of more than 80 officials is the fourth such gathering organised by Ukraine, which Cassis said must pave the way to talks between Moscow and Kyiv on ending the war. “A peace for the Ukrainian people is urgently necessary … We must do everything to end this war,” Cassis said, adding that so far Russia and Ukraine were not willing to make concessions. Cassis said that countries that had a dialogue with Russia, such as Brazil, India and South Africa, were involved in the discussions in Davos and could play an important role. “The participation of the Brics alliance is very important because these countries have a relationship to Russia … All this can create this collective movement to bring in countries that are far from the conflict but can play a role in influencing China and Russia,” Cassis said.\nUpdated at 16.21 CET\n14 Jan 2024 14.01 CET Ukrainians are being urged to create drones for the military at home as part of the “People’s Drone” project. According to Ukraine’s digital transformation minister Mykhailo Fedorov, the Victory Drones NGO is behind the “People’s Drone” project. Participants can take a free engineering course to teach themselves how to assemble a 7-inch FPV (first-person-view) drone at home. The Kyiv Independent reports: FPV drones are cheap to manufacture and can be precisely flown into targets. They have the capability of destroying much more expensive military equipment. The drones are “game-changers” in the war, according to Fedorov. The course offers Zoom sessions with instructors, a list of components, and must-have tools and materials to purchase to construct an FPV drone, as well as access to a community of engineers who offer advice and answers to any questions. The assembled drone is handed over to Victory Drones instructors for quality tests, and if they pass, they are transferred to the military. “Participants in the course have already handed over more than 100 drones to the military. Overall, more than 80% of them were submitted to Victory Drones instructors in good working condition, while the rest needed some adjustments. This is a very high success rate for pilot assembly!” Fedorov said.\n14 Jan 2024 13.30 CET The role of the global south in Ukraine’s peace formula talks has come into focus in Davos, where national security advisers were meeting on Sunday. Reuters reports: Many of the non-aligned countries from Africa, Latin America, the Middle East and Asia that have largely stayed on the sidelines over Ukraine will be represented in the Swiss mountain resort this week. Nigeria’s national security adviser Nuhu Ribadu could be seen attending the NSA meeting. Yermak said that there were participants from 18 Asian countries, 12 African countries and 6 South American countries. “Countries from the Global South are increasingly involved in our work,” Yermak said on his Telegram account. Ukraine , with strong backing from its allies, has consistently said it will not give up until it has reclaimed every piece of territory that Russia has taken. It is unclear, however, if countries in the Global South agree with that as a peace formula.\nUpdated at 13.34 CET\n14 Jan 2024 13.05 CET Ukraine presents peace formula to meeting of national security advisers at Davos Ukraine pushed ahead with its peace formula to end nearly two years of war with Russia with a meeting of national security advisers from around the world in Davos on Sunday. President Zelenskiy, who is scheduled to address the World Economic Forum (WEF) in Davos later in the week, was not in the opening morning session, which included 81 participants from countries and international organisations. He was represented by his chief of staff Andriy Yermak at Sunday’s talks, which were also attended by the US special representative for Ukraine’s economic recovery, Penny Pritzker, as well as James O’Brien, the US assistant secretary of state for European and Eurasian affairs. As concerns grow about ongoing US support for the war during an election year, national security adviser Jake Sullivan and secretary of state Antony Blinken are both expected to address the WEF, which officially starts on Monday evening, Reuters reports. Switzerland, which hosted the NSA representatives, said the Ukraine peace talks aimed to finalise principles “for a lasting and just peace in Ukraine” at the level of national security advisers. The principles, it said in a statement last week, should form the basis for the next stages of the peace process. It is the fourth such meeting of national security advisers (NSA). Zelenskiy has presented a 10-point peace formula that, among other things, seeks the expulsion of all Russian forces from Ukraine – at a time when both sides are fighting from largely static positions along a roughly 1,500km (930-mile) frontline. “The war is far from over and peace is still nowhere in sight,” the Swiss department of foreign affairs said in a statement previewing Sunday’s talks. View image in fullscreen Andriy Yermak (left), head of the Ukrainian president’s office, and the Swiss federal councillor Ignazio Cassis participate in the fourth meeting of the national security advisers on the peace formula for Ukraine, in Davos, Switzerland. Photograph: Gian Ehrenzeller/EPA\nUpdated at 14.25 CET\n14 Jan 2024 12.35 CET Denmark to allocate new aid package to Ukraine of over $21m Denmark will allocate a new aid package to Ukraine in the amount of more than $21m for the restoration of the southern Ukrainian city of Nikolaev. The assistance package, among other things, includes projects for demining agricultural land and reconstructing the dormitory of the Nikolaev State Agrarian University. “Denmark is one of our most committed partners in the recovery process. In the spring of 2023, the country took patronage over Nikolaev and the Nikolaev region. Since then, we have already made progress in restoring the city - most of the projects of previous aid packages have either already been completed or are moving forward successfully,” said Alexander Kubrakov, Minister of Development of Communities, Territories and Infrastructure of Ukraine. Earlier, Denmark and Sweden jointly announced a new package of military assistance for Ukraine worth about €240m, which included infantry fighting vehicles, the BBC reported.\nUpdated at 14.27 CET\n14 Jan 2024 11.59 CET The weekly “Stand with Ukraine” rally outside Sydney’s town hall on Sunday called for Australia to send 45 Taipan helicopters it no longer uses to Ukraine. Ukraine wants Australia’s decommissioned Taipan helicopters but they are reportedly being scrapped. In September last year, the Australian Army’s MRH-90 helicopters were retired 14-months earlier than scheduled, after a crash in Queensland killed four defence personnel during a training exercise two months earlier. Ukraine made an official request for the MRH-90’s on December 19, 2023, despite the aircraft’s safety and operational concerns. “Our assessment of risk is different. We’re at war,” Anton Bogdanovych, who helped organise a rally of Ukrainian supporters in Sydney on Sunday, told Australia’s ABC news. View image in fullscreen Ukrainians hold #FreeTheTaipans rally in Sydney, Australia. Ukraine has officially requested that Australia send it the 45 Taipan helicopters it no longer plans to use, which could be worth around $20million, however, the Australian government is currently planning on scrapping them despite years of useful life remaining. Photograph: REX/Shutterstock\n14 Jan 2024 11.21 CET In its latest defence intelligence update, the UK’s Ministry of Defence said the impact of the war with Ukraine on healthcare in Russia was “highly likely” being felt by Russia’s civilian population as they struggled to access hospital services and experience shortages of medical products due to treatment of wounded personnel. Latest Defence Intelligence update on the situation in Ukraine – 14 January 2024.\nFind out more about Defence Intelligence's use of language: https://t.co/iwtfBkgxq1 #StandWithUkraine 🇺🇦 pic.twitter.com/IixCCOZ5im — Ministry of Defence 🇬🇧 (@DefenceHQ) January 14, 2024\nUpdated at 11.59 CET\n14 Jan 2024 10.57 CET North Korea fired an apparent intermediate-range missile into the sea on Sunday, South Korea and Japan said, as tensions run high after Pyongyang’s recent launches of an intercontinental ballistic missile and its first military spy satellite, Reuters reports. The United States and its allies have previously condemned what they describe as Russia’s firing of North Korean missiles at Ukraine. with Washington calling it abhorrent and Seoul calling Ukraine a test site for Pyongyang’s nuclear-capable missiles. Moscow and Pyongyang have denied conducting any arms deals but vowed last year to deepen military relations. North Korea has stepped up pressure on Seoul in recent weeks, declaring it the “principal enemy”, saying the North will never reunite with the South and vowing to enhance its ability to deliver a nuclear strike on the U.S. and America’s allies in the Pacific. Pyongyang’s isolated government is forging closer ties with Moscow. Foreign Minister Choe Son Hui will visit Russia from Monday to Wednesday at the invitation of her counterpart Sergei Lavrov, the North’s KCNA news agency said on Sunday. “Pyongyang*s show of force should be of concern beyond Seoul, as its military cooperation with Moscow adds to the violence in Ukraine , and because it may be more willing to challenge the U.S. and its allies while global attention is fixed on the Middle East,” said Leif-Eric Easley, an international studies professor at Ewha Womans University, Reuters reports. The U.S. State Department on Thursday imposed sanctions on three Russian entities and one individual involved in the transfer and testing of North Korea’s ballistic missiles for Russia’s use against Ukraine.\n14 Jan 2024 10.25 CET Russian shelling of Kherson injures at least six, say Ukraine officials Russian shelling of Kherson has injured at least six residents, according to reports by local and national officials. Russian forces fired 28 shells at Kherson on Saturday, hitting residential neighbourhoods and port infrastructure. The regional military administration reported today that at least six people were injured, according to the Kyiv Independent. Kherson has been shelled on a regular basis ever since Russian forces left the city and retreated across the Dnipro River in November 2022.\nUpdated at 14.25 CET\n14 Jan 2024 09.59 CET The US president, Joe Biden, said during a press briefing on Saturday that Republicans would have “an awful lot to pay for” if they did not help pass military aid for Ukraine. Republicans in the US Senate blocked a supplemental funding bill that included $61bn in aid for Ukraine in a procedural vote held on 6 December. Republicans in both chambers of Congress had demanded stricter border regulations in exchange for their support, and they said the bill failed to meet their requirements. Ahead of the 6 December vote, Biden had delivered an address to urge Congress to pass the bill, warning that a failure to act would only benefit Vladimir Putin, Russia’s president.\nUpdated at 10.22 CET\n14 Jan 2024 09.37 CET A former mayor of the Russian city of Vladivostok has enlisted to fight in Ukraine and departed for the front after he was sentenced to 12 years in prison for corruption, the Kommersant newspaper reported on Sunday, citing his lawyer. Oleg Gumenyuk, a former Vladivostok mayor, was last year sentenced to 12 years in prison for taking bribes of 38 million roubles ($432,000). He served as mayor from 2018 to 2021, resigning amid a flurry of criticism of his record from local and federal officials, Reuters reports. “According to an order issued to Gumenyuk, he was supposed to report to his military unit on December 22,” Kommersant cited Gumenyuk’s lawyer Andrei Kitaev as saying. Kitaev could not be reached for immediate comment.\nTens of thousands of Russian prisoners volunteered for service in Ukraine taking advantage of an offer of clemency for those who survive their stints at the front.\n14 Jan 2024 09.20 CET President Zelenskiy said he and Séjourné had discussed Ukraine’s defence needs including joint production of drones and artillery. He posted on X :“We discussed Ukraine’s defense needs, including joint production of drones, artillery, and further strengthening of air defense. I updated Minister Séjourné on the Peace Formula’s progress. I thank France for its active role in this global effort.” Today, I hosted France’s new Foreign Minister Stéphane Séjourné @steph_sejourne.\nWe discussed Ukraine’s defense needs, including joint production of drones, artillery, and further strengthening of air defense. I updated Minister Séjourné on the Peace Formula's progress. I thank… pic.twitter.com/SX4je0iFbT — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) January 13, 2024", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Ukraine presents peace formula to meeting of national security advisers at Davos - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/14/russia-ukraine-war-live-frances-new-foreign-minister-pledges-continued-support-for-ukraine-in-visit"}