{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:18:19", "date_modify": "None", "date_publish": "2024-01-13 19:21:18", "description": "As the war rages on with no immediate end in sight, experts spoke to MailOnline about the future of Gaza, Israel and conflict in the Middle East.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12877813%2FPeace-Middle-East-faces-obstacles-calls-permanent-Israel-Hamas-ceasefire-grow-louder-sides-clear-sustaining-violence-untenable-experts-warn.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/22/08/79246257-0-image-a-9_1703234664031.jpg", "language": "en", "localpath": null, "maintext": "On October 7 2023, Hamas launched a bloody incursion into southern Israel, killing nearly 1,200 people and taking some 240 hostage. In the weeks that have followed, Israel's military has responded with an unprecedented military campaign in Gaza, displacing some 90 per cent of the population and killing more than 20,000.\nThe violence has provoked strong international reactions, many urging a ceasefire to limit casualties and allow aid to reach the places it is needed most. Pro-Palestinian demonstrators world over have repeatedly called for a humanitarian pause, while foreign governments urge care and restraint as the Israel Defense Forces wade through residential areas of Gaza to recover hostages and depose Hamas' leaders.\nIn Israel, too, families of hostages have urged Prime Minister Benjamin Netanyahu and his war cabinet to ensure the safe return of loved ones through negotiation with Hamas. Campaigners cite recent accounts of abuse, beatings and rape from civilians returning to Israel, as IDF troops continue to report back new challenges in finding and safely returning Israeli captives.\nStill, there is no clear path for de-escalation. Both sides have much to lose from the wrong deal, and their demands fluctuate with the changing state of the war. Israel has the larger military but faces mounting unrest among its allies and citizens. Hamas has large support in Gaza but a weaker conventional fighting force and a decimated population.\nAs the war rages on with no immediate end in sight, experts spoke to MailOnline about the future of Gaza, Israel and conflict in the Middle East.\nThe grandfather of a Palestinian girl killed in an Israeli airstrike kisses her head at a hospital in Rafah in the southern of Gaza Strip, on October 19\nIsraeli police officers evacuate a family from a site hit by a rocket fired from the Gaza Strip, in Ashkelon, amid Hamas' October 7 assault on southern Israel\nAn IDF soldier stands at the scene where Israeli citizens Itay and Hadar Berdichevsky, both 30, died trying to save the lives of their 10-month-old twins in their home in Kibbutz Kfar Aza after armed members of Hamas broke in on October 7\nSmoke rises following an Israeli bombardment in the Gaza Strip, as seen from southern Israel, Saturday, December 16, 2023\nPalestinians check a half destroyed building following Israeli bombardment on Rafah, in the southern Gaza Strip, on December 15, 2023\nIsraeli army Merkava battle tanks deploy along the border with the Gaza Strip in southern Israel on October 13, 2023\nIsraeli soldiers organize their equipment near the border with the Gaza Strip on December 4\nScores of hostages were taken into Gaza by Hamas during the initial assault into Israel in October. Hamas soon made demands for political prisoners in Israel to be released in exchange for their safe return. After weeks bombarding the Gaza Strip, Israel agreed terms for the first significant prisoner swap and a humanitarian pause in November that would allow vital aid to reach the beleaguered communities within the Palestinian enclave.\nUpon their return, hostages recounted the dire conditions they were exposed to in captivity. Some gave chilling accounts of rape, physical beatings and psychological torture, making clear the urgency of returning those remaining through force or negotiation. Crucially, their testimonies also uncovered some of the challenges the IDF faces working inside Gaza: Some returning said Israel's siege had made conditions worse for hostages. One warned her husband had been taken to a tunnel just as the IDF began to explore the possibility of flooding them.\nREAD MORE 100 images that shocked the world: Three weeks after Hamas slaughtered Israeli families, the photographs that illustrate the horrors of their attack and their dreadful consequences Advertisement\nIsrael's military faces a complex and delicate situation operating in Gaza. The accidental killing of three hostages in December, found waving a makeshift white flag and crying 'help' in Hebrew, has exposed the difficulty in operating within dense urban environments. The killing of a Christian mother and child sheltering in a church soon after fueled concerns the campaign at its current pace is unsustainable.\nOn top of this, attacks on container ships in the Red Sea by Hamas-aligned Houthi rebels in Yemen has this week seen strikes by US-led coalition forces, drawing the ire of Iran and threatening to escalate the conflict in the southern Levant into a regional war.\nThe revelation of these new challenges has amplified calls for a ceasefire in Gaza - but remains a minority view in Israel as leaders and citizens doubt the prospects of a long-term peace process. Nevertheless, pressure from Israel's allies, experts say, has fundamentally changed the nature of the conflict and what both parties may expect a resolution to look like.\n'I think there is a growing realisation among the IDF, among security services and among the public, that the military cannot free these hostages or get these hostages out alive,' explains Dr Andreas Krieg, Assistant Professor of Defence Studies at King's College London. 'There is a realisation there is no military way to get them out so that increases the pressure on the government to respond and seek a deal.\n'There is a realisation that this kind of operational tempo is not sustainable. It's not sustainable in terms of the casualties that are being generated. The amount of casualties among Palestinian civilians is completely unprecedented, I think, in modern warfare because ultimately [the IDF] can't leave. They're just there.'\nWith US pressure mounting on Israel to scale back the conflict, Hamas has since requested the release of all Palestinian security prisoners in Israel in return for the remaining hostages, while turning down an ambitious proposal by Egypt to end the fighting and move towards a singular Palestinian government that could include Hamas.\nWhere many of those released in the first ceasefire were civilians, the new list will include 'Palestinian Islamic Jihad terrorists and other high ranking, high profile terrorists', and demands will include 'some sort of permanent ceasefire'.\nThese releases will be harder to justify for an Israeli government tasked with promising its citizens security. But 'Hamas has moved forwards in terms of their demands,' Dr Krieg explains.\nHamas is 'realising the IDF is not making the progress that they thought they were making and the IDF is realising that this military solution is going to take years.\n'But there is no stomach in the US or domestically to keep this going at the current rate so something has got to give.'\nAbandoned and torched vehicles at the site of the October 7 attack on the Supernova music festival near Kibbutz Reim in the Negev desert in southern Israel\nA car destroyed in an attack by Hamas is seen in Sderot, Israel, on Saturday, October 7, 2023, amid the first strikes into Israel\nAn overturned pram on a street in Israel is pictured following Hamas' incursion into southern Israel on October 7\nSmoke rises following an Israeli bombardment in the Gaza Strip, as seen from southern Israel, Saturday, December 16, 2023\nAn aerial view of destroyed buildings following the Israeli airstrikes in Al-Rimal neighborhood of Gaza City on October 12\nFinding agreeable terms will be the next challenge. For Netanyahu, this means being able to evidence results - in returning the hostages safely and ensuring nothing similar can ever happen again by deposing senior Hamas commanders.\nHamas has said it would accept a return to the borders that existed between Palestine and Israel before the Six Day War in 1967. For Israel, this would mean giving up strategic sites including the Golan Heights, from which adversaries could launch future attacks from above, and territories settled by Israelis.\nPhilip Ingram MBE, retired British Army colonel and military intelligence specialist, told MailOnline: 'Any long term solution must be a two-state solution but what that would look like is almost anyone's guess. A certainty would be Israel handing over what is currently formally Israeli territory and this will almost certainly include the West Bank and there would have to be some for of joint arrangement around Jerusalem.\n'A sticking point would be access to the sea and how you would link the West Bank to that with security guarantees.'\nLong-term security is challenged by neighbouring Arab states and Iran vying for influence in the region, as well as the new security challenges independent Palestinian statehood could bring, suggests Mr Ingram.\n'Iran continues to stir from all directions and shows no sign of backing down. Worryingly we are seeing increasing cooperation between Iran, Russia and North Korea which brings yet another level of complexity to what is already a multi-dimensional game of chess.'\nStill, foreign onlookers recognise that further escalation is in nobody's interests. Dr Tobias Borck, researcher at the Royal United Services Institute (RUSI) in London, told MailOnline: 'I think we can say by now with relative confidence that there isn't an actor in the Middle East that wants this to turn into a big regional war.\n'However, just because there is no one with the strategy for regional escalation, doesn't mean that there won't be regional escalation, because I think the risk of something going wrong compounds the longer this goes on.\nThe main 'flashpoints' for escalation, Dr Borck says, are in the Red Sea, where the Houthi attacks on trade vessels risks bringing the US and UK into more direct action against Iranian proxies in Yemen, in Lebanon, where evacuated civilians risk involvement in clashes between Israel and Hezbollah, and rising violence in the West Bank.\nStill, many Israeli voices urge that the political forces representing Palestine are so fundamentally opposed to Israel, there is no way to successfully de-escalate and make a deal with the current administration without achieving strategic victory.\nCaroline Glick, host of the Caroline Glick Show, told MailOnline: 'The obstacle to negotiating a peace deal, the reason that peace is unachievable, is because all political forces in Palestinian society support and seek the annihilation of the Jewish state and the Jewish people.\n'There is no constituency in Palestinian society that is willing to peacefully coexist with Israel... The conflict cannot be resolved so long as this remains the situation in Palestinian society.\n'The only way that anyone in Palestinian society may one day reconsider this view is if they are defeated so completely and comprehensively that they retain no hope whatsoever of destroying Israel.\n'The only way there will ever be a possibility of peace is if the international community makes clear that the Palestinians will receive no further support from anyone so long as they embrace jihad and genocide as the animating features of their society.'\nMs Glick is a former IDF captain and senior fellow for Middle Eastern Affairs at the Center for Security Policy in Washington.\nIsraeli soldiers sit in an infantry-fighting vehicle deployed at a position along the border with the Gaza Strip and southern Israel on December 27, 2023\nIsraeli soldiers carry the coffin of Israeli IDF soldier, Elisha Yehonatan Lober, during his funeral in Mount Herzl military cemetery in Jerusalem, 27 December 2023\nRelatives and family mourn as Israeli soldiers carry the coffin of Israeli IDF soldier, Elisha Yehonatan Lober, during his funeral in Mount Herzl military cemetery in Jerusalem\nAn aerial view of burial of the 80 Palestinians who died in Israeli attacks, to a mass grave at Tel al-Sultan Cemetery in Rafah, Gaza on December 26, 2023\nA general view of the Khalifa Bin Zayed School, destroyed following the Israeli attacks, in Beit Lahia, Gaza on December 26, 2023\nIn any outcome, Israel's leaders will look to ensure that Israel retains full control over security and that no future movement in Gaza can again acquire the means for an attack on the scale of October 7.\n'With all the different solutions that are being thrown around at the moment... it is very clear that Israel will not surrender the security side of the story to a third party,' adds Dr Krieg. 'A scenario whereby a new authority in Gaza would have control over all elements of statecraft, governance and security... That's not going to happen.'\nWhat were the Oslo Accords? The Oslo Accords were a pair of agreements signed in 1993 and 1995 between Israel and the Palestinian Liberation Organization, a body internationally recognised as the official representative of the Palestinian people seeking Arab statehood in occupied Palestinian territories. The Accords began a peace process aimed at fulfilling the Palestinian people's right to self-determination and led to the creation of the Palestinian National Authority - a new body tasked with helping govern parts of the West Bank and Gaza Strip. Negotiators came close to creating a deal enshrined in law that would create two separate states and appease both the Palestinians and the Israelis - but issues over land and the right of refugees who fled Palestine to return became sticking points. PLO chief and Fatah founder Yasser Arafat had accepted the premise of a two state solution in 1988 but pulled out of a deal in 2000. That year, Palestinians expelled all Israelis from the Gaza Strip in the Second Intifada - but Fatah steadily lost support with accusations of corruption. Hamas ousted Fatah in the Battle of Gaza after campaigning as a more viable alternative in the 2006 legislative elections. Advertisement\nStill, Netanyahu has been careful with his words so far. On November 6, the Prime Minister told ABC that he believed Israel would 'for an indefinite period have the overall security responsibility [over Gaza] because we've seen what happens when we don't have it'.\n'When we don't have that security responsibility, what we have is the eruption of Hamas terror on a scale that we couldn't imagine,' he said.\nBut this does not necessarily suggest a reoccupation, experts say, even as some elements of his government on the far-right call for it.\n'I don't think that's a feasible solution because not only is the Arab League against it, I think the European Union is against it and the US is against it as well,' says Dr Krieg. 'I don't see that Israel would push this forward - at least in the short term.'\nStill, a partial occupation now could develop into a more mid-to-long-term status quo later on, experts say - something Hamas will be wary of as the conflict rages on, looking to the West Bank.\nTo Gaza's east, three zones, A, B and C, were set up during the Oslo Accords while negotiations were held. When talks broke down, the zones 'became the permanent solution - and that's 30 years in the making'. Since then, Israel has built settlements in B and C, particularly in C Zone, 'which now makes statehood for Palestine - based on the current status quo - impossible,' says Dr Krieg.\nFrom the Israeli perspective, 'the fear is if the IDF doesn't have an exit route - and they don't have an exit strategy at the moment, a political exit strategy - that the IDF might just stay [in Gaza].'\n'That would then create resentment across all factions within Palestine, it would cause resentment in the Arab world, and global public opinion has already shifted against Israel... So the optics on this are extremely sensitive and obviously Palestinians - whether it's Hamas or not - will turn against any sort of permanent presence, or even mid-term presence of the IDF in the territory.'\nDr Borck added 'I think the conclusion that the Israeli government has drawn from October 7 is that there was simply too much space to operate for a group like Hamas and that can't be; that has to be disrupted in the future.\n'My understanding is that where things are headed under the current leadership is towards a sort of re-occupation of Gaza but by a different name. I think the model that is being put on Gaza is essentially the West Bank.\n'It's about carving up the rest of the Gaza Strip with the idea of maintaining overall security control. I think what that means is maintaining presences in the non-populated areas of Gaza... with the ability to go in and out of Palestinian communities a bit like [Israel] does in the West Bank.'\nDr Borck added that October 7 'showed how unsustainable all of these temporary-turned-permanent solutions', as in the West Bank, are, but warns political change is unlikely so long as 'the architects of the current status quo' including Benjamin Netanyahu remain in power.\nBut with only 15 per cent of Israelis wanting Netanyahu to stay in power after the war, many outraged October 7 was able to happen under his leadership, the end of the conflict may bring about political change, new ideas and new solutions - if parties on both sides are willing to open discussions.\nDefence Minister Yoav Gallant outlined proposals for the future governance of Gaza in early January, detailing plans for limited Palestinian rule in the territory with Israel retaining overall security control.\nOthers have suggested a UN-brokered process with multiple stakeholders guarding the Gaza Strip and Arab states taking over 'some sort of mentoring role', says Dr Krieg. Under a UN-brokered mandate or a UN-Arab League mandate, Israel would have some say in decision-making in Gaza and reserve the right to intervene 'wherever necessary to push back against armed groups'.\nAnd still, some call for the return of the Palestinian Authority from the West Bank as an interim government. But the PA 'is not about to ride into Gaza on the back of Israeli tanks,' notes Dr Borck, suggesting 'that would be the political end for an organisation that's already politically half dead'.\nThree zones, A, B and C, were set up during the Oslo Accords while negotiations were held. When talks broke down, the zones 'became the permanent solution - and that's 30 years in the making', says Dr Krieg\nAn Israeli soldier secures a tunnel underneath Al Shifa Hospital in Gaza City, November 22\nCivil defense teams and Palestinians carry out search and rescue operations in the rubble of the buildings destroyed in an attack in Rafah, December 19\nAn injured man bids farewell to the body of his son as they lie in a hospital, in the aftermath of overnight Israeli bombardment, in Rafah in the southern Gaza Strip on December 19, 2023\nWounded Palestinian children lay at the al-Shifa hospital, following Israeli airstrikes, in Gaza City, central Gaza Strip, Tuesday, October 17. Around 3,000 people were reported to have been killed in Israeli strikes on the Gaza Strip, the health ministry in Gaza that day\nIf Hamas is ultimately displaced from power, factions in the region will wrestle with the challenge of filling the space. Experts warn this could result in a 'terrible' humanitarian situation for the Palestinians and open new security threats for Israel.\n'If you remove Hamas and Hamas security infrastructure and governance infrastructure in Gaza you are left with a vacuum,' Dr Krieg says. 'And we are seeing that in some areas [already]. We have looting, people acting out because there is effectively no police, no law enforcement.\n'It would be a very terrible situation if the IDF just retreated to a forward-operating base and then left the rest of the population in a completely destroyed country with no infrastructure, humanitarian crises and no government structure in place.'\nSome two million Palestinians living in Gaza have been internally displaced as of January 2023. In October, civilians were ordered to evacuate the north ahead of Israeli bombardment. In December, similar orders followed in the south and later the centre. Few have homes left to return to. The borders are closed with rare exceptions. Gaza's neighbours are unlikely to be willing to take in a large population of refugees post-war from precedent of international attacks.\nIn this environment, deprived of leadership and vital infrastructure, radical forces may look to exploit the power vacuum in Gaza, as experienced in Iraq. The Washington Institute - a pro-Israel think tank - warned in November that if Israel continues its campaign without an exit strategy, chaos may become the new order.\n'Criminal mobs, the rise of warlords or dominance of powerful clans, poverty, famine, diseases, the radicalisation of a resentful and beaten population... would present enormous security, geopolitical, humanitarian, and international challenges. As such, rebuilding an administrative infrastructure for Gaza should be an immediate priority.'\nSome 50,000 workers are employed in various public sector roles in Gaza. Their fate is unclear. But if Israel is to avoid the mistakes of America's 'De-Ba'athification' of Iraq, it must be careful with how it interacts with Gaza's most fundamental institutions, experts warn.\n'In Iraq... there was not enough planning for the day after,' says Dr Borck. 'And here we have the same problem... Hamas is not going to be destroyed; it will continue to exist. But who takes over in Gaza? Who somehow provides a modicum of security, who picks up the rubbish, who hands out enough food for people not to starve? No one has an answer for that yet.'\nIn his plan for a post-war Gaza, Gallant 'argues that the Palestinians should run themselves. But who these people are that are supposed to run themselves is very unclear,' Dr Borck adds.\nPresented with these challenges, the United States has left open the possibility of Hamas staying in power after the conflict. While it remains 'clear on its position' on Hamas - designated a terrorist organisation - 'Palestinians' voices and aspirations must be at the centre of post-crisis governance in Gaza,' a US government spokesperson told JNS in December.\nWinning support for regime change in Gaza is no small task. A survey of Palestinians in both territories in November found 63 per cent believed 'armed struggle' to be the most effective strategy for attaining independence - a ten per cent hike in three months. Only 13 per cent favoured non-violent protest and 20 per cent negotiations with Israel. Support for Hamas spikes during times of conflict and falls during peacetime, pollsters say.\nBut Israel's current approach to Gaza 'doesn't understand the lesson here,' argues Yousef Munayyer, a senior fellow and head of the Palestine/Israel Program at the Arab Center in Washington. 'You cannot kill people into liking you. Until you sort of grasp that — it’s impossible to break out of this unending pattern of bloodshed,' he told NBC.\nOn the other side, Israeli sympathy for the Palestinian position has declined since the massacre of civilians in October. Support for a two-state solution among all Israelis, including Jews and Arabs, is now at its lowest since the start of the Oslo process. And despite occasional protests, only 1.8 per cent of Israelis today believe the IDF is using too much force in Gaza.\nThe narrative around the war is further complicated by access to information. While nearly 80 per cent of Palestinians oppose the killing of Israeli civilians and the taking of hostages, 85 per cent say they have not seen footage of Hamas' atrocities against civilians on October 7 - not helped by the cutting off of internet access to Gaza.\nA journalist for Israeli outlet Haaretz also claimed in December Israelis were not being exposed to the 'horrifying' scenes in Gaza, making it 'much easier' for people to support the continuation of the conflict without 'critique' or 'question marks'.\nThese challenges are among many Israelis and Gazans will have to contend with as they look to restore enough trust to build a lasting peace process.\nIsraeli activists protest against the war and call for cease fire on December 26, 2023 in Tel Aviv\nWounded Palestinians arrive to al-Shifa hospital, following Israeli airstrikes on Gaza City, central Gaza Strip, October 16\nRuaa Hassouna plays music for Palestinian children in an activity designed to cheer them up amid continuing battles between Israel and Hamas, in Rafah, December 18, 2023\nA pro-Palestinian supporter wears and waves Palestinian flags along Vienna's famous Mariahilfer shopping street, decorated with the Christmas lights, on December 21, 2023\nPeople use bullhorns as they protest following an announcement by Israel's military that they had mistakenly killed three Israeli hostages, in Tel Aviv, Israel, December 15, 2023\nAn Israeli flag covered in red paint as relatives and supporters of hostages held by Palestinian militants demonstrate outside the Israeli ministry of defence in Tel Aviv on December 15, 2023\nFor millennia, local factions have fought for self-determination and control of strategic and culturally significant parts of the southern Levant. Identities have been forged and forgotten in conflicts between the Mediterranean and the Jordan River.\nHamas capitalised on the perceived corruption and failure of past administrations to guarantee Palestinians freedom, security and autonomy. With or without them, Gazans will continue to seek independence and the right of return of friends and family displaced by massacres and settlements over decades of conflict.\nIsraelis were shocked that in spite of their country's world-leading security and intelligence outfits, the brutal massacre of civilians on October 7 was possible. A resurgence of anti-Semitic attacks in Europe and the United States has once more brought into focus the threats facing Jewish people worldwide in the 21st century. Interest groups on Israel's borders threaten to disturb the status quo as intense negotiations continue around the future of the region.\nPeace in the southern Levant faces many obstacles. But as calls for a ceasefire grow louder on both sides, it is becoming clearer that sustaining the violence is untenable.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Peace in the Middle East faces many obstacles... but as calls for a more permanent Israel-Hamas ceasefire grow louder from all sides, it is clear that sustaining the violence is untenable, experts war", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12877813/Peace-Middle-East-faces-obstacles-calls-permanent-Israel-Hamas-ceasefire-grow-louder-sides-clear-sustaining-violence-untenable-experts-warn.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}