{"authors": ["Kenneth Roth"], "date_download": "2024-02-05 15:18:22", "date_modify": "None", "date_publish": "2024-01-13 16:35:10", "description": "In the Hague trial, both sides have largely avoided evidence contradicting their case. Yet South Africa’s arguments are strong", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F13%2Fsouth-africa-israel-genocide-the-hague.json", "image_url": "https://i.guim.co.uk/img/media/a155d13a0b2043c37ef993ad3f13a29a1481a10f/0_204_5197_3118/master/5197.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=e58586089997529ced55da4dfe8ee8cf", "language": "en", "localpath": null, "maintext": "Watching lawyers for South Africa and Israel debate whether Israel is committing genocide in Gaza was like observing two versions of reality that barely intersect.\nEach set of counsel, appearing before the international court of justice at The Hague, largely avoided the most powerful evidence contradicting their case, and the absence of a factual hearing or any questioning left it unclear how the judges will resolve the dispute. Yet I would wager that South Africa’s case was strong enough that the court will impose some provisional measures on Israel in the hope of mitigating the enormous civilian harm caused by Israel’s approach to fighting Hamas.\nGenocide, as defined in a widely ratified treaty, has essentially two elements. First, an offender must commit certain acts against a targeted group such as “killing” or “deliberately inflicting … conditions of life calculated to bring about its physical destruction in whole or part”. Second, these acts must be committed with genocidal intent, meaning an “intent to destroy, in whole or in part, a national, ethnical, racial or religious group, as such”. Both parts of the crime were deeply contested by the lawyers in The Hague.\nThe South African legal team described the horrible conditions in Gaza under Israeli bombardment, including more than 23,000 dead, 1% of the population, with an estimated 70% women and children. Another 7,000 may be buried in the rubble. Some 85% of the population – 1.9 million people – have been displaced. About 65,000 residential units have been destroyed or rendered uninhabitable, and another 290,000 have been damaged, leaving half a million people with no home to return to. At a time of enormous medical need, two thirds of Gaza’s hospitals have been closed.\nIsrael’s response has been part spin, part serious. Its repeated invocation of Hamas’s horrible 7 October attack and alleged genocidal aspirations are irrelevant because atrocities by one side do not justify genocide by another. Its argument of self-defense is beside the point because a legitimate defense does not allow genocide.\nBut Israel’s lawyers also pursued more weighty arguments, blaming Hamas’s practice of embedding itself within the civilian population for the damage. Hamas does display a callous indifference to civilian life, but often so does Israel. Even when an enemy is using human shields, an attacker must refrain from firing if the anticipated civilian harm will be disproportionate to the expected military advantage. Israeli forces have regularly violated this rule.\nIsrael’s lawyers noted that Hamas built tunnels under and fired from civilian structures but never addressed a point made repeatedly by South Africa – that in response Israel dropped enormous 2,000lb bombs in heavily populated areas despite their predictably devastating consequences. Nor did Israel address reports that nearly half of its bombs dropped on Gaza have been non-precision “dumb” bombs, which have contributed to what President Biden called “indiscriminate bombing” – also a war crime.\nIsrael’s lawyers blamed Hamas for using hospitals for military purposes, but never provided definitive proof backing US and Israeli intelligence claims that a “command center” was kept under Gaza’s main al-Shifa hospital or explained why the handful of rifles and single tunnel actually found there justified shutting down this essential healthcare institution at a moment of profound need.\nThe argument over genocidal intent also had a similar split-screen quality. South Africa cited well-known statements by senior officials: The reference by the defense minister, Yoav Gallant,’ to fighting “human animals”, not, as he now claims, talking about only Hamas, but in discussing the siege, which affects everyone in Gaza; President Isaac Herzog’s statement that “this rhetoric about civilians not aware, not involved” is false because civilians “could have risen up” against Hamas, despite it being a brutal military dictatorship; and the twice invocation by the prime minister, Benjamin Netanyahu, of Amalek, of a biblical injunction to slay every “man and woman, infant and suckling”.\nThe Israeli lawyers argued that these were “random” statements, not formal government orders, but they were made by Israel’s most senior officials. South Africa’s lawyers also showed a chilling video of a large group of Israeli soldiers invoking Amalek as they danced and sang that there are “no uninvolved civilians”. That suggests a genocidal message was getting through.\nThe South African lawyers also showed soldiers rejoicing at the destruction of a village as huge plumes of smoke rose from it – hardly the care for civilian lives that Israel’s lawyers described. And it didn’t help that the Israeli foreign ministry accused South Africa, which is defending Palestinian civilians, of “functioning as the legal arm of Hamas”, as if civilians were Hamas.\nArguing against genocidal intent, the Israeli lawyers repeatedly highlighted the warnings given to civilians to evacuate. South Africa’s lawyers noted that Israeli forces continued to bomb in the supposedly “safe” areas where civilians were sent, but the Israeli forces blamed Hamas for fighting from there. They didn’t answer the South African claim, as verified by the New York Times, that Israeli forces had dropped 2,000lb bombs some 200 times in those areas.\nThere was a similar disjunction of views about humanitarian conditions. The Israeli lawyers highlighted Israeli efforts to provide humanitarian aid, but other than blaming Hamas for sometimes stealing aid, they didn’t grapple with the substantial bureaucratic and military obstacles that Israel has erected to delivery of aid, resulting in far too little getting through. Today, about 80% of people in Gaza are at “high risk” of starvation and death.\nHow to square the circle? Israel, understandably, thinks of genocide in terms of the Holocaust, but the “final solution” is not the only version. Genocide can be a means, not only an end. When the ICJ issued provisional measures against Myanmar, the most analogous case, the Myanmar army did not aim to kill every Rohingya but only enough – numbers comparable to the toll in Gaza – to send 730,000 fleeing to Bangladesh.\nAlthough on the eve of the court hearings Netanyahu disavowed a desire to drive Palestinian civilians from Gaza, his senior ministers have been openly advocating “voluntary” emigration. One way to understand the devastation and deprivation in Gaza is as an effort to seize the opportunity provided by Hamas to erase some 2 million Palestinians from the demographic balance sheet within the “one-state reality” that, because of settlement expansion, Israel and Palestine have become.\nIsrael’s lawyers noted that it would be unfair for the ICJ to order Israel to stop fighting in Gaza, as South Africa seems to be asking, while Hamas, which is not a party to the state-to-state proceedings, would be under no such order. The lawyers also objected to being ordered to “desist” from committing acts of genocide because that would suggest prejudgment of the ultimate merits of the case. To secure provisional measures at this early stage of the proceedings, South Africa needs show only that it is probable that genocide is under way.\nAgain, the court could split the difference by ordering Israel to refrain from certain seemingly genocidal actions, such as using enormous bombs in populated areas, limiting humanitarian aid and obstructing hospitals. That still leaves Hamas’s conduct unaddressed, but the body that could speak to Hamas is the international criminal court (ICC), whose prosecutor the Israeli government has banned from Gaza because it could prosecute Israeli officials as well.\nThe ICJ has no capacity to mandate compliance other than by act of the UN security council, which the US government could veto. But the Israeli government, having accepted the court’s legitimacy by arguing the case, will be hard pressed to ignore an adverse ruling. Moreover, a finding of probable genocide would be deeply stigmatizing for a country that was created as a refuge from genocide, adding considerable pressure on Netanyahu to stop, and making it far more difficult for Biden to continue his unconditional provision of arms and military aid. That could make an enormous difference in saving Palestinian civilian lives.", "source_domain": "www.theguardian.com", "text": null, "title": "South Africa’s genocide case against Israel is imperfect but persuasive. It may win", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/13/south-africa-israel-genocide-the-hague"}