{"authors": ["Jeremiah Hassel", "Image", "Getty Images Istockphoto", "Afp Getty Images"], "date_download": "2024-02-05 15:18:23", "date_modify": "None", "date_publish": "2024-01-13 19:58:58", "description": "Two Navy SEALs are missing after falling into the waters of the Gulf of Aden during a boarding mission in the middle of the night on Thursday. Details remain unclear regaridng what happened", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-two-navy-seals-missing-31876085.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31876108.ece/ALTERNATES/s1200/0_GettyImages-531472475.jpg", "language": "en", "localpath": null, "maintext": "Two Navy SEALs are missing after falling into the waters of the Gulf of Aden during a boarding mission in the middle of the night on Thursday. Details remain unclear regaridng what happened\nTwo US Navy SEALs are missing off the coast of Somalia after they fell into the water during a nighttime boarding mission, it has been revealed.\nUS officials stated that the men disappeared during a mission off the coast of the African country on Thursday as details regarding their whereabouts remain hazy.\nThe mission was apparently due to take place in the middle of the night, but to accomplish what remains unclear as well. The officials said that the seals fell into the water in sequence during the boarding of the unidentified vessel, which was in the Gulf of Aden.\nREAD MORE: EXCLUSIVE: Mum’s anguish over desperately ill daughter after family fled war-torn home\nImage: Getty Images/iStockphoto) Getty Images/iStockphoto)\nThe search is underway for the vessels, according to other Department of Defense personnel. One of the SEALs apparently got knocked off the vessel by a high wave, and the next seal jumped into the action after them.\nThe good news — the waters of the Gulf of Aden are warm, according to officials, so the chances of them surviving are higher. But as it has already been several days since their disappearance, the prospects are looking grim.\nIt's not abnormal for the Navy to conduct frequent interdiction missions, which involve the interception of weapons on ships bound for war-torn areas that the US has a vested interest in.\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US .\nImage: Getty Images/iStockphoto) Getty Images/iStockphoto)\nAt the moment, that means Yemen, which is located just across the sea from Somalia. It remains unclear, however, what the connection is between the war in Yemen, which the US has found itself immersed in as it launches airstrikes against Houthi forces.\nIt was revealed that the mission is not, in fact, related to Operation Prosperity Guardian, which is the ongoing international mission by the US to protect commercial vessels in the Red Sea. It was also reportedly not a part of the retaliatory strikes the US and the UK have both launched against Yemen and its Iran-backed Houthi forces in recent days.\nImage: AFP/Getty Images) AFP/Getty Images)\nAnd it was also not related to the seizure of St. Nikolas, an oil tanker that was captured by Iran recently, another official said. All the officials spoke to the Associated Press under the condition of anonymity.\nThe first of the aforementioned operations, Operation Prosperity Guardian, partly relates to the US's mission to address the increased level of piracy in the region, which has targeted commercial ships.\nCENTCOM said in a statement that no further information about the missing SEALs would be revealed \"out of respect for the families affected\" until the personal search and rescue mission is complete. They had been a part of the 5th Fleet's area of operations and involved in a number of missions.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Two US Navy SEALS missing off coast of Somalia during boarding mission", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/breaking-two-navy-seals-missing-31876085"}