{"authors": [], "date_download": "2024-02-05 15:18:24", "date_modify": "None", "date_publish": "2024-01-23 18:00:13", "description": "Attack comes 10 days after first US-UK retaliatory airstrikes against Iran-backed rebels in Yemen", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fyemen-airstrikes-houthi-attacks-rebels-latest-b2478055.html.json", "image_url": "https://static.independent.co.uk/2024/01/22/22/EEUU-YEMEN_91621.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "✕ Close Biden and Sunak spoke about Red Sea attacks, Gaza on phone call, according to White House\nFor free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nHouthi rebels have vowed that the latest round of US and UK strikes against them in Yemen will no go unanswered - as their allies Hamas killed nearly two dozen Israeli soldiers in Gaza.\nThe US launched their eighth attack on Houthi positions in western Yemen overnight, firing up to 30 munitions. UK defence secretary Grant Shapps said four Royal Air Force (RAF) Typhoons were involved in the strikes.\nMohammad Ali al-Houthi, head of the Houthi’s supreme revolutionary committee wrote on X, after the joint strikes by the US and the UK: “Trust well that every operation and every aggression against our country will not be without a response”.\nIt comes as 21 soldiers have been killed in the Gaza Strip in the deadliest attack on Israel’s forces since the 7 October Hamas raid that triggered the war, the military has said.\nIsraeli prime minister Benjamin Netanyahu mourned the soldiers but vowed to press ahead with the offensive until \"absolute victory\" over Hamas was achieved.\nThe soldiers were killed after a militant fired a rocket-propelled grenade at a tank stationed next to two buildings being prepared for demolition. The area was packed with explosives.", "source_domain": "www.independent.co.uk", "text": null, "title": "IDF says 21 troops killed as Houthis threaten response to US-UK Yemen strikes - live", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/yemen-airstrikes-houthi-attacks-rebels-latest-b2478055.html"}