{"authors": ["Léonie Chao-Fong", "Richard Luscombe", "Lili Bayer", "Amy Sedghi", "Reged Ahmad"], "date_download": "2024-02-05 15:18:26", "date_modify": "None", "date_publish": "2024-01-13 00:42:11", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F12%2Fmiddle-east-crisis-live-updates-yemen-houthi-rebels-joe-biden-us-uk-airtstrikes-red-sea-crisis-israel-gaza-war.json", "image_url": "https://i.guim.co.uk/img/media/927513618d12a1d1245ae52b9b072e6a368d0a85/0_233_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=110aed684d2e78f9d3d04d01f6c45a0a", "language": "en", "localpath": null, "maintext": "From 12 Jan 2024 23.12 CET Patients will die within hours, warn doctors after key Gaza hospital loses power Doctors at al-Aqsa hospital in central Gaza have warned patients will die soon after power was cut off on Friday after it ran out of fuel for its main generator. The power cut came soon after the hospital in Deir al-Balah warned that its fuel supply was about to run out. The facility, which serves as the main hospital in central Gaza, said the UN had said a fuel delivery was expected but it had not arrived by Friday night. The hospital went black after nightfall, with staff keeping ventilators and incubators operating using batteries charged by solar power during the day, AP reported. One doctor, Taiseer Abu Sweirih, told the news agency: In two hours at most, if the electricity doesn’t come back, and the oxygen, these patients you see here will die.\n12 Jan 2024 00.47 CET Dan Sabbagh Experts have warned that Thursday’s late-night bombing by the US and UK would be unlikely to deter the Houthis from attempting some form of retaliation, in turn risking further airstrikes against one of the world’s poorest countries. Fabian Hinz, a Middle East expert at the International Institute for Strategic Studies, said the scale of the US strikes was “clearly not symbolic” but that: If you look at the drones and missiles that the Houthis have been using against international shipping, they are mobile and compact and the Houthis are experts at hiding them. Before the bombing the Houthi leader, Abdul-Malik al-Houthi, said: “Any American attack will not remain without a response.” Hinz said: They are talking like they are in a war with the US and they will not want to walk away from that.\n12 Jan 2024 00.34 CET The US ambassador to the UN, Linda Thomas-Greenfield, has defended the UK and US decision to launch strikes against Houthi targets in Yemen. The strikes launched overnight were “to disrupt and degrade the Houthis’ ability to continue the reckless attacks against vessels and commercial shipping,” Thomas-Greenfield told the UN security council in New York today. She said that the strikes were necessary and appropriate noting that “they were consistent with international law and in exercise of the US’ inherent right to self-defence, as reflected by Article 51 of the UN Charter.” She said: Yesterday’s strike was the latest in a series of actions taken in self-defence, taken by the US alongside other countries and one that occurred against a broad diplomatic backdrop of global condemnation. More than 2,000 ships have been forced to divert from the Red Sea since November in the face of Houthi, threats, she said, adding: So long as any one of our ships is vulnerable, all of our ships are vulnerable. Thomas-Greenfield emphasised that the US does not want more conflict in the region, and that the aim was “simple – to deescalate tensions and restore stability in the Red Sea, while upholding the fundamental principles of freedom of navigation.”\n12 Jan 2024 00.28 CET Emma Graham-Harrison In Israel, despite Houthi threats of retaliation against Israeli targets, there was little immediate response to possible escalation in Yemen. Fighting in Gaza and against Hezbollah in the north pose more urgent threats to Israel, and the attack came on the eve of the Jewish day of rest, as the country was focused on the legal battle over genocide charges at the International Court of Justice. The strikes were welcomed as a show of solidarity by the military correspondent of Yedioy Aharonot newspaper. Ron Ben Yshai wrote: The attack in Yemen makes it clear that the US, Britain and the entire West stand firmly by its side and are even willing to risk expanding the fighting to other regions in the Middle East, which they have not done so far. But he argued that despite the Houthi focus on Israel’s war in Gaza, the attack was more about US geopolitical rivalry with Tehran, and the threat to global shipping. Israel is not the main story here, but rather the warning signal: the patience of the US is running out, and therefore Tehran too, and not just the Houthis, may bear the consequences. The Israeli military did not respond to questions about whether they were making additional preparations to protect the country from possible Houthi attacks.\n12 Jan 2024 00.09 CET Netanyahu warned of imminent eruption of violence in West Bank - report Israel’s internal security agency, Shin Bet, has warned Benjamin Netanyahu to act in order to prevent an imminent eruption of violence in the occupied West Bank, according to a report. The agency has submitted a document urgently warning the Israeli prime minister that the West Bank is on the brink of major unrest, the Times of Israel said Channel 13 reported. Similar warnings have been issued by the Israel Defense Forces (IDF) chief of staff, Lt Gen Herzi Halevi, and other senior military commanders, according to Channel 12. Netanyahu, along with other members of his war cabinet including defence minister, Yoav Gallant, and Benny Gantz, have been warned that Israel risked a new front in the West Bank amid the war against Hamas in the Gaza Strip and ongoing clashes on the northern border with the Lebanese militant group Hezbollah, it said. According to the Times of Israel, the heightened concern comes amid Israel’s withholding of hundreds of millions in tax revenues that belong to the Palestinian Authority (PA), in addition to refusing to allow about 150,000 Palestinian workers to return to their jobs in Israel and the settlements. As a result of these Israeli policies, the PA has been unable to properly pay its employees, including members of its security services, for months. The Shin Bet document warns that this could lead to PA troops turning their weapons on Israeli forces, the report says.\nUpdated at 00.22 CET\n12 Jan 2024 23.43 CET The CIA has uncovered information on senior Hamas leaders and the location of hostages in Gaza, and shared that intelligence with Israel as it carries out its war in the territory, according to a report. The creation of the CIA task force came in the days after the Hamas attacks on Israel on 7 October, with the priority of collecting intelligence on Hamas’ leadership, the New York Times reported, citing US officials. The US is not providing Israel with intelligence on low or mid-level Hamas operatives, according to the report. According to the report, US official believe that Yahya Sinwar, the suspected architect of the 7 October Hamas attacks, is hiding “in the deepest part of the tunnel network” under Khan Younis in southern Gaza. Sinwar is also believed to be surrounded by hostages and using them as human shields, “vastly complicating a military operation to capture or kill him”, the report says.\n12 Jan 2024 23.12 CET Patients will die within hours, warn doctors after key Gaza hospital loses power Doctors at al-Aqsa hospital in central Gaza have warned patients will die soon after power was cut off on Friday after it ran out of fuel for its main generator. The power cut came soon after the hospital in Deir al-Balah warned that its fuel supply was about to run out. The facility, which serves as the main hospital in central Gaza, said the UN had said a fuel delivery was expected but it had not arrived by Friday night. The hospital went black after nightfall, with staff keeping ventilators and incubators operating using batteries charged by solar power during the day, AP reported. One doctor, Taiseer Abu Sweirih, told the news agency: In two hours at most, if the electricity doesn’t come back, and the oxygen, these patients you see here will die.\n12 Jan 2024 22.55 CET Rishi Sunak has said the UK acted in “self-defence” with military strikes in Yemen intended to “de-escalate tensions and restore stability to the region”, as he faced calls for greater parliamentary scrutiny. Speaking from Ukraine, Sunak said that in the face of this aggression “we will always stand up for the rule of law” after a series of attacks by Houthi rebels on shipping in the Red Sea. However, the Lib Dems, SNP and the former Labour leader, Jeremy Corbyn, have urged the prime minister to recall parliament to seek approval for the military assault, while warning about the risk of escalation in the Middle East. Labour has called for the legal advice in relation to the strikes to be published. View image in fullscreen Rishi Sunak addressed the US-UK strikes on Yemen during a joint press conference with Volodymyr Zelenskiy in Ukraine. Photograph: Global Images Ukraine/Getty Images The prime minister has said he will make a statement to MPs on Monday about “limited and necessary” military strikes in Yemen. Grant Shapps, the defence secretary, briefed MPs on a call on Friday but did not take any questions. One leading Conservative, David Davis, said it appeared to be “reasonable” self-defence but that if the UK government intends to widen and intensify the military action in an aggressive way, then the prime minister should seek parliamentary approval with a vote of MPs. The military action has been backed across the Conservatives and the Labour frontbench, with Keir Starmer saying his party is “fully supportive” of the action.\n12 Jan 2024 22.33 CET UN chief urges Houthis to immediately cease attacks on shipping in Red Sea The UN’s secretary general, António Guterres, has urged countries to avoid an escalation in the Red Sea, a day after the US and UK launched strikes across multiple parts of Yemen in response to Houthi attacks against commercial shipping. In a statement by his spokesperson, Stéphane Dujarric, the UN chief warned that the Houthis must “immediately cease all such attacks” on international shipping in the Red Sea. These attacks are “not acceptable as they endanger the safety and security of global supply chains and have a negative impact on the economic and humanitarian situation worldwide,” he said. He said countries defending their ships from Houthi attacks must do so in accordance with international law and not escalate the situation. The statement continued: The Secretary-General stresses the need to avoid acts that could further worsen the situation in Yemen itself. He calls for every effort to be made to ensure that Yemen pursues a path towards peace and that the work undertaken thus far to end the conflict in Yemen should not be lost.\nUpdated at 22.40 CET\n12 Jan 2024 22.15 CET Israeli forces killed three Palestinian men who attacked a Jewish settlement in the occupied West Bank on Friday, the Israel Defense Forces (IDF) said. An IDF statement said its soldiers had come under fire while patrolling the Adora settlement, some 20 km (12 miles) west of Hebron city in the southern West Bank. The soldiers searched the area and “three assailants were identified and neutralised by the security forces”, the statement said. A 34-year-old Palestinian man involved in the attack was injured after being shot in the leg, Israeli emergency medical services said. In a separate incident in the Israeli-occupied West Bank, a man was killed after being severely beaten by Israel forces in Zeita, north of the city of Tulkarm, the Palestinian health ministry said.\n12 Jan 2024 21.54 CET Biden warns Houthis against 'outrageous behaviour' Here’s more from Joe Biden, who spoke to reporters briefly before an event Friday afternoon in Emmaus, Pennsylvania. Asked if the US will continue strikes against the Houthis, Biden replied: We will make sure that we respond to the Houthis as they continue this outrageous behaviour. Reporter: “The bombing of the Houthis — if the attacks don't stop, will you continue with the strikes?”\nPresident Biden: “We will make sure that we respond to the Houthis as they continue this outrageous behavior, along with our allies.” pic.twitter.com/xJoXA6fcdL — The Recount (@therecount) January 12, 2024\nUpdated at 23.06 CET\n12 Jan 2024 21.37 CET Biden defends airstrikes in letter to Congress The White House has published a letter from Joe Biden to House speaker Mike Johnson and Senate president pro tempore Patty Murray explaining why he did not seek congressional approval prior to authorizing Thursday night’s airstrikes on Houthi targets in Yemen. The US president is facing bipartisan condemnation for not asking lawmakers first, but in the letter says he didn’t need to because it was act of self-defense. The letter fulfils the requirement that he inform Congress of his actions within 48 hours: I directed this military action consistent with my responsibility to protect US citizens both at home and abroad and in furtherance of US national security and foreign policy interests, pursuant to my constitutional authority as commander in chief and chief executive and to conduct US foreign relations. The US took this necessary and proportionate action consistent with international law and in the exercise of the US’ inherent right of self-defense as reflected in Article 51 of the United Nations Charter. The US stands ready to take further action, as necessary and appropriate, to address further threats or attacks. I am providing this report as part of my efforts to keep the Congress fully informed, consistent with the War Powers Resolution (Public Law 93-148). I appreciate the support of the Congress in this action. You can read the full letter on the White House website here. Further reading: ‘Unacceptable’: Biden denounced for bypassing Congress over Yemen strikes Read more\nUpdated at 22.39 CET\n12 Jan 2024 21.20 CET Biden says Yemen airstrikes 'a success' Joe Biden, in his first public comments on the US-UK airstrikes, said they were “a success”. The US president spoke very briefly before an event Friday afternoon in Emmaus, Pennsylvania, to promote his economic policies. “We will make sure that we will respond to the Houthis if they continue this outrageous behavior, along with our allies,” he said. Asked by a reporter if he thought the strikes had been a success, Biden said: “Yes. Very. I don’t think there’s any civilian casualties. That’s another reason why it’s a success”. The president then offered reporters coffee, and said he would speak further about the military action following the campaign event.\nUpdated at 21.28 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza doctors warn patients will die within hours after key hospital loses power - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/12/middle-east-crisis-live-updates-yemen-houthi-rebels-joe-biden-us-uk-airtstrikes-red-sea-crisis-israel-gaza-war"}