{"authors": [], "date_download": "2024-02-05 15:18:28", "date_modify": "None", "date_publish": "2024-01-13 16:43:55", "description": "France’s new Foreign Minister Stéphane Séjourné arrived in the Ukrainian capital of Kyiv to meet with his counterpart in a sign of support for Ukraine as Russia’s full-scale invasion nears its second anniversary", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-russia-french-b2478197.html.json", "image_url": "https://static.independent.co.uk/2024/01/13/16/Russia_Ukraine_War_France_99725.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFrance’s new foreign minister arrived in the Ukrainian capital of Kyiv on Saturday to meet with his counterpart in a sign of support for Ukraine as Russia’s full-scale invasion nears its second anniversary.\nStéphane Séjourné noted that Ukraine was his first destination abroad since his appointment in a government reshuffle this week.\n“Ukraine is and will remain France’s priority,” he said. “The defense of the fundamental principles of international law is being played out in Ukraine.”\nSéjourné, in a joint news conference alongside Ukraine's Foreign Minister Dmytro Kuleba, reiterated his government's pledges of support for Ukraine “as long as necessary” but did not announce new weapon deliveries.\n“Russia is hoping that Ukraine and its supporters will tire before it does. We will not weaken. That is the message that I am carrying here to the Ukrainians. Our determination is intact,” Séjourné said.\nThe ministers took no questions.\nFrance has been switching away from its initial post-invasion policy of providing complete weapons systems to Ukraine from its own stocks. It is increasingly pursuing what the government describes as a more sustainable effort to help defense manufacturers — both at home and in Ukraine — ramp up production so they can supply the embattled country's long-term armament needs.\nSéjourné said that a French defense fund to enable Ukraine to buy armaments also got fresh funding in recent weeks but he did not specify the amount.\nFrance is also working to overcome objections from Hungary to supply EU financial aid to Ukraine, needed to fund essential public services and reconstruction. Séjourné said France would use “all of its weight” to try to unblock the EU aid package at an upcoming summit in early February.\nKuleba thanked Séjourné for not being deterred from visiting by “another massive Russian strike.”\nHe also highlighted that many Western-made components were found in Russian missiles used to attack Ukraine.\n“According to a recent report by the Kyiv School of Economics and Yermak McFaul’s group, 44% of all electronic components in Russia’s weapons are developed by Western companies,” he said, calling on the Group of Seven and the European Union to “take decisive measures to block the supply of goods containing these components to Russia.”\nSéjourné ’s visit came a day after British Prime Minister Rishi Sunak unveiled Friday new military funding for Ukraine, announcing a security pact with Kyiv and 2.5 billion pounds (about $3.2 billion) for its war effort over the next fiscal year.\nAlso on Saturday, the Ukrainian Air Force said its defense system downed eight of the 37 missiles fired by Russia. Three drones were also launched. The air force said via its Telegram channel that more than 20 of the total attacks were prevented from reaching their target “by means of electronic warfare.”\nBoth Ukraine and Russia make use of electronic warfare technology aimed at jamming and diverting enemy drones and guided missiles.\nAlso, in Ukraine’s northeastern Sumy region, a resident was wounded as a result of a morning rocket attack, the regional prosecutor’s office said.\nIn Russia, a local resident received shrapnel wounds when Ukrainian forces attacked a village in the Belgorod region bordering Ukraine, according to regional Gov. Vyacheslav Gladkov.\n___\nAssociated Press writer John Leicester in Paris and Elise Morton in London contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "French foreign minister visits Kyiv and pledges solidarity as Russia launches attacks", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-russia-french-b2478197.html"}