{"authors": ["Bethan Sexton", "Bethan Sexton For Dailymail.Com", "Jon Brady"], "date_download": "2024-02-05 15:18:28", "date_modify": "None", "date_publish": "2024-01-13 01:40:56", "description": "The US unleashed more bombs on Yemen as part of airstrikes against Houthi targets on Friday night. Hours later protesters swarmed near the United Nations in New York to condemn the attack.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12958497%2FUS-conducts-Yemeni-strikes-Houthi.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/13/01/79919439-0-An_Royal_Air_Force_Typhoon_aircraft_takes_off_to_join_the_US_led-a-34_1705109840837.jpg", "language": "en", "localpath": null, "maintext": "The US has unleashed a new wave of strikes against Houthi targets in Yemen.\nThe blitz on Friday came a day after initial strikes against over 60 targets used by the Iranian-backed rebels to attack ships in waters near the Arabian Peninsula.\nThe second round of bombing was much smaller in scale and targeted a Houthi radar facility, an official confirmed. It came after the Houthis fired at least one anti-ship missile earlier the same day.\nBiden had vowed to continue the bombardment if the Houthis refused to cease attacking vessels in the Red Sea.\nBut in New York City protests erupted after demonstrators swarmed First Avenue near the United Nations Yemen Mission to condemn the attack.\nThe US deployed a new round of strikes against Houthi targets in Yemen on Friday, targeting a radar facility\nShortly after protesters descended on the United Nations Yemen Mission in New York to condemn the strike\nThe raid on the radar facility came after the Houthis launched an anti-ship ballistic missile in retaliation for the overnight strikes by US and British forces on Thursday\nThe latest round of strikes were smaller in scale than the initial wave seen on Thursday. Protesters gathered to demand an end to all strikes.\nThe official confirmed the latest strikes were conducted unilaterally by the US.\nHowever, the Houthi-run al-Masirah TV station claimed that the US and the UK had been involved in the strikes on the Yemeni capital of Sanaa.\nUK Ministry of Defence sources said any suggestions of UK involvement in the second round of strikes against the Houthis were inaccurate. A formal statement confirming the UK's non-involvement is expected later today.\nA source said: 'There was no UK participation in these strikes – it was a unilateral action carried out by the US.'\nBut Thursday's blitz, a response to attacks on cargo ships by Houthis in the Red Sea, was a cooperative effort between the US, UK and other allied nations.\nThe assault struck more than 60 targets, killing five people and wounding six more, a spokesman for the Houthi military told CNN.\nBut US officials determined the additional location, a radar site, still presented a threat to maritime traffic, one official said.\nPresident Joe Biden said on Friday that the American airstrikes against the Houthi in Yemen were a success, adding that he's delivered a message to Iran with them.\n'I don't think there's any civilian casualties — that's another reason why it's a success,' Biden told reporters traveling with him in Pennsylvania.\nThe White House has said the airstrikes in Yemen, most of which is controlled by the Houthis, were in retaliation for months of attacks by the movement on Red Sea shipping that the rebels cat as a response to the ongoing war in Gaza.\nHowever their targets have become increasingly random and caused disruption to global shipping channels.\nWhen asked if he has a message for Iran, Biden said: 'I've already delivered the message to Iran.'\nThe president also noted Tehran 'doesn't want a war with us,' but said he is willing to bomb the Houthi again if they keep striking at American troops.\nBiden had warned of further bombardment if the Houthis did not stop attacking vessels in the Red Sea. Pictured: A northern facility along the coast in Yemen on January 12, 2024 after airstrikes by the United States and Britain\n'We will make sure we respond to the Houthis if they continue this outrageous behavior,' he said.\nJoint forces from the U.S. and United Kingdom launched more than 150 munitions from both maritime and air platforms against more than 16 locations controlled by the Iranian-backed militants on Thursday.\nThe Pentagon has since confirmed that the strikes hit nearly 30 targets – a higher figure than previously announced, Reuters said.\nIn his first public comments on the airstrikes, Joe Biden last night said they were ‘a success’.\nAsked by a reporter if he thought the strikes had been a success, Mr Biden said: ‘Yes. Very. I don’t think there’s any civilian casualties. That’s another reason why it’s a success.’\nArmy Lt. Gen. Douglas A. Sims II, director of operations for the Joint Staff, said: 'At this point, we continue to conduct battle damage assessment of the various targets. We feel very confident about where our munitions struck.'\nThe deliberate strikes, which were carried out with nonoperational support from Australia, Bahrain, Canada and the Netherlands, were assessed to have hit multiple targets across each location.\nThose targets included command and control nodes, munitions depots, launching systems, production facilities and air defense radar systems used by the Houthi's to carry out attacks against vessels operating in international waters.\n'We know precisely the capability that the Houthis have been employing against the Red Sea and the Bab al Mandab,' Sims said.\n'This was solely designed to get after the capability that is impeding international freedom of navigation in international waters. We feel pretty confident we did good work on that.'\nBiden was also criticized by members of his own party for failing to talk to Congress prior to executing the strikes\nThe large scale strikes on Thursday came after the Houthis carried out their 27th attack on a vessel since November 19, by firing an anti-ship missile into the Gulf of Aden.\nIn response the Houthis vowed to make the US and its allies 'pay absolutely and without hesitation'.\nPresident Biden also faced criticism at home for failing to appear before Congress prior to executing the strikes.\nAnti-war protests also cropped up including at Times Square in New York , where demonstrators called on the White House to end the bombing amid fears it could escalate into all out war.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US launches new wave of strikes on Iran-backed Houthi rebels in Yemen to destroy radar facility as protestors swarm Yemen Mission in NYC to condemn the attack", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12958497/US-conducts-Yemeni-strikes-Houthi.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}