{"authors": ["Bethan Sexton", "Bethan Sexton For Dailymail.Com"], "date_download": "2024-02-05 15:18:30", "date_modify": "None", "date_publish": "2024-01-12 13:00:09", "description": "The backlash was sparked by an overnight operation from US the UK and allies to hit targets used by Iran-backed Houthi rebels to attack ships in the Red Sea.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12956083%2FBiden-faces-fury-left-launching-airstrikes-Houthi-targets-Yemen-without-going-Congress-Democrats-rage-unacceptable-violation-constitution.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/12/00/79918287-0-image-a-25_1705019955546.jpg", "language": "en", "localpath": null, "maintext": "US joined forces with UK, Australia, Bahrain, Canada and the Netherlands to carry out the blitz\nAirstrikes in Yemen against several Houthi military targets on Thursday night\nPresident Joe Biden is facing rage from the left for launching overnight airstrikes in Yemen without congressional approval.\nIt came as Turkey accused the US and UK of turning the Red Sea into a 'bloodbath' and there were growing fears of widespread escalating violence in the Middle East.\nDemocrats on Capitol Hill claim it was 'unconstitutional' for the president to order US fighter jets, destroyers and submarines to hit targets used by Iran-backed Houthi rebels.\nBiden was also lambasted by Donald Trump for 'dropping bombs all over the Middle East, AGAIN' instead of focusing on the migrant crisis at the US southern border.\nThe US used more than 100 precision missiles striking at around 2.30am local time on over 60 targets at 16 locations in the massive operation that led to powerful explosions lighting up the night sky in Yemen.\nUS and UK armed forces released clips of their fighter jets taking off ahead of their bombing runs.\nTurkey's President Recep Tayyip Erdogan furiously condemned the strikes in a statement this morning, accusing the US and UK of turning the Red Sea into a 'sea of blood'. Iran and Russia also accused the West of 'illegal' and escalatory actions.\nThe Houthi rebels, who have been attacking international shipping in the Red Sea, vowed to make the allies behind the attacks 'pay a heavy price' for the 'blatant aggression' they claim has killed at least five fighters.\nIn Yemen there were mass protests in support of the rebel group in cities across the country, with tens of thousands of people taking to the streets chanting slogans and toting placards.\nIn Washington Democratic progressives on Capitol Hill, including members of the left-wing group known as The Squad, responded with fury because Biden didn't seek congressional approval first for the strikes.\nThe US used more than 100 precision missiles striking at around 2.30am local time on over 60 targets at 16 locations, according to the air force. Explosions were reported in Sana'a, Hodeidah governorate, Saada, and Dhamar, Houthi officials confirmed. It's unclear the extent of the damage or any injuries. Fighter jets, Navy destroyers, a submarine and Tomahawk cruise missiles were all used in the blitz. Sites including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems were hit, according to officials. At least one submarine was deployed, the US would not confirm exactly which but Ohio-class guided-missile submarine USS Florida (SSGN-728) entered the Red Sea in November, USNI News reports. The vessel has capacity for 154 missiles. Super Hornets from USS Dwight D. Eisenhower (CVN-69) were also deployed, along with Air Force strike fighters originating from a base in the Middle East and according to the outlet\nAn Royal Air Force Typhoon aircraft takes off to join the US led coalition to conduct air strikes against military targets in Yemen. On Thursday evening, four Royal Air Force Typhoons launched from Royal Air Force Akrotiri to conduct strikes against military targets in Yemen\nDemocratic members of Congress Rep. Ro Khanna (left) and Rep. Cori Bush (right) were among the lawmakers tearing into Biden for launching the airstrikes without congressional approval\n'The President needs to come to Congress before launching a strike against the Houthis in Yemen and involving us in another middle east (sic) conflict,' California Democratic Rep. Ro Khanna said.\n'For over a month, he consulted an international coalition to plan them, but never came to Congress to seek authorization as required by Article I of the Constitution.'\nArticle 1 of the Constitution gives Congress the power to declare war.\nHowever, under the War Powers Act of 1973 the president is only required to inform Congress of military action within 48 hours.\nUnder that act, if Congress does not then declare war, the president must end the military action within 60 days, with another 30 days for withdrawal.\nThe White Houses and Congress have repeatedly argued over the parameters of the War Powers Act during military interventions overt the last 50 years.\nFollowing the Yemen strikes Cori Bush, a Missouri Democrat and member of the progressive Squad, called the strikes 'illegal' and told Biden, 81, to 'stop the bombing and do better by us'.\n'The people do not want more of our taxpayer dollars going to endless war and the killing of civilians,' she added.\nMichigan Democratic Rep. Rashida Tlaib also called the operation 'unconstitutional' and said Americans are 'tired of endless war'.\nShe has previously accused Biden of supporting 'genocide' in Gaza with his backing of Israel's military offensive in the aftermath of the October 7 Hamas terrorist attack.\nOregon Rep. Val Hoyle added: 'These airstrikes have NOT been authorized by Congress.\n'The Constitution is clear: Congress has the sole authority to authorize military involvement in overseas conflicts. Every president must first come to Congress and ask for military authorization, regardless of part.'\nHead of the Congressional Progressive Caucus Rep. Pramila Jayapal, a Democrat from Washington, said the strikes were an 'unacceptable violation of the Constitution'.\n'Article 1 requires that military action be authorized by Congress,' she added.\nMichigan Democratic Rep. Rashida Tlaib also called the operation 'unconstitutional' and said Americans are 'tired of endless war'\nRepublicans including Senate Minority Leader Mitch McConnell said that the strikes were long overdue and a hopeful sign the Biden administration would take a more aggressive approach to Iran and in its proxies.\nBut Donald Trump wrote on Truth Social: 'So, let me get this straight. We’re dropping bombs all over the Middle East, AGAIN (where I defeated ISIS!), and our Secretary of Defense, who just went missing for five days, is running the war from his laptop in a hospital room.\n'Remember, this is the same gang that \"surrendered” in Afghanistan, where no one was held accountable or FIRED. It was the most embarrassing “moment” in the history of the United States.\n'Now we have wars in Ukraine, Israel, and Yemen, but no “war” on our Southern Border. Oh, that makes a lot of sense. Crooked Joe Biden is the worst President in the history of the United States!'\nDefending the White House's decision not to seek congressional approval a senior administration official said senior leaders on Capitol Hill had been notified.\nThat included the 'gang of 8' group of senior figures in Congress.\n'Our military actions against the Houthis, as part of an international coalition, were fully consistent with international and domestic law,' the senior administration official said.\n'The Justice Department has set out a longstanding test for the President’s constitutional authority to direct the use of military force - there must be a significant national interest at stake, and the action must be below the threshold of “war” in the constitutional sense.'\n'The facts here easily meet that test given the attacks we had endured from the Houthis and the limited nature of the coalition strikes.'\nNATO declared the US-led strikes were aimed at protecting shipping through the Red Sea and urged Iran to 'rein in its proxies'.\n'These strikes were defensive, and designed to preserve freedom of navigation in one of the world's most vital waterways. The Houthi attacks must end,' Dylan White, a spokesman for the Western military alliance, said.\nThe attacks come in response to months of Houthi-led bombings on ships in the Red Sea - amid the conflict between Israel and Gaza.\nUS officials had warned there would be 'consequences' for the Houthi's attack on non-military ships in the Red Sea.\nExplosions were reported in Sana'a, Hodeidah governorate, Saada, and Dhamar, Houthi officials confirmed. It's unclear the extent of the damage or any injuries.\nSuper Hornets, Navy destroyers, and a submarine launched Tomahawk cruise missiles during the blitz.\nSites including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems were hit, according to officials.\nAt least one submarine was deployed, the US would not confirm exactly which one but Ohio-class guided-missile submarine USS Florida (SSGN-728) entered the Red Sea in November, USNI News reports. The vessel has capacity for 154 missiles.\nSuper Hornets from USS Dwight D. Eisenhower (CVN-69) were deployed, along with Air Force fighters originating from a base in the Middle East.\nThe US and UK, along with Australia, Bahrain, Canada and the Netherlands, joined together for the attack.\n'These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation in one of the world’s most critical commercial routes,' Biden said.\n'I will not hesitate to direct further measures to protect our people and the free flow of international commerce as necessary.'\nDefense Secretary Lloyd Austin also released a statement in the wake of the attacks. It was his first public comment since his health scandal saw him in the ICU of the hospital for prostate cancer treatment, without the White House knowing about his condition.\n'This action is intended to disrupt and degrade the Houthis' capabilities to endanger mariners and threaten global trade in one of the world's most critical waterways. Today's coalition action sends a clear message to the Houthis that they will bear further costs if they do not end their illegal attacks,' Austin said.\nUS and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in the Red Sea\nStrikes were carried out on over 60 targets at 16 Iranian-backed Houthi militant locations, including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems\nOver 100 precision-guided munitions of various types were used in the blitz, which also included maritime support\nPrior to the strike, terrorists in the region had warned of possible retaliation against US military targets if the bombing went ahead.\nShortly after the strike unverified reports of attacks on US bases in Iraq began to flood social media.\nThe bombardment came thirty minutes after the the U.S. military said the Houthis had had staged their 27th attack on shipping since November 19 earlier on Thursday, firing an anti-ship ballistic missile into international shipping lanes in the Gulf of Aden.\nThe US military strikes are the country's first on Yemen since 2016. President Biden said they had been ordered in response to 'unprecedented' attacks against maritime vessels.\n'More than 50 nations have been affected in 27 attacks on international commercial shipping. Crews from more than 20 countries have been threatened or taken hostage in acts of piracy,' Biden said.\n'More than 2,000 ships have been forced to divert thousands of miles to avoid the Red Sea—which can cause weeks of delays in product shipping times. And on January 9, Houthis launched their largest attack to date—directly targeting American ships.'\nHe then added: 'Last week, together with 13 allies and partners, we issued an unequivocal warning that Houthi rebels would bear the consequences if their attacks did not cease. And yesterday, the United Nations Security Council passed a resolution demanding the Houthis end attacks on merchant and commercial vessels.'\nBut he was criticized by those among his own party for failing to talk to Congress prior to ordering the attacks.\nThe bombardment came on Thursday night after the Houthi had blocked another shipping lane in the Gulf of Aden, the latest in a string of attacks against vessels in the area in recent months. Pictured: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in November\nSuper Hornets from USS Dwight D. Eisenhower (CVN-69) were deployed for use in the strikes, according to USNI News\nAt least one submarine, thought to be USS Florida (SSGN-728), was used in the attack. The vessel entered the Red Sea in November though its use has not been formally confirmed\nUK Prime Minister Rishi Sunak also spoke out in the wake of the attack describing them as 'self-defense.'\n'This cannot stand. The United Kingdom will always stand up for freedom of navigation and the free flow of trade,' Sunak said.\n'The Royal Navy continues to patrol the Red Sea as part of the multinational Operation Prosperity Guardian to deter further Houthi aggression, and we urge them to cease their attacks and take steps to de-escalate.'\nHouthi official Abdul Qader al-Mortada condemned latest allied strikes as 'American-Zionist-British aggression' in a post on X.\nVice President of the Houthi Media Authority Nasr Aldeen Amer also vowed that the Houthi would not retreat.\n'A brutal aggression against our country, for which they [the attackers] will pay absolutely and without hesitation, and we will not back down from our position in supporting the Palestinian people, whatever the cost,' he said.\nThe rebels say their assaults are aimed at stopping Israel's war on Hamas in the Gaza Strip. But their targets are increasingly random.\nThe Houthis, based in Yemen, have been firing rockets, drones and missiles north towards Israel, interrupting Red Sea shipping\nUS Air Force recon jets were spotted tracking over Saudia Arabia on Thursday night ahead of the strikes\nArmed demonstrators take part in a solidarity rally with Gaza in the rebel-held Yemeni capital Sanaa. Antony Blinken warned of 'consequences' if the rebels do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels\nThe Yemeni rebels are backed by Iran. They have stepped up attacks on international shipping since the Oct. 7 attack by Hamas on Israel in what they say is an act of solidarity with Palestinians.\nVarious shipping lines have suspended operations, instead taking the longer journey around Africa.\nSecretary of State Antony Blinken previously warned of 'consequences' if the Houthi do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels.\n'We've been clear with more than 20 other countries that if this continues as it did yesterday that there will be consequences,' he said on Wednesday.\nWhen asked if there would be consequences for Iran, he added: 'We've also repeatedly tried to make clear to Iran as other countries have as well that the support hat they are providing to the Houthis needs to stop.\n'It's not in their interests to see these conflicts escalated and we're not the only one who sent that message to Iran.\n'These attacks have been aided and abetted by Iran with technology equipment and intelligence and they are having a real life impact on people.'\nIt comes at a fraught time for the US - as Defense Secretary Lloyd Austin is reeling from his prostate cancer operation. He has been in hospital for over a week.\nAnd by Thursday, British stealth jets and combat drones were being readied for the airstrike with warships moved into the Red Sea in recent days.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden faces fury from the left for launching airstrikes on Houthi targets in Yemen without going to Congress: Democrats rage at the 'unacceptable violation of the constitution' as Turkey accuses US an", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12956083/Biden-faces-fury-left-launching-airstrikes-Houthi-targets-Yemen-without-going-Congress-Democrats-rage-unacceptable-violation-constitution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}