{"authors": [], "date_download": "2024-02-05 15:18:34", "date_modify": "None", "date_publish": "2024-01-12 06:46:13", "description": "When the U.S. and U.K. warships launched waves of air, ship and submarine launched missiles at Iranian-backed Houthi rebels in Yemen Thursday it was the culmination of weeks of warnings to the militant group to cease their destructive attacks on commercial vessels in the Red Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-houthis-red-sea-yemen-iraq-b2477420.html.json", "image_url": "https://static.independent.co.uk/2023/12/15/05/YE_A_Year_of_War_67054.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWhen U.S. and U.K. warships and aircraft launched waves of missiles at Iranian-backed Houthi rebels in Yemen early Friday in Sanaa, it capped weeks of warnings to the militant group to cease their drone and missile attacks against commercial vessels in the Red Sea or face severe consequences.\nPreviously the U.S. had withheld striking back, reflecting larger U.S. concerns about upending the shaky truce in Yemen and triggering a wider conflict in the region. But on Tuesday the Houthis launched their largest-ever barrage of 18 one-way attack drones, anti-ship cruise missiles and an anti-ship ballistic missile at a host of international ships and warships in the Red Sea.\nWhile the U.S. and partner military ships and aircraft protecting the waterways were able to deflect the attack, the scope and severity of the launch drew international condemnation and left few options other than to carry through with international warnings that any further attacks would draw a substantial response.\nIn response to the attacks Friday, which struck in Yemen just before 3 a.m. local time, the militant group has already pledged to retaliate.\nHere’s a look at the Houthis and their increasing attacks, and why the U.S. believes it is more acceptable to bomb some Iranian-linked targets than others.\nWHO ARE THE HOUTHIS?\nHouthi rebels swept down from their northern stronghold in Yemen and seized the capital, Sanaa, in 2014, launching a grinding war. A Saudi-led coalition intervened in 2015 to try to restore Yemen's exiled, internationally recognized government to power.\nYears of bloody, inconclusive fighting against the Saudi-led coalition settled into a stalemated proxy war between Saudi Arabia and Iran, causing widespread hunger and misery in Yemen, the Arab world’s poorest country. The war has killed more than 150,000 people, including fighters and civilians, and created one of the world’s worst humanitarian disasters, killing tens of thousands more.\nA cease-fire that technically ended more than a year ago is still largely being honored. Saudi Arabia and the rebels have done some prisoner swaps, and a Houthi delegation was invited to high-level peace talks in Riyadh in September as part of a wider détente the kingdom has reached with Iran. While they reported “positive results,” there is still no permanent peace.\nATTACKS ON SHIPS\nThe Houthis have sporadically targeted ships in the region over time, but the attacks have increased since the start of the war between Israel and Hamas and spiked after an explosion Oct. 17 at a hospital in Gaza killed and injured many. That hospital blast marked the beginning of an intense militant campaign against U.S. bases in Iraq and Syria, and on many commercial vessels transiting the Red Sea. The attacks have damaged commercial ships and forced international shipping companies to divert their vessels around the Cape of Good Hope.\nAs of Thursday the Houthis had launched 27 different attacks on vessels transiting the Southern Red Sea, Pentagon spokesman Maj. Gen. Pat Ryder said at a Pentagon press conference.\nHouthi military spokesman Brig. Gen. Yahya Saree has said the group wants to \"prevent Israeli ships from navigating the Red Sea (and Gulf of Aden) until the Israeli aggression against our steadfast brothers in the Gaza Strip stops.”\nBut few of the ships targeted have had direct links to Israel. In a recent attack, one of the commercial ships hit — the Unity Explorer — had a tenuous Israeli link. It is owned by a British firm that includes Dan David Ungar, who lives in Israel, as one of its officers. Israeli media identified Ungar as being the son of Israeli shipping billionaire Abraham “Rami” Ungar. But any Israel connections to other ships are unclear.\nU.S. officials have argued that the Houthis haven’t technically targeted U.S. military vessels or forces — a subtlety that Navy ship captains watching the incoming drones may question.\nIn response to the attacks, last month Defense Secretary Lloyd Austin announced Operation Prosperity Guardian, where the U.S. and more than 20 other countries have created a protective umbrella for the commercial vessels that have not rerouted.\nIf that operation had not been escorting the commercial vessels and intercepting the incoming fire, “we have no doubt that ships would have been struck, perhaps even sunk, including in one case a commercial ship full of jet fuel,\" a senior administration official told reporters late Thursday, speaking on the condition of anonymity to discuss the strikes. “We’ve had extremely close calls.\"\nTHE U.S. CALCULUS\nWhile the U.S. has carried out airstrikes on Iranian-backed militias in Iraq and Syria that have targeted American troops in 130 different attacks since Oct. 17, until Thursday the military had not yet retaliated against the Houthis.\nThat reluctance reflects political sensitivities and stems largely from broader Biden administration concerns about upending the shaky truce in Yemen and triggering a wider conflict in the region. The White House wants to preserve the truce and is wary of taking action that could open up another war front.\nIran-backed militias have launched one-way attack drones, rockets or close-range ballistic missiles at bases in Iraq 53 times and in Syria 77 times. Dozens of troops have suffered injuries as a result of the attacks, in many cases traumatic brain injuries.\nIn response, the U.S. has retaliated with airstrikes multiple times in Syria since Oct. 17, targeting weapons depots and other facilities linked directly to Iran's Revolutionary Guard Corps and the militias. And it struck multiple sites in Iraq late last month after a militia group for the first time fired short-range ballistic missiles at U.S. forces at Al-Asad air base.\nBut until Thursday, striking the Houthis had been a different calculus.\nIn one breath, Pentagon officials had said Navy ships shot down Houthi drones heading toward them because they were deemed “a threat.” But in the next breath officials said the U.S. had assessed that the ships were not the target. That determination often comes later after intelligence assessments review telemetry and other data.\nThat, however, is certainly no comfort to sailors on the ships who watch the radar track of incoming drones and must make rapid decisions about whether they represent threats to the ship.\nAt the same time, the U.S. has consistently said it wants to protect free navigation of the seas. But the Houthi actions have prompted the International Maritime Security Construct to issue a warning for ships transiting the Red Sea and Bab el-Mandeb. It says ships should choose routes as far from Yemeni waters as possible, travel at night and not stop, because that makes them an easier target.\nThe Biden administration has talked persistently about the need to avoid escalating the Israel-Hamas war into a broader regional conflict. So far, strikes on the Iranian-backed groups in Iraq and Syria have not broadened the conflict, said Ryder.\nIt's not clear if targeted strikes against Houthi weapons depots or similar sites — which also have Iranian support — would cross a line and trigger a wider war.\n“We will continue to consult with international allies and partners on an appropriate way to protect commercial shipping going through that region, and at the same time ensuring we do what we need to do to protect our forces,” said Ryder.\n___\nAssociated Press writer Jon Gambrell in Dubai, United Arab Emirates, contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "What is Operation Prosperity Guardian, the US-led mission to protect Red Sea shipping?", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-houthis-red-sea-yemen-iraq-b2477420.html"}