{"authors": [], "date_download": "2024-02-05 15:18:37", "date_modify": "None", "date_publish": "2024-01-12 02:31:06", "description": "US and UK forces struck more than a dozen sites used by the Iranian-backed Houthis in Yemen.", "filename": "https%3A%2F%2Fguernseypress.com%2Fnews%2Fworld-news%2F2024%2F01%2F12%2Fpresident-biden-says-strikes-show-us-will-not-tolerate-red-sea-attacks%2F.json", "image_url": "https://www.guernseypress.com/resizer/EY5STFmsojpzX_8NncIwl95Vemo=/1200x900/cloudfront-us-east-1.images.arcpublishing.com/mna/L32MN7ISAFEU5OFJG4RMQDZPGQ.jpg", "language": "en", "localpath": null, "maintext": "US President Joe Biden said military strikes on more than a dozen sites used by the Iranian-backed Houthis in Yemen were meant to demonstrate that the US and its allies “will not tolerate” the militant group’s ceaseless attacks on the Red Sea.\nHe said the US and its allies only made the move after attempts at diplomatic negotiations and careful deliberation.\n“These strikes are in direct response to unprecedented Houthi attacks against international maritime vessels in the Red Sea — including the use of anti-ship ballistic missiles for the first time in history,” Mr Biden said in a statement.\nThe retaliatory strike used warship-launched Tomahawk missiles and fighter jets, US officials said, with targets including logistical hubs, air defence systems and weapons storage locations.\nThe US Air Force’s Mideast command said it struck more than 60 targets at 16 sites in Yemen, including “command-and-control nodes, munitions depots, launching systems, production facilities and air defense radar systems”.\nReports of explosions were made from the capital Sanaa and the Red Sea port of Hodieda.\nBritish Prime Minister Rishi Sunak said the Royal Air Force carried out targeted strikes against military facilities used by the Houthis after the militants carried out a series of dangerous attacks on shipping.\nPrime Minister Rishi Sunak, left, and US President Joe Biden (AP)\nAustralia, Bahrain, Canada, Denmark, Germany, Netherlands, New Zealand and South Korea joined the US and UK in issuing a statement saying that while the aim is to de-escalate tensions and restore stability in the Red Sea, the allies will not hesitate to defend lives and protect commerce in the critical waterway.\nRussia requested an emergency meeting of the UN Security Council on the strikes. France, the current council president, said it will take place on Friday afternoon.\nSaudi Arabia’s Foreign Ministry expressed “great concern” over the airstrikes, saying in a statement: “While the kingdom stresses the importance of preserving the security and stability of the Red Sea region… it calls for restraint and avoiding escalation.”\nThe coordinated military assault comes just a week after the White House and a host of partner nations issued a final warning to the Houthis to cease the campaign of drone and missile attacks on commercial ships, which has been in progress since the start of the Israel-Hamas war, or face potential military action.\nThe warning appeared to have had at least some short-lived impact, as attacks stopped for several days.\nA high-ranking Houthi official, Ali al-Qahoum, vowed there would be retaliation.\nHandout photo supplied by Ministry of Defence showing a Royal Air Force Voyager aircraft taking off from RAF Akrotiri to conduct strikes against military targets in Yemen (Ministry of Defence/PA)\nAl-Masirah, a Houthi-run satellite news channel, described strikes hitting the Al-Dailami Air Base north of Sanaa, the airport in the port city of the Hodeida, a camp east of Saada, the airport in the city of Taiz and an airport near Hajjah.\nThe Houthis did not immediately offer any damage or casualty information.\nOn Tuesday, the Houthi rebels fired their largest barrage of drones and missiles targeting shipping in the Red Sea, with US and British ships and American fighter jets responding by shooting down 18 drones, two cruise missiles and an anti-ship missile.\nOn Thursday, the Houthis fired an anti-ship ballistic missile into the Gulf of Aden, which was seen by a commercial ship but did not hit it.\nTransit through the Red Sea, from the Suez Canal to the Bab el-Mandeb Strait, is a crucial shipping lane for global commerce.\nAbout 12% of the world’s trade typically passes through the waterway that separates Africa and the Arabian Peninsula, including oil, natural gas, grain and everything from toys to electronics.", "source_domain": "guernseypress.com", "text": null, "title": "President Biden says strikes show US ‘will not tolerate’ Red Sea attacks", "title_page": null, "title_rss": null, "url": "https://guernseypress.com/news/world-news/2024/01/12/president-biden-says-strikes-show-us-will-not-tolerate-red-sea-attacks/"}