{"authors": ["Morgan Phillips", "Congress Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:18:39", "date_modify": "None", "date_publish": "2024-01-12 15:01:43", "description": "The news that President Biden has launched airstrikes on Iran-backed Houthis in Yemen has divided Congress - though not along party lines.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12956307%2Frepublicans-biden-airstrikes-yemen-progressives-constitution.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/12/15/79858901-0-image-a-22_1705074103418.jpg", "language": "en", "localpath": null, "maintext": "The news that President Biden has launched airstrikes on Iran-backed Houthis in Yemen has divided Congress - though not along party lines.\nTop Republicans, including Speaker Mike Johnson, claimed it was 'long overdue' and a number of moderate Democrats also praised the Biden administration's move.\n'We must hope these operations indicate a true shift in the Biden Administration's approach to Iran and its proxies that are engaging in such evil and wreaking such havoc,' Johnson wrote on X.\nHowever, isolationist Republicans and progressive Democrats were of a different mind.\n'Biden's airstrikes in Yemen blatantly violate Article 1 of our Constitution. He can't unilaterally pull us into another war. Why does he want so many wars?,' Rep. Andy Biggs, R-Ariz., wrote on X.\n'One [sic] again, President Biden acting without constitutional authority. Only Congress can authorize military action like this,' added Sen. Rand Paul, R-Ky.\nStrikes were carried out on over 60 targets at 16 Iranian-backed Houthi militant locations, including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems\nNew York Democrat Jamaal Bowman had a similar reaction: 'It is very concerning that war is expanding through this blatant violation of Article 1 of the Constitution. Unilateral presidential military action is dangerous no matter who is president.'\nBiden announced the airstrikes on Thursday night against the Middle Eastern nation as missiles came from fighter jets, destroyers and a submarine.\nThe U.S. used more than 100 precision missiles striking at around 2.30am local time on over 60 targets at 16 locations, according to the Air Force.\nPeople gather near burning Israeli and U.S. flags, as supporters of the Houthi movement rally to denounce air strikes launched by the U.S. and Britain on Houthi targets, in Sanaa, Yemen January 12, 2024\n'We must hope these operations indicate a true shift in the Biden Administration's approach to Iran and its proxies that are engaging in such evil and wreaking such havoc,' Johnson wrote on X\nThe attacks come in response to months of Houthi-led bombings on ships in the Red Sea - amid the conflict between Israel and Gaza.\nU.S. officials had warned there would be 'consequences' for the Houthi's attack on non-military ships in the Red Sea.\nRep. Marjorie Taylor Greene, R-Ga., was fighting mad about the strikes on X.\n'The President must come to Congress for permission before going to war. Biden can not solely decide to bomb Yemen. And what is the condition of Secretary of Defense Lloyd Austin? Is he still laid up in the hospital?' she exclaimed on the social media platform.\n'Biden admin wants to fund war in Ukraine, control the war in Israel, arm Taiwan and prep for war with China, and is now going to war in the Middle East???'\n'I welcome the U.S. and coalition operations against the Iran-backed Houthi terrorists responsible for violently disrupting international commerce in the Red Sea and attacking American vessels,' Senate Minority Leader Mitch McConnell, R-Ky., said in a statement, calling the military action 'long overdue.'\n'I am hopeful these operations mark an enduring shift in the Biden Administration's approach to Iran and its proxies. To restore deterrence and change Iran's calculus, Iranian leaders themselves must believe that they will pay a meaningful price unless they abandon their worldwide campaign of terror,' he added.\nRep. Michael McCaul, chair of the Foreign Affairs Committee, said he was meeting with the joint chiefs of staff when the strikes were announced and praised the move.\n\"I’m pleased the president, in coordination with our allies, finally took action against the Iran-backed Houthis following weeks of instability in the Red Sea. Tonight, with these strikes, we are beginning to restore deterrence. The administration must acknowledge it was a mistake to rescind the Houthis designation as a Foreign Terrorist Organization, and re-list them immediately,\" he said.\nRep. Rob Wittman, R-Va., vice chairman of the House Armed Services Committee, praised the strikes. 'It's about time — this is long overdue. I hope the Biden administration will finally shift their response strategy to Iran's acts of terror,' he wrote on X.\nNew Jersey Democrat Rep. Josh Gottheimer also commended the move: 'The Iranian-backed Houthis are terrorists with the sole objective of wreaking havoc, creating violence, and causing instability. Today's response is a clear message that the U.S. and our allies won't sit back while freedom is threatened.'\nThe U.S. and UK, along with Australia, Bahrain, Canada and the Netherlands, joined together for the attack.\nMohammed Ali al-Houthi, a member of the Houthi supreme political council, speaks while holding a gun, as supporters of the Houthi movement rally to denounce air strikes launched by the U.S. and Britain on Houthi targets\nA person holds a placard with a picture of Yemen's Houthi movement leader Abdul-Malik al-Houthi, as supporters of the Houthi movement rally to denounce air strikes launched by the U.S. and Britain\n'These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation in one of the world's most critical commercial routes,' Biden said.\n'I will not hesitate to direct further measures to protect our people and the free flow of international commerce as necessary.'\nDefense Secretary Lloyd Austin also released a statement in the wake of the attacks. It was his first public comment since his health scandal saw him in the ICU of the hospital for prostate cancer treatment, without the White House knowing about his condition.\n'This action is intended to disrupt and degrade the Houthis' capabilities to endanger mariners and threaten global trade in one of the world's most critical waterways. Today's coalition action sends a clear message to the Houthis that they will bear further costs if they do not end their illegal attacks,' Austin said.\nMIKE JOHNSON\nThis action by U.S. and British forces is long overdue, and we must hope these operations indicate a true shift in the Biden Administration's approach to Iran and its proxies that are engaging in such evil and wreaking such havoc. They must understand there is a serious price to pay for their global acts of terror and their attacks on U.S. personnel and commercial vessels. America must always project strength, especially in these dangerous times.\nBIGGS\nBiden's airstrikes in Yemen blatantly violate Article 1 of our Constitution. He can't unilaterally pull us into another war. Why does he want so many wars?\nROSENDALE\nArticle 1, Section 8, Clause 11: 'The Congress shall have Power to declare War.' Lloyd Austin gave orders to attack another country from the hospital bed WITHOUT congressional approval! Congress must assert its rightful place as an equal branch of government.\nROB WITTMAN\nIt's about time — this is long overdue. I hope the Biden administration will finally shift their response strategy to Iran's acts of terror.\nBOWMAN\nIt is very concerning that war is expanding through this blatant violation of Article 1 of the Constitution. Unilateral presidential military action is dangerous no matter who is president. It's why I've previously introduced bipartisan amendments to affirm Congress's role here.\nMASSIE\nThe United States has been involved in hostilities in Yemen, in one form or another, for over 5 years now. The sad reality is Congress frequently refuses to assert its authority. Twice under Paul Ryan, the War Powers Act w.r.t. Yemen was subverted through parliamentary tricks.\nRAND PAUL\nOne again, President Biden acting without constitutional authority. Only Congress can authorize military action like this.\nAYANNA PRESSLEY\nUnacceptable.\nPOTUS must get approval from Congress before authorizing military strikes in Yemen or any other country. The people do not want more endless wars.\nNANCY MACE\nThis is where we should put party aside and stand for the oath we all took: Congress alone decides if we go to war. I join my colleagues on both sides insisting we follow the Constitution.\nRO KHANNA\nThe President's strikes in Yemen are unconstitutional. For over a month, he consulted an international coalition to plan them, but never came to Congress to seek authorization as required by Article I of the Constitution. We need to listen to our Gulf allies, pursue de-escalation, and avoid getting into another Middle East war.\nGOTTHEIMER\nFollowing unprecedented attacks, the strikes carried out by the U.S. and our allies are necessary to protect our economy, national security, and key allies like Israel.\nThe Iranian-backed Houthis are terrorists with the sole objective of wreaking havoc, creating violence, and causing instability. Today's response is a clear message that the U.S. and our allies won't sit back while freedom is threatened.\nMTG\nThe President must come to Congress for permission before going to war. Biden can not solely decide to bomb Yemen. And what is the condition of Secretary of Defense Lloyd Austin? Is he still laid up in the hospital? Biden admin wants to fund war in Ukraine, control the war in Israel, arm Taiwan and prep for war with China, and is now going to war in the Middle East??? All with a wide open border, millions invading, and millions of got aways?! This is insanely out of control!\nTOM COTTON\nhttps://twitter.com/SenTomCotton/status/1745637185712222319", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Top Republicans commend Biden's 'long overdue' airstrikes on Houthi targets in Yemen while isolationist conservatives and progressives tear into 'blatant violation' of the Constitution and say he must", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12956307/republicans-biden-airstrikes-yemen-progressives-constitution.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}