{"authors": [], "date_download": "2024-02-05 15:18:42", "date_modify": "None", "date_publish": "2024-01-12 04:27:47", "description": "The U.S. Air Force has announced the end of its search and salvage operations at the site of a CV-22B Osprey crash that occurred off Japan in late November, expressing regret for not being able to find the last of their eight crew members killed and saying they now move on to finding the cause of the accident", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fosprey-ap-us-air-force-japan-japanese-b2477435.html.json", "image_url": "https://static.independent.co.uk/2024/01/12/04/Japan_Osprey_Crash_93748.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. Air Force on Friday announced the end of its more than a month long search and recovery operation at the site of a CV-22B Osprey crash that occurred off the southern Japanese coast in late November, expressing regret at not being able to find the last of the eight crew members killed.\nAir Force said it would now focus on finding the cause of the Nov. 29 crash off the coast of Yakushima Island that left eight members of the Air Force Special Operations Command dead. The Osprey was on a routine training flight to the southern island of Okinawa.\nDivers located the remains of seven crew members in the weeks following the crash, but the body of Maj. Eric Spendlove, a medical operations flight commander, has not been found.\nThe Air Force has also recovered the flight data recorder, or “black box,” which is critical to the accident probe. The analysis of its data is expected to take weeks. The Navy salvage ship USNS Salvor has recovered most of the Osprey’s wreckage from the sea floor and transported it to the Marine Corps Air Station Iwakuni, in the Yamaguchi prefecture, for analysis.\n“Our main priority since the mishap has been locating and bringing our heroes back to their families,” said Rear Adm. Jeromy Williams, Commander Special Operations Command Pacific. \"After over a month of exhausting search ... we have ruled out all identified possible options to recover our teammate.\"\n“Our thoughts remain with the families and squadron mates of our CV-22 aircrew and we extend our sincerest gratitude to every asset who assisted in the search,” Williams said in a statement.\nSpendlove's families have been notified of the conclusion of the search.\nJapan Coast Guard, Japanese Self-Defense Forces, as well as local authorities and fishers had joined the search and rescue operations since the crash.\nThe military's entire Osprey fleet has been grounded since Dec. 6 after the Air Force linked a material failure of the aircraft, not a human error, to the crash.\nJapan, the only international partner flying the Osprey, has also grounded its own fleet at home and has asked the U.S. military not to fly its Ospreys deployed to American based in Japan until the safety is confirmed.\nThe U.S.-made Osprey is a hybrid aircraft that takes off and lands like a helicopter but can rotate its propellers forward and cruise much faster, like an airplane, during flight.\nThe Osprey has involved in multiple fatal accidents over its relatively short time in service, and the crash raised new questions about its safety, triggering a congressional oversight committee to launch an investigation.", "source_domain": "www.independent.co.uk", "text": null, "title": "US Air Force announces end of search and recovery operations for Osprey that crashed off Japan", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/osprey-ap-us-air-force-japan-japanese-b2477435.html"}