{"authors": ["Reged Ahmad", "Léonie Chao-Fong", "Maya Yang", "Martin Belam", "Sammy Gecsoyler"], "date_download": "2024-02-05 15:18:44", "date_modify": "None", "date_publish": "2024-01-12 04:25:12", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F11%2Fmiddle-east-crisis-live-updates-israel-gaza-war-hamas-palestine-south-africa-genocide-case-icj.json", "image_url": "https://i.guim.co.uk/img/media/4f473564e56069bf4919fe4c03e6555d87a6d71e/35_0_1082_649/master/1082.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=e27f3efecc8e4150e5796dd9640cd769", "language": "en", "localpath": null, "maintext": "00.50 CET US and UK air strikes on Yemen\nThe United States and Britain have started carrying out strikes against targets linked to Houthis in Yemen, four US officials have told Reuters.\nIt’s the first time strikes have been launched against the Iran-backed group since it started targeting international shipping in the Red Sea late last year.\nAssociated Press is also reporting that US and British militaries have begun bombing sites used by the Iranian-backed Houthis in Yemen in a massive retaliatory strike.\nA Houthi official says ‘enemy’ raids on Sana’a are taking place, according to Reuters. A witness in Yemen’s Sana’a has also told Reuters three explosions have been heard.\nYemen’s Iranian-backed Houthi militants have stepped up attacks on commercial vessels in the Red Sea in protest against Israel’s war in Gaza. Various shipping lines have suspended operations, instead taking the longer journey around Africa.\nThe US military said the Houthis earlier on Thursday had staged their 27th attack on shipping since 19 November, firing an anti-ship ballistic missile into international shipping lanes in the Gulf of Aden.", "source_domain": "www.theguardian.com", "text": null, "title": "Ten countries involved in air strikes on Yemen’s Houthis - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/11/middle-east-crisis-live-updates-israel-gaza-war-hamas-palestine-south-africa-genocide-case-icj"}