{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:18:47", "date_modify": "None", "date_publish": "2024-01-12 01:57:00", "description": "US Defense Secretary Lloyd Austin has broken his silence after failing to disclose he was in the hospital to speak out about the US bombings in Yemen.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12954369%2FLloyd-austin-hospital-yemen-strikes-Houthi-ICU.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/12/01/79908731-0-US_Secretary_of_Defense_Lloyd_Austin_speaks_during_a_Senate_hear-a-9_1705024605638.jpg", "language": "en", "localpath": null, "maintext": "Defense Secretary Lloyd Austin has broken his silence after failing to disclose he was in the hospital to speak out as the United States rained bombs on Iran-backed targets across Yemen.\n'In light of the illegal, dangerous, and destabilizing Iranian-backed Houthi attacks against U.S. and international vessels and commercial vessels from many countries lawfully transiting the Red Sea, today the militaries of the United States and the United Kingdom, with support from Australia, Bahrain, Canada, and the Netherlands, conducted strikes against military targets in Houthi-controlled areas of Yemen,' he said in a statement.\n'This action is intended to disrupt and degrade the Houthis' capabilities to endanger mariners and threaten global trade in one of the world's most critical waterways. Today's coalition action sends a clear message to the Houthis that they will bear further costs if they do not end their illegal attacks,' Austin added.\nAustin cited the 'more than two dozen attacks' made by the Houthis since November 19 and the need for a coalition to uphold the rules-based international order.\nThe Defense Secretary remains hospitalized after his ICU stint, a stay that was kept secret from the country and White House for days.\nDefense Secretary Lloyd Austin has broken his silence after failing to disclose he was in the hospital to speak out as the United States rained bombs on Iran-backed targets across Yemen\n'We will not hesitate to defend our forces, the global economy, and the free flow of legitimate commerce in one of the world's vital waterways,' Austin said in the statement.\nAustin was admitted to Walter Reed National Military Medical Center on December 22 after 'consultation with his medical team' due to a prostate cancer diagnosis.\nHe then underwent a 'minimally invasive surgical procedure called a prostatectomy to treat and cure prostate cancer,' according to a statement from the hospital. His cancer was 'diagnosed early and his prognosis is excellent,' the statement said.\nBut he then suffered complications on January 1 that required an ambulance to take him back to the hospital. His complications included 'nausea with severe abdominal, leg and hip pain.'\nThe early diagnosis was a urinary tract infection but further examination showed Austin, 70, had a fluid build up in his abdomen that was impairing the function of his small intestines.\nThe infection was treated by a tube placed through is nose that went down to his stomach. It has cleared, the statement said, and Austin 'continues to make progress.'\nHe 'never lost consciousness and never underwent general anesthesia,' the statement said, although Austin did undergo anesthesia for the December 22 surgery.\nDeputy Defense Secretary Kathleen Hicks was given Austin's powers at that time but not told the reason.\nHandout photo supplied by the UK Ministry of Defense showing a Royal Air Force Typhoon FGR4 taking off from Royal Air Force Akrotiri to conduct strikes against military targets in Yemen\nI have lost trust in Secretary Lloyd Austin’s leadership of the Defense Department due to the lack of transparency about his recent medical treatment and its impact on the continuity of the chain of command. — Congressman Chris Deluzio (@RepDeluzio) January 10, 2024\nPresident Joe Biden was only informed on Tuesday that Austin had cancer.\nPentagon officials also didn't tell the White House for four days that Austin had returned to the hospital on Jan. 1 after experiencing severe pain. He was taken there by ambulance.\nA Pentagon official blamed the communications breakdown on 'a screw up because of people being out of the office.'\nAustin Chief of staff Kelly Magsamen had the flu and public affairs chief Chris Meagher was at doctors' appointments with his pregnant wife, who gave birth to their first child on Friday.\nBiden announced the airstrikes on Thursday night against the Middle Eastern nation as missiles came from planes, destroyers and submarines. The attacks come in response to weeks of Houthi-led bombings on ships in the Red Sea - amid the conflict between Israel and Gaza.\nUS officials had warned there would be 'consequences' for the Houthi's attack on non-military ships in the Red Sea.\nExplosions were reported in Sana'a, Hodeidah governorate, Saada, and Dhamar, Houthi officials confirmed. It's unclear the extent of the damage or any injuries.\nFighter jets, Navy destroyers, submarines and Tomahawk cruise missiles were all used in the blitz, according to NBC.\nThe US and UK, along with Australia, Bahrain, Canada and the Netherlands, joined together for the attack.\n'These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation in one of the world’s most critical commercial routes,' Biden said.\n'I will not hesitate to direct further measures to protect our people and the free flow of international commerce as necessary.'\nUS and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in the Red Sea\nThe bombardment came on Thursday night after the Houthi had blocked another shipping lane in the Gulf of Aden, the latest in a string of attacks against vessels in the area in recent months. Pictured: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in November.\nPrior to the strike, terrorists in the region had warned of possible retaliation against US military targets if the bombing went ahead.\nShortly after the strike unverified reports of attacks on US bases in Iraq began to flood social media.\nThe bombardment came after the the U.S. military said the Houthis had had staged their 27th attack on shipping since November 19 earlier on Thursday, firing an anti-ship ballistic missile into international shipping lanes in the Gulf of Aden.\nThe US military strikes are the country's first on Yemen since 2016. President Biden said they had been ordered in response to 'unprecedented' attacks against maritime vessels.\n'More than 50 nations have been affected in 27 attacks on international commercial shipping. Crews from more than 20 countries have been threatened or taken hostage in acts of piracy,' Biden said.\n'More than 2,000 ships have been forced to divert thousands of miles to avoid the Red Sea—which can cause weeks of delays in product shipping times. And on January 9, Houthis launched their largest attack to date—directly targeting American ships.'\nHe then added: 'Last week, together with 13 allies and partners, we issued an unequivocal warning that Houthi rebels would bear the consequences if their attacks did not cease. And yesterday, the United Nations Security Council passed a resolution demanding the Houthis end attacks on merchant and commercial vessels.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Defense Secretary Lloyd Austin breaks his silence from his secret ICU stay to warn of 'further costs' if Houthis don't end attacks on shipping vessels in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12954369/Lloyd-austin-hospital-yemen-strikes-Houthi-ICU.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}