{"authors": ["Phil Hoad"], "date_download": "2024-02-05 15:18:48", "date_modify": "None", "date_publish": "2024-01-12 08:00:24", "description": "State of the art tech, exciting action sequences, swaggering young heroes … it’s no surprise that the world’s new superpowers have fallen for blockbuster air force films. But can they be anything more than military propaganda?", "filename": "https%3A%2F%2Fwww.theguardian.com%2Ffilm%2F2024%2Fjan%2F12%2Fthe-need-for-speed-why-china-and-india-are-fast-tracking-their-own-top-gun-remakes.json", "image_url": "https://i.guim.co.uk/img/media/058ed5bf074e8369bfe8475567c5de598a6b4db1/414_0_1783_1070/master/1783.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=90ecc356fa60486093d81093eea15884", "language": "en", "localpath": null, "maintext": "In an era of rising global tension, there are a few status symbols the self-respecting global superpower can’t do without. Nuclear weapons? Sure. A space programme? Natch. But the latest geopolitical must-have is superficially more niche: a supersonic, hyper-nationalistic blockbuster air force film. There wasn’t a soul on the planet who failed to notice the media sonic boom as Tom Cruise passed overhead with Top Gun: Maverick in May 2022, while its Chinese counterpart Born to Fly came out a year later. And this month India gets in on the game with its own flyboy extravaganza Fighter, starring Hrithik Roshan, whose quiff alone qualifies as some kind of national monument.\nIn the surest sign of its geopolitical decline, Russia has yet to make one. But China and India are on the up, propelled by rulers with autocratic bents who want the full soft-power furnishings. The US went through a similar jingoistic spurt in the 1980s, wallpapered by a set of militaristic movie hits: the original Top Gun, the second and third Rambo films, Commando, Red Dawn and more. China has been flexing its cinematic muscles for a decade now, with actioners such as the Wolf Warrior franchise and Operation Red Sea, not to mention a raft of historic films with patriotic overtones. Narendra Modi’s India has been less able to manhandle its film industry into line, with sporadic bellicose output like the Pakistan-cuffing Baaghi 2 and Uri: The Surgical Strike. But Fighter, released for the country’s 75th Republic Day and featuring Roshan emerging from a chopper with a billowing Tiraṅgā, as the Indian tricolour is known, in tow, suggest pressure may be mounting.\nThe air force flick remains the ne plus ultra of military film-making; pure cinematic surface, those gleaming Ray-Bans and pristine contrails breezily aestheticising the modern superpower’s elite capability. It’s not hard to see why China and India want a Top Gun: at the same time as being 1986’s top-grossing film and launching Cruise as an American icon, the movie also functioned as soft-power projection of hard power, and recruiting advert for the US military to boot. Shot by ad man Tony Scott with the swaggering back-lit glamour of a sportscast, it made warfare look like a blast. Intentionally so: the script was approved by the Department of Defense, in return for access to the military equipment and locations without which the film couldn’t have been made. A single F-14 fighter, the plane flown by Maverick, was worth $38m – more than twice the film’s entire budget. Top Gun is – to put it straight – propaganda.\nView image in fullscreen Soft power … Top Gun: Maverick. Photograph: Paramount Pictures/AP\nWith Born to Fly, China found that pulling the same stunt isn’t so easy. Focusing, like Top Gun, on a group of trainee pilots, the mission objective is chiding the unspecified foreign powers displaying a lamentably casual attitude to Chinese airspace, such as the two interlopers who declare, with American accents, in the intro: “We can come and go whenever we want.” It is also there to put the country’s J-20 stealth fighter in the shop window. Director Liu Xiaoshi was a company man, having made films for the Aviation Industry Corporation of China for 15 years. But it seems that in the wake of Top Gun: Maverick’s mammoth $1.5bn run (none of which was earned in China, where the film was never cleared for release), Beijing got cold feet about engaging with the enemy. Born to Fly was pulled from release in 2022, just prior to the country’s National Day on 1 October, supposedly in order to overhaul its sub-par special effects. The film belatedly came out last year to earn $117.3m; peanuts compared to the Wolf Warriors’ huge grosses.\nBut the real inferiority is in the cockpit, with the film’s human element. Compared to Top Gun’s Maverick, with his inverted, middle-finger diplomacy, its protagonist Lei Yu (played by boy band singer Wang Yibo) is hopelessly bland. Top Gun operated under a form of opt-in censorship, with Hollywood trading script approval for kit; Chinese directors are subject to the compulsory kind, with every script vetted. And in Born to Fly, it shows in the neutered portrayal. There’s no question of fraternisation between soldiers on any level, let alone the kind of blazing gay subtext leapt on by Quentin Tarantino. Job thrills in the Chinese air force apparently consist of occasional dumpling nights with your superiors, a strange obsession with the intricacies of parachute-folding, and the masochistic ethos – with an emphasis on suffering for the collective good – that features in all Chinese state-sponsored military films.\nView image in fullscreen High flier … boy band singer Wang Yibo in Born to Fly. Photograph: Everett Collection Inc/Alamy\nHopefully, Fighter will be more fun and at least bring in some Bollywood bombast. Unsurprisingly, it has been produced in co-operation with the Indian armed forces, filming partly at the air force academy in the southern Indian city of Dundigal. So it probably won’t be some hard-hitting exposé of military inculcation methods, with Roshan not quite having the superstar immunity that has allowed the actor Shah Rukh Khan to make statements in his films that cut across the grain of pro-Hindi nationalism. The title of his recent patriotic covert-forces hit, Pathaan, is the Hindi word for the Afghan Pashto ethnic group, which provides his character’s origin story; a pluralistic twist on the Jai Hind blockbuster.\nFighter, like its gung-ho 1980s American models, may lack this kind of subversive intent. But that doesn’t mean it won’t employ any guile whatsoever – if it has learned its lessons well. This is the great tactical advantage of the US soft-power model: wrapping propaganda in fluent entertainment. However proselytising Top Gun may be, it is simultaneously massive fun, sweating out attitude and sexual tension – at two ends of the spectrum, apparently – from every pore. And the franchise is emotionally adept too: the sequel manages to turn the “talking points” apparently stipulated by the military into a resonant contemporary story about waning US influence, via our nostalgia for the cocksure Maverick.\nView image in fullscreen Dog fighting … a scene from Fighter. Photograph: Viacom18 Studios\nBoth films have a studied neutrality, taking place largely in training academies, and their vaguely outlined climactic confrontations happening in international waters and an unnamed Middle Eastern country respectively. Hollywood stays a safe distance from real-world precision, all the better to maximise its global box office appeal. But propagandist intent is behind all these careful script decisions, the guiding hand of hard power at the heart of Hollywood coordinated by one nondescript military liaison office on Wilshire Boulevard.\nCall it stealth propaganda: when audiences swallow the politics – or at least object less to them – because they are cloaked. China and India can feel the need for speed all they like, but they won’t be packing the same box-office firepower unless they learn to go in under the radar.", "source_domain": "www.theguardian.com", "text": null, "title": "The need for speed: why China and India are fast-tracking their own Top Gun remakes", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/film/2024/jan/12/the-need-for-speed-why-china-and-india-are-fast-tracking-their-own-top-gun-remakes"}