{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:14:46", "date_modify": "None", "date_publish": "2024-01-30 06:27:15", "description": "Joe Biden is weighing up his options for responding to Sunday's killing of three U.S. soldiers by Iranian-backed militias. Analysts say he has no good answers, but must act decisively.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13021565%2Fjoe-biden-iran-drone-attacks-soldiers-killed-reprisals.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/30/06/80603143-0-image-a-21_1706596038792.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden is weighing up launching strikes on Iranian military assets in the Persian Gulf after three Americans were killed in Jordan by a Tehran-backed drone.\nThe president has demanded advisors present him with options on how to respond to the attack without dragging the US into battle in the Middle East, Politico reports.\nInsiders revealed any revenge bombings will taken place in the coming days as the commander-in-chief and military brass study a range of targets.\nFears of war were sparked over the weekend when an Iran-backed suicide drone killed three American soldiers at a remote base near Jordan's border with Syria.\nThe victims were named on Monday as specialist Kennedy Ladon Sanders, 24, specialist Breonna Moffett, 23, and sergeant William Rivers, 46.\nIran-backed militias, calling themselves the Axis of Resistance, have also launched more than 160 strikes on US targets since the October 7 terror attack by Hamas.\nIt comes at a delicate time for the White House, with Biden not seen out and about on Monday after sparking health fears due to a bumbling speech in South Carolina.\nMeanwhile Defense Secretary Lloyd Austin has only recently returned to the office after going AWOL to have prostate cancer surgery.\nThe White House put out an image of President Biden meeting with his security team, including Defense Secretary Lloyd Austin, on Monday as the administration prepares to respond to an attack on a U.S. base in Jordan\nFrom left to right: Spc. Kennedy Sanders, Sgt. William Jerome Rivers and Spc. Breonna Alexsondria Moffett. The three U.S. Army Reserve soldiers from Georgia were killed by a drone strike on Sunday\nOn Sunday, the Axis claimed responsibility for the attack on the outpost in Jordan, saying it was a 'continuation of our approach to resisting the American occupation forces in Iraq and the region.'\nIran's foreign ministry spokesman Nasser Kanaani said on Monday the militias 'do not take orders' from Iran and act independently.\nBut Tehran is widely known to be the driving force for the attacks on the U.S. targets. Biden's own aides, according to The New York Times, admit the efforts to hit targets in the region in response to drone and missile attacks - to 'restore deterrence,' the administration says - have failed.\nThe president, who was not publicly seen on Monday, but was shown in White House photos meeting his advisers, has ordered his team to draw up a list of options for retaliation.\nPolitico reported that they include attacking Iranian personnel in Syria or Iraq, or Iranian naval assets in the Persian Gulf.\nIran has suggested any strikes within Iran itself would cross a red line. Former CIA chief of staff Jeremy Bash said escalation is 'unavoidable'.\nHe said: Biden 'cannot avoid the international challenges even in an election year.' He added: 'There is a sense that our deterrence measures to date have not been received by Tehran as we hoped, so escalation is unavoidable.'\nThe president again warned that the U.S. would hold those responsible 'to account.' He met with members of his security team including Austin, who has been working at home for weeks after being hospitalized\nThe drone attack late Saturday night impacted a US outpost located in the northeast part of the country known as Tower 22, near the Syria border, and resulted in at least 34 other injuries\nOnce Biden has made his call, retaliation would likely begin a few days later and come in waves, against a range of targets.\nCampaign officials hope that the 81-year-old president, who spent six years as head of the Senate Foreign Relations Committee and has deep relationships with many key players in the Middle East, will impress wavering voters with his calm and competence.\nThe Pentagon and State Department have spent decades drawing up scenarios and creating lists of possible targets.\nThe New York Times reported that the U.S. has identified the major drone-making factories, and their overseas suppliers, which are working to help Russia in Ukraine, and providing armaments to the Houthis in Yemen and Hezbollah in Lebanon.\nThe working assumption of American officials, the paper said, is that Sunday's attack was by an Iranian-made drone.\nThe Pentagon has existing plans for potential strikes on Iranian missile sites and air bases, in case a conflict broke out between Iran and Israel. Israel has been carrying out high-profile bombing runs, practicing attacks on the Natanz nuclear site and the underground facility at Fordow.\nThe U.S. has even formulated a cyberattack option against Iran, code-named 'Nitro Zeus,' the New York Times reported.\nThe cyberattack would disable Iran's air defenses, communications systems and crucial parts of its power grid.\nDefense Secretary Lloyd Austin was back at work at the Pentagon for the first time since his December surgery for a procedure he did not disclose to the White House in advance. He attended a meeting with NATO Secretary General Jens Stoltenberg at the Pentagon Monday\nBiden is pictured with Democratic Minnesota senator Amy Klobuchar and yellow-vested workers at a bar as he donned a construction hat backward\nIran's Supreme Leader Ayatollah Ali Khamenei is pictured last year. Iran has said it does not control the militias, but is widely known to fund and support them\nRepublicans, led by Trump, are demanding Biden take decisive action. Trump backed away from attacking Iran in November 2020, shortly after the election.\nHe asked for options on attacking Iran's main nuclear site, a day after a U.N. watchdog report showed Iran had finished moving a first cascade of advanced centrifuges from an above-ground plant at its main uranium enrichment site to an underground one, in a fresh breach of its 2015 nuclear deal with major powers.\nBut Trump ultimately decided against taking the dramatic step, privately worrying about the implications of an all-out war with Iran.\nOn Sunday, Trump said he would have been tougher against Iran. 'Three years ago, Iran was weak, broke, and totally under control,' he wrote on Truth Social.\n'Thanks to my Maximum Pressure policy, the Iranian Regime could barely scrape two dollars together to fund their terrorist proxies.'\nHe said the fault lay with Biden's decision in September to unfreeze $6 billion of Iranian cash, held in Qatar, in response to Iran releasing five U.S. hostages.\nTrump said Biden was now funding 'bloodshed and carnage', and condemned the decision.\nThe USS Gerald R. Ford, the Navy's latest and most advanced aircraft carrier, was deployed to the eastern Mediterranean in response to the attack by Hamas on Israel\nA handout photo made available by the Iranian Army office on January 19 shows a missile being launched during a military drill in the Persian Gulf\nIn November, the House blocked the unfreezing of the cash: the decision now goes to the Senate.\n'Then Joe Biden came in and gave Iran billions of dollars, which the Regime has used to spread bloodshed and carnage throughout the Middle East,' said Trump.\n'This attack would NEVER have happened if I was President, not even a chance - Just like the Iranian-backed Hamas attack on Israel would never have happened, the War in Ukraine would never have happened, and we would right now have Peace throughout the World. Instead, we are on the brink of World War 3…..'\nOther Republicans echoed Trump's call for a swift and incisive response to Iran's actions.\nMitch McConnell, the Senate minority leader, called for 'crippling costs' for Iran, saying the pain must be felt 'not only on frontline terrorist proxies, but on their Iranian sponsors who wear American blood as a badge of honor.'\nSenator John Cornyn, the Texas Republican, demanded strikes on Iran's Islamic Revolutionary Guard Corps.\nLindsey Graham, the South Carolina senator, said: 'The only thing the Iranian regime understands is force. Until they pay a price with their infrastructure and their personnel, the attacks on U.S. troops will continue. 'Hit Iran now. Hit them hard.'\nDonald Trump, seen at a rally on Saturday in Nevada, said Biden had been weak on Iran\nSen. Lindsey Graham demanded Biden: 'Hit Iran now. Hit them hard'\nAnd Dan Crenshaw, a member of the House representing Texas, who served in Afghanistan and Iraq, said it was time to repeat Trump's order to kill Qasem Soleimani, leader of the Quds Force, whose January 3, 2020 death in a U.S. drone strike stunned Iran.\n'Time to kill another Iranian general, perhaps?' said Crenshaw. 'That might send the right message.'\nBiden is aware of the increasing cost of foreign wars - Ukraine, Gaza - on his election campaign, and concerned about escalation.\nHe has few good options, analysts say.\n'There are no good choices, but the deaths and wounds of so many U.S. troops and SEALs demand a strong response,' said James G. Stavridis, the retired Navy admiral who now works for the Carlyle Group, a global investment firm.\nStavridis told The New York Times that there needed to be significant reprisals.\n'A multi-day air campaign against all proxies, coupled with a 'last chance warning' to Iran is warranted,' he said.\n'The Pentagon should be creating options that go directly against Iranian weapons production facilities, naval assets and intelligence systems in case the mullahs want to go another round. A strong offensive cyberattack would be another viable option, either alone or in conjunction with kinetic strikes.'\nAaron David Miller, a former U.S. Middle East peace negotiator now at the Carnegie Endowment for International Peace, told Politico: 'His options range from bad to worse. Not responding is not conscionable, but there are risks of provoking a true regional war.'\nHe aded: 'They know that Iran can not afford a direct conflict with the United States, but it could fully unleash Hezbollah on Israel or American assets, and it could spiral.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Joe Biden is considering striking Iranian naval assets in the Persian Gulf in response to deadly drone attacks - as Trump and GOP slam president for failure to deter Tehran - despite multiple warnings", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13021565/joe-biden-iran-drone-attacks-soldiers-killed-reprisals.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}