{"authors": ["Chris Samuel"], "date_download": "2024-02-05 15:18:49", "date_modify": "None", "date_publish": "2024-01-11 10:53:00", "description": "The commander-in-chief of Russia's naval forces put out a stark warning over the US rockets able to deal huge strikes 'on targets in most areas of Russia'.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1854502%2Frussian-navy-warning-massive-strike-US-unleashes-superweapon.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5156558.jpg", "language": "en", "localpath": null, "maintext": "Russia has a formidable fleet of submarines, but its surface vessels have been greatly reduced by the invasion of Ukraine.\nUS warships equipped with devastating Tomahawk cruise missiles are a serious threat to the country’s national security, Russia’s navy has warned. Nikolai Yevmenov, who is the commander-in-chief of Russia's naval forces, said vessels equipped with these long-range missiles are able to deliver “massive” strikes “on targets in most areas of Russia\". He made the warning in comments published by Krasnaya Zvezda, a newspaper linked to the Russian Defense Ministry, according to reports from Russian media. Tomahawks are launched from the US military's ships and submarines and can \"strike targets precisely from 1,000 miles away, even in heavily defended airspace,\" according to defense contractor Raytheon which manufactures the missiles. The US has thousands of the precision weapons in its stockpiles and in vessels around the world.\nTomahawk missiles can strike targets precisely from 1,000 miles away, according to its manufacturer.\nRussia is continuing its bombardment of Ukraine almost two years on from the start of conflict.\nBut despite being stretched thin by deployments across the globe, the US navy remains a formidable prospect on the seas and beneath the surface. Russia has a powerful fleet of submarines, but according to Western experts has seen its surface vessels atrophy as the war in the Ukraine has limited its naval capabilities. UK Defense Secretary Grant Shapps said in late December that Russia had lost 20 percent of its Black Sea fleet in just the previous four months. Volodymr Velensky’s forces are known to have sunk a Russian Kilo-class submarine, as well as damaging several their landing ships, including the Saratov, the Minsk, and the Olenegorsky Gornyak. \"Risks are created by the presence of groups of naval forces of foreign states in the Atlantic and Pacific oceans, in the Mediterranean Sea,\" Yevmenov said.", "source_domain": "www.express.co.uk", "text": null, "title": "Russian Navy warns of 'massive strike' after US unleashes superweapn", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1854502/russian-navy-warning-massive-strike-US-unleashes-superweapon"}