{"authors": ["Oliver Connolly"], "date_download": "2024-02-05 15:18:49", "date_modify": "None", "date_publish": "2024-01-11 17:02:54", "description": "The most successful NFL coach of the 21st-century must find ways to innovate again if he is to thrive at a new team after his departure from New England", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fsport%2F2024%2Fjan%2F11%2Flike-many-great-leaders-bill-belichick-was-brought-down-by-a-failure-to-evolve.json", "image_url": "https://i.guim.co.uk/img/media/40eab49c2415933a6cd9fd05df1d18dd1cc1770a/0_165_4997_3000/master/4997.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2f93b75ab6d4d62bfdcc0bd91c62edb2", "language": "en", "localpath": null, "maintext": "No need for double takes. Yes, it has really, finally happened. Bill Belichick is leaving the New England Patriots after an unprecedented 24-season run as their head coach.\nHe will leave the Patriots as the greatest to ever do it. Six Lombardi trophies, nine Super Bowl appearances, countless division titles and AFC championship games appearances. In an era with the salary cap, free agency, the draft and legislated parity, Belichick, in partnership with Tom Brady, lorded it up over the rest of the league for two decades.\nIn the end, Belichick the executive knee-capped Belichick the coach. He also acted as New England’s de facto general manager, and, in the post-Brady era, he failed to find a successor at quarterback. Worse: he failed to put together a coherent offense, vacillating between quarterbacks and ill-fitting schemes with a raft of coaches too often in over their heads and a group of offensive linemen and playmakers who were built for the league in 2005 rather than 2023.\nOver the coming days, months and years, we will return to the inevitable (nauseating) question of who deserves the lion’s share of the credit for the Patriots dynasty. Was Belichick a fraud all along? Did he luck into Brady’s talent? How come, if he’s the best to ever do it, things were so miserable in New England once Brady left? How come Brady was able to win a title in Tampa, while Belichick trudged through the sludge in Foxborough?\n00:01:28 'I'll always be a Patriot': Belichick leaves New England after 24 seasons – video\nSuch thinking is, of course, nonsense. Brady and Belichick were the ultimate partnership. We like to apportion credit to a sole individual. We want to find a Michael Jordan. The reality of the team’s success over their 20-year run was that it was a partnership of equals.\nThere has never been a partnership like Belichick and Brady; we will never see one again. Here we had the finest defensive strategist of his – or any – era game paired with the most obsessive, relentless quarterback to ever play the position.\nBelichick did not luck into Brady – or not quite. Did he snag the best quarterback of the modern game in the sixth round of the 2000 draft? Sure. If he knew he would be Tom Bleeping Brady would he have moved up in the draft to take him first overall? You bet. But Belichick also carried Brady through their early years together. He kept Brady as the fourth quarterback on his roster during Brady’s rookie season, at a time when keeping three quarterbacks on a roster felt like a luxury. He navigated the murky early years when Belichick’s defense carried the team to victory, with Brady’s cold-blooded qualities shining in close games in the fourth quarter.\nAs the relationship developed, Brady shouldered more of the burden. It tilted from a Belichick-dominant relationship into a Brady-dominant one. As the league’s rules evolved, emphasizing offense, so the dynamic flowed with it. Brady’s arm, mind and mastery of the offense become more pivotal to success than Belichick’s schematic wizardry or even his team-building chops.\nAt times, Belichick and his defense carried Brady – including in the duo’s last Super Bowl win together in February 2019. At other times, Brady bailed out Belichick’s funky roster construction or below-par defenses. That’s how partnerships go.\nBelichick’s mistake was in not realizing at end of their run that Brady had become the more valuable partner. He squeezed Brady out of New England before the quarterback was done, and that meant Brady walked away to the Buccaneers while he was still near his best. Belichick had stopped adapting the team’s offense and refused to bring in new voices. Brady wanted to force change on his own, to ditch medium-term thinking and chase short-term results to squeeze out a final ring or two. In Tampa, he showed it worked. Belichick’s view was that he could keep the thing rolling for another 10 years by sticking to the same principles as he had throughout the latter part of the franchise’s dynastic streak. It fell apart within four years, culminating in a 4-13 record this season, the worst of Belichick’s career in New England and the team’s worst in more than 30 years.\nBelichick’s final years in New England were defined by his inability to find another partner. He became too powerful, too all-knowing. He whiffed on successive draft picks, splurged free-agent money on below-average players and crucial backroom staffers who’d been with the coach throughout his career retired. Nobody was capable of pushing back to curb Belichick’s own worst instincts – until owner Robert Kraft eventually decided it would be best if he left altogether.\nBelichick has yet to confirm whether he will continue coaching elsewhere. But he will leave New England 15 wins shy of breaking Don Shula’s NFL record of 347 wins as a head coach. That alone should be enough for him to test the waters elsewhere. And there’s the not-so-insignificant fact that he still has juice as a defensive coach.\nOver the past couple of years, he’s wrestled back and forth with ceding control over his preferred unit. Whenever the Patriots struggled defensively, Belichick reasserted his authority, and lo-and-behold they’d find themselves back atop the defensive standings.\nEven as this past season devolved into misery, Belichick found a way to squeeze as much out of his defense as possible. Over the final 10 weeks of the season, the Patriots defense ranked fifth in EPA/play, a measure of down-to-down success. And they did so without any single A-plus star.\nBelichick is unlikely to ride off into the sunset when he continues to coach one side of the ball at such a high level and he’s within touching distance of Shula’s record.\nIt’s worth reflecting on what has happened over the past 24 hours. Belichick follows two other veteran head coaches, Nick Saban and Pete Carroll, in leaving their posts. Carroll was shifted into an advisory role with the Seattle Seahawks. Saban, arguably the finest college football coach in the history of the game, decided to retire.\nBelichick, Saban and Carroll are the architects of all that is right and good about modern defense. Working together in Cleveland, the Saban-Belichick axis formed a signature defensive style that lives on in every playbook at the pro and college level to this day.\nCarroll built the Legion of Boom, the preeminent defense in recent modern NFL history, contorting the foundations that Belichick and Saban had laid in Cleveland, New England and Alabama. If you’re making a Mt Rushmore of the most impactful and influential football coaches this century, those are the first three faces that should be chiseled into the rock, with a spot free for Andy Reid or Mike Tomlin.\nskip past newsletter promotion Sign up to Soccer with Jonathan Wilson Free weekly newsletter Jonathan Wilson brings expert analysis on the biggest stories from European soccer Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nAll three exiting within 24 hours of each other is a sign of the shifting sands of the sport. Their legacies – as one-man forces and defensive architects – will live on, but their styles and success will be tough for anyone to replicate. All were obsessive visionaries. All put up an uncommon level of success: Belichick the highest number of Super Bowls; Saban the highest number of national championships; Carroll one of only three coaches to win a college football national championship and a Super Bowl.\nAnd while all three are on their way out, they all could still do it at the highest level. Saban isn’t going out at the very top, but he’s pretty damn close. Carroll, for his flaws in building a staff over the past couple of years, was still churning out playoff-caliber teams in his 70s. If he wanted to uproot and move elsewhere in this coaching cycle, he’d be at the top of plenty of lists.\nView image in fullscreen Bill Belichick will always be linked to his partnership with Tom Brady. Photograph: David J Phillip/AP\nThen there’s Belichick. He will immediately be the most sought-after coach on the market, and ESPN reports that the Patriots will let Belichick, who still has a year left on his contract, join a team without seeking anything in return. Atlanta looms as the obvious destination. Falcons owner Arthur Blank and Kraft are close, so Blank will know what he’s in for if he makes a move for Belichick.\nFor Belichick’s sake, he needs to find an owner who’s brave enough to make it clear he will not have total control over his new team in the way he did at the Patriots. The concern would be he lands with an organization that buys into the Belichick aura, one that wants to win the press conference rather than build a successful team. The Washington Commanders and Carolina Panthers slot neatly into the new/tempestuous owner vortex. Both are likely to chase big names to reboot their flagging franchises, although it’s unclear if ownership would be willing to tell Belichick he needs to change. If the Los Angeles Chargers or Las Vegas Raiders miss out on Michigan’s Jim Harbaugh, then those linger as potential destinations, too. A Justin Herbert-controlled offense paired with a Belichick defense in LA? Can we book the parade route now?\nThen there are the teams still in the playoffs. Every coach in the postseason will get fidgety if they go one-and-done knowing that Belichick is sat out there.\nBelichick finished with a 22-29 record over his final three seasons in New England. This last season was painful, but there are still signs, buried beneath the rubble, that he can be a top-tier coach elsewhere.\nSaban and Carroll should offer some perspective. Carroll spent the final years in Seattle desperately seeking out new approaches – he just failed to fully realize them. But it’s Saban, his former understudy, that Belichick can learn from most of all.\nWhen Saban’s dynasty started to falter, he pivoted his style. For years and years, he had turned to his old buddy Belichick for inspiration. Belichick, for a long time, was at the forefront of every kind of innovation. On defense, he consistently reshaped his principles. When you see any of the new-fangled trends on defense these days, it’s worth remembering Belichick and Saban had crafted them back in Cleveland.\nOn offense, Belichick had a once-in-a-lifetime quarterback capable of altering his game to whatever the coach required. The Patriots were the first to embrace the spread offense in the NFL. They were the first to crank up the tempo. They were the first to use multiple, hybrid tight ends to mess with defensive matchups. They included backs in the passing game at a time when teams were still steamrolling their runners into the line of scrimmage. They jumped on to the RPO train before such a thing had filtered into the broader footballing lexicon. When defenses eventually adapted, he returned to the good ol’ days, building a bruising attack to take advantage of lighter defensive fronts.\nFor 23 years, Belichick was always ahead of the curve. He had the finest quarterback paired with the sharpest schemes.\nWhen Brady retired, things splintered. It’s not so easy to shapeshift when you’re working with mere mortals. And as Belichick struggled to keep up, he continued to look backward rather than press ahead to the future. He brought in his old defensive coordinator to run the offense and his old special teams coach to serve as a quarterback guru. When that blew up his face, he turned to Bill O’Brien, another retread of the Patriot Way, to try to get things back on track. But Belichick retained overall control. The group never moved into 2023, despite O’Brien’s credentials, with Belichick instead demanding his offensive coordinator run an offense more in keeping with a 2012 version of the Patriots offense than anything you see on Sundays these days.\nMaintaining success is never as inspiring as building it. But Belichick’s brilliance as the commander-in-chief of the Patriots was that he delighted in its maintenance while also chasing the new. Over the past three years, that rush to find fresh ideas evaporated. He closed ranks, relying on those he worked with before – or shared his surname – rather than dragging in help from outside.\nIn the end, he was done by undone by his own mismanagement. As Alabama started to wobble, Saban ditched the approach he had preached for 15 years and swiveled, in one offseason, in a fresh direction that reignited his program. He brought in Lane Kiffin, architect of offensive fireworks and off-the-field scandals, to bring his program into the 21st century. He put up with Kiffin’s antics, for as long as he could, for the championship payoff at the end.\nThat decision gave Saban’s Alabama a second wind. Kiffin was swiftly booted, but his ideas stayed, and national titles came rolling in with them. Belichick stayed wedded to what he knew, keeping things increasingly in-house once Brady headed to Florida. The answer to almost all problems: More Belichick.\nThere was a theory circulating in the 48 hours after the end of the season that Belichick could still reboot from within. That he could find outside voices to run the offense and the team could bring in a general manager to take over personnel control. But maniacal competitors like Belichick don’t often hand power back once they’ve received it. He wanted to go out on his terms, doing things his way – and he did.\nIf there’s to be a final act beyond the Patriots, Belichick the coach needs to break up with Belichick the executive.", "source_domain": "www.theguardian.com", "text": null, "title": "Like many great leaders, Bill Belichick was brought down by a failure to evolve", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/sport/2024/jan/11/like-many-great-leaders-bill-belichick-was-brought-down-by-a-failure-to-evolve"}