{"authors": ["Reged Ahmad", "Richard Luscombe", "Gloria Oladipo", "Martin Belam", "Mabel Banfield-Nwachi", "Adam Fulton"], "date_download": "2024-02-05 15:18:50", "date_modify": "None", "date_publish": "2024-01-11 02:33:11", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F10%2Fmiddle-east-crisis-live-updates-gaza-hamas-palestine-war-antony-blinken-houthi-airstrikes-red-sea-usa-uk-iran-rebels.json", "image_url": "https://i.guim.co.uk/img/media/2df45f5c3b891279e771c6896bc46f020ceeee67/0_97_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=0709c1426873f7b1711bb35aaddbfe76", "language": "en", "localpath": null, "maintext": "From 10 Jan 2024 23.40 CET UN security council approves resolution demanding end to Red Sea attacks The UN security council has just voted to approve a resolution drafted by the US and Japan to demand an end to attacks on commercial shipping in the Red Sea by Houthi rebels. The council voted down proposed amendments from Russia that would have weakened the resolution. The vote passed with 11 votes in favour, zero objections and four abstentions, including Russia, China and Algeria.\nUpdated at 00.38 CET\n11 Jan 2024 03.33 CET Summary of the day so far It’s 4:33am in Gaza, Tel Aviv and Beirut. This blog is now closing – but first – a summary of the day’s events so far: The UN security council has voted to approve a resolution drafted by the US and Japan to demand an end to attacks on commercial shipping in the Red Sea by Houthi rebels. The council voted down proposed amendments from Russia that would have weakened the resolution. The vote passed with 11 votes in favour, zero objections and four abstentions, including Russia, China and Algeria.\nThe head of Yemen’s Houthi supreme revolutionary committee, Mohammed Ali al-Houthi, has reacted to the UN resolution on navigation in the Red Sea. Al-Houthi said in a post on X that what Yemeni armed forces were doing comes within the framework of legitimate defence, and that any action they face will have a reaction. He also described the resolution as a “political game”. “We call on the Security Council to immediately release 2.3 Million people from the Israeli-American siege in Gaza,” he said.\nThe US secretary of state, Antony Blinken, has condemned attacks on commercial shipping in the Red Sea as “reckless and dangerous” during a meeting with Bahrain’s King Hamad bin Isa Al Khalifa in Manama, the penultimate stop of the diplomat’s whistle stop Middle East tour . Earlier on Wednesday he met the Palestinian Authority president, Mahmoud Abbas , in the West Bank, where they discussed “ongoing efforts to minimise civilian harm in Gaza, accelerate the delivery of humanitarian aid, end extremist violence, and work towards an independent Palestinian state”.\nThe Israeli prime minister, Benjamin Netanyahu, has posted on X his views about the future of Gaza . He says “I want to make a few points absolutely clear: Israel has no intention of permanently occupying Gaza or displacing its civilian population. Israel is fighting Hamas terrorists, not the Palestinian population, and we are doing so in full compliance with international law.” The comments come as the international court of justice case against Israel is set to get under way on Thursday.\nPramila Patten, the United Nations special representative on sexual violence, will visit Israel this month to look at allegations of rape and other sexual offences committed by Hamas fighters on and after 7 October. Patten has been granted investigative authority by Israel’s foreign ministry that will allow her to speak with survivors and released Israeli hostages who were raped or sexually assaulted. Her office portrayed the visit as an “information gathering mission”.\nThe Israeli Defense Forces chief of staff said no village in Lebanon was out of the military’s reach, after an escalation in violence between Israeli forces and the Iran-backed Hezbollah militant group based there. Herzi Halevi told a gathering of soldiers in Gaza that their actions in the besieged Palestinian territory had convinced him that they could take the fight into Lebanese territory if needed, AFP reported.\nThe World Health Organization (WHO) director general, Tedros Adhanom Ghebreyesus, said there were nearly “insurmountable obstacles” to delivering humanitarian aid to the Gaza Strip, saying the situation was “indescribable”. He said six planned missions to northern Gaza had been cancelled because Israel had rejected requests and not given assurances of safe passage, adding that a mission planned for today also had to be cancelled.\nBritain warned of severe consequences after US and UK warships were forced to repel a barrage of 20 Houthi rockets, drones and cruise missiles fired at ships in the Red Sea. American and British forces say they shot down 18 drones and three missiles on Tuesday. The Italian defense minister, Guido Crosetto , has said that Yemen’s Houthi attacks on Red Sea shipping must be stopped without triggering a new war.\nA total of 23,357 Palestinians have been killed and 59,410 have been injured in Israeli strikes on Gaza since 7 October, the Gaza health ministry said. The ministry, which is run by Hamas, said 147 Palestinians were killed and 243 injured in the past 24 hours. About 1.9 million people, or nearly 85% of the total population of Gaza, are estimated to have been displaced from their homes. Only 15 out of Gaza’s 36 hospitals are partially functional. Three hundred and thirty Palestinians have also been killed in the Israeli-occupied West Bank over the same period, including 84 children, and nearly 4,000 people have been injured by Israeli security forces during that time.\nThe IDF announced the death of another member of Israel’s troops inside Gaza, taking the total toll of the ground offensive to 186. The Israeli military has said that 1,065 of its soldiers have been injured in Gaza. Israel launched its military campaign after the 7 October surprise Hamas attack during which about 1,200 people were killed. An estimated 240 people were seized as hostages. About 130 are still believed to be in captivity. It has not been possible for journalists to independently verify the casualty counts being issued during the conflict.\nIsrael’s military claims to have “uncovered more than 15 underground tunnel shafts in the area” of Maghazi in central Gaza, where it says that its troops directed airstrikes that killed “several terrorists”. In Khan Younis , it claims that “in battles in the area over the last day, dozens of terrorist operatives were killed by IDF troops”, adding that “a total of approximately 150 terror targets were struck by IDF troops over the last day”. The claims have not been independently verified.\nIsrael ’s military has also said that it is has again struck at what it described as Hezbollah terrorist targets inside southern Lebanon.\nThe Palestinian news agency Wafa reported Israel detained a further 26 Palestinians in the Israeli-occupied West Bank. It brings the total number of detainees since 7 October to more than 5,780.\nIsraeli politician Nissim Vaturi reiterated his call for Gaza to be burned down, saying “there are no innocents there”. Referring to Palestinians still in northern Gaza after repeated orders from the Israeli military for them to flee, Vaturi said: “One hundred thousand remain. I have no mercy for those who are still there. We need to eliminate them.” The comments came ahead of a hearing on Thursday at the international court of justice, where South Africa has accused Israel of genocide in Gaza.\n11 Jan 2024 03.20 CET Here are some of the latest images coming out of the US secretary of state’s meeting the Palestinian Authority president Mahmoud Abbas, and with Israeli prime minister Benjamin Netanyahu on Wednesday. View image in fullscreen US secretary of state Antony Blinken stands and shakes hands with Palestinian President Mahmoud Abbas in Ramallah, during his week-long trip aimed at calming tensions across the Middle East. Photograph: Evelyn Hockstein/Reuters View image in fullscreen Mahmoud Abbas gestures as he sits with Antony Blinken. Photograph: AFP/Getty Images View image in fullscreen Antony Blinken shakes hands with Israeli prime minister Benjamin Netanyahu. Photograph: Chuck Kennedy/State Department/ZUMA Press Wire Service/REX/Shutterstock\n11 Jan 2024 02.57 CET The United Nations office for the coordination of humanitarian affairs (Ocha) has posted its latest update on the Israel-Gaza war. In their wide-ranging report they note the difficulty of delivering aid to Gaza: Between 1 and 10 January, only 14 per cent (3 of 21) planned aid deliveries of food, medicines, water, and other lifesaving supplies to the north of Wadi Gaza proceeded. Humanitarian partners were forced to cancel or delay missions in two instances due to excessive delays at Israeli checkpoints or because the agreed routes were unpassable. Humanitarian partners’ ability to respond to extensive needs in the northern side of Gaza is being curtailed by recurring denials of access for aid delivers and lack of coordinated safe access by the Israeli authorities. These denials and severe access constraints paralyze the ability of humanitarian partners to respond meaningfully, consistently and at-scale.\n11 Jan 2024 02.37 CET Martin Griffiths, the UN undersecretary-general for humanitarian affairs and emergency relief coordinator, has posted on X some reaction to the deaths of four employees with the Palestine Red Crescent’s ambulance crew. The Palestine Red Crescent Society has alleged in a statement that they were killed after Israel targeted an ambulance in the city of Deir al-Balah in Gaza. Griffiths says “The rules of war are clear: Parties must protect civilians, including humanitarian workers. These rules must be upheld.” Such devastating news. We mourn the loss of these brave colleagues.\nThe rules of war are clear: Parties must protect civilians, including humanitarian workers.\nThese rules must be upheld.\nThe fighting must end. https://t.co/MLtZSFHJBb — Martin Griffiths (@UNReliefChief) January 11, 2024\n11 Jan 2024 02.10 CET Yemen's Houthis respond to UN resolution The head of Yemen’s Houthi supreme revolutionary committee, Mohammed Ali al-Houthi, has reacted to the UN resolution on navigation in the Red Sea. The UN security council on Wednesday demanded Yemen’s Houthis immediately end attacks on ships in the Red Sea and implicitly endorsed a US-led taskforce that has been defending vessels while cautioning against escalating tensions. Al-Houthi said in a post on X that what Yemeni armed forces were doing comes within the framework of legitimate defence, and that any action they face will have a reaction. He also described the resolution as a “political game”. “We call on the Security Council to immediately release 2.3 Million people from the Israeli-American siege in Gaza,” he said. نطالب بأن يكف الكيان الإسرائيلي فورا عن جميع الهجمات التي تعيق الحياة واستمرارها في غزة وتقوض الحقوق والحريات والسلم والأمن الإقليميين\n. كما نطالب مجلس الامن بالإفراج فورا عن مليونين وثلاثمائة انسان من الحصار الإسرائيلي الامريكي الذي بات سلاحا قاتل وباتت غزة بسببه تمثل أكبر سجن… — محمد علي الحوثي (@Moh_Alhouthi) January 10, 2024\nUpdated at 03.27 CET\n11 Jan 2024 01.54 CET The Israeli military says it has found evidence that hostages were present in an underground tunnel in Gaza. Associated Press reports that the military showed the tunnel to journalists who were escorted into a neighbourhood near the ruins of destroyed homes and streets. It reports: A corrugated tin hut covered the tunnel’s entrance in a residential yard. A makeshift ladder led to the narrow underground pathway, about 2.5 meters (8 feet) below. The tunnel was hot and humid, with walls lined with concrete and electrical wires. Farther inside was a bathroom, where the military said it found evidence that hostages had been there, including their DNA. “Hostages were held here in this tunnel system,” said Rear Adm. Daniel Hagari, the army’s chief spokesperson. Hagari offered no details on what exactly was found in the tunnel, nor did he say when the hostages were there or identify them. He did not say if they were known to be dead or alive. In a later statement to the media, he said the captives were held in “difficult conditions,” without elaborating. International journalists have struggled to get into Gaza unless they embed with the Israeli military.\n11 Jan 2024 01.27 CET Some more analysis of the UN security council vote is coming through. The key provision of the resolution, sponsored by the US and Japan, noted the right of UN member states, in accordance with international law, “to defend their vessels from attack, including those that undermine navigational rights and freedoms.” Reuters is reporting that the provision amounted to an implicit endorsement of Operation Prosperity Guardian, a US-led multinational naval taskforce that has been defending commercial ships in the Red Sea and Gulf of Aden from Houthi missile and drone attacks. The Houthis, a group that seized much of Yemen in a civil war, have vowed to attack ships linked to Israel or bound for Israeli ports to show support for Hamas battling the Israeli offensive in Gaza. However, many of the targeted ships have had no links to Israel. The council voted after rejecting amendments proposed by Russia that would have stripped out the implicit endorsement of the US-led taskforce and included the war in Gaza among the “root causes” of the Houthi strikes, says Reuters. Russian Ambassador Vassily Nebenzia questioned the legitimacy of the taskforce and said the resolution as drafted was “an open-ended blessing of it.” The Houthi attacks have disrupted maritime commerce, prompting some shipping lines to divert vessels from the Red Sea to longer routes, threatening to increase energy and food prices. In the latest strikes, Washington said US and British warships on Tuesday shot down 21 drones and missiles fired by the Houthis at southern Red Sea shipping lanes in what London called the largest such attack in the area.\n11 Jan 2024 01.06 CET Let’s get more on the US secretary of state, Antony Blinken, and his meeting with the Palestinian Authority (PA) president, Mahmoud Abbas. Blinken pressed Abbas to reform his government, the Associated Press reports. In their meeting in the West Bank city of Ramallah, Blinken told Abbas that the US supports “tangible steps” toward a Palestinian state, according to state department spokesperson Matthew Miller. Blinken said later that they discussed reforming the Palestinian Authority so “it can effectively take responsibility for Gaza”. Abbas appeared ready to “engage in all of these efforts”, Blinken said at his next stop, the Bahraini capital of Manama. Abbas spokesperson Nabil Abu Rudeineh said they heard “good statements” from the Americans. “But nothing has happened,” he said. “The priority now is to stop the war on Gaza.”\nUpdated at 01.12 CET\n10 Jan 2024 00.44 CET Reuters is reporting some initial reaction from the Houthis to the UN security council vote. The security council has voted to approve a resolution drafted by the US and Japan to demand an end to attacks on commercial shipping in the Red Sea by Houthi rebels. The Houthi spokesperson in Yemen, Mohammed Abdul Salam, has described the resolution as a “political game”. The spokesperson has accused the US of violating international law, instead.\nUpdated at 00.45 CET\n10 Jan 2024 00.30 CET Reged Ahmad here picking up the blog from Richard Luscombe The Israeli prime minister, Benjamin Netanyahu, has posted on X a thread which includes his views about the future of Gaza. He says: I want to make a few points absolutely clear: Israel has no intention of permanently occupying Gaza or displacing its civilian population. Israel is fighting Hamas terrorists, not the Palestinian population, and we are doing so in full compliance with international law. The comments come as the international court of justice case against Israel is set to get under way on Thursday. Read the rest of Netanyahu’s thread here: \"I want to make a few points absolutely clear:\nIsrael has no intention of permanently occupying Gaza or displacing its civilian population.\nIsrael is fighting Hamas terrorists, not the Palestinian population, and we are doing so in full compliance with international law. pic.twitter.com/amxFaMnS0P — Prime Minister of Israel (@IsraeliPM) January 10, 2024\nUpdated at 00.34 CET\n10 Jan 2024 00.08 CET Summary of the day: It’s 1:08am on Thursday in Gaza City, Tel Aviv and Beirut. Here’s where things stand in the Middle East crisis: The US secretary of state, Antony Blinken, has condemned attacks on commercial shipping in the Red Sea as “reckless and dangerous” during a meeting with Bahrain’s King Hamad bin Isa Al Khalifa in Manama, the penultimate stop of the diplomat’s whistle stop Middle East tour . Earlier on Wednesday he met the Palestinian Authority president, Mahmoud Abbas , in the West Bank, where they discussed “ongoing efforts to minimise civilian harm in Gaza, accelerate the delivery of humanitarian aid, end extremist violence, and work towards an independent Palestinian state”.\nThe UN security council has voted to approve a resolution drafted by the US and Japan to demand an end to attacks on commercial shipping in the Red Sea by Houthi rebels. The council voted down proposed amendments from Russia that would have weakened the resolution. The vote passed with 11 votes in favour, zero objections and four abstentions, including Russia, China and Algeria.\nPramila Patten, the United Nations special representative on sexual violence, will visit Israel this month to look at allegations of rape and other sexual offences committed by Hamas fighters on and after 7 October. Patten has been granted investigative authority by Israel’s foreign ministry that will allow her to speak with survivors and released Israeli hostages who were raped or sexually assaulted. Her office portrayed the visit as an “information gathering mission”.\nThe Israeli Defense Forces chief of staff said no village in Lebanon was out of the military’s reach, after an escalation in violence between Israeli forces and the Iran-backed Hezbollah militant group based there. Herzi Halevi told a gathering of soldiers in Gaza that their actions in the besieged Palestinian territory had convinced him that they could take the fight into Lebanese territory if needed, AFP reported.\nThe World Health Organization (WHO) director general, Tedros Adhanom Ghebreyesus, said there were nearly “insurmountable obstacles” to delivering humanitarian aid to the Gaza Strip, saying the situation was “indescribable”. He said six planned missions to northern Gaza had been cancelled because Israel had rejected requests and not given assurances of safe passage, adding that a mission planned for today also had to be cancelled.\nThe British defense secretary, Grant Shapps, hinted there could be further western military action against the Houthis in Yemen, telling reporters to “watch this space” when asked about possible further action after last night’s drone attack in the Red Sea.\nBritain warned of severe consequences after US and UK warships were forced to repel a barrage of 20 Houthi rockets, drones and cruise missiles fired at ships in the Red Sea. American and British forces say they shot down 18 drones and three missiles on Tuesday. The Italian defense minister, Guido Crosetto , has said that Yemen’s Houthi attacks on Red Sea shipping must be stopped without triggering a new war.\nA total of 23,357 Palestinians have been killed and 59,410 have been injured in Israeli strikes on Gaza since 7 October, the Gaza health ministry said. The ministry, which is run by Hamas, said 147 Palestinians were killed and 243 injured in the past 24 hours. About 1.9 million people, or nearly 85% of the total population of Gaza, are estimated to have been displaced from their homes. Only 15 out of Gaza’s 36 hospitals are partially functional. Three hundred and thirty Palestinians have also been killed in the Israeli-occupied West Bank over the same period, including 84 children, and nearly 4,000 people have been injured by Israeli security forces during that time.\nThe IDF announced the death of another member of Israel’s troops inside Gaza, taking the total toll of the ground offensive to 186. The Israeli military has said that 1,065 of its soldiers have been injured in Gaza. Israel launched its military campaign after the 7 October surprise Hamas attack during which about 1,200 people were killed. An estimated 240 people were seized as hostages. About 130 are still believed to be in captivity. It has not been possible for journalists to independently verify the casualty counts being issued during the conflict.\nIsrael’s military claims to have “uncovered more than 15 underground tunnel shafts in the area” of Maghazi in central Gaza, where it says that its troops directed airstrikes that killed “several terrorists”. In Khan Younis , it claims that “in battles in the area over the last day, dozens of terrorist operatives were killed by IDF troops”, adding that “a total of approximately 150 terror targets were struck by IDF troops over the last day”. The claims have not been independently verified.\nIsrael ’s military has also said that it is has again struck at what it described as Hezbollah terrorist targets inside southern Lebanon.\nThe Palestinian news agency Wafa reported Israel detained a further 26 Palestinians in the Israeli-occupied West Bank. It brings the total number of detainees since 7 October to more than 5,780.\nIsraeli politician Nissim Vaturi reiterated his call for Gaza to be burned down, saying “there are no innocents there”. Referring to Palestinians still in northern Gaza after repeated orders from the Israeli military for them to flee, Vaturi said: “One hundred thousand remain. I have no mercy for those who are still there. We need to eliminate them.” The comments came ahead of a hearing on Thursday at the international court of justice, where South Africa has accused Israel of genocide in Gaza.\nUpdated at 00.16 CET\n10 Jan 2024 23.50 CET Barbara Woodward, the UK ambassador to the UN, welcomed the passing of the resolution. She said: The UK condemns in the strongest terms the illegal and unjustified attacks in the Red Sea by Houthi militants. Yesterday, the Houthis attempted their largest attack yet, launching at least 21 missiles and drones towards international shipping lanes. Fifteen percent of all global seaborne trade passes through the Red Sea. These attacks threatened to spike the availability and prices of food and energy, which would inevitably hit the world’s poorest, the hardest. Yesterday’s was the 26th such attack since the 19th of November. This was despite the council’s demand on the first of December for the Houthis to stop all such attacks immediately. On 3 January, the UK joined 11 countries in a statement warning against further attacks. So we’re using all diplomatic means possible to deter these attacks. And that is why we voted in favor of this resolution.\nUpdated at 23.55 CET\n10 Jan 2024 23.47 CET Here are details of the resolution just passed by the UN security council demanding an end to attacks on Red Sea shipping, courtesy of the independent security council report. It says language specifically referencing Gaza that Algeria and Russia apparently proposed was not accommodated, and the draft resolution was updated to emphasize the need to address “the root causes, including the conflicts contributing to regional tensions and the disruption of maritime security”. Russia and Algeria were two of the abstentions in the security council vote.\nUpdated at 23.49 CET\n10 Jan 2024 23.40 CET UN security council approves resolution demanding end to Red Sea attacks The UN security council has just voted to approve a resolution drafted by the US and Japan to demand an end to attacks on commercial shipping in the Red Sea by Houthi rebels. The council voted down proposed amendments from Russia that would have weakened the resolution. The vote passed with 11 votes in favour, zero objections and four abstentions, including Russia, China and Algeria.\nUpdated at 00.38 CET\n10 Jan 2024 22.42 CET Two videos from the West Bank showing Israeli troops shooting a 17-year-old boy and security forces repeatedly running over the body of a man they had shot have added to concerns about the Israeli military’s rules of engagement, the Guardian’s Emma Graham-Harrison reports from Jerusalem. The shooting of 17-year-old Osaid Rimawi in the early hours of last Friday is shown in footage from a security camera in a local shop that was obtained by the Associated Press news agency. The video also shows two earlier rounds of gunfire that injured two unarmed men. Rimawi was killed when he tried to rush to their aid. The only weapons visible in the footage are guns held by Israeli soldiers. Soldiers gathered round the dead and injured bodies; one prodded Rimawi with his foot, then drove away. They did not make any arrests. 00:01:43 Video appears to show Israeli army shooting Palestinians without provocation – report The Israeli military said troops in Beit Rima had opened fire on suspects who had thrown explosives and firebombs, AP reported. Local residents said the killings were unprovoked, and no one had thrown explosives. The Israeli military has repeatedly been accused of using deadly violence without provocation. Most of the victims have been Palestinians, but they include three Israeli hostages, who were killed after they escaped Hamas captivity in December. They were bare-chested, waving white flags and at least one was shouting in Hebrew. Earlier this week, footage from Gaza emerged that appeared to show a sniper killing a woman as she led a column of civilians trying to reach a safe zone in November. She was waving a white flag and walking beside a young child. Read the full story here: West Bank videos show Israeli troops killing teenager and driving over man’s body Read more\nUpdated at 23.10 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli prime minister says “no intention of permanently occupying Gaza” - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/10/middle-east-crisis-live-updates-gaza-hamas-palestine-war-antony-blinken-houthi-airstrikes-red-sea-usa-uk-iran-rebels"}