{"authors": ["Chris Mcgreal"], "date_download": "2024-02-05 15:18:51", "date_modify": "None", "date_publish": "2024-01-11 17:12:46", "description": "Letter to US president says more reporters have been killed in Gaza war since October than in any single country over an entire year", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F11%2Fbiden-israel-gaza-war-killing-reporters-press-freedom.json", "image_url": "https://i.guim.co.uk/img/media/96952cd1c6516b90017897115bb0d5bdd0f4d022/0_21_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c154d96cd263b947c1a039402895800d", "language": "en", "localpath": null, "maintext": "Leading press freedom groups and human rights organisations have called on Joe Biden to do more to pressure Israel to “abide by international law” amid accusations that its military is targeting journalists in the Gaza war, and to hold it to account for the killings of reporters.\nThe Committee to Protect Journalists, Human Rights Watch, Freedom House and other groups said in a letter to the US president that more media workers have been killed in the conflict since the Hamas attack on 7 October than in any single country over an entire year.\nThe CPJ calculates that at least 79 journalists have died, mostly Palestinians and almost all at the hands of the Israel Defense Forces (IDF), although four Israeli reporters were killed in the Hamas cross-border attack.\n“The US state department spokesperson recently said that the United States has not seen any evidence that Israel is intentionally targeting journalists,” the letter said.\nBut the groups noted “credible reports” by human rights and media organisations that the Israeli military was responsible for the deaths of several journalists, including “deliberately targeting a car in which journalists were traveling on January 7, killing two journalists and seriously injuring a third”.\nThe IDF initially claimed it was targeting a “terrorist” in the car who had been flying a camera drone that posed a threat to its soldiers. But it later backtracked and said that using a drone made the journalist “look like the terrorists”, even though the camera drones are commonly used by media organisations.\nThe letter to Biden said that in other cases “journalists reported receiving threats from Israeli officials and IDF officers before their family members were killed in Gaza”.\n“Of course, the targeted or indiscriminate killing of journalists, if committed deliberately or recklessly, is a war crime, and the international criminal court has said that it will investigate reports of war crimes committed against journalists in Gaza,” the letter said.\nThe letter noted the “longstanding pattern of impunity in the killings of journalists by the IDF”, including over the shooting death last year of the Al Jazeera reporter Shireen Abu Akleh, a US citizen.\nIsraeli authorities falsely claimed Abu Akleh was killed by the Palestinians but then admitted it was “highly probable” she was killed by the IDF during a gun battle. Footage of the incident showed there was no such battle. A group of Democratic members of the US Senate said Abu Akleh may have been targeted by the Israeli army because she was a journalist.\nThe letter said Biden should use the US’s record of strong support for Israel to pressure its government to abide by international humanitarian law.\n“As such, the United States will be judged on how it has used that influence to ensure that all parties to the conflict abide by international law. Integral to this is the protection of journalists, not only because journalists are civilians, but also because they play an indispensable role in documenting and reporting on war crimes and other human rights violations,” it said.\n“We believe your administration can and must do more to effectively pursue accountability for journalists killed in the hostilities and to protect and support local and international journalists covering it.”\nThe letter urged Biden to “abjure the indiscriminate and deliberate killing of journalists, promptly and thoroughly investigate all attacks on journalists, and hold accountable individuals found to be responsible for them”.\nThe groups also asked the president to pressure Israel to permit journalists to enter Gaza and report freely on the war after months of almost all foreign reporters being blocked from the Palestinian territory.\nIsrael often boasts it has a free press but the letter noted censorship restricting reporting on legitimate matters of public concern and threats by the government “against the country’s oldest newspaper, Haaretz, for its coverage of the war, and threatening to shut down local bureau offices of foreign news agencies”.", "source_domain": "www.theguardian.com", "text": null, "title": "Press freedom groups urge Biden to hold Israel accountable for killings of journalists", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/11/biden-israel-gaza-war-killing-reporters-press-freedom"}