{"authors": ["Yelena Mandenberg", "Image", "Getty Images", "Anadolu Via Getty Images"], "date_download": "2024-02-05 15:18:53", "date_modify": "None", "date_publish": "2024-01-11 23:58:11", "description": "The US and UK are now launching strikes against Yemen's Houthi rebel force in the Red Sea, after dozens of attacks on trade ships in the last two months", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fbreaking-britain-bombs-yemen-after-31863438.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31863499.ece/ALTERNATES/s1200/0_SDC_MDG_CHP_60528JPEG.jpg", "language": "en", "localpath": null, "maintext": "The US and UK are now launching strikes against Yemen's Houthi rebel force in the Red Sea, after dozens of attacks on trade ships in the last two months\nThe US and UK are launching strikes against Yemen's Houthi rebels in the Red Sea, four U.S. officials have said tonight.\nThe U.S. and British militaries were bombing more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike.\nWarship-launched Tomahawk missiles and fighter jets were used, according to several U.S. officials. The military targets included logistical hubs, air defense systems and weapons storage locations, they said.\nA tweet from an Al-Arabiya reporter confirmed that the Houthis have launched \"ballistic missiles at American military targets in the Red Sea\" in response.\nA Houthi official has also confirmed that strikes have begun in Yemen. \"Now America, Britain and Israel are launching raids on Hodeidah and Sanaa,\" Houthi Major General Abdulsalam Jahaf said. \"We will discipline them God willing,\" Jahaf added.\nREAD MORE: UK and US 'set to launch military strikes against Houthi rebels' as Sunak summons Cabinet\nImage: Getty Images) Getty Images)\nThe strikes marked the first U.S. military response to what has been a persistent campaign of drone and missile attacks on commercial ships since the start of the Israel-Hamas.\nBritain’s participation in the strikes underscored the Biden administration’s effort to use a broad international coalition to battle the Houthis, rather than appear to be going it alone.\nThe White House released a statement tonight, explaining: \"Today, at my direction, U.S. military forces—together with the United Kingdom and with support from Australia, Bahrain, Canada, and the Netherlands—successfully conducted strikes against a number of targets in Yemen used by Houthi rebels to endanger freedom of navigation in one of the world’s most vital waterways.\"\n\"These strikes are in direct response to unprecedented Houthi attacks against international maritime vessels in the Red Sea—including the use of anti-ship ballistic missiles for the first time in history. These attacks have endangered U.S. personnel, civilian mariners, and our partners, jeopardized trade, and threatened freedom of navigation.\"\nAre you concerned about the strike action against Houthi rebel targets? Vote in our poll HERE to have your say.\nTwo residents of Hodieda, Amin Ali Saleh and Hani Ahmed, said they heard five strong explosions hitting the western port area of the city, which lies on the Red Sea and is the largest port city controlled by the Houthis. Explosions also were heard by residents of Taiz, a southwestern city near the Red Sea.\nSanaa is Yemen's capital and largest city, while Hodeidah is home to the country's principal port on the Red Sea. Houthi rebels seized control of the city in 2014.\nYemen’s Houthi rebels fired their largest-ever barrage of drones and missiles targeting shipping in the Red Sea last Tuesday, forcing the United States and British navies to shoot down the projectiles in a major naval engagement, authorities said Wednesday. No damage was immediately reported.\nImage: Flightradar24) Flightradar24)\nHowever, the attack prompted a joint statement from the White House last week in warning: \"The Houthis will bear the responsibility of the consequences should they continue to threaten lives, the global economy, and free flow of commerce in the region's critical waterways.\"\nOn Thursday, the Houthis fired an anti-ship ballistic missile into the Gulf of Aden, which was seen by a commercial ship but did not hit the ship.\nIn response to the raids carried on early Friday morning, Houthi official Abdul Qader al-Mortada said on X: “American-Zionist-British aggression against Yemen launches several raids on the capital, Sanaa, Hodeidah governorate, Saada, and Dhamar.\"\nA congresswoman from Oregon noted that, \"These airstrikes have NOT been authorized by Congress. The Constitution is clear: Congress has the sole authority to authorize military involvement in overseas conflicts.\"\n\"Every president must first come to Congress and ask for military authorization, regardless of party,\" continued Val Hoyle.\nThe Prime Minister briefed top ministers on the escalating situation after a string of attacks on ships in the Red Sea. Foreign Secretary David Cameron was seen entering No10 just before 8 pm and Commons Speaker Sir Lindsay Hoyle was also summoned to a Whitehall briefing.\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nThe rebels, who have carried out 27 attacks involving dozens of drones and missiles just since Nov. 19, said Thursday that any attack by American forces on its sites in Yemen will spark a fierce military response.\n“The response to any American attack will not only be at the level of the operation that was recently carried out with more than 24 drones and several missiles,” said Abdel Malek al-Houthi, the group’s supreme leader, during an hour-long speech. “It will be greater than that.”\nThe Houthis say their assaults are aimed at stopping Israel’s war on Hamas in the Gaza Strip. But their targets increasingly have little or no connection to Israel and imperil a crucial trade route linking Asia and the Middle East with Europe.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nYesterday, The U.N. Security Council demanded an immediate halt to attacks by Yemen’s Houthi rebels on ships in the Red Sea in a resolution adopted Wednesday that implicitly condemned their main weapons supplier -- Iran.\nThe UN condemned \"in the strongest terms\" at least two dozen attacks carried out by the Houthis on merchant and commercial vessels, which the resolution says are impeding global commerce and undermining navigational freedom.\nMore than 20 nations are already participating in a U.S.-led maritime mission to increase ship protection in the Red Sea.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Britain bombs Yemen after Houthi rebels attack vessels in Red Sea, officials report", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/breaking-britain-bombs-yemen-after-31863438"}