{"authors": ["Claudia Aoraha", "Senior Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:18:55", "date_modify": "None", "date_publish": "2024-01-11 19:54:25", "description": "Joint US and British forces shot down 18 drones and three missiles launched by the Houthis late Tuesday in what London described as their biggest attack so far in solidarity with Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12953259%2FUS-UK-airstrikes-against-Iran-backed-Houthi-rebels-Yemen.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/11/19/79906829-0-The_Houthi_military_helicopter_flies_over_the_Galaxy_Leader_carg-a-53_1705002776342.jpg", "language": "en", "localpath": null, "maintext": "The US and the UK are ready to carry out airstrikes against the Iranian-backed Houthi rebels in Yemen as early as tonight - after both countries warned there could be consequences if ships are continually targeted in the Red Sea.\nJoint US and British forces shot down 18 drones and three missiles launched by the Houthis late Tuesday, in what was described as their biggest attack so far in solidarity with Palestinians in Hamas-ruled Gaza.\nAntony Blinken warned of 'consequences' if the Houthi do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels.\nIt comes at a fraught time for the US - as Defense Secretary Lloyd Austin is reeling from his prostate cancer operation. He has been in hospital for over a week.\nDeputy Secretary of Defense Kathleen Hicks has assumed his duties during his absence, but The Pentagon has faced backlash following news that the public, nor President Biden, were informed until days into Austin's hospital stay.\nThe Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in November. Joint US and British forces shot down 18 drones and three missiles launched by the Houthis late Tuesday, in what was described as their biggest attack so far in solidarity with Palestinians in Hamas-ruled Gaza\nArmed demonstrators take part in a solidarity rally with Gaza in the rebel-held Yemeni capital Sanaa. Antony Blinken warned of 'consequences' if the rebels do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels\nThe Houthis, based in Yemen, have been firing rockets, drones and missiles north towards Israel, interrupting Red Sea shipping\nSources inside London's Whitehall have confirmed that Prime Minister Rishi Sunak is ready to sign off military reprisals against the Houthis, who have repeatedly attacked merchant shipping in the Red Sea.\nIf a coalition attack is launched overnight Thursday, it would come seven days after the Western allies sounded their 'final warning' to the rebel group.\nThe rebels say their assaults are aimed at stopping Israel's war on Hamas in the Gaza Strip. But their targets are increasingly random, raising the risk of a US retaliatory strike on Yemen.\nThe US has set up a multinational naval task force to protect shipping from the attacks, which Blinken on Wednesday said were 'aided and abetted' by Iran.\nSo far, the Biden administration has not been too forceful in their resolutions in a bid to avoid an all-out war in the fraught region, security officials said previously.\nPentagon spokesperson Brig Gen Pat Ryder said at a news conference in Washington DC: 'I'm not going to telegraph, forecast or speculate on any potential future operations.\n'And I think that statement from multiple nations when it comes to the fact that there will be consequences – should the attacks not stop – speaks for itself.\n'And I'll just leave it at that.'\nAsked about potential US strikes against the Houthis in Yemen, the national security spokesperson, John Kirby, said: 'I'm not going to telegraph our punches one way or another here.\n'We're gonna do what we have to do, to counter and defeat these threats that the Houthis keep throwing up on commercial shipping in the Red Sea.'\nOn Wednesday, the United Nations Security Council passed a resolution on demanding an immediate end to the Houthi attacks.\nSecretary of State Blinken was in Bahrain on Wednesday as part of his week-long tour aimed at working on the Middle East crisis.\nPentagon spokesperson Brig Gen Pat Ryder said at a news conference in Washington DC: 'I'm not going to telegraph, forecast or speculate on any potential future operations. And I think that statement from multiple nations when it comes to the fact that there will be consequences – should the attacks not stop – speaks for itself. And I'll just leave it at that'\nYemenis recently militarily trained by the Houthi movement hold their guns and chant slogans as they take part in an armed popular parade held in Al-Sabeen Square to get ready to go and fight Israel in the Gaza Strip, on December 2\nAn armed Houthi fighter walks through the beach with the Galaxy Leader cargo ship in the background, seized by the Houthis offshore of the Al-Salif port, on December 5\nHouthi fighters open the door of the cockpit on the Galaxy Leader ship's deck in the Red Sea in November\nA Yemeni passes a banner depicting the Israeli and US flags on the deck of he Galaxy Leader cargo ship, seized by the Houthis offshore of the Al-Salif port on the Red Sea in the province of Hodeidah, Yemen, on December 5\nIn the UK, Defense Secretary Grant Shapps said on Thursday: 'Be in no doubt at all, Iran is guiding what is happening there in the Red Sea, providing them not just with equipment to carry out those attacks but also often with the eyes and ears to allow those attacks to happen.\n'We must be clear with the Houthis, that this has to stop and that is my simple message to them today, and watch this space.'\nIn response to the growing tensions, the leader of Yemen's Iran-backed Houthi rebels threatened on Thursday the United States and Britain with even larger attacks in the Red Sea after their navies intercepted a major one.\n'Any American aggression will never go without a response,' rebel leader Abdulmalik al-Huthi said in speech broadcast live by the Houthi's Al-Masirah television.\n'The response to any American attack will not only be at the level of the operation that was recently carried out... but it will be greater than that.'\nThe rebels said Tuesday's attack was in retaliation for the US Navy's killing of 10 Houthi fighters on December 31 as they attempted to board a merchant vessel passing through the Red Sea off the coast of Yemen.\nPictured: A F35 jet has maintenance carried out on deck\nHMS Diamond, a £1billion Type 45 destroyer known as the jewel of the Royal Navy, shot down the targets with a barrage of sea viper missiles - which travel three times the speed of sound\nPersonnel onboard HMS Diamond shoot down drones fired by Iranian-backed Houthi rebels\nPersonnel onboard HMS Diamond shoot down drones fired by Iranian-backed Houthi rebels\nHouthi fighters overthrew the Yemeni government in 2014 - which led Saudi Arabia to mount a military campaign against the rebels.\nBut the October 7 attacks on Israel have spurred them to start attacking Israeli, UK and US ships within the fraught Middle Eastern waters.\nThe UN Security Council on Wednesday adopted a resolution that demanded the Houthis 'immediately cease' their attacks.\nThe Houthi campaign, which the rebels say only targets vessels linked to Israel or its allies, has caused major disruption with many shipping firms opting for a much longer route around the tip of Africa for security concerns.\nWashington says more than 20 nations have joined the US-led Operation Prosperity Guardian to protect the vital sea lane which usually carries about 12 percent of maritime trade.\nAntony Blinken, the Secretary of State, is seen on Wednesday on board his plane during his week-long Middle East trip\nThe Houthi leader said that 'there is no problem for the Europeans, China and the whole world to pass through the Red Sea.'\n'The only and exclusive target are ships linked to Israel.'\nBut he added that any government that joins the military action against the rebels' naval forces would face reprisals.\n'Whoever wants to get involved, attack our dear people and target the naval forces is actually risking their fleet and commercial ships,' Houthi warned.\n'We hope that the rest of the Arab and Islamic countries will never get involved with the Americans, the Israelis and the British.'\nVessels passing Yemen have come under frequent assault from Houthi rebels since Israel launched its offensive in Gaza following the October 7 terror attack by the Hamas group.\nShipping companies have responded by rerouting their vessels around South Africa to avoid the risk posed in the strait at a cost of $1,020,020 per boat.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US and the UK 'to carry out airstrikes against Iran-backed Houthi rebels in Yemen TONIGHT': White House earlier warned of 'consequences' after cargo ships targeted in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12953259/US-UK-airstrikes-against-Iran-backed-Houthi-rebels-Yemen.html?ns_mchannel=rssns_campaign=1490ito=1490"}