{"authors": [], "date_download": "2024-02-05 15:18:57", "date_modify": "None", "date_publish": "2024-01-11 23:52:24", "description": "U.S. and British militaries are bombing more than a dozen sites used by the Iranian-backed Houthis in Yemen, in a massive retaliatory strike using warship-launched Tomahawk missiles", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhouthis-ap-british-tomahawk-israel-b2477386.html.json", "image_url": "https://static.independent.co.uk/2024/01/03/23/United_States_Red_Sea_Attacks_57228.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. and British militaries were bombing more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike using warship-launched Tomahawk missiles and fighter jets, several U.S. officials told The Associated Press. The military targets included logistical hubs, air defense systems and weapons storage locations, they said.\nThe strikes marked the first U.S. military response against the Houthis for what has been a persistent campaign of drone and missile attacks on commercial ships since the start of the war in Israel. And the coordinated military assault comes just a week after the White House and a host of partner nations issued a final warning to the Houthis to cease the attacks or face potential military action. The officials confirmed the strikes on condition of anonymity to discuss military operations.\nThe warning appeared to have had at least some short-lived impact, as attacks stopped for several days. On Tuesday, however, the Houthi rebels fired their largest-ever barrage of drones and missiles targeting shipping in the Red Sea, with U.S. and British ships and American fighter jets responding by shooting down 18 drones, two cruise missiles and an anti-ship missile. And on Thursday, the Houthis fired an anti-ship ballistic missile into the Gulf of Aden, which was seen by a commercial ship but did not hit the ship.\nThe rebels, who have carried out 27 attacks involving dozens of drones and missiles just since Nov. 19, said Thursday that any attack by American forces on its sites in Yemen will spark a fierce military response.", "source_domain": "www.independent.co.uk", "text": null, "title": "US, British militaries launch massive retaliatory strike against Iranian-backed Houthis in Yemen", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/houthis-ap-british-tomahawk-israel-b2477386.html"}