{"authors": ["David Averre"], "date_download": "2024-02-05 15:18:58", "date_modify": "None", "date_publish": "2024-01-11 09:11:08", "description": "Children's rights organisation Bris said its phone operators reported a huge uptick in the number of callers worried about war coming to Sweden", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12950677%2FPanicked-Swedish-youths-flood-helpline-calls-minister-warned-war-urged-people-prepare-conflict-face-Russia-tensions-row-breaks-alarming-speech.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/10/13/79842007-0-image-m-53_1704893751684.jpg", "language": "en", "localpath": null, "maintext": "Minister urged Swedish citizens to ask themselves 'who are you if war comes?'\nSweden's mental health helplines have been flooded with calls from youths scared by the prospect of war after top defence officials said citizens must ready themselves for a potential armed conflict.\nChildren's rights organisation Bris said its phone operators reported a huge uptick in the number of callers worried about war coming to Sweden, with spokeswoman Maja Dahl slamming the government's apparent lack of preparation around the alarming announcement made at the weekend.\nSpeaking at Sweden's annual 'Folk och Försvar' (Society and Defence) conference in Sälen this past weekend, Sweden's civil defence minister declared 'war could come to Sweden' and urged citizens to join voluntary defence organisations.\nCarl-Oskar Bohlin's eyebrow-raising statements were echoed by Defence Minister Pål Jonson and military chief Gen. Micael Byden.\n'This was well prepared, it wasn't something blurted out... They should have provided information meant for kids when they come out with this kind of information for grown-ups,' Dahl told the BBC.\nOpposition politicians were also quick to criticise, with former prime minister Magdalena Andersson declaring: 'It's not as if war is just outside the door,' in comments to Swedish media outlets.\nBut Bohlin's rousing speech, in which he took note of his country's hotly anticipated accession to NATO this year and called on ordinary citizens to ask themselves 'who are you if war comes?', has largely been received as an uncomfortable, but necessary recognition of the uncertain security landscape facing Europe amid mounting conflicts worldwide.\nThe gunner on a camouflaged tracked carrier shoots his .50 machine gun during the Northern Wind exercise conducted by Swedish Army\nA camouflaged tracked carrier sits by a snowdrift during the Northern Wind exercise conducted by Swedish Army in cooperation with allied armies, in the north-eastern part of Sweden\nSwedish and Finnish tanks are seen during a military exercise called 'Cold Response 2022'\nA soldier of the P18 Gotland Regiment of the Swedish Army walks past armoured vehicles during a field exercise near Visby on the Swedish island of Gotland\nSwedish soldiers take part in NATO's 'Cold Response 2022' military exercises\nSweden's Minister for Civil Defence Carl-Oskar Bohlin speaks during the Society and Defence National Conference in Salen, Sweden, 07 January 2023\nSweden's Commander-in-Chief Micael Byden speaks during his talk at today's program at the Society and Defense Conference in Salen, on January 8, 2024\n'There could be war in Sweden... The world is facing a security outlook with greater risks than at any time since the end of the Second World War,' the civil defence minister said.\n'Are you a private individual? Have you considered whether you have time to join a voluntary defence organisation? If not: get moving!'\nBohlin did not claim that the prospect of war is imminent in Sweden in his weekend speech.\nBut he stressed the current state of the world and rising tensions between East and West necessitated a response at all levels to ensure Swedish society would be prepared for any future conflict.\nUsing Ukraine's valiant and effective defence of Kyiv in the early days of the war in March 2022 as an example, Bohlin said his nation must fast-track its efforts to bring about civil preparedness and become a war-ready society.\nIt came as Ukrainian President Volodymyr Zelensky warned that Vladimir Putin would not stop at Ukraine and would attack other neighbours unless allies joined forces to stop him.\n'He (Putin) won't finish this (war), until we all finish him together,' Zelensky said during a news conference in Vilnius, adding 'Lithuania, Latvia, Estonia, Moldova may be next' if Ukraine did not withstand Russia's onslaught.\nSwedish Army armoured vehicles and tanks participate in a military exercise called 'Cold Response 2022', gathering around 30,000 troops from NATO member countries as well as Finland and Sweden, amid Russia's invasion of Ukraine\nSoldiers of the P18 Gotland Regiment of the Swedish Army camouflage their armoured vehicles during a field exercise near Visby on the Swedish island of Gotland on May 17, 2022\nUS and Swedish troops evacuate a wounded comrade as they take part of a war simulation\nUkrainian President Volodymyr Zelensky attends a joint press conference after a meeting with the Lithuanian president in Vilnius, Lithuania, 10 January 2024\nUkrainian President Volodymyr Zelensky warned that Vladimir Putin would not stop at Ukraine and will attack other neighbours unless allies joined forces to stop him\nBohlin told the defence conference: 'Putin didn't understand that he was kicking down that door within every Ukrainian in 2014. By the time of the full-scale invasion in February 2022, the Ukrainian people had – individually and collectively – been formulating their response...\n'The Russian attacking forces faced the unified force of the entire Ukrainian society. This kind of effort can only come about quickly enough if the vast majority are aware of the situation and understand what is at stake.\n'Societal resilience requires exactly that: situational awareness... Awareness must be translated into practical action. Measures that actually raise the threshold.\n'Everyone has to understand that in the situation we find ourselves in, time may be our most precious non-renewable resource. If there is one thing that keeps me awake at night, it is the feeling that things are moving too slowly,' he said.\nBohlin went on to directly address everyone from local government officials to individual citizens and encouraged them to take steps to prepare themselves.\n''I don't know what I'm supposed to do!'', I sometimes hear. Let me respond with a few questions.\n'Are you a senior official in an emergency preparedness authority? Good, then have you built your war organisation and defined which activities need to be maintained and which do not? Have you ensured compliance with protective security and necessary access to alternative command locations?\n'Are you a municipal commissioner? Good, then have you secured the war organisation, refuge points, the emergency water plan and the redundancy supply of foodstuffs, heating and electricity for health and social care?\n'Are you an employee? Good, then have you asked your employer what your role would be in your workplace's war organisation?\n'Are you a private individual? Good, then have you taken responsibility for your home preparedness? Have you considered whether you have time to join a voluntary defence organisation?'\nEach address was ended with a simple call to action - 'get moving!'.\nSwedish Defence Minister Pål Jonson issued a similar warning to that of Bohlin on Monday, arguing that conflicts in Ukraine and the Middle East showed that 'the world has become more dangerous than it was just a year ago'\nLocal residents throw furniture out the window of a destroyed high-rise building following a Russian missile attack in central Kyiv, on January 3, 2024\nUtility workers repair water pipes outside a high-rise building destroyed following a Russian missile attack in central Kyiv, on January 3, 2024, amid the Russian invasion of Ukraine\nRussian President Vladimir Putin gestures as he speaks during his meeting with residents of Chukotka autonomous okrug, on January 10, 2024 in Anadyr, Russia. President Putin is having a trip to Siberian and Far Eastern regions prior to the 2024 Presidential Elections\n'If you haven't started, you are behind – if you don't know how, you can either ask someone who has started, or get answers from the Swedish Civil Contingencies Agency. It's as simple as that,' Bohlin concluded.\nSwedish Defence Minister Pål Jonson issued a similar warning on Monday, arguing that conflicts in Ukraine and the Middle East showed that 'the world has become more dangerous than it was just a year ago'.\n'An armed attack against Sweden cannot be ruled out,' Jonson said.\n'War can also come to us. These serious times require clarity of vision, capacity to act and persistence - clarity of vision to understand that Russia's goal remains the eradication of a free Ukraine and creation of a Europe in which ''might is right'' with buffer states and spheres of interest.'\nWhile the warnings come amid Russia's invasion of Ukraine, and the ongoing threat to other European nations, Sweden has already had its share of domestic issues that have fractured the stability of the country in recent years.\nIn September, Sweden's national police chief said that wars between gangs in the country had brought an 'unprecedented' wave of violence.\n'There have recently been murders and explosions on an unprecedented scale,' police chief Anders Thornberg told a press conference.\nHe emphasised that the perpetrators were often from abroad, but he didn't mention any nationalities.\nIn August, the country was forced to heighten its terror level to four on a scale of five following fury from the Muslim world to Koran burnings that took place over the summer, shortly after it was forced to beef up its border controls.\nThe level was increased from 'elevated', where it had been since 2016, to 'high', the head of the Swedish Security Police Charlotte von Essen told reporters.\n'The reason for this decision is the deteriorated situation with regard to attack threats to Sweden, and the assessment that the threat will remain for a long time,' she said.\nVon Essen stressed that the decision to raise the threat level was not based on a 'single incident', but rather a 'collective assessment'.\nIn July, Iraqi protesters stormed the Swedish embassy in Baghdad twice, starting fires within the compound on the second occasion.\nRussia's invasion of Ukraine prompted Sweden and Finland, two states who had remained neutral for decades, to submit applications to join NATO in May 2022, months after Putin's forces put boots on the ground.\nBut Turkey, a member of the security bloc, has delayed ratifying Sweden's application for more than a year, accusing the country of being too lenient toward groups that Ankara regards as threats to its security, including Kurdish militants and members of a network that Ankara blames for a failed coup in 2016.\nHowever, Turkey's foreign affairs committee in December finally gave its consent to Sweden's bid to join NATO, drawing the Nordic country closer to membership in the Western military alliance.\nTurkey's President Recep Tayyip Erdogan, left, shakes hands with Sweden's Prime Minister Ulf Kristersson, right, as NATO Secretary General Jens Stoltenberg looks on (File image)\nTurkey's foreign affairs committee gave its consent to Sweden's bid to join NATO last month\nSeveral non-NATO states have tried to join the bloc since Russia invaded Ukraine, including Finland, which joined in April with little backlash or resistance\nSweden's accession protocol will now need to be approved in the general assembly for the last stage of the legislative process in Turkey.\nThough no date has been set, it is expected to be approved within a matter of weeks.\nTurkish President Recep Tayyip Erdogan should then sign it into law, concluding a process that frustrated some of Ankara's allies and tested its Western ties.\nTurkish lawmakers said that Stockholm needed to take further steps to clamp down on the outlawed Kurdistan Workers' Party (PKK), an armed group that has been designated a 'terrorist organisation' by Turkey, the EU and the US.\nSome members fled Turkish persecution in the late 1980s and subsequent crises in the Middle East.\nSweden extradited a Kurdish refugee to Turkey in December, amid pressure to meet demands in return for NATO membership.\nErdogan last month linked ratification of Sweden's NATO membership to the US Congress' approval of a Turkish request to purchase 40 new F-16 fighter jets and kits to modernise Turkey's existing fleet.\nWhile NATO member Hungary has also not ratified Sweden's membership, Turkey is seen as the main roadblock to adding the Scandinavian nation to the military alliance and bolstering its defences in the Baltic Sea region.\nMeanwhile, Zelensky today landed in Lithuania as part of an unannounced trip to the Baltic states to drum up more support for the conflict.\nUkraine's President Volodymyr Zelensky arrives for talks with Lithuania's President at the Presidential Palace in Vilnius, Lithuania, on January 10, 2024\nLithuania's President Gitanas Nauseda (R) and Ukraine's President Volodymyr Zelensky pose for photos during a welcoming ceremony at the Presidential Palace in Vilnius, Lithuania, on January 10, 2024\nThe three Baltic states - all former Soviet republics which are now EU and NATO members - are among Ukraine's staunchest allies.\n'Estonia, Latvia, and Lithuania are our reliable friends and principled partners. Today, I arrived in Vilnius before going to Tallinn and Riga,' Zelensky said on social media platform X, formerly Twitter.\n'Security, EU and NATO integration, cooperation on electronic warfare and drones, and further coordination of European support are all on the agenda,' he said.\nThe Baltic tour marks Zelensky's first official trip abroad this year.\nIn Lithuania, a key donor to Ukraine, Zelensky will hold talks with the president, prime minister and the speaker of parliament, and meet with the Ukrainian community.\nThe visit comes as other Kyiv allies waver on fresh aid, nearly two years into Russia's invasion.\nUkraine has come under intense Russian shelling in recent weeks, retaliating with strikes on Russia's border city of Belgorod.\nZelensky has urged allies to keep military support flowing and held in-person talks with officials from the United States, Germany and Norway last month.\nBut an EU aid package worth 50 billion euros ($55 billion) has been stuck in Brussels following a veto by Hungary, while the US Congress remains divided on sending additional aid to Ukraine.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Panicked Swedish youths flood helpline with calls after minister warned 'there could be war' and urged people to prepare for conflict in face of Russia tensions - as row breaks out over his 'alarming'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12950677/Panicked-Swedish-youths-flood-helpline-calls-minister-warned-war-urged-people-prepare-conflict-face-Russia-tensions-row-breaks-alarming-speech.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}