{"authors": ["Lucy Sarret"], "date_download": "2024-02-05 15:14:48", "date_modify": "None", "date_publish": "2024-01-30 13:21:00", "description": "The Special Ops team dressed as civilians and doctors to assassinate militants they believed were planning another terrorist attack, officials say.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1861262%2Fisrael-soldiers-west-bank-hospital-disguise-killing-hamas.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5188563.jpg", "language": "en", "localpath": null, "maintext": "The footage shows soldiers dressed as civilians and doctors in the hospital with assault rifles\nImages have captured the moment an undercover Israeli special operations team stormed a West Bank hospital to assassinate three suspected Palestinian militants. The incident at Ibn Sina Hospital in Jenin was captured on CCTV footage which has circulated online. In it, armed soldiers, some disguised as medical personnel and civilians, advance through the hospital corridors with assault rifles. The Israeli military confirmed the operation, claiming that the trio were linked to a Hamas \"terrorist cell”. It unfolded in the early hours of the morning, with armed troops entering the hospital and neutralizing the individuals, who were accused of planning an attack inspired by October 7. READ MORE: Three US soldiers killed in Jordan drone strike as Joe Biden issues revenge vow\nFootage purports to show disguised IDF troops raiding hospital\nTrending\nThe incident comes amid ongoing hostilities between Israel and Hamas, with recent clashes resulting in casualties on both sides. The United States has pledged support for Israel's defense against attacks and has warned of potential consequences for those responsible for targeting American troops. Iran, accused of backing militant groups in the region, has denied involvement in the recent attacks. However, the escalating violence has highlighted the fragility of the situation in the Middle East, with fears of further conflict looming large. Follow our social media accounts here on https://www.facebook.com/ ExpressUSNews and @ExpressUSNews", "source_domain": "www.express.co.uk", "text": null, "title": "Israeli troops dressed as medical staff kill three militants in West Bank hospital", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1861262/israel-soldiers-west-bank-hospital-disguise-killing-hamas"}