{"authors": ["James Reinl", "Social Affairs Correspondent", "For Dailymail.Com"], "date_download": "2024-02-05 15:19:00", "date_modify": "None", "date_publish": "2024-01-11 13:28:04", "description": "William Thibeau will on Thursday tell lawmakers that the military needs to be kept apart from the 'politics and ideologies of our time,' he told DailyMail.com ahead of the session.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12948947%2FArmy-Veteran-set-urge-lawmakers-rid-military-DEI-drag-queens-CRT-saying-diversity-targets-wrong-people-combat-leadership-roles-weakening-forces.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/11/13/79867421-0-image-a-5_1704979466443.jpg", "language": "en", "localpath": null, "maintext": "He will warn against an 'ideology that's not relevant to the military profession'\nArmy Ranger veteran William Thibeau is set to urge Congress to scrap the US military's diversity targets, saying they put the wrong people into combat leadership roles and leave units less able to win wars.\nThibeau, a veteran of the US anti-terror campaigns of the 2000s, will on Thursday tell lawmakers that the military needs to be kept apart from the 'politics and ideologies of our time,' he told DailyMail.com ahead of the session.\nHe takes aim at diversity, equity, and inclusion (DEI) targets that he blames for problems in the US Air Force and at West Point Military Academy, as well as critical race theory (CRT) and drag queen shows on military bases.\n'The military should only make personnel and program decisions based on factors that reflect the professional competence of an individual,' said Thibeau.\nArmy Ranger veteran William Thibeau and his wife, Michelle\n'If those factors aren't relevant to a person's ability to do a job, whether a cook, an infantryman, or a tank driver, they shouldn't be considered, because it allows in an ideology that's not relevant to the military profession.'\nThibeau will present evidence to the House Subcommittee on National Security, the Border, and Foreign Affairs at a hearing called 'The Risks of Progressive Ideologies in the U.S. Military.'\nThe hearing comes amid growing concerns among conservatives that the US military is being weakened by leftist values, showcased by Pentagon funding for drag shows and training workshops on 'white privilege' and pronoun usage.\nThe Department of Defense axed drag shows on bases last year, following an outrage over the Navy's appointment of a non-binary drag queen whose stage name is Harpy Daniels as its first 'digital ambassador.'\nThe military has struggled to remain relevant to younger Americans, who are less interested in serving in uniform and would in many cases not meet the fitness standards, and faces a recruitment crisis after missing its 2023 target by 41,000.\nThibeau, a married, father-of-four who now heads the American Military Project at the Claremont Institute, a conservative think tank, said he was concerned that the US military was suffering as a result of progressive ideas.\nYeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, stoked outrage when he announced on TikTok in November that he would be the Navy's first 'digital ambassador'\nArmy Black Knight cadets during the walk-on prior to an Army-Navy football game. The military faces an ongoing recruitment crisis\nMembers of the House Oversight and Accountability Subcommittee on National Security, the Border, and Foreign Affairs\nAn effort by the Air Force to diversify cadets ultimately left them short of pilots, he said. Racial quotas at West Point were also failing to improve the fighting ability of unites that emerged from the academy.\n'Anytime you evaluate something that's not relevant to the profession, and not relevant to the competence of the institution, it's going to dilute the quality and make it less effective,' said Thibeau.\nA conservative legal action group in September sued West Point, saying the New York-based academy's admissions practices discriminated against white applicants and violated the principle of equal protection in the U.S. Constitution's Fifth Amendment.\nPresident Joe Biden's administration defended the military academies' policies, arguing that senior military leaders have long recognized that a scarcity of minority officers can create distrust within the armed forces.\nThe Justice Department in court filings said West Point was a 'vital pipeline to the officer corps' and that its race-conscious admissions practices helped the Army achieve its 'mission critical' goal of having officers as diverse as its enlisted military personnel.\nCommittee chairman Glenn Grothman says the 'Biden Administration force-fed progressivism into the branches of the armed services'\nAlthough Black people make up 20.2 percent of the Army's active duty enlisted personnel, only 11 percent of officers are black, the Justice Department said.\nHispanic people constitute 18 percent of active personnel but only 9 percent of officers, the department said.\nWhite people by contrast constitute 51.7 percent of the Army active duty enlisted corps and 68 percent of its officers, the Justice Department said.\nThe committee's chairman Glenn Grothman, a Wisconsin Republican, said the hearing was aimed at questioning whether DEI and other 'progressive' programs were hurting the strength of US forces on the battlefield.\n'Our military has one primary function: defend Americans and American interests at home and abroad,' Grothman said.\n'At least this was the primary function until the Biden Administration force-fed progressivism into the branches of the armed services.'\nWith agencies.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Army Veteran will tell Congress that drag queens, DEI, and the surge of 'leftist values' in military are making the US WEAKER and leading to wrong people leading combat", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12948947/Army-Veteran-set-urge-lawmakers-rid-military-DEI-drag-queens-CRT-saying-diversity-targets-wrong-people-combat-leadership-roles-weakening-forces.html?ns_mchannel=rssns_campaign=1490ito=1490"}