{"authors": ["Bethan Sexton", "Bethan Sexton For Dailymail.Com"], "date_download": "2024-02-05 15:19:01", "date_modify": "None", "date_publish": "2024-01-11 22:11:44", "description": "US and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in waters near the Arabian Peninsula.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12953789%2FUS-military-strike-Houthi-Middle-East-Biden-speech.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/12/00/79918287-0-image-a-25_1705019955546.jpg", "language": "en", "localpath": null, "maintext": "US joined forces with UK, Australia, Bahrain, Canada and the Netherlands to carry out the blitz\nAirstrikes in Yemen against several Houthi military targets on Thursday night\nUS and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in waters near the Arabian Peninsula.\nJoe Biden announced the airstrikes on Thursday night against the Middle Eastern nation as missiles came from fighter jets, destroyers and a submarine.\nThe US used more than 100 precision missiles striking at around 2.30am local time on over 60 targets at 16 locations, according to the air force.\nThe attacks come in response to months of Houthi-led bombings on ships in the Red Sea - amid the conflict between Israel and Gaza.\nUS officials had warned there would be 'consequences' for the Houthi's attack on non-military ships in the Red Sea.\nThe US used more than 100 precision missiles striking at around 2.30am local time on over 60 targets at 16 locations, according to the air force. Explosions were reported in Sana'a, Hodeidah governorate, Saada, and Dhamar, Houthi officials confirmed. It's unclear the extent of the damage or any injuries. Fighter jets, Navy destroyers, a submarine and Tomahawk cruise missiles were all used in the blitz. Sites including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems were hit, according to officials. At least one submarine was deployed, the US would not confirm exactly which but Ohio-class guided-missile submarine USS Florida (SSGN-728) entered the Red Sea in November, USNI News reports. The vessel has capacity for 154 missiles. Super Hornets from USS Dwight D. Eisenhower (CVN-69) were also deployed, along with Air Force strike fighters originating from a base in the Middle East and according to the outlet\nUS and UK military forces have 'successfully' completed targeted strikes in Yemen used by Houthi to attack ships in the Red Sea\nAn Royal Air Force Typhoon aircraft takes off to join the US led coalition to conduct air strikes against military targets in Yemen. On Thursday evening, four Royal Air Force Typhoons launched from Royal Air Force Akrotiri to conduct strikes against military targets in Yemen\nExplosions were reported in Sana'a, Hodeidah governorate, Saada, and Dhamar, Houthi officials confirmed. It's unclear the extent of the damage or any injuries.\nSuper Hornets, Navy destroyers, and a submarine launched Tomahawk cruise missiles during the blitz.\nSites including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems were hit, according to officials.\nAt least one submarine was deployed, the US would not confirm exactly which one but Ohio-class guided-missile submarine USS Florida (SSGN-728) entered the Red Sea in November, USNI News reports. The vessel has capacity for 154 missiles.\nSuper Hornets from USS Dwight D. Eisenhower (CVN-69) were deployed, along with Air Force fighters originating from a base in the Middle East.\nThe US and UK, along with Australia, Bahrain, Canada and the Netherlands, joined together for the attack.\n'These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation in one of the world’s most critical commercial routes,' Biden said.\n'I will not hesitate to direct further measures to protect our people and the free flow of international commerce as necessary.'\nDefense Secretary Lloyd Austin also released a statement in the wake of the attacks. It was his first public comment since his health scandal saw him in the ICU of the hospital for prostate cancer treatment, without the White House knowing about his condition.\n'This action is intended to disrupt and degrade the Houthis' capabilities to endanger mariners and threaten global trade in one of the world's most critical waterways. Today's coalition action sends a clear message to the Houthis that they will bear further costs if they do not end their illegal attacks,' Austin said.\nStrikes were carried out on over 60 targets at 16 Iranian-backed Houthi militant locations, including command and control nodes, munitions depots, launching systems, production facilities, and air defense radar systems\nOver 100 precision-guided munitions of various types were used in the blitz, which also included maritime support\nPrior to the strike, terrorists in the region had warned of possible retaliation against US military targets if the bombing went ahead.\nShortly after the strike unverified reports of attacks on US bases in Iraq began to flood social media.\nThe bombardment came thirty minutes after the the U.S. military said the Houthis had had staged their 27th attack on shipping since November 19 earlier on Thursday, firing an anti-ship ballistic missile into international shipping lanes in the Gulf of Aden.\nThe US military strikes are the country's first on Yemen since 2016. President Biden said they had been ordered in response to 'unprecedented' attacks against maritime vessels.\n'More than 50 nations have been affected in 27 attacks on international commercial shipping. Crews from more than 20 countries have been threatened or taken hostage in acts of piracy,' Biden said.\n'More than 2,000 ships have been forced to divert thousands of miles to avoid the Red Sea—which can cause weeks of delays in product shipping times. And on January 9, Houthis launched their largest attack to date—directly targeting American ships.'\nHe then added: 'Last week, together with 13 allies and partners, we issued an unequivocal warning that Houthi rebels would bear the consequences if their attacks did not cease. And yesterday, the United Nations Security Council passed a resolution demanding the Houthis end attacks on merchant and commercial vessels.'\nBut he was criticized by those among his own party for failing to talk to Congress prior to ordering the attacks.\nThe bombardment came on Thursday night after the Houthi had blocked another shipping lane in the Gulf of Aden, the latest in a string of attacks against vessels in the area in recent months. Pictured: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in November\nSuper Hornets from USS Dwight D. Eisenhower (CVN-69) were deployed for use in the strikes, according to USNI News\nAt least one submarine, thought to be USS Florida (SSGN-728), was used in the attack. The vessel entered the Red Sea in November though its use has not been formally confirmed\n'The President needs to come to Congress before launching a strike against the Houthis in Yemen and involving us in another middle east conflict. That is Article I of the Constitution,' Rep. Ro Khanna said in a post on X.\n'I will stand up for that regardless of whether a Democrat or Republican is in the White House.'\nUK Prime Minister Rishi Sunak also spoke out in the wake of the attack decribing them as 'self-defense.'\n'This cannot stand. The United Kingdom will always stand up for freedom of navigation and the free flow of trade,' Sunak said.\n'The Royal Navy continues to patrol the Red Sea as part of the multinational Operation Prosperity Guardian to deter further Houthi aggression, and we urge them to cease their attacks and take steps to de-escalate.'\nHouthi official Abdul Qader al-Mortada condemned latest allied strikes as 'American-Zionist-British aggression' in a post on X.\nVice President of the Houthi Media Authority Nasr Aldeen Amer also vowed that the Houthi would not retreat.\n'A brutal aggression against our country, for which they [the attackers] will pay absolutely and without hesitation, and we will not back down from our position in supporting the Palestinian people, whatever the cost,' he said.\nThe rebels say their assaults are aimed at stopping Israel's war on Hamas in the Gaza Strip. But their targets are increasingly random.\nThe Houthis, based in Yemen, have been firing rockets, drones and missiles north towards Israel, interrupting Red Sea shipping\nUS Air Force recon jets were spotted tracking over Saudia Arabia on Thursday night ahead of the strikes\nArmed demonstrators take part in a solidarity rally with Gaza in the rebel-held Yemeni capital Sanaa. Antony Blinken warned of 'consequences' if the rebels do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels\nThe Yemeni rebels are backed by Iran. They have stepped up attacks on international shipping since the Oct. 7 attack by Hamas on Israel in what they say is an act of solidarity with Palestinians.\nVarious shipping lines have suspended operations, instead taking the longer journey around Africa.\nSecretary of State Antony Blinken previously warned of 'consequences' if the Houthi do not stop attacking ships in the Red Sea, and called on Iran to end their support for the rebels.\n'We've been clear with more than 20 other countries that if this continues as it did yesterday that there will be consequences,' he said on Wednesday.\nWhen asked if there would be consequences for Iran, he added: 'We've also repeatedly tried to make clear to Iran as other countries have as well that the support hat they are providing to the Houthis needs to stop.\n'It's not in their interests to see these conflicts escalated and we're not the only one who sent that message to Iran.\n'These attacks have been aided and abetted by Iran with technology equipment and intelligence and they are having a real life impact on people.'\nIt comes at a fraught time for the US - as Defense Secretary Lloyd Austin is reeling from his prostate cancer operation. He has been in hospital for over a week.\nAnd by Thursday, British stealth jets and combat drones were being readied for the airstrike with warships moved into the Red Sea in recent days.\nPresident Biden's statement 'Today, at my direction, US military forces - together with the United Kingdom and with support from Australia, Bahrain, Canada, and the Netherlands - successfully conducted strikes against a number of targets in Yemen used by Houthi rebels to endanger freedom of navigation in one of the world's most vital waterways. 'These strikes are in direct response to unprecedented Houthi attacks against international maritime vessels in the Red Sea - including the use of anti-ship ballistic missiles for the first time in history. 'These attacks have endangered US personnel, civilian mariners, and our partners, jeopardised trade, and threatened freedom of navigation. 'More than 50 nations have been affected in 27 attacks on international commercial shipping. 'Crews from more than 20 countries have been threatened or taken hostage in acts of piracy. 'More than 2,000 ships have been forced to divert thousands of miles to avoid the Red Sea - which can cause weeks of delays in product shipping times. 'And on 9 January, Houthis launched their largest attack to date- directly targeting American ships. 'The response of the international community to these reckless attacks has been united and resolute. 'Last month, the United States launched Operation Prosperity Guardian - a coalition of more than 20 nations committed to defending international shipping and deterring Houthi attacks in the Red Sea. 'We also joined more than 40 nations in condemning Houthi threats. Last week, together with 13 allies and partners, we issued an unequivocal warning that Houthi rebels would bear the consequences if their attacks did not cease. 'And yesterday, the United Nations Security Council passed a resolution demanding the Houthis end attacks on merchant and commercial vessels. 'Today's defensive action follows this extensive diplomatic campaign and Houthi rebels' escalating attacks against commercial vessels. 'These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation in one of the world's most critical commercial routes. 'I will not hesitate to direct further measures to protect our people and the free flow of international commerce as necessary.' Advertisement", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden's revenge blitz: Fighter jets, destroyers and a sub fire over 100 precision-guided missiles at 60 Houthi targets in Yemen - wiping out terror HQs, arms depots and radar systems", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12953789/US-military-strike-Houthi-Middle-East-Biden-speech.html?ns_mchannel=rssns_campaign=1490ito=1490"}