{"authors": ["Jason Burke", "Sufian Taha"], "date_download": "2024-02-05 15:19:06", "date_modify": "None", "date_publish": "2024-01-10 16:56:45", "description": "US secretary of state met Palestinian Authority leader, Mahmoud Abbas, on visit dismissed as ‘theatre’ by residents", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F10%2Fblinken-restates-commitment-to-palestinian-state-on-west-bank-visit.json", "image_url": "https://i.guim.co.uk/img/media/4f4c5146ae359916bcad91c86d98ea21408890fc/0_0_4050_2430/master/4050.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=36dc0144ada22c73159a8b1da617e0fc", "language": "en", "localpath": null, "maintext": "Antony Blinken, the US secretary of state, restated Washington’s commitment to the creation of a Palestinian state during a brief trip to the occupied West Bank on Wednesday, a visit dismissed by many residents as “theatre”.\nBlinken told Mahmoud Abbas, the Palestinian president and head of the Palestinian Authority (PA), that the US position was that a Palestinian state must stand alongside Israel, “with both living in peace and security”, a spokesperson said.\nAs Blinken arrived under tight security at Abbas’s headquarters in Ramallah, a group of protesters held up signs that read: “Stop the genocide”, “Free Palestine” and “Blinken out”. Some scuffled with Palestinian security forces in riot gear.\nAnalysts and others in Ramallah said Palestinian expectations of the visit were “lower than low”.\n“The only purpose is to give the Israelis time to finish off Gaza,” Atef al-Hamoud, a local government functionary, said.\nJamal Zakout, an analyst, said: “This war has damaged the image of the US in all Arab countries, not just Palestine. No one can ignore their unfair diplomacy. For three months all the US has done is protect Israel.”\nView image in fullscreen Demonstrators protest against Blinken’s visit in Ramallah. Photograph: Marco Longari/AFP/Getty Images\nOn Tuesday, Blinken met top Israeli officials and repeated calls for greater protection of civilians, more aid to be allowed into Gaza and for residents to be allowed to return home where possible.\nHinting at having held difficult talks with Israeli officials on Tuesday, Blinken said the US had a duty to be as forthright as possible with friends and called for Israel to make “hard decisions”.\nThe US has offered staunch support to Israel since the outbreak of its war with Hamas three months ago, but the refusal of Benjamin Netanyahu, Israel’s prime minister, to offer detailed public plans for the governance of Gaza when Israel’s military offensive ends has angered Washington.\nIsrael has so far ruled out calls to allow the internationally recognised PA to govern Gaza and the occupied West Bank after the conflict’s end – Washington’s preferred option – and instead suggested some form of governance involving local power-brokers or clans, with the Israel Defense Forces playing a significant supervisory role.\nNetanyahu, whose hold on power depends on far-right support, has also ignored US pressure to rein in ministers who have called for the mass voluntary emigration of Palestinians from Gaza. Washington has said such rhetoric is “inflammatory and unacceptable”.\nDespite Blinken’s complaint that the “daily toll on civilians in Gaza … is far too high”, heavy fighting continued in Gaza with clashes in the centre and south.\nAt least 23,570 people, mostly women and children, have been killed during Israel’s offensive in Gaza, according to its health ministry. Swaths of the territory have been devastated, with most of its 2.3 million population displaced and facing an acute humanitarian crisis. Local officials said at least 147 people had died over the previous 24 hours.\nIsraeli military losses have reached 186 since the beginning of the offensive in Gaza, which came after Hamas militants killed 1,200 people, mostly civilians, in their homes and at a music festival on 7 October.\nHamas also took about 250 hostages. Israel has said 132 of them remain captive, though at least 25 of these are thought to have been killed.\nOn Tuesday, Blinken voiced hopes that, after the war, Israel could push on with its efforts towards regional integration, following its US-brokered normalisation deals with the United Arab Emirates, Bahrain and other states.\nThe top US diplomat, on his fourth tour of the Middle East since the outbreak of the war, also dismissed a case filed by South Africa against Israel at the international court of justice accusing it of genocide, saying the allegation was “meritless” and “particularly galling” as Hamas had called for Israel’s annihilation.\nZakout said that any political scenario for after the war needed unity among Palestinian factions.\n“It will be impossible to implement any deal if Hamas is not included. We need to break not just the [conflict] but this Palestinian polarisation too,” he said.\nThe PA – established in the 1990s as part of the then peace process to run areas in the West Bank and Gaza under Palestinian control – has said it is willing to play a role in Gaza, from where it was expelled by Hamas in 2006, but only if it is part of a clear, comprehensive peace plan with Israel that also includes the West Bank.\nThe political leader of Hamas, Ismail Haniyeh, said last week he was “open to the idea” of a single Palestinian administration in Gaza and the West Bank.\nThe popularity of Hamas in the West Bank has risen sharply in recent months, despite the devastation caused by the conflict.\nRecent polling from the Palestinian Centre for Policy and Survey Research found 85% of West Bank respondents voiced satisfaction with the role of Hamas in the war.\nSupport for Hamas among the Palestinian public has typically spiked during conflicts, pollsters said. The group appears to have also earned significant goodwill for securing the release of 240 Palestinian women and children held in Israeli jails in return for 100 hostages, mostly Israeli, during the week-long ceasefire in Gaza at the end of November.\n“You now see women, progressive feminists in Ramallah, marching for Hamas, not because they love them or adhere to their ideology or want their ideology to prevail but because they see someone saying: ‘I will fight back’ and that is inspiring,” said Nour Odeh, a Ramallah-based commentator.\nSpeaking in his family’s grocer’s store in the Qalandiya camp on the outskirts of Ramallah, 20-year-old Salam Awad said Hamas had “destroyed the pride and morale of Israel”.\n“Only Hamas can do this, not this useless degenerate,” Awad said, referring to Abbas.\nBlinken will now travel from the West Bank to the Gulf state of Bahrain, home base of the US Fifth Fleet, for talks with King Hamad on preventing a regional escalation of the war, the state department said.\nAbbas will travel to the Red Sea port city of Aqaba to discuss a “push for an immediate ceasefire” in Gaza in talks with Jordan’s King Abdullah II and the Egyptian president, Abdel Fatah al-Sisi.\nThe US has consistently rejected calls for a ceasefire in Gaza, though Blinken has called for “more food, more water, more medicine” to reach those in need in the territory.\nIsraeli military officials said Israel was “ready and willing to facilitate as much humanitarian aid as the world will give” and that the highest number of trucks had entered Gaza since the war began. Aid agencies say the quantity remained inadequate given the acute humanitarian suffering caused by the conflict.", "source_domain": "www.theguardian.com", "text": null, "title": "Blinken restates commitment to Palestinian state on West Bank visit", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/10/blinken-restates-commitment-to-palestinian-state-on-west-bank-visit"}