{"authors": ["Dailymail.Com Political Reporters"], "date_download": "2024-02-05 15:19:09", "date_modify": "None", "date_publish": "2024-01-10 23:03:55", "description": "DeSantis and Haley are taking the stage in Iowa tonight in one of their final pitches to voters before the Iowa caucuses on Monday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Flive%2Farticle-12949231%2Fiowa-republican-presidential-primary-debate-ron-desantis-nikki-haley.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/10/22/79828899-0-image-a-20_1704927365644.jpg", "language": "en", "localpath": null, "maintext": "Nikki Haley started off her opening statement laying out all the 'lies' being told about her by Florida Gov. Ron DeSantis.\nThe head-to-head match up between Haley and DeSantis is being hosted by Drake University in Iowa.\nHaley began the debate by stating 'we need a new generational leader.'\n'We have watched our country be in disarray. We see the world on fire, and we need someone who has had executive experience,' she continued touting her own record.\n'But you're going to find out tonight there is going to be a lot of Ron's lies that have happened,' she predicted.\n'There are at least a couple dozen so far that he has done. So what we're going to do is rather than have him go and tell you all these lies, you can go to DeSantisLies.com, and look at all those, at least two dozen lies that he has told about me, and you can see where fact-checkers say exactly what's going toe happen.'\nShe went on to say the fact he is mad stems from his donors leaving him and backing her campaign.\n'And that's because he is upset, about the fact that his campaign is exploding,' she continued.\n'But every time he lies, Drake University, don't turn this into a drinking game because you will be over served by the end of the night,' she stated to applause in the crowd.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "The Iowa Republican Presidential Primary debate LIVE: Nikki Haley calls January 6 a 'terrible day' and criticizes Trump for repeatedly saying the election was stolen", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/live/article-12949231/iowa-republican-presidential-primary-debate-ron-desantis-nikki-haley.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}