{"authors": ["Chris Mcgreal"], "date_download": "2024-02-05 15:19:11", "date_modify": "None", "date_publish": "2024-01-10 08:00:25", "description": "The pattern of killing cannot be denied, says former Guardian Jerusalem correspondent Chris McGreal", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F10%2Fisrael-murdering-palestinian-journalists-in-gaza.json", "image_url": "https://i.guim.co.uk/img/media/170987ba858c06a96da3e963e74aca88eefa468d/0_143_4240_2545/master/4240.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=03faad6adb766143fc25e151b20e5662", "language": "en", "localpath": null, "maintext": "I am in awe of Wael Dahdouh’s strength to haul himself back in front of the camera and focus on the suffering of others even as he has repeatedly endured his own personal hell. The face of Al Jazeera’s reporting throughout Israel’s relentless bombardment of Gaza was on air in October when he learned that his wife, seven-year-old daughter, 15-year-old son and one-year-old grandson were killed in an attack. Still he went on reporting.\nLast month, Dahdouh himself was wounded and his cameraman, Samer Abu Daqqa, killed in the Israeli bombing of a UN-run school used as a shelter. Then on Sunday, an Israeli drone strike on a car in southern Gaza killed Dahdouh’s eldest son, 27-year-old Hamza, who also worked for Al Jazeera, along with another journalist.\nDahdouh took a break from reporting to attend the funeral of his son and then returned to the airwaves. “Nothing is harder than the pain of loss, and when you experience this pain time after time, it becomes harder and more severe,” he told Al Jazeera. “I wish that the blood of my son Hamza will be the last from journalists and the last from people here in Gaza, and for this massacre to stop.”\nHamza and his colleague, Mustafa Thuraya, a videographer for Agence France Press, were the latest of scores of journalists killed by Israel in its assault on Gaza in response to the Hamas cross-border attack in October. Israel says it does not target journalists but that is hard to square with the fact that its military aimed two missiles directly at the car carrying Hamza. The Israel Defense Forces, which has a track record of false claims about the circumstances in which it has killed journalists, initially said that there was a “terrorist” with a camera drone in the vehicle. But the reporters were not flying the drone when the car was struck and it is difficult to believe that, if the military was following the journalists’ actions, it did not recognise them as media workers.\nThe Committee to Protect Journalists (CPJ) calculates that Israel has killed more than 70 media workers in the latest war in Gaza, making it the deadliest conflict for journalists in decades. Others put the toll at more than 100.\nThe CPJ says that the scale and circumstances of the killings, including direct threats to reporters and their families by Israeli officials, is evidence that Palestinian reporters in Gaza are being targeted. Murdered, in other words. If so, it’s a war crime and, as Al Jazeera has demanded, the international criminal court should add these killings to its investigation of Israel’s other alleged breaches of the Geneva conventions across occupied Palestine.\nJournalists accept there are inherent dangers in reporting conflicts, whether they choose to go to the war as correspondents for foreign news organisations, or the war comes to them and their families against their wishes, as for Dahdouh. Colleagues I knew personally – some friends, others more professional acquaintances – have lost their lives doing their jobs as journalists. From David Blundy, shot by a sniper on a street in El Salvador in 1989, to Marie Colvin, killed by shelling in Syria in 2012. Others died in South African townships, on the streets of Somalia, in fighting during the Libyan revolution, or were gunned down by rebels in Sierra Leone.\nEach reporter calculates the risks, and whether they are worth taking. Is it safe to go down that road? The answer might not be what immediately seems obvious. Generally it was safer to approach a militia roadblock during the Rwandan genocide than those manned by rebels in Liberia or Sierra Leone.\nEven reporting from Gaza during the second intifada 20 years ago, when the Israeli military regularly invaded, bombed and flattened Palestinian neighbourhoods, did not feel especially unsafe compared with other regions. Not that the Israeli army was above killing people it knew to be journalists.\nIn 2003, an Israeli soldier shot dead the British documentary cameraman James Miller in Gaza. An inquest in the UK returned a verdict of unlawful killing. Israel declined to prosecute the soldier responsible but it did pay £1.5m in compensation, which Miller’s family said was “probably the closest we’ll get to an admission of guilt on the part of the Israelis”.\nMiller’s killing looked to be part of a pattern of ill-disciplined Israeli soldiers shooting whoever they felt like – not only journalists but UN officials and aid workers as well as Palestinian children. The army was usually quick to try to cover up the killings but it did not appear they were coordinated.\nGaza looks very different today. As the CPJ and the Paris-based Reporters Without Borders say, the scale and nature of the deaths of journalists and their families suggests there is more going on than a few ill-disciplined soldiers taking pot shots at reporters, even taking into account the deaths of thousands of other Palestinians, including more than 8,000 children.\nCertainly the message from some Israeli leaders is that journalists are fair game. Israeli politicians were quick to call for the “elimination” of a number of Palestinian journalists working for foreign news organisations who were falsely accused by a pro-Israel pressure group in the US of being “embedded with Hamas” on 7 October. Benny Gantz, a member of the Israeli war cabinet, said they should be hunted down as terrorists, reflecting a widely held suspicion among Israeli officials that Palestinian journalists are an appendage of Hamas.\nMiller’s family got a payout because he was British. Dead western journalists create more waves, which is presumably one of the reasons Israel has locked the foreign press out of Gaza during the present war. International news organisations now rely on those same Palestinian reporters targeted by Israel. They provide many of the pictures the rest of the world sees of the horror in Gaza.\nIt is therefore troubling that while western newspapers and television stations have reported the rising numbers of deaths of journalists in Gaza, many news organisations appear unwilling to directly address the pattern of killing that, as the CPJ’s evidence appears to show, provides strong evidence of a war crime. It would surely be different if American or European reporters were the ones dying.\nChris McGreal writes for Guardian US and is a former Guardian correspondent in Washington, Johannesburg and Jerusalem", "source_domain": "www.theguardian.com", "text": null, "title": "Israel is murdering Palestinian journalists in Gaza. Where is the outrage?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/10/israel-murdering-palestinian-journalists-in-gaza"}