{"authors": [], "date_download": "2024-02-05 15:14:48", "date_modify": "None", "date_publish": "2024-01-30 07:26:49", "description": "India's naval forces have rescued an Iranian-flagged fishing vessel hijacked by Somali pirates and freed its 19 crew members off the east coast of Somalia", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-india-new-delhi-pakistani-iman-b2487109.html.json", "image_url": "https://static.independent.co.uk/2024/01/30/07/India_Somalia_Ship_Hijacking_45609.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIndia's naval forces rescued an Iranian-flagged fishing vessel hijacked by Somali pirates and freed its 19-member Pakistani crew off the east coast of Somalia, a navy statement said Tuesday.\nThe rescue operation was the third this week involving Somali pirates and came a day after India's forces freed another Iranian fishing vessel named Iman and its 17 crew members from Somali pirates in the same waters. On Saturday, the Seychelles’ defense forces and coast guard rescued six Sri Lankan fishermen whose vessel had been hijacked by Somali pirates.\nThe Indian navy’s latest operation rescued the Iranian vessel Al Naeemi from the pirates late Monday. The ship intercepted the vessel and forced the pirates to release the crew and boat, which 11 Somali pirates had boarded, the statement said.\nThe navy did not immediately say what happened to the pirates responsible for the hijacking. But it posted images showing 10 pirates with their hands tied behind them and armed Indian naval troops guarding them. Another image showed some armed pirates on the vessel.\nThe piracy occurred in international waters about 850 nautical miles (1,570 kilometers) west of the Indian coastal city of Kochi.\nAmid disruptions in global shipping due to attacks by Yemen-based Houthi rebels in the Red Sea since November, the Indian navy has ramped up its deployment by sending three guided missile destroyers and reconnaissance aircraft to the vast Indian Ocean.\nThey have carried out several anti-piracy missions in addition to helping at least four merchant vessels that were attacked in the high waters amid Israel’s war with Hamas.", "source_domain": "www.independent.co.uk", "text": null, "title": "India's navy rescues second Iranian-flagged fishing boat hijacked by Somali pirates", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-india-new-delhi-pakistani-iman-b2487109.html"}