{"authors": [], "date_download": "2024-02-05 15:19:11", "date_modify": "None", "date_publish": "2024-01-10 13:12:12", "description": "The International Court of Justice (ICJ) will consider whether Israel is committing genocide in Gaza.", "filename": "https%3A%2F%2Fwww.bbc.co.uk%2Fnews%2Fworld-middle-east-67922346%3Fat_medium%3DRSS%26at_campaign%3DKARANGA.json", "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0DE6/production/_132285530_50e13ab8159368c298807c031ff2cabb8a5844770_0_5500_36671000x667.jpg", "language": "en", "localpath": null, "maintext": "What is South Africa’s genocide case against Israel at the ICJ? Published 6 days ago\nImage source, Getty Images\nThe International Court of Justice (ICJ) has been asked to consider whether Israel is committing genocide against Palestinians in Gaza.\nIsrael rejects the allegations as \"baseless\". South Africa brought the case to the court.\nWhat is the International Court of Justice?\nThe ICJ is the top court of the United Nations (UN).\nBased in the Hague, in the Netherlands, it was established after World War Two, to settle disputes between states.\nIt also gives advisory opinions on legal matters, which is what it is being asked to do with Israel.\nUnlike the International Criminal Court (ICC), the ICJ cannot prosecute individuals for crimes of the utmost severity, such as genocide.\nBut its opinions carry weight with the UN and other international institutions.\nImage source, EPA Image caption, The ICJ will deliver an opinion on the genocide allegation as the case is not a criminal trial\nWhat is genocide and what is the case against Israel?\nHundreds of Hamas gunmen crossed from the Gaza Strip into southern Israel, killing 1,300 people, mainly civilians, and taking about 240 hostages back to Gaza.\nSince Israel launched its military campaign against Hamas in response, more than 26,000 people, mainly women and children, have been killed in Gaza, according to the Hamas-run health ministry.\nEvidence submitted by South Africa claims \"acts and omissions\" by Israel \"are genocidal in character because they are intended to bring about the destruction of a substantial part of the Palestinian national, racial and ethnical group\".\nThis describes what Israel is actively doing, such as carrying out air strikes, and what it is allegedly failing to do, such as, according to South Africa, preventing harm to civilians.\nThe case also highlights Israeli public rhetoric, including comments from Prime Minister Benjamin Netanyahu, as evidence of \"genocidal intent\".\nThose acts are:\nkilling or causing serious bodily or mental harm to members of the group\ndeliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part\nimposing measures intended to prevent births within the group\nforcibly transferring children of the group to another group\nHow has Israel responded to genocide allegations?\nMr Netanyahu said: \"It is not we who have come to perpetrate genocide, it is Hamas.\n\"It would murder all of us if it could.\n\"In contrast, the IDF [Israel Defense Forces] is acting as morally as possible.\"\nIsrael's military says it takes a raft of measures to avoid civilian casualties.\nThese have included:\nairdropping flyers warning of imminent attacks\ncalling civilians' phones to urge them to leave targeted buildings\naborting some strikes when civilians are in the way\nThe Israeli government has repeatedly stated its intention is to destroy Hamas, not the Palestinian people.\nWhat has the court ruled and when will there be a final verdict?\nThe court issued what it called \"emergency measures\" on 26 January. This was a hearing to rule on a number of interim steps which South Africa had asked it to take against Israel.\nThe key request was for the court to order Israel to immediately halt operations in Gaza, but the court did not uphold this.\nHowever, it did instruct Israel to prevent its military from committing acts which might be considered genocidal, to prevent and punish incitement to genocide, and to enable humanitarian assistance to the people of Gaza.\nThe court also ruled that it had the legal right to proceed with the genocide case.\nA final verdict though could take several years.\nRulings are legally binding on countries which formally accept the ICJ - these include Israel and South Africa - but in practice, unenforceable by the court.\nIn 2022, the ICJ ordered Russia to \"immediately suspend military operations\" in Ukraine - but the order was ignored.\nWhy has South Africa brought the case?\nSouth Africa has been highly critical of Israel's military operation in Gaza.\nAnd as a signatory to the UN's 1948 Genocide Convention, it has an obligation to act, it says.\nThe governing African National Congress also has a long history of solidarity with the Palestinian cause.\nIt sees parallels with its struggle against apartheid - a policy of racial segregation and discrimination enforced by the white-minority government in South Africa against the country's black majority, until the first democratic elections, in 1994.\nThe country condemned the 7 October attacks and called for the release of the hostages.\n\"Our opposition to the ongoing slaughter of the people of Gaza has driven us as a country to approach the ICJ,\" said President Cyril Ramaphosa. \"As a people who once tasted the bitter fruits of dispossession, discrimination, racism and state-sponsored violence, we are clear that we will stand on the right side of history.\"", "source_domain": "www.bbc.co.uk", "text": null, "title": "What is South Africa’s genocide case against Israel at the ICJ?", "title_page": null, "title_rss": null, "url": "https://www.bbc.co.uk/news/world-middle-east-67922346?at_medium=RSS&at_campaign=KARANGA"}