{"authors": ["Dan Mclaughlin", "Dan Mclaughlin For Dailymail.Com"], "date_download": "2024-02-05 15:19:14", "date_modify": "None", "date_publish": "2024-01-09 18:30:37", "description": "Defense Secretary Lloyd Austin was missing in action - hospitalized in intensive care for four days - and hardly anyone knew. What's worse: hardly anyone noticed!", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12943489%2Flloyd-austin-hospital-joe-biden-dan-mclaughlin.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/09/18/79806889-0-image-m-14_1704824770061.jpg", "language": "en", "localpath": null, "maintext": "Who's in charge in Joe Biden's chaotic administration?\nPerhaps, no one.\nDefense Secretary Lloyd Austin was missing in action - hospitalized in intensive care for four days - and hardly anyone knew.\nWhat's worse: hardly anyone noticed!\nWhat a ridiculous mess. It's not as if the office of Pentagon chief is particularly slow these days.\nFrom Israel to the Red Sea, Ukraine to Taiwan, America's enemies are on the move – yet the most powerful military in the history of the world was leaderless and our stumbling commander-in-chief was left in the dark.\nFrom the little the American people had been told - in dribs and drabs since the news broke on Friday - 70-year-old Austin was admitted to Walter Reed military hospital for an unspecified 'elective surgery' on December 22.\nOn Tuesday, it was revealed that Austin was diagnosed in early December with prostate cancer and he underwent a procedure to treat that condition.\nAfter leaving the hospital and returning home, Austin experienced 'severe pain' on the evening of January 1 and he landed back in Walter Reed – in the ICU.\nHe remained hospitalized for four days, only leaving word with his subordinates that he was 'working from home.' Outside a small circle of close aides, no one was fully informed.\nOf course, I wish Secretary Austin a speedy recovery. But one would only expect this kind of secrecy shrouding health episodes in Vladimir Putin's Russia and Kim Jong Un's North Korea.\nSurely, this shouldn't happen in America and not from a cabinet secretary - on Tuesday, even the Pentagon's spokesman was forced to admit to the nation that communications have been bungled and there's now going to be a review.\nDefense Secretary Lloyd Austin was missing in action - hospitalized in intensive care for four days - and hardly anyone knew. What's worse: hardly anyone noticed!\nFrom Israel to the Red Sea, Ukraine to Taiwan , America's enemies are on the move – yet the most powerful military in the history of the world is leaderless and our stumbling commander-in-chief is left in the dark.\nAustin's deputy, on vacation in Puerto Rico, was put in charge of the United States military. Yet even she wasn't told that Austin was in hospital.\nOnly on the fourth day of his convalescence did National Security Adviser Jake Sullivan discover that Austin was out of commission and informed the President.\nHere's some of what happened over that period that would presumably involve the Defense Secretary and the President of the United States – or so, one should hope:\nJanuary 2nd: A drone strike on an apartment in Beirut, Lebanon killed a Hamas deputy chairman threatening to intensify Mideast war and ignite a regional conflagration.\nJanuary 3rd: ISIS terrorists set off deadly bomb blasts in the Iranian city of Kerman, as crowds commemorated the death of a notorious and vile Iranian commander.\nJanuary 4th: American forces in Iraq killed the leader of a terrorist group while reportedly defending themselves.\nAll the while, Iranian-aligned Houthi militants, who have fired on U.S. Naval vessels, escalated rocket attacks on commercial shipping through the Red Sea – as the American military eyes a grueling war in Ukraine and the ever-present threat of a Chinese invasion of Taiwan.\nJanuary 3rd: ISIS terrorists set off deadly bomb blasts in the Iranian city of Kerman, as crowds commemorated the death of a notorious and vile Iranian commander.\nAll the while, Iranian-aligned Houthi militants, who have fired on U.S. Naval vessels, escalated rocket attacks on commercial shipping through the Red Sea – as the American military eyes a grueling war in Ukraine and the ever-present threat of a Chinese invasion of Taiwan. (Above) Ukrainian women surveys aftermath of Russian missile strike on Kharkiv\nJanuary 2nd: A drone strike on an apartment in Beirut, Lebanon killed a Hamas deputy chairman threatening to intensify Mideast war and ignite a regional conflagration.\nWhat do you think this bumbling taught America's adversaries about the readiness of the world's great superpower?\nThe Pentagon's best explanation for this debacle is that Austin's chief of staff, who was responsible for reporting his illness up the civilian chain of command, was also sick – with the flu.\nIt's utterly remarkable. Is the public to accept that the Department of Defense, which has an annual budget of nearly $820 billion, can't handle a single sick-out? This isn't some mom-and-pop grocery store.\nNo, this whole fiasco is symptomatic of something else - a gerontocratic administration that has no one at the wheel.\nSources let it be known that Biden was 'exasperated at not more quickly being informed.' But the 81-year-old, who himself held no public events for two solid weeks over the holidays, didn't even speak to Austin until January 6. Then Biden reportedly said he would not accept a resignation if Austin were to offer one.\nThis is a pattern. An administration led by a declining octogenarian, lacking in vigor, focus and mission, is incapable of demanding excellence from its staff.\nIn 2021, transportation secretary Pete Buttigieg – then part of Biden's 'Supply Chain Disruptions Task Force' – was on paternity leave for two whole months while a logistical crisis rattled the economy and stoked runaway inflation.\nThe public wasn't told and Buttigieg kept his job.\nWhat do you think this bumbling taught America's adversaries about the readiness of the world's great superpower?\nAlso in 2021, an inept withdrawal from Afghanistan resulted in a humiliating Saigon-style retreat that abandoned $7 billion of U.S. military equipment and American allies to the vicious Taliban and, most dishonorably of all, led to the deaths of 13 U.S. service members.\nThe authors of that disgrace – Secretary of State Blinken and Lloyd Austin – escaped without consequence.\nNobody's been fired over pandemic mismanagement, economic malpractice, or the self-inflicted crisis at the border. No one in a position of power has paid for their failures.\nSurely, identity politics plays a role in this dysfunction: an administration that often hires with one eye on race, gender, and sexuality struggles to evaluate on merit. But there's more to it: a senile organization rots from the top down.\nBiden must be worried about setting a precedent. A man running for re-election as he approaches his 82nd year must fear that he may have more health scares in the near future.\nHe wouldn't want anybody to think that being in a hospital bed is grounds for losing your job.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Weeks after cancer diagnosis, Pentagon Chief goes back to hospital without telling his deputy OR the White House for days... how is this any way to run the country's defense, demands DAN MCLAUGHLIN", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12943489/lloyd-austin-hospital-joe-biden-dan-mclaughlin.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}