{"authors": ["Chris Matthews"], "date_download": "2024-02-05 15:19:15", "date_modify": "None", "date_publish": "2024-01-09 20:08:23", "description": "Ecuador was rocked by a series of attacks after the government imposed a state of emergency in the wake of the escape of gang leader Adolfo 'Fito' Macías (pictured) from prison.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12944363%2Farmed-men-bombs-ecuador-tv-set-broadcast.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/09/21/79815303-0-image-m-68_1704835355981.jpg", "language": "en", "localpath": null, "maintext": "ARE YOU TRAVELLING IN ECUADOR?\nARE YOU TRAVELLING IN ECUADOR?\nARE YOU TRAVELLING IN ECUADOR?\nARE YOU TRAVELLING IN ECUADOR? Email chris.matthews@mailonline.co.uk\nEcuador's president Daniel Noboa, 36, has ordered the army onto the streets\nOn Tuesday, armed men broke onto set of a live TV show and threatened people\nEcuador has erupted into a 'civil war' with cartel thugs after the president ordered the army onto the streets and declared a state of 'internal armed conflict'.\nCrazed criminals have rampaged through the South American country's cities today after President Daniel Noboa, 36, ordered a state of emergency.\nHooded gangsters seized a state TV news studio today, while a university was attacked and jail guards reportedly executed by prisoners.\nEcuador has been rocked by a series of attacks including explosions and the abduction of several police officers after the government imposed a state of emergency in the wake of the escape of a powerful gang leader from prison.\nAdolfo 'Fito' Macías, 44, the leader of Los Choneros gang, was found missing from his cell in a low security prison on the same day he was supposed to be transferred to a maximum security facility, on Sunday.\nA manhunt is underway for Macías and Los Lobos leader Fabricio Colon Pico, who also escaped prison on Tuesday since his arrest last Friday for alleged involvement in a plot to assassinate Ecuador's attorney general.\nPeru also declared an emergency on Tuesday along its northern border with Ecuador because of the ongoing violence.\nThe US State Department said it was 'extremely concerned' by the violence. The British Foreign Office warned against all but essential travel to parts of the country.\nARE YOU TRAVELLING IN ECUADOR? Email chris.matthews@mailonline.co.uk\nMen with their faces covered entered the set of the TC Television network in the port city of Guayaquil and shouted that they had bombs. Noises similar to gunshots could be heard in the background\nAn Ecuadorian police squad runs into the premises of Ecuador's TC television channel after gunmen burst into the state-owned television studio live on air on January 9\nEcuadorian soldiers take security measures with a military armored vehicle on roads after Ecuador president declares 'internal armed conflict'\nArmoured trucks have been seen on the streets of Ecuador's capital city of Quito\nPresident Daniel Noboa, 36, (pictured) has ordered the army onto the streets and declared a state of 'internal armed conflict'\nArmed men have broken into the set of a public television channel in Ecuador as it broadcast live and threatened people as the country reels from a series of attacks after the government imposed a state of emergency in the wake of the apparent escape of a powerful gang leader from prison\nMen were seen brandishing what appeared to be bombs and grenades (pictured)\nThe TV studio was stormed in the port city of Guayaquil in western Ecuador\nMacías, who was convicted of drug trafficking, murder and organized crime, was serving a 34-year sentence in La Regional prison in the port of Guayaquil.\nLos Choneros is one of the Ecuadorian gangs authorities consider responsible for a spike in violence that reached a new level last year with the assassination of presidential candidate Fernando Villavicencio.\nThe gang has links with Mexico's Sinaloa cartel, according to authorities.\nExperts and authorities have acknowledged that gang members practically rule from inside the prisons, and Macías was believed to have continued controlling his group from within the detention facility.\nPrison guards have reportedly been executed by the country's cartel thugs. Pictured: Moments before a guard was killed\nGunmen were seen storming the University of Guayaquil on Tuesday\nEcuadorian soldiers have been ordered onto the streets to protect civilians from the cartels\nPolice detain suspected criminals a few blocks from the headquarters of TC television station\nPolice arrest a suspected criminal a few blocks from the headquarters of TC television station\nProsecutors opened an investigation and charged two guards in connection with the alleged escape, but neither the police, the corrections system, nor the federal government confirmed whether Macías fled the facility or might be hiding in it.\nIn February 2013, Macías escaped from a maximum security facility but was recaptured weeks later.\nIn 2021, Macías's girlfriend was briefly arrested after she spent a week sleeping in his jail cell - and was busted as she tried to leave the prison in the middle of a riot while wearing a guard's uniform.\nOn Tuesday, gunshots rang out on live TV as men armed with bombs and grenades burst into a studio shortly after gangsters vowed a 'war' against the president's plans to reclaim control from 'narcoterrorists.'\nAttackers carrying rifles and grenades stormed the studio of TC television in the port city of Guayaquil, western Ecuador, as a woman was heard amid gunshots pleading: 'Don't shoot, please don't shoot.'\nBlood is seen on the floor of the state-owned TC television after unidentified gunmen burst into the studio\nPolice officers arrest one of the unidentified gunmen who burst into a studio of the state-owned TC television studio\nPeople accused of invading and taking over television station TC with weapons and forcing staff to lie and sit down, lie handcuffed on the floor\nPolice in Ecuador arrested several of the people who allegedly stormed the TV studio\nThey were handcuffed with zip ties and placed face-down on the floor\nIn the attack on Tuesday evening, intruders forced terrified TV crew onto the ground and a person could be heard screaming in apparent pain as the studio lights went off but the live broadcast continued for at least 15 minutes.\nWhy has violence spiralled in Ecuador? The country has been beset with violence from gangs battling for control in spiralling turf wars that see gun massacres and beheadings. Ecuador is situated between world-leading cocaine producers Colombia and Peru and has become a centre for foreign and domestic drug cartels. Guayaquil, a coastal city that is Ecuador's largest, is considered the country's most dangerous, with its ports a hub for drug smuggling. Noboa took office in November touting his 'Phoenix Plan' for security, including a new intelligence unit, tactical weapons for security forces, new high-security prisons and reinforced security at ports and airports. Security in Ecuador has been worsening since the coronavirus pandemic, which also brutally battered the economy. Ecuador's prisons have become a hotbed of violence, with the cartels fighting for power inside the country's jails, from which they then exert vast influence. Fishermen have been massacred at ports, maimed bodies have been hanged from bridges and riots have left hundreds dead in prisons. Prisons have become a hotbed of violence, with the cartels fighting for power inside the country's jails, from which they then exert vast influence. Since 2018, the national murder rate has more than quadrupled, soaring from six to 26 per 100,000 inhabitants - a rate that places it in the worst 15 countries. The country's National Police tallied 3,568 violent deaths in the first six months of 2023, far more than the 2,042 reported during the same period in 2022. That year ended with 4,600 violent deaths, the country's highest in history and double the total in 2021. Violent deaths nationally rose to 8,008 in 2023, the government has said, nearly double the 2022 figure. Violence in Ecuador culminated in August with the assassination of presidential candidate Fernando Villavicencio, plunging the country into chaos. A national emergency was declared in the wake of the assassination, while Ecuador's economic capital, Guayaquil, has seen multiple successive states of emergency imposed. In the north, the city of Esmeraldas is also frequently at the centre of turf wars, as cartels battle for control over the country's key drug supply routes. Behind the violence is what the UN's Office on Drugs and Crime describes as a global 'prolonged surge in both the supply of and demand for cocaine'. As the US market turns to other drugs such as fentanyl, the European market has bolstered demand for the powder, with gangs in the Balkans as well as Italy's feared 'Ndrangheta mafia understood to have expanded into Ecuador. Advertisement\nA TC employee said in a WhatsApp message: 'Please, they came in to kill us.\n'God don't let this happen.\n'The criminals are on air.'\nJournalists on screen were reportedly heard screaming 'they want to kill us all'.\nOne of the hooded men who attacked the set reportedly said: 'We are on the air so that they know that we do not play with the mafia.'\nAfter about 30 minutes of chaos, police officers were seen entering the studio while someone then called out that they 'have a wounded companion.'\nAll the gunmen who broke into the studio were arrested, a police commander said.\nAlina Manrique, the head of news for TC Television, said she was in the control room across from the studio when the masked men entered the building.\nOne of the men pointed a gun at her head and told her to get on the floor, she said.\nSome of the assailants ran from the studio and tried to hide elsewhere in the building when they realised they were surrounded by police, she added.\n'I am still in shock,' Ms Manrique told the Associated Press in a phone interview. 'Everything has collapsed.\n'All I know is that it's time to leave this country, and go very far away.'\nShortly after the gunmen stormed the TV station, President Noboa issued another decree designating 20 drug trafficking gangs operating in the country as terrorist groups and authorising Ecuador's military to 'neutralise' the groups - within the bounds of international humanitarian law.\nEcuador's national police chief announced a short time later that authorities had arrested all the masked intruders.\nCesar Zapata told the TV channel Teleamazonas that officers had seized the guns and explosives.\nHe did not say how many people were arrested.\n'This is an act that should be considered as a terrorist act,' Mr Zapata added.\nPresident Noboa decreed a national state of emergency for 60 days on Monday, allowing the authorities to suspend rights and mobilize the military in places like prisons.\nThe government also imposed a curfew from 11pm to 5am.\nNoboa had vowed on Monday to 'not negotiate with terrorists nor rest until we return peace to all Ecuadorans.'\nHe added that his government had decided to confront crime.\nNoboa was elected in October on a pledge to fight rampant drug-related crime and violence in the South American country - once considered a bastion of peace, but now a key stop on the US- and Europe-bound cocaine trade.\nHe vowed Monday to bring the fight to the cartels after a powerful gang leader, Adolfo Macias, known as 'Fito,' escaped from prison the previous day.\nStates of emergency were widely used by Noboa's predecessor, Guillermo Lasso, as a way to confront the wave of violence that has affected the country\nEcuador has been beset with violence from brutal bloodthirsty gangs who are battling for control in spiralling turf wars that see gun massacres and beheadings.\nEcuador is situated between world-leading cocaine producers Colombia and Peru, and has become a centre for foreign and domestic drug cartels blamed for a series of gruesome massacres, kidnappings and extortions.\nJournalists on screen were reportedly heard screaming 'they want to kill us all'\nOne of the hooded men who attacked the set reportedly said: 'We are on the air so that they know that we do not play with the mafia'\nEcuador's Police said on X, formerly Twitter , that some units were deployed to the media facilities\nFishermen have been massacred at ports, maimed bodies have been hanged from bridges and riots have left hundreds dead in prisons.\nGuayaquil, a coastal city that is Ecuador's largest, is considered the country's most dangerous, with its ports a hub for drug smuggling.\nNoboa took office in November touting his 'Phoenix Plan' for security, including a new intelligence unit, tactical weapons for security forces, new high-security prisons and reinforced security at ports and airports.\nARE YOU TRAVELLING IN ECUADOR? Email chris.matthews@mailonline.co.uk\nAdolfo 'Fito' Macías, the leader of Los Choneros gang, was found missing from his cell in a low security prison on the same day he was supposed to be transferred to a maximum security facility, on Sunday\nThe leader of Los Choneros gang, Adolfo Macías, also known as 'Fito', (pictured) wasn't in his cell on Monday night\nIt will cost some $800million (£629.4million), he said, though $200million (£157.3million) in new weapons for the army will be provided by the United States.\nSecurity in Ecuador has been worsening since the coronavirus pandemic, which also brutally battered the economy.\nEcuador's prisons have become a hotbed of violence and cartels such as Los Choneros, Los Lobos and Los Tiguerones have been fighting for power inside the country's jails, from which they then exert vast influence.\nSince 2018, the national murder rate has more than quadrupled, soaring from six to 26 per 100,000 inhabitants - a rate that places it in the worst 15 countries.\nAn Ecuadorian police squad approach the premises of Ecuador's TC television channel after unidentified gunmen burst into the state-owned television studio live on air on January 9, in Guayaquil, Ecuador\nAn Ecuadorian police helicopter overflies the premises of Ecuador's TC television channel\nA police sniper was seen on a nearby road overpass during the response\nPictured: Police respond with a sniper and helicopter\nThe country's National Police tallied 3,568 violent deaths in the first six months of 2023, far more than the 2,042 reported during the same period in 2022.\nThat year ended with 4,600 violent deaths, the country's highest in history and double the total in 2021.\nViolent deaths nationally rose to 8,008 in 2023, the government has said, nearly double the 2022 figure.\nViolence in Ecuador culminated in August with the assassination of presidential candidate Fernando Villavicencio, plunging the country into chaos.\nEcuadorian police take position outside the premises of Ecuador's TC television channel building\nSome members of the police were seen in balaclavas, bullet-proof vests and carrying guns\nFirefighters stand guard nearby Ecuador's TC television channel after unidentified gunmen burst into the state-owned television studio live on air\nOther police officers were seen in riot gear outside the television studio\nAn Ecuadorian soldier stands guard in front of Ecuador's TC television channel\nEcuadorian soldiers patrol outside the premises of Ecuador's TC television channel\nThis is the moment armed police took back control of the TV studio in Ecuador on Tuesday evening A national emergency was declared in the wake of the assassination, while Ecuador's economic capital, Guayaquil, has seen multiple successive states of emergency imposed. In the north, the city of Esmeraldas is also frequently at the centre of turf wars, as cartels battle for control over the country's key drug supply routes. Behind the violence is what the UN's Office on Drugs and Crime describes as a global 'prolonged surge in both the supply of and demand for cocaine'. As the US market turns to other drugs such as fentanyl, the European market has bolstered demand for the powder, with gangs in the Balkans as well as Italy's feared 'Ndrangheta mafia understood to have expanded into Ecuador. Soldiers were seen with automatic weapons and what appeared to be bolt cutters after the attack Police and soldiers take security measures as Ecuadorian police arrest several armed men who broke into the set of a public television channel Citizens take photos and videos as Ecuadorian police arrest several armed men who broke into the set of a public television channel Ecuadorian police arrest several armed men who broke into the set of a public television channel Verónica Briones Zambrano, the girlfriend of Adolfo 'Fito' Macías, leader of Los Choneros gang, is escorted from the Guayaquil Regional Jail in Guayaquil, Ecuador in 2021 Marine Infantry soldiers as they carry out an operation after a riot at the Litoral Regional Prison in Guayaquil, on January 8 Soldiers stood guard outside El Inca prison in Quito on January 8 Fito's low security prison was decorated with his own image Police forces stand guard outside the Turi prison as inmates hold prison guards hostage, in Cuenca, Ecuador, on January 8\nA wave of attacks began a few hours after Noboa's announcement on Monday.\nAuthorities reported multiple explosions and said seven police officers had been kidnapped.\nThey were taken in the coastal city of Machala, in the capital Quito, and in the southwestern province of Los Rios.\nA chilling video circulating on social media showed three of the kidnapped officers sitting on the ground with a gun pointed at them as one is forced to read a statement addressed to Noboa.\n'You declared war, you will get war,' the clearly terrified officer reads. 'You declared a state of emergency. We declare police, civilians and soldiers to be the spoils of war.'\nThe statement added that anyone found on the street after 11pm (5am GMT) 'will be executed.'\nOn Monday, President Daniel Noboa decreed a national state of emergency for 60 days\nStates of emergency were widely used by Noboa's predecessor, Guillermo Lasso, as a way to confront the wave of violence that has affected the country\nLos Choneros is one of the Ecuadorian gangs authorities consider responsible for a spike in violence that reached a new level last year with the assassination of presidential candidate Fernando Villavicencio\nA pedestrian bridge was damaged by an explosion late on January 8, over the General Rumiñawi highway in the Monjas sector in Quito\nThe presidency and metro stations in Quito were under military guard on Tuesday.\nPolice say an explosive device was thrown near a police station in Esmeraldas on the northwest coast and two vehicles were burned in other areas, with no one killed or injured.\nIn Quito, a car was reportedly blown up, and a device exploded near a pedestrian bridge.\nAgents also arrested two people for possession of explosives and as suspects in at least one of the attacks in the South American country.\nThe government has not said how many attacks were registered in total, but local media reported several, including some in northern cities, where vehicles were set on fire, and others in Quito, including an explosion near the house of the president of the National Justice Court.\nAuthorities have not said if the incidents are part an orchestrated action.\nNeighbouring country Peru's government declared an emergency along its northern border on Tuesday.\nPrime Minister Alberto Otarola made the announcement, noting that the emergency declaration would deploy an unspecified number of army troops to support police forces.\nPeru's defense and interior ministers will also travel to the border to coordinate operations, according to the prime minister.\nEarlier in the day, Peru's interior minister ordered the 'immediate' deployment of police to the border in a bid to boost security.\nThe Ecuadorian government has previously accused members of the main drug gangs for similar strikes.\nThe US State Department said on Tuesday it was 'extremely concerned' by violence in Ecuador which has led the country's president to declare a state of emergency and deploy military into the streets.\n'Extremely concerned by today's violence & kidnappings in Ecuador,' the top US diplomat for Latin America, Brian Nichols, wrote on X, adding that American officials would 'remain in close contact' with President Daniel Noboa's team.\nThe British Foreign Office has advised against all but essential travel to parts of Ecuador.\nThe Chinese embassy said it would be closed until further notice from Wednesday.\nThe Ecuadorian Ministry of Tourism has recommended tourists stay inside their hotels/accommodation until further notice and only move for essential travel.\nAll airports are currently open but some airlines have cancelled flights.\nARE YOU TRAVELLING IN ECUADOR? Email chris.matthews@mailonline.co.uk", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Ecuador erupts in 'civil war' with cartel thugs: President orders the army onto streets as crazed criminals rampage through cities - with TV station seized, university attacked and jail guards execute", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12944363/armed-men-bombs-ecuador-tv-set-broadcast.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}