{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Martin Belam", "Helen Livingstone"], "date_download": "2024-02-05 15:19:27", "date_modify": "None", "date_publish": "2024-01-09 23:50:33", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F09%2Fmiddle-east-crisis-live-updates-hamas-israel-gaza-palestine-war-us-antony-blinken-tel-aviv-visit.json", "image_url": "https://i.guim.co.uk/img/media/612a5bc83fb44daa761ac45280ba9653155055e2/0_305_5350_3210/master/5350.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d873d0608a01199f6e5a69e51dde25cb", "language": "en", "localpath": null, "maintext": "From 9 Jan 2024 23.28 CET Médecins Sans Frontières says strike on Gaza shelter killed staff member's five-year-old daughter Médecins Sans Frontières (MSF) has condemned “in the strongest possible terms” a strike on an MSF shelter in Khan Younis in the south of the Gaza Strip on Monday. A five-year-old daughter of an MSF staff worker was critically injured by the strike and underwent surgery at a hospital, the medical charity said. She later died of her injuries on Tuesday, it said. In a statement, MSF said that more than 100 staff and their family members had been sheltering in the building on Monday morning when a shell broke through the wall. Thomas Lauvin, MSF project coordinator in Gaza, said: We are outraged and deeply saddened by the death of yet another family member of our MSF staff. This strike on civilians is unacceptable and, once again, goes to show that it doesn’t matter where you are in Gaza, nowhere is safe. The shell did not detonate on impact, otherwise many more of our staff and their families would have most likely been killed. The charity said it had notified Israeli forces that the shelter was housing MSF staff and their families, and that no evacuation orders were issued before the strike. It added: While MSF is not able to confirm the origin of the shell, it appears to be similar to those used by Israeli tanks. Four of MSF’s staff have been killed since the beginning of the war in addition to numerous family members, it said.\n9 Jan 2024 00.45 CET It’s 1.45am in Gaza City, Tel Aviv and Beirut and we’re about to close this blog. Our live coverage will resume later in the day. A summary of key recent developments is below. All our coverage of the Israel-Gaza war and the broader Middle East crisis can be seen here. Thank you for reading.\nUpdated at 01.21 CET\n9 Jan 2024 00.22 CET The US has defended its veto last month of a UN security council resolution calling for a ceasefire in Gaza, saying the proposal was “disconnected from the situation on the ground”. The Associated Press reports that a UN general assembly meeting on Tuesday, the Palestinian and Arab delegations were joined by many other countries as they demanded an immediate halt to the fighting – calls that were echoed by a group of anti-war rabbis in the gallery. US deputy ambassador Robert Wood repeated that Washington was working to secure a “pause” in the Israel-Hamas war and the release of 136 Israeli hostages in Gaza. He said it was “striking” that those urging an end to the conflict had made very few demands of Hamas, whose 7 October attack on southern Israel sparked the war. View image in fullscreen US envoy Robert Wood speaking at the UN general assembly in New York City. Photograph: Shannon Stapleton/Reuters The US only got support from Israel. A ceasefire would be “a victory for Hamas … to continue the reign of terror in Gaza”, said Israel’s UN ambassador, Gilad Erdan. He said Israel supported delivering aid to Gaza but accused Hamas of “looting” humanitarian assistance before it got to civilians. He also accused the UN of doing “nothing” to bring the hostages home. About 36 rabbis from the group Rabbis 4 Ceasefire, which opposes Israel’s ongoing military action, came to the UN as tourists. The majority of them briefly held signs in the empty security council chamber saying “Biden Stop Vetoing Peace”. A small group did the same in the gallery of the general assembly chamber before being hustled out by UN security officers. Riyad Mansour, the UN Palestinian ambassador, told the assembly his people were “being slaughtered”, with entire families killed, and stressed that “the horrors need to end, and the only way to end them is a ceasefire”. This is Adam Fulton picking up our live coverage – stay with us for the latest developments\nUpdated at 01.06 CET\n9 Jan 2024 23.40 CET Jeremy Corbyn to join South Africa’s delegation accusing Israel of genocide The former UK Labour leader, Jeremy Corbyn, will join a South African delegation for this week’s hearings at the international court of justice (ICJ), where the country has accused Israel of genocide in Gaza. South Africa’s justice ministry said Corbyn was one of a number of “senior political figures from progressive political parties and movements across the globe” who will join the South African delegation at The Hague for two days of preliminary hearings which begin on Thursday. South Africa has accused Israel of genocide in its campaign against Hamas in Gaza, saying among other things that it has the “specific intent … to destroy Palestinians in Gaza as a part of the broader Palestinian national, racial and ethnical group”. In its 84-page filing, it also says Israel has failed to prevent genocide and failed to prosecute officials who have publicly incited genocide. Corbyn expressed support for South Africa’s case against Israel on Monday and criticised the British government in a social media message. “Every day, another unspeakable atrocity is committed in Gaza,” he wrote. Millions of people around the world support South Africa’s efforts to hold Israel to account. Why can’t our government? View image in fullscreen Former Labour Party leader Jeremy Corbyn pictured on 16 January 2023. Photograph: Kirsty O’Connor/PA\n9 Jan 2024 23.28 CET Médecins Sans Frontières says strike on Gaza shelter killed staff member's five-year-old daughter Médecins Sans Frontières (MSF) has condemned “in the strongest possible terms” a strike on an MSF shelter in Khan Younis in the south of the Gaza Strip on Monday. A five-year-old daughter of an MSF staff worker was critically injured by the strike and underwent surgery at a hospital, the medical charity said. She later died of her injuries on Tuesday, it said. In a statement, MSF said that more than 100 staff and their family members had been sheltering in the building on Monday morning when a shell broke through the wall. Thomas Lauvin, MSF project coordinator in Gaza, said: We are outraged and deeply saddened by the death of yet another family member of our MSF staff. This strike on civilians is unacceptable and, once again, goes to show that it doesn’t matter where you are in Gaza, nowhere is safe. The shell did not detonate on impact, otherwise many more of our staff and their families would have most likely been killed. The charity said it had notified Israeli forces that the shelter was housing MSF staff and their families, and that no evacuation orders were issued before the strike. It added: While MSF is not able to confirm the origin of the shell, it appears to be similar to those used by Israeli tanks. Four of MSF’s staff have been killed since the beginning of the war in addition to numerous family members, it said.\n9 Jan 2024 23.08 CET A meeting between the US secretary of state, Antony Blinken, and Israel’s prime minister, Benjamin Netanyahu, in Tel Aviv earlier today was “tense”, according to a report. The Times of Israel reported, citing a Channel 12 story, that Washington is losing its patience over Tel Aviv’s outlook on its war with Hamas in Gaza. The outlet noted that the Israeli prime minister’s office did not release a readout of the meeting, as it usually does. Matthew Miller, a US state department spokesperson, said after the meeting that Blinken had reaffirmed to Netanyahu the US’s support for Israel’s attempts to stop any repeat of the Hamas attack of 7 October but “stressed the importance of avoiding further civilian harm and protecting civilian infrastructure in Gaza”. View image in fullscreen Israeli prime minister Benjamin Netanyahu (R) meeting with the US secretary of state, Antony Blinken, at the Kirya military base in Tel Aviv, Israel, on Tuesday. Photograph: Government Press Office/EPA\nUpdated at 23.54 CET\n9 Jan 2024 22.44 CET Hezbollah denies Israel's claim that it killed senior Hezbollah leader Hezbollah has denied a claim by the Israeli military that it killed the southern Lebanon commander of Hezbollah’s aerial unit, Ali Hussein Barji, in an airstrike on Tuesday. In a statement, Hezbollah said “the commander was never subjected to any assassination attempt as the enemy claimed.”\n9 Jan 2024 22.29 CET Belgium's deputy prime minister voices support for genocide case against Israel Belgium’s deputy prime minister, Petra De Sutter, has expressed support for South Africa’s case accusing Israel of genocide in Gaza. Posting to social media, De Sutter said she wants Belgium to take action at the international court of justice (ICJ), following the lead of South Africa. She wrote: Belgium cannot stand by and watch the immense human suffering in Gaza. We must act against the threat of genocide. Belgium cannot stand by and watch the immense human suffering in Gaza. We must act against the threat of genocide.\nI want Belgium to take action at the International Court of Justice, following the lead of South Africa.\nI will propose this within the Belgian government. #begov — Petra De Sutter (@pdsutter) January 9, 2024 South Africa has launched a case against Israel at the UN’s international court of justice (ICJ) accusing the state of committing genocide in its military campaign in Gaza. Israel has responded to the allegations “with disgust”, calling South Africa’s case a “blood libel” and urging the ICJ to reject it.\n9 Jan 2024 22.22 CET A Palestinian journalist has said he was subjected to beatings and torture during more than a month of detention by Israeli forces. Diaa al-Kahlout, the Gaza bureau chief of the London-based media outlet The New Arab, was arrested by the Israeli army in Beit Lahia city in north Gaza on 7 December and detained without charge for several weeks, the outlet said. He was among dozens of Palestinians shown detained by Israeli troops and stripped to their underwear last month, the Qatari-owned outlet said. In an interview, Kahlout described the Israeli army’s treatment of himself and other detained Palestinians as “indescribably tough and difficult”. He said: The moment I was detained, Israeli soldiers crowded round me and I heard the word “journalist” said more than once, before they gagged me with tape so I couldn’t speak. They were mocking journalists and their work. He said he was subjected to beatings and torture several times by agents of Israel’s internal security agency, Shin Bet. He said he spent 25 out of the 33 days of his detention forced to remain in a kneeling position, which caused him severe pain.\n9 Jan 2024 22.03 CET Houthis claim it targeted vessel in Red Sea We reported earlier that the UK maritime trade operations (UKMTO) said it received a report of an incident in the Red Sea near Yemen. A Yemeni military source has told Al Jazeera that the Houthis had targeted a ship linked to Israel in the Red Sea. Yemen’s Iranian-backed Houthi rebels have stepped up attacks on commercial vessels in the Red Sea in protest against Israel’s war in Gaza.\n9 Jan 2024 21.43 CET Leaders of Egypt, Jordan and Palestinian Authority to meet at summit on Gaza The leaders of Egypt, Jordan and the Palestinian Authority, which administers parts of the Israeli-occupied West Bank, will meet tomorrow to discuss the war in Gaza and surging violence in the West Bank. Jordan’s King Abdullah II will host a summit with the Egyptian president, Abdel Fattah el-Sissi, and the Palestinian president, Mahmoud Abbas, on Wednesday in the southern Red Sea city of Aqaba, according to a statement issued by Jordan’s royal court. The leaders will discuss the “serious developments” in the Gaza Strip as well as “the situation in the West Bank”, it said. The meeting will be held as part of “Jordan’s efforts to coordinate Arab positions to push for an immediate ceasefire in Gaza and ensure the uninterrupted delivery of humanitarian aid”, it said. View image in fullscreen Egypt's President Abdel Fattah El-Sisi and Jordan's King Abdullah during a summit on the conflict in Cairo, Egypt, 27 December 2023. Photograph: Egyptian Presidency/Reuters\n9 Jan 2024 21.24 CET The UK maritime trade operations (UKMTO) said it received a report of an incident in the Red Sea near Yemen. In a social media post, it said it received a report of an incident in the Red Sea approximately 50 nautical miles west of Al Hodeidah. Authorities were investigating, it added. /www.ukmto.org/indian-ocean/products/warnings/2024#MaritimeSecurity #MarSec pic.twitter.com/vC2mLzJxmm — United Kingdom Maritime Trade Operations (UKMTO) (@UK_MTO) January 9, 2024\n9 Jan 2024 21.15 CET IDF says it killed senior Hezbollah commander The Israel Defense Forces (IDF) said it has killed the southern Lebanon commander of Hezbollah’s aerial unit, Ali Hussein Barji, in an airstrike on Tuesday. IDF spokesperson Daniel Hagari said the Hezbollah commander had led dozens of drone attacks on Israel. The IDF statement came after reports that an Israeli strike in southern Lebanon had killed a top Hezbollah commander.", "source_domain": "www.theguardian.com", "text": null, "title": "Médecins Sans Frontières says strike on Gaza shelter killed staffer’s daughter, 5 - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/09/middle-east-crisis-live-updates-hamas-israel-gaza-palestine-war-us-antony-blinken-tel-aviv-visit"}