{"authors": ["Dave Mcmenamin", "Tim Bontemps", "Adrian Wojnarowski", "Tim Macmahon", "Steve Alexander", "Espn Staff Writer", "Espn Insiders"], "date_download": "2024-02-05 15:19:29", "date_modify": "None", "date_publish": "2024-01-09 19:57:00", "description": "In the month since their in-season tournament triumph, the Lakers have battled through injury, defensive issues, unfamiliar lineups and mounting losses. Truth is, the next month could be even more consequential.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fnba%2Fstory%2F_%2Fid%2F39272122%2Flakers-post-nba-cup-rut-lineup-drama-defensive-woes-nba-trade-deadline-impact.json", "image_url": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0109%2Fr1275288_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "Lakers coach Darvin Ham talks about his job security after an anonymous source cited a \"deepening disconnect\" between Ham and the locker room. (1:51)\nOpen Extended Reactions\nTHE FIRST SIGNS of trouble came in Dallas.\nIt was Dec. 12, the Los Angeles Lakers' first game since capturing the NBA's inaugural in-season tournament in Las Vegas. And Mavericks guard Dante Exum, the former No. 5 pick who had played in Spain and Serbia the past two seasons, was cooking.\nIt started with an open 3-pointer a couple of minutes into the first quarter, with LeBron James intentionally giving Exum space so he could clog up a driving lane for Luka Doncic. It ended with a dagger 3 from the corner with 52.1 seconds to go to put the Mavs up by seven.\nExum, starting in place of the injured Kyrie Irving, had hit eight 3-pointers all season, on 28 attempts. He hit 7 of 9 against the Lakers.\n\"Operation successful; patient dies,\" L.A. coach Darvin Ham said looking back at the Lakers' 127-125 loss, referencing a saying former Milwaukee Bucks coach Mike Budenholzer often used while Ham was an assistant with the team.\n\"The game plan executed. It worked out. We limited the opportunities for the main threats on the opposing team, but the guy who the ball was filtered to stepped up and made shots. ... Do you stay home with Dante and give Luka all the freedom in the world?\"\nWhile the strategy backfired -- Dallas, as a team, went 21-for-43 from 3 -- it was a decision made out of necessity.\nThe team didn't have the personnel to both contain Doncic and pivot to the hot shooter. The Lakers' best on-ball defender, Jarred Vanderbilt, was out with a lower back injury. Gabe Vincent, signed in the offseason to provide perimeter defense and shooting, was out with a left knee injury that has limited him to just five games and will sideline him for at least another month.\nMaking matters worse, the loss in Dallas was the first night of a road back-to-back, with a date with the struggling San Antonio Spurs the following day. The team had internally discussed a plan to play stars James and Anthony Davis against Dallas, then rest both the next night in San Antonio, sources told ESPN, with Davis dealing with lingering hip discomfort and the franchise being cognizant of James' workload as a 21-year veteran.\nComing off a loss and not wanting to risk another, James sat and Davis played, turning his ankle in the first minute but pushing through to score 37 points in 38 minutes. L.A. staved off a 45-30 fourth-quarter rally by Victor Wembanyama & Co. to win by three.\nThe Lakers' issues, just days after their IST championship win over the Indiana Pacers, were just beginning to surface. They'd ultimately swell to a 4-10 post-tournament stretch that has been ravaged by a whack-a-mole approach to injuries, defensive lapses and crescendoing whispers of lineup inconsistencies and unhappiness.\n\"We're all aligned,\" Ham said last week, adding he has the support from Lakers governor Jeanie Buss and vice president of basketball operations Rob Pelinka.\nplay 1:51 'I'm solid!' Darvin Ham feels support from Lakers brass Lakers coach Darvin Ham talks about his job security after an anonymous source cited a \"deepening disconnect\" between Ham and the locker room.\nA front office source acknowledged Ham's room for growth as a second-year coach, but told ESPN that the team hired Ham for his strength of character, toughness and presence -- knowing full well that the bright lights can burn in Laker Land. Ham got the job, in part, because they believed he was built to withstand it.\nIt has all led to now: one month until the NBA's Feb. 8 trade deadline, with an underachieving roster around a superstar duo currently enjoying some of the healthiest stretches of their L.A. careers.\n\"I guess I got a small sample size of what we can do when we're whole, but I have more of a larger pie of what we look like when we're not,\" James said at the end of December, in the midst of L.A.'s monthlong rut. \"So that's a discouraging part right there.\n\"But no excuses because everybody goes through injuries and everybody goes through travel and things of that nature. This league is built on that so we just have to figure it out.\"\nTHE MORNING AFTER the Lakers fell to the New York Knicks inside Crypto.com Arena on Dec. 18 -- one of their few respites from a road-heavy December -- the team boarded a plane to Chicago, the first of a three-game road trip. They'd lost three of four.\nDuring the four-hour flight, and hoping to stop the slippage, Ham and his coaching staff decided to show the team the defensive numbers it had generated during its run to the Western Conference finals last season -- the Lakers were the No. 5 defense during the 2023 playoffs -- compared to their performance on defense this season (No. 12 in the league).\nThe message delivered in Chicago, sources said, was simple: \"We won't accomplish anything this season unless we become an elite defensive team again.\"\nThey were far from it against the Bulls just a day later. Despite a full roster available for the first time all season, L.A. allowed 124 points on 54.5% shooting, an 18-for-34 showing on 3s and eight Bulls to score double digits. (After limiting opponents to 32% shooting on 3s across seven IST games, the Lakers are allowing 42% from deep since, the third-highest mark in that span.)\nAfter the loss in Chicago, the Lakers' third straight, James and Davis hinted at two more issues beyond the arduous schedule and persistent injuries that had been weighing down the team: the looming trade deadline and the coaching staff's inconsistent rotations.\n\"No help coming,\" Davis said. \"There's no cavalry. We've got to do it within this locker room.\"\nSaid James: \"We had a lineup out there tonight obviously that we haven't played with all season, and Chicago was able to make a run when that lineup was out on the floor. So it's something we got to work through.\"\nThe previous time the Lakers had dropped three in a row, falling to 3-5 after a 34-point loss to the Houston Rockets in early November, Ham had changed the starting lineup by swapping Cam Reddish in place of Austin Reaves.\nThe move worked. L.A. won 12 of its next 16 games, and the franchise secured the inaugural NBA Cup.\n\"You can't just keep, on a whim, changing,\" Ham said after the Bulls loss, when asked if another shuffling of the starters would be coming. \"That's a big deal when you change your starting lineup at this level.\"\nBut after a loss to the Minnesota Timberwolves on Dec. 21 extended the losing streak to four, Ham did indeed change the starters. With Vincent's return lasting just one game before he opted for arthroscopic surgery on his left knee, D'Angelo Russell, who had started 28 of the first 29 games, was moved to the bench to fill the backup point guard role that Vincent had been signed in the offseason to occupy.\nIn his place, Ham went with a big, switchable group of Davis, James, Vanderbilt, Reddish and Taurean Prince, hoping to up the team's defensive impact.\nThe lineup change, sources told ESPN, was not a unilateral decision -- Ham consulted with James and Davis on the concept -- and its results were immediate: The Lakers beat the Thunder on Dec. 23, with James putting up a vintage 40 points and L.A. dishing a season-high 37 assists.\n\"We needed this win,\" James said.\nAS THE LAKERS constructed their roster this past summer -- L.A. kept last season's core mostly intact while adding backup talent at key positions -- talk around the team was whether its abundance of depth, not a lack of it, would become an issue.\n\"Believe me, it's a great problem to have,\" Ham said before training camp. \"You can never have too many good players.\"\nNBA on ESPN+ Get access to exclusive original series, premium articles from our NBA insiders, the full 30 for 30 library and more. Sign up now to unlock everything ESPN+ has to offer.\nBetween the Lakers' IST win and Jan. 6, their players collectively missed 31 games with injury, a total that ranked just 15th in the league over that span but an issue that proved far more dire for L.A.\nBeyond Vincent's knee, Vanderbilt is still working back into form after missing the first 20 games with bursitis in his left heel; Hachimura missed four games with a concussion, another five games with a broken nose and currently three games and counting with a strained calf; Reddish's groin injury has lingered and its kept him out of back-to-backs as a preventative measure, sources told ESPN; and Russell just missed three straight games with a bruised tailbone.\nOn Monday, in a 106-103 win over their in-city rivals, the Lakers' fortunes finally took a turn for the better.\nSeveral elements aligned against the Clippers -- the Lakers' defense holding the Clips to below 40% shooting; James and Davis leading the charge; Russell returning from his tailbone injury; key bench contributions from Max Christie and Christian Wood making plays on both ends; another short commute to the downtown L.A. arena.\nThe win -- just their second since Christmas -- was secured, but not before it \"got real noisy,\" Ham said, when asked about the \"outside panic\" that came with his team's downturn.\n\"But,\" he added, \"take a little deep breath.\"\nThe franchise might not have time to. The next month -- culminating with the Feb. 8 trade deadline -- could prove far more consequential than the one the Lakers just endured. (Many contracts around the league signed in the offseason, including those of Hachimura and Reaves, will become eligible to be traded Monday.)\nAnd with eight of the Lakers' next nine games in Los Angeles before a six-game trip at the end of the month, this stretch could show whether the Lakers are a conference finals contender, a first-round flameout, or worse.\nOf all forces affecting the course of this season, the steadiest presence has been Davis, who has played in 35 of 37 games, and James, who has played in 34. L.A.'s superstar duo has proved to be healthy enough and dominant enough for a franchise that values its championship pedigree above all else to supplement it with as many reinforcements as possible.\nJames' patience has been tested, sources told ESPN, but he figures his best response to the slump is to lead by example on and off the court and hope everyone in the organization applies the same standard. James consults with the coaching staff when called upon and joins dialogue with the front office when scenarios are brought to him, but his focus remains maximizing his role.\nThere's a risk to canvassing the trade market, almost assuredly parting with a future draft pick to combine with one of the players the Lakers would send out.\nFor example, any deal to acquire Zach LaVine -- the Bulls have been linked to the Lakers as a potential trade destination -- and his $40 million salary would almost certainly require the inclusion of Russell's $17.3 million contract. (After the Lakers loss in Chicago last month, multiple sources told ESPN they worried Russell's 1-for-6 performance could have been affected by the opponent.)\nAnd sometimes moves simply don't work out. Sources told ESPN that every member of the organization involved in the Russell Westbrook trade -- including James - will admit they misjudged it, owning part of the blame.\nHowever, there's also a risk in assuming James, in his 21st season, will be able to sustain this big of a workload -- he's played at least 37 minutes in 10 of his past 12 games -- while L.A. waits for the roster to get healthy.\nAnd a similar risk is taking for granted this healthy window for Davis. He's played in 82 of the Lakers' past 87 games dating to Jan. 25, 2023; in the 2½ seasons that preceded it, he missed 107 of 203 games because of injuries.\nPerhaps the only good thing about the Lakers' recent lapse was its timing.\nThere are still potential deals to be made, roster pivots to be pondered. Just last season, Pelinka pulled off a series of in-season moves to ignite a playoff push.\nThe team has shown signs of needing tinkering again, otherwise that in-season tournament banner that hangs in the rafters could stop signifying something exciting and morph into a reminder of a season gone awry.\n\"Things not going your way, you can't ball up in the corner somewhere and go cry about it,\" Ham said on Jan. 3, after the Lakers fell to a Miami Heat team without Jimmy Butler.\n\"There's a lot of time left -- but the time is precious.\"\nESPN NBA insider Kevin Pelton contributed to this story.", "source_domain": "www.espn.co.uk", "text": null, "title": "Lakers' post-NBA Cup rut", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/nba/story/_/id/39272122/lakers-post-nba-cup-rut-lineup-drama-defensive-woes-nba-trade-deadline-impact"}