{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:14:49", "date_modify": "None", "date_publish": "2024-01-30 11:47:06", "description": "Biden's response options could range anywhere from targeting Iranian forces outside to even inside Iran, or opting to attack solely against the Iran-backed militants responsible.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13022391%2FBiden-retaliate-Iran-terrorists-world-war-3.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/30/11/80627803-0-image-a-25_1706615177813.jpg", "language": "en", "localpath": null, "maintext": "The heinous killing of three US troops, the first American servicemen to be killed in the region since the Hamas' October 7 attack on Israel, by Iran-backed terrorists has heaped pressure on the Biden administration to react swiftly and decisively.\nThe response is complicated by a number of factors, including the fact that this is an election year as well as Biden's reluctance to escalate the conflict in the Middle East.\nBiden's options could range anywhere from targeting Iranian forces outside to even inside Iran, or opting for a more cautious retaliatory attack solely against the Iran-backed militants responsible with financial penalties also possible.\nThe military released the names of the victims killed in Jordan at the weekend, the youngest of which was a 23-year-old Army Reserve specialist, Breonna Alexsondria Moffett.\nThe others were named as U.S. Army Reserve Sgt. William Jerome Rivers and Spc. Kennedy Ladon Sanders.\nIran has suggested any strikes within Iran itself would cross a red line. Former CIA chief of staff Jeremy Bash said escalation is 'unavoidable'.\n'[The president] cannot avoid the international challenges even in an election year.' He added: 'There is a sense that our deterrence measures to date have not been received by Tehran as we hoped, so escalation is unavoidable.'\nAmerican forces in the Middle East have been attacked more than 150 times by Iran-backed forces in Iraq, Syria, Jordan and off the coast of Yemen since the Israel-Hamas war erupted in October.\nBut until Sunday's attack on a remote outpost known as Tower 22 near Jordan's northeastern border with Syria, the strikes had not killed US troops nor wounded so many.\nThat allowed Biden the political space to mete out US retaliation, inflicting costs on Iran-backed forces without risking a direct war with Tehran.\nRepublicans in general accused Biden of letting American forces become sitting ducks, waiting for the day when a drone or missile would evade base defenses. They say that day came on Sunday, when a single one-way attack drone struck near base barracks early in the morning.\nIn response, they say Biden must strike Iran. The Pentagon maintains that it is weighing up all possible options.\nSo what options are available to Biden if he needs to ‘hit back hard’ without spiraling the Middle East conflict into World War III.\nTarget drone-making factories\nThe map shows the exact locations where US forces have been hit since October 7\nFrom left to right: Spc. Kennedy Sanders, Sgt. William Jerome Rivers and Spc. Breonna Alexsondria Moffett. The three U.S. Army Reserve soldiers from Georgia were killed by a drone strike on Sunday\nA much-talked about target for US forces would be the factories that produce the drones that have been leading the attacks in the region.\nAlthough striking these would likely force Biden to authorize hitting targets within Iran's borders.\nThe Iranian government has said that a direct strike on its sovereign land would be considered a 'red line,' according to Politico.\nAccording to a 2023 article in The New Arab, Iran maintains clandestine drone factories across the Middle East and as far away as Venezuela.\nAn Iranian drone base is a possible target for US retaliatory strikes\nThe country also publicly built one in Tajikistan's capital in 2023 and was planning to build one in Russia too.\nDespite the presence of these factories, Farzin Nadimi, a defense and security analyst and Associate Fellow of the Washington Institute for Near East Policy, told the website that the largest drone making facilities outside of Iran were in southern Lebanon, Hezbollah's stronghold, and Yemen, where production is controlled by the Houthis.\nNadimi suggested that the Iranians are deliberately secretive about these facilities because of the likelihood of them becoming targets for the Israeli or American air forces.\nTake out Iranian Generals\nIranian Quds Force commander Qassem Soleimani pictured in 2016\nThe commander of the Quds Force of the Islamic Revolutionary Guard Corps, Esmail Qaan speaking earlier this month in front of an image of Soleimani\nCharles Lister of the Washington-based Middle East Institute said the US had gone after Iranians outside of Iran in the past, like the 2020 strike against top Iranian general Qassem Soleimani, and only yielded a response during a limited period of time.\n'So to an extent, if you go hard enough and high enough, we have a track record of showing that Iran can blink first,' Lister said.\nSoleimani was the leader of the military intelligence wing of the Iranian Revolutionary Guard known as the Quds Force. The group's current leader is Brig. Gen. Esmail Qaani.\nIn 2020, the Iranian government alleged that the US had been issuing death threats against Qaani.\nIslamic Revolutionary Guard Corps (IRGC) members march during the annual pro-Palestinians Al-Quds, or Jerusalem, Day rally in Tehran in 2022\nFollowing the killing of Soleimani, Qaani was quoted by Al-Jazeera as saying: 'We tell everyone, be patient and see the dead bodies of Americans all over the Middle East.'\nThomas Spoehr, a retired Army lieutenant general and national security consultant, told Bloomberg that the Pentagon should focus on hitting 'uniformed Iran service members.'\n'I don't think these people are hard to find,' he added.\nLister said a likely response would be to go after a significant target or high-value militant from Iran-backed groups in Iraq or Syria.\n'What happened this morning, was on a totally different level than anything these proxies have done in the past two to three months... (but) despite all of the calls to do something in Iran, I don't see this administration taking that bait,' Lister said.\nMulti-day air campaign against Iran's proxies\nWashington and Gulf Arab states have repeatedly accused Iran of arming, training and financing the Houthis, who follow an offshoot of Shi'ite Islam and are aligned with Tehran as part of its anti-Western, anti-Israel 'Axis of Resistance' alongside Lebanon's Hezbollah and groups in Syria and Iraq.\n'They will attack Iranian proxies in Iraq,' Hamid Hosseini a union official close to the Iranian government told the Wall Street Journal this week.\nAnother Iranian official speaking to the WSJ said that he expected attacks on 'pro-Iranian militias.' Earlier this month, the US struck militia facilities in Jurf al-Sakhar, which is south of Baghdad, al-Qaim and another unnamed site in western Iraq.\nDespite not being attacks on mainland Iran, the official said that those strikes would nonetheless invoke a 'cycle of revenge that could spiral out of control.'\nAn unnamed US official pointed to likely targets in eastern Syria, in particular the city of Deir ex-Zor, where militia groups backed by the Iranian Revolutionary Guard are located. 'It's going to be a shooting range,' that official said.\n'A multiday air campaign against all proxies, coupled with a 'last chance warning' to Iran is warranted,'' said James Stavridis, a retired Navy admiral who now works for the Carlyle Group, told The New York Times.\n'The Pentagon should be creating options that go directly against Iranian weapons production facilities, naval assets and intelligence systems in case the mullahs want to go another round.'\n'A strong offensive cyberattack would be another viable option, either alone or in conjunction with kinetic strikes,' he added.\nThe US military's most recent strike against militants came when three bases used by the Iranian proxy Kataib Hezbollah in Iraq. That group was responsible for the attack on the US Al-Asad base in Iraq.\nTarget Iran's missile sites and air bases\nA handout photo made available by the Iranian Army on 28 May 2022, shows drones in an underground drone base, in an unknown location\nJonathan Lord, director of the Middle East security program at the Center for a New American Security, said striking directly inside Iran would raise questions for Tehran about regime survival.\n'When you do things overtly you represent a major escalation for the Iranians,' Lord said.\nA U.S. defense official, speaking on the condition of anonymity, said it was unclear what the second and third order effects would be in going after Iran.\n'Unless the U.S. prepared for an all out war, what does attacking Iran get us,' the official said.\nThe BBC reports that Iran could react to a direct strike by shutting down the Strait of Hormuz, which is where 20 percent of the world's oil is transported through. An action like that could hit Biden hard at the polls at home.\nTrump backed away from attacking Iran in November 2020, shortly after the election.\nHe asked for options on attacking Iran's main nuclear site, a day after a U.N. watchdog report showed Iran had finished moving a first cascade of advanced centrifuges from an above-ground plant at its main uranium enrichment site to an underground one, in a fresh breach of its 2015 nuclear deal with major powers.\nBut Trump ultimately decided against taking the dramatic step, privately worrying about the implications of an all-out war with Iran.\nOn Sunday, Trump said he would have been tougher against Iran. 'Three years ago, Iran was weak, broke, and totally under control,' he wrote on Truth Social.\n'Thanks to my Maximum Pressure policy, the Iranian Regime could barely scrape two dollars together to fund their terrorist proxies.'\nHitting Iranian naval assets in Persian Gulf\nAlso among the possible responses for the Biden administration is hitting Iranian naval units in the Persian Gulf.\nCENTCOM, the name of the Department of Defense's operations in the Middle East, is already battling Houthi attacks in the Red Sea and Gulf of Aden.\nSince October 7, the Pentagon has been routinely sending more naval and air forces to the area in order to deter attacks from Hezbollah militants.\nAs far back as August, prior to the Hamas attack, Tehran warned the US against building up its military in the gulf.\nThat action may have prompted Tehran to beef-up its military support of proxy groups in the region, reported Al Jazeera at the time.\nIt was reported that the Pentagon may even put US personnel on commercial ships in order to prevent the Iranian navy from seizing them, a practice that has been common since 2019.\nEconomic sanctions\nRussian President Vladimir Putin and Iranian President Ebrahim Raisi pictured together in December. The US's European allies have grown frustrated with the leader's close relationship, reports say\nEconomic sanctions against high-ranking Iranians and/or companies are considered likely.\nRepublicans have stressed that the effects of sanctions are limited and that the Iranian government will only back down if it is met with force.\nIran is possibly the most economically sanctioned country in the world. However, many of those sanctions are not fully imposed by other countries. Biden could put pressure on allies not to do business Iran, thus impacting its ability to fund proxies.\nThe Wall Street Journal reports that the complication comes because China is currently Iran's biggest customer when it comes to oil.\nThe US has been eager to maintain good relations with Beijing due to the situation with Taiwan.\nThe Journal also reports that European allies would be more willing to go along with ramping up sanctions against Tehran as they grow irritated by the Iran's ongoing military co-operation with Putin's Russia.\nIn the wake of October 7, the Biden administration was widely criticized for the $6 billion in funds that was returned to the Iranians as part of a hostage swap in September 2023.\nThe $6 billion was Iranian money that had been frozen in South Korean banks. After Washington, under former President Donald Trump, placed a total ban on Iran's oil exports and sanctions on its banking sector in 2019, these Iranian oil revenues were blocked in Seoul.\nCyber attack code-named Nitro Zeus\nDuring his time in office, President Barack Obama directed US intelligence agencies to come up with a plan for a mass cyber attack on Iran\nSince 2016, the US intelligence network has been working on a mass cyber attack project known as Nitro Zeus.\nThe New York Times reported at the time that the plan would impact Iran's power grid, air defenses and general communications.\nThe plan was eventually shelved when Iran agreed to then-President Barack Obama's historic nuclear deal. However, ex President Donald Trump tore up the deal shortly after taking office.\n'Nitro Zeus was part of an effort to assure President Obama that he had alternatives, short of a full-scale war, if Iran lashed out at the United States or its allies in the region,' the Times reported at the time.\nThe newspaper added that the plan involved thousands of personnel working day-and-night to ensure its effectiveness.\nRepublicans meanwhile have been left outraged by the loss of American life in the region and are demanding retaliation.\n'He left our troops as sitting ducks,' said Republican Senator Tom Cotton. 'The only answer to these attacks must be devastating military retaliation against Iran's terrorist forces, both in Iran and across the Middle East.'\nThe Republican who leads the US military oversight committee in the House of Representatives, Representative Mike Rogers, also called for action against Tehran.\n'It's long past time for President Biden to finally hold the terrorist Iranian regime and their extremist proxies accountable for the attacks they've carried out,' Rogers said.\nRepublicans meanwhile have been left outraged by the loss of American life in the region and are demanding retaliation\nFormer President Donald Trump, who hopes to face off against Biden in this year's presidential election, portrayed the attack as a 'consequence of Joe Biden's weakness and surrender.'\nThe Biden administration has said that it goes to great lengths to protect U.S. troops around the world.\nOne Democrat openly voiced concern that Biden's strategy of containing the Israel-Hamas conflict to Gaza was failing.\n'As we see now, it is spiraling out of control. It's beginning to emerge as a regional war, and unfortunately the United States and our troops are in harms way,' Democratic Representative Barbara Lee said, renewing calls for a ceasefire in the Israel-Palestinian war.\nDemocratic Representative Seth Moulton, who served four tours in Iraq as a Marine, urged against Republican calls for war, saying 'deterrence is hard; war is worse.'\n'To the chicken hawks calling for war with Iran, you're playing into the enemy's hands—and I'd like to see you send your sons and daughters to fight,' Moulton said. 'We must have an effective, strategic response on our terms and our timeline.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "How will Biden retaliate after Iran-backed drone strike killed three US soldiers? From hitting Iranian naval assets to a multi-day air campaign or cyber-attacks a look at options as 'World War Three'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13022391/Biden-retaliate-Iran-terrorists-world-war-3.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}