{"authors": ["Yohannes Lowe", "Rachel Hall", "Warren Murray"], "date_download": "2024-02-05 15:19:30", "date_modify": "None", "date_publish": "2024-01-09 16:06:17", "description": "Fuel facility struck in the city of Oryol, 230 miles south of Moscow and 137 miles from the Ukrainian border", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F09%2Frussia-ukraine-war-latest-news-updates.json", "image_url": "https://i.guim.co.uk/img/media/a0b7ce10263d50fa26e904a3a545fb35304ab11e/0_0_4227_2536/master/4227.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=ef8a839446bd6dd6d553300cf84eb857", "language": "en", "localpath": null, "maintext": "From 9 Jan 2024 14.00 CET Two drones hit fuel facility in Russian city of Oryol, governor says Two drones hit a fuel facility in the Russian city of Oryol, 230 miles south of Moscow and 137 miles from the Ukrainian border, the local governor has said. Andrei Klychkov said on Telegram that a fire at the complex caused by the drone attack had been contained. He posted on Tuesday morning: During an attack by enemy UAVs on the facilities of the fuel and energy complex of the Oryol region, three people were injured and received moderate injuries. They are given the necessary help. Two refused hospitalisation. Emergency services are at the scene of the incident.\n9 Jan 2024 16.50 CET Closing summary Ukraine’s president, Volodymyr Zelenskiy , will deliver a “special address” to the World Economic Forum (WEF) in Davos next week, the WEF said. The conflict in the Middle East is set to dominate the annual forum, held this year under the theme Rebuilding Trust, AFP reported.\nTwo drones hit a fuel facility in the Russian city of Oryol , 230 miles south of Moscow and 137 miles from the Ukrainian border, the local governor has said. Andrei Klychkov said on Telegram that a fire at the complex caused by the drone attack had been contained.\nUkraine’s power grid operator said earlier that severe winter weather has left more than 1,000 towns and villages without electricity in nine regions, as the energy system has been weakened by Russian strikes. Ukraine had to import electricity from neighbouring Romania and Slovakia to be able to meet the demand, Ukrenergo said.\nHungary has indicated that it might lift its veto over EU aid to Ukraine if the funding is reviewed each year, Politico reported. Three EU diplomatic sources said Budapest indicated it might withdraw its opposition if the European Council unanimously approves the funding on a yearly basis, meaning Hungary’s prime minister, Viktor Orbán , could extract concessions from the bloc.\nThe Kremlin said the Russian military would do everything in its power to tackle an increase in Ukrainian shelling of the border city of Belgorod , which has come under extensive shelling and drone attacks for months.\nUkraine has a deficit of anti-aircraft guided missiles, air force spokesperson Yuriy Ihnat was quoted as saying. “Ukraine has spent a considerable reserve on those three attacks that took place,” Ihnat told Ukrainian TV. “It is clear that there is a deficit of anti-aircraft guided missiles.”\nUpdated at 17.06 CET\n9 Jan 2024 16.32 CET The governor of the Bryansk region, Alexander Bogomaz, has reported the destruction of a drone, which he says did not cause any damage or injury. Bryansk borders Ukraine to the north-east. Bogomaz wrote on Telegram: An aircraft-type unmanned aerial vehicle was destroyed over the Bryansk region by air defense forces of the Russian Ministry of Defence. There were no casualties or damage. Emergency services are working on the spot.\n9 Jan 2024 16.12 CET Zelenskiy due to deliver 'special address' to World Economic Forum next week Ukraine’s president, Volodymyr Zelenskiy, will deliver a “special address” to the World Economic Forum (WEF) in Davos next week, the WEF has said. Zelenskiy, who has made speeches to the WEF via video link in the past, will deliver the speech and meet CEOs, the WEF’s president, Borge Brende, said. “It is taking place against the most complicated geopolitical and geo-economic backdrop in decades,” Brende told a virtual press conference. This year, the annual forum, being held between 15 and 19 January in the Swiss alps, will be under the theme “Rebuilding Trust” and is due to feature Russia’s war in Ukraine in the talks again, but will be dominated by the war in Gaza, AFP reports. It will be attended by numerous world leaders and senior politcians, including Israel’s president, Isaac Herzog, Argentina’s newly elected president, Javier Milei, France’s president, Emmanuel Macron and the US secretary of state, Antony Blinken. 00:01:44 'Tragedies outpacing life': Zelenskiy urges world to speed up response to Russian aggression – video\nUpdated at 16.13 CET\n9 Jan 2024 15.39 CET Sweden is providing about 50m krona (£3.8m) to the Nato assistance fund for Ukraine, the Swedish embassy in Kyiv wrote on X. The government will give 5m krona (£382,000) to Moldova and 5m krona to Georgia. The money will be used for a range of purposes, including the procurement of military equipment, mine clearance, crisis management, cybersecurity and education. You can read the Ministry of Defence’s press release here. The Swedish 🇸🇪 government will provide 50 million SEK to the NATO assistance fund for Ukraine 🇺🇦. This assistance will be used for procurement of military equipment, medicines, fuel, demining and personnel training.\nRead more (in Swedish): https://t.co/Bw8xiVnvWo — Sweden in Ukraine (@SwedeninUA) January 9, 2024\nUpdated at 15.41 CET\n9 Jan 2024 15.26 CET Roman Starovoit, the governor of the Kursk region, said his region had seen a deadly attack. “This afternoon, the village of Gornal, Sudzhansky district, was shelled from the Ukrainian side. A woman died from shrapnel,” Starovoit wrote on Telegram. He added that two houses were damaged by the shelling.\nUpdated at 15.27 CET\n9 Jan 2024 14.40 CET Russia’s most prominent jailed opposition politician, Alexei Navalny, has heaped ironic praise on the polar conditions at the prison north of the Arctic Circle where he was moved to shortly before Christmas. Reuters reports: Navalny, 47, was tracked down to the IK-3 penal colony in Kharp in the Yamal-Nenets region, about 1,900 km northeast of Moscow, his supporters said on 25 December. In a post on the Telegram messaging app, Navalny said he had been put in a punishment cell for his attitude as soon as he left quarantine at the so-called “Polar Wolf” prison colony. Navalny said: It has not been colder than -32°C yet.\nNothing quite invigorates you like a walk in Yamal at 6:30 in the morning. Even at this temperature, you can walk for more than half an hour only if you manage to grow a new nose, new ears and new fingers. He posted a picture of his walking yard - concrete walled, topped with metal bars, 11 steps long and three steps wide. Referencing a scene in the 2015 film, The Revenant, in which Leonardo DiCaprio shelters in the carcass of a horse, he said: I don’t think that would have worked here. A dead horse would freeze in 15 minutes. We need an elephant here, a hot elephant, a fried one. The Polar Wolf colony, is considered to be one of the toughest prisons in Russia. Most prisoners there have been convicted of grave crimes. Winters are harsh - and temperatures are due to drop to around minus 28 Celsius there over the next week.\nUpdated at 14.44 CET\n9 Jan 2024 14.31 CET The Italian city of Modena has blocked the use of a public hall to host a private event on the reconstruction of the Ukrainian city of Mariupol, saying it appears to openly support Russia’s war in Ukraine. Reuters reports: The conference and exhibition “Mariupol. Rebirth after the War”, organised by the Russia Emilia-Romagna cultural association, aims to showcase the city’s reconstruction after heavy fighting in 2022. Invited panelists include the Russian consul general in Milan, Dmitry Shtodin, according to the organisers’ website. The council in Modena, in the Emilia-Romagna region, withdrew its approval to use a civic hall for the 20 January event after “new information arose”, it said in a statement. Ukraine’s ambassador, Yaroslav Melnyk, had called it “an open insult to the memory of thousands of civilian victims”. The decision protects “the community from the spread of Russian propaganda in Italy”, the Ukrainian embassy in Rome said on X. Events sympathetic to the Russian cause are multiplying in Italy, with Italian lawmaker Lia Quartapelle, of the centre-left Democratic Party, warning of a “cultural offensive of pro-Putin associations”. “Italy is on the side of Ukraine’s freedom,” she wrote on X. On Monday, Italian-Russian organisation Vento dell’Est said it would reschedule another conference, featuring Russian ultra-nationalist Alexander Dugin, after the venue became unavailable.\n9 Jan 2024 14.12 CET Ukraine’s Ukrgasvydobuvannya, which seeks to supply the country’s gas needs with domestically produced fuel, brought 86 new gas wells into operation in 2023 and extracted 1 billion cubic metres (bcm) of gas from them, the state firm has said.\n9 Jan 2024 14.00 CET Two drones hit fuel facility in Russian city of Oryol, governor says Two drones hit a fuel facility in the Russian city of Oryol, 230 miles south of Moscow and 137 miles from the Ukrainian border, the local governor has said. Andrei Klychkov said on Telegram that a fire at the complex caused by the drone attack had been contained. He posted on Tuesday morning: During an attack by enemy UAVs on the facilities of the fuel and energy complex of the Oryol region, three people were injured and received moderate injuries. They are given the necessary help. Two refused hospitalisation. Emergency services are at the scene of the incident.\n9 Jan 2024 13.39 CET Summary of the day so far... Ukraine’s power grid operator said severe winter weather has left more than 1,000 towns and villages without electricity in nine regions, as the energy system has been weakened by Russian strikes. Ukraine had to import electricity from neighbouring Romania and Slovakia to be able to meet the demand, Ukrenergo said.\nHungary has indicated that it might lift its veto over EU aid to Ukraine if the funding is reviewed each year, Politico reported. Three EU diplomatic sources said Budapest indicated it might withdraw its opposition if the European Council unanimously approves the funding on a yearly basis, meaning Hungary’s prime minister, Viktor Orbán , could extract concessions from the bloc.\nThe Kremlin said the Russian military would do everything in its power to tackle an increase in Ukrainian shelling of the border city of Belgorod , which has come under extensive shelling and drone attacks for months.\nUkraine has a deficit of anti-aircraft guided missiles, air force spokesperson Yuriy Ihnat was quoted as saying. “Ukraine has spent a considerable reserve on those three attacks that took place,” Ihnat told Ukrainian TV. “It is clear that there is a deficit of anti-aircraft guided missiles.”\nUpdated at 13.40 CET\n9 Jan 2024 13.00 CET More than 1,000 Ukrainian towns and villages without electricity, power grid operator says Ukraine’s power grid operator said severe winter weather has left more than 1,000 towns and villages without electricity in nine regions, as the energy system has been weakened by Russian strikes, Reuters reports. Ukrenergo, the state-owned electricity transmission system operator, said electricity consumption was at this week’s highest levels as temperatures fell to about -15 C in many parts of the country. “The consumption level continues to grow due to the considerable drop in temperature across the country,” it wrote on Telegram. Ukraine had to import electricity from neighbouring Romania and Slovakia to be able to meet the demand, Ukrenergo said. ‘Energy war’: Ukraine tries to protect electricity supply before winter Read more It said that electricity consumption this morning was already 5.8% higher than the day before. “As of this morning due to bad weather – strong winds, ice power was cut off in 1,025 settlements,” it added. Ukrenergo said the power system was already working at maximum capacity and urged residents to save electricity as much as possible. The power grid operator said that Ukrainian thermal power plants were still recovering from Russia’s strikes last winter, adding that solar power plants could not work at full capacity due to dense clouds and bad weather. About 10 months into the full-scale invasion, Russia made waves of attacks on power stations and other plants linked to the energy network, prompting rolling blackouts in widely disparate regions.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: drones hit Russian oil facility more than 130 miles from Ukraine - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/09/russia-ukraine-war-latest-news-updates"}