{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:19:31", "date_modify": "None", "date_publish": "2024-01-09 20:06:36", "description": "US secretary of state rejects calls for immediate ceasefire but urges ally to make ‘hard decisions’ as fighting continues", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F09%2Fviolence-in-gaza-persists-as-antony-blinken-seeks-consensus-in-middle-east.json", "image_url": "https://i.guim.co.uk/img/media/4398f7b722618575365bb67d3bc3e13b28897f5e/0_40_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=00344702e35b619a20488155fa02633a", "language": "en", "localpath": null, "maintext": "Anthony Blinken has reaffirmed the United States’ “unique bond” with Israel, and rejected calls for an immediate ceasefire in Gaza but told his hosts in Tel Aviv that other regional powers have made clear that a pathway to the realisation of Palestinian political rights is essential for peace in the region.\nHinting at having held difficult talks with Israeli officials on Tuesday, the US secretary of state said the exceptional friendship between the two countries demanded that the US be “as forthright as possible when the choices matter most” and called for Israel to make “hard decisions”.\nIsrael has so far ruled out calls to allow the internationally recognised Palestinian Authority to govern both Gaza and the occupied West Bank – Washington’s preferred option – and instead suggested some form of governance involving local powerbrokers or clans, with the Israel Defense Forces playing a significant supervisory role.\n“Israel must stop taking steps that undercut the Palestinians’ ability to govern themselves effectively,” Blinken said. “Israel must be a partner of the Palestinian leaders who are willing to lead their people in living side by side in peace with Israel.”\nBlinken said Arab leaders across the Middle East were ready to help with the reconstruction of Gaza, which has sustained massive destruction during the war, but only “through a regional approach that includes a pathway to a Palestinian state”.\nView image in fullscreen A man walks among the rubble of buildings destroyed in Israeli strikes on Khan Younis, southern Gaza. Photograph: Xinhua/Rex/Shutterstock\n“Critical to ending once and for all the cycle of violence … is the realisation of Palestinian political rights. That was a very clear message wherever I went,” said Blinken, who has visited Turkey, Jordan, Qatar, Saudi Arabia and the United Arab Emirates on his tour of the region.\nBlinken’s tour is aimed at reaching a consensus on Gaza’s future and stopping an escalation of the war across the Middle East.\nEarlier in the day, US officials said Blinken told Benjamin Netanyahu, Israel’s prime minister, that his forces must avoid inflicting further harm on civilians in Gaza.\nMatthew Miller, a state department spokesperson, said Blinken had reaffirmed US support for Israel’s attempts to stop any repeat of the Hamas attack of 7 October but “stressed the importance of avoiding further civilian harm and protecting civilian infrastructure in Gaza”.\nHowever there was no sign of any let-up in the violence in Gaza nor across the disputed border between Israel and Lebanon, where there have been intensifying clashes for weeks between Israel and Hezbollah, the militant Islamist organisation.\nHezbollah targeted a key Israeli base on Tuesday, declaring the attack part of its response to recent high-level Israeli assassinations in Lebanon.\nShortly afterwards, Israel killed four more Hezbollah members, including one at the funeral of a senior commander in the group’s elite Radwan force who had been killed the day before.\nView image in fullscreen A woman photographs the burned out car used by the senior Hezbollah commander Wissam Tawil, who was killed in Kherbet Selem village, south Lebanon, on Monday. Photograph: Hussein Malla/AP\nIsrael has traded cross-border fire with Hezbollah for three months and, though analysts say both sides want to avoid a war, a minor miscalculation by either side could trigger a wave of violence across the Middle East.\nIn Gaza, there were reports of multiple airstrikes overnight in Khan Younis and Rafah, the biggest cities in the south of the territory, which are both crowded with internally displaced people.\nAt least 23,210 people, mostly women and children, have been killed during Israel’s offensive in Gaza, according to its health ministry. Swaths of the territory have been devastated, with most of its 2.3 million population displaced and facing an acute humanitarian crisis.\nThe Israeli army described “expanded ground operations including airstrikes” in Khan Younis, and said nine soldiers had been killed in battle in Gaza, some of the heaviest losses announced since Israel launched its offensive after the Hamas attacks that killed 1,200 people, mostly civilians.\nHamas also took about 250 hostages. Israel says 132 of them remain captive, though at least 25 of these are thought to have been killed.\nIsrael’s military casualties in its offensive have reached 185. Six of those who died on Monday did so in a single explosion when trying to destroy a tunnel dug by Hamas under central Gaza’s al-Bureij refugee camp. The blast may have been caused by a shell fired from an Israeli tank, local media reported.\nBlinken voiced hope that, after the war, Israel could push on with its efforts towards regional integration, following its US-brokered normalisation deals with the United Arab Emirates, Bahrain and other states.\nHe also dismissed a case filed by South Africa against Israel at the international court of justice accusing it of genocide. Blinken called the allegations “meritless” and said they distracted from efforts to improve the humanitarian situation in Gaza. It was “particularly galling” as Hamas had called for Israel’s annihilation, he added.\nThe US has offered staunch support to Israel since the outbreak of its war with Hamas three months ago, but Netanyahu’s refusal to offer detailed public plans for the governance of Gaza when Israel’s military offensive ends has angered Washington.\nNetanyahu, whose hold on power depends on far-right support, has ignored US pressure to rein in ministers who have called for the mass voluntary emigration of Palestinians from Gaza. Washington has said such rhetoric is “inflammatory and unacceptable”.\nBlinken said he was “crystal clear” that Palestinians must be able to return to their homes “as soon as conditions allow” and said the US rejected any proposal for settling them outside the territory.\n00:00:53 Palestinians 'must not be pressed to leave Gaza', says Antony Blinken – video\nIsmail Haniyeh, the political leader of Hamas, said on Tuesday that the 7 October attack “came after an attempt to marginalise the Palestinian cause” and called on Muslim states “to support the resistance with weapons, because this is … not the battle of the Palestinian people alone”. Haniyeh was speaking in Qatar, where he is based.\nViolence has also surged in the occupied West Bank, where Israeli police confirmed three people were killed on Monday during a raid on Tulkarm to arrest a “wanted terrorist”.\nIsraeli army raids and settler attacks in the West Bank have killed at least 333 people since 7 October, according to the Ramallah-based Palestinian health ministry.", "source_domain": "www.theguardian.com", "text": null, "title": "Antony Blinken tells Israel: Palestinian rights are key to peace", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/09/violence-in-gaza-persists-as-antony-blinken-seeks-consensus-in-middle-east"}