{"authors": ["Emily Goodin", "Senior U.S. Political Reporter"], "date_download": "2024-02-05 15:19:32", "date_modify": "None", "date_publish": "2024-01-09 15:28:21", "description": "Defense Secretary Lloyd Austin could have broken the law by failing to report his absence, the latest twist in the saga of his mysterious hospitalization and illness.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12943015%2Fdefense-secretary-lloyd-austin-hospital-surgery-procedure-investigation.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/09/15/79798883-0-image-a-21_1704813557510.jpg", "language": "en", "localpath": null, "maintext": "Defense Secretary Lloyd Austin could have broken the law by failing to report his absence, the latest twist in the saga of his mysterious hospitalization and illness.\nMeanwhile, the Pentagon has launched a full investigation into the matter and one Republican lawmaker filed articles of impeachment against the defense secretary.\nAustin, 70, remains at Walter Reed Medical Center but is out of the ICU and has retaken control of his authorities as the head of U.S. armed forces. The White House has said President Joe Biden backs him but lawmakers in both parties are questioning the Pentagon's handling of the situation.\nThe Pentagon said Monday night that it's still unclear when Austin will be released from the hospital but vowed to give daily updates until he is out.\nDefense Secretary Lloyd Austin could have broken the law by failing to report his absence - he is seen above participating in the Virtual Red Sea Security Summit at NAVCENT headquarters in Manama, Bahrain, on December 19\nTimeline on Lloyd Austin's illness Dec. 22: Defense Secretary Lloyd Austin has procedure at Walter Reed Dec. 23: Austin returns home Dec. 27: President Biden leaves for St. Croix for New Year's vacation Jan. 1: Austin participates in national security phone call Jan. 1: Austin admitted to ICU Jan. 2: Austin top staffers informed of his hospitalization Jan. 2: Biden returns to White House Jan. 2: Deputy Defense Secretary Kathleen Hicks takes some of Austin's duties Jan. 4: Biden and Hicks told Austin is in hospital Jan. 5: Congress informed Jan. 6: Biden and Austin speak via phone Advertisement\nPentagon press secretary Major General Patrick Ryder said in a statement that Austin 'continues to experience discomfort but his prognosis is good.' Ryder said that Austin is in 'good condition' and that he is 'recovering well and in good spirits.'\nAs part of the fallout, Kelly Magsamen, Austin's chief of staff, ordered a 30-day investigation into the events surrounding Austin's hospitalization, the Pentagon announced late Monday night.\nBut the matter was not referred to the Defense Department inspector general's office for an independent review. It will be led by Jennifer Walsh, the Pentagon’s director of administration and management.\nMagsamen had been ill with the flu and was unaware that Austin had been hospitalized. Officials have cited her illness as one of the reasons the White House wasn't informed about the secretary's condition.\nAustin's top staffers knew about his hospitalization on Jan. 2, the day after it occurred, however. Biden wasn't told until Jan. 4.\nThe review will establish a timeline of events beginning Jan. 1 when Austin was taken by ambulance to Walter Reed and examine how decisions were made about informing officials of his condition.\n'This review will help to ensure clarity and transparency when a determination has been made that certain authorities have been transferred,' Magsamen wrote. 'And that proper and timely notification has been made to the President and White House and, as appropriate, the United States Congress and the American public.'\nKelly Magsamen (left), Lloyd Austin's chief of staff, ordered a 30-day investigation into the events surrounding the defense secretary's hospitalization; Pentagon press secretary Major General Patrick Ryder (right) was one of the top officials who knew of Austin's hospitalization\nThe White House announced President Biden backs Defense Secretary Lloyd Austin (seen above with Biden and Homeland Security Secretary Alejandro Mayorkas at the White House on August 30th)\nEarlier Monday, Ryder acknowledged that he knew of Austin's hospitalization on Jan. 2 and should have pushed to inform the public sooner.\nIn an hour-long back-and-forth with reporters, which was held off-camera, Ryder offered no explanation as to why the White House wasn't informed sooner.\nAsked if Austin directed any of his staff to withhold information, he answered indirectly, saying: 'That is one of the things we'll be looking at in terms of process improvements.'\nLegal experts told Reuters that Austin may have violated a U.S. law on 'reporting of vacancies' that requires the head of executive agencies to 'submit to the Comptroller General of the United States and to each House of Congress' any vacancies and the name of the person filling the vacancy.\nThe Marine Corps announced late Monday that its commandant, Gen. Eric Smith, underwent successful open heart surgery\nThe Comptroller General would then relay that information to the president and the Office of Personnel Management.\nThe law is largely procedural and does not spell out any penalties for lapses. Austin would likely face only a reprimand from Biden.\nMeanwhile, the Marine Corps announced late Monday that its commandant, Gen. Eric Smith, underwent successful open heart surgery Monday.\nThe Marine Corps said the surgery repaired a bicuspid aortic valve in Smith's heart, which caused his cardiac arrest on Oct. 28. The Marine Corps, back in October, had announced Smith's heart attack within 24 hours of it occurring.\n'He is in good condition and recovering at the hospital with his family,' they said.\nThe prompt public disclosure and details of the surgery were in stark contrast to how officials handled Austin's surgery.\nThe Marine Corps handling of General Smith's surgery has resulted in comparisons to the Pentagon's handling of Secretary Austin's surgery\nThe Pentagon continues to refuse to say what procedure Austin had or describe the complications he suffered.\nIt's unclear if even the president knows but the White House made it clear that Biden backs Austin.\n'There are no plans for anything other than for Secretary Austin to stay in the job and continue in the leadership that he's been demonstrating,' White House spokesman John Kirby told reporters on Monday.\n'Our main focus right now is on Secretary Austin's health and making sure that he gets all the care and the support that he needs to fully recovered,' he said.\nNeither Kirby nor White House press secretary Karine Jean-Pierre would say if Biden knows what medical condition his defense secretary is suffering from. Biden and Austin spoke on Saturday.\n'I don't know the level of the president's personal knowledge of his (Austin's) medical situation. That would really be between the two men,' Kirby said.\n'That it is not something that we can speak to right. This is his own medical - it is it is a private thing – this is something that the Secretary and the Department of Defense would speak to,' Jean-Pierre said.\nKirby pledged the White House would investigate the matter, looking at the 'process and procedure' regarding the location and health of senior officials after Biden was not told for four days that his defense secretary was in the hospital.\nHe said the administration would perform a 'hot wash,' which is a military term to describe an intense, quick review.\n'As you might expect, we'll take a look at process and procedure here. And try to learn from this experience and if there's some changes that need to be made, in terms of process and procedure, we'll do that,' Kirby said.\nDefense Secretary Lloyd Austin was last seen in public on December 20th (above) on the USS Gerald R Ford\nMontana Rep. Matt Rosendale announced Monday night that he is filing articles of impeachment against Defense Secretary Austin\nRepublicans have seized on the issue and Montana Rep. Matt Rosendale announced Monday night that he is filing articles of impeachment against Austin.\nRosendale says Austin has 'violated his office' multiple times, giving the disastrous Afghanistan withdrawal and the Chinese spy balloon debacle as examples.\n'Sec. Austin knowingly put the American people in danger and compromised our national security when he allowed a spy balloon from a foreign adversary to fly over Malmstrom Air Force Base – home to ICBMs – and allowed the Chinese Communist Party to gather intel on American citizens,' he said in a statement.\n'This dishonesty seems to be a repeated pattern for the Secretary as he once again lied to our military and the American people about his health last week.\n'Sec. Austin is unfit for the Office of the Secretary of Defense, which is why I urge my colleagues to join me in impeaching him to protect the American people,' he added.\nRosendale is mulling a Senate run in Montana, even as GOP leaders have already thrown their weight behind another Republican in the race, Tim Sheehy.\nDemocrats, too, have expressed concern.\nSen. Jack Reed, the Democrat from Rhode Island who chairs the Senate Armed Services Committee, made his first public remarks about the situation on Monday. He spoke to Austin on Sunday.\nHe said he wishes Austin a 'speedy and complete recovery' but has concerns 'that vital chain of command and notification procedures were not followed while the Secretary was under medical care.'\nWhile Austin is taking responsibility for the secrecy, 'this was a serious incident and there needs to be transparency and accountability from the Department,' said Reed. This lack of disclosure must never happen again.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Defense Secretary Lloyd Austin could have 'broken the LAW' by failing to reveal secret hospital stay and surgery: Pentagon launches full investigation into his ICU visit that went unnoticed for five d", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12943015/defense-secretary-lloyd-austin-hospital-surgery-procedure-investigation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}