{"authors": ["David Averre"], "date_download": "2024-02-05 15:19:33", "date_modify": "None", "date_publish": "2024-01-09 09:33:49", "description": "The earthquake struck off the Sea of Japan coast, rattling the same part of the country where a huge tremor on New Year's Day and its aftershocks caused widespread destruction, killing more than 200", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12942177%2FJapan-rocked-powerful-new-6-0-magnitude-earthquake-death-toll-New-Years-Day-tremors-tsunami-climbs-past-200.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/09/09/79787847-0-image-a-37_1704793135931.jpg", "language": "en", "localpath": null, "maintext": "A magnitude 6.0 earthquake has rocked central Japan, the country's Meteorological Agency said.\nThe earthquake struck off the Sea of Japan coast, rattling the same part of the country where a huge tremor on New Year's Day and its aftershocks caused widespread destruction.\nNo tsunami warning has yet been issued.\nThis latest tremor came as the official death toll from the 7.5 magnitude earthquake that flattened parts of central Japan on January 1 passed 200 this morning, with just over 100 still unaccounted for, authorities said.\nThat massive quake destroyed and toppled buildings, caused fires and knocked out infrastructure on the Noto Peninsula on Japan's main island Honshu just as families were celebrating New Year's Day.\nEight days later thousands of rescuers were battling blocked roads and poor weather to clear the wreckage - and provide sorely needed aid to almost 3,500 people still stuck in isolated communities.\nIshikawa regional authorities released figures on Tuesday showing that 202 people were confirmed dead, up from 180 earlier in the day, with 102 unaccounted for, down from 120.\nMore than 1,200 aftershocks have blighted central Japan since the New Year's Day quake.\nA resident visits the site of a fire caused after an earthquake to check his house in Wajima, Ishikawa prefecture, Japan Tuesday, Jan. 9, 2024\nRubble is snow-covered at a marketplace after a large fire in the earthquake-hit city, Wajima, Ishikawa prefecture, Monday, Jan. 8, 2024\nA vehicle believed to be washed away by the tsunami sits in water next to damaged buildings in the disaster-hit city of Noto, Ishikawa prefecture on January 9, 2024\nPolice officers conduct a search operation in Wajima, Ishikawa prefecture, Japan Tuesday, Jan. 9, 2024\nPolice forces search for victims in the burned down Asaichi market following a powerful earthquake that hit the region in Wajima, Ishikawa Prefecture, Japan, 09 January 2024\nFirefighters search for missing persons after a powerful earthquake hit the region in Suzu, Ishikawa Prefecture, Japan, 08 January 2024\nBurned-out vehicles and other debris are seen after a fire near the Asaichi-dori shopping street in Wajima in the Noto peninsula, facing the Sea of Japan, northwest of Tokyo on Jan. 5, 2024\nRoad signs are tilted over a road damaged by the January 1 earthquake in Nishiaraya, Ishikawa Prefecture, Japan January 8, 2024\nOn Monday, authorities had more than tripled the number of missing to 323 after central databases were updated, with most of the rise related to badly hit Wajima.\nBut since then 'many families let us know that they were able to confirm safety of the persons (on the list)', Ishikawa official Hayato Yachi said.\nWith heavy snow in places complicating relief efforts, as of Monday almost 30,000 people were living in around 400 government shelters, some of which were packed and struggling to provide adequate food, water and heating.\nAlmost 60,000 households were without running water and 15,600 had no electricity supply.\nRoad conditions have been worsened by days of rain that have contributed to an estimated 1,000 landslides.\nAt a daily disaster-relief government meeting on Tuesday, Prime Minister Fumio Kishida instructed ministers to 'make efforts of resolving the state of isolation (of communities) and continue tenacious rescue activities'.\nKishida also urged secondary evacuations to other regions outside the quake-hit area, top government spokesman Yoshimasa Hayashi told reporters.\nFirefighters search for missing persons after a powerful earthquake hit the region in Suzu, Ishikawa Prefecture, Japan, 08 January 2024\nSnow blankets part of the disaster-hit Wajima market area in the city of Wajima, Ishikawa prefecture on January 8, 2024, a week after a major 7.5 magnitude earthquake struck the Noto region in Ishikawa prefecture on New Year's Day\nA damaged car lies underneath a collapsed building at Shika town in Hakui District, Ishikawa Prefecture on January 8, 2024 after a major 7.5 magnitude earthquake struck the Noto region on New Year's Day\nJapan Self-Defense Forces (JSDF) provide food, medical, and material support to the people in the region of the Noto Peninsula affected by the earthquake on Jan. 1st, in Ishikawa Prefecture, Japan on January 07, 2024\nIn this photo provided by Japanese Ministry of Defense, members of Japan Self-Defense Forces carry relief goods in the earthquake-hit city Wajima, Ishikawa prefecture, Japan Monday, Jan. 8, 2024\nPolice forces search for victims in the burned down Asaichi market following a powerful earthquake that hit the region in Wajima, Ishikawa Prefecture, Japan, 09 January 2024. According to latest data by the Ishikawa Prefecture Government, at least 200 people were killed and 100 persons are still missing following a magnitude 7.6 earthquake which occurred on 01 January\nTraffic cones are arranged along a road damaged by the January 1 earthquake in Nishiaraya, Ishikawa Prefecture, Japan January 8, 2024\nMembers of Japan Self-Defense Forces carry an injured person from the quake-hit area, to an ambulance at Komatsu base, Ishikawa prefecture, Japan Monday, Jan. 8, 2024\nIn Ishikawa prefecture's city of Suzu, a woman in her 90s managed to survive five days under the wreckage of a collapsed house before being saved on Saturday.\n'Hang in there!' rescuers were heard calling to the woman, in police footage from the rainy scene published by local media.\nNot all were so lucky, with Naoyuki Teramoto, 52, inconsolable on Monday after three of his four children's bodies were discovered in the town of Anamizu.\n'We were talking of plans to go to Izu,' a famous hot spring resort, after his daughter passed her high school entrance exam, he told broadcaster NTV.\nJapan experiences hundreds of earthquakes every year, though most cause no damage because of strict building codes in place for more than four decades.\nBut many structures are older, especially in rapidly ageing communities in rural areas like Noto.\nThe country is haunted by the monster quake of 2011 that triggered a tsunami, left around 18,500 people dead or missing, and caused a nuclear catastrophe at the Fukushima plant.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Japan is rocked by powerful new 6.0-magnitude earthquake - as death toll from New Year's Day tremors and tsunami climbs past 200", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12942177/Japan-rocked-powerful-new-6-0-magnitude-earthquake-death-toll-New-Years-Day-tremors-tsunami-climbs-past-200.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}