{"authors": ["Jason Burke", "Peter Beaumont", "Julian Borger"], "date_download": "2024-02-05 15:19:40", "date_modify": "None", "date_publish": "2024-01-08 22:08:34", "description": "US secretary of state poised for meetings with leaders who have so far proved resistant to pressure from Washington", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F08%2Fantony-blinken-arrives-in-israel-amid-fresh-us-push-to-stop-war-spreading.json", "image_url": "https://i.guim.co.uk/img/media/cfbb13f121b08bf54d62c3f73af8616bc2b5c809/0_0_4568_2742/master/4568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=579349ae5421583529e5256a230b049c", "language": "en", "localpath": null, "maintext": "The US secretary of state, Antony Blinken, has landed in Israel for potentially difficult meetings with Israeli leaders and officials who have repeatedly proved resistant to pressure from Washington over their conduct of the war against Hamas.\nBlinken flew late on Monday night from the Saudi oasis town of AlUla where he held talks with the crown prince, Mohammed bin Salman, on a Middle East tour aimed at reaching a consensus on Gaza’s future.\nHe said key Arab states and Turkey had agreed to begin planning for the reconstruction and governance of Gaza once Israel’s war against Hamas ended.\nThe secretary of state said Saudi Arabia, Jordan, Qatar, the United Arab Emirates and Turkey “agreed to work together and to coordinate our efforts to help Gaza stabilise and recover, to chart a political path forward for the Palestinians and to work toward long-term peace, security and stability in the region as a whole”.\nHe added that the Saudis and other Arab leaders were still interested in pursuing normalisation of relations with Israel but only on the basis of an enduring Israeli-Palestinian political settlement.\n“There’s a clear interest in the region in pursuing that but it will require that the conflict end in Gaza and it will also clearly require that there be a practical pathway to a Palestinian state,” Blinken said. “But the interest is there, it’s real, and it could be transformative.”\nOn his fourth trip to the Middle East in three months, Blinken will try to convince the Israeli prime minister, Benjamin Netanyahu, to begin serious negotiations on postwar governance in Gaza, to do more to protect civilians in Gaza, and to allow more aid into the territory.\n“I will press on the absolute imperative to do more to protect civilians and to do more to make sure that humanitarian assistance is getting into the hands of those who need it,” Blinken said.\nHe added that the administration was also focused on recovering the remaining American, Israeli and other hostages in Gaza.\nThe US has offered staunch support to Israel since the outbreak of its war with Hamas three months ago, but Netanyahu has angered Washington by so far refusing to offer any detailed public plans for the governance of Gaza when Israel’s military offensive ends, and by rejecting the US’s preferred option, the creation of unified Palestinian state comprising of the West Bank and Gaza.\nUS officials said the Biden administration had drawn up detailed plans for how the transition to such a state might work, but that Netanyahu’s government remained staunchly opposed to such an outcome and was not engaging in meaningful discussions with US officials on Washington’s proposals.\nIsrael launched its offensive after Hamas sent thousands of militants into the southern part of the country and killed about 1,200 people, mostly civilians, and abducted about 240 others.\nTensions in the region continued to rise on Monday with an Israeli airstrike killing an elite Hezbollah commander in southern Lebanon, the latest in an escalating exchange of strikes along the border that have raised fears of another Middle Eastern war even as the fighting in Gaza exacts a mounting toll on civilians.\nView image in fullscreen People carry the coffin of a senior Hezbollah figure who was killed in an alleged Israeli strike. Photograph: Alaa Al-Marjani/Reuters\nThe Israeli army also claimed to have killed a Hamas commander in Syria, whom it described as a “central figure” in the launching Hamas rocket attacks against Israel.\nThe Israel Defense Forces (IDF) said Hassan Akasha had been “eliminated” in Beit Jinn, a Syrian-controlled area close to the Golan Heights, which have been annexed by Israel.\nThe health ministry in Hamas-run Gaza said it had recorded 249 deaths in the previous 24 hours, dozens of whom arrived along with 99 wounded at al-Aqsa hospital in central Gaza. More than 23,000, mostly women and children, have now died in the territory since the war began, according to local officials.\nJordan’s King Abdullah, speaking in Rwanda, said on Monday that Israel had created a whole generation of orphans with its “brutal” war in Gaza, where he said more than 30,000 people, mostly women and children, had been killed or were missing as a result of the conflict.\n“More children have died in Gaza than in all other conflicts around the world this past year. Of those who have survived, many have lost one or both parents, an entire generation of orphans … how can indiscriminate aggression and shelling bring peace? How can they guarantee security, when they are building on hatred?” he said.\nAnalysts say regional powers are essential to any postwar scenario for Gaza’s governance.\nSanam Vakil, director of the Middle East and north Africa programme at Chatham House in London, said urgent planning was needed to avoid a long-lasting simmering conflict that would be the most dangerous and least desirable outcome for the Israelis and their security, the Palestinians and the region.\n“The region needs to have a plan, one that will endure. Currently it is a game of hot potato with everyone saying what they won’t do. It is a really time-sensitive moment and there needs to be real immediate planning,” Vakil said.\nDaniel Levy, an analyst and president of the US/Middle East Project, said US efforts to influence Netanyahu had been broadly ineffectual so far.\n“I think very early on Netanyahu felt he had the Americans where he wanted them and he hasn’t looked back since, and the Americans haven’t given him a reason to look back either,” Levy said.\n“It doesn’t mean there hasn’t been a bit of light turbulence … but the Americans have not been willing to do what it takes to move the dial at all.”\nIsraeli officials have scrambled to head off mounting frustration in Washington ahead of Blinken’s visit by signalling concessions including a shift to military tactics using fewer ground troops or airstrikes, and offering some policy proposals on Gaza.\nPlans outlined by Israeli officials differ starkly from US calls for a revitalised Palestinian Authority, which is based in the occupied West Bank, to take control of Gaza and a start negotiations towards creating a Palestinian state alongside Israel.\nBlinken has sought to reassure Arab officials that the US opposes the displacement of Palestinians outside Gaza, and instead wants Israel’s Muslim majority neighbours to play a role in the territory’s future governance.\nAmid fears that the bloody ongoing conflict risks destabilising the volatile region, the US is asking regional states to reduce tensions. Recent weeks have seen surging violence in the occupied West Bank, Syria and Iraq, and Houthi attacks from Yemen on Red Sea shipping lanes.\nView image in fullscreen Smoke rises in the Gaza Strip during an Israeli military operation. Photograph: Mohammed Saber/EPA\n“This is a moment of profound tension in the region. This is a conflict that could easily metastasise, causing even more insecurity and even more suffering,” Blinken told a news conference in Doha alongside Qatar’s prime minister, Sheikh Mohammed bin Abdulrahman Al Thani, on Sunday night.\nConflict has also flared across the disputed border between Lebanon and Israel, with clashes between the IDF and Hezbollah escalating since October.\nLast week Israel assassinated a senior Hamas official in a Hezbollah stronghold in Beirut, causing a new round of more intense exchanges. A key surveillance complex was damaged by anti-tank missiles fired by Hezbollah on Saturday.\nAfter an Israeli airstrike killed an elite Hezbollah commander in southern Lebanon on Monday, Hezbollah identified the slain fighter as Wissam al-Tawil without providing details, the most senior militant in the armed group to have been killed.\nLebanese security sources described Tawil as having played a key role in leading the elite Radwan forces in southern Lebanon.\nUnderlining his seniority, Hezbollah circulated pictures of Tawil with Hezbollah leaders and the late leader of the Iranian Quds force, Qassem Suleimani, who was killed by a US drone strike in Baghdad four years ago.\nA Lebanese security source, quoted by Reuters, described Tawil’s death as “a very painful strike” while another suggested his killing would inevitably lead to more escalation.\nEylon Levy, an Israeli government spokesperson, said Israel did not want a war with Hezbollah but would force the militant organisation to withdraw elite fighters from the disputed border if necessary.\n“We are now at a fork in the road: either Hezbollah backs off or we will push it away,” Levy told reporters.\nUN experts on Monday described “a growing body of evidence” of sexual violence against Israeli civilians during the 7 October attacks as “harrowing”. Hamas denies the abuses.\nThe UN also voiced alarm at the many journalists killed in the war in Gaza, a day after two Al Jazeera reporters died in an Israeli strike on their car in what the network called a “targeted killing”.", "source_domain": "www.theguardian.com", "text": null, "title": "Antony Blinken arrives in Israel amid fresh US push to stop war spreading", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/08/antony-blinken-arrives-in-israel-amid-fresh-us-push-to-stop-war-spreading"}