{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:19:41", "date_modify": "None", "date_publish": "2024-01-08 10:17:43", "description": "The UK's MoD said the average daily number of Russian casualties in Ukraine rose by almost 300 over the course of 2023, citing data from Ukraine's defence ministry.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12938003%2FPutin-unleashes-deadly-new-wave-airstrikes-Ukraine.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/08/10/79742091-0-image-m-19_1704708606425.jpg", "language": "en", "localpath": null, "maintext": "Vladimir Putin unleashed hypersonic missiles in Russia's latest deadly wave of airstrikes across Ukraine, regional officials said Monday.\nAt least four civilians were reported killed and at least 30 injured in the strikes that hit near the front lines of fighting in the east as well as in central and western parts of the country, which has been under invasion by Russia since February 2022.\nUkraine said it had destroyed 18 out of the 51 missiles of different types launched.\nRussia's Defence Ministry said its forces used precision sea-launched and air-launched long-range missiles, including Kinzhal hypersonic missiles, to strike what it called 'facilities of Ukraine's military-industrial complex.'\nMeanwhile, the United Kingdom's Ministry of Defence reported that Russia is on course to have lost a total of 500,000 soldiers by the end of this year.\nIt said the average daily number of Russian casualties in Ukraine rose by almost 300 over the course of 2023, citing data from Ukraine's defence ministry.\nIt put the mounting toll down to Russia's attacks on Avdiivka, a small eastern town that sits on the edge of the currently-occupied Donetsk region.\nVladimir Putin unleashed hypersonic missiles in Russia's latest deadly wave of airstrikes across Ukraine, regional officials said Monday. Pictured: Flames are seen in a destroyed building\nVolunteers talk next to a damaged apartment building at a site of a Russian missile strike, amid Russia's attack on Ukraine, in Zaporizhzhia, Ukraine January 8\nPeople take shelter inside a metro station during an air raid alert in Kyiv, January 8\nThe MoD said the increased casualty rate reflects how the quality of the Russian president's army has deteriorated following the partial mobilisation in September 2022, which saw Moscow call up 300,000 more troops.\nThe mobilisations turned Russia's arm into a 'a low quality, high quantity mass army, the Ministry of Defence said in its report.\nIt also reflects reports of Moscow deploying 'human wave' tactics, which involves sending thousands of poorly-trained soldiers to their deaths to wear down Ukraine's defences and to seek out weak points that can be exploited.\nWhile the UK's MoD said it could not independently verify the methodology used by its Ukrainian counterpart, it has previously said the figures are 'plausible'.\nJohn Kirby, the spokesperson for the US National Security Council demonstrates that Russia 'continues to show no regard for the lives of its own soldiers, willingly sacrificing them in pursuit of Putin's goals.'\nIn its report, the UK's MoD said it will likely take Russia between five and ten years to rebuild a 'highly trained, experienced readiness force.'\nNeither side made major advances in 2023, with Ukraine's much-vaunted counteroffensive failing to make the gains Kyiv had hoped for.\nThis was largely down to Russia fortifying its defences, laying vast minefields across the hundreds of miles of Ukraine that make up the war's frontline.\nRussia, meanwhile, appears to have adopted a tactic of attrition, looking to wear Ukraine's forces down with overwhelming numbers - while deploying withering air strikes on critical infrastructure in the cold months of winter.\nThis was again seen on Monday with the strikes across the country.\nWestern officials and analysts had previously warned that Russia was stockpiling its cruise missiles in preparation for a strategy of winter bombardment, as bad weather keeps the 930-mile front line largely static after 22 months of war.\nUnlike last winter, when the Kremlin's forces targeted Ukraine's power grid, Russia is now aiming at Kyiv's defense industry, they say. But the almost daily barrages have repeatedly hit civilian areas. Monday's attacks struck a string of urban areas, including housing and a shopping mall, across Ukraine.\nThe UK's MoD put Russia's mounting toll down to its attacks on Avdiivka, a small eastern town that sits on the edge of the currently-occupied Donetsk region (pictured)\nThe average daily number of Russian casualties in Ukraine has risen by almost 300 during the course of 2023.\nIf the numbers continue at the current rate over the next year, Russia will have lost over half a million personnel in Ukraine.\n🇺🇦 #StandWithUkraine 🇺🇦 pic.twitter.com/m4SV6XMRMS — Ministry of Defence 🇬🇧 (@DefenceHQ) January 6, 2024\nMonday's attacks struck a string of urban areas, including housing and a shopping mall, across Ukraine, and a nationwide air raid alert was in force for the latest attacks by Putin 's forces.\nRussia fired 51 missiles of various types, as well as eight Shahed drones, at Ukraine, Ukrainian commander-in-chief Valerii Zaluzhnyi said.\nThe Ukrainian Air Force intercepted 18 of the cruise missiles and all the drones, he said.\nThe strikes come less than a week after Kyiv warned it only had enough ammunition to withstand a few more powerful attacks, amid intense Russian bombardment.\n'The enemy launched dozens of missiles at peaceful cities and villages of Ukraine,' Ukraine's deputy head of the presidency Oleksiy Kuleba said.\nHe added that at least 33 were injured.\nIn the southeastern Dnipropetrovsk region, a woman died in a missile attack outside the city of Kryvyi Rih and 24 people were injured in a strike on the town of Novomoskovsk.\nA building was seen engulfed in flames in the Dnipropetrovsk region town.\nThree administrative buildings, two filling stations, a five-story building, and cars were also damaged, and a minibus was overturned by a shockwave.\nThe wounded in the city from the latest savage Putin attack included five children - boys aged four and eight, and girls aged 11, 16 and 17.\nIn Kryvyi Rih itself, which is Ukraine President Volodymyr Zelenskyy's home town, more than 20 houses and a shopping mall were damaged in the attack, said regional governor Serhii Lysak.\nAt least four missiles hit Kharkiv, the country's second-largest city, injuring one person, said mayor Ihor Terekhov. A woman rescued from the rubble of a building later died, regional Gov. Oleh Syniehubov said. More people may be trapped, he said.\nAuthorities in the Khmelnytskyi region of western Ukraine said two people died as at least six explosions were heard during the morning missile attack.\nIn Zaporizhzhia, a major southern city along the Dnipro River, two people were injured in a missile strike on a residential district, said regional governor Yurii Malashko.\nTwo people injured in a January 2 attack died on Monday, officials said.\nInvestigators stand next to a car destroyed by a Russian missile in Zaporizhzhia, January 8\nA local woman stands next to a damaged apartment building at a site of a Russian missile strike in Zaporizhzhia, Ukraine January 8\nPolice officers work at a site of a Russian missile strike in Zaporizhzhia, Ukraine, January 8\nUkrainian Emergency Service workers help a wounded man after a residential houses were badly damaged in a Russian missile attack, near Kryvyi Rih, January 8\nA destroyed house is seen near Kryvyi Rih, Ukraine, January 8\nMeanwhile, Russian troops conducted 131 artillery attacks on the Kherson region, killing two people and injuring five, according to governor Oleksandr Prokudin.\nKherson and the surrounding region have been consistently targeted since Russian forces withdrew from the city to the eastern side of the Dnipro in the autumn of 2022.\nSeparately, the Ukrainian military said Russian forces have made unsuccessful efforts to advance during the past day in several areas along the front line, including around Lyman in the Kharkiv region and in the Donetsk and Zaporizhzhia regions.\nIn the Russia-occupied Luhansk region in Ukraine's east, a Russian warplane accidentally released a bomb on the town of Rubizhne, said Leonid Pasechnik, the head of the region's Moscow-appointed government.\nThe bomb, an FAB-250 that carries a high-explosive warhead, did not cause injuries, Pasechnik said.\nThe incident comes six days after Russia accidentally dropped munitions over the village of Petropavlovka in the Belgorod region, which has come under repeated Ukrainian attack.\nLast April, another bomb accidentally dropped by one of Russia's warplanes caused a powerful blast in the city of Belgorod, injuring two and scaring local residents.\nUkraine reported that Monday's attacks included Kh-101/555 cruise missiles launched at least ten times by Tu-95 strategic bombers overflying the Caspian Sea.\nKinzhal hypersonic missiles were unleashed from MiG-31K warplanes.\nS-300/S400 ballistic missiles were fired from occupied Crimea and the Russian region of Belgorod.\nKh-22/32 supersonic missiles were deployed from Tu-22M3 bombers overflying the Russians regions of Kursk and Voronezh.\nMeanwhile in Russia, the authorities are evacuating children from the border city Belgorod which has faced intense attacks from Ukraine.\nRegional governor Vyacheslav Gladkov said posted a video to reveal the move to other Russian regions.\nOleh, a serviceman of infantry battalion of the 61st mechanised brigade plays with dogs in a trench at a position near the frontline in the Kharkiv region, Ukraine, January 6\n'Over the past 24 hours, we have received 1,300 applications to send children from Belgorod to remote school camps in other regions [away from the war zone],' he said. 'I called my fellow governors from the Voronezh, Kaluga, Tambov, and Yaroslavl regions. They are all ready to help us.\n'Now we have already sent our specialists to look at the location where the children are being placed.'\nAdults too are demanding to bail out of a city just 25 miles from the border with Ukraine.\n'Some 300 residents of Belgorod, who decided to temporarily evacuate, are at the moment being housed in temporary shelter centres in Stary Oskol, Gubkin and the Korochansky district,' said Gladkov.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Putin unleashes hypersonic missiles in deadly new wave of airstrikes on Ukraine - as UK intelligence claims Russia is on course to lose 500,000 troops on frontlines by end of 2024", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12938003/Putin-unleashes-deadly-new-wave-airstrikes-Ukraine.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}