{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Sammy Gecsoyler", "Martin Belam", "Reged Ahmad"], "date_download": "2024-02-05 15:19:42", "date_modify": "None", "date_publish": "2024-01-08 23:50:15", "description": "This blog has now closed. You can read our full report on the Middle East crisis here and all our coverage of the Israel-Gaza war here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F08%2Fmiddle-east-crisis-live-updates-war-gaza-palestine-hamas-antony-blinken-meeting-saudi-prince-qatar.json", "image_url": "https://i.guim.co.uk/img/media/ccaffa937287d2c8c594ffb96d574e43c37cf785/0_261_3919_2352/master/3919.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=07cee8f69fd046035fedcbf3d352ca69", "language": "en", "localpath": null, "maintext": "From 8 Jan 2024 20.28 CET Three Palestinians shot dead by Israeli forces in West Bank, says health ministry Three Palestinians have been shot dead by Israeli forces in the Israeli-occupied West Bank city of Tulkarm, the Palestinian health ministry said on Monday. The West Bank had already experienced the highest levels of unrest in decades during the 18 months preceding the 7 October 2023 attack on southern Israel by Hamas gunmen but confrontations have risen sharply as Israeli forces have launched an invasion of Gaza, Reuters reports.\nUpdated at 22.20 CET\n8 Jan 2024 00.46 CET Israeli foreign minister Israel Katz has confirmed that Israel was behind the killing of Hezbollah commander Wissam Hassan al Tawil, as already announced by the militant group. “Regarding the elimination in southern Lebanon, we took responsibility for it. It’s part of the war - we hit Hezbollah terrorists, infrastructures, and systems they placed in order to deter Israel,” Katz said according to Israeli news site Ynet.\n8 Jan 2024 00.18 CET The Pentagon has said it is not currently planning to withdraw its roughly 2,500 troops from Iraq, despite Baghdad’s announcement last week it would begin the process of removing the US-led military coalition from the country, Reuters reports. “Right now, I’m not aware of any plans [for withdrawal]. We continue to remain very focused on the defeat Isis mission,” air force Major Gen Patrick Ryder told a news briefing, using an acronym for Islamic State. He added that US forces are in Iraq at the invitation of its government. Ryder said he was also unaware of any notification by Baghdad to the Department of Defense about a decision to remove US troops, and referred reporters to the US state department for any diplomatic discussions on the matter. Prime minister Mohammed Shia al-Sudani’s office announced on Friday the moves to evict US forces following a US drone strike in Baghdad that was condemned by the government. The Pentagon said the strike killed a militia leader responsible for recent attacks on US personnel. View image in fullscreen The funeral of Iraqi Shiite PMF leader Abu Taqwa Al-sia'di funeral after a US drone attack in Baghdad. Photograph: Ahmed Jalil/EPA Sudani’s office released a statement saying a committee would be formed to “put arrangements to end the presence of the international coalition forces in Iraq permanently.” “We stress our firm position in ending the existence of the international coalition after the justifications for its existence have ended,” Sudani was quoted as saying in the statement. This is Helen Livingstone taking over from my colleague Léonie Chao-Fong.\n8 Jan 2024 23.46 CET Israeli leaders plan to tell the US secretary of state, Antony Blinken, that the return of Palestinians to northern Gaza is contingent on progress on a deal to release the remaining Israeli hostages in the territory, according to a report. As we reported earlier, Blinken has landed in Tel Aviv ahead of potentially difficult meetings with Israeli leaders and officials on Tuesday. During their meetings, Israeli leaders will say they will only consider allowing Palestinians to return to their homes in northern Gaza if there is progress on the effort to return the Israeli hostages still held in Gaza, the Times of Israel said a Walla news report said. On his fourth trip to the Middle East in three months, Blinken will try to convince Israeli prime minister, Benjamin Netanyahu, to begin serious negotiations on postwar governance in Gaza, to do more to protect civilians in Gaza, and to allow more aid into the territory.\nUpdated at 23.47 CET\n8 Jan 2024 23.00 CET The Israel Defense Forces (IDF) said they have located a cluster of weapons factories and tunnels used by Hamas militants in Gaza to manufacture rockets. IDF forces took a group of reporters on Monday to visit a site in Bureij in the central Gaza Strip which they said housed the largest weapons production site so far found in the territory. It said that in addition to long-range missiles, the underground workshops produced copies or adaptations of standard munitions such as mortar shells and were connected through underground shafts to a tunnel network used to transport the weapons to fighting units throughout the Gaza Strip, Reuters reported. An IDF spokesperson, Daniel Hagari, said the factory had been built around Salah al-Din Road, a major north-south route also used to transport humanitarian aid. He said Israeli troops “found, dismantled and are now destroying these facilities”.\nUpdated at 23.07 CET\n8 Jan 2024 22.28 CET Israel’s supreme court has rejected a request from international media organisations to allow journalists to report in Gaza. The Foreign Press Association, which represents dozens of media organisations operating in Israel and the Palestinian territories, filed a petition last month to order Israeli authorities to allow journalists to enter. Prior to 7 October, reporters with an Israeli-issued press card could enter Gaza and apply for an additional reporting permit from Hamas, which governs the territory. In its ruling, the Israeli court said that while it recognises the right of freedom of the press, the current wartime circumstances justify the restrictions. It said journalists inside Gaza could endanger soldiers by reporting about troop positions, AP reported. It said journalists could continue to enter Gaza under Israeli military escort.\nUpdated at 22.30 CET\n8 Jan 2024 22.09 CET Blinken arrives in Israel The US secretary of state, Antony Blinken, has arrived in Tel Aviv ahead of talks with Israeli officials on Tuesday. Blinken landed in Israel after meeting with the leaders of the United Arab Emirates and Saudi Arabia as part of his fourth Middle East tour since the Hamas attacks on Israel on 7 October. Before leaving Al Ula after meeting with Saudi Crown Prince Mohammed bin Salman, Blinken said: We agreed to work together and coordinate our efforts to help Gaza stabilise and recover ... and to work toward long term peace and security and stability. View image in fullscreen The US secretary of state, Antony Blinken, gestures as he arrives in Tel Aviv. Photograph: Evelyn Hockstein/AP\nUpdated at 22.15 CET\n8 Jan 2024 21.35 CET More than 325 people were arrested during a pro-Palestinian protest that disrupted the Monday morning rush hour in New York City, police said. Demonstrators gathered at the Brooklyn Bridge, the Manhattan Bridge, the Williamsburg Bridge and the Holland Tunnel, locking themselves together using zip ties and cement-filled tyres, AP reported. View image in fullscreen Pro-Palestinian demonstrators block a Brooklyn Bridge roadway during a 'Shut it Down for Palestine' protest in New York City. Photograph: Shannon Stapleton/Reuters View image in fullscreen Pro-Palestinian demonstrators block a Brooklyn Bridge roadway during a 'Shut it Down for Palestine' protest in New York City. Photograph: Shannon Stapleton/Reuters View image in fullscreen A Pro-Palestinian demonstrator waves the Palestinian flag as it blocks a Brooklyn Bridge roadway during a 'Shut it Down for Palestine' protest in New York City. Photograph: Shannon Stapleton/Reuters\n8 Jan 2024 20.53 CET Joanna Walters Jordan’s foreign minister, Ayman Safadi, has told his French counterpart that it is “unacceptable” to allow the Israeli prime minister, Benjamin Netanyahu, to push the area to a wider regional war, Reuters is reporting. This is a breaking news snap and we’ll bring you more details as they emerge. View image in fullscreen Jordanian foreign minister Ayman Safadi (right) with US secretary of state Antony Blinken in Amman yesterday. Photograph: Petra News Agency/EPA Safadi told France’s Catherine Colonna that the threat of the war in Gaza spreading is increasing “by the day”.\nUpdated at 20.59 CET\n8 Jan 2024 20.28 CET Three Palestinians shot dead by Israeli forces in West Bank, says health ministry Three Palestinians have been shot dead by Israeli forces in the Israeli-occupied West Bank city of Tulkarm, the Palestinian health ministry said on Monday. The West Bank had already experienced the highest levels of unrest in decades during the 18 months preceding the 7 October 2023 attack on southern Israel by Hamas gunmen but confrontations have risen sharply as Israeli forces have launched an invasion of Gaza, Reuters reports.\nUpdated at 22.20 CET\n8 Jan 2024 19.58 CET The only hospital remaining in central Gaza is on the verge of shutting down amid intense fighting that has engulfed the area, a UN spokesperson has said. As we reported earlier, aid groups have been forced to withdraw from Al-Aqsa hospital in Deir al-Balah in recent days, spreading panic among people sheltering there. The Israeli military has dropped leaflets designating areas surrounding the hospital as a “red zone”, the International Rescue Committee (IRC) said. Al-Aqsa is “the single remaining hospital in the middle area of Gaza”, where a “major offensive is under way”, Gemma Connell, a spokesperson for the UN office for the coordination of humanitarian affairs (OCHA) told the BBC. The situation in the hospital is dire. We have just a single doctor who is working in the emergency room. You have only two surgeons left responding to hundreds of needs in that hospital. You have so many casualties coming in every single hour who are in desperate need of life-saving support. World Health Organization (WHO) staff who visited the medical facility on Sunday saw “sickening scenes of people of all ages being treated on blood-streaked floors and in chaotic corridors”, the WHO chief, Tedros Adhanom Ghebreyesus, said in a statement.\nUpdated at 20.01 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Three Palestinians shot dead by Israeli forces in West Bank, says health ministry", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/08/middle-east-crisis-live-updates-war-gaza-palestine-hamas-antony-blinken-meeting-saudi-prince-qatar"}