{"authors": [], "date_download": "2024-02-05 15:19:44", "date_modify": "None", "date_publish": "2024-01-07 08:20:38", "description": "Dead include five children aged from three to 17 years, says Donetsk governor", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Frussia-ukraine-war-missile-strike-drones-dnipro-kherson-b2474454.html.json", "image_url": "https://static.independent.co.uk/2024/01/07/07/GettyImages-1242335058.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA Russian missile strike in eastern Ukraine has killed 11 people, including five children, according to Ukrainian officials.\nIt comes as Russia appeared to shift the focus of its aerial assault on Ukraine to several frontline cities in the east, after days of heavy bombardments targeting major civilian hubs including the capital Kyiv.\nThe eastern Ukrainian town of Pokrovsk and nearby villages in Donetsk Oblast were hit with a barrage of S-300 missiles, destroying at least six houses, the head of Ukraine’s military administration for the region Vadym Filashkin said on Telegram.\n“As a result of this barbaric attack, 11 people died, including five children aged from three to 17 years,” Mr Filashkin said.\n“Ten people were injured. Rescue operations are continuing. Closer to morning we will have a better understanding of the final numbers of those who were injured,” he said late on Saturday.\nRescue efforts extended into the night with emergency workers sifting through piles of rubble in the dark.\nThe Ukrainian town of Pokrovsk lies about 40km from the eastern front line.\nUkraine's military raises threat of Russian missile strikes\nIn a separate statement on Sunday, Ukraine’s air force said Russia launched 28 attack drones and three cruise missile at Ukraine overnight.\nThe air force said its air defence systems destroyed 21 of the drones, but it did not say what happened to the three cruise missiles.\nThe air force said on its Telegram messaging channel that Russia targeted mainly south and east of Ukraine. “The enemy is shifting the focus of attack to the frontline territories - Kherson and Dnipropetrovsk regions were attacked by drones,” Ukraine’s air force spokesperson Yuriy Ihnat told national television.\nRussia said in a statement on Saturday that its troops struck a command post used by a Ukrainian military near Pokrovsk, referring to the town by its Soviet-era name Krasnoarmeisk.\nRussian military troops are repurposing missile systems, originally designed for air defense, to attack targets in the town and nearby villages.\nThese repurposed air defense missiles have poorer accuracy and may hit random targets, Ukrainian officials said.\nEarlier, Russian forces hit the Pivnichne, also in Donetsk Oblast, with two aerial bombs that killed one and injured another civilian, Mr Filashkin said in a separate post on Telegram.\nRussian troops are “trying to inflict as much grief as possible on our land,” the governor said.\nUkrainian president Volodymyr Zelensky said in his nightly video address that the Pokrovsk attack “quite simply targeted ordinary, private homes.”\n“Russia must be made to feel that none of these strikes will pass without consequences for the terrorist state,” Mr Zelensky said.\nUN’s humanitarian coordinator for Ukraine Denise Brown said she was “truly horrified” by the strikes, especially by the deaths of children.\n“These were just children who have been killed because of this war,” Ms Brown said.\nShe noted that the recent Russian shelling of Ukrainian towns was “leaving behind an outrageous number of children. Women and men killed and injured and a trail of loss and destruction.”", "source_domain": "www.independent.co.uk", "text": null, "title": "At least 11 dead as Russia shifts focus of drone and missile attacks to frontline cities", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-missile-strike-drones-dnipro-kherson-b2474454.html"}