{"authors": ["Léonie Chao-Fong", "Martin Belam", "Tom Bryant", "Reged Ahmad"], "date_download": "2024-02-05 15:14:51", "date_modify": "None", "date_publish": "2024-01-30 23:45:01", "description": "Denial comes after Palestinian Red Crescent Society says hospital in Khan Younis is under attack; White House declines to give further details of response", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F30%2Fmiddle-east-crisis-live-updates-unrwa-donations-pause-hamas-attack-israel-gaza-war-antony-blinken-drone-attack-jordan-us-troops.json", "image_url": "https://i.guim.co.uk/img/media/7d43c64fe624ccec5f6cdd57a352e848b337982c/0_359_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=214e9a4268420b71ad5c9d60de5d1844", "language": "en", "localpath": null, "maintext": "6d ago 19.46 CET Dozens of protesters gathered outside the offices of the UN agency for Palestinian refugees (UNRWA) in Beirut on Tuesday after more than 10 western countries said they would suspend funding after Israel accused some of its workers of taking part in Hamas’ 7 October attack. “We are afraid for the future of UNRWA,” Abu Mohammed, 65, a Palestinian refugee, told AFP as he urged countries to “reverse their decision”. All our children study in UNRWA schools and most of our medical care is covered by the agency … The suspension of aid would be catastrophic from a social and humanitarian perspective. UNRWA, formed in 1949 after the creation of Israel, supports more than 5.6 million Palestinians in the occupied territories, including Jerusalem, and refugees and their descendants in Syria, Lebanon and Jordan. Lebanon hosts an estimated 250,000 Palestinian refugees, most of whom live in poverty. “Even though I have a job, UNRWA helps me pay my rent and buy food,” said Dima Dahouk, 40, the sole breadwinner for her four children. “The situation is terrible,” she added. View image in fullscreen Palestinian refugees gather outside the offices of the UN agency for Palestinian refugees, UNRWA, in Beirut. Photograph: Anwar Amro/AFP/Getty Images\nUpdated at 19.48 CET\n6d ago 19.37 CET The UN’s coordinator for Gaza aid has said no organisation can “replace or substitute” the UN agency for Palestinian refugees (UNRWA), after Israeli allegations that some employees were involved in the 7 October Hamas attacks. Sigrid Kaag said: There is no way that any organization can replace or substitute [the] tremendous capacity, the fabric of UNRWA – [its] ability and their knowledge of the population in Gaza. As we reported earlier, the World Health Organization has urged donors not to suspend funding to UNRWA, arguing that doing so “will only hurt the people of Gaza who desperately need support”. International aid agencies have said they are “deeply concerned and outraged” at the “reckless” decision by major donors to cut funding to the aid agency. Sweden on Tuesday became the latest country to announce it will pause funding for UNRWA, joining the US, UK, Germany and others.\nUpdated at 19.47 CET\n6d ago 19.19 CET UK 'alarmed' by conference in Jerusalem calling for Israeli resettlement of Gaza The UK has said it was “alarmed” by a conference held in Jerusalem on Sunday calling for Israeli resettlement of the Gaza Strip and “voluntary migration” of the Palestinian population elsewhere, which was attended by several Israeli cabinet ministers. A statement from the UK Foreign Office reads: The UK’s position is clear: Gaza is occupied Palestinian territory and will be part of the future Palestinian state. Settlements are illegal. No Palestinian should be threatened with forcible displacement or relocation. Sunday’s event, called the “Victory of Israel Conference: Settlement Brings Security”, hosted speeches by well-known extremists in Netanyahu’s cabinet including the national security minister, Itamar Ben-Gvir, and the finance minister, Bezalel Smotrich. In their remarks, Ben-Gvir and Smotrich called for the re-establishment of Jewish settlements in Gaza and the north of the West Bank, known to some Israelis as Samaria. The conference was attended by approximately 1,000 people, including 11 cabinet ministers and 15 members of the Knesset, some of them members of the prime minister’s Likud party.\nUpdated at 19.23 CET\n6d ago 19.00 CET Jake Sullivan, the US national security adviser, met visiting Qatari prime minister, Mohammed bin Abdulrahman Al Thani, in Washington earlier today to discuss ongoing efforts to secure a new hostage release deal between Israel and Hamas, the White House’s national security spokesperson, John Kirby, said. Sullivan will also be meeting later today at the White House with several family members of hostages still being held in Gaza, Kirby told reporters.\nUpdated at 19.07 CET\n6d ago 18.56 CET US could respond with 'multiple actions' to Jordan drone attack, says White House The US could have a tiered response to the drone strike that killed three American service personnel and wounded dozens others, the White House has said. The White House’s national security spokesperson, John Kirby, told reporters that the US response could involve multiple actions rather than a single action. Kirby said: It’s fair for you to expect that we will respond in an appropriate fashion and it is very possible that what you’ll see is a tiered approach here, not just a single action, but essentially multiple actions. His comments came after Joe Biden said he had made up his mind on how to respond to the drone attack in Jordan.\n6d ago 18.43 CET The Israeli military said it has channelled seawater into Gaza’s tunnels in a bid to destroy the sprawling underground network used by Hamas militants. An Israel Defense Forces (IDF) statement said it had “implemented new capabilities to neutralise underground terrorist infrastructure in the Gaza Strip by channelling large volumes of water into the tunnels”. It added: It is part of a range of tools deployed by the IDF to neutralise the threat of Hamas’s subterranean network of tunnels. A Wall Street Journal report in December said the Israeli army had begun pumping seawater from the Mediterranean into Hamas’s underground tunnels in Gaza. There were 1,300 tunnels over 500km in Gaza at the start of the war in October, according to a study from the US military academy West Point. Israeli officials have said Hamas’s underground system has been key to its operations on the battlefield. Israel believes that many of the hostages taken by Hamas during the 7 October attacks have been or continue to be held in the vast network of tunnels. Experts have warned that flooding the tunnel network with seawater risks “ruining the basic conditions for life in Gaza”, one of the elements of the crime of genocide.\nUpdated at 18.54 CET\n6d ago 18.33 CET Israeli tanks are stationed in the front yard of al-Amal hospital in the southern Gaza city of Khan Younis, the Palestinian Red Crescent Society has said. In an update posted to social media, the organisation said Israeli forces are firing live ammunition and smoke grenades and displaced individuals and its staff. It said: Fires have broken out in tents within the confines of the PRCS Headquarters. The post added that it was deeply worried about the safety of its teams, the wounded and thousands of displaced people in the building. Israeli tanks are currently stationed in AL-Amal hospital front yard, firing live ammunition and smoke grenades at the displaced individuals and PRCS staff.\nWe deeply worry for the safety of our teams, the wounded, the sick, and thousands of displaced people in the building. 🔥… — PRCS (@PalestineRCS) January 30, 2024\n6d ago 18.27 CET The framework for a deal that could lead to a ceasefire and the release of hostages held in Gaza was discussed by Israel’s war cabinet on Monday evening. The proposal for a deal was hammered out between Egypt, Qatar, the US and Israel on Sunday in talks in Paris. The location of the talks meant that Hamas negotiators could not be present. Described as a framework, the proposal has not yet been put to a vote in the Israeli war cabinet, a senior Israeli official told NBC on Tuesday. The last deal was approved first by the Israeli war cabinet, then by the larger security cabinet, and finally by the full government. The official told the outlet that any future deal would likely go through the same process. They noted that a major sticking point remains the duration of a pause in fighting. Israel has said it would only be temporary, Hamas has demanded a permanent ceasefire. The Israeli official said: If there’s going to be a deal, there will have to be a meeting of minds. We won’t agree to an end to the hostilities. It’s clear from our perspective it has to be a time out in the fighting. Israel’s prime minister, Benjamin Netanyahu, has said he will not accept any ceasefire deal that requires the release of thousands of Palestinian prisoners or the departure of Israeli troops from Gaza. Meanwhile, Palestinian Islamic Jihad’s secretary general Ziad al-Nakhala has ruled out the group engaging in any ceasefire that does not involve the withdrawal of Israeli troops from the Gaza Strip.\nUpdated at 18.33 CET\n6d ago 18.11 CET Canada has announced a new C$40m (£23.5m) funding to provide food, water and other humanitarian assistance after pausing funding for the UN’s relief agency in the region. Canada has suspended “additional funding” for UNRWA following allegations by Israel that some of its staff were involved in the Hamas attacks on 7 October. The bulk of the new funding will go to the World Food Programme (WFP), the World Health Organization (WHO), Unicef, the International Committee of the Red Cross (ICRC) and the UN office for the coordination of humanitarian affairs.\nUpdated at 18.31 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel denies its forces are storming al-Amal hospital in Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/30/middle-east-crisis-live-updates-unrwa-donations-pause-hamas-attack-israel-gaza-war-antony-blinken-drone-attack-jordan-us-troops"}