{"authors": [], "date_download": "2024-02-05 15:19:46", "date_modify": "None", "date_publish": "2024-01-07 19:02:58", "description": "Airstrikes by Myanmar’s military on a village under the control of the pro-democracy resistance in the country’s northwest are reported to have killed at least 17 civilians, including nine children", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmyanmar-ap-bangkok-indian-aung-san-suu-kyi-b2474650.html.json", "image_url": "https://static.independent.co.uk/2024/01/07/19/Myanmar_Conflict_56577.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAirstrikes by Myanmar’s military on a village under the control of the pro-democracy resistance in the country’s northwest have killed at least 17 civilians, including nine children, local residents and a human rights group said Sunday.\nThe morning aerial attacks on Kanan village in Sagaing region’s Khampat town, just south of the Indian border, also wounded about 20 people, they said.\nMyanmar is wracked by violence that began after the army ousted the elected government of Aung San Suu Kyi in February 2021. After peaceful demonstrations were put down with lethal force, many opponents of military rule took up arms, and large parts of the country are now embroiled in conflict.\nThe country’s independent online media and the BBC's Myanmar-language service reported the air attack Sunday, but the military government denied responsibility, claiming that it was false news spread by Khit Thit Media, an independent online news service sympathetic to the anti-military resistance.\nThe report by the state-run MRTV television in its Sunday night news broadcast cited an unnamed official from the area as saying there had been no plane flying in the area on Sunday morning.\nThe military government in the past two years has stepped up airstrikes against two enemies: the armed pro-democracy Peoples Defense Force, and ethnic minority guerrilla groups that have been fighting for greater autonomy for decades. The two groups sometimes carry out joint operations against the army.\nIn response to accusations of abuses, the military government often accuses pro-democracy forces in the area of carrying out violent campaigns of terror. But analysts for the United Nations and non-governmental organizations have gathered credible evidence of large-scale human rights abuses by the army, including the burning of entire villages and displacement of close to 2 million people that has triggered a humanitarian crisis.\nSagaing region, near the border with India, has been a stronghold of armed resistance to the army. A district capital and two small towns, including Khampat, have been seized in the past few months by a coalition of resistance forces and the Kachin Independence Army, one of the stronger ethnic rebel groups.\nA local resident who helped carry out rescue work told The Associated Press on Sunday that a jet fighter dropped three bombs on the village of Kanan, on the outskirts of Khampat, about 280 kilometers (170 miles) northwest of Mandalay, the country’s second-biggest city, killing 17 civilians who were in buildings near the village school.\nMost of the residents in Khampat town are from the Chin ethnic minority, the vast majority of whom are Christians, generally Baptist. Myanmar is largely Buddhist, led by the Burman majority. The ruling military identifies with a nationalistic strain of Buddhism that shows hostility to non-Burman and non-Buddhist populations, found mostly in the border areas where much of the current fighting takes place.\nAbout 10 houses near the school were destroyed by bombs, said the resident who spoke on the condition of anonymity because he was afraid of being arrested by the military.\nHe provided a possible explanation for the attack, noting that a ceremony had been scheduled for Sunday to mark the completion of combat training for new members of the resistance forces at another school in the village, and that might have been the intended target of the attack. He added that the bombing might have been the consequence of a tip-off by a military informer.\nAnother resident, who also spoke on the condition of anonymity due to security concerns, said nine of the dead were children and 20 other people were injured. He also provided AP with photos of the aftermath of the attack, including dead and wounded people and damaged buildings.\nSalai Mang Hre Lian, a program manager of the Chin Human Rights Organization, also confirmed the number of the victims and charged that it was a deliberate attack by the military on the civilians and children at the school.\n“If the international community continues to allow war crimes to be committed like this, then they let themselves to be knowingly complicit in the violations of international humanitarian laws, including the Geneva Conventions and Rome Statues,” Salai Mang Hre Lian said in text messages.\nThe military stepped up airstrikes after an alliance of three ethnic minority armed groups in late October launched a major offensive, seizing towns in the country’s northeast, along with major border crossings for trade with China.\nThe resistance forces scored a major victory last week when it forced the army to give up the city of Laukkaing in northern Shan state near the Chinese border.\nThe independent Myanmar Pressphoto Agency and Shan media reported that at least five people, including three teachers, were killed Sunday in an airstrike on Namhsan township, which was captured last month by the Ta’ang National Liberation Army, a members of the Three Brotherhood Alliance that launched the October offensive.", "source_domain": "www.independent.co.uk", "text": null, "title": "Air attack in northwestern Myanmar kills 17, including children, but military denies responsibility", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/myanmar-ap-bangkok-indian-aung-san-suu-kyi-b2474650.html"}