{"authors": ["Reged Ahmad", "Maya Yang", "Emily Dugan"], "date_download": "2024-02-05 15:19:48", "date_modify": "None", "date_publish": "2024-01-07 23:54:17", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F07%2Fmiddle-east-crisis-live-israel-west-bank-jenin-palestinian-ministry-latest-updates.json", "image_url": "https://i.guim.co.uk/img/media/438bd839edb371e27d3d841864d0c9010052bb8e/0_248_8192_4915/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c0376321ace7be0f0759b68239ba0a64", "language": "en", "localpath": null, "maintext": "From 7 Jan 2024 13.43 CET Israel says it has completed mission to destroy Hamas infrastructure in northern Gaza The Israeli military says it has completed its mission to destroy Hamas’s infrastructure in northern Gaza and has scaled back its military operations there as the offensive moves south, AP reports: In recent weeks, Israel had already been scaling back its military assault in northern Gaza and pressing its offensive in the territory’s south, where most of Gaza’s 2.3 million Palestinians are being squeezed into smaller areas in a humanitarian disaster while being pounded by Israeli airstrikes. The Israeli prime minister, Benjamin Netanyahu, on Sunday again insisted the war would not end until the objectives of eliminating Hamas, getting Israel’s hostages returned and ensuring that Gaza won’t be a threat to Israel are met. “I say this to both our enemies and our friend,” he told his cabinet. “This is our responsibility and this is the obligation of all of us.”\nUpdated at 13.53 CET\n7 Jan 2024 00.38 CET Patrick Wintour The UK is facing accusations of double standards after formally submitting detailed legal arguments to the international court of justice in The Hague six weeks ago to support claims that Myanmar committed genocide against the Rohingya ethnic group through its mass mistreatment of children and systematically depriving people of their homes and food. The UK made its 21-page “declaration of intervention” jointly with five other countries, but it is not supporting South Africa as it prepares to try to convince the ICJ on Thursday that Israel is at risk of committing genocide against the Palestinian people. The UK submission on Myanmar argues there is a lower threshold for determining genocide if the damage has been inflicted on children as opposed to adults. The submission said other actions that could be defined as genocidal, if systematic, include forced displacement from homes, deprivation of medical services and the imposition of subsistence diets. It argues that given declarations of intent to commit genocide are rare, the court’s test should not solely be explicit statements or numbers killed, but reasonable inference drawn from a pattern of conduct and factual evidence. Israel will defend itself at the UN-derived ICJ insisting it has been seeking to protect its civilian population in an attempt to destroy Hamas but not the Palestinian people. It says its postwar plans for Gaza involving Palestinian-led governance is proof of a lack of genocidal intent. Read the rest of Patrick Wintour’s report here: UK accused of hypocrisy in not backing claim of genocide in Gaza before ICJ Read more\n7 Jan 2024 00.32 CET Reged Ahmad here picking up the blog from Maya Yang Let’s get a closer look at what the US secretary of state Antony Blinken has been saying on his regional tour. He’s warned on Sunday that the war in Gaza could “metastasise” and threaten security in the wider Middle East, Agence France-Presse reports. Blinken told a news conference in Doha alongside Qatar’s prime minister sheikh Mohammed bin Abdulrahman Al Thani: This is a moment of profound tension in the region. This is a conflict that could easily metastasise, causing even more insecurity and even more suffering Amid the deepening humanitarian crisis and mass displacement in Gaza, Blinken said civilians “must be able to return home as soon as conditions allow”. “They cannot, they must not be pressed to leave Gaza,” he added, after two Israeli minsters suggested Palestinians should be encouraged to emigrate. Blinken arrived in Qatar following stops in Jordan, Turkey and Greece. He went on to Abu Dhabi late Sunday, and on Monday is due to travel to Saudi Arabia. Blinken will meet with Crown Prince Mohammed bin Salman in the Saudi desert city of Al-Ula, said a US official on condition of anonymity. For more on what Blinken had to say – read our full report: Blinken returns to Middle East and warns of risk war could spread Read more\n7 Jan 2024 23.56 CET Summary Here is where the day stands: The Qatari foreign ministry has released a statement following US secretary of state Antony Blinken’s meeting with Qatari prime minister Sheikh Mohammed bin Abdulrahman al-Thani on Sunday. In the statement, the Qatari foreign ministry said that Blinken and al-Thani discussed ways to pressure for a ceasefire, lift restrictions imposed on humanitarian aid and discussed negotiations to release prisoners and the latest regional developments.\nSome bakeries in Gaza have resumed functioning after over 50 days of closures due to shortages in fuel and electricity as a result of Israel’s deadly attacks across the strip. The World Food Programme announced the resumption of bakery functions in Gaza on Sunday, adding that it is providing wheat flour, salt, sugar and yeast so bakeries can start making bread again.\nBeirut’s airport screens were hacked on Sunday with messages that showed anti-Hezbollah messages, Agence France-Presse reports Lebanon’s state news agency saying. According to Lebanese media reports, the messages urged Hezbollah to not “drag the country into war”. Another message said: “You’re going to blow up our airport by bringing in weapons. Let the airport be freed from the grip of the [Hezbollah] statelet,” AFP reports.\nA Hezbollah rocket barrage on Saturday night damaged a strategic airbase in northern Israel, the country’s military confirmed. The Israeli Defense Forces declined to comment on the extent of the damage at Mt Meron airbase, which is less than 10km (6.21 miles) from the border with Lebanon.\nThe US secretary of state, Antony Blinken, said that he will urge Israel to do more to prevent Palestinian civilian deaths in Gaza, Reuters reports. Speaking at a news conference following his meeting with Qatari prime minister Sheikh Mohammed Bin Abdulrahman al-Thani, Blinken added that Palestinian civilians must be allowed to return home and not be forced to leave Gaza.\nUNRWA’s Gaza deputy director Scott Anderson gave an update on the deteriorating humanitarian situation in Gaza as a result of Israel’s deadly attacks which have killed nearly 23,000 Palestinians while leaving nearly 2 million survivors internally displaced. Speaking to CNN, Anderson said: “The levels of hunger are quite severe in Gaza. From Rafah to the north, it gets worse, the farther north you go.”\nCrew from Medical Aid for Palestinians (MAP) and the International Rescue Committee have been forced to withdraw from Gaza’s al-Aqsa hospital due to Israeli bombardment. In a statement released on Sunday, MAP said: “As a result of increasing Israeli military activity around the Al Aqsa hospital, the only functioning hospital in Gaza’s Middle Area, Medical Aid for Palestinians (MAP) and the International Rescue Committee (IRC)’s Emergency Medical Team (EMT) has been forced to withdraw and cease activities.”\nIsrael has named its former supreme court president Aharon Barak as its addition to the international court of justice (ICJ) panel scheduled to hear a genocide allegation filed against it this week, an Israeli official said. Under the ICJ’s rules a state that does not have a judge of its nationality already on the bench can choose an ad hoc judge to sit in their case, Reuters reports.\n7 Jan 2024 22.36 CET The Qatari foreign ministry has released a statement following US secretary of state Antony Blinken’s meeting with Qatari prime minister Sheikh Mohammed bin Abdulrahman Al Thani on Sunday. In the statement, the Qatari foreign ministry said that Blinken and al-Thani discussed ways to pressure for a ceasefire, lift restrictions imposed on humanitarian aid and discussed negotiations to release prisoners and the latest regional developments. It said that Qatar has warned of the “danger of expanding the cycle of violence in the region that is already suffering from constant conflicts”, adding that al-Thani “stressed the need for concerted regional and international efforts in order to achieve a ceasefire to stop bloodshed, protect civilians, deliver aid and limit the expansion of the conflict in the region”. Prime Minister and Minister of Foreign Affairs Meets US Secretary of State#MOFAQatar pic.twitter.com/uAS6H1ZmIo — Ministry of Foreign Affairs - Qatar (@MofaQatar_EN) January 7, 2024\nUpdated at 22.39 CET\n7 Jan 2024 21.59 CET World Food Programme: some bakeries functioning in Gaza after 50 days of closures Some bakeries in Gaza have resumed functioning after over 50 days of closures due to shortages in fuel and electricity as a result of Israel’s deadly attacks across the strip. The World Food Programme announced the resumption of bakery functions in Gaza on Sunday, adding that it is providing wheat flour, salt, sugar and yeast so bakeries can start making bread again. Some bakeries in #Gaza are back up and running after over 50 days of closures.\nWFP is providing wheat flour, salt, sugar and yeast so bakeries can start making bread again, increasing accessibility and affordability for thousands of displaced families. pic.twitter.com/pfwHgBnqJc — World Food Programme (@WFP) January 7, 2024 In a statement on Friday, UN aid chief Martin Griffiths warned that famine is “around the corner” as Palestinians displaced by Israeli attacks face the “highest levels of food insecurity ever recorded”. Three months since the horrific 7 October attacks, Gaza has become a place of death and despair.\nThis war should never have started. But it’s long past time for it to end.\nMy statement:https://t.co/lkUlogG3Cm pic.twitter.com/kLFBZsKGLt — Martin Griffiths (@UNReliefChief) January 5, 2024\n7 Jan 2024 21.37 CET The Palestine Red Crescent Society transferred one wounded Palestinian and 17 Palestinians who were killed by Israel’s strike on two houses in Deir al-Balah in central Gaza on Sunday. It added that Israeli forces opened fire on several citizens near Salah al-Din street. 🚨Today, the Palestine Red Crescent teams transferred 18 casualties 🚑due to the occupation's shelling of two houses in Deir al-Balah, central #Gaza, and the Israeli forces opening fire on several citizens near Salah al-Din Street.\n📷Filmed by PRCS volunteer, Mohammed Suliman. pic.twitter.com/LvFSCBjsEB — PRCS (@PalestineRCS) January 7, 2024\n7 Jan 2024 21.14 CET Israel has said that its ongoing war in Gaza – which has already killed at least nearly 23,000 Palestinians since 7 October – could last a year, in turn prompting fears of a regional war. The Guardian’s Jason Burke reports: Israeli defence officials and former senior intelligence officers have said they expect fighting in Gaza to continue for at least a year, raising the prospect of thousands more civilian casualties, a deepening humanitarian crisis and a continuing grave threat to regional stability. In a briefing, R Adm Daniel Hagari, a spokesperson for the Israel Defense Forces (IDF), said the centre and south of Gaza, where military efforts are now focused, was “dense and saturated with terrorists” with “an underground city of branching tunnels”. Three months would be needed to clear the area and fighting would “continue during the year 2024”, Hagari said. He said scattered fighting was to be expected in northern Gaza, along with rockets sporadically being launched from there toward Israel, but that Hamas militants were “without a framework and without commanders”. Maj Gen Amos Yadlin, a former head of military intelligence who is close to senior serving officers, compared the campaign to that led by a multinational coalition against Islamic State in 2017 that took nine months. But in Gaza the situation was much more challenging, he said “It will take a year to dismantle Hamas,” he said. “It is not the six-day war [of 1967]. The timeline is long … [IS strongholds] Mosul and Raqqa were not fortified underground … and the coalition was 85 countries.” Read the full story here: Israel says Gaza fighting could last a year, amplifying fears of regional war Read more\nUpdated at 21.19 CET\n7 Jan 2024 20.43 CET Lebanese media: Beirut airport screens hacked with anti-Hezbollah messages Beirut’s airport screens were hacked on Sunday with messages that showed anti-Hezbollah messages, Agence France-Presse reports Lebanon’s state news agency saying. According to Lebanese media reports, the messages urged Hezbollah to not “drag the country into war.” Another message said, “You’re going to blow up our airport by bringing in weapons. Let the airport be freed from the grip of the [Hezbollah] statelet,” AFP reports. Lebanon’s National News Agency said, “the cyber-attack on the departure and arrival screens at the airport disrupted the BHS baggage inspection system,” adding that authorities were working to restore the screens “and to maintain normal movement at the airport”. AFP reports local media circulating images of the anti-Hezbollah messages which were shown onscreen alongside the emblem of the Christian “Soldiers of God” group. AFP further reports that the group declined to comment after being contacted but that it later released a video statement in which it appeared to deny involvement in the cyber attack, calling it “the work of the devil”. “Don’t get us into a war” #Beirut airport screens hacked with a message to #Hezbollah SH #Nasrallah #Lebanon pic.twitter.com/u0Ynq8PjyC — Maha Yahya (@mahamyahya) January 7, 2024\nUpdated at 21.03 CET\n7 Jan 2024 20.07 CET Emma Graham-Harrison A Hezbollah rocket barrage on Saturday night damaged a strategic airbase in northern Israel, the country’s military confirmed. The Israeli Defence Forces declined to comment on the extent of the damage at Mt Meron airbase, which is less than 10km (6.21 miles) from the border with Lebanon. Images released by Hezbollah, and published by Israeli media, appeared to show a fire on or beside a dome protecting sensitive equipment at the airbase. The IDF said back-up systems meant the country’s air defence systems continued to function, and it was investigating the attack to prevent similar damage in the future. Hezbollah said on Saturday it had targeted the base in response for the assassination of Hamas’s deputy leader Saleh al-Arouri, who was killed by a missile strike in Beirut last week. The successful attack on a sensitive military facility underlines Hezbollah’s military capacity. Israelis security officials acknowledge the group would present a far more formidable enemy than Hamas if exchanges of cross-border fire, which have continued for three months, escalate into a full conflict.\nUpdated at 20.14 CET\n7 Jan 2024 19.41 CET The US secretary of state, Antony Blinken, said that he will urge Israel to do more to prevent Palestinian civilian deaths in Gaza, Reuters reports. Speaking at a news conference following his meeting with Qatari prime minister Sheikh Mohammed Bin Abdulrahman al-Thani, Blinken added that Palestinian civilians must be allowed to return home and not be forced to leave Gaza. Since 7 October, Israeli forces have killed nearly 23,000 Palestinians while displacing nearly 2 million survivors across the narrow strip. Blinken added that there are “too many journalists being killed in Gaza” and called the killing of Al Jazeera’s journalist Wael Dahdouh’s son Hamza by an Israeli strike on Sunday an “unimaginable tragedy”. Journalist Mustafa Thuraya was also killed in the attack when their vehicle was struck by an Israeli missile, Al Jazeera reports. In a statement released on Sunday, the network said: “We urge the International Criminal Court, the governments and human rights organisations, and the United Nations to hold Israel accountable for its heinous crimes and demand an end to the targeting and killing of journalists.”\nUpdated at 20.15 CET\n7 Jan 2024 19.00 CET In a new interview with CBS, Senator Chris Van Hollen, a Democrat from Maryland, spoke of the “the unnecessarily cumbersome process going through the Israeli screening process” of supplies, and “the so-called deconfliction process”. Van Hollen, who recently visited the Rafah border crossing with Democratic senator Jeff Merkley of Oregon, said: “There are two big things that are happening. One is the unnecessarily cumbersome process, going through the Israeli screening process, which I believe is the result of political decisions by the [Israeli prime minister Benjamin] Netanyahu coalition. For example, many items that should be allowed to go into Gaza, water- sort of- filtration systems, other systems like that, were in a warehouse of rejected items that we visited. While we were there, we saw a truck turned away that had a big box from UNICEF… It was a unit to help with water desalinization. It was rejected. And when one item on a truck is rejected, the entire truck is rejected. The other big issue is within Gaza, the so-called deconfliction process, which is just a fancy name for those who are providing humanitarian assistance to have the confidence that they can deliver it without being killed. And according to all the international NGOs that we talked about, who’ve been operating in conflict zones around the world, they’ve never seen a worse process for assuring the safe delivery of humanitarian assistance.”\nUpdated at 20.22 CET\n7 Jan 2024 18.20 CET US secretary of state, Antony Blinken, toured a World Food Programme warehouse that is providing aid to Palestinian civilians in Gaza, the US state department said on Sunday. “We are focused on maximizing humanitarian assistance in Gaza, and the secretary commended the extraordinary work of WFP to get more food to more people, more effectively,” the US state department said. In Amman, @SecBlinken toured a @WFP warehouse that is providing life-saving assistance to civilians in Gaza.\nWe are focused on maximizing humanitarian assistance in Gaza, and the Secretary commended the extraordinary work of WFP to get more food to more people, more effectively. pic.twitter.com/DR4HNFMjDp — Department of State (@StateDept) January 7, 2024 Blinken’s WFP visit comes as part of his week-long diplomacy tour across the region where he is set to meet with various leaders in efforts de-escalate the ongoing Israel-Gaza war.\nUpdated at 19.32 CET\n7 Jan 2024 17.57 CET UNRWA in 'life-saving' mode in Gaza as humanitarian crisis deteriorates UNRWA’s Gaza deputy director Scott Anderson gave an update on the deteriorating humanitarian situation in Gaza as a result of Israel’s deadly attacks which have killed nearly 23,000 Palestinians while leaving nearly 2 million survivors internally displaced. Speaking to CNN, Anderson said: “The levels of hunger are quite severe in Gaza. From Rafah to the north, it gets worse, the farther north you go. We’re making a concerted effort to try to import more food into Gaza and make sure it gets to people in need, including the 1.4 million people in the Rafah governorate. And then secondly, the hospital network in Gaza has been severely damaged. It’s almost collapsed. Bed capacity is well over 300% for normal beds and well over 200% for ICU. And because of the security situation, organizations like Medecins Sans Frontier…have had to evacuate hospitals where they were providing support. So for us, it’s very much in life-saving mode and trying to make sure that we get things to people that they need. He added: “The largest concern I would have is, the pressure on people is extraordinary and I don’t know how much more they can bear before something explodes in the southern part of Gaza within the civilian population which would impact the UN and other international humanitarians’ ability to respond to the ongoing operation.” “People are trying their best to live their lives and take care of their children”@ScottAnderGaza tells @CNN he doesn’t know how much more people in 📍#Gaza can bear in these dire conditions, without sufficient food, shelter, water and any basic amenities. pic.twitter.com/QMmfCacd2E — UNRWA (@UNRWA) January 7, 2024\n7 Jan 2024 17.27 CET Crew from Medical Aid for Palestinians and the International Rescue Committee have been forced to withdraw from Gaza’s al-Aqsa hospital due to Israeli bombardment. In a statement released on Sunday, MAP said: “As a result of increasing Israeli military activity around the Al Aqsa hospital, the only functioning hospital in Gaza’s Middle Area, Medical Aid for Palestinians (MAP) and the International Rescue Committee (IRC)’s Emergency Medical Team (EMT) has been forced to withdraw and cease activities. The Israeli military has dropped leaflets designating areas surrounding the hospital as a ‘red zone.’ Given the recent history of attacks on medical staff and facilities in Gaza, the team is unable to return. Many local health workers have also been unable to access the hospital to care for the hundreds of patients that remain due to the conflict.” 🚨As a result of increasing Israeli military activity around the Al Aqsa Hospital, the only functioning hospital in #Gaza’s Middle Area, MAP and @RESCUEorg’s Emergency Medical Team has been forced to withdraw and cease activities.https://t.co/nh91UBdNte pic.twitter.com/PUv056uisO — Medical Aid for Palestinians (@MedicalAidPal) January 7, 2024 Medical facilities across Gaza have been attacked and severely damaged as a result of Israel’s deadly bombardment across the strip since 7 October. Human rights groups including Human Rights Watch have condemned Israel’s attacks on Gaza’s healthcare system as “unlawful”. Meanwhile, the World Health Organization has called Israel’s evacuation orders to Gaza’s hospitals a “death sentence for the sick and injured”. Since 7 October, Israeli forces have killed nearly 23,000 Palestinians across Gaza while displacing nearly 2 million survivors.\nUpdated at 17.42 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Two journalists have been killed in an Israeli air strike in southern Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/07/middle-east-crisis-live-israel-west-bank-jenin-palestinian-ministry-latest-updates"}