{"authors": ["Peter Beaumont", "Emma Graham-Harrison", "Jason Burke"], "date_download": "2024-02-05 15:19:50", "date_modify": "None", "date_publish": "2024-01-07 22:40:27", "description": "US secretary of state begins visit to region as fears grow Israel could expand Gaza conflict to Lebanon", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F07%2Fblinken-middle-east-efforts-stop-spread-war-israel-gaza-lebanon.json", "image_url": "https://i.guim.co.uk/img/media/2f5edd35fa2a0f1fe1018972a427b6736ad7725b/864_319_3987_2392/master/3987.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f3b85c32d889ac4f3c4bf381f2850f8", "language": "en", "localpath": null, "maintext": "The US secretary of state, Antony Blinken, has returned to the Middle East for the fourth time in three months as he warned Israel’s war against Hamas risked spreading throughout the region.\nRecent intensifying violence between Israel and Lebanon’s Hezbollah, increasing attacks by Yemen’s Iran-backed Houthis on commercial shipping in the Red Sea, and strikes by Tehran-linked groups on US bases in Iraq, have created an increasingly febrile atmosphere across the Middle East.\nIsrael admitted on Sunday that a Hezbollah rocket barrage the previous night damaged a strategic airbase in northern Israel. Images released by Hezbollah appeared to show a fire on or beside a dome at the Mt Meron base, which is less than 10km from the border with Lebanon.\nView image in fullscreen Images released by Hezbollah of the Mt Meron base. Photograph: Hezbollah\nThe Israel Defense Forces (IDF) declined to comment on the extent of the damage and said backup systems meant the country’s air defences continued to function. But the successful hit on a sensitive military facility underlines Hezbollah’s capacity.\nIsrael’s security officials acknowledge the group would present a far more formidable enemy than Hamas if exchanges of cross-border fire escalate into a full conflict.\nBlinken addressed the threat the conflict could spread in comments on Sunday night. “This is a moment of profound tension in the region. This is a conflict that could easily metastasise, causing even more insecurity and even more suffering,” Blinken told a news conference in Doha alongside Qatar’s prime minister, Sheikh Mohammed bin Abdulrahman Al Thani.\nThe US secretary of state has already visited Jordan, Turkey and Greece on a tour that will also include stops in Israel, the West Bank, the United Arab Emirates, Saudi Arabia and Egypt.\nThe Washington Post reported on Sunday that the Biden administration had warned Israel against a significant escalation in Lebanon, while also citing a secret US Defense Intelligence Agency assessment that Israel would struggle to fight conflicts on two fronts, in Gaza and Lebanon.\nThe paper also reported that early in the Gaza war, Joe Biden called Netanyahu up to three times a day to dissuade Israel from launching a war on Hezbollah simultaneously, amid fears “all hell would break loose” in the region.\nWith border clashes continuing on Sunday morning, Lebanon reported that the IDF had shelled in the region of Khiam and Majdel Zoun.\nBlinken’s tour follows a stark warning delivered in Beirut by the EU foreign policy chief, Josep Borrell, that it was “imperative” to avoid a regional escalation in the Middle East. He warned Israel that “nobody will win from a regional conflict”.\nFears that the conflict could spread have been growing since Israel’s assassination last week of a top Hamas official, Saleh al-Arouri, in a strike on an office in Dahiyeh, a southern suburb of Beirut that is a Hezbollah stronghold. It was the first airstrike on the Lebanese capital since the end of the hugely destructive Israeli war on Lebanon in 2006.\nIn comments made during a brief stop in Crete, Blinken described the “real concern” over the Israel-Lebanon blue line, where even before the strike there had been daily exchanges of fire.\n“We want to do everything possible to make sure that we don’t see escalation there” and to avoid an “endless cycle of violence”, Blinken said.\nOn Saturday, in what it described as its “initial response” to the Arouri assassination, Hezbollah fired dozens of missiles into northern Israel including in the area of the Mount Meron airbase, a significant Israeli surveillance centre.\nIn reply Israel struck targets up to 25 miles (40km) inside Lebanon, including what it said was a Hezbollah air defence centre, as US officials have suggested that the exchanges on the border have become more aggressive in recent weeks.\nAccording to the Washington Post article on Sunday, based on US intelligence it has reviewed and interviews with officials, concern has been mounting again in the White House that Israel’s partial drawdown of thousands of troops in Gaza could allow it to consider striking Hezbollah.\n“They have a freer hand to escalate,” a US official told the paper.\nThe sense of urgency over Lebanon in particular was underlined on Sunday by increasingly pessimistic analysis in the Israeli media and elsewhere that a wider war with Hezbollah could be avoided, after Israel’s defence minister, Yoav Gallant, said last week there was only a small window for a diplomatic solution to the border crisis.\nIsrael’s Channel 13 quoted senior anonymous Israeli officials pouring cold water on the likelihood of a political solution, adding that their assessment was that war with Hezbollah was “inevitable”.\nWriting in Yedioth Ahronoth, Yossi Yehoshua also painted a gloomy picture: “The dynamic is obvious. Escalating hostilities that are liable to spiral out of control.”\nEyal Hulata, a former national security adviser, said that after 7 October Israel could not accept Hezbollah militants right on its northern border. “The fact that they are so close to the fence, is something I thought we should have dealt with in real time,” he told journalists at a briefing. “We will need to deal with that eventually.”\nView image in fullscreen Blinken (second left) meeting King Abdullah of Jordan (second right) and Crown Prince Hussein (right) in Amman on Sunday. Photograph: Royal Hashemite Court/EPA\nIsraelis could not live in the shadow of another attack, although the military would probably try to avoid a full-blown war while fighting in Gaza, he added.\n“After October 7 there are no excuses; no one can say we didn’t think this could happen … because it happened. And Israel will not be able to wait for this to happen again.\n“Eventually, not now, because we don’t need to have two fronts, we might find ourselves in a situation – maybe not this government maybe the next government – where we might need to do a pre-emptive strike in Lebanon to push them out of the border, instead of waiting for them to break into the communities in the north.”\nBlinken’s visit comes as developments in Lebanon, northern Israel, the Red Sea and Iraq have put intense strains on what had been a modestly successful US push to prevent a regional conflagration since Hamas attacked Israel on 7 October, and as international criticism of Israel’s military operation mounts.\nThe long-term position of Israeli defence officials and experts with close connections to the military has been that they do not believe Hezbollah’s leader, Hassan Nasrallah, wants a war with Israel .\nIt is also the case, however, that the Israeli defence and intelligence establishment failed to anticipate Hamas’s real intentions ahead of the 7 October attack.\nThere is also concern in Israel about the imminent hearings at the international court of justice (ICJ) in proceedings launched by South Africa against Israel over the Gaza war.\nSouth Africa has asked the ICJ for an urgent order declaring that Israel is in breach of its obligations under the 1948 genocide convention in its war against Hamas. Israel had said it would appear before the court to contest the accusations, some based on statements by far-right ministers in Netanyahu’s government.\nThe minister for national security, Itamar Ben-Gvir, called again on Sunday for the mass emigration of Palestinians and the renewal of Israeli settlements in Gaza. “I think it’s the right solution,” he said in an interview with the national broadcaster.\nThe US condemned such calls as inflammatory and irresponsible last week, but Netanyahu has so far ignored pressure from Washington to rein in his coalition partners.", "source_domain": "www.theguardian.com", "text": null, "title": "Blinken returns to Middle East and warns of risk war could spread", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/07/blinken-middle-east-efforts-stop-spread-war-israel-gaza-lebanon"}