{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:19:51", "date_modify": "None", "date_publish": "2024-01-07 18:07:49", "description": "Comments from senior defence officials come during tour by US secretary of state, Antony Blinken, intended to defuse tensions", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F07%2Fisrael-says-gaza-fighting-could-last-a-year-amplifying-fears-of-regional-war.json", "image_url": "https://i.guim.co.uk/img/media/9ce9a0a63b89039310bafecd513a25fdef7bbd02/0_237_7500_4500/master/7500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ec0e1ec469c4d976cbc2517efa0354fa", "language": "en", "localpath": null, "maintext": "Israeli defence officials and former senior intelligence officers have said they expect fighting in Gaza to continue for at least a year, raising the prospect of thousands more civilian casualties, a deepening humanitarian crisis and a continuing grave threat to regional stability.\nIn a briefing, R Adm Daniel Hagari, a spokesperson for the Israel Defense Forces (IDF), said the centre and south of Gaza, where military efforts are now focused, was “dense and saturated with terrorists” with “an underground city of branching tunnels”.\nThree months would be needed to clear the area and fighting would “continue during the year 2024”, Hagari said.\nHe said scattered fighting was to be expected in northern Gaza, along with rockets sporadically being launched from there toward Israel, but that Hamas militants were “without a framework and without commanders”.\nMaj Gen Amos Yadlin, a former head of military intelligence who is close to senior serving officers, compared the campaign to that led by a multinational coalition against Islamic State in 2017 that took nine months. But in Gaza the situation was much more challenging, he said\n“It will take a year to dismantle Hamas,” he said. “It is not the six-day war [of 1967]. The timeline is long … [IS strongholds] Mosul and Raqqa were not fortified underground … and the coalition was 85 countries.”\nYadlin also compared the current Israeli offensive to that launched by the IDF into the West Bank in 2002 after a wave of suicide bombings by Palestinian militant groups.\n“In 2002 it took two months to get into Palestinian cities and two years to make the terror stop. So Israel is looking at nine months to a year [in Gaza]. It depends on how long Hamas will hold [on],” he said.\nThe new timeline will concern international observers worried about regional instability and aid agencies who have described a humanitarian catastrophe in Gaza.\nView image in fullscreen A displaced Palestinian child plays in Rafah near the border with Egypt. Photograph: Ibraheem Abu Mustafa/Reuters\nThere are widespread fears that clashes along Israel’s northern border between its military and Hezbollah could escalate into all-out war, possibly plunging the region into a wider conflict.\nBenjamin Netanyahu has said the war will not end until the aims of “crushing” Hamas, freeing Israeli hostages and ensuring that Gaza poses no further security threat to Israel are met.\n“I say this to both our enemies and our friends. This is our responsibility and this is our commitment,” Israel’s prime minister told his cabinet on Sunday.\nNetanyahu faces a difficult meeting this week with the US secretary of state, Antony Blinken, who is on a week-long Middle East tour. Washington’s top diplomat is expected to demand Israel does more to protect civilians in Gaza, allows more aid to reach the territory and offers more detailed proposals for the governance of the territory when Israel’s military offensive ends.\nIsrael’s defence minister, Yoav Gallant, suggested last week that unspecified Palestinian bodies – apparently local civil servants or community leaders – would take over the territory’s governance.\nGallant also indicated a more precise approach to targeting Hamas fighters and their leaders to reduce civilian casualties.\nYadlin, however, said the IDF’s southern command, which has responsibility for Gaza, had started planning buffer zones within the territory that would be heavily mined to prevent any repeat of the 7 October attack. Such a move would be controversial.\nIsrael’s campaign in Gaza has killed more than 22,400 people, more than two-thirds of them women and children, according to the Hamas-run health ministry in the territory. Thousands more are thought to be buried under rubble and tens of thousands wounded.\nThe offensive was launched after Hamas sent thousands of militants into southern Israel, where they killed about 1,200 people, mostly civilians, and abducted about 240 others.\nIsrael blames Hamas for the civilian casualties in Gaza, accusing the group of using residents as a “human shield” and says it has killed 8,000 “terrorists”.\nAn airstrike near the southern city of Rafah killed two journalists on Sunday, including Hamza Dahdouh, the oldest son of Wael Dahdouh, Al Jazeera’s well-known chief correspondent in Gaza, the Arabic channel and local medical officials said. Al Jazeera broadcast footage of Dahdouh, weeping and holding his son’s hand, before walking away in a daze.\n00:01:18 Two journalists killed in an Israeli airstrike in southern Gaza – video report\nDahdouh previously lost his wife, two children and a grandchild in a 26 October airstrike, and he was wounded himself in an Israeli strike last month that killed a co-worker.\nHagari said on Saturday that the IDF’s campaign would use “a different method” in the centre and south of Gaza.\n“We apply the lessons we have learned and continue to develop more creative and cunning ways to fight in space – to kill terrorists, destroy terrorist infrastructures, and means of warfare above and below the ground,” he told reporters.\nThe war in Gaza has also led to an increase in violence in the occupied West Bank, where nine people were killed on Sunday, including seven Palestinians, in an Israeli airstrike on the northern city of Jenin, according to Palestinian authorities.\nThe IDF said “six terrorists were killed when an aircraft struck a terrorist who hurled explosive devices” at troops in an operation in Jenin refugee camp.\nPolice said an Israeli officer had also been killed during an operation at the refugee camp when a vehicle struck a homemade bomb. An Israeli civilian was shot dead in another incident elsewhere, the army said.\nThere are still 139 hostages being held in Gaza, including civilians and military personnel, though some are thought to have been killed during the fighting. Thousands of people protested in Tel Aviv on Saturday, calling on the Israeli government to prioritise their release.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel says Gaza fighting could last a year, amplifying fears of regional war", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/07/israel-says-gaza-fighting-could-last-a-year-amplifying-fears-of-regional-war"}