{"authors": ["Katie Daly", "Lifestyle Writer"], "date_download": "2024-02-05 15:19:57", "date_modify": "None", "date_publish": "2024-01-06 16:16:22", "description": "Princess Leonor of Asturias made a royal first as she attended the Military Easter ceremony at the Royal Palace in Madrid alongside her parents King Felipe VI and Queen Letizia", "filename": "https%3A%2F%2Fwww.hellomagazine.com%2Froyalty%2F510684%2Fprincess-leonor-spain-poised-military-uniform-royal-first-king-felipe-queen-letizia%2F.json", "image_url": "https://images.hellomagazine.com/horizon/landscape/87b8008915ab-royals-spainsplit.jpg?tx=c_fill%2Cw_1200", "language": "en", "localpath": null, "maintext": "Princess Leonor of Spain stepped out for a royal first on Saturday alongside her parents King Felipe VI and Queen Letizia. The future monarch, 18, looked so poised as she arrived at her Military Easter debut at the Royal Palace in Madrid earlier today in her military uniform. The event marked the family's first public appearance of the year.\nThe young royal began her military training in Zaragoza in August 2023, a momentous year for the princess who also graduated from UWC Atlantic, a boarding school in Wales, pledged her allegiance to the Spanish flag, and turned 18.\n© Getty Crown Princess Leonor of Spain attended the Pascua Militar ceremony\nLeonor was seen with her parents greeting members of the armed forces at the special event which signifies the commencement of the military year. The event celebrates the recovery of the Menorcan town of Mahon on 6 January 1782 from the hands of the English.\nTake a look at the best pictures of the historic event…\nKing Felipe arrives © Getty King Felipe, 55, was seen arriving at the Plaza de la Armería for the Military Easter event at the Royal Palace in his military dress where he passed review of the armed forces. The King looked so smart in his dress uniform as he passed by members on horseback.\nPrincess Leonor and Queen Letizia arrive © Getty Leonor of Asturias arrived with her mother in her dress uniform as a cadet at the General Military Academy (AGM) in Zaragoza for the very first time. Her mother Letizia, 51, was seen in support of her daughter in a black coat with fur trim and black maxi skirt. Leonor and her father were seen standing to attention while Letizia looked on with pride.\nThe salute © Getty Princess Leonor and her father were seen standing to attention before entering the palace. During the ceremony, honors are paid with the national anthem and a 21-gun salute.\nFelipe arrives at the palace © Getty With the authorities who received them, the royals left the Plaza de la Armería to go to the Embajadores Hall, where they were greeted by staff from National Heritage and the Military Fourth – president of the Board of Directors, Ana de la Cueva Fernández; Managing Director of National Heritage, María Dolores Menéndez Company; director of official and cultural events, Reyes Moreno Castillo; and officers of the Military Quarter. The King was seen looking regal in his uniform as he entered smiling regally at onlooking members of government and military personnel. His wife and eldest daughter walked a pace behind him.\nLetizia and Leonor arrive at the palace © Getty The Princess and her mother were seen entering the palace in a stunning photograph minus the monarch himself. Leonor looked so grown-up alongside her mother who looked so stunning in neutrals. The inside of the palace was a sight to behold with gold adornments covering the impressive interior.\nLeonor and Letizia greet members of the armed forces © Getty Princess Leonor looked every inch a future queen in the photographs taken alongside her parents where she greeted military personnel with a handshake and warm smile.\nThe Princess' royal handshake © Getty The royal mirrored her mother as she shook the hands of high-ranking military officers during the 'Pascua Militar' military ceremony. After the greetings in the Embajadores Hall, their Majesties headed down the Ambassador's Staircase to the Throne Room, where they were greeted by the heads of units of the Household of HM the King beforing entering the Gasparini Saleta.\nThe Interior Minister and Defense Minister arrive © Getty Also present at the occasion were members of government. The Interior Minister Fernando Grande-Marlaska and Defense Minister Margarita Robles were seen arriving at the palace in smart dress. Margarita Robles looked so elegant in a cornflower blue tiered dress with a rhinestone-encrusted bow-shaped brooch and black heels.\nLetizia wows in satin © Getty Queen Letizia looked so stunning in an outfit fit for the occasion. The royal was seen in a pair of high-waisted maxi skirt with a split at the back which she styled with a dovetail grey satin blouse with a high neck and long sleeves. The ever-stylish Queen wore her hair off her face in a mid ponytail with a trendy front section swept over her face. She teamed the look with a pair of platformed black pointed-toe heels and put on a pair of glitzy flower earrings.\nLeonor is the spitting image of her mother © Getty A close-up shot of the Princess of Asturias showed the 18-year-old's likeness to her mother. Leonor wore her hair swept off her face in a tight low bun with very natural makeup - just a lick of mascara and a touch of lip balm.\nRoyal trio at the ceremony © Getty In the Throne Room King Felipe awarded decorations to 20 commissioners and gave a speech. The Minister of Defense also said a few words. \"This celebration is not just another one for the Crown. It is the 10th Military Easter that I have the honor of presiding over and it happily coincides with the fact that for the first time, the Princess of Asturias accompanies us; who, as a Lady Cadet of the General Military Academy, has started her military training plan this year. \"So – along with the Queen and the Princess –, as Supreme Commander, I would like to convey my congratulations and annual recognition to the members of the Armed Forces and the Civil Guard, to the members of the National Intelligence Center, and to the group of men and women, civil and military, who, in the Ministry or in any field, serve the Defense and National Security,\" she concluded.\nThe King's speech © Getty In his speech, the King said: \"The year 2023 has proven to be a very demanding period, in which, together with the development of the permanent missions with which you ensure the sovereignty and independence of Spain, you have continued to carry out a long list of tasks within the strategic objectives established in international missions.\" \"The sincere and deep affection of the Crown towards those of you who are part of the Armed Forces, the Civil Guard, and the National Intelligence Center, because, by offering a life of sacrificial and selfless service to others, you are a good reflection of the nobility of the Spanish people.\"\nDISCOVER: Royalty's best fashion moments of 2023, according to a royal style expert", "source_domain": "www.hellomagazine.com", "text": null, "title": "Princess Leonor is so poised in military uniform for royal first supported by King Felipe VI and Queen Letizia", "title_page": null, "title_rss": null, "url": "https://www.hellomagazine.com/royalty/510684/princess-leonor-spain-poised-military-uniform-royal-first-king-felipe-queen-letizia/"}