{"authors": ["Simon Tisdall"], "date_download": "2024-02-05 15:19:58", "date_modify": "None", "date_publish": "2024-01-06 14:00:11", "description": "Assassinations, atrocities and invasions, along with uncertain US leadership, presage a year of rising violence", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F06%2Ffrom-gaza-to-ukraine-brute-force-threatens-to-triumph-in-2024.json", "image_url": "https://i.guim.co.uk/img/media/48bb7afb0c221d8604b7884a46c0d519b4864bf7/0_178_5331_3198/master/5331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=9571633d6e42a205c254232617577446", "language": "en", "localpath": null, "maintext": "Assassination is a two-edged sword. Last week’s targeted killing in Beirut of Hamas’s deputy leader is but the latest of many covert attacks on individuals in Iran and the Arab sphere attributed to agents of Israel. Do prime minister Benjamin Netanyahu and other senior officials in Jerusalem ever consider the possibility they may be paid back in kind?\nHamas may not have the expertise and reach, although a booby-trap bomb requires no particular skill. But Iran does and maybe Hezbollah, too. Israel’s assassination in December of a top Iranian general in Syria, plus last week’s atrocity in southern Iran – claimed by Islamic State terrorists but officially blamed on Israel – could goad Tehran’s more rabid hardliners into seeking an eye for an eye.\nLike Netanyahu, Russia’s president, Vladimir Putin, is not averse to disposing of foes with chilling finality. The trail of bodies since he became president in 2000 is a long one, stretching from the gates of the Kremlin to Salisbury and back again to Siberia. Putin tried to kill Ukraine’s leader, Volodymyr Zelenskiy, when he invaded in 2022. He may yet try again.\nDoes Putin, a self-styled “strongman” who cowers out of public view, also fear the assassin’s knife? Russia claimed last May’s Ukrainian drone strike on the Kremlin was an attempted assassination. Rebel mercenary boss Yevgeny Prigozhin might have plotted to kill Putin. But after his Wagner group mutinied in June, it was he who died suddenly, his plane mysteriously blown out of the sky.\nDifferences between the Gaza and Ukraine conflicts are less instructive than their many similarities – of which the homicidal tendencies of Netanyahu and Putin are a prime example. Both wars are to a large degree defined by their hubris, prejudices and mistakes. If these two warmongers were somehow taken out of the equation, peace deals may be easier to achieve.\nYet the fact such men still call the shots speaks volumes about the violent state of world as 2024 dawns. Both have led their countries into disastrous military cul-de-sacs. Netanyahu vows to wholly eradicate Hamas: an unattainable aim. Putin thinks sovereign Ukraine can be annexed by force. Chasing these illusions, they kill tens of thousands of civilians with assumed impunity. Both are war criminals. Both predict, and hope to hide behind, war without end.\nGaza and Ukraine point to terminal debility in the post-1945 rules-based international order, too. In both cases, the UN security council, whose job is to uphold the UN charter and international law, has failed dismally. The strictures of the international criminal court, which seeks Putin’s arrest, are contemptuously brushed aside by Russia and many other countries.\nSince the 7 October Hamas terrorist attacks, the world has witnessed state-directed carnage and mayhem in Gaza that informed observers believe fits the legal definition of genocide. Alleging exactly that, South Africa is taking Israel before the UN’s top tribunal, the international court of justice, this week. Yet the Israel Defense Forces will certainly ignore any interim ruling that curbs operations.\nThese two wars also cruelly expose the limitations of modern diplomacy. Although western leaders insist only negotiations will ultimately stop the bloodshed, neither the US, the EU, the G7, the G20, the Arab League, the Brics nor the UN have achieved lasting ceasefires, let alone viable peace plans. Revived talk of a two-state solution in Israel-Palestine smacks of mere cynicism. Ukraine is diplomatically deadlocked. Mediation everywhere is at a standstill.\n“Peacemaking [is] in crisis,” International Crisis Group (ICG) chiefs warned last week. “Worldwide, diplomatic efforts to end fighting are failing. More leaders are pursuing their ends militarily. More believe they can get away with it.” In Sudan, Myanmar, Nagorno-Karabakh, Tigray, Syria and potentially Taiwan, the story was the same, the ICG said. “Around the globe, more people are dying in fighting, being forced from their homes, or in need of aid than in decades.”\nIn the absence of hope, fear of uncontrolled escalation – and ensuing negative global political and economic fallout – is another factor common to the Middle East and Ukraine. Like the sabotage of Baltic gas pipelines, Houthi rebel attacks from Yemen on Red Sea shipping illustrate how long-unresolved, intensifying regional conflicts can trigger wider international instability. Unrelieved horror in Gaza means simmering hostility pitting Israel against Iran is more likely to boil over.\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThe converse may also hold true. Nato should have escalated to help Ukraine in 2022. Its refusal to intervene, born of exaggerated fears, allowed Russian aggression to continue unchecked, leading to many avoidable civilian deaths. Allied fighter jets scrambled recently to intercept a Russian missile that flew 25 miles (40km) into Poland. Was the Kremlin crudely warning Warsaw it could be next? After huge air attacks over the holiday period, Ukraine escalated, killing civilians in Russian Belgorod.\nBoth the Ukraine and Gaza crises have sparked familiar western divisions and internal splits over the extent of outside intervention. Hungary’s pro-Russia leader, for example, is still blocking EU funds for Kyiv. Turkey, theoretically a Nato member, is refusing to allow two British mine-hunting ships donated to Ukraine to enter the Black Sea.\nUS president Joe Biden was too slow to arm Ukraine, too cautious in confronting Putin. Now, thanks to Trumpist Republicans in Congress, further US military assistance is on ice. Biden’s ill-judged refusal to rein in Netanyahu and back a ceasefire has dismayed European allies and isolated the US on the world stage, damaging its political and moral authority.\nUncertain American leadership, prospectively compounded by an inward-focused presidential election dogfight that kicks off in Iowa this week, bodes ill for the Middle East, Europe and western democracy. Another assassination, another unpunished atrocity, another invasion, and 2024 could become the year when brute force triumphs over reason, law and common decency.", "source_domain": "www.theguardian.com", "text": null, "title": "From Gaza to Ukraine, brute force threatens to triumph in 2024", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/06/from-gaza-to-ukraine-brute-force-threatens-to-triumph-in-2024"}