{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:14:53", "date_modify": "None", "date_publish": "2024-01-29 20:29:13", "description": "President Biden reiterated that the U.S. would hold those responsible for an attack that killed three U.S. troops 'to account,' as his administration pointed to an Iran-backed proxy group.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13020551%2FWe-know-Iran-drone-strike-killed-three-U-S-troops-Pentagon-White-House-say-retaliation-not-want-war-Biden-Lloyd-Austin-speak-Situation-Room-reaction.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/29/20/80603143-0-image-a-14_1706559829618.jpg", "language": "en", "localpath": null, "maintext": "The Pentagon said Monday that 'fingerprints' on the drone attack that killed three U.S. troops in Jordan pointed to an Iran proxy group – with no clear answer yet on how or where the U.S. would respond.\nPentagon spokeswoman Sabrina Singh identified a militia backed by Iran's Revolutionary Guard Corps, while revealing the number of injured U.S. injured in the brazen drone attack has climbed to 40.\n'We know this is an IRGC backed militia, it has the footprints of Kata'ib Hezbollah but not making a final assessment on that,' she said, identifying an Iraqi Shiite militia backed by Tehran.\nWhite House national security spokesman John Kirby had earlier called the group 'responsible' for the attack.\n'Our teams here are continuing to do the analysis but we know that Iran is behind it,' he said.\nThe White House put out an image of President Biden meeting with his security team, including Defense Secretary Lloyd Austin, on Monday as the administration prepares to respond to an attack on a U.S. base in Jordan\n'Iran continues to arm and equip these groups to launch these attacks and we will certainly hold them responsible,' she added.\nBut the White House and the Pentagon stopped short of saying the attack was directed from inside Tehran, stressing that Iran has funded and equipped proxy forces in the past.\nKirby also would not rule out U.S. strikes inside Iranian territory, while stressing repeatedly that the U.S. does not seek war, as U.S. forces suffer repeated attempted attacks amid Israel's war in Gaza.\nSingh said U.S. Central Command was assessing how the one-way attack drone was able to successfully hit the U.S. base. Singh said the drone hit a 'contained housing unit' in the early hours Saturday night, and that troops were sleeping there at the time.\nThe Pentagon identified the three U.S. troops killed in the attack.\nThey were Sgt. William Rivers, 46 of Carrollton, Georgia, Specialist Kennedy Sanders, 24 of Waycross, Georgia and Specialist Breonna Moffett, 23, of Savannah, Georgia, the Department of Defense announced Monday.\nRivers, Sanders and Moffett were assigned to the 718th Engineer Company, 926th Engineer Battalion, 926th Engineer Brigade stationed at Fort Moore, Georgia.\nThe new details about the attack and preparations for a U.S. response came as President Biden held his second meeting with his security team since the attack. The White House released an image from the Situation Room that showed the president looking to his left, with Defense Secretary Lloyd Austin seated next to him in that direction.\nThe president again warned that the U.S. would hold those responsible 'to account.' He met with members of his security team including Austin, who has been working at home for weeks after being hospitalized\nPentagon spokeswoman Sabrina Singh identified a militia backed by Iran's Revolutionary Guard Corps, and Iran was 'behind' the attack. The Pentagon identified by name three U.S. troops killed in the attack on a base in Jordan\nThat came after Austin was back at work at the Pentagon Monday for the first time since undergoing prostate surgery, following a weekend drone attack that killed three U.S. service members at an air base in Jordan.\nHe was back at the office amid tense strategy sessions about how the U.S. should respond to repeated attacks on U.S. forces that the White House says is being backed by Iran and carried out by its proxies.\n'At this important time, I'm glad to be back at the Pentagon,' Austin said at the top of a meeting with NATO Secretary General Jens Stoltenberg.\n'I feel good and recovering well, but still recovering, and I appreciate all the good wishes that I have received thus far,' he said.\nAustin made no mention of the work from home controversy that infuriated top officials and caused changes in federal policies.\nHe was last in the Pentagon December 21, and had surgery for prostate cancer December 22 – in an episode that left the White House unaware of his location and publicly calling him out for failing to disclose the situation.\nHe had emergency surgery at Walter Reed National Military Medical Center following complications from his earlier procedure. That resulted in a two week hospital stay, and revelations that he hadn't told the White House about his cancer diagnosis or his procedure. He also didn't tell President Biden or congressional leaders.\nDefense Secretary Lloyd Austin was back at work at the Pentagon for the first time since his December surgery for a procedure he did not disclose to the White House in advance. He attended a meeting with NATO Secretary General Jens Stoltenberg at the Pentagon Monday\nHis return underlined the severity of the military and diplomatic situation the U.S. was facing following the attack that killed three U.S. troops and injured 30. His earlier hospitalization also coincided with attacks on U.S. forces, but the White House said he was monitoring the situation and participating in meetings remotely from his hospital room even amid his recovery.\nAustin addressed the attack, expressing 'outrage and sorrow for the death of three brave U.S. troops in Jordan and for the other troops who were wounded.'\n'The president and I will not tolerate attacks on U.S. forces and we will take all necessary steps to defend the US and our troops,' he said, reading from prepared remarks before welcoming Stoltenberg and flashing a smile when he pivoted to welcoming his guest.\nIt was his first public appearance since he took part in a zoom meeting on Ukraine, appearing gaunt.\nAustin's return to the office came on a day White House national security spokesman John Kirby insisted there will a 'very consequential response' to the weekend drone attack that killed three Americans – even as the U.S. seeks to avoid a war with Iran.\nKirby spoke after Biden met with his security team to develop options following the attack, which threatened to bring the U.S. into an expanded regional conflict that Biden says he hopes to avoid as the U.S. tries to discourage further brazen attacks on American forces.\nAustin was back at the office for a meeting with with NATO Secretary General Jens Stoltenberg at the Pentagon. It was his first time there since his hospitalization for complications from cancer treatment that he initially failed to disclose to the president and Congress\nAustin and top Pentagon officials are advising President Biden on how the U.S. should respond, amid some Republican officials calling for the U.S. to strike inside Iran\nTough cookie: Austin said he was still recovering following his surgery and hospitalization. He appeared thinner than before his hospitalization\nA noticeably slimmer Defense Secretary Lloyd Austin was seen for the first time in a month on last week in the aftermath of the scandal over his secret hospital trip to treat complications from prostate cancer surgery\nDefense Secretary Lloyd Austin, 70, was hospitalized on January 1 and released on January 15th. He is pictured December 20 before he went in for surgery\nThe U.S. will respond 'in a very consequential way,' Kirby told CNN in one of a series of interviews as national security leaders develop next steps.\n'He'll do this in a time and a manner of his own choosing, and we'll respond as he said – we'll respond and we'll respond in a very consequential way. But we don't seek a war with Iran. We're not looking for a wider conflict in the Middle East,' he said.\nKirby didn't respond to directly to a question about whether there were targets inside Iran. 'In fact, every action the president has taken has been designed to de-escalate, to try to bring the tensions down,' he said. Kirby said the U.S. has a 'pretty good sense' about which group was responsible, but said the U.S. is still working on the attribution.\nWhite House national security spokesman John Kirby vowed a 'consequential response' following the drone attack that killed three Americans at a base in Jordan, but declined to reveal details on its nature or timing\nIt was one of several times when Kirby cautioned against escalation on Monday, while the White House is also engaged in multilateral talks seeking to free hostages held by Hamas inside Gaza.\n'We're not looking for a broader war in the region. We certainly aren't looking for a conflict with Iran,' Kirby told ABC's 'This Week' Monday.\n'But make no mistake, Iran is supporting these groups that are already resourcing them training them. You know, certainly not discouraging these attacks at all,' he said.\nThen Kirby rattled off just some of the militant proxies that Tehran has backed in the region, with more than 150 attacks on U.S. forces since Israel launched its war in Gaza after the October 7 attacks.\n'We know they support the Houthis Hezbollah, Hamas, they are definitely causing a lot of these attacks to happen. We just – we're going to work through the right options here and make the right decisions,' he said.\nThat prompted interviewer George Stephanopoulos to tell him that deterrence 'does not seem to be working.'\nKirby didn't give any clues about the size or the pace of the U.S. response, which Biden said Sunday would come at the time of America's choosing.\n'He's going to have to weigh what the options are going to be. There will be a response,' he underlined. 'This was a consequential attack, no question about it and our thoughts and prayers go to the families that are cut the worst possible news over the weekend,' Kirby said.\nKirby gave a series of interviews Monday, as Republican critics demanded Biden respond forcefully, with some calling for U.S. strikes inside Tehran\nThe deaths of three US soldiers in a drone attack by Iran-backed militants on US base Tower 22 in Jordan (pictured) risk further inflaming the on-going crisis in the Middle East, experts have warned, and could lead to a wider conflict\nThe drone attack impacted a US outpost located in the northeast part of the country known as Tower 22, near the Syria border, and resulted in at least 34 other injuries\nHis comments came after Biden addressed the attack over the weekend in South Carolina, amid pressure from Republican critics to undertake strikes inside Iran as punishment for its support for proxy forces hitting U.S. troops and commercial targets in the region.\nBiden vowed that 'we shall respond' following the Saturday night attack – which also injured dozens and required some to be evacuated for treatment in a sign of the seriousness of injuries.\n'We had a tough day last night in the Middle East. We lost three brave souls,' he said during a visit to a church in Columbia, South Carolina, where he also asked for a moment of silence for those lost.\nThe Islamic Resistance in Iraq took responsibility for the attack, but Tehran has denied involvement in planning it.\nIran's foreign ministry spokesman Nasser Kanaani said it was 'not involved in the decision making of resistance groups' over how they 'defend Palestinians or their own countries'. He called claims of Iran's own involvement 'baseless.'\nEarlier on Sunday, Sen. Lindsey Graham (R-S.C.) demanded Biden act swiftly and decisively to counterstrike against Iran after the suicide drone strike sparked widespread outrage.\nThe Pentagon confirmed that the Saturday strike resulted in three soldiers' deaths and injured another 34. The top suspect remains Iran and its proxies.\n'I am calling on the Biden Administration to strike targets of significance inside Iran, not only as reprisal for the killing of our forces, but as deterrence against future aggression,' the South Carolina senator wrote in a statement. 'The only thing the Iranian regime understands is force. Until they pay a price with their infrastructure and their personnel, the attacks on U.S. troops will continue.'\nGraham urged Biden: 'Hit Iran now. Hit them hard.'\nHouse Foreign Affairs Chairman Michael McCaul also blamed the Biden administration for being too weak on Iran and facilitating a foreign policy environment where they thought they could get away with it.\n'Iran's proxies have launched over 150 attacks on US troops since October, as the Iran-backed Houthis attack global shipping, and Iran-backed Hezbollah and Hamas attack our ally Israel,' McCaul wrote. 'The Biden administration's failed Middle East policy has destroyed our deterrence against adversaries in the Middle East.'\nThe deaths of three US soldiers in a drone attack by Iran-backed militants risk further inflaming the on-going crisis in the Middle East, experts have warned.\nA former CIA director called the weekend strike on the US base a 'dangerous escalation' in tensions that have already engulfed the region following Hamas's October 7 terror attack on southern Israel, and Israel's subsequent assault on Gaza.\nAfter he warned that the US 'shall respond' to the strike, analysts say US president Joe Biden must be calculated in his retaliation and strike a balance between pleasing those at home who want to see a show of force, and averting a wider conflict.\nIf the White House is not strong enough in its response, experts say Iran's proxies will remain undeterred and continue to carry out attacks. Too strong, and Biden risks plunging the Middle East into a deeper conflict.\nFurther escalation, one expert warns, 'would bring the Middle East to the precipice of a regional war', while another said they expect a 'expect a serious escalation around the corner.'\nBut in doing so, Biden also runs the risk of playing into the 'optimal scenario' for Vladimir Putin, whose war in Ukraine would benefit greatly from a wider conflict.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pentagon says 'we KNOW' Iran was behind drone strike that killed three troops as Biden meets Lloyd Austin in the Situation Room: U.S. insists it doesn't want war but warns there will be a response to", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13020551/We-know-Iran-drone-strike-killed-three-U-S-troops-Pentagon-White-House-say-retaliation-not-want-war-Biden-Lloyd-Austin-speak-Situation-Room-reaction.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}