{"authors": ["Zesha Saleem", "Image", "Ap"], "date_download": "2024-02-05 15:19:59", "date_modify": "None", "date_publish": "2024-01-06 21:09:46", "description": "A woman in her 90s was found in the wreckage of a two-storey building in the town of Suzu, days after the 7.5-magnitude earthquake struck the Japan Sea coast on Monday, flattening towns on the remote Noto peninsula", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fjapan-earthquake-survivor-90s-found-31823894.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31823891.ece/ALTERNATES/s1200/1_Aftermath-Of-Noto-Peninsula-Earthquakes.jpg", "language": "en", "localpath": null, "maintext": "A woman in her 90s was found in the wreckage of a two-storey building in the town of Suzu, days after the 7.5-magnitude earthquake struck the Japan Sea coast on Monday, flattening towns on the remote Noto peninsula\nJapan earthquake: Survivor in her 90s found alive under rubble five days later\nRescue workers have discovered a woman in her 90s alive under rubble five days after a shocking earthquake hit central Japan.\nShe was found in the wreckage of a two-storey building in the town of Suzu, days after the 7.5-magnitude earthquake struck the Japan Sea coast on Monday, flattening towns on the remote Noto peninsula.\nMore than 120 people have been confirmed dead, and 200 are missing. According to the newspaper Yomiuri Shimbun, 100 rescuers were sent to Suzu after learning that two women were buried alive. Police sources suggested that the lady was responsive but suffering from hypothermia.\nThe first 72 hours of a rescue operation are considered critical because after that, the chances of finding people alive drops substantially. Currently, Japan's Self-Defense Forces are using helicopters for rescue operations and deliver supplies to isolated areas, as several roads remain blocked.\nAccording to public broadcaster NHK, rescue efforts could be affected by wet weather forecasted for Sunday in some areas, with authorities warning that even a small amount of rain could trigger more landslides. A cold front is also expected on Sunday, which could bring snowfall through Monday in mountainous areas of the quake-hit Ishikawa prefecture.\nMore than 30,000 people are being housed in government shelters. So far, around 23,200 households were without electricity in Ishikawa and more than 66,400 lacked running water.\nImage: AP) AP)\nThe BBC reported that Ishikawa's governor Hiroshi Hase said during a disaster management meeting that the prefecture was facing \"extremely severe situations\".\nHe also warned that restoring running water would take a long time \"as many water pipes have cracks\". Some hospitals and facilities for taking care of elderly and disabled people have also lost power and water.\nJapan is one of the most seismically active countries in the world, and activity has been increasing around Noto since the end of 2020. More than 500 small and medium earthquakes have hit there over the past three years.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Japan earthquake: Survivor in her 90s found alive under rubble five days later", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/japan-earthquake-survivor-90s-found-31823894"}