{"authors": [], "date_download": "2024-02-05 15:20:01", "date_modify": "None", "date_publish": "2024-01-06 16:38:37", "description": "Eleven people were killed Saturday in Russian shelling in Ukraine’s partially occupied Donetsk province, according to regional Gov. Vadym Filashkin", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-donetsk-air-force-b2474326.html.json", "image_url": "https://static.independent.co.uk/2024/01/06/16/Russia_Ukraine_47522.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nEleven people were killed Saturday in Russian shelling in Ukraine’s partially occupied Donetsk province, according to regional Gov. Vadym Filashkin. Five children were among the dead and eight further people were wounded in the attack on the Pokrovsk district, he said.\nUkraine’s military claimed Saturday it successfully attacked the Saki military airbase in the west of the Russian-occupied Crimean peninsula.\n“Saki airfield! All targets were hit!” Air Force commander Mykola Oleshchuk wrote on Telegram. He also published a photo appearing to show the airfield, though it was not immediately possible to verify the image.\nRussian officials did not comment on the alleged attack, but Russia’s Defense Ministry said in the early hours of Saturday that it had successfully downed four Ukrainian missiles over the peninsula overnight. Later on Saturday, the ministry reported that its air defense forces had shot down six anti-ship missiles over the Black Sea.\nTraffic was temporarily suspended for a third straight day on a bridge connecting the peninsula, which Moscow seized illegally in 2014, with Russia’s southern Krasnodar region. The span is a crucial supply link for Russia’s war effort.\nIn Russia, local officials in Belgorod — some 40 kilometers (25 miles) from the border with Ukraine — said that an “air target” was shot down on approach to the city. Ukrainian attacks on Dec. 30 in Belgorod killed 25 people, officials there said, with rocket and drone attacks continuing throughout this week.\nAs Russians prepared to celebrate Orthodox Christmas, Christmas Eve masses in Belgorod were canceled due to the “operational situation,” mayor Valentin Demidov said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Russian shelling kills 11 in Donetsk region while Ukraine claims it hit a Crimean air base", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-donetsk-air-force-b2474326.html"}