{"authors": ["Léonie Chao-Fong", "Richard Luscombe", "Tom Bryant", "Mabel Banfield-Nwachi", "Emily Dugan", "Helen Livingstone"], "date_download": "2024-02-05 15:20:01", "date_modify": "None", "date_publish": "2024-01-06 00:17:06", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F05%2Fmiddle-east-crisis-live-updates-antony-blinken-israel-palestine-gaza-hamas.json", "image_url": "https://i.guim.co.uk/img/media/b6ae094ffc546c8432250f25bf5e9470b8f94baa/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d31e873e0bd03c87d19887c51e3f5dce", "language": "en", "localpath": null, "maintext": "From 5 Jan 2024 00.18 CET Watchdog warns of 'unprecedented surge' in unauthorised Jewish settlements in occupied West Bank While the world’s attention has been focused on war in Gaza, Jewish settlers have quietly carried out an “unprecedented surge” of unauthorised moves in the occupied West Bank, an Israeli watchdog group has warned. A report by Peace Now found that settlers have established a record number of nine unauthorised settlement outposts since the start of the war in October. The group’s team said it had also documented the creation of more than a dozen new dirt paths and roads. “The three months of war in Gaza are being exploited by settlers to establish facts on the ground,” the report said. The group said that settlers were “disregarding the legal status of the land” by constructing outposts on private Palestinian lands and restricting Palestinian movement in the West Bank. The report continued: The permissive military and political environment allow the reckless construction and land seizure almost unchecked, with minimal adherence to the law. The result is not only physical harm to Palestinians and their lands but also a significant political shift in the West Bank. Most of the new outposts consist only of a few tents and an Israeli flag, the report said. But many such outposts have evolved into more permanent developments over the years. Israel’s coalition government is dominated by supporters of the settler movement, including those who want to annex some or all of the West Bank. Most countries view all settlement construction in the West Bank and East Jerusalem to be a violation of international law.\nUpdated at 00.38 CET\n5 Jan 2024 00.45 CET The UN’s migration agency has launched an urgent appeal for $69m (£54m) to support its response to rising and critical humanitarian needs in the occupied Palestinian territories. In a statement, the International Organization for Migration (IMO) said hundreds of thousands of civilians need aid desperately, but that getting help to them continues to be hampered by “long clearance procedures for humanitarian aid trucks at the border (and) the intense ground operation and fighting”. “Frequent disruption” to communication networks has also prevented humanitarian aid coordination, it said, as has “insecurity, blocked roads and scarcity of fuel”.\nUpdated at 00.52 CET\n5 Jan 2024 00.18 CET Watchdog warns of 'unprecedented surge' in unauthorised Jewish settlements in occupied West Bank While the world’s attention has been focused on war in Gaza, Jewish settlers have quietly carried out an “unprecedented surge” of unauthorised moves in the occupied West Bank, an Israeli watchdog group has warned. A report by Peace Now found that settlers have established a record number of nine unauthorised settlement outposts since the start of the war in October. The group’s team said it had also documented the creation of more than a dozen new dirt paths and roads. “The three months of war in Gaza are being exploited by settlers to establish facts on the ground,” the report said. The group said that settlers were “disregarding the legal status of the land” by constructing outposts on private Palestinian lands and restricting Palestinian movement in the West Bank. The report continued: The permissive military and political environment allow the reckless construction and land seizure almost unchecked, with minimal adherence to the law. The result is not only physical harm to Palestinians and their lands but also a significant political shift in the West Bank. Most of the new outposts consist only of a few tents and an Israeli flag, the report said. But many such outposts have evolved into more permanent developments over the years. Israel’s coalition government is dominated by supporters of the settler movement, including those who want to annex some or all of the West Bank. Most countries view all settlement construction in the West Bank and East Jerusalem to be a violation of international law.\nUpdated at 00.38 CET\n5 Jan 2024 23.54 CET The government of Rwanda has also denied the report that it has discussed with Israel the possibility of taking in Palestinians from Gaza. In a social media post, Rwanda’s foreign ministry said the report – which we reported earlier – was “completely false”, adding that: No such discussion has taken place either now or in the past, and the disinformation should be ignored.\nUpdated at 00.36 CET\n5 Jan 2024 23.41 CET The Democratic Republic of the Congo has denied a report that it is in talks with Israel over taking in thousands of Palestinians from Gaza. According to a report in Zman Israel, the Israeli government has been conducting secret talks with multiple countries regarding a “voluntary” migration scheme for Palestinians. “Congo will be willing to take in migrants,” a senior source in the security cabinet told the outlet. But a spokesperson for the Congolese government said there has “never been any form of negotiation, discussion or initiative” with Israel about taking in Palestinian migrants, the Times of Israel reported. The paper also cited a senior Israeli official dismissing the report as a “baseless illusion”. “Israel is not conducting any talks with any country on this issue,” the official said.\nUpdated at 23.54 CET\n5 Jan 2024 23.24 CET The head of the World Health Organization has warned of the number of people in Gaza who have suffered “life-changing” amputations as a result of the war. In a social media post, Tedros Adhanom Ghebreyesus said that the lack of treatment and experts means that people “are having all or parts of their arms and legs removed, sometimes with insufficient and anesthesia and pain relief”. He said the WHO is working with local partners in Gaza to deliver supplies and assess needs, but that “much more is required”, adding that “this suffering needs to end”. The war in #Gaza has caused many people, of all ages, to suffer life-changing amputations.\nMany people are only able to receive care several days after their injuries occurred, reducing the possibility of saving their limbs.\nThe lack of treatment and experts means people are… pic.twitter.com/aUyAfP5OwS — Tedros Adhanom Ghebreyesus (@DrTedros) January 5, 2024\nUpdated at 23.56 CET\n5 Jan 2024 23.10 CET The International Federation of Red Cross and Red Crescent Societies (IFRC) has said it is “appalled” by the “continuous” shelling of al-Amal hospital and the Palestine Red Crescent Society (PRCS) headquarters in Khan Younis in southern Gaza. In a statement on Friday, the IFRC said these strikes had resulted in the loss of innocent civilian lives, including a five-day-old infant. One of the group’s volunteer medics was injured in the strike, it said, in addition to 26 others who have been injured since 7 October and four colleagues who have been killed in the line of duty. Al-Amal hospital, one of the few still functioning in the south of the Gaza Strip, is marked by the Red Crescent emblem, it said, which “guarantee[s] protection in times of conflict and disaster”. The continuous bombardments have disrupted PRCS ambulances and paramedics, hindering vital medical aid and basic lifesaving emergency care. Access to medical care is a basic right, and blocking these services is unacceptable.\nUpdated at 23.57 CET\n5 Jan 2024 22.56 CET Former US vice-president Mike Pence has visited the Israel Defense Forces (IDF) northern command near Israel’s border with Lebanon on Friday. During his visit, he received an operational update and met with reserve soldiers, according to an IDF statement. Traveled to Israel’s Northern Command today to meet with military leaders and joined @IDF soldiers stationed near Israel’s border with Lebanon. Ever since October 7th, these courageous Israelis, several of whom are also American citizens, left families and home to stand strong… pic.twitter.com/2vj3mmArSl — Mike Pence (@Mike_Pence) January 5, 2024\nUpdated at 23.55 CET\n5 Jan 2024 22.35 CET France’s foreign minister, Catherine Colonna, has said that Gaza is Palestinian land and its future will not be decided by Israel. Speaking to CNN, Colonna said: It’s not up to Israel to determine the future of Gaza, which is Palestinian land. We need to return to the principle of international law and respect it. Her comments came after two far-right Israeli ministers earlier this week called for the resettlement of Palestinians from the Gaza Strip. On Wednesday, Israel’s finance minister, Bezalel Smotrich, doubled down on a call for “voluntary emigration” by Palestinians from Gaza. Israel’s national security minister, Itamar Ben-Gvir, on Monday called for promoting “a solution to encourage the emigration of Gaza’s residents”. Such calls are “irresponsible” and “brings us away from a solution,” Colonna said, adding that such rhetoric is also against the long-term interests of Israel. She added: Gaza is Palestinian land, which wants to become part of the future Palestinian state. We support the two-state solution, which is the only viable option. Gaza and the West Bank must together be part of the future Palestinian state.\nUpdated at 23.02 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Unauthorised Jewish settlements surge in occupied West Bank, says watchdog - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/05/middle-east-crisis-live-updates-antony-blinken-israel-palestine-gaza-hamas"}