{"authors": ["Miles Dilworth", "Senior Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:20:02", "date_modify": "None", "date_publish": "2024-01-06 19:59:45", "description": "The Department of Defense (DoD) has released a report revealing it has investigated 183 instances of extremism within the military, including 78 insurrectionist plots.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12838495%2FUS-military-white-supremacists-insurrectionists-Pentagon.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/20/13/78712609-0-image-m-11_1703080058149.jpg", "language": "en", "localpath": null, "maintext": "The U.S. military has been infiltrated by white supremacists and insurrectionists with experts warning a recent Pentagon report detailing dozens of internal plots to overthrow the Government is just the tip of the iceberg.\nThe Department of Defense (DoD) released a report on November 30 revealing it has investigated 183 instances of extremism within the military, including 78 cases of troops 'advocating for, engaging in, or supporting the overthrow of the U.S. Government'.\nBut experts have told DailyMail.com that the figures were likely to be a significant underestimate, pointing to a 2020 Military Times poll that showed a third of active service members had witnessed signs of white nationalism or racism among their fellow troops.\nHistorians highlighted a litany of alarming cases in which both current and former Army members have plotted to assassinate political leaders, bomb media organizations and topple the Government.\nMany have never materialized, but those that do often have deadly consequences due to the military training of the perpetrators.\nTravis Owens was an active duty U.S. Marine when he was investigated by the FBI for allegedly plotting to assassinate members of the Democratic National Committee. Owens was never charged but the case led to his removal from the military\nFormer Marine Liam Collins, 24, pleaded guilty on a charge connected to a neo-Nazi plot to attack US energy infrastructure, hatched over three years at a military camp in North Carolina\nHeidi Beirich, co-founder of the Global Project Against Hate and Extremism, accused the Pentagon of not doing enough to root out extremists within its ranks.\n'If the military doesn't take this seriously, it means terrorist attacks will be more violent, more successful,' she told DailyMail.com.\n'This is a poison for the rest of American society. If we don't rip these people out, they're deadly.'\nIn a 2019 New York Times report, Carter F. Smith, who served as an Army criminal investigator for 30 years before joining the faculty of Middle Tennessee State University, was quoted as saying that the military does not make this issue a priority.\n'They always say the numbers are small, and because of that, it is not a priority,' Smith said. 'Well, the numbers might be small, but they are like a drop of cyanide in your drink. They can do a lot of damage.'\nThe Pentagon report comes amid a series of alarming trends of extremism within the military.\nOver the past decade a murderous Neo-Nazi group has been founded by a former soldier, a growing number of plots to attack critical infrastructure in the U.S. have been hatched by current and former servicemen, while 18 percent of those charged in connection with the Capitol siege in 2021 have military backgrounds.\nIn the wake of the January 6 riots, The Pentagon admitted it did not know how to deal with the problem of extremism within its ranks and ordered a military-wide pause to allow commanders a window to tackle the issue.\nMatt Dallek, a political historian at The George Washington University in Washington, DC, pointed out that radicalization has been a long standing concern within the US military.\nThe most infamous example being Timothy McVeigh, the former U.S. Army soldier behind the 1995 Oklahoma City bombing that left 168 people dead and injured nearly 700.\nMore recently, a former active-duty Marine and member of the Army Guard was sentenced to 13 years in prison in 2020 after he was accused of plotting a terrorist massacre of journalists and Democrats including Nancy Pelosi.\nCoast Guard Lieutenant Christopher Hasson was found to have held violently racist views even before he joined the military, raising questions over vetting procedures.\nThe Base has been described by extremism watchdogs as a neo-Nazi group that conducts military-style training, with its members tied to plots that have targeted U.S. critical infrastructure with the aim of hastening the end of society\nChristopher Hasson, 54, a former active-duty Marine, was sentenced to 13 years in prison in 2020 after he was accused of plotting a terrorist massacre of journalists and Democrats including Nancy Pelosi\nPhysical attacks on the US power grid rose by 71 percent last year, according to data from the Electricity Information Sharing and Analysis Center (E-ISAC). Some of these plots have been concocted by members of the military\nREAD MORE: Neo-Nazi domestic terrorists are targeting critical power stations with guns and explosives Neo-Nazi affiliate Beau Daniel Merryman, 21, of Jefferson, Texas, pleaded guilty to distributing information related to constructing explosive devices to target critical infrastructure Advertisement\nBut Dallek, author of 'Birchers: How the John Birch Society Radicalized the American Right', said it was hard to tell whether a disproportionate number of servicemen held extremist beliefs due to a lack of data, but warned the issue was particularly concerning due to its potentially fatal fallout.\n'There is a clear threat in people who are experts in weaponry, who have access to advanced knowledge about how to make bombs, who also have a radical view of the world that impels them to commit violence,' he said. 'That can be a pretty dangerous recipe.'\nBeirich agreed that attitudes within the military tended to reflect a rise in white nationalism in wider society.\nBut she said there appeared to be a 'disconnect' between the DoD's report and the Military Times survey, which she believes indicates a far higher number of military personnel are 'involved in extremist activities'.\nBeirich said there was a long history of white supremacist groups encouraging their members to join the military so they could learn how to 'blow things up and be better with weapons', while also spreading their hateful ideologies.\nThese infiltrators are known as 'ghost skinheads' due to their removal of neo-Nazi tattoos before they enter service.\nThere are also concerns that younger service members can be susceptible to new ideas disseminated by those in leadership positions.\nFor example, in 2019, Army Reserve lieutenant colonel Christopher Cummins distributed flyers for the extremist group Identity Evropa in Tennessee and Mississippi, while Army private Christpher Hodgman did the same in Brighton, New York, according to an investigation by HuffPost.\nBeirich also highlighted a growing number of recent cases in which current and former servicemen have targeted critical power stations in the U.S. with guns and explosives as part of neo-Nazi terror groups.\nEarlier this year, DailyMail.com revealed security chiefs were increasingly concerned by a rise in ballistic threats on its energy sector this year, with previous attacks resulting in entire counties losing power for days.\nIn October, a former Marine pleaded guilty on a charge connected to a neo-Nazi plot to attack US energy infrastructure, hatched over three years at a military camp in North Carolina.\nLiam Collins, 24, was accused of stealing military gear and delivering them to co-conspirators who planned to use them for assaults on power stations.\nHis conviction comes after a Department of Homeland Security (DHS) threat assessment published last month warned that domestic terrorists have 'increasingly called for physical attacks on critical infrastructure this year' in the belief that they 'would have cascading impacts on US industries and the American way of life'.\nThe growing threat from the far right is attributed to the growth of 'accelerationism' - an 'ideology that seeks to destabilize society and trigger a race war', according to the DHS.\nIndeed, a report published by The George Washington University in September last year noted the number of white supremacist plots targeting energy systems had 'dramatically increased' since 2016.\nThe neo-Nazi group founded by former soldier\nHer co-conspirator, Brandon Russell, 28, of Florida, is a founder of the neo-Nazi group Atomwaffen Division (AWD) and has a long history of plots to attack US infrastructure, according to a criminal complaint filed against him\nSarah Beth Clendaniel, 27, of Maryland, was arrested for her part in an alleged neo-Nazi plot to 'completely destroy' the power grid in the predominantly black city of Baltimore, according to a criminal complaint filed in Maryland\nThe American Al-Qaeda stuffed with military men The Base, a sister organization to the Atomwaffen (AWD), derives its name from the English translation of Al-Qaeda. Since 2018, it has built a coalition of white supremacist members within the U.S. and abroad through online chat rooms, in-person meetings, propaganda, and military-style training, according to the Department Of Justice. Its social media accounts repeatedly post content promoting terrorism, lone-wolf attacks, and a white ethno-state. In March 2021, it was revealed that former Marine Ryan Burchfield, 23, from Virginia, was deported from Ukraine for his alleged affiliation to the group, according to VICE News. He told other members of The Base in an encrypted chat room that 'we're going to make Atomwaffen look like boy scouts', according to VICE News. Atomwaffen had reportedly already been implicated in five murders in the US at the time. In January 2019, three members of The Base, including ex-Canadian Armed Forces reservist Patrik Jordan Mathews, allegedly hatched a plot to 'kick off the economic collapse' of the US by taking out critical infrastructure across the country', according to court filings. Ex-Canadian Armed Forces reservist Patrik Jordan Mathews allegedly hatched a plot to take out critical infrastructure across the US, according to court filings Advertisement\nFounded by a former National Guard soldier who had a picture of fellow veteran and Oklahoma bomber Timothy McVeigh on his dresser, the neo-Nazi group Atomwaffen Division (AWD) has already been linked to several murders, bombings and plots in the U.S. and elsewhere.\nIt has also been a part of the growing trend of 'infrastructure terrorism', in which insurrectionists have targeted critical power stations around the country in a bid to bring an end to the American way of life.\nIts founder, Brandon Russell, 28, formerly a private first class in the National Guard, was arrested in February this year over an alleged racist plot to 'completely destroy' the power grid in the predominantly black city of Baltimore, according to a criminal complaint filed in Maryland.\nHe stands accused of conspiring to inflict 'maximum harm' by shooting at five substations operated by Baltimore Gas and Electric (BGE), which serves 1.2 million customers in central Maryland.\nHe met his alleged co-conspirator, Sarah Beth Clendaniel, 27, of Maryland, while the pair were in jail.\nThey were caught in an FBI sting.\nIn 2018, Mr Russell was sentenced to prison after being convicted of explosives charges.\nMr Russell was released from prison in 2021, before his arrest over the Baltimore plot.\nMs Clendaniel had been serving a prison sentence for armed robbery when the pair met.\nAtomwaffen members subscribe to a neo-Nazi version of 'accelerationist' philosophy - the idea that political goals can be achieved only via social collapse.\nThe group believes that modern society 'ought to be driven into apocalyptic collapse so a white ethnostate or whites-only utopia can be constructed in its wake', according to the Southern Poverty Law Center, which tracks extremist groups.\nThe Anti-Defamation League (ADL) describes it as a 'small neo-Nazi group whose ­members are preparing for a race war to combat what they consider the cultural and racial displacement of the white race'.\nAtomwaffen or its offshoots have been banned in the UK, Canada and Australia.\nVasillios Pistolis, 24, was booted out of the military in 2018 after he was outed as a member of the group.\nThe former U.S. Marine Corps was one of the earliest members of AWD, having joined in 2017, a military probe found.\nBut his membership only became known following an investigation by ProPublica and Frontline into his online profile.\nHe left a conspicuous digital footprint of his involvement with extremist groups, but had no criminal background.\nIt sparked a debate over whether military chiefs could delve into recruits online history to root out extremist views without infringing on freedom of speech.\nMarine Corps Recruiting Command said its the screening process for 'aberrant thinking and behavior' is a 'multi-layered' approach that involves police records checks, records of convictions and a signed statement and screening form that addresses gangs and racist or extremist organizations and activities.\nThe Naval Criminal Investigative Service launched a probe into Pistolis following the media reports of his neo-Nazi ties.\nThe investigation, obtained by Marine Corps Times, revealed the former marine started researching the 'Unite the Right' movement while in the Corps, before attending several rallies, including the bloody Charlottesville rally in 2017, which turned deadly when James Alex Fields Jr., 20, drove his car into counter protestors, killing Heather Heyer.\nVasillios Pistolis, 24, was booted out of the military after he was outed as a member of the AWD\nPistolis told military investigators that he was in Atomwaffen for less than a year and described himself as a 'nationalist', not a white supremacist.\nHe said the organization was a 'prepper group for the collapse of the U.S. government'.\nMeanwhile, in October 2020, three alleged neo-Nazis were charged with a conspiracy to attack US energy infrastructure in a plot hatched at a military camp in North Carolina.\nLiam Collins, Paul Kryscuk and Jordan Duncan researched a previous attack on power infrastructure, according to the charges.\nFor three years, between 2017 and 2020, Kryscuk manufactured guns and Collins, stationed at Camp Lejeune at the time, stole military gear and had them delivered to the other men, the indictment said.\nDuncan allegedly gathered 'a library of information,' some military-owned, about weapons, toxins and explosives.\nVideo footage obtained shows the men shooting guns, wearing 'AtomWaffen-masks' while giving Nazi salutes, according to court documents.\nCollins pled guilty this year to interstate transportation of an unregistered firearm, but not guilty to a charge of destruction of an energy facility.\nDuncan is attempting to have his indictments dropped, arguing that they are unconstitutional.\nCapitol riots reveal military's extremism problem\nLarry Rendall Brock Jr, a retired Air Force lieutenant colonel and decorated combat veteran from Texas, was arrested after he was photographed wearing a helmet and body armor on the floor of the Senate during the storming of the Capitol\nBrock was photographed during the deadly riot carrying plastic zip-tie handcuffs\nJacob Fracker Jr., 31, was serving in the Virginia National Guard at the time of the riots, but was placed on leave after an image posted to Facebook showed him participating in the siege\nFracker was reportedly accompanied to the riot by fellow Rocky Mount PD officer Thomas Robertson (left, and right with Fracker), 49, who is an Army veteran also facing charges\nAround 18 per cent of the more than 1,000 people charged in connection with the Capitol attack, according to data from the University of Maryland and the Justice Department.\nIn comparison, about 7 percent of all American adults are veterans, U.S. Census Bureau data from 2018 shows.\nFormer Defense Secretary Jim Mattis has admitted that the numbers are 'a concern', but said those who participated in the siege 'don't define the military'.\nHe added that only a handful of those involved in the attack on the Capitol were still on active duty or reservists.\nSeveral veterans have been charged with violent entry and disorderly conduct on Capitol grounds.\nAmong them is Larry Rendall Brock Jr., 55, an Air Force veteran from Texas, who was photographed donning a tactical helmet and vest while carrying flex cuffs inside the Capitol.\nIn a post to Facebook, Brock said he was gearing up for a 'Second Civil War' ahead of the riot, according to court documents.\nThe Air Force Academy graduate flew combat missions in Afghanistan and remained on active duty until 1998 before retiring from the Air Force Reserve in 2014, according to the service.\nBrock was sentenced to two years in prison in March.\nSome accused of laying siege to the Capitol were still serving in some capacity at the time.\nJacob Fracker Jr., 31, was serving in the Virginia National Guard at the time of the riots, but was placed on leave after an image posted to Facebook showed him and Army veteran Thomas Robertson, 49, participating in the siege.\nFracker pleaded guilty in March last year to a felony charge of conspiring with Robertson to obstruct Congress from certifying President Joe Biden's electoral victory.\nHe was sentenced to one year of probation, with prosecutors citing his cooperation in the investigation and his testimony against Robertson.\nRobertson was convicted of attacking the Capitol to obstruct Congress from certifying the Electoral College vote and sentenced to seven years and three months in prison — matching the longest sentence so far among hundreds of Capitol riot cases — along with three years of supervised release.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US military infiltrated by white supremacists and insurrectionists", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12838495/US-military-white-supremacists-insurrectionists-Pentagon.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}