{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:20:06", "date_modify": "None", "date_publish": "2024-01-05 17:43:53", "description": "Hassan Nasrallah says assassination in Beirut has changed nature of his group’s conflict with Israel, raising fears of escalation", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F05%2Fhezbollah-chief-says-response-to-killing-of-hamas-no-2-is-inevitable.json", "image_url": "https://i.guim.co.uk/img/media/6f1c9de253f83526388edba207e501cbe3a989c3/0_202_4711_2827/master/4711.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c8658a7ff87f416747c1b8d93274d10", "language": "en", "localpath": null, "maintext": "The assassination of one of Hamas’s most senior officials in Beirut has changed the nature of the conflict between Hezbollah and Israel, Hezbollah’s head, Hassan Nasrallah, has said, adding that a response is “inevitable”.\nIn a second nationally televised address within three days, Nasrallah said that all of Lebanon would be “exposed” if there was no response from his group to the killing of Saleh al-Arouri, further heightening fears of a dangerous escalation in the conflict, even as Israel said its military was ready for any eventuality.\nNasrallah said Hezbollah’s current operations on the southern border also opened a “historic opportunity” for Lebanon to liberate its land occupied by Israel.\nHe said residents of northern Israel would be the first to pay the price in any expanded war.\nSince the war in Gaza began three months ago, Nasrallah has spoken four times, the two most recent addresses within days of each other after the killing of Arouri, the No 2 in Hamas’s political bureau, in a suspected Israeli drone strike on Tuesday.\nWhile he left the door open to a diplomatic solution over areas occupied by Israel when the war with Gaza ends, analysts inferred that his remarks suggested a response was imminent and that they indicated other Iranian proxies may escalate their attacks on US forces in Iraq.\nReiterating that Hezbollah would be required to respond to the assassination, Nasrallah said that “the battle in the south of Lebanon” where Israel and Lebanon have been exchanging daily fire for three months was aimed at “reinforcing the equilibrium of dissuasion”.\n“A response to what occurred in a southern suburb of Beirut is inevitable … I am not going to say at the appropriate time and place.”\n“The war today,” he added, “is not only for Palestine but also for Lebanon and its south, in particular the region south of the Litani River.”\nArouri’s assassination took place in the Hezbollah stronghold of Beirut’s southern suburbs, even as the group has attempted to pursue a policy of supporting Hamas in Gaza while stopping short of triggering its own major war with Israel.\nView image in fullscreen Nasrallah during his televised address. Photograph: Mohamed Azakir/Reuters\nNasrallah’s comments on Friday were, however, more forceful than those made earlier this week, and came as Lebanon issued a formal complaint to the UN security council over Arouri’s killing, and over Israeli incursions into Lebanon’s airspace to attack targets in Syria.\nIn what appeared to be an effort to talk up Hezbollah’s carefully calibrated campaign since the beginning of the war in Gaza, where 22,000 people have been killed, the Hezbollah chief said his group had been engaged in a war with Israel for more than 90 days in which it had hit a large “number of targets”.\nHe added that Hezbollah had launched 670 attacks on Israel in the past three months at an average rate of between six and seven daily.\n“For those who demand to know why we are fighting on the [southern] front, we are obliged to reply. There are two goals on this front: to pressure the enemy and its government to cease the aggression against Gaza. The second goal is to relieve the pressure on the resistance [Hamas] in Gaza.”\nThe veteran Hezbollah leader’s comments – broadcast nationally – were directed at a gathering at a mosque in Baalbek in Bekaa valley in Lebanon, who had gathered to commemorate one of the founders of Hezbollah, Muhammad Hassan Yaghi.\nAs clerics and Hezbollah MPs arrived for the address, most unwilling to comment on the current febrile situation, others at the mosque said they believed Israel had crossed a “red line”.\n“Because of the situation we have to make sacrifices,” said Zoulfikar Zaiter. “The situation is not clear. We have neither peace nor war right now. The situation cannot continue like this. We are waiting now for Nasrallah to say whether there will be peace or war. I am certain it is not going to stay the same.”\nOthers, however, suggested that Nasrallah and Hezbollah were likely to maintain the ambiguous position that they have held for the last three months.\n“I don’t think it will go to a major war,” said Ahmed, 40, who declined to give a family name. “It’s hard now for the people in the south,” he added. About 76,000 in the area have been displaced by the border exchanges. Tens of thousands have also been forced to leave their homes on the Israeli side of the border.\n“But because they have faith they will have to bear the sacrifice. It is clear who is responsible for this. It is Israel.”\nNasrallah’s speeches have been closely watched throughout the Middle East and beyond as the Israel Defense Forces and Hezbollah have traded daily fire on the border since 8 October, the day after Hamas’s attack on Israel.\nNasrallah and Hezbollah have so far pursued a more pragmatic policy of containing the violence to limited exchanges close to the border, refraining from using Hezbollah’s arsenal of heavier rockets. But the killing of Arouri in one of Hezbollah’s most significant strongholds has changed the calculus.\nNasrallah has previously made much of maintaining a policy of an “equilibrium of deterrence” between Hezbollah and Israel, which analysts view as having been dangerously undermined by Tuesday’s assassination on Hezbollah’s doorstep.\nThat has led many to speculate that Hezbollah will itself need to escalate its response but within a spectrum that falls short of triggering a full-scale war.\nIn the midst of a long-running and debilitating economic crisis in Lebanon, Hezbollah has held back from a broader offensive, while Israel has not claimed responsibility for killing Arouri, despite off-the-record comments by US officials that Israel was behind the assassination.\nThe Israeli government has been pushing for Hezbollah to withdraw from the border area.", "source_domain": "www.theguardian.com", "text": null, "title": "Hezbollah chief says response to killing of senior Hamas official is ‘inevitable’", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/05/hezbollah-chief-says-response-to-killing-of-hamas-no-2-is-inevitable"}