{"authors": [], "date_download": "2024-02-05 15:20:07", "date_modify": "None", "date_publish": "2024-01-05 02:36:34", "description": "North Korean leader Kim Jong Un has ordered authorities to increase production of mobile launch vehicles for missiles, saying the country faces a looming military showdown with its enemies", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fkim-jong-un-ap-north-korea-south-korea-russia-b2473592.html.json", "image_url": "https://static.independent.co.uk/2024/01/05/02/North_Korea_51252.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNorth Korean leader Kim Jong Un ordered authorities to increase production of mobile launch vehicles for missiles because the country faces a looming military showdown with its enemies, state media reported Friday, as it pushes to make its launches harder to detect.\nThe report on Kim’s order came hours after the White House said U.S. intelligence has determined that North Korea has supplied ballistic missile launchers to Russia for its war in Ukraine. The U.S. and its allies have previously accused North Korea of sending artillery and ammunition to Russia in return for Russian technologies to enhance its own military programs.\nThe official Korean Central News Agency said Kim visited a factory that produces transport erector launchers, or TELs, without saying when he went or where the factory is.\nTELs are mobile launch vehicles which give North Korea the ability to move missiles around its territory, making it more difficult for its adversaries to detect launches in advance. Some South Korean experts have estimated that North Korea has about 100-200 such vehicles.\nKim said the factory’s role is “very important” in bolstering North Korea’s national defense “given the prevailing grave situation that requires the country to be more firmly prepared for a military showdown with the enemy,” KCNA reported.\n“He took an important measure for expanding the production capacity of the factory,” it said.\nIn a key ruling party meeting last week, Kim vowed to expand the country's nuclear arsenal, launch three additional military spy satellites and take other steps to build up the military this year to acquire “overwhelming” war readiness to cope with what he called U.S.-led confrontation. Kim cited the expansion of U.S.-South Korean military drills that sometimes involve U.S. long-range bombers and a nuclear-armed submarine.\nExperts say Kim is likely to increase weapons tests ahead of the U.S. presidential election in November because of a belief that a boosted military capability would increase his chances of wresting U.S. concessions if former President Donald Trump is reelected.\nKim's factory visit may also be related to arms supplies for Russia. Last year, Kim toured weapons factories and pledged to speed up efforts to advance his military when speculation about North Korea-Russia weapons transfers was widespread.\nNational Security Council spokesman John Kirby said Thursday that recently declassified intelligence showed that North Korea has provided Russia with ballistic missile launchers and several ballistic missiles. He said Russian forces fired at least one of those missiles into Ukraine on Dec. 30 and it landed in an open field in the Zaporizhzhia region.\nIn November, South Korea’s military said North Korea is suspected of sending short-range ballistic missiles, anti-tank missiles and portable anti-aircraft missiles to Russia, in addition to rifles, rocket launchers, mortars and shells.\nJulianne Smith, the U.S. permanent representative to NATO, said last month that U.S. intelligence indicates that North Korea has provided Russia with more than 1,000 containers of military equipment and munitions. Smith said North Korea is suspected of seeking Russian technologies related to fighter aircraft, surface-to-air missiles, armored vehicles and ballistic missile production.", "source_domain": "www.independent.co.uk", "text": null, "title": "North Korea's Kim orders increased production of mobile launch vehicles as tensions grow with US", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/kim-jong-un-ap-north-korea-south-korea-russia-b2473592.html"}