{"authors": [], "date_download": "2024-02-05 15:20:08", "date_modify": "None", "date_publish": "2024-01-05 10:41:32", "description": "A man from the southern Israeli Kibbutz Nir Oz has died in captivity", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhamas-ap-gaza-israeli-khan-younis-b2473723.html.json", "image_url": "https://static.independent.co.uk/2024/01/05/10/Israel_Palestinians_82718.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA community that was attacked during Hamas’ Oct. 7 assault into southern Israel says one of its residents, who was taken hostage, has died in captivity. The Kibbutz Nir Oz community did not give a cause of death Friday for Tamir Adar, 38.\nOf some 250 people captured during Hamas’ attack, around 80 were taken from Nir Oz alone, out of a population of around 400. The Israeli government says militants are still holding 113 hostages. Hamas has said it will not release any more hostages until Israel ends its military offensive and withdraws from Gaza. Israel has vowed to crush the militant group and return all the captives.\nIsraeli Defense Minister Yoav Gallant says several thousand Hamas fighters remain in northern Gaza, where entire neighborhoods have been blasted into rubble. Heavy fighting is also underway in central Gaza and the southern city of Khan Younis, where Israeli officials say Hamas’ military structure is still largely intact.\nHamas' Oct. 7 attack from Gaza into southern Israel killed around 1,200 people, and some 250 others were taken hostage. Israel’s air, ground and sea assault in Gaza has killed more than 22,400 people, two-thirds of them women and children, according to the Health Ministry in the Hamas-ruled territory. The count does not differentiate between civilians and combatants.\nCurrently:\n— Israeli defense minister lays out vision for next steps of Gaza war.\n— Blinken heads to the Mideast again as fears of regional conflict surge.\n— Israel’s Mossad chief vows to hunt down Hamas members.\n— The mother and American uncle of a U.S. service member are rescued from Gaza in a secret operation.\n— Find more of AP's coverage at: https://apnews.com/hub/israel-hamas-war.\nHere's what's happening in the war:\nSOUTHERN ISRAELI COMMUNITY SAYS ONE OF ITS RESIDENTS HAS DIED IN CAPTIVITY\nJERUSALEM — A community that was attacked during Hamas’ Oct. 7 assault into southern Israel says one of its residents, who was taken hostage, has died in captivity.\nThe Kibbutz Nir Oz community did not give a cause of death Friday for Tamir Adar, 38. Of some 250 people captured during Hamas' attack, around 80 were taken from Nir Oz alone, out of a population of around 400.\nTamir's grandmother, 85-year-old Yaffa Adar, was also abducted by militants that day. She was among more than 100 hostages released during a weeklong cease-fire in November.\nThe Israeli government says militants are still holding 113 hostages, including 19 women and two children under the age of 5, as well as the bodies of 24 others.\nHamas has said it will not release any more hostages until Israel ends its military offensive and withdraws from Gaza. Israel has vowed to crush the militant group and return all the captives.\nIRAQ'S PRIME MINISTER CONDEMNS US STRIKE ON A HIGH-RANKING MILITIA COMMANDER\nBAGHDAD — Iraqi Prime Minister Mohammed Shia al-Sudani on Friday condemned the United States' strike in central Baghdad that killed a high-ranking militia commander as a violation of Iraqi sovereignty. He reiterated recent calls for withdrawal of U.S. troops from the country.\nA U.S. defense official confirmed Thursday that U.S. forces carried out the strike, saying that Abu Taqwa was targeted because he was actively involved in attacks on U.S. personnel. Since the outbreak of the Israel-Hamas war on Oct. 7, a group of Iranian-backed militias calling itself the Islamic Resistance in Iraq has carried out more than 100 attacks on bases housing U.S. troops in Iraq and Syria. The group has said the attacks are in retaliation for Washington’s support of Israel and that they aim to push U.S. forces out of Iraq.\nSudani said Friday that the U.S. had bypassed the Iraqi government, which is “the body authorized to impose the law.” He added that the Popular Mobilization Force “represent an official presence affiliated with the state … and an integral part of our armed forces” and that “attacks targeting our security forces go beyond the spirit and letter of the mandate that created the international coalition,” referring to a U.S.-led coalition that assisted in the fight against the Islamic State militant group and maintains forces in Iraq.\nHe said his government is following up on procedures that would end in the coalition’s withdrawal from Iraq.", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | A hostage held in Gaza dies in captivity, his southern Israeli community says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/hamas-ap-gaza-israeli-khan-younis-b2473723.html"}