{"authors": ["Reged Ahmad", "Maya Yang", "Joanna Walters", "Mabel Banfield-Nwachi", "Martin Belam"], "date_download": "2024-02-05 15:20:09", "date_modify": "None", "date_publish": "2024-01-04 03:11:24", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F03%2Fisrael-gaza-war-live-updates-palestine-hamas-leader-saleh-al-arouri-death-idf-beirut-lebanon.json", "image_url": "https://i.guim.co.uk/img/media/35a77c3c06a990c5e0c656862e866937723b327b/0_0_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5876b4703524915793989d48c109eb14", "language": "en", "localpath": null, "maintext": "From 3 Jan 2024 21.26 CET ICJ to hold public hearings on South Africa's genocide case against Israel next week The international court of justice will hold public hearings on the request for the indication of provisional measures submitted by South Africa in its case against Israel over “genocidal” acts in Gaza next week. In a press release on Wednesday, the ICJ said that it will hold public hearings at the Peace Palace in The Hague next Thursday and Friday. It added: “The hearings will be devoted to the request for the indication for provisional measures contained in South Africa’s application. In its request, South Africa asks the court to indicate provisional measures in order to ‘protect against further, severe, and irreparable harm to the rights of the Palestinian people under the Genocide Convention’ and ‘to ensure Israel’s compliance with its obligations under the Genocide Convention not to engage in genocide, and to prevent and punish genocide.’” PRESS RELEASE: the #ICJ will hold public hearings on the request for the indication of provisional measures submitted by #SouthAfrica in the case #SouthAfrica v. #Israel on Thursday 11 and Friday 12 January 2024. Watch live on @UNWebTVhttps://t.co/kHMCQklbfQ pic.twitter.com/t8Pgf5T4Ly — CIJ_ICJ (@CIJ_ICJ) January 3, 2024\nUpdated at 21.27 CET\n4 Jan 2024 04.11 CET Summary of the day so far It’s 5:11am in Gaza and Tel Aviv and this blog is now closing. But first, here’s a summary of today’s main developments: US secretary of state Antony Blinken will leave Thursday evening on his fourth crisis trip to the Middle East, an official has told Agence France-Presse and Reuters news agency. The trip will include Israel, the US official said on condition of anonymity, but did not offer any further detail. On previous trips, Blinken has visited a number of Arab countries too.\nIsrael carried out the strike that killed Hamas’s deputy chief Saleh al-Arouri in Beirut, Lebanon, a US defense department official told Agence France-Presse anonymously on Wednesday. “The strike was an Israeli strike,” said the official, without providing further details. On Tuesday, al-Arouri was killed in Dahiyeh, a Hezbollah stronghold in Beirut. Both Hamas and Hezbollah have blamed Israel for al-Arouri’s killing.\nA local Hezbollah official and two other members were killed on Wednesday in an Israeli strike on southern Lebanon, Reuters reports two security sources saying. Wednesday’s strike bring the death toll in Israeli strikes in southern Lebanon to nine Hezbollah members since the Iran-backed group began exchanging fire with Israeli forces at the start of October.\nThe United States sees no “clear desire” by either Lebanon’s Hezbollah movement or Israel to go to war with the other , a senior Biden administration official has told Reuters. The official was briefing reporters on condition of anonymity and referring to a speech earlier in the day by Hezbollah leader Hassan Nasrallah on the assassination on Tuesday of a senior Hamas official in Beirut.\nTwelve nations led by the United States on Wednesday have jointly warned Yemen’s Houthi rebels of consequences unless they immediately halt sea attacks that have been disrupting global commerce. President Joe Biden’s administration described the statement – joined by Britain, Germany and Japan – as a final warning, as Biden weighs possible military strikes against the Houthis if attacks persist, Agence France-Presse reports.\nThe US said that it is “not seeing any acts that constitute genocide” in Gaza, referring to South Africa’s case against Israel in the international court of justice in which it accused Israel of “genocidal” acts across Gaza. In a news briefing on Wednesday, US state department spokesperson Matthew Miller said, “Those are allegations that should not be made lightly ... we are not seeing any acts that constitute genocide … That is a determination by the state department.” Miller’s comments come as Israeli strikes have killed over 22,300 Palestinians across Gaza – which human rights organisations have described as an “open air prison” – since 7 October.\nThe international court of justice will hold public hearings on the request for the indication of provisional measures submitted by South Africa in its case against Israel over “genocidal” acts in Gaza next week. In a press release on Wednesday, the ICJ said that it will hold public hearings at the Peace Palace in The Hague next Thursday and Friday. It added: “The hearings will be devoted to the request for the indication for provisional measures contained in South Africa’s application.”\nJosep Borrell, the European Union’s foreign policy chief, has condemned what he called “inflammatory” comments made by two Israeli ministers who said Palestinians should emigrate from Gaza. In a tweet on Wednesday, Borrell wrote: “I strongly condemn the inflammatory & irresponsible statements by Israeli ministers Ben Gvir & Smotrich slandering the Palestinian population of Gaza & calling for a plan for their emigration.\nA Qatari aircraft carrying 37 tons of aid for Palestinians in Gaza arrived in El Arish, Egypt, on Wednesday. The aid includes shelter kits and food items that will be further transferred to Gaza, the Qatari foreign ministry said in an announcement. Wednesday’s aircraft delivery brings the total amount of aid planes sent from Qatar to Gaza to 58, with a total of 1,814 tons of aid.\nThe US coordinated with Israel, Egypt and others in rescuing the mother of a US serviceman and her American brother-in-law in Gaza , the Associated Press (AP) is reporting. The news agency says it’s the only known operation of its kind to extract American citizens and their close family members during the months of fighting and Israeli airstrikes in Gaza.\nA senior official in the US Education Department has stepped down, citing President Joe Biden’s handling of the conflict in Gaza, Reuters is reporting, in the latest sign of dissent in the administration over the war.\n4 Jan 2024 03.59 CET And here are the latest images coming out of Israel as the fighting continues from the southern border and the remaining damage from the 7 October Hamas attacks can still be seen: View image in fullscreen Israeli army tanks manoeuvre near the Israel-Gaza border. Photograph: Violeta Santos Moura/Reuters View image in fullscreen Israeli soldiers cover their ears as they a fire mortar round from an armoured vehicle at a position along the border in southern Israel. Photograph: Jack Guez/AFP/Getty Images View image in fullscreen Damaged vehicles at the Erez border crossing between southern Israel and the Gaza Strip after the attacks by Hamas on 7 October. Photograph: Jack Guez/AFP/Getty Images\n4 Jan 2024 03.33 CET Let’s get a bit more background on the newly announced visit to Israel by the US secretary of state Antony Blinken. He will leave Thursday evening on his fourth crisis trip to the Middle East, an official has told Agence France-Presse. The trip will include Israel, the US official said on condition of anonymity, but did not offer any further detail. On previous trips, Blinken has visited a number of Arab countries too. It will mark the US secretary of state’s fourth trip to the region and fifth to Israel – excluding a visit accompanying President Joe Biden – since Hamas carried out the 7 October attacks. The announcement of this trip comes after a suspected Israeli strike killed a top Hamas leader in the suburbs of Beirut, increasing regional tensions even further. View image in fullscreen File picture of US secretary of state, Antony Blinken in December. Photograph: Rodrigo Oropeza/AFP/Getty Images\nUpdated at 03.35 CET\n4 Jan 2024 03.17 CET The United States sees no “clear desire” by either Lebanon’s Hezbollah movement or Israel to go to war with the other, a senior Biden administration official has told Reuters. The official was briefing reporters on condition of anonymity and referring to a speech earlier in the day by Hezbollah leader Hassan Nasrallah on the assassination on Tuesday of a senior Hamas official in Beirut. Reuters reports that the official said: From everything that we can tell, there is no clear desire for Hezbollah to go to war with Israel and vice versa … However, the tension on the (Israeli-Lebanese) border is there because Hezbollah is firing across the border regularly at the Israelis and the Israelis obviously return fire.\n4 Jan 2024 03.07 CET Israel’s Defence Forces (IDF) have posted on X that they have carried out a strike in the southern Lebanese village of Yaroun. Earlier, Reuters reported that a local Hezbollah official and two other members were killed on Wednesday in an Israeli strike on southern Lebanon, citing two security sources. Wednesday’s strike brings the death toll in Israeli strikes in southern Lebanon to nine Hezbollah members since the Iran-backed group began exchanging fire with Israeli forces at the start of October. On Tuesday, Hamas chief Saleh al-Arouri was killed in Dahiyeh, a Hezbollah stronghold in Beirut. Both Hezbollah and Hamas have blamed Israel, with Hezbollah chief Hassan Nasrallah calling the killing “flagrant Israeli aggression”. תקיפת חוליית מחבלים, תשתית צבאית ואמצעי תצפית; צה\"ל תקף מטרות של ארגון הטרור חיזבאללה בשטח לבנון.\nכוחות צה\"ל תקפו לפני זמן קצר חוליית מחבלים שפעלה במרחב הכפר יארון. בנוסף, צה\"ל תקף אמצעי תצפית ותשתית צבאית בה שהו פעילים של ארגון הטרור חיזבאללה>> pic.twitter.com/AEjMjHOIwP — צבא ההגנה לישראל (@idfonline) January 3, 2024\n4 Jan 2024 02.40 CET The US coordinated with Israel, Egypt and others in rescuing the mother of a US serviceman and her American brother-in-law in Gaza, the Associated Press (AP) is reporting. The news agency says it’s the only known operation of its kind to extract American citizens and their close family members during the months of fighting and Israeli airstrikes in Gaza. Citing a US official who spoke on condition of anonymity – AP reports that Zahra Sckak, 44, made it out of Gaza on New Year’s Eve, along with her brother-in-law, Farid Sukaik, an American citizen. One of Sckak’s three American sons, Spec. Ragi A. Sckak, serves as an infantryman in the US military. The extraction involved the Israeli military and local Israeli officials who oversee Gaza and the occupied West Bank, the US official told AP. “The United States played solely a liaison and coordinating role between the Sckak family and the governments of Israel and Egypt”. The state department has said about 300 American citizens, legal permanent residents and their immediate family members remain in Gaza. US soldier’s family rescued from Gaza in secret operation – report Read more\nUpdated at 03.37 CET\n4 Jan 2024 02.12 CET A senior official in the US Education Department has stepped down, citing President Joe Biden’s handling of the conflict in Gaza, Reuters is reporting, in the latest sign of dissent in the administration over the war. In a letter, Tariq Habash, special assistant in the education department’s office of planning, evaluation and policy development, said: “I cannot stay silent as this administration turns a blind eye to the atrocities committed against innocent Palestinian lives, in what leading human rights experts have called a genocidal campaign by the Israeli government.” Habash is a Palestinian-American and an expert on student debt. He was appointed early in Biden’s presidency as part of a build-out of the Education Department’s student loan expertise, Reuters says. State department spokesperson Matthew Miller said earlier in the day that the US has not observed acts in Gaza that constitute genocide. His remarks were in response to proceedings launched by South Africa at the International Court of Justice over Israel’s military operations in the territory. Israel also has denied claims of genocide in Gaza. Reuters is also reporting that 17 Biden re-election campaign staffers have issued a warning in an anonymous letter that Biden could lose voters over the issue. Biden’s campaign did not immediately respond to a request for comment, Reuters reports.\n4 Jan 2024 01.47 CET Germany’s Foreign Office has warned against travelling to Lebanon and asked German citizens to leave the country. The warning is in the wake of the killing of one of Hamas’s most senior officials, Saleh al-Arouri. He died in Beirut in what was understood to be an Israeli drone strike. Israel has not confirmed or denied it was behind the attack. The statement from the Germany ministry’s website says: A further aggravation of the situation and expansion of the conflict cannot be ruled out, especially in view of the killing of the deputy chairman of the Hamas political bureau, Saleh Al-Arouri, in the Beirut area on January 2, 2024 Reuters reports that this applies particularly to the southern parts of Lebanon up to and including the southern urban areas of Beirut.\n4 Jan 2024 01.24 CET Israeli hostage Sahar Baruch was killed last month during a rescue attempt by special forces in Gaza, the Israeli military said on Wednesday, without giving details. Hamas said on 8 December that a hostage it named as Sa’ar Baruch, had been killed during an attempted rescue operation, Reuters reports. “At this point, it is not possible to determine the circumstances of Sahar’s death, and it is not known whether he was murdered by Hamas or killed by our forces’ fire,” the military said in a statement, according to Reuters. Sahar Baruch was among the 240 hostages seized by Hamas gunmen when they stormed into southern Israel on 7 October. More than 100 hostages have since been released under agreements brokered by Qatar and other countries and one hostage was rescued by Israeli forces. At least 123 remain in Gaza, of whom at least 23 have been declared dead by Israeli authorities.\n4 Jan 2024 01.02 CET Twelve nations led by the United States on Wednesday have jointly warned Yemen’s Houthi rebels of consequences unless they immediately halt sea attacks that have been disrupting global commerce. President Joe Biden’s administration described the statement - joined by Britain, Germany and Japan – as a final warning, as Biden weighs possible military strikes against the Houthis if attacks persist, Agence France-Presse reports. The Iranian-backed rebels, who control much of Yemen including the capital Sana’a and most of the Red Sea coast, have been firing on ships allegedly linked to Israel in what they say is solidarity with Palestinians in Gaza. Here’s some of what the joint statement, released by the White House, had to say: Let our message now be clear: we call for the immediate end of these illegal attacks and release of unlawfully detained vessels and crews … The Huthis will bear the responsibility of the consequences should they continue to threaten lives, the global economy and free flow of commerce in the region’s critical waterways. The U.S. joins our partners and allies in calling for an immediate end to the Houthi’s illegal attacks against vessels and crews in the Red Sea.\nWe will continue to promote accountability for malign actors responsible for unlawful seizures and attacks.https://t.co/uhGwS18l3w — Ambassador Linda Thomas-Greenfield (@USAmbUN) January 3, 2024\nUpdated at 02.45 CET\n3 Jan 2024 00.31 CET Reged Ahmad here picking up the blog from Maya Yang Reuters is reporting that the US secretary of state Antony Blinken is to leave Thursday for a visit to Israel and other Middle East countries. The agency is citing a US official who was briefing reporters on condition of anonymity, and said that Blinken leaves Thursday night “for stops in a number of capitals, including Israel,” but provided no further details. The official said US diplomatic envoy Amos Hochstein will also travel to Israel to work to soothe tensions between the country and Hezbollah, Reuters reports.\n3 Jan 2024 23.55 CET Summary Here is where things stand: Israel carried out the strike that killed Hamas’s deputy chief Saleh al-Arouri in Beirut, Lebanon, a US defense department official told Agence France-Presse anonymously on Wednesday. “The strike was an Israeli strike,” said the official, without providing further details. On Tuesday, al-Arouri was killed in Dahiyeh, a Hezbollah stronghold in Beirut. Both Hamas and Hezbollah have blamed Israel for al-Arouri’s killing.\nA local Hezbollah official and two other members were killed on Wednesday in an Israeli strike on southern Lebanon, Reuters reports two security sources saying. Wednesday’s strike bring the death toll in Israeli strikes in southern Lebanon to nine Hezbollah members since the Iran-backed group began exchanging fire with Israeli forces at the start of October.\nUK foreign secretary David Cameron said that “more must be done to get humanitarian aid into Gaza” and that Israel “must allow significantly more supplies in to reduce the risk of hunger and disease”, Agence France-Presse reports. “The UK also wants to see the immediate release of hostages and progress towards a sustainable ceasefire,” Cameron, who was previously the UK prime minister, said.\nThe US said that it is “not seeing any acts that constitute genocide” in Gaza, referring to South Africa’s case against Israel in the international court of justice in which it accused Israel of “genocidal” acts across Gaza. In a news briefing on Wednesday, US state department spokesperson Matthew Miller said, “Those are allegations that should not be made lightly ... we are not seeing any acts that constitute genocide … That is a determination by the state department.” Miller’s comments come as Israeli strikes have killed over 22,300 Palestinians across the Gaza – which human rights organizations have described as an “open air prison” - since 7 October.\nThe international court of justice will hold public hearings on the request for the indication of provisional measures submitted by South Africa in its case against Israel over “genocidal” acts in Gaza next week. In a press release on Wednesday, the ICJ said that it will hold public hearings at the Peace Palace in The Hague next Thursday and Friday. It added: “The hearings will be devoted to the request for the indication for provisional measures contained in South Africa’s application.”\nJosep Borrell, the European Union’s foreign policy chief, has condemned what he called “inflammatory” comments made by two Israeli ministers who said Palestinians should emigrate from Gaza. In a tweet on Wednesday, Borrell wrote: “I strongly condemn the inflammatory & irresponsible statements by Israeli ministers Ben Gvir & Smotrich slandering the Palestinian population of Gaza & calling for a plan for their emigration.\nA Qatari aircraft carrying 37 tons of aid for Palestinians in Gaza arrived in El Arish, Egypt, on Wednesday. The aid includes shelter kits and food items that will be further transferred to Gaza, the Qatari foreign ministry said in an announcement. Wednesday’s aircraft delivery brings the total amount of aid planes sent from Qatar to Gaza to 58, with a total of 1,814 tons of aid.\nUpdated at 00.06 CET\n3 Jan 2024 23.32 CET Israel carried out the strike that killed Hamas’s deputy chief Saleh al-Arouri in Beirut, Lebanon, a US defense department official told Agence France-Presse anonymously on Wednesday. “The strike was an Israeli strike,” said the official, without providing further details. On Tuesday, al-Arouri was killed in Dahiyeh, a Hezbollah stronghold in Beirut. Both Hamas and Hezbollah have blamed Israel for al-Arouri’s killing. Meanwhile, Israeli army spokesperson Daniel Hagari did not comment directly on his killing but said that the Israeli military was “highly prepared for any scenario” in its aftermath, Agence France-Presse reports.\n3 Jan 2024 23.01 CET Israeli public figures have accused the country’s judiciary of ignoring incitement to genocide in Gaza where Israeli strikes have killed more than 22,300 Palestinians since 7 October. The Guardian’s Emma Graham-Harrison and Quique Kierszenbaum reports: A group of prominent Israelis has accused the country’s judicial authorities of ignoring “extensive and blatant” incitement to genocide and ethnic cleansing in Gaza by influential public figures. In a letter to the attorney general and state prosecutors, they demand action to stop the normalisation of language that breaks both Israeli and international law. “For the first time that we can remember, the explicit calls to commit atrocious crimes, as stated, against millions of civilians have turned into a legitimate and regular part of Israeli discourse,” they write. “Today, calls of these types are an everyday matter in Israel.” Signatories include one of Israel’s top scientists, the Royal Society member Prof David Harel, alongside other academics, former diplomats, former members of the Knesset, journalists and activists. Represented by the human rights lawyer Michael Sfard, their 11-page letter contains multiple examples of “the discourse of annihilation, expulsion and revenge”. The list of elite Israelis who have incited war crimes includes cabinet ministers and Knesset members, former top military officials, academics, media figures, social media influencers and celebrities, the letter says. Israeli public figures accuse judiciary of ignoring incitement to genocide in Gaza Read more\nUpdated at 23.20 CET\n3 Jan 2024 22.42 CET A local Hezbollah official and two other members were killed on Wednesday in an Israeli strike on southern Lebanon, Reuters reports two security sources saying. Wednesday’s strike bring the death toll in Israeli strikes in southern Lebanon to nine Hezbollah members since the Iran-backed group began exchanging fire with Israeli forces at the start of October. On Tuesday, Hamas chief Saleh al-Arouri was killed in Dahiyeh, a Hezbollah stronghold in Beirut. Both Hezbollah and Hamas have blamed Israel, with Hezbollah chief Hassan Nasrallah calling the killing “flagrant Israeli aggression”.\nUpdated at 22.43 CET\n3 Jan 2024 22.14 CET UK foreign secretary David Cameron said that “more must be done to get humanitarian aid into Gaza” and that Israel “must allow significantly more supplies in to reduce the risk of hunger and disease”, Agence France-Presse reports. “The UK also wants to see the immediate release of hostages and progress towards a sustainable ceasefire,” Cameron, who was previously the UK prime minister, said. He added that he discussed the issue with Israel’s new foreign minister Israel Katz. The first UK maritime shipment of aid to Gaza arrived in Egypt this week, Agence France-Presse reports. According to the British government, the shipment carried nearly 90 tons of thermal blankets, shelter packs and other medical supplies. The shipment is set to be transferred to the Rafah crossing by the Egyptian Red Crescent and will be distributed by UNRWA, the UN agency for Palestinian refugees, across Gaza.\nUpdated at 22.27 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Local Hezbollah official and two other members reportedly killed in Israeli strike in Lebanon on Wednesday - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/03/israel-gaza-war-live-updates-palestine-hamas-leader-saleh-al-arouri-death-idf-beirut-lebanon"}