{"authors": ["Reged Ahmad", "Richard Luscombe", "Martin Belam", "Helen Livingstone"], "date_download": "2024-02-05 15:20:12", "date_modify": "None", "date_publish": "2024-01-03 02:42:36", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F02%2Fisrael-gaza-war-live-israeli-military-kills-four-alleged-palestinian-militants-in-west-bank-idf-says.json", "image_url": "https://i.guim.co.uk/img/media/0896a95e9706eb0078c54e3f3359df00350e82bc/586_130_2411_1447/master/2411.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=37c956cc5e1d2884bed87d2e4ce19360", "language": "en", "localpath": null, "maintext": "From 2 Jan 2024 21.40 CET Hezbollah plans 'punishment' for al-Arouri killing Hezbollah says its finger “is on the trigger” as the Islamic militant group in Lebanon plots its response to the death of Hamas senior leader Saleh al-Arouri in an explosion in Beirut Tuesday that it blames on Israel. The “assassination” of Arouri and two other senior Hamas figures among six deaths in the reported drone striker is “a serious assault on Lebanon”, the group said in a post Tuesday night on Telegram: [It is] a dangerous development in course of war between the enemy and the axis of the resistance… [that] will not go without a response or punishment. The resistance has its finger on the trigger.\n3 Jan 2024 03.42 CET Summary of the day so far It’s currently 4:42am in Gaza and Tel Aviv and this blog is now closing, but first, a summary of the main developments: Senior Hamas official Saleh al-Arouri was killed in an explosion in the southern Beirut suburb of Dahiyeh, reportedly caused by a targeted Israeli drone strike. Israel has not accepted responsibility, but says “whoever did this… [it was] a surgical strike against the Hamas leadership”.\nSix people were killed in the explosion, reports say, including al-Arouri, a founder of Hamas’s military wing long targeted by Israel, and two leaders of Hamas’s elite military al-Qassam Brigades. Lebanon’s caretaker prime minister, Najib Mikati , condemned a “new Israeli crime” and said the country was filing a complaint to the UN security council.\nIsrael’s military forces are in a state of “high readiness” after the assassination, a senior spokesperson without acknowledging his country’s involvement in the incident. Rear Adm Daniel Hagari told reporters “We are focused and remain focused on fighting against Hamas. We are on high readiness for any scenario”.\nHezbollah said its finger “is on the trigger” as it promised vengeance for Arouri’s death, and later claimed it had launched a so-far unconfirmed missile attack on Israeli troops. The group said the attack in Beirut was “a serious assault on Lebanon… that will not go without a response or punishment” in a statement posted to Telegram.\nThe French President Emmanuel Macron has called on Israel to avoid escalation, “particularly in Lebanon”, after the strike. Agence France-Presse (AFP) is reporting that Macron spoke by telephone with Israeli minister and war cabinet member Benny Gantz . The presidency said: “It was essential to avoid any escalatory attitude, particularly in Lebanon, and that France would continue to pass on these messages to all players directly or indirectly involved in the area.”\nIsraeli prime minister Benjamin Netanyahu has posted on X a number of hours ago about meeting families of the hostages who remain in Gaza , saying “The effort is continuing. The contacts are being held; they have not been cut off. There was an ultimatum from Hamas; now it has been softened.”\nMeanwhile Hamas said it won’t release any more hostages it took during the 7 October attacks on Israel, except under its own terms. The group’s political chief, Ismail Haniyeh , told Reuters he laid out the Hamas position to officials of Egypt and Qatar , countries trying to broker a ceasefire similar to the one in November that saw more than 100 hostages freed. Haniyeh is demanding “a complete cessation of the aggression” by Israel.\nThere’s growing friction between the US government and far-right ministers in Israel who have called for the rebuilding of Israeli settlements in Gaza, and for Palestinians in the Gaza Strip to relocate to southern Lebanon. Such proposals, voiced by Israel’s national security minister Itamar Ben-Gvir and finance minister Bezalel Smotrich , two senior members of prime minister Benjamin Netanyahu ’s cabinet, are abhorrent, the US state department said in a statement on Tuesday.\nTurkey arrested 34 people on suspicion of spying for Mossad on behalf of Israel. “The Israeli intelligence service is recruiting personnel to be used in acts against Palestinians residing in our country and their families.,” a government official said. Without providing evidence, the official said the suspects were also spreading fake news and disinformation, carrying out robberies and blackmail for Israeli intelligence.\nIsraeli defense minister Yoav Gallant said military operations in the south of the Gaza Strip around Khan Younis were focused on areas above what he said was a tunnel network where Hamas leaders were believed to be hiding. “We are reaching them all ways. There already is engagement and there are hostages there too sadly,” he told Israeli troops in footage shown on Israeli television, Reuters said.\nThe Palestine Red Crescent Society reported “several fatalities and wounded” at its headquarters in Khan Younis as a result of Israeli missile. “ The occupation renews its bombardment of the PRCS headquarters in Khan Younis for the second time, resulting in several fatalities and wounded among the 14,000 displaced individuals housed in the PRCS’s premises and the adjacent Al-Amal hospital,” the group said in a statement.\nThe United Nations office for the coordination of humanitarian affairs (Ocha) has released its latest update on the situation in Gaza, describing the number of aid trucks coming into Gaza as “woefully inadequate”\nAt least 22,185 Palestinians have been killed and more than 57,000 wounded by Israel’s military action in Gaza, according to updated figures from the health ministry. It says that 207 Palestinians were killed and 338 were wounded in the past 24 hours. The Gaza health ministry is run by Hamas. The figures do not distinguish between civilians and combatants.\nSeparately, the Israeli military has claimed to have killed about 8,000 fighters in the Gaza Strip during its campaign. Additionally, since 7 October, at least 321 Palestinians have been killed in the occupied West Bank by Israeli troops or settlers. It has not been possible for journalists to independently verify the casualty figures being issued during the conflict.\n3 Jan 2024 03.22 CET Reuters news agency is reporting on what it says is declassified US intelligence on Gaza’s al-Shifa hospital. It says US spy agencies have assessed that Hamas and another Palestinian group fighting Israel used Gaza’s al-Shifa Hospital to command forces and hold some hostages – but largely evacuated the complex days before Israeli troops entered it, according to a US official. The complex was used by both Hamas and Palestinian Islamic Jihad to command forces fighting against Israel, the US official said, speaking to Reuters on condition of anonymity. But US intelligence agencies obtained information that Hamas fighters had largely evacuated the complex days before Israel’s operation and destroyed documents and electronics as they left, the American official told the news agency. US intelligence agencies have not disclosed the evidence on which they based their assessment. The official told Reuters the US had independently confirmed the information. Israel has said al Shifa, which it had occupied earlier in the war in Gaza, had been used by Hamas. Troops entered in November and the targeting of the hospital had stoked global alarm over the fate of civilians and patients who were inside. Read our analysis from November by Julian Borger on what the IDF presented as evidence that the hospital was being used as Hamas headquarters.\nUpdated at 03.24 CET\n3 Jan 2024 02.38 CET The United Nations Office for the Coordination of Humanitarian Affairs (Ocha) has also released details on the internal displacement inside Gaza. It says “obtaining an accurate figure of the total number of IDPs [internally displaced persons] remains challenging. By the end [of] 2023, according to UNRWA, 1.9 million people in Gaza, or nearly 85 per cent of the population, are estimated to be internally displaced”. The update goes on to say that a high influx of those are in Rafah. Here are some of the latest images coming in to us from there: View image in fullscreen Palestinian families in a tent city in Rafah. Photograph: Anadolu/Getty Images View image in fullscreen Children are seen outside a plastic tent. Photograph: Anadolu/Getty Images View image in fullscreen A child fills up a container from what looks like a water tank. Tents and families can be seen in the background. Photograph: Anadolu/Getty Images\n3 Jan 2024 02.19 CET The United Nations Office for the Coordination of Humanitarian Affairs (Ocha) has released their latest update on the situation in Gaza. The update says there is an urgent need to evacuate thousands of sick and wounded: On 30 December, the MoH in Gaza emphasized the need to prioritize the evacuation of more than 5,300 wounded and sick people who are facing serious and complex medical conditions in Gaza. Ocha also updates on the number of aid trucks getting into Gaza, describing it as “woefully inadequate” On 30 December, 103 trucks with food and medical supplies entered Gaza. The volume of aid remains woefully inadequate. The Under-Secretary-General for Humanitarian Affairs and Emergency Relief Coordinator declared “that this is an impossible situation for the people of Gaza and for those trying to help them. The fighting must stop.” There are also details on the spread of diseases due to the internal displacement. Ocha says the illnesses are overwhelming health systems: On 29 December, the head of the WHO in the occupied Palestinian territory announced that people living in shelters in Gaza have continued to fall ill. Close to 180,000 people are suffering from upper respiratory infections; there are 136,400 cases of diarrhea (half of these among children under five years old); 55,400 cases of lice and scabies; 5,330 cases of chickenpox; 42,700 cases of skin rash (including 4,722 cases of impetigo); 4,683 cases of Acute Jaundice Syndrome; and 126 cases of meningitis.\n3 Jan 2024 02.00 CET Israeli prime minister Benjamin Netanyahu has posted on X a number of hours ago about meeting families of the hostages who remain in Gaza. He seems to suggest in his post that talks are continuing: The effort is continuing. The contacts are being held; they have not been cut off. There was an ultimatum from Hamas; now it has been softened. Earlier, the Reuters news agency reported that Hamas said it would not be releasing any more hostages it took during the 7 October attacks on Israel, except under its own terms. According to Reuters, the group’s political chief, Ismail Haniyeh, has laid out the Hamas position to officials of Egypt and Qatar, countries that have been trying to broker a ceasefire similar to the one in November that saw the release of a little more than 100 of the 240 hostages taken the month before. Prime Minister Benjamin Netanyahu, this evening, to representatives of the hostages' families:\n\"The effort is continuing. The contacts are being held; they have not been cut off.\nThere was an ultimatum from Hamas; now it has been softened.\nThese contacts are being held now.\" — Prime Minister of Israel (@IsraeliPM) January 2, 2024\n3 Jan 2024 01.32 CET The Guardian’s Peter Beaumont has written a full report on the killing of Saleh al-Arouri and the reaction to it. One of Hamas’s most senior officials, Saleh al-Arouri, has been killed in an Israeli drone strike in Beirut that threatens a significant and dangerous escalation of Israel’s war against Hamas and its related conflict with the Lebanese militant group Hezbollah. The Lebanese prime minister, Najib Mikati, echoing fears of further regional violence, described the assassination as a “new Israeli crime intended to spur a new phase of conflict, following daily attacks in the south [of Lebanon]”. For more, read the rest of Peter Beaumont’s report here: Senior Hamas figure Saleh al-Arouri killed in Lebanon Read more\n3 Jan 2024 01.16 CET French president calls on Israel to avoid escalation French President Emmanuel Macron has called on Israel to avoid escalation, “particularly in Lebanon”, after a strike in Beirut that killed Hamas’s deputy leader, the Élysée Palace said on Tuesday. Israel has so far not admitted or denied responsibility for the attack. Government adviser Mark Regev has told MSNBC that “whoever did this … [it was] a surgical strike against the Hamas leadership”. Agence France-Presse (AFP) is reporting that Macron spoke by telephone with Israeli minister and war cabinet member Benny Gantz. The presidency said: It was essential to avoid any escalatory attitude, particularly in Lebanon, and that France would continue to pass on these messages to all players directly or indirectly involved in the area. Hamas number two Saleh al-Aruri was killed in a strike in a suburb of Beirut on Tuesday evening, the Palestinian militant group and Lebanese security officials said.\n2 Jan 2024 00.52 CET The United States has reached a deal to extend its military presence at a base in Qatar for another 10 years, a source familiar with the matter told the Reuters news agency on Tuesday. It’s believed to be the Al Udeid airbase, which is located in the desert southwest of Doha and hosts the largest US military facility in the Middle East, the source said, asking Reuters not to be identified. The development was reported first by CNN. The US Department of Defense did not immediately respond to a request for comment on Tuesday. The tiny Gulf state has played a key role in mediation talks with Hamas and Israeli officials in relation to the war in Gaza. US President Joe Biden has regularly spoken with the emir of Qatar since the 7 October attacks on securing the release of hostages held by Hamas and on boosting aid to Gaza. There has also been criticism of Qatar by some in the US Congress over Hamas’ presence in the country.\nUpdated at 01.04 CET\n2 Jan 2024 00.32 CET Reged Ahmad here picking up the blog from Richard Luscombe US senator Bernie Sanders has been making comments about US additional funding for Israel. Joan E Greve is in Washington and writes: Bernie Sanders, the progressive senator of Vermont, issued a statement Tuesday calling on Congress to block additional funding to Israel amid the war in Gaza, where more than 22,000 Palestinians have been killed in Israeli attacks after Hamas killed 1,200 people in Israel on 7 October. “While we recognize that Hamas’ barbaric terrorist attack began this war, we must also recognize that Israel’s military response has been grossly disproportionate, immoral and in violation of international law,” Sanders said. “Enough is enough. Congress must reject that funding. The taxpayers of the United States must no longer be complicit in destroying the lives of innocent men, women, and children in Gaza. Here’s the rest of Joan E Greve’s report: Bernie Sanders calls on Congress to block funding to Israel Read more\nUpdated at 01.04 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli military forces in a state of ‘high readiness’ says senior IDF spokesperson - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/02/israel-gaza-war-live-israeli-military-kills-four-alleged-palestinian-militants-in-west-bank-idf-says"}