{"authors": ["Brett Okamoto", "Espn.Com Staff", "Marc Raimondi", "Dan Hajducky", "Jeffrey Wagenheim", "Espn Staff Writer"], "date_download": "2024-02-05 15:20:14", "date_modify": "None", "date_publish": "2024-01-03 14:28:00", "description": "Title fights. Rematches. Rivalries renewed. We tick the boxes on our wish list of most desirable fights for the new year, which includes Conor McGregor's return and a heavyweight title unification bout.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fmma%2Fstory%2F_%2Fid%2F39209209%2F12-mma-fights-want-most-24-jon-jones-vs-tom-aspinall-conor-mcgregor-vs-michael-chandler.json", "image_url": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0102%2Fr1272942_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "Open Extended Reactions\nLet's go, baby. It's my annual \"Fights I want to see most\" for 2024, and you know what? I'm optimistic we'll actually get to see a lot of these in the next 12 months.\nLast year, we saw 4.5 out of 12 (one of the wishes was Khamzat Chimaev against the UFC's middleweight or welterweight champion, and we'll call his fight against former champ Kamaru Usman a halfer). This year, some of the fights on my list are already booked and the others ... I really hope they happen, for the benefit of fight fans.\nHere is my 2024 MMA wish list.\nLet's cut to the chase and not pull any punches here. Stipe Miocic is a legend and the greatest heavyweight of all time, but booking him for a UFC championship fight in 2024 would be a farce. A fight between Jones and Miocic wouldn't crown the best heavyweight in the world. It would be a \"legacy fight,\" which I'm fine with, but then let's call it that and strip Jones of the belt. Jones is still at the top of his game. He has a claim to being the best heavyweight and even the best pound-for-pound fighter in the world. The only way to legitimize and prove those titles, though, would be a fight against Aspinall. And if that fight happened, it would easily be the most intriguing fight of the year.\n2. Israel Adesanya vs. Khamzat Chimaev, UFC middleweight\nTitle fight, nontitle fight, it doesn't matter. Adesanya vs. Chimaev is the biggest matchup the UFC's middleweight division can offer, and one of the biggest in the sport. Chimaev has lost some shine in recent years, due to inactivity and a less-than-dominant showing against Usman, but I still find him to be the most intriguing figure in MMA. What is his ceiling? Despite all the attention he's received, we still don't know. It is beyond time to challenge him in the greatest way possible, and Adesanya is still one of the gold standards of MMA. This fight needs to happen -- honestly, it should have happened by now. And if it doesn't happen in 2024, I believe the UFC will have made a mistake.\nMichael Chandler and Conor McGregor have been expected to fight since coaching opposite each other on the last season of \"Dana White's Contender Series\". Photo by Chris Unger/Zuffa LLC via Getty Images\nI actually surprised myself by ranking this matchup so high. \"The Ultimate Fighter\" has come and gone, and McGregor has, at times, seemed completely uninterested in fighting Chandler. The whole thing was starting to feel a bit stale, but then McGregor \"announced\" the fight for June via X on Dec. 31. At the end of the day, I really, really hope that happens. McGregor basically looks and acts retired as of late, but at the same time, I know there's still a part in all of us that believes this man can still fight. Chandler continues to be the best opponent for him, in my opinion. Obviously, I don't think it should happen at 185 pounds as McGregor suggested, but ultimately, whatever. I'd just like to see it happen.\nThis could be the 2024 version of Makhachev vs. Alexander Volkanovski in 2023. Two of the best pound-for-pound fighters in the world, squaring off. It's not a stretch to consider Edwards (the UFC welterweight champion) as the best fighter on the planet. He's been that dominant for that long. The argument against this matchup is that both have viable contenders in their respective divisions. Charles Oliveira, Justin Gaethje, Arman Tsarukyan at 155. Belal Muhammad and Shavkat Rakhmonov at 170. Those fighters need their shots at the titles, but at the same time, I'm in favor of the UFC booking this champ vs. champ matchup because I believe Makhachev (the UFC lightweight champion) has earned the right to attempt it, and Edwards has earned the right to a big, blockbuster fight, which this has the potential to be.\nMarlon Vera, right, will challenge Sean O'Malley for the UFC men's bantamweight title in the main event at UFC 299 in March. Photo by Chris Unger/Zuffa LLC via Getty Images\nThis was the No. 4 fight I wanted to see in 2023 -- and it didn't happen. But there's a sweetener added to it now that makes it more appealing: A UFC title will be on the line. This bantamweight rematch is scheduled to headline UFC 299 in March, and we all know the backstory by now. O'Malley has one blemish on his record, and that is to Vera in 2020. O'Malley believes that blemish comes with an asterisk, because of a nerve issue he suffered during the loss. Vera finds that laughable, as it was his kicks that caused the issue to happen. Aside from their history, this fight is just a really good stylistic matchup.\nZhang is amazing, but this high ranking is more about Suarez. It is time to finally answer how good she is, and a fight against the strawweight champ would be the best measuring stick. Maybe Suarez is the best female fighter we've ever seen -- that is within the realm of possibility since she is a perfect 10-0. Suarez has been dominant during much of that run and also has Olympic-caliber wrestling. Even in a career plagued by injuries, she has beaten the likes of Alexa Grasso, Jessica Andrade and Carla Esparza. If she were to go in and school Zhang on the floor, we'd all be impressed, but I don't think we'd be completely shocked. That's how much potential Suarez has shown. This is the year we get to see the full extent of that potential.\nFrancis Ngannou is expected to make his PFL debut in 2024. Photo by Justin Setterfield/Getty Images\nSome might disagree on this one, but only because they could be unfamiliar with Ferreira. When Ngannou elected to sign with the PFL in 2023, there was the obvious question of who he would fight, and that question didn't have an answer until recently. There just aren't many interesting matchups for Ngannou outside of the UFC. There were none, in fact, until the 2023 PFL World Championships, when Ferreira knocked out Denis Goltsov in the second round. Ferreira, in many ways, is the second coming of Ngannou. An absolutely incredible athlete, 6-foot-8, 85-inch reach, with head-turning speed and power. He's a little raw, but has a great training camp in American Top Team that's been refining his skills -- in the same way Eric Nicksick and Dewey Cooper in Las Vegas have refined Ngannou. A few months ago, there was nothing to talk about in terms of Ngannou's PFL debut. Now there is. Ngannou vs. Ferreira is a great fight.\nThis fight is booked for UFC 298 in February, and on paper, it's one of the best matchups in the sport. Dvalishvili's last performance against Petr Yan in March was borderline absurd -- 401 attempted strikes and 49 attempted takedowns. Those numbers don't seem real. Dvalishvili, 32, looks like a good bet to win a UFC championship in 2024. Cejudo is at a crossroads. He retired once, of course, and was close to reclaiming the bantamweight championship last year against Aljamain Sterling, so he's still in a good spot in the division. But if he loses here, he'll have real questions to answer about his career.\nDustin Poirier is still looking for his next opponent after losing to Justin Gaethje in a fight for the UFC's BMF title at UFC 291 last July. Photo by Jeff Bottari/Zuffa LLC via Getty Images\nIf you're not interested in ever seeing Covington again after UFC 296, no one blames you. His entire performance to close out 2023, from the unsavory trash talk towards his opponent, Edwards, to the puzzling non-effort in the fight itself, was frustrating and off-putting. Not many are clamoring to see Covington's next move. But if the UFC booked this grudge match, it would instantly feel like a big fight. You'd have a clear \"good guy\" in Poirier against an obvious \"bad guy\" in Covington. There is real animosity between them, since they used to share a training gym. They're both stuck in a bit of a weird spot in their divisions -- near the top, but looking for big-name fights in the absence of title shots. They're at a point in their careers where this fight would actually make the most sense.\n10. Zhang Weili vs. Alexa Grasso, UFC women's flyweight\nSimilar to what I said about Makhachev vs. Edwards, you can make the case that both fighters still have plenty of challengers in their own divisions. Zhang's list includes the Suarez matchup, which I already wrote about. Grasso has Erin Blanchfield and Manon Fiorot waiting on deck. I'm not in favor of the UFC booking this fight right now, but if both Zhang and Grasso add one or two title defenses to their résumés in the first six to eight months of the year, this champion vs. champion fight would be a great way to wrap up 2024.\nMax Holloway could find himself back in contention UFC featherweight title, if it changes hands in 2024. Photo by Suhaimi Abdullah/Zuffa LLC via Getty Images\nThis fight was No. 12 on my list in 2023, and it failed to come together. That's a good thing, though, because it will be even bigger in 2024. If Topuria can claim the featherweight belt against Volkanovski in February, this will be his obvious first title defense. And what a story that would be, Holloway reaching a title fight again two years after falling to 0-3 against Volkanovski. Topuria has made it clear he wants this fight against Holloway in his home country of Spain, which would only add to the spectacle of it. Regardless of what happens between Topuria and Volkanovski, this is an A+ fight that should happen in 2024.\nVery outside of the box, I know. But what a fight, right? All of the PFL/Bellator merger attention has been aimed at the champs, rightfully so, but let's take a second to point out that Pico is still a heck of an MMA prospect. He's only 27 and has found his footing after a disastrous start to his career. He's 8-1 in his last nine fights, with six finishes. And the loss came due to a shoulder injury. Pico looks good, and his boxing, in particular, looks great. Collard is the human embodiment of entertainment, and he's also a clever boxer. No one probably expected to see this matchup on my list, but if it happens, it's a must-see. And if it ends up producing something memorable, just remember, you heard it here first.", "source_domain": "www.espn.co.uk", "text": null, "title": "The 12 MMA fights we want most in 2024", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/mma/story/_/id/39209209/12-mma-fights-want-most-24-jon-jones-vs-tom-aspinall-conor-mcgregor-vs-michael-chandler"}