{"authors": ["James Macaskill"], "date_download": "2024-02-05 15:20:16", "date_modify": "None", "date_publish": "2024-01-02 17:22:33", "description": "THEY are the secret files which show the murderous brutality of the most wanted man in the world.Page after page of chilling confessions from Hamas wa", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25223217%2Fyahya-sinwar-murders-interrogation-files%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/gaza-strip-chief-palestinian-islamist-853431325.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "THEY are the secret files which show the murderous brutality of the most wanted man in the world.\nPage after page of chilling confessions from Hamas warlord Yahya Sinwar record, in his own words, how he became a serial killer in Palestine as he rose through the terrorist ranks.\n7 Hamas leader Yahya Sinwar confessed to a series of murders in Palestine as he rose through the ranks of terror organisation Hamas Credit: GETTY\n7 Transcripts of the 1989 questioning of Yahya Sinwa by the Israeli secret service Credit: israelhayom\n7 Hamas militants with a Palestinian suspected of collaborating with Israel before being executed in Gaza in August 2014. Sinwar murdered several 'collaborators' with his bare hands. Credit: REUTERS\nAs leader of the feared Hamas ‘security service’, known as Majd, he described strangling one man with a scarf.\nIn another killing, Sinwar ordered a Hamas terrorist to bury his own brother alive.\nThe documents from the Israeli Shin Bet intelligence service are transcripts from more than 150 hours of interrogations of Sinwar when he was first captured in late 1989.\nAnd now as scowling Sinwar hides in tunnels hunted by the Israel Defense Forces, the rise of the mastermind behind the October 7 murder, rape and torture of hundred of innocent Israelis can be revealed.\nThe files show how Sinwar had become a trusted deputy to Sheik Ahmed Yassin, the Hamas founder who was later assassinated in an Israeli helicopter gunship attack in 2004.\nCaptured with Yassin in 1989, held and interrogated by Shin Bet, Sinwar, then 27, gave detailed accounts of his killings, even reportedly showing where he had dumped and buried his victims’ bodies.\nEncouraged by his proud mentor, he freely admitted his role with Majd, and took interrogators through each gruesome killing.\nIn one case, Sinwar described mounting surveillance on a Palestinian called Rasmi Salim following claims he had turned his back on Islam and was now collaborating with Israel.\nHe told his interrogators: \"We were driving a white Peugeot, stopped next to Rasmi, caught him, and pushed him in the car.\n\"We interrogated Rasmi, and he admitted that he was in contact with the Israeli intelligence, with a man named Abu Rami. He also admitted that he used to bring girls to his shop and mess with them.\n\"We took him to the cemetery in Khan Yunis, without telling him what we were going to do. I tied his eyes with a rag so he couldn't see, put him in a large grave I saw, and suffocated him with a rag I had.\n“After strangling him, I wrapped him in a white cloth and closed the grave. I understood from Rasmi that he realised that he deserved to die.\"\nThe documents, first revealed by the Israeli paper Israel Hayom, suggest Sinwar also told the investigators that although he had a gun he preferred to kill with his hands.\nIn a second murder, Sinwar kidnapped a man called Adnan Safur. After beating him Sinwar claimed Safur had admitted collaborating with Israel.\n\"I suffocated him with a keffiyeh (Arab scarf), we dug in the place and Rawhi and I buried him there,\" Sinwar admitted.\nIn another case he abducted a man called Fathi Issa from a refugee camp.\nSinwar told investigators. \"We got out of the vehicle, threatened him with a gun, and shoved him in the car. From there we drove to an orchard and I interrogated Fathi.\n\"I grabbed his throat with one hand and started choking him, with the other hand I punched him in the stomach and suddenly he had a heart attack and died.”\nHe described burying the body in an orchard.\nA fourth murder was a man called Hussein al-Sir, also from Khan Yunis, described as “a wealthy man who used to show off his Mercedes car”.\nSinwar said: \"When we found him inside his vehicle, I took out the gun and threatened him. I put the gun to his neck, I told him 'get in my car', and when he got out of his car he started to resist.\n\"I pressed the gun to his neck so that he would get in the car, but then a bullet came out and hit him because I left the hatch open. We quickly put him in the car and drove away.”\nSinwar said Hussein was buried behind a factory adding: “After that, we washed the car of the blood and all the marks and went home.”\nAfter the files emerged, one of his interrogators, Michael Koubi, said Sinwar had told him he had another suspected collaborator buried alive by his brother, who was a member of Hamas.\n“That’s what Yahya Sinwar was like,” Koubi told the German news magazine Der Spiegel.\nKoubi, now 78, said in total, Sinwar admitted to having committed 12 murders in 150 to 180 hours of interrogation.\nBut at no time did Sinwar ever smile. He had seemed, Koubi said, “like a man without emotions”.\nAsked by Koubi why, in his late 20s, Sinwar had no wife or children, he replied: \"Hamas is my wife, my son, my daughter, my parents. Hamas is everything to me.”\nAfter his interrogation by Koubi, Sinwar was convicted of multiple murders, including two Israeli soldiers, and sentenced to five life sentences and a full life term in prison.\nBut he served just over 20-years and, along with Yassin and hundreds of Hamas terrorists, was released in October 2011 as part of a prisoner exchange for kidnapped Israeli soldier Gilad Shalit.\nBy that time he had gathered huge influence and power among Hamas prisoners. Soon after he emerged a free man, he became Hamas’s leader in Gaza.\nAnd his plot to bring horror to Israel just a few miles from his home gathered in momentum until its bloody crescendo on October 7.\nNow, after the massacre of of more than 1,200 people at the hands of Hamas, estimates suggest as many as 20,000 Palestinans have died in the Israeli invasion of Gaza.\nMuch of the narrow strip of land has been decimated by air strikes, artillery and street fighting. Among the dead, Israel says are hundreds of Hamas terrorists.\nAnd amid the rubble, the blood and the death, Sinwar hides, almost certainly in one of the miles of tunnels that haven’t been obliterated by the Israelis.\nAbove him lie thousands of Israeli troops, the rubble of a city and the bodies of thousands of innocents.\nIf, or more likely when, Sinwar is found, it will almost certainly be within a few miles of where he was born and raised in a refugee camp in the Hamas stronghold of Khan Younis in southern Gaza.\nFor the Hamas military leader who triggered a war which has killed so many innocents, the end will probably come as a blinding flash as an Israeli shell, rocket or bullet finds him.\nIt is unlikely he will be dragged by the collar from a dusty tunnel shaft and paraded for the cameras.\nShin Bet agent Koubi claims during his interrogation, Sinwar was convinced the day would come when Hamas would “destroy Israel”.\nAnd until Sinwar is found, Israel believes the threat remains.\nKoubi said: \"It was clear to me even then that Hamas was our biggest enemy. What we’re doing now in Gaza was long overdue.”\n7 Israeli special forces hunting for Sinwar and Hamas leaders Credit: IDF\n7 Sinwar told agents he wanted Israel 'destroyed' Credit: AFP\n7 Hamas tunnels under Gaza in 2016 Credit: APAImages/REX/Shutterstock", "source_domain": "www.thesun.co.uk", "text": null, "title": "Blood-curdling confessions of ‘Gaza’s Bin Laden’ Yahya Sinwar revealed…as he admits he loves to kill with his bare hands", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25223217/yahya-sinwar-murders-interrogation-files/"}