{"authors": ["Lisa Sewards", "Lisa Sewards For Dailymail.Com"], "date_download": "2024-02-05 15:20:18", "date_modify": "None", "date_publish": "2024-01-02 20:07:26", "description": "According to Goldberg Jones law practice, divorce filings increase by 33 per cent from January through March. To help you avoid breakup, Amy Morin has shared the 13 things happy couples do.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ffemail%2Farticle-12886425%2Fjanuary-new-year-divorce-save-breakup.html.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/02/19/79187147-0-image-m-32_1704225394023.jpg", "language": "en", "localpath": null, "maintext": "January is known as divorce month - when an emotionally charged atmosphere combines with intense financial pressures to create the perfect conditions for marital meltdown.\nAccording to Goldberg Jones law practice, divorce filings increase by 33 per cent from January through March, while online searches for 'divorce' and related terms like 'divorce party' also see a spike.\nIt's likely, however, that the cracks had started to show long before one or both parties started to Google 'child custody'.\nIn her new book, 13 Things Mentally Strong Couples Don't Do, best-selling author and psychotherapist Amy Morin has identified the key characteristics that could ensure your relationship will survive 2024.\nThe New Year is known as the trickiest time for couples - but now psychotherapist Amy Morin has identified key characteristics that could help your relationship survive 2024 (stock image)\n1. Don't ignore your problems\nAccording to the Couples by the Numbers Survey, 47 per cent of people don't bring up their problems because they fear they'll make things worse.\nAmy advises couples to define the problem and ask: do I need to solve it, or solve how I feel about it? Then create a plan to fix it.\nCommon traps: Waiting for the perfect time to address a problem, bringing up the same issue over and over, and using the silent treatment if a tricky topic is raised.\n2. Don't keep secrets\nForty per cent of people believe their partner keeps secrets. 'Healthy relationships are built on trust. It takes just one secret to erode that,' Amy says. So decide and agree on what the difference is between secrecy and privacy.\nCommon traps: Being overprotective, sharing your partner's secret with someone else, and being brutally honest, for example sharing opinions about your partner that will hurt them unnecessarily.\n3. Don't hesitate to set boundaries\nThirty-four per cent of couples disagree on the rules and boundaries they should set with extended family.\nFor boundaries with your partner and outside your relationship, as well as your partner's boundaries in and outside the relationship, ask are they healthy - or are they too rigid or too loose?\nCommon traps: Confusing boundaries with controlling behavior, and setting boundaries when emotions are running too high. 'Remember you don't have to like or agree with boundaries to honor them,' Amy advises.\nPsychotherapist Amy Morin (left) has identified the qualities that could mean your relationship is made of stronger stuff\n4. Don't become martyrs\nForty-seven per cent of people feel resentful about all the work they do and the sacrifices they make for their relationships.\nPractice asking for help and accepting it. Reframe your thoughts from this unrealistic thought: No-one ever helps me; to this realistic thought: Sometimes people are willing to help, especially if I ask for it.\nAnd from this unrealistic thought: My partner can't help because they never do anything right; to this realistic thought: I could let my partner help and they may do things differently than I do.\nCommon traps: You disagree on what needs to be done and you refuse to accept kindness from each other.\n5. Don't use your emotions as weapons\nThirty-seven per cent of people think their partner uses emotions like anger and sadness as a manipulation tactic.\nCreate emotional rules for your home. For example, is it ok to slam doors when you're angry? 'It's important to take responsibility for your own feelings while also allowing your partner to take responsibility for theirs,' Amy says.\nCommon traps: Not believing the other person's genuine expression of emotions and confusing feelings with behaviors (i.e. it's OK to feel angry, but becoming aggressive isn't OK).\n6. Don't try to fix each other\nThirty-six per cent of people say their partner tries to fix things they don't like about them.\nExpress your concern about your partner in a loving way so that you focus on influencing them, not fixing them.\nRemember - look for 'wishes and dips' because motivation doesn't come in a straight line, Amy advises.\nCommon traps: Don't use stealth and trickery to change your partner and don't force them to adopt your way of change.\n7. Don't communicate with disrespect\nThirty-six per cent of people say their partners are sometimes rude, condescending or disrespectful.\nAvoid what relationship researcher John Gottman identified as 'the four horsemen' - the communication styles that can predict the end of a relationship: criticism, contempt, defensiveness and stonewalling.\n'A few more examples of disrespectful communication are using your phone when your partner is talking to you, not consulting your partner before making a major decision, interrupting and name calling,' Amy adds.\nCommon traps: Passive aggressive communication and hissing through your teeth.\nAvoid what relationship researcher John Gottman identified as 'the four horsemen' of communication styles: criticism, contempt, defensiveness and stonewalling\n8. Don't blame each other for your problems\nSixty-four per cent of people blame their partners for their lack of happiness.\nBlame is a great defense mechanism to protect your ego, but you have to learn to take responsibility for your own happiness.\n'Even if the mess isn't your fault, digging yourself out might still be your responsibility,' Amy says.\n'Join forces to fight the problem together by developing a we vs. the problem mentality.'\nCommon traps: All or nothing thinking and looking for allies.\n9. Don't forget why you fell in love\nThirty-six per cent of people wonder why they even stay with their partner.\nDon't forget why you fell in love and do talk about your love story.\nLook at your partner's photograph to help evoke good feelings and keep a healthy perspective. Assume your partner's intentions come from a good place.\nCommon traps: Don't demand public declarations of love and don't bring up the past as a way to insult your partner.\n10. Don't expect the relationship to meet all your needs\nThirty-nine per cent say their partner expects more emotional support than they can give.\nSo identify each other's needs and discuss any differences you see from this list: admiration, affection, intimate conversation, domestic support, family commitment, financial support, honesty and openness, physical attractiveness, recreational companionship and sexual fulfilment.\nThen ask for what you need but also recognize how meeting some of your needs yourself makes you stronger.\nCommon traps: Trying to meeting all your partner's needs and justifying bad behavior.\nFifty per cent of individuals say they feel neglected by their partner sometimes\n11. Don't neglect your partnership\nFifty per cent of individuals say they feel neglected by their partner sometimes.\n'Text messages, apps, emails and social media alerts call your attention to your phone - not your partner,' Amy warns.\nAffirm your commitment often, use 'we talk,' and develop and maintain relationship rituals, for example, going to brunch together every Sunday.\nCommon traps: Thinking you'll have time to spend together later on in life and assuming your partner will understand if you don't prioritize your relationship.\n12. Don't take each other for granted\nFifty-three per cent of people say their partner takes them for granted sometimes.\nObserve, assess and reassess your partner going about their usual activities.\nReframe judgmental assessments with compassionate ones.\nFor example, an assessment could be: he never remembers to pick up the stuff at the store that I ask him to. But the reassessment could be: He's had a busy day and it's tough to remember things sometimes.\n'When you change how you're thinking, you can shift how you feel and behave,' Amy says.\nCommon traps: Combining compliments with criticism and doing things just to get recognition.\n13. Don't stop growing and changing\nTwenty-five per cent of people fear their partner won't like them as much if they make big changes.\nThere may be selfish motives for not wanting your partner to create positive change so pay attention to your emotional reactions and assumptions.\nFor example, your partner wants to go back to college, and your emotional reaction could be frustration, and you could have thoughts like they're going to waste a lot of money. Then you could make the assumption they're going to take a few classes and quit going.\n'We rarely tell our partners what our assumptions are. But becoming a better version of yourself can help you be a better person within your relationship,' Amy says.\nCommon traps: Supporting bad ideas and confusing silence with support.\n13 Things Mentally Strong Couples Don't Do is published by William Morrow", "source_domain": "www.dailymail.co.uk", "text": null, "title": "New Year is the trickiest time of the year for relationships - here are the 13 ways to save YOUR marriage from a breakup", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/femail/article-12886425/january-new-year-divorce-save-breakup.html"}