{"authors": ["Helen Livingstone", "Maya Yang", "Yohannes Lowe", "Kevin Rawlinson", "Reged Ahmad"], "date_download": "2024-02-05 15:20:20", "date_modify": "None", "date_publish": "2024-01-02 01:06:02", "description": "This blog has now closed. You can read our full report on the latest developments here and read all our Israel-Gaza war coverage here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F01%2Fisrael-gaza-war-live-updates-idf-2024-hamas-fires-rockets-central-southern.json", "image_url": "https://i.guim.co.uk/img/media/5eeed155f357e8d2a74014b80d7e340e76f1e7d2/0_7_5502_3301/master/5502.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=a230d28e5e74a2c9e8886ccb8fedf0c4", "language": "en", "localpath": null, "maintext": "From 1 Jan 2024 10.54 CET Israel to withdraw some troops from Gaza to shift to more targeted operations - official Israel is withdrawing some troops from Gaza to shift to more targeted operations against Hamas, an Israeli official has said. The official said the withdrawal was focused on reservists – of which Israel drafted 300,000 for the war – and designed to “re-energise the Israeli economy”. But the official told Reuters that some of the troops pulled out of Gaza in the south would be prepared for rotation to the northern border with Lebanon, where Hezbollah militants have been exchanging fire with Israel in solidarity with the Palestinians. Israel has warned that if Hezbollah does not back down a full-on Lebanon war looms. Both Hamas and Hezbollah are backed by Iran, whose militant allies in Syria, Iraq and Yemen have also been carrying out longer-range attacks against Israel. “The situation on the Lebanese front will not be allowed to continue. This coming six-month period is a critical moment,” the official said.\nUpdated at 11.29 CET\n2 Jan 2024 02.04 CET It’s now just after 3am in Gaza and Israel and this blog is closing. We’ll be back soon to bring you all the latest breaking news. In the meantime, here are the key developments: The Israeli military claims to have killed Adil Mismah, a regional commander of Hamas’s elite Nukhba forces, in the central city of Deir al-Balah. The Israel Defense Forces said Mismah had taken part in Hamas’s 7 October attack against Israel.\nA total of 21,978 Palestinians have been killed and 56,697 injured in Israeli strikes in Gaza since 7 October, the health ministry in Gaza said on Monday . The figures include 156 Palestinians killed and 246 injured in the past 24 hours, the ministry added. Thousands more people are believed to be buried under the rubble of destroyed buildings and tens of thousands of Palestinians have been wounded.\nIsrael is withdrawing some troops from Gaza to shift to more targeted operations against Hamas, an Israeli official told Reuters. The official said the withdrawal was focused on reservists – of which Israel drafted 300,000 for the war – and designed to “re-energise the Israeli economy”.\nNot all of those returned from Gaza will go home, a senior Israeli official told Reuters, with some prepared for rotation to the northern border with Lebanon, where Israel is expanding its preparations for war . “The situation on the Lebanese front will not be allowed to continue. This coming six-month period is a critical moment,” the official said.\nIsraeli settlers killed at least 10 Palestinians and set alight dozens of homes in the occupied West Bank in 2023, making it the “most violent” year on record for settler attacks, an Israeli watchdog has said. Numerous West Bank attacks were carried out by a large group of Israeli settlers and the violence rose after Hamas’s 7 October attacks on Israel, said Yesh Din, a human rights group.\nThe Palestine Red Crescent Society has collaborated with the Egyptian Red Crescent to establish the first organized camp in Khan Younis for Palestinians displaced by Israeli strikes across Gaza. The camp is initially set to hold 300 families from PRCS medical, ambulance and relief teams, with its capacity set to expand later to 1,000 tents, the PRCS said.\nSome of the Israeli communities north of the Gaza Strip that were evacuated in the wake of the 7 October attack by Hamas will be able to go back in the near future as military operations progress, the Israeli defence minister, Yoav Gallant, said on Monday. According to published remarks from a briefing, Gallant said that some of the evacuated communities in areas within a range of 4-7km north of the territory would be able to return soon.\nLebanon’s Iran-backed Hezbollah group said that four of its fighters had been killed in southern Lebanon, updating the toll from three in a statement made earlier, without giving any further detail . Security sources said the first three were killed in an Israeli raid on two houses in the Lebanese village of Kafr Kila near the border where Hezbollah maintains security control.\nThe US aircraft carrier USS Gerald R Ford, deployed to the eastern Mediterranean after the deadly attack on Israel by Hamas in October to deter other regional actors from escalating the conflict, will return to the US “in the coming days,” the Navy said Monday . It will be replaced by the amphibious assault ship the USS Bataan and its accompanying warships, the USS Mesa Verde and the USS Carter Hall.\nIsrael’s supreme court has ruled against a key component of prime minister Benjamin Netanyahu’s government’s judicial overhaul, which challenged the powers of the judiciary. A supreme court statement said eight of 15 justices had ruled against an amendment passed by parliament in July which scraps the “reasonableness” clause, used by the court to overturn government decisions which are deemed unconstitutional.\nUpdated at 02.06 CET\n2 Jan 2024 01.35 CET Israel will appear before the international court of justice (ICJ) in the Hague to defend itself against accusations of genocide lodged against it by South Africa last week in relation to its attack on Gaza, the newspaper Haaretz reports. The decision was made during a meeting chaired by prime minister Benjamin Netanyahu and followed consultations with the justice ministry, the military and the national security council, the Israeli paper reported. Israel will now try to prevent the court from issuing an interim order seeking to halt its campaign in Gaza. At the end of a meeting chaired by Prime Minister Benjamin Netanyahu – and following a series of consultations between the Justice Ministry, the IDF and the National Security Council – it was decided that Israel would try to prevent the court from issuing an interim order that would seek to halt the campaign in Gaza. In its application, South Africa said: The acts and omissions by Israel complained of by South Africa are genocidal in character because they are intended to bring about the destruction of a substantial part of the Palestinian national, racial and ethnical group. In response, Israel’s foreign ministry accused Pretoria of spreading a “blood libel” and said its accusations lacked “both a factual and a legal basis”.\nUpdated at 05.07 CET\n2 Jan 2024 01.21 CET Access to a busy terminal at New York’s John F. Kennedy international airport was restricted on Monday as pro-Palestinian protesters converged on the airport for the second time in a week. Videos posted online show heavy traffic and a slow-moving line of cars, some flying Palestinian flags and featuring text on the windows such as “Stop the genocide.” Police directed a line of cars around a checkpoint, AP reported. Protesters also had planned to arrive at the airport in Queens, New York, by public transportation. A caravan of cars carrying Palestinian flags flooded the Belt Parkway​ on Monday, heading to Terminal 4 at John F. Kennedy International Airport​ for a demonstration. @JennaMDeAngelis reports. https://t.co/u7d8wYA30G — CBS New York (@CBSNewYork) January 1, 2024 HAPPENING NOW: The NYPD is warning of possible delays for passengers at JFK airport on New Year's Day as a result of planned protests https://t.co/nJSnwox1NC pic.twitter.com/JBnMUrJtTL — NBC New York (@NBCNewYork) January 1, 2024\n2 Jan 2024 01.07 CET A 23-year-old Palestinian prisoner has died in an Israeli jail, the prison service has said, adding it was looking into the circumstances of the inmate’s death. The prison service in a statement said the man from Nablus in the occupied West Bank had died in Meggido prison, in Israel’s north, AFP reports. He was arrested in June 2022 and later sentenced to jail time for “security offences”, the statement said without naming the prisoner. “As in all such incidents, the circumstances (of his death) will be examined,” it said. The Palestinian Authority’s detainees commission confirmed a prisoner had died but was unable to verify further information. The prison service said the inmate was affiliated with Fatah, Palestinian president Mahmoud Abbas’s movement. Last month Israeli police said they had questioned 19 prison guards as part of an investigation into the death of another Palestinian inmate following allegations of torture. According to the official Palestinian news agency Wafa, 38-year-old Thaer Abu Assab, from Qalqilya in the West Bank, died in November after being beaten by Israeli prison guards. Israel has intensified its arrest of Palestinians in Gaza and the West Bank since the 7 October Hamas attack, and there are now more than 8,000 Palestinians in Israeli jails, an historic high, the Guardian’s Jason Burke and Sufian Taha reported last month. Pictures have also been leaked of Israeli troops overseeing dozens of Palestinian men detained in Gaza, stripped to their underwear and in some cases blindfolded and handcuffed. The Israeli newspaper Haaretz has reported that hundreds of the men were held at a military base in the south of Israel, and that several had died in unclear circumstances.\n1 Jan 2024 00.49 CET The US aircraft carrier USS Gerald R Ford, deployed to the eastern Mediterranean after the deadly attack on Israel by Hamas in October, will return to the United States “in the coming days,” the Navy said Monday. Sent to “contribute to our regional deterrence and defense posture,” the carrier will “redeploy to its home port as scheduled to prepare for future deployments,” the Navy said in a statement according to AFP. After Hamas’ bloody attack on Israel on 7 October, Washington provided military support to Israel and reinforced its forces in the region, including the USS Gerald R. Ford and other warships, in order to deter countries like Iran from escalating the conflict. “The Department of Defense continually evaluates force posture globally and will retain extensive capability both in the Mediterranean and across the Middle East,” the statement added. The Navy said it was “collaborating with Allies and partners to bolster maritime security in the region.” It noted that the Defense Department would continue to rely on the presence of its forces in the region – including the USS Dwight D Eisenhower carrier strike group – “to deter any state or non-state actor from escalating this crisis beyond Gaza.” View image in fullscreen US Defense Secretary Lloyd Austin, second right, talks with the commanding officer of the USS Gerald R. Ford, Navy Capt. Rick Burgess, right, during a visit to the ship last month. Photograph: Tara Copp/AP\n1 Jan 2024 00.36 CET An Israeli man who never served in the military has been charged with impersonating a soldier and stealing weapons after sneaking into an army unit and joining the fighting against Hamas. Associated Press reports: According to an indictment filed on Sunday, Roi Yifrach, 35, took advantage of the chaotic situation in the aftermath of Hamas’ 7 October attack to join combat operations and steal large amounts of military gear, including weapons, munitions, and sensitive communications equipment. Israeli media said he spent time fighting in Gaza and even appeared in a photo next to prime minister Benjamin Netanyahu during one of his visits to soldiers in the field. Yifrach went to southern Israel on 7 October and presented himself alternately as a combat soldier from elite anti-terrorism units, a bomb dispersal expert, and a member of the Shin Bet internal security service, the indictment said. Police arrested Yifrach on 17 December and found large amounts of weapons, grenades, magazines, walkie-talkies, a drone, uniforms, and other military equipment in his possession. Eitan Sabag, Yifrach’s lawyer, told Israel’s Channel 12 TV that Yifrach went down to the south to help as a paramedic with a first responder organisation, and fought bravely to defend Israel for more than two months. “He was helping people and helping rescue people, all under fire, while also fighting against terrorists,” Sabag said. Police also detained four other people, including a police officer, in connection with the weapons theft.\n1 Jan 2024 00.21 CET Lebanon’s Iran-backed Hezbollah group has said on its Telegram account that three of its fighters have been killed in southern Lebanon. The statement gave no detail about how the three were killed, Agence France-Presse reports, but said they “were martyred on the road to (liberate) Jerusalem”. Security sources said they were killed in an Israeli raid on two houses in the Lebanese village of Kafr Kila near the border where Hezbollah maintains security control. Hezbollah, an ally of Palestinian Islamist group Hamas, has been exchanging near-daily fire with Israel across Lebanon’s southern frontier since the eruption of the Israeli-Hamas war in Gaza in early October. The Israeli military said on Monday it struck a series of targets in Lebanon, including “military sites” where Hezbollah was operating. Israeli air strikes and shelling have killed more than 100 Hezbollah fighters and nearly two dozen civilians, including children, elderly and several journalists, according to Hezbollah and security sources. Monday’s raid comes after a senior Israeli official told Reuters that the country was expanding preparations for a Lebanon war. “The situation on the Lebanese front will not be allowed to continue. This coming six-month period is a critical moment,” the official said according to the news agency. This is Helen Livingstone, taking over from my colleague, Maya Yang.\n1 Jan 2024 23.55 CET Summary Here is where things stand: The Palestine Red Crescent Society has collaborated with the Egyptian Red Crescent to establish the first organized camp in Khan Younis for Palestinians displaced by Israeli strikes across Gaza. The camp is initially set to hold 300 families from PRCS medical, ambulance and relief teams, with its capacity set to expand later to 1,000 tents, the PRCS said.\nSome of the Israeli communities north of the Gaza Strip that were evacuated in the wake of the 7 October attack by Hamas will be able to go back in the near future as military operations progress, the Israeli defence minister, Yoav Gallant, said on Monday. According to published remarks from a briefing, Gallant said that some of the evacuated communities in areas within a range of 4-7km north of the territory would be able to return soon.\nIsrael’s supreme court has ruled against a key component of prime minister Benjamin Netanyahu’s government’s judicial overhaul, which challenged the powers of the judiciary. A supreme court statement said eight of 15 justices had ruled against an amendment passed by parliament in July which scraps the “reasonableness” clause, used by the court to overturn government decisions which are deemed unconstitutional, Reuters reports.\nThe Israeli military claims to have killed Adil Mismah, a regional commander of Hamas’s elite Nukhba forces, in the central city of Deir al-Balah. The Israel Defense Forces said Mismah had taken part in Hamas’s 7 October attack against Israel.\nIsraeli settlers killed at least 10 Palestinians and set alight dozens of homes in the occupied West Bank in 2023, making it the “most violent” year on record for settler attacks, an Israeli watchdog has said. Numerous West Bank attacks were carried out by a large group of Israeli settlers and the violence rose after Hamas’s 7 October attacks on Israel, said Yesh Din, a human rights group.\nIsrael is withdrawing some troops from Gaza to shift to more targeted operations against Hamas, an Israeli official told Reuters. The official said the withdrawal was focused on reservists – of which Israel drafted 300,000 for the war – and designed to “re-energise the Israeli economy”.\nUpdated at 23.59 CET\n1 Jan 2024 23.18 CET Faisal Ali Satellite images of Gaza City and Khan Younis City show the scale of devastation caused by Israeli bombardment of the besieged Palestinian enclave. At least 70% of the homes in Gaza are believed to have been destroyed by the air campaign. The images, downloaded from Sentinel Hub, show that the colour of Gaza City and Khan Younis appears completely different from space. The before-and-after images depict both cities as of 3 August this year and 31 December. “Gaza City is now a different colour from space. It’s a different texture,” said Corey Scher, a specialist in the use of satellite imagery to assess political conflict at the CUNY Graduate Center, told the Associated Press. Gaza City: Gaza City. Khan Younis City: Khan Younis city.\nUpdated at 23.21 CET\n1 Jan 2024 22.00 CET The family of Maya Puder, a 25-year old aspiring actor and film-maker who was found dead four days after Hamas’s attack on Israel on 7 October, continues to mourn her loss. The Guardian’s Emine Sinmaz reports: When Maya Puder went missing from the Supernova music festival in Israel on 7 October, her family prayed she was in hiding somewhere or had been kidnapped. The 25-year-old aspiring actor and film-maker last messaged her parents at 8.01am to say she was sheltering from Hamas rockets. But her family’s hopes were shattered four days later when they were told Maya had been found dead 20 metres away from a shelter. “It was devastating, all our hopes were crushed,” said Maya’s mother, Ayala Puder. “I’d never in my worst imagination thought about a situation where I’d have to bury my daughter, and to bury her under those circumstances of her being murdered so brutally. It’s beyond devastating.” For the full story, click here: ‘We live on 7 October’: Hamas victim Maya Puder remembered by her family Read more\nUpdated at 22.09 CET\n1 Jan 2024 21.20 CET Palestine Red Crescent Society establishes first organized camp in Khan Younis for displaced Palestinians The Palestine Red Crescent Society has collaborated with the Egyptian Red Crescent to establish the first organized camp in Khan Younis for Palestinians displaced by Israeli strikes across Gaza. The camp is initially set to hold 300 families from PRCS medical, ambulance and relief teams, with its capacity set to expand later to 1,000 tents, the PRCS said. 📍PRCS, in collaboration with @EG_Red_Crescent, establishes the first organized camp in #KhanYounis for displaced individuals. Initially hosting 300 families from PRCS medical, ambulance, and relief teams, the capacity will later expand to 1000 tents, providing shelter for… pic.twitter.com/wIKhzBxDB7 — PRCS (@PalestineRCS) January 1, 2024 Since October 7, 1.9 million Palestinians have been forcibly displaced by Israeli strikes across Gaza which have killed nearly 22,000 Palestinians.\n1 Jan 2024 20.44 CET A displaced Palestinian woman gave birth to quadruplets in Gaza amid Israeli bombardment and severe shortages in fuel and medical supplies. Eman al-Masri was pregnant when she had to move from northern Gaza to Jabalia refugee camp before finally sheltering in central Gaza, where she gave birth to quadruplets. Her young family now resides in a former school classroom with 50 other families. She said: “The entire place is not suitable for children, and there is no money even to buy diapers, milk, or anything.” She added: ‘All of this had an impact on me, on the children who were in my womb, and on my young children.” 00:01:25 Displaced woman gives birth to quadruplets in central Gaza – video\nUpdated at 20.46 CET\n1 Jan 2024 20.09 CET Israel is withdrawing some of its troops from Gaza as a senior Israeli official said it plans to continue its war across the strip – which has killed nearly 22,000 Palestinians – for “six months at least”. The Guardian’s Emma Graham-Harrison reports: There is growing international pressure to curb an offensive that has so far killed nearly 22,000 Palestinians in Gaza, most of them women and children. Even Israel’s staunchest ally, the US, which rejects calls for a ceasefire, has started pushing the government to scale back the ferocity of its attacks. Plans to send some reservists home from Gaza, confirmed on New Year’s Eve, mark the start of a new stage in the war, a senior official told Reuters, and may be presented as a partial response to those demands. But Israel still expects heavy fighting in Gaza for much of 2024 as it hunts for senior Hamas leaders, even if there are fewer troops on the ground. “This will take six months at least, and involve intense mopping-up missions against the terrorists. No one is talking about doves of peace being flown from Shejaiya,” the official said, referring to a Gaza district that has been the scene of heavy battles. Reuters did not identify him by name. Not all of those returned from Gaza will go home. Some would be prepared for rotation to the northern border with Lebanon, amid fears of a wider escalation of the conflict, the official told Reuters. For the full story, click here: Israel to withdraw some troops from Gaza amid new campaign planning Read more\nUpdated at 20.30 CET\n1 Jan 2024 19.41 CET Here are some images coming through the newswires of pro-Palestine rallies held around the world in recent days, in which thousands of protesters called for a ceasefire in Gaza, where nearly 22,000 Palestinians have been killed in Israeli strikes: View image in fullscreen An aerial view of the Galata Bridge after tens of thousands of participants gathered in mosques for morning prayers and march for the event in support of Palestinians, on 1 January 2024 in Istanbul, Turkiye. Photograph: Ali Atmaca/Getty Images View image in fullscreen People attend a gathering of Edmonton’s Palestinian community and its supporters at a protest rally organised on Whyte Avenue and its surroundings, on 31 December 2023, in Edmonton, Alberta, Canada. Photograph: Anadolu/Getty Images View image in fullscreen People carry placards during a demonstration in solidarity with the Palestinian people, in Karachi, Pakistan, on 31 December 2023. Photograph: Shahzaib Akber/EPA View image in fullscreen Pro-Palestinian demonstrators carrying Palestinian flags and banners gather at a rally in Chicago, US on 31 December 2023. Demonstrators demanded a halt to US aid to Israel. Photograph: Jacek Boczarski/Getty Images View image in fullscreen Pro-Palestinian demonstrators gather at Thomas Circle and hold a rally with Palestinian flags and banners, calling for a ceasefire in Gaza on 31 December in Washington DC, District of Columbia, United State. Photograph: Probal Rashid/ZUMA Press Wire/REX/Shutterstock View image in fullscreen Hundreds of people carrying Palestinian flags demonstrate during a massive rally in the Plaza de Arriaga in Bilbao, Vizcaya, Spain under the slogan ‘Stop the genocide in Gaza’ on 30 December 2023. Photograph: Luis Soto/ZUMA Press Wire/REX/Shutterstock\nUpdated at 19.51 CET\n1 Jan 2024 19.02 CET Israeli defense minister: Some of evacuated Israeli communities north of Gaza strip can return soon Some of the Israeli communities north of the Gaza Strip that were evacuated in the wake of the 7 October attack by Hamas will be able to go back in the near future as military operations progress, the Israeli defence minister, Yoav Gallant, said on Monday. According to published remarks from a briefing, Gallant said that some of the evacuated communities in areas within a range of four to seven kilometers north of the territory would be able to return soon.\nUpdated at 21.20 CET", "source_domain": "www.theguardian.com", "text": null, "title": "IDF claims to have killed regional Hamas commander - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/01/israel-gaza-war-live-updates-idf-2024-hamas-fires-rockets-central-southern"}