{"authors": ["Michael Knowles"], "date_download": "2024-02-05 15:14:31", "date_modify": "None", "date_publish": "2024-01-30 22:07:00", "description": "The CIA Director said Ukrainian commanders should try and 'puncture Putin's arrogance' by ordering more long-range missile strikes and sinking more Russian ships in the Black Sea.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fpolitics%2F1861457%2FCIA-warn-Ukraine-catastrophic-Russia-nuclear.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/139/1200x712/5189462.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian troops are braced for a gruelling battle this year\nFailing to provide Ukraine with weapons to repel Russian forces “would be an own goal of historic proportions”, the head of the CIA said. William Burns said arms must continue to flow to Kyiv as the war is at a “crucial moment”. He said Ukrainian commanders should try and “puncture Putin’s arrogance” by ordering more long-range missile strikes and sinking more Russian ships in the Black Sea. But Mr Burns admitted this may lead to Vladimir Putin threatening to use nuclear weapons again.\nWestern weapons have helped Ukrainian troops repel Russian forces\nWestern Leopard 2 tanks were considered a vital reinforcement for Ukrainian forces\nHe said: “Ukraine’s challenge is to puncture Putin’s arrogance and demonstrate the high cost for Russia of continued conflict, not just by making progress on the frontlines but also by launching deeper strikes behind them and making steady gains in the Black Sea. “In this environment, Putin might engage again in nuclear sabre-rattling, and it would be foolish to dismiss escalatory risks entirely. But it would be equally foolish to be unnecessarily intimidated by them. “The key to success lies in preserving Western aid for Ukraine. At less than five percent of the U.S. defense budget, it is a relatively modest investment with significant geopolitical returns for the United States and notable returns for American industry. “Keeping the arms flowing will put Ukraine in a stronger position if an opportunity for serious negotiations emerges. “It offers a chance to ensure a long-term win for Ukraine and a strategic loss for Russia; Ukraine could safeguard its sovereignty and rebuild, while Russia would be left to deal with the enduring costs of Putin’s folly. “For the United States to walk away from the conflict at this crucial moment and cut off support to Ukraine would be an own goal of historic proportions.”\nUkraine is becoming increasing desperate for military aid\nMr Burns said “no one is watching US support for Ukraine more closely than China”. Republican politicians have refused to keep supporting Kyiv as they want fresh cash for Ukraine to be linked to major changes to immigration policies.\nUkraine received its last package of American weapons in December. But Congress must approve more funding before additional arms and ammunition can be sent. Ukraine’s military has abandoned hopes of a swift military victory and is instead preparing for a drawn-out war. Western officials say they see little chance that either Russia or Ukraine will make a significant breakthrough in the conflict this year. With many Republicans focused on opposing China, Stoltenberg said: \"Today it's Ukraine; tomorrow it could be Taiwan.\"\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Abandoning Ukraine now would be 'an own goal of historic proportions', CIA chief warns", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/politics/1861457/CIA-warn-Ukraine-catastrophic-Russia-nuclear"}