{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:20:22", "date_modify": "None", "date_publish": "2024-01-02 13:19:51", "description": "How significant is supreme court’s decision to throw out law that would have restricted its own powers?", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F02%2Fisraels-judicial-overhaul-plans-what-is-row-about-and-will-it-affect-war-in-gaza.json", "image_url": "https://i.guim.co.uk/img/media/f3fa4f82d0e3ff71220057c26fca86d05da10b1b/0_0_3897_2339/master/3897.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968f30043d9cd1860ae5796a48523bef", "language": "en", "localpath": null, "maintext": "What is Israel’s constitutional crisis about?\nIsrael’s supreme court has ruled to throw out the only part of the contentious judicial overhaul proposed by Benjamin Netanyahu and his far-right coalition partners that had so far passed into law, a decision that could plunge the country into fresh domestic turmoil even as it fights a war in the Gaza Strip and prepares for the possibility of full-blown conflict with Hezbollah.\nNetanyahu returned to office a year ago after a short stint in opposition, this time at the head of the most rightwing administration in Israeli history. His government quickly introduced legislation to overhaul the judicial system, which supporters say is needed to better balance the branches of government. Critics say the changes amount to democratic backsliding.\nThe proposals exposed deep political rifts in Israeli society and led to the biggest protest movement the country has ever seen. The overhaul was frozen after the 7 October attacks by Hamas, but a supreme court decision on the one part of the law that had been passed was due by 12 January.\nWhat just happened?\nIn July last year, after huge protests and wildcat strikes against the judicial overhaul, the government managed to pass the first plank of the legislation – a law scrapping the “reasonableness” clause that allows the supreme court to overrule government decisions.\nAfter months of deliberations, the bench ruled on Monday by a slim majority of eight to seven to throw out the law curtailing its own powers, saying it would severely damage Israel’s democracy.\nThis is the first time Israel’s supreme court has overturned a quasi-constitutional “basic law”, and several government ministers had previously indicated they would not comply with a ruling striking the law down.\nThe most significant part of the decision is that 12 of the justices on the bench of 15 agreed for the first time that the supreme court does in principle have the right to overturn basic laws.\nOne of Netanyahu’s allies attempted to introduce a last-minute bill that would postpone publication of the decision. Instead, after a draft was leaked to Israeli media, the court published the ruling early.\nWhat happens next?\nIt is possible that the decision could reignite the tensions that roiled Israel before the Hamas attack and further destabilise Netanyahu’s already shaky wartime unity government.\nThe court ruling – and its timing – were quickly criticised by government officials, including the architect of the legislation, the justice minister, Yariv Levin. Some rightwing ministers and members of the Knesset have already vowed to push ahead with the judicial overhaul: Levin, or a future rightwing government, could try to reintroduce the legislation in future, aided by a change in the makeup of the supreme court, which is set to have a conservative majority soon.\nIsraeli daily Yedioth Ahronoth, however, quoted an unnamed senior coalition official as saying: “The reform died on 7 October and won’t come back to life.”\nWill this affect the war in Gaza?\nBefore the events of 7 October, large-scale protests by Israel Defense Forces (IDF) reservists over the judicial overhaul led to worries about the army’s operational readiness; Hamas, Iran and Israel’s other enemies closely followed what they saw as internal weakness.\nAn hour after the court announced its decision, IDF spokesperson Brig Gen Daniel Hagari hinted that the supreme court decision was welcome. The public discord in Israel last year probably influenced Hamas’s decision to attack, he said, but the IDF was now “fighting with full unity in its ranks … expressing the strength of Israeli society.”\nThere were particular concerns in the military that the proposals for the judiciary could expose officers to international prosecution for war crimes. Israel is not a member of the international criminal court, arguing that its own legal system adequately investigates accusations of wrongdoing by the armed forces.\nPalestinians and rights groups have long said that the very low number of indictments in Israeli investigations suggests current practice is not fit for purpose.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel’s judicial overhaul plans: what is row about and will it affect war in Gaza?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/02/israels-judicial-overhaul-plans-what-is-row-about-and-will-it-affect-war-in-gaza"}