{"authors": ["Lizzie Porter", "Robert Mendick", "In Jerusalem", "Chief Reporter"], "date_download": "2024-02-05 15:20:23", "date_modify": "None", "date_publish": "2024-01-02 21:29:00", "description": "Large drone strike risks major escalation in the war as Tel Aviv at ‘very high level of readiness’ for retaliation", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2024%2F01%2F02%2Fisrael-assassinate-senior-hamas-saleh-al-arouri-beirut%2F.json", "image_url": "https://img.youtube.com/vi/GzxszdoFh1I/maxresdefault.jpg", "language": "en", "localpath": null, "maintext": "Israel has assassinated a senior Hamas leader in a Beirut drone strike that threatens a major escalation in the war.\nSaleh al-Arouri, the deputy leader of Hamas’s political wing and the founder of its militant operations in the occupied West Bank, was among seven killed in the blast in Beirut’s southern suburb of Dahiyeh.\nThe 57-year-old is the most senior member of the terror group to have been eliminated since the Oct 7 attack on southern Israel.\nHamas killed around 1,140 people in the attack and captured an estimated 240 hostages, with 120 remaining in captivity. Members of the terrorist group raped, carried out sexual violence and mutilated women during the onslaught, according to a BBC report.\nA US defence official said the Israel Defense Forces (IDF) was behind the strike on a Hamas office, in which two other senior members of its militant wing were killed.\nThe early-evening drone strike caused extensive damage to a building in the residential suburb of Beirut, with the front of the multi-storey block blown out. Limbs and other pieces of flesh could be seen on the roadside.\nNajib Al-Mikati, Lebanon’s prime minister, said the strike was a “new Israeli crime that definitely aims to bring Lebanon into a new phase of confrontations”.\nThe country plans to submit a complaint to the UN Security Council that the “blatant” strike is a violation of its sovereignty.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Israel assassinates senior Hamas leader in Beirut", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2024/01/02/israel-assassinate-senior-hamas-saleh-al-arouri-beirut/"}