{"authors": ["Keith Griffith", "Keith Griffith For Dailymail.Com"], "date_download": "2024-02-05 15:20:24", "date_modify": "None", "date_publish": "2024-01-02 22:33:59", "description": "The Jewish family who was targeted with foul-mouthed harassment in a New Jersey mall has spoken out in an exclusive interview with DailyMail.com after video went viral.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12920501%2Fantisemitism-Jewish-American-Dream-Mall-New-Jersey.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/02/22/79551199-0-image-m-16_1704234821949.jpg", "language": "en", "localpath": null, "maintext": "The Jewish family who was targeted with foul-mouthed harassment in a New Jersey mall has spoken out in an exclusive interview with DailyMail.com after shocking video of the incident went viral.\nOn New Year's Day, mother Adi Vaxman was with her husband and two of their children, ages 12 and 16, at the American Dream Mall in East Rutherford, where the family hoped to play a round of mini-golf.\nAs they walked through the dense holiday crowds, a young man and woman began hurling obscenities at her daughter, who was wearing a jacket with the logo of the Israeli Defense Forces, which had been a gift from the girl's veteran grandfather.\n'We hear a man calling and screaming, \"free Palestine, f*** Israel, f*** you, you w**re\" — \"you b***h,\" he was calling my daughter,' Vaxman recalled in a phone interview on Tuesday.\n'The crazy thing is that the mall was packed, and there were dozens of people kind of in a circle around us watching. Just watching. Nobody said anything. Nobody did anything. Nobody called security,' she added.\nMother Adi Vaxman is speaking out after her family was subjected to anti-Jewish harassment over her daughter's IDF jacket, a gift from her grandfather. Pictured, left to right: 16-year-old daughter Maya Vaxman-Magid (wearing the jacket), mother Adi Vaxman, father Ronen Magid, 12-year-old son Ethan Vaxman-Magid, and their older son Tavorr Vaxman-Magid\nVideo first shared on X by the watchdog group StopAntisemitism shows part of the disturbing confrontation, with a young woman and man both screaming obscenities at the Jewish family.\nVaxman said that a clip that shows her phone falling to the ground came after the female aggressor tried to 'punch' her and hit her phone instead, knocking it from her hand.\nShe said that her family quickly left the mall without calling police or security, after the incident deeply unsettled their son and teen daughter, whom she says 'couldn't sleep all night' and was 'very shaken'.\n'Our family is all IDF veterans, so we're very proud of it,' Vaxman said of the jacket her daughter was wearing, noting that her brother and cousin had both been called up from the IDF reserves in Israel's ongoing war with Hamas in Gaza.\n'We are proud of standing up for who we are and what's important to us, and nobody will take that away from us. No one,' added the mom, who founded a non-profit dedicated to supporting IDF troops following the October 7 attacks by Hamas.\n'My grandparents are Holocaust survivors and they had to hide — I'm not hiding,' she said, explaining the family's decision to speak out publicly after the ordeal.\n'Nobody has the right to tell me what to wear and what not to wear. Nobody needs to cause me to hide my Jewish identity,' she added. 'We don't just walk around attacking people who are wearing 'Free Palestine' shirts, but they're walking around attacking us.'\n'They have no right to attack anyone,' she said. 'Nobody's entitled to be violent. Nobody's entitled to go after other people's freedom.'\nA Jewish family of four was subjected to foul-mouthed harassment at the American Dream Mall in New Jersey, according to video of the incident shared by a watchdog group\nA representative for American Dream Mall did not immediately respond to an inquiry from DailyMail.com on Tuesday morning.\nStopAntisemitism Executive Director Liora Rez told DailyMail.com in a statement: 'Incidents like these contribute to a violent atmosphere that has propelled antisemitic hate crimes to new highs. They must be universally condemned if we are ever to return to public discourse that does not target or threaten Jews.'\nRez attributed the incident to the 'Free Palestine' movement, which she said 'has generated so much hatred and division in America that a Jewish family can't walk through a shopping mall without being accosted.'\nThe video of the incident posted on X shows the confrontation already underway, with a young man and woman screaming at the family.\n'Leave her alone, leave her alone!' the Jewish father is heard saying as he steps in between the Palestinian supporters and his family.\nThe Jewish mother, who appears to be filming the incident, is heard saying: 'You're attacking me, you attacked me and dropped my phone!'\nThe female aggressor responds: 'You're recording me without my permission! It's free Palestine 'til I f***ing die b***h! Free Palestine 'til I f***ing die b***h! Free Palestine, you should be embarrassed you're supporting genocide!'\nThe Jewish father is seen herding his family away from the abusive rant, and shouting back 'What genocide?'\n'Leave her alone, leave her alone,' the dad is heard saying. 'Leave this s**t alone.'\nThe Jewish mother chimes in: 'You're cursing my child! You're cursing my child!'\n'I'm cursing you,' says the male harasser. 'I'm cursing you and your bulls**t husband.'\nThe female harasser goes on to say she is also a minor. The confrontation devolves into a screaming match that is difficult to clearly hear, as the Jewish mother questions whether the harassers have ever been to the Palestinian territories.\n'There's no such thing as Palestine, it's a made up lie!' the Jewish mother is heard shouting before the video clip ends.\n'Free Palestine 'til I f***ing die b***h!' a young woman is heard screaming at the family in the video\nThe disturbing incident is the latest example of flaring tensions in the US since Hamas launched its October 7 attack on Israel, killing about 1,200 and taking hundreds more hostage.\nIsrael responded with air strikes and a ground invasion of Gaza, which the enclave's Hamas-led health ministry says has killed at least 22,000.\nIsraeli airstrikes have reduced much of the territory to rubble and engulfed its 2.3 million residents in a humanitarian crisis, in which many thousands have been left displaced and threatened by famine due to a lack of food supplies.\nIn the US, the Justice Department has said it was monitoring rising threats against Jews and Muslims in the United States due to soaring levels of antisemitism and Islamophobia linked to the war in the Middle East.\nIn early December, FBI Director Christopher Wray said the threat level was so elevated that he saw 'blinking lights everywhere.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Jewish family targeted by anti-Semitic abuse in New Jersey's American Dream Mall over teen daughter's IDF jacket say 'dozens' of bystanders stood by just WATCHING as they were attacked", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12920501/antisemitism-Jewish-American-Dream-Mall-New-Jersey.html?ns_mchannel=rssns_campaign=1490ito=1490"}