{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:20:26", "date_modify": "None", "date_publish": "2024-01-01 12:26:43", "description": "Xi called China and U.S. forming ties 'a major event' in the history of bilateral relations and in international relations while also issuing a stark warning about the future of Taiwan.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12916189%2Fxi-jinping-china-congratulates-president-biden-peace-taiwan-reunification.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/01/12/79503357-0-image-a-8_1704111823568.jpg", "language": "en", "localpath": null, "maintext": "China's President Xi Jinping exchanged congratulations with U.S. President Joe Biden on the 45th anniversary of diplomatic ties between the two countries while also issuing a stark warning that Communist nation would 'surely be reunified' with Taiwan.\nXi, in his message, said both countries have 'weathered the storms and moved forward in general', which has enhanced the well-being of their peoples and contributed to world peace, stability and prosperity, according to the ministry statement.\nXi called China and U.S. forming ties 'a major event' in the history of bilateral relations and in international relations.\nThe president went on to say that China would 'surely be reunified' with Taiwan during his televised New Year's address, renewing Beijing's threats to take over the self-ruled island, which it considers its own.\nTaiwan split from China amid civil war in 1949, but Beijing continues to regard the island of 23 million with its high-tech economy as Chinese territory and has been ramping up its threat to achieve that by military force if necessary.\nThe U.S. is due its presidential election in November, in which former president and outspoken critic of China Donald Trump is campaigning against Biden to come back for a second term\nXi called China and U.S. forming ties 'a major event' in the history of bilateral relations and in international relations\nIn this file photo released by the Taiwan Ministry of National Defense, Taiwanese navy ship Keelung, foreground, a U.S. made Kidd Class destroyer, monitors the Chinese aircraft carrier Shandong, background, near the Taiwanese waters in September 2023\n'China will surely be reunified, and all Chinese on both sides of the Taiwan Strait should be bound by a common sense of purpose,' Xi said in his annual address, according to the official Xinhua News Agency.\nTaiwan's citizens go to the polls in two weeks in order to elect a new leader.\nChina-U.S. ties have been frosty but Biden administration officials have visited Beijing and met with their counterparts to rebuild communications and trust in the months leading up to a high-stakes summit between Xi and Biden in San Francisco in November, deemed an opportunity to cool tensions between the world's two largest economies.\nXi said the summit has pointed out the direction for both nations' ties, under a future-oriented vision.\n'I am willing to work with President Biden to continue to steer and navigate the China-U.S. relationship for the benefit of China and the U.S. and the two peoples, and to promote the cause of world peace and development,' Xi said.\nThe U.S. is due its presidential election in November, in which former president and outspoken critic of China Donald Trump is campaigning against Biden to come back for a second term.\nXi also exchanged New Year's messages with North Korea leader Kim Jong Un, and both announced 2024 to be a 'friendship year' for both countries, launching a series of activities for that, the Chinese foreign ministry said separately.\nXi said China is willing to work with North Korea to deepen strategic mutual trust, enhance exchanges and cooperation, promote greater bilateral ties and make new contributions to the maintenance of peace and stability in the region.\nOn New Year's Eve, the Chinese leader exchanged greetings with Russian President Vladimir Putin as well. This year is the 75th anniversary of China and Russia establishing diplomatic relations.\nRussia's economic reliance on China has grown as the country becomes increasingly isolated, hit by sanctions especially from Western countries since its invasion of Ukraine, a war which will enter its third year come February.\nXi said China and Russia should 'continuously consolidate' and develop ties 'featuring permanent good-neighbourly friendship', along with comprehensive strategic coordination and mutually beneficial cooperation that would serve both countries' interests.\nThis year marks the 75th anniversary of the founding of the People's Republic of China by Mao Zedong, who defeated Republic of China forces led by Chiang Kai-shek in a bloody civil war.\nMao declared the People's Republic of China on Oct. 1, 1949, while Chiang's government fled into exile in Taiwan in December of that year. No peace treaty has ever been signed to end the war and the Republic of China remains Taiwan's formal name.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Xi Jinping congratulates Biden saying he wants to 'promote world peace' with America as the two countries mark 45 years of diplomatic ties a day after warning China's reunification with Taiwan is 'ine", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12916189/xi-jinping-china-congratulates-president-biden-peace-taiwan-reunification.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}