{"authors": ["Reged Ahmad", "Maya Yang", "Yang Tian"], "date_download": "2024-02-05 15:20:27", "date_modify": "None", "date_publish": "2024-01-01 01:19:58", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F31%2Fisrael-gaza-war-live-netanyahu-targets-control-of-gaza-egypt-border-in-many-months-of-war-on-hamas.json", "image_url": "https://i.guim.co.uk/img/media/b3c91bd4e1afae86a43d6e18f8dfbf80c4ef585e/0_319_5479_3288/master/5479.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=746d41ca5f851607e00c4ab472b080bd", "language": "en", "localpath": null, "maintext": "From 31 Dec 2023 15.56 CET Israeli minister calls for return of Jewish settlers to the Gaza Strip after the war Israel’s finance minister, Bezalel Smotrich, has called for the return of Jewish settlers to the Gaza Strip after the war and said Gaza’s Palestinian population should be encouraged to emigrate, according to AFP. “To have security, we must control the territory,” Smotrich told Israel’s Army Radio in response to a question about the prospect of re-establishing settlements in Gaza. “In order to control the territory militarily for a long time, we need a civilian presence.” The Israeli government under Benjamin Netanyahu has not officially suggested plans to evict Gazans or to send Jewish settlers back to the territory since the war broke out on 7 October. Israel unilaterally withdrew the last of its troops and settlers in 2005, ending a presence inside Gaza that began in 1967, but maintained near complete control over the territory’s borders. All settlements on occupied Palestinian land are regarded as illegal under international law, regardless of whether they were approved by Israel.\nUpdated at 16.00 CET\n1 Jan 2024 02.16 CET Bethan McKernan At least 100 people have been killed in Gaza in the past 24 hours, as the three-month-old conflict between Israel and Hamas rolls into the new year with no end in sight and only tentative Israeli government plans for discussing the day after the war is over. The Hamas-run territory’s health authority said about 48 people were killed overnight on Sunday in heavy Israeli bombing of Gaza City, where pockets of fierce fighting are ongoing despite claims by the Israel Defense Forces that the north of the blockaded exclave is largely under Israeli operational control. Another strike killed 20 people sheltering at al-Aqsa University in the west of Gaza City, witnesses said. Read the rest of Bethan McKernan’s full report here: Israeli airstrikes kill scores in Gaza as war enters a new year Read more\n1 Jan 2024 01.57 CET Thomas White, the Director of UNRWA Affairs – Gaza, has posted video on X of a large crowd of people converging on an aid convoy this week. He says “40% of the population at risk of famine … more regular supplies needed”. People are hungry and just desperate for food @UNRWA convoy in #Gaza City this week.\n40% of the population at risk of famine.\nMore regular supplies needed - require safe and sustainable #humanitarain access everywhere including to the North of Gaza pic.twitter.com/ylZ3ors6RN — Thomas White (@TomWhiteGaza) December 30, 2023\n1 Jan 2024 01.35 CET Reged Ahmad here, taking over the blog from Maya Yang. A former member of prime minister Benjamin Netanyahu’s Cabinet has offered a rare public apology, Associated Press reports. The news agency says Galit Distel Atbaryan, a lawmaker from Netanyahu’s Likud Party, appeared to accept responsibility for the polarised atmosphere ahead of the 7 October attack. “I’m here sitting and telling you, the democratic, secular public: I sinned against you, I caused pain for you, I caused you to fear for your lives here, and I am sorry for this,” she told Channel 13 TV. Distel Atbaryan appeared to accept the argument that the internal divisions created perceptions of weakness that encouraged Hamas to attack, AP reports. Distel Atbaryan added that she was taking responsibility for her role in the massive protests and civil discord that erupted after Netanyahu’s right-wing government attempted to implement a far-reaching overhaul of the judicial system.\nUpdated at 02.04 CET\n31 Dec 2023 00.45 CET While the world marks the new year, in Gaza the war dominates everything. The Associated Press reports that displaced Palestinians found little to celebrate on New Year’s Eve in Muwasi, a makeshift camp in a mostly undeveloped area of southern Gaza’s Mediterranean coast designated by Israel as a safe zone. “From the intensity of the pain we live, we do not feel that there is a new year,” said Kamal al-Zeinaty, huddled with his family around a fire inside a tent. “All the days are the same.” Another relative, Zeyad al-Zeinaty, who fled with the family from the Jabaliya refugee camp in northern Gaza, said his wife, brother and grandchildren are among many relatives he has lost in the war. View image in fullscreen A Palestinian displaced by the Israeli bombardment of the Gaza Strip pours tea at the makeshift tent camp in the Muwasi area on Sunday, Dec. 31, 2023. Photograph: Fatima Shbair/AP\n31 Dec 2023 00.26 CET It is 1.25am on New Year’s Day in Israel and Gaza. Just after midnight, Hamas militants fired a barrage of rockets, setting off air raid sirens in southern and central Israel. No injuries were reported. View image in fullscreen Israel's Iron Dome anti-missile system intercepts rockets launched from the Gaza Strip, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Ashkelon, Israel, January 1, 2024 Photograph: Amir Cohen/Reuters\n31 Dec 2023 23.53 CET Summary Here is where things stand: The Israeli military will release some reservists who were called to join Israel’s war in Gaza, Reuters reports. “Some of the reservist soldiers will return to their families and their jobs already this week,” said military spokesperson rear admiral Daniel Hagari.\nSeveral pro-Palestine groups around the world calling for a ceasefire in Gaza where Israeli forces have killed over 21,600 Palestinians have united in what they call a “#countdown2ceasefire” ahead of the new year. In several posts on X, the group posted pro-ceasefire rallies to be held globally as countries gear up for the new year’s eve countdown.\nWorld Health Organization representatives visited Nasser Medical Complex in Khan Younis on Sunday to assess the needs of the overwhelmed health facility, WHO chief Tedros Ghebreyesus said. In a tweet on Sunday, Tedros addred that the Nasser Medical Complex is one of only two key functioning hospitals in southern Gaza that is able to provide medical care for wounded and other patients.\nCori Bush, a US Democratic representative of Missouri, has joined a handful of Democrats in criticizing the Joe Biden’s administration for bypassing congressional review in its transfer of weapons to Israel. Over the weekend, Bush tweeted: “The White House cannot have it both ways: calling on the Israeli government to uphold international law while bypassing Congress to send weapons that are leading to violations of international law. How many innocent people must die before @POTUS will demand a ceasefire?”\nPalestine’s ambassador to the UK said that the world wants to discuss the “day after Israel’s aggression on Gaza but it’s the day before we need to understand”. In an interview with Democracy Now, Husam Zomlot said: “Everybody now is wanting us to discuss the day after. No. The day before. The day before 7 October. The occupation, the colonisation, the racism, the supremacy, the murders all over the West Bank, the provocations in Jerusalem, the rounding and arresting of our children without trial, without charge, without access to their parents or lawyers, this is what needs to be discussed.”\nThe Palestinian foreign minister has released a statement before the new year in which he condemned what he called the “Israeli war machine’s persistence in the war of genocide”. In a statement on X, Riad Malki wrote: “We welcome the new year and the 59th anniversary of the start of the Palestinian revolution, yet the wounds of our people are bleeding due to Israeli war machine’s persistence in the war of genocide, destruction, and displacement.”\nApproximately 1.4 million Palestinians who have been displaced by Israeli strikes are living in UNRWA facilities across the Gaza Strip, the UNRWA spokesperson Juliette Touma said. She told the BBC: “The facilities in the north are becoming crowded by the hour, people continue to come in. They are absolutely full and so people have started taking refuge in areas outside these facilities including in parks, in the open. Many are sleeping in their cars.”\nThis post was amended on 1 January 2024 because an earlier version incorrectly described Cori Bush as a US senator.\nUpdated at 13.21 CET\n31 Dec 2023 23.29 CET “While the world is crowded with New Year’s celebrations, the streets of southern#GazaStrip are crowded with displacement,” UNRWA said on Sunday. In a video posted on to X, the UN agency for Palestinian refugees showed Palestinians internally displaced due to Israel’s strikes seeking refuge in the southern part of the strip. While the world is crowded with New Year's celebrations, the streets of southern📍#GazaStrip are crowded with displacement. pic.twitter.com/YubraXxZmP — UNRWA (@UNRWA) December 31, 2023 Approximately 1.9 million Palestinians have been displaced from their homes as a result of Israel’s attacks on Gaza, with around 1.4 million sheltering in UNRWA facilities as they grapple with overcrowding and shortages in basic necessities including food, water and medical supplies.\n31 Dec 2023 22.34 CET Volunteers from the Palestine Red Crescent Society are operating at the PRCS medical point in Jabalia under flashlights amid Israeli bombardment in attempts to provide healthcare services. 👇This is how the Palestine Red Crescent volunteers work at the PRCS medical point in #Jabalia.\n📱🔦Using phone lights, they continue to provide healthcare services to the citizens in the northern #Gaza Strip.👏\n📷Photography by the volunteer: Yusuf Khader#HumantarianHeroes pic.twitter.com/TYRLfImhvZ — PRCS (@PalestineRCS) December 31, 2023 Palestinians across Gaza are facing severe shortages in basic necessities including food, water, medical supplies and fuel as a result of Israel’s deadly strikes across the strip, as well as a lack of continuous aid flow into the besieged territory.\n31 Dec 2023 21.03 CET The Israeli military will release some reservists who were called to join Israel’s war in Gaza, Reuters reports. “Some of the reservist soldiers will return to their families and their jobs already this week,” said military spokesperson rear admiral Daniel Hagari. “This will allow a significant relief for the economy, and will allow them to gather strength ahead of the coming activities in the next year, and the fighting will continue and we will need them,” he added.\n31 Dec 2023 20.23 CET Palestinian solidarity groups gear up for global NYE's '#Countdown2Ceasefire' Several pro-Palestine groups around the world calling for a ceasefire in Gaza where Israeli forces have killed over 21,600 Palestinians have united in what they call a “#countdown2ceasefire” ahead of the new year. In several posts on X, the group posted pro-ceasefire rallies to be held globally as countries gear up for the new year’s eve countdown: 🔥🇭🇺 HUNGARY IS ON BOARD 🇭🇺🔥\nJoin the telegram group to connect with the people there:https://t.co/FZ8Qs93qXp\nNOTES:\n- If you can't make it to the event in your country, DO NOT WORRY!\nYou can record your countdown moment from wherever you are and share it with us on social… pic.twitter.com/ncx9JFQWRI — #countdown2ceasefire (@c2ceasefire) December 31, 2023 🔥🇨🇦 CANADA IS ON BOARD 🇨🇦🔥\nNOTES:\n- If you can't make it to the event in your country, DO NOT WORRY!\nYou can record your countdown moment from wherever you are and share it with us on social media #countdown2ceasefire.\n- We are sharing the locations of the main events… pic.twitter.com/iBb3VT5VCc — #countdown2ceasefire (@c2ceasefire) December 31, 2023 🔥🇫🇮 FINLAND IS ON BOARD 🇫🇮🔥\nNOTES:\n- If you can't make it to the event in your country, DO NOT WORRY!\nYou can record your countdown moment from wherever you are and share it with us on social media #countdown2ceasefire.\n- We are sharing the locations of the main events… pic.twitter.com/mNjR6tGPvP — #countdown2ceasefire (@c2ceasefire) December 31, 2023 🔥🇹🇳TUNISIA IS ON BOARD 🇹🇳🔥\nNOTES:\n- If you can't make it to the event in your country, DO NOT WORRY!\nYou can record your countdown moment from wherever you are and share it with us on social media #countdown2ceasefire.\n- We are sharing the locations of the main events… pic.twitter.com/gLqDxdvix1 — #countdown2ceasefire (@c2ceasefire) December 31, 2023 🔥🇮🇩INDONESIA IS ON BOARD 🇮🇩🔥\nNOTES:\n- If you can't make it to the event in your country, DO NOT WORRY!\nYou can record your countdown moment from wherever you are and share it with us on social media #countdown2ceasefire.\n- We are sharing the locations of the main events… pic.twitter.com/oYCBCJFw9W — #countdown2ceasefire (@c2ceasefire) December 31, 2023\nUpdated at 21.41 CET\n31 Dec 2023 19.50 CET World Health Organization representatives visited Nasser Medical Complex in Khan Younis on Sunday to assess the needs of the overwhelmed health facility, WHO chief Tedros Ghebreyesus said. In a tweet on Sunday, Tedros addred that the Nasser Medical Complex is one of only two key functioning hospitals in southern Gaza that is able to provide medical care for wounded and other patients. Today in #Gaza, @WHOoPT colleagues Dr Husam Abuolwan and Dr Ayadil Saparbekov were working to support the health conditions of people affected by the conflict.\nThey visited the Nasser Medical Complex in Khan Younis to assess the needs of the overwhelmed health facility, one of… pic.twitter.com/PVpJQYnSpY — Tedros Adhanom Ghebreyesus (@DrTedros) December 31, 2023 Since October 7, human rights organizations including Human Rights Watch reported that “the Israeli military’s repeated, apparently unlawful attacks on medical facilities, personnel, and transport are further destroying the Gaza Strip’s healthcare system and should be investigated as war crimes.”\n31 Dec 2023 19.08 CET Cori Bush, a US Democratic representative of Missouri, has joined a handful of Democrats in criticizing the Joe Biden’s administration for bypassing congressional review in its transfer of weapons to Israel. Over the weekend, Bush tweeted: “The White House cannot have it both ways: calling on the Israeli government to uphold international law while bypassing Congress to send weapons that are leading to violations of international law. How many innocent people must die before @POTUS will demand a ceasefire?” The White House cannot have it both ways: calling on the Israeli government to uphold international law while bypassing Congress to send weapons that are leading to violations of international law.\nHow many innocent people must die before @POTUS will demand a ceasefire? https://t.co/1D3iVAkD9P — Cori Bush (@CoriBush) December 30, 2023 Bush’s comments come as Israel strikes have killed more than 21,600 Palestinians across Gaza since October 7. On Saturday, Tim Kaine, a Democratic senator representing Virginia, also condemned the Biden administration for bypassing Congress in its transfer of American munitions to Israel, saying, “Unnecessarily bypassing Congress means keeping the American people in the dark.” This article was amended on 1 January 2024 because an earlier version incorrectly described Cori Bush as a US senator.\nUpdated at 21.23 CET", "source_domain": "www.theguardian.com", "text": null, "title": "At least 100 people killed in Gaza in past 24 hours as conflict rolls into new year - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/31/israel-gaza-war-live-netanyahu-targets-control-of-gaza-egypt-border-in-many-months-of-war-on-hamas"}