{"authors": ["Emine Sinmaz"], "date_download": "2024-02-05 15:20:30", "date_modify": "None", "date_publish": "2024-01-01 12:17:14", "description": "Puder, an aspiring actor and film-maker, was found dead four days after the Hamas attack in Israel", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F01%2Fwe-live-on-7-october-hamas-victim-maya-puder-remembered-by-her-family.json", "image_url": "https://i.guim.co.uk/img/media/8371b053f28c2d15a18994af8894fd0cb6e90f01/0_62_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26d813e8caa1e69ed598265a124a29bd", "language": "en", "localpath": null, "maintext": "When Maya Puder went missing from the Supernova music festival in Israel on 7 October, her family prayed she was in hiding somewhere or had been kidnapped.\nThe 25-year-old aspiring actor and film-maker last messaged her parents at 8.01am to say she was sheltering from Hamas rockets.\nBut her family’s hopes were shattered four days later when they were told Maya had been found dead 20 metres away from a shelter.\n“It was devastating, all our hopes were crushed,” said Maya’s mother, Ayala Puder. “I’d never in my worst imagination thought about a situation where I’d have to bury my daughter, and to bury her under those circumstances of her being murdered so brutally. It’s beyond devastating.”\nView image in fullscreen Maya Puder was a second-year film student at Tel Aviv University. Photograph: Family photo\nMaya went to the festival at the Re’im kibbutz, three miles from the Gaza border, with her friends, Rotem, 25, who was found dead inside the shelter, and Lior, 25, who survived after hiding under a dead body for six hours.\nLior told Maya’s family that Hamas gunmen threw grenades inside the shelter where they were hiding to lure them out. He said Maya, a second-year film student at Tel Aviv University, escaped at the same time as him but he did not see what happened to her.\nAyala Puder, a 54-year-old British-Israeli interior designer, said: “The first four days that we were here sitting and waiting, it was like the time was not passing but yet it was going so fast. We were in turmoil; wanting her to be hiding somewhere, wanting her to be kidnapped, afraid of her being kidnapped.\n“We were going on a rollercoaster between having the hope of her being somewhere or kidnapped and the devastating thought of her being killed.”\nThe family’s worst fears came true on 11 October when officials informed them that Maya had been shot dead. “I don’t know how many gunshots because they wouldn’t tell us and we couldn’t see her before we buried her,” Puder said. “Because of the state of the body, they wouldn’t let us. They said that they did a DNA test and they’re 100% sure that it’s Maya.”\nShe said more than 2,000 people attended Maya’s funeral. “She was everyone’s best friend,” Puder said. “She was witty and funny. And as much as you can see, she was pretty on the outside, she was beautiful, but she was beautiful on the inside. She was a loving person.”\nPuder said she and Maya’s father, Avi, 57, and sisters Eliya, 24, and Halleli, 18, had been going through “the worst nightmare” since the attack on what some in Israel now refer to as Black Saturday.\n“Time has stood still. Every day we wake up to another hard day,” said Puder. “The whole family is not the same. We are not the way we were. For part of the day, we still live on 7 October, maybe 6 October, sometimes. And then the rest of the time we’re just trying to keep our head above water and trying to find the way to live our life the best we can.”\nView image in fullscreen Maya Puder’s mother said her daughter was ‘everyone’s best friend’. Photograph: Family photo\nShe said it had also been difficult for the family to watch the war play out and to hear about the three hostages who were killed by mistake by the Israel Defense Forces. “It’s so hard that we don’t see the end of this war. We feel like our family lost the war in the first hour,” Puder said.\nPolice have recently returned Maya’s phone after it was retrieved from the festival. It has been both painful and amusing for the family to go through Maya’s photographs, contacts and even the movie scripts she was working on.\nIn one script she wrote in the month before the Hamas attack, Maya had imagined a scene in which two friends were shot dead by terrorists on Israel’s Memorial Day.\n“I think she saw her death coming,” Eliya said. “In the script, there are gunshots and the main character sees her friend die and fall to the ground. Then she describes how the whole world is moving slowly but then she also gets shot, and all that is left of her is her phone.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘We live on 7 October’: Hamas victim Maya Puder remembered by her family", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/01/we-live-on-7-october-hamas-victim-maya-puder-remembered-by-her-family"}