{"authors": [], "date_download": "2024-02-05 15:20:31", "date_modify": "None", "date_publish": "2024-01-01 20:46:27", "description": "US naval forces have engaged with Houthi militants as part of deterence mission", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-aircraft-carrier-israel-war-b2471890.html.json", "image_url": "https://static.independent.co.uk/2024/01/01/20/Screen%20Shot%202024-01-01%20at%2012.17.45%20PM.png?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Navy’s USS Gerald R Ford Carrier Strike Group will journey from the Mediterranean back to its home port of Norfolk, Virginia, in the coming days, for the first time since the beginning of the Israel-Hamas war.\n“The Department of Defense continually evaluates force posture globally and will retain extensive capability both in the Mediterranean and across the Middle East,” the Navy said in a statement.\n“DoD will continue to leverage its collective force posture in the region to deter any state or non-state actor from escalating this crisis beyond Gaza,” it added.\nThe ships of the Marine Expeditionary Unit / Amphibious Ready Group remain in the region with a contingent of 2,000 Marines, according to defence officials.\nAnother group of warships are stationed in the Persian Gulf in an effort to prevent Hezbollah and Iran from further engaging in the conflict.\nThe Ford strike group, the Navy’s newest and largest, was nearing the end of its first deployment but was redirected to the Eastern Mediterranean Sea in October after Hamas attacked Israel.\nAt the time, Defense Secretary Lloyd Austin said the deployment was \"part of our effort to deter hostile actions against Israel or any efforts toward widening this war following Hamas’ attack on Israel.\"\nSince the outbreak of war, US naval vessels have engaged in clashes with Houthi militants.\nOn Sunday, a US Navy destroyer sank three boats of militants in the Red Sea, after they were fired upon when returning a distress call from a merchant ship, according to US Central Command.", "source_domain": "www.independent.co.uk", "text": null, "title": "US carrier strike group to return home for first time since Israel-Hamas war", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-aircraft-carrier-israel-war-b2471890.html"}