{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:20:31", "date_modify": "None", "date_publish": "2024-01-01 16:07:27", "description": "In announcing this latest escalation, an Iranian news agency stressed that the country's navy is committed to ending piracy in the Red Sea.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12916429%2FIranian-warship-red-sea-houthis.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/01/16/79506835-0-image-a-11_1704125242487.jpg", "language": "en", "localpath": null, "maintext": "Iran's Alborz warship has entered the Red Sea, the semi-official Tasnim news agency reported on Monday, at a time of soaring tensions on the key shipping route amid the Israel-Hamas war and attacks on vessels by forces allied to Tehran.\nTasnim did not give details of the Alborz's mission but said Iranian warships had been operating in open waters to secure shipping routes, combat piracy and carry out other tasks since 2009.\nYemen's Iran-backed Houthis have been targeting vessels in the Red Sea since November to show their support for the Palestinian Islamist group Hamas in its war with Israel.\nOn Sunday, the U.S. military said Sunday that its forces opened fire on Houthi rebels after they attacked a cargo ship in the Red Sea, killing several of them. 'We’re going to act in a self-defense going forward,' a White House official said.\nWhile Secretary of State for Defence Grant Shapps told The Daily Telegraph that the U.K. is considering strikes against the Houthi group.\nThe warship has made its way into the Red Sea through the south, close to the Gulf of Aden\nThe Alborz warship, shown during a military drill, earlier in 2023\nSecretary of State for Defence Grant Shapps told The Daily Telegraph that the U.K. is considering strikes against the Houthi group\n'We are willing to take direct action, and we won’t hesitate to take further action to deter threats to freedom of navigation in the Red Sea,' Shapps said.\nThe Telegraph report went on to say that the UK and US are working together on developing strategies on military strikes against the Houthis. It's been reported that the USS Gerald Ford aircraft carrier is en route to the Mediterranean.\nThat came as Foreign Secretary David Cameron told his Iranian counterpart Hossein Amir-Abdollahian that Tehran is also responsible for stopping the Houthi attacks.\nIn the wake of recent Houthi attacks, many major shipping companies have switched to the longer and more costly route around the Africa's Cape of Good Hope rather than pass through the Suez Canal, which handles about 12 percent of global trade.\nThe Alborz warship entered the Red Sea via the Bab al-Mandab Strait, Tasnim said, without saying when. There were unconfirmed reports on social media it arrived late on Saturday.\n'Following rising tensions in the Gaza war, there has been an acceleration in developments in the Gulf of Aden and the Bab al-Mandeb Strait,' the Tasmin report read.\nThe Alvand class destroyer had been a part of the Iranian navy's 34th fleet, alongside the Bushehr support vessel, and patrolled the Gulf of Aden, the north of the Indian Ocean and the Bab Al-Mandab Strait as far back as 2015, according to Iran's Press TV.\nThe U.S. Fifth Fleet said it could not speak for the Iranian Navy or comment on the unconfirmed reports of the Iranian vessel's movements.\nHouthi militants attacked a Maersk container vessel with missiles and small boats on Saturday and Sunday, prompting the company to pause all sailing through the Red Sea for 48 hours.\nThe head of Iran's Navy, Shahram Irani, was quoted in Iranian media on Dec. 2 saying that the Alborz was carrying out missions in the Red Sea.\nIran's Defense Minister, Mohammad Reza Ashtiani, said on Dec. 14 in reference to the Red Sea that 'nobody can make a move in a region where we have predominance.'\nIn a series of statements on Sunday, the U.S. Central Command said the crew of the USS Gravely destroyer first shot down two anti-ship ballistic missiles fired at the Singapore-flagged Maersk Hangzhou late Saturday, after the vessel reported getting hit by a missile earlier that evening as it sailed through the Southern Red Sea.\nFour small boats then attacked the same cargo ship with small arms fire early Sunday and rebels tried to board the vessel, the U.S. Navy said.\nNext, the USS Gravely and helicopters from the USS Dwight D. Eisenhower aircraft carrier responded to the Maersk Hangzhou’s distress call and issued verbal warnings to the attackers, who responded by firing on the helicopters.\nThe Houthis acknowledged that 10 of their fighters were killed in the confrontation and warned of consequences.\nIn Washington, a spokesman for the White House National Security Council sidestepped a question about the possibility of a preemptive strike against the Houthis to safeguard commercial shipping in the vital waterway.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Iranian warship 'enters Red Sea' amid soaring tensions after US sank three Houthi boats and Britain said it was 'considering air strikes' on rebels to stop attacks on merchant vessels", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12916429/Iranian-warship-red-sea-houthis.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}