{"authors": [], "date_download": "2024-02-05 15:20:33", "date_modify": "None", "date_publish": "2024-01-01 01:00:00", "description": "GameCentral looks at the upcoming year in video games, with release dates for Final Fantasy 7 Rebirth, Tekken 8, Hades 2, and many more.", "filename": "https%3A%2F%2Fmetro.co.uk%2F2024%2F01%2F01%2F2024-video-game-release-dates-every-new-game-coming-this-year-20020059%2F.json", "image_url": "https://metro.co.uk/wp-content/uploads/2023/09/ff7-rebirth-af71_1703346436.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "language": "en", "localpath": null, "maintext": "Final Fantasy 7 Rebirth – one of the biggest games of 2024 (Picture: Square Enix)\nGameCentral looks at the upcoming year in video games, with release dates for Final Fantasy 7 Rebirth, Tekken 8, Hades 2, and many more.\nThe problem with 2024 is that because publishers announced so few new games last year, we have less information than usual on what’s coming out this year. Microsoft and Sony were especially secretive and the only confirmed 2024 releases for either of them are two vague promises for Avowed and Hellblade 2.\nEven Nintendo is being very sketchy about what it has planned for the second half of the year, which may involve the Switch 2… or may not.\nAs usual, we’ve split our list up into those games that the publisher has confirmed for this year, those that are unconfirmed but reasonably likely, and those games that we either know for a fact aren’t out in 2024 or are otherwise very unlikely. Bear in mind that plans do change, but rarely in terms of bring things forward.\nConfirmed video games for 2024\n18 January – Prince Of Persia: The Lost Crown (XO/PS4/NS/XSX/PS5/PC)\nThe year starts off with the long-awaited reboot of Prince Of Persia, except… you don’t play as the Prince and it’s actually a Metroidvania. But it does still look good.\n26 January – Tekken 8 (XSX/PS5/PC)\nPitched as the highest tech fighting game ever made, this will have to be very good to compete with Street Fighter 6, but what we’ve seen of it so far looks very impressive.\n2 February – Suicide Squad: Kill The Justice League (XSX/PS5/PC)\nIt’s been a long, bumpy road for Rocksteady’s co-op live service shooter but it has started looking a little better in recent videos, but will that be enough to overcome its poor reputation?\n16 February – Skull And Bones (XSX/PS5/PC)\nBy comparison to this Suicide Squad’s development has been plain sailing. A multiplayer pirate sim a decade in the making and yet it’s still hard to fathom who it’s for, especially as Sea Of Thieves already exists.\n29 February – Final Fantasy 7 Rebirth (PS5)\nThe second part of the remake trilogy is the biggest PlayStation 5 exclusive currently scheduled and considering how well the first part turned out hopes are high that this finds a similarly satisfying balance between old and new.\n8 March – Unicorn Overlord (PS4/NS/XSX/PS5/PC)\nThe new game from the makers of Dragon’s Crown and 13 Sentinels, this tactical strategy game features Vanillaware’s typically gorgeous artwork and hopefully plays as good as it looks.\n20 March – Alone In The Dark (XSX/PS5/PC)\nAnother game that’s been delayed several times already. The original is the grandaddy of survival horror and the reboot is from the writer of Amnesia: The Dark Descent, which bodes well.\n22 March – Dragon’s Dogma 2 (XSX/PS5/PC)\nCapcom’s open world action role-player finally returns and it looks pretty much the same as the original, with its faux co-op options that replace human allies with AI-controlled pawns.\n22 March – Princess Peach: Showtime! (NS)\nThis may end up being the last major first party release for the Switch, as well as being only the second time Peach has had a major game to herself.\n22 March – Rise Of The Rōnin (PS5)\nIt doesn’t seem like there’s going to be a new Nioh game any time soon but this is from the same team and looks very promising, although it appears to be taking a more serious tone, inspired by Ghost Of Tsushima.\nQ1 2024 – S.T.A.L.K.E.R. 2: Heart Of Chornobyl (XO/XSX/PC)\nYou don’t have to ask why Ukrainian developer GSC Game World are taking so long with this but there is every reason to hope its mix of survival horror and first person action will be worth the wait.\n23 April – Eiyuden Chronicle: Hundred Heroes (XO/PS4/NS/XSX/PS5/PC)\nThe spiritual successor to Suikoden, by many of the people that worked on the originals, while will hopefully make up for years of disappointing official sequels.\n23 April – Tales Of Kenzera: ZAU (NS/XSX/PS5/PC)\nAnnounced at The Game Awards, this seems to be an interesting looking Metroidvania based on African mythology, and is apparently a very personal project for the developer.\n4 June – Destiny 2: The Final Shape (XO/PS4/XSX/PS5/PC)\nConsidering the problems going on at Bungie at the moment this needs to be a success, although either way it’s not clear what comes next, once it ends this chapter of the story.\nQ2 2024 – Hades 2 early access (PC)\nIt is only early access, and only on PC, but given the popularity of the original this is still going to end up as one of the most talked about games of the year.\n20 August – Black Myth: Wukong (XSX/PS5/PC)\nIt looks really good in terms of graphics but until we get a feel for how it plays, we’re still not sure what to make of this big budget take on Journey To The West.\n9 September – Warhammer 40,000: Space Marine 2 (XSX/PS5/PC)\nWarhammer is bigger than ever at the moment, so it’s going to be interesting to see how this fares, although hopefully it’s not quite as one note as the original.\nQ3 2024 – The First Descendant (XO/PS4/XSX/PS5/PC)\nFor a lot of these games we’ve only got a brief trailer to judge them by, but this turned heads at The Game Awards and is apparently a new looter shooter in the mould of Destiny.\n2024 – Avowed (XSX/PC)\nThe Outer Worlds maker Obsidian has been working on this Skyrim style role-player for years and we’ve still never seen more than a few seconds of footage, but it is supposed to be out this year.\n2024 – Senua’s Saga: Hellblade 2 (XSX/PC)\nMicrosoft has at least showed more of Hellblade 2, which is also due out this year and got a fairly extensive gameplay trailer at the recent Game Awards.\n2024 – Star Wars Outlaws (XSX/PS5/PC)\nUbisoft’s open world scoundrel simulator was supposed to be out earlier in the year but now seems like it’ll be lucky not to be delayed into 2025, but it did look good during its reveal last summer.\nPossible video games for 2024\nFable (XSX/PC)\nMicrosoft showed off a lot of games during its summer games showcase but was intentionally vague about the release dates. The best bet at the moment is that Fable won’t be out until 2025.\nElden Ring: Shadow Of The Erdtree (XO/PS4/XSX/PS5/PC)\nIt’s much harder to guess what’s going on with Elden Ring’s DLC, as while there are believable rumours about it coming out in February 2024 that would be strange given it wasn’t showcased at The Game Awards in December.\nAssassin’s Creed Infinity\nThere’s a bewildering number of Assassin’s Creed due out in the next few years but it seems the next one will be a samurai game currently codenamed Red. Whether it will launch as a standalone title or as part of hub game Infinity is unclear, but it has been rumoured for a late 2024 launch.\nUnlikely video games for 2024\nMarvel’s Wolverine (PS5)\nThe recent Insomniac Games cyberattack revealed that this is aiming for a 2026 release and the Venom spin-off for 2025, although there’s no guarantee those plans haven’t changed already.\nThe Witcher\nAlthough CD Projekt has several Witcher projects underway at the moment it seems the first one will be the remake of the original PC-only game. Since nothing has been seen of it yet it’s probably not coming out this year.\nThe Outer Worlds 2 (XSX/PC)\nAt one point it seemed like this was coming out before Avowed but now it seems to have been put on the back burner, as nothing has been heard about it in years.\nKingdom Hearts 4\nAfter an early flurry of teases, Square Enix hasn’t talked about this in a long while, which seems to rule out a 2024 launch, and probably 2025 as well – unless you’re being super optimistic.\nDragon Age: Dreadwolf\nBioWare has said there won’t even be any news on the new Dragon Age until 2024 so that seems to rule out a launch this year. The next Mass Effect is going to be even further off.\nNew Tomb Raider\nThe question here is not how the developer is getting on but how badly they’ve been hit by the job cuts at owner Embracer Group. They have been affected but what that’s going to do to the game’s release date is unknown.\nMetroid Prime 4\nThe only first party Switch game we can really guess at, and while the prevailing theory is that it’ll be a Switch 2 launch title that seems far too straightforward and logical for Nintendo.\nGhost Of Tsushima 2\nLikewise, we know nothing about Sony’s plans beyond Insomniac Games, but developer Sucker Punch has been recruiting for a sequel, so presumably it can’t be that far off.\nDeath Stranding 2 (PS5)\nHideo Kojima didn’t say anything about this at The Game Awards so it’s hard to say when it’ll be out, but we’d guess not this year. He also didn’t say much about OD but that also seems unlikely for 2024.\nMonster Hunter Wilds\nIt’s exciting to know a new Monster Hunter is on the way to the next gen consoles, but unfortunately Capcom made it clear it won’t be out until 2025.\nHalf-Life 3\nIs it still worth holding out any hope? Probably not, no.\nGTA 6 (XSX/PS5)\nC’mon, you know it’s not out until 2025, as much as we’d like to pretend there’s a chance it’ll be out this year.\nOther confirmed video games for 2024:\n19 January – The Last Of Us Part 2 Remastered (PS5)\n19 January – Another Code: Recollection (NS)\n24 January – Like A Dragon: Infinite Wealth (XO/PS4/XSX/PS5/PC)\n25 January – Apollo Justice: Ace Attorney Trilogy (NS)\n1 February – Granblue Fantasy: Relink (PS4/PS5/PC)\n2 February – Persona 3 Reload (XO/PS4/XSX/PS5/PC)\n8 February – Helldivers 2 (PS5/PC)\n13 February – Banishers: Ghosts Of New Eden (XSX/PS5/PC)\n14 February – Tomb Raider 1-3 Remastered Starring Lara Croft (XO/PS4/NS/XSX/PS5/PC)\n16 February – Mario Vs. Donkey Kong (NS)\n22 February – Pacific Drive (PS5/PC)\n23 February – Sons Of The Forest (PC)\n27 February – Shiren The Wanderer: The Mystery Of Serpentcoil Island (NS)\n28 February – Star Wars: Dark Forces Remaster (XO/PS4/NS/XSX/PS5/PC)\n28 February – Brothers: A Tale Of Two Sons Remake (XSX/PS5/PC)\n5 March – The Outlast Trials (XO/PS4/XSX/PS5/PC)\n8 March – Homeworld 3 (PC)\nQ1 – Contra: Operation Galuga (XO/PS4/NS/XSX/PS5/PC)\nQ1 – Penny’s Big Breakaway (NS/XSX/PS5/PC)\n30 April – Braid Anniversary Edition (XO/PS4/XSX/PS5/PC)\nEarly 2024 – Foamstars (PS4/PS5)\nEarly 2024 – Still Wakes the Deep (XSX/PS5/PC)\nEarly 2024 – Thank Goodness You’re Here! (NS/PS5/PC)\nQ1/Q2 – Clock Tower (XO/PS4/NS/XSX/PS5/PC)\nQ1/Q2 – Test Drive Unlimited Solar Crown (XSX/PS5/PC)\nQ2 – Earth Defense Force 6 (PS4/PS5/PC)\nQ2 – Shadow of the Ninja – Reborn (PS4/NS/XSX/PS5/PC)\nQ2/Q3 – Lollipop Chainsaw: RePOP\nQ3 – Flintlock: The Siege Of Dawn (XO/PS4/XSX/PS5/PC)\nQ3 – Luigi’s Mansion 2 HD (NS)\nQ4 – Vampire: The Masquerade – Bloodlines 2 (XSX/PS5/PC)\nQ4 – Ark 2 (XSX/PC)\nTBA – Frostpunk 2 (PC)\nTBA – GreedFall 2: The Dying World (XSX/PS5/PC)\nTBA – John Carpenter’s Toxic Commando (XSX/PS5/PC)\nTBA – Killer Klowns From Outer Space: The Game (XO/PS4/NS/XSX/PS5/PC)\nTBA – Little Nightmares 3 (XO/PS4/NS/XSX/PS5/PC)\nTBA – Microsoft Flight Simulator 2024 (XSX/PC)\nTBA – Paper Mario: The Thousand-Year Door (NS)\nTBA – Visions Of Mana (PS4/XSX/PS5/PC)\nTBA – The Casting Of Frank Stone (XSX/PS5/PC)\nTBA – Metaphor: ReFantazio (PS4/XSX/PS5/PC)\nTBA – The Plucky Squire (NS/XSX/PS5/PC)\nTBA – Earthblade (PC)\nTBA – Thrasher (PC/Quest)\nTBA – Replaced (XO/XSX/PC)\nTBA – Lost Records: Bloom & Rage (XSX/PS5/PC)\nTBA – World Of Goo 2\nTBA – Skate Story (PC)\nTBA – Zenless Zone Zero (PC/iOS/Android)\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nEmail gamecentral@metro.co.uk, leave a comment below, follow us on Twitter, and sign-up to our newsletter.\nMORE : Metro GameCentral video game review of 2023 – the best of times and the worst of times\nMORE : Metro Video Game Awards 2023 - GameCentral’s Best of the Year\nMORE : The 13 biggest video game news stories of 2023 - from GTA 6 to Switch 2\nFollow Metro Gaming on Twitter and email us at gamecentral@metro.co.uk\nTo submit Inbox letters and Reader’s Features more easily, without the need to send an email, just use our Submit Stuff page here.\nFor more stories like this, check our Gaming page.", "source_domain": "metro.co.uk", "text": null, "title": "2024 video game release dates: every new game coming this year", "title_page": null, "title_rss": null, "url": "https://metro.co.uk/2024/01/01/2024-video-game-release-dates-every-new-game-coming-this-year-20020059/"}