{"authors": ["Charlie Jones", "Image", "Afp Via Getty Images"], "date_download": "2024-02-05 15:14:57", "date_modify": "None", "date_publish": "2024-01-29 09:11:51", "description": "US forces are trying to figure out which group was behind the devastating drone attack that injured at least another 34 troops at a military site in Jordan near the Syrian border", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fjoe-biden-chilling-warning-will-31989923.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31989938.ece/ALTERNATES/s1200/0_US-POLITICS-VOTE-BIDEN.jpg", "language": "en", "localpath": null, "maintext": "US forces are trying to figure out which group was behind the devastating drone attack that injured at least another 34 troops at a military site in Jordan near the Syrian border\nPresident Joe Biden has vowed the US \"shall respond\" after three American troops were killed and dozens more were injured in an overnight drone strike in northeast Jordan near the Syrian border.\nBiden blamed Iran-backed militias for the first US fatalities after months of strikes by such groups against American forces across the Middle East since the start of the Israel-Hamas war.\nBiden, who was traveling in South Carolina, asked for a moment of silence during an appearance at a Baptist church's banquet hall.\n\"We had a tough day last night in the Middle East. We lost three brave souls in an attack on one of our bases,\" he said. After the moment of silence, Biden added: \"and we shall respond.\"\nRead more: Iran 'raises air defences to maximum readiness' amid chilling WW3 fears after drone attack\nImage: AFP via Getty Images) AFP via Getty Images)\nWith an increasing risk of military escalation in the region, US officials were working to conclusively identify the precise group responsible for the attack, but they have assessed that one of several Iranian-backed groups was behind it.\nBiden said in a written statement that the United States \"will hold all those responsible to account at a time and in a manner (of) our choosing.\" Defense Secretary Lloyd Austin said \"we will take all necessary actions to defend the United States, our troops, and our interests.\"\nIran-backed fighters in east Syria began evacuating their posts, fearing US airstrikes, according to Omar Abu Layla, a Europe-based activist who heads the Deir Ezzor 24 media outlet. He said that the areas are the strongholds of Mayadeen and Boukamal.\nImage: AFP via Getty Images) AFP via Getty Images)\nUS Central Command said at least 34 troops were injured by the one-way attack drone, with eight flown out of Jordan for follow-up care. It described the eight as being in stable condition.\nThe large drone struck a logistics support base in Jordan known as Tower 22. It is along the Syrian border and is used largely by troops involved in the advise-and-assist mission for Jordanian forces. Central Command said approximately 350 US Army and Air Force personnel were deployed to the base.\nThe three who were killed and most of the wounded were Army soldiers, according to several US officials, who spoke on condition of anonymity to give details not yet made public. The small installation, which Jordan does not publicly disclose, includes US engineering, aviation, logistics and security troops.\nImage: AFP via Getty Images) AFP via Getty Images)\nAustin said the troops were deployed there \"to work for the lasting defeat of ISIS.\" Three officials said the drone struck near the troops' sleeping quarters, which they said explained the high casualty count. The U.S. military base at al-Tanf in Syria is just 20 kilometers (12 miles) north of Tower 22.\nThe Jordanian site provides a critical logistical hub for US forces in Syria, including those at al-Tanf, which is near where the borders of Iraq, Syria and Jordan intersect. In a statement on Jordan's state-run Petra news agency, the country \"condemned the terrorist attack\" that targeted the US troops.\nThat report described the drone strike as targeting \"an outpost on the border with Syria\" and said it did not wound any Jordanian troops.\" Jordan will continue to counter terrorism and the smuggling of drugs and weapons across the Syrian border into Jordan, and will confront with firmness and determination anyone who attempts to attack the security of the kingdom,\" the statement attributed to Muhannad Mubaidin, a government spokesman, said.\nImage: AFP via Getty Images) AFP via Getty Images)\nUS troops long have used Jordan, a kingdom bordering Iraq, Israel, the Palestinian territory of the West Bank, Saudi Arabia and Syria, as a basing point. Some 3,000 American troops typically are stationed across Jordan. Since the war in Gaza began October 7, Iranian-backed militias have struck American military installations in Iraq more than 60 times and in Syria more than 90 times, with a mix of drones, rockets, mortars and ballistic missiles.\nThe attack Sunday was the first targeting American troops in Jordan during the Israel-Hamas war and the first to result in the loss of American lives. Scores of US personnel have been wounded, including some with traumatic brain injuries, during the attacks. The militias have said that their strikes are in retaliation for Washington's support for Israel in the war in Gaza and that they aim to push US forces out of the region.\nOn Monday, Iran's foreign ministry dismissed the US accusation that Tehran was behind the drone strike, according to the official IRNA news agency. It quoted ministry spokesman Nasser Kanaani as saying that the \"Islamic Republic of Iran has no role in decisions by resistance groups on how they support the Palestinian nation or defend their people.\"\nAn umbrella group for Iran-backed factions known as the Islamic Resistance in Iraq earlier claimed launching explosive drone attacks targeting three areas in Syria, as well as one inside of \"occupied Palestine.\" The group has claimed responsibility for dozens of attacks against bases housing U.S. troops in Iraq and Syria since the Israel-Hamas war began.\nThree officials with Iran-backed militias in Iraq said the drone attack against the base in Jordan was launched by one of the Iraqi groups. No faction has yet officially claimed responsibility. Officials said the U.S. military is not tracking any other attacks on its forces Sunday in the region.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Joe Biden in chilling warning US 'will respond' after 3 troops killed in Iran attack", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/joe-biden-chilling-warning-will-31989923"}