{"authors": ["Peter Stone"], "date_download": "2024-02-05 15:20:34", "date_modify": "None", "date_publish": "2024-01-01 11:00:30", "description": "Ex-president has made increasingly conspiratorial and authoritarian broadsides against prosecutors pursuing him", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2024%2Fjan%2F01%2Fdonald-trump-legal-problems-ex-president-strategy.json", "image_url": "https://i.guim.co.uk/img/media/92b50a2d1769e9b6ddd5be567d6b60067db97ab1/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f219a57478fa100dcbfb5940beada8e7", "language": "en", "localpath": null, "maintext": "As Donald Trump faces 91 felony counts with four trials slated for 2024, including two tied to his drives to overturn his 2020 election loss, his attacks on prosecutors are increasingly conspiratorial and authoritarian in style and threaten the rule of law, say former justice department officials.\nThe former US president’s vitriolic attacks on a special counsel and two state prosecutors as well as some judges claim in part that the charges against Trump amount to “election interference” since he’s seeking the presidency again, and that “presidential immunity” protects Trump for his multiple actions to subvert Joe Biden’s 2020 victory.\nBut ex-officials and other experts say Trump’s campaign and social media bashing of the four sets of criminal charges – echoed in ways by his lawyers’ court briefs – are actually a hodgepodge of conspiracy theories and very tenuous legal claims, laced with Trump’s narcissism and authoritarian impulses aimed at delaying his trials or quashing the charges.\nMuch of Trump’s animus is aimed at the special counsel Jack Smith, who has charged him with four felony counts for election subversion, and 40 felony counts for mishandling classified documents when his presidency ended.\nView image in fullscreen Jack Smith has been a frequent target of Trump’s ire. Photograph: Drew Angerer/Getty Images\nTrump’s chief goal in attacking Smith, whom he’s labelled a “deranged lunatic”, and other prosecutors and judges is to delay his trials well into 2024, or until after the election, when Trump could pardon himself if he wins, experts say.\nSimilarly, Trump has targeted the Fulton county district attorney, Fani Willis, who has brought a racketeering case in Georgia against Trump and 18 others for trying to overturn Biden’s win there, branding her a “rabid partisan”.\nRight before Christmas, Trump’s lawyers asked an appeals court in Washington to throw out Smith’s four-count subversion indictment, arguing that his actions occurred while he was in office and merited presidential immunity, and Trump in a Truth Social post on Christmas Eve blasted Smith for “election interference”.\nIn an 82-page brief rebutting Trump’s lawyers on December 30, Smith and his legal team wrote that Trump’s efforts to overturn the election results in 2020 “threaten to undermine democracy,” and stressed Trump’s sweeping immunity claims for all his actions while in office “threatens to license Presidents to commit crimes to remain in office.”\nFormer justice department officials say Trump’s rhetoric and tactics to tar prosecutors and judges are diversionary moves to distract from the serious charges he faces – especially for trying to subvert the 2020 election.\nDelay is his major strategic objective in all these cases … Trump’s constitutional objections to the trial-related issues are all frivolous Former Trump lawyer Ty Cobb\n“Claiming the federal criminal cases or the Georgia Rico action are election interference, and railing constantly about the character of the prosecutors, judges and others, is just a formulaic game to Trump,” Ty Cobb, a White House counsel during the Trump years and a former DoJ official, said.\n“Delay is his major strategic objective in all these cases. These criminal cases were started because of Trump’s criminal acts and his refusal to allow the peaceful transfer of government for the first time in US history. Trump’s constitutional objections to the trial-related issues are all frivolous including his claim of presidential immunity and double jeopardy.”\nCobb added that Trump’s “everyone is bad but me and I am the victim” rants, lies and frivolous imperious motions and appeals are just his “authoritarianism in service of his narcissism”.\nOther ex-officials offer equally harsh assessments of Trump’s defenses.\n“The reality is that Trump has clearly done a series of illegal things and the system is holding him to account for things that he’s done,” said the former deputy attorney general Donald Ayer, who served during the George HW Bush administration. “He’s telling more lies to mischaracterize prosecutions that we should be thankful for.”\nYet Trump keeps escalating his high-voltage rhetoric and revealing his authoritarian tendencies. Trump even bragged that Russian president Vladimir Putin in December echoed Trump’s charges of political persecution and election interference to bolster his claims.\n“Even Vladimir Putin … says that Biden’s – and this is a quote – ‘politically motivated persecution of his political rival is very good for Russia because it shows the rottenness of the American political system, which cannot pretend to teach others about democracy’,” Trump told a campaign rally in Durham, New Hampshire.\nFor good measure, Trump complimented two other foreign authoritarian leaders, calling Hungary’s prime minister, Viktor Orbán, “highly respected” and North Korean dictator Kim Jong-un “very nice”.\nView image in fullscreen Fani Willis is prosecuting Trump and 18 others in Georgia for charges related to election subversion. Photograph: John Bazemore/AP\nIn November Trump sparked fire for slamming his opponents on the left as “vermin”, a term that echoed Adolf Hitler’s language, and the ex-president has more than once pledged in authoritarian style to appoint a special prosecutor to “go after” Biden and his family.\nLikewise, critics have voiced alarm at Trump’s vow of “retribution” against some powerful foes in both parties if he’s re-elected, including ex-attorney general Bill Barr. That pledge fits with Trump painting himself a victim of a vendetta by “deep state” forces at the justice department, the FBI and other agencies Trump and his allies want to rein in while expanding his executive authority, if he’s the Republican nominee and wins the presidency again.\nskip past newsletter promotion Sign up to Trump on Trial Free newsletter Stay up to date on all of Donald Trump’s trials. Guardian staff will send weekly updates each Thursday – as well as bonus editions on major trial days. Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nCritics say Trump’s attacks on the prosecutions are increasingly conspiratorial.\n“Of course, it’s true that Trump is the undisputed master of election interference, so he certainly knows the field,” Democratic congressman Jamie Raskin, a leading Trump critic in the House, said.\n“It’s hard to think of a greater case of election interference than what Trump did in 2020 and 2021. His claim of election interference is meant to give him a kind of political immunity from the consequences of his criminal actions.\n“He’s basically inviting the public to believe that the legal system’s response to his stealing government documents or trying to overthrow an election are illegal attempts to interfere with his political career.”\nRaskin noted there was some Trump-style logic to citing Putin in his defense.\n“We know Putin is Trump’s hero and effective cult master,” the congressman said. “So it makes sense that Trump would try to elevate him as a kind of moral arbiter. Trump would love a world where Vladimir Putin would decide the integrity of elections and prosecutions. Wouldn’t that be nice for the autocrats?”\nTrump’s modus operandi to stave off his trials is emblematic of how he has operated in the past, say some ex-prosecutors.\n“Trump has a habit of picking up allegations made against him and, like a kid in the playground, accusing the critics of doing the same thing”, such as crying “electoral interference”, said the Columbia law professor and former federal prosecutor Daniel Richman.\nRichman stressed that “I wouldn’t assume Trump is trying to mimic other authoritarians. He just shares their values, or the lack of them.”\nOther scholars see Trump’s desperate defenses and incendiary attacks on the legal system as part of his DNA.\nTrump feels entirely emboldened by his supporters. He’s been given license by the Republican party to go as far as he wants Congressman Jamie Raskin\n“The Trump team is looking to cobble together a defense for the indefensible,” said Timothy Naftali, a senior research scholar at Columbia’s School of International and Public Affairs. “Trump has long been looking for and finding ways to protect himself whenever he crosses legal lines. This is who he is.”\nNaftali suggested: “Trump announced his second re-election bid much earlier than is traditional for major candidates. A likely reason why he announced so early – and then hardly campaigned for a long time – was to pre-empt any indictments so that he could later denounce them as ‘election interference’ and perhaps undermine any future trials. This is a man who lies and creates a reality most favorable to him.”\nMore broadly, Raskin views Trump’s attacks on the legal system as hallmarks of fascist rulers.\n“Fascism is all about the destruction of the rule of law in the service of a dictator. It’s important for Trump to continue to attack our essential legal institutions. He’s also gotten to the point of dehumanizing his opponents by using words like ‘vermin’. Violence permeates his rhetoric,” he said.\n“Trump feels entirely emboldened by his supporters. He’s been given license by the Republican party to go as far as he wants.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘A formulaic game’: former officials say Trump’s attacks threaten rule of law", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2024/jan/01/donald-trump-legal-problems-ex-president-strategy"}