{"authors": ["Gavin Blair"], "date_download": "2024-02-05 15:20:36", "date_modify": "None", "date_publish": "2024-01-01 20:27:28", "description": "Major tsunami warnings downgraded but residents in coastal areas told not to return to homes", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F01%2Fjapan-issues-major-tsunami-warning-for-coastal-prefecture-after-76-magnitude-earthquake.json", "image_url": "https://i.guim.co.uk/img/media/10d3fe792040e29caf0902ec7ac4d592249a5d99/0_140_3645_2187/master/3645.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=30d69414d5b1da822c8d8118e9e8a0df", "language": "en", "localpath": null, "maintext": "A powerful earthquake has struck central Japan’s western coastline, triggering waves over a metre high and prompting tsunami alerts and warnings for people to evacuate.\nThe quake, which is estimated to have been magnitude 7.6, struck the Noto peninsula in Ishikawa prefecture on the main central island of Honshu at about 4.10pm local time (07.10 GMT). It knocked out power to tens of thousands of homes and disrupted flights and rail services.\nOfficials in Ishikawa prefecture confirmed four fatalities early Tuesday, according to the Kyodo news agency. In Wajima city, close to the epicentre, people were reported to have been buried beneath the rubble of houses that collapsed. A large fire in the city engulfed a row of houses, with people being evacuated in the dark. Local hospitals reported a number of injured people arriving for treatment, though damaged roads were hampering the transport of patients.\nThe Japan Meteorological Agency (JMA) said dozens of quakes of at least magnitude 3.5 hit the region between between 4pm and 7.30pm. The JMA initially issued a major tsunami warning for Ishikawa and lower-level tsunami warnings or advisories for the rest of Honshu, as well as the northernmost of Japan’s main islands, Hokkaido. The warning was downgraded to a regular tsunami several hours later, meaning the waters could still reach up to 3 metres (10 feet).\nThe US Pacific Tsunami Warning Center, which had warned of possible tsunamis along 190 miles of coast, said about four hours after the 7.6-magnitude quake that the tsunami danger had “largely passed”.\nView image in fullscreen People walk along a damaged road in Wajima, Ishikawa prefecture. Photograph: Kyodo/Reuters\nAuthorities in Japan were still assessing the extent of the damage and people needed to prepare for more tremors, the Japanese prime minister, Fumio Kishida, said.\n“Residents need to stay on alert for further possible quakes and I urge people in areas where tsunamis are expected to evacuate as soon as possible,” he said. Buildings shook 190 miles (300km) away in Tokyo.\nThe NHK broadcaster had issued warnings urging people to evacuate quickly to higher ground and to beware of aftershocks and further tsunamis.\nA Tokyo resident visiting her hometown of Takaoka, a city directly south of the worst-affected Noto peninsula, for the new year holiday, said: “We’re not that close to the coast so tsunamis are not a worry but the aftershocks just keep coming and shaking the whole house, it’s terrifying.”\nA government spokesperson, Hayashi Yoshimasa, said people should prepare for possible further quakes and that the Japan Self-Defense Forces were being readied for deployment to help with rescue and recovery efforts.\nView image in fullscreen A US Geological Survey map shows the location of the earthquake in Ishikawa prefecture, western central Japan. Photograph: USGS/EPA\nFootage broadcast by NHK appeared to show buildings collapsing in Ishikawa. More than 36,000 households lost power in Ishikawa and Toyama prefectures, according to the utilities provider Hokuriku Electric Power.\nHigh-speed rail services to Ishikawa have been suspended while the telecoms operators SoftBank and KDDI reported phone and internet service disruptions in Ishikawa and Niigata prefectures, according to their websites.\nThe Japanese airline ANA turned back planes headed to airports in Toyama and Ishikawa, while Japan Airlines cancelled most of its services to Niigata and Ishikawa regions. Authorities said one of Ishikawa’s airports was closed.\nJapan has strict construction regulations intended to ensure buildings can withstand strong earthquakes and routinely holds emergency drills to prepare for a major jolt.\nEarthquakes that strike off the Sea of Japan coast are known to cause tsunamis that can reach the shore in less than 10 minutes, faster than those on the Pacific coast. The magnitude 9 quake of 2011 triggered a tsunami that took approximately 30 minutes before it hit the coastline.\nJapan’s Nuclear Regulation Authority said no irregularities had been reported at nuclear power plants along the Sea of Japan, including five active reactors at Kansai Electric Power’s Ohi and Takahama plants in Fukui prefecture. There are 22 reactors at six facilities spread across the affected coastline.\nHokuriku’s Shika plant in Ishikawa, which was the closest to the quake’s location, had already halted its two reactors for a regular inspection before the quake and experienced no impact from it, the agency said.\nJapan is one of the most quake-prone country on the planet. A huge earthquake and tsunami that struck the north-east of the country on 11 March 2011 killed 18,000 people. The disaster devastated towns and triggered nuclear meltdowns at the Fukushima Daiichi plant. Nearly all of Japan’s nuclear power plants have been mothballed since the disaster.\nReuters and Agence France-Presse contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "Japan orders people to evacuate after 7.6-magnitude quake hits west coast", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/01/japan-issues-major-tsunami-warning-for-coastal-prefecture-after-76-magnitude-earthquake"}