{"authors": ["Iona Cleave"], "date_download": "2024-02-05 15:20:37", "date_modify": "None", "date_publish": "2023-12-31 10:14:31", "description": "US Navy helicopters sank three Houthi rebel boats attacking a cargo ship in the first reported deadly clash between the US and the Iranian terror prox", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25206924%2Ffirst-us-houthis-choppers-sink-boats-red-sea%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/2023-top-commander-u-s-868963316.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "US Navy helicopters sank three Houthi rebel boats attacking a cargo ship in the first reported deadly clash between the US and the Iranian terror proxy.\nThe US military scrambled the choppers early this morning after a Maersk container vessel sent out distress calls that the Houthis were firing at the ship.\n6 It is the first reported deadly clash between the US and the militia group in the Red Sea Credit: AP\n6 The moment before the Houthis attacked and seized the Galaxy Leader cargo ship in late November Credit: Reuters\nIn the biggest confrontation between the US and the Houthis since the Israel-Hamas war broke out, helicopters from the USS Eisenhower and USS Gravely returned fire on the Houthi boats \"in self-defence\".\nAll militants onboard the three sunken ships were killed, while a fourth boat fled.\nThe US Central Command said: \"The small boats fired upon the U.S. helicopters with crew served weapons and small arms.\n\"The U.S. Navy helicopters returned fire in self-defense, sinking three of the four small boats, and killing the crews. The fourth boat fled the area.\n\"There was no damage to U.S. personnel or equipment.\"\nIt was the second attack on Maersk Hangzhou, which is registered to Singapore, in 24 hours after missiles were fired at it on Saturday.\nMaersk confirmed the crew had reported a flash on deck, but stated the crew is now \"safe\" and that the boat had continued its journey to Port Suez.\nHowever, the shipping company - one of the world's largest - has paused its sailings through the Red Sea for 48 hours.\nHouthi military spokesman Yahya Saree on Sunday said ten members of the rebel group had been killed by the US.\nSaree also vowed that the US would \"bear the consequences\" of the attack.\nThe group also vowed that any other countries who threaten them, like America, could face \"negative repercussions\".\nYemen's Houthi rebels have been wreaking havoc in the Red Sea as they have vowed to attack all ships that may be headed to or from Israeli ports in solidarity with Hamas.\nLast night, Britain and America last night moved closer to launching air strikes on the rebels who are turning one of the world’s busiest shipping lanes into a war zone.\nDefence chiefs were in talks over a possible armed response on the militia's sites in Yemen that are being used to launch attacks on vessels.\nSources said eight of the 20 ships attacked in the 30 days before Christmas were either UK-registered, had Brits in their crew or carried goods for the UK.\nUnder a barrage of rocket and drone attacks, major shipping firms such as BP and Maersk are diverting vessels away from the Red Sea - sparking concerns the crisis will drive up the price of goods and inflation.\nDefence Secretary Grant Shapps warned: “Those terrorists who are disrupting trade in the Red Sea are drinking in the last chance saloon.\n“Diplomatic efforts have been made to find a resolution but with limited success.\n“We cannot allow one of the world’s key waterways that serves global trade to be held for ransom.\n“Attacks on commercial shipping with drones and missiles is an attack on all of us and the culture and freedoms we cherish.\"\nThe Houthis, which control large swaths of Yemen, have carried out over a 100 drone, missiles and hijacking assaults on ships travelling through the Red Sea.\nOver £1trillion worth of world trade is currently being held hostage as the emboldened militia group has pledged to continue their attacks until Israel's devastating offensive and bombardment of the Gaza Strip ends.\nThe US, UK and other at least eight countries have all sent warships into the increasingly troubled area in a show of force to attempt to regain stability of the waters.\nThe Red Sea forms the gateway to the world as it provides the only route for ships travelling between Asia and Europe without having to sail around southern Africa.\nIt can save up to 30 days at sea - but those who cross must pass through the \"Gate of Tears\", which got its name from the lethal nature of navigating through the tight strait.\nShips attempting to navigate the 20 mile-wide Bab el-Mandeb Strait are forced to sail dangerously close to the coast of Yemen - where Houthi rebels are now waiting to strike.\nRoughly 10 per cent of all global trade passes through it.\nThis morning's deadly confrontation between the Houthis and the US Navy marks a major escalation in the spiralling Red Sea crisis.\nThe Iran-backed terror proxy has previously directly challenged the US with a simple message - 'If you strike us, we will strike you right back'.\nIn late December, Houthi chief, Abdel-Malek al-Houthi, vowed to target American warships if President Biden orders missile strikes against its forces.\nHe also warned that US troops will face a warzone \"harsher than Vietnam\" if they dare step foot in Yemen.\nQ&A on Yemen's Houthi rebels WHO are the Houthis? SHIA Islamist rebels who are in control of much of western Yemen. They formed in the 1990s and are backed by Iran. Their slogan is “Death to America, Death to Israel, curse the Jews and victory to Islam”. WHY are they attacking ships? TO show support for Hamas following the outbreak of its war with Israel. On 19 November, the Houthis promised to target vessels they believe are heading to and from Israel. ARE they a danger to the UK? YES. The attacks disrupt global supply routes. Ships are sailing further which could see prices and inflation go up. Delays in natural gas shipments will force energy costs to rise\n6 USS Dwight D. Eisenhower was involved in today's sinking of three Houthi ships\n6 Iran-backed Houthi rebels are waging war in the Red Sea disrupting global trade\n6 The Houthi rebels have vowed to ferociously hit back at the US if any direct action is taken against them", "source_domain": "www.thesun.co.uk", "text": null, "title": "First deadly clash between US and Houthis as Navy choppers sink three terror boats KILLING militants storming cargo ship", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25206924/first-us-houthis-choppers-sink-boats-red-sea/"}