{"authors": ["Maya Yang", "Nicola Slawson", "Adam Fulton"], "date_download": "2024-02-05 15:20:38", "date_modify": "None", "date_publish": "2023-12-31 00:23:10", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F30%2Fisrael-gaza-war-live-hamas-palestinians-khan-younis-deaths-un-aid-us.json", "image_url": "https://i.guim.co.uk/img/media/4fa66ef3e666aaccf20a0e345fa76c6c5f47211b/646_18_3702_2222/master/3702.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=3bf92f297eb5288484358ff9c58c5ce8", "language": "en", "localpath": null, "maintext": "From 30 Dec 2023 15.12 CET 100,000 have fled to Rafah in recent days, UN says The UN Office for the Coordination of Humanitarian Affairs (OCHA) has told the BBC that it estimates that at least 100,000 people have moved into Rafah, the most southerly city in Gaza, in the last few days as fighting has intensified in and around Khan Younis and elsewhere. The displacement follows orders from Israeli forces urging civilians to flee parts of Gaza where Israel says Hamas has a stronghold. The OCHA says the influx of people has made overcrowding worse and put pressure on limited resources. Speaking from Rafah in southern Gaza, the director of UNRWA, the UN’s relief agency, Tom White told the BBC there are “well over a million people” seeking safety in the city. As a consequence of overcrowding, White said thousands of people are sleeping outside “under flimsy pieces of plastic”.\n31 Dec 2023 01.23 CET This blog is now closing and a new one will open later today, but for all of our latest updates – see our full coverage of the Israel-Gaza war, and a summary of the key events so far.\n30 Dec 2023 00.56 CET Summary Here is where things stand: The Organization for Islamic Cooperation has “welcomed” South Africa’s decision to launch a case at the International Court of Justice in which it accuses Israel of carrying out “genocidal” acts across Gaza. According to Qatari news agency QNA, the 57-member OIC, which Qatar is a part of, stressed that Israel is “committing a genocide by its indiscriminate targeting of civilian population … forcibly displacing them, preventing them from obtaining basic needs and humanitarian aid, and destroying buildings and health, educational and religious facilities”.\nTim Kaine, a US Democratic senator representing Virginia, has condemned the Biden administration’s arms transfer to Israel, joining a handful of other Democrats who are criticizing Biden for bypassing congressional review in the foreign transfer of weapons. Kaine’s criticism comes as Israeli strikes have killed more than 21,600 Palestinians across Gaza since 7 October, while internally displacing more than 1.9 million survivors from their homes.\nThe Israeli prime minister, Benjamin Nentanyahu, said that the border zone between the Gaza Strip and Egypt should be under Israel’s control. During a press conference on Saturday, Netanyahu said, “The Philadelphi corridor - or to put it more correctly, the southern stoppage point [of Gaza] - must be in our hands. It must be shut. It is clear that any other arrangement would not ensure the demilitarisation that we seek,” Reuters reports.\nIn a tweet ahead , the World Food Programme warned that “there is a different kind of countdown in Gaza”, pointing to an impending famine across the strip as a result of Israel’s attacks. “We are racing against time to avert a complete collapse of even the most basic services and starvation for millions,” the WFP said.\nIsraeli forces shot and killed a 22-year-old Palestinian man in the West Bank on Saturday, the Palestinian health ministry announced. The man, identified by Palestinian news agency WAFA as Mohammad Hussein Masalma, was killed by Israeli forces who fired live ammunition at the entrance of the al-Fawwar refugee camp in the south of Hebron, WAFA reports.\nPalestine’s ambassador to the UK, Husam Zomlot, has hailed South Africa’s decision to launch a case against Israel in the International Court of Justice in which it accused Israel of carrying out “genocidal” acts in Gaza. In a tweet on Saturday, Zomlot wrote: “Justice must be served and the #genocide must stop.”\nThe Palestinian Liberation Front’s armed wing announced on Saturday that an Israeli soldier it was holding captive had been killed in an Israeli airstrike, which also injured some of his captors, Reuters reports. According to an audio speech broadcast by Al Araby television, an Abu Ali Mustafa brigades spokesperson said that the Israeli airstrike occurred after a failed attempt by Israeli forces to rescue the soldier.\nForty percent of Gaza’s population is at risk of famine, the United Nations Relief and Works Agency said on Saturday. “Every day is a struggle for survival, finding food and water,” the UN agency for Palestinian refugees added.\nUpdated at 01.08 CET\n30 Dec 2023 00.32 CET Here are some images coming through the newswires from Gaza, where more than 21,600 Palestinians have been killed by Israeli strikes since 7 October and displaced survivors grapple with shortages of food, water, medical supplies and fuel: View image in fullscreen Palestinian people buy frozen meat that was allowed into the Gaza Strip at the butcher shops as Israeli attacks continue on 30 December 2023 in Rafah, Gaza. Photograph: Abed Rahim Khatib/Getty Images View image in fullscreen Palestinians injured in Israeli airstrikes are transferred to al-Aqsa hospital on 30 December 2023 in Deir al-Balah, Gaza. Photograph: Ali Hamad/REX/Shutterstock View image in fullscreen A Palestinian man inspects the damage following Israeli strikes on the Zawayda area of the central Gaza strip on 30 December 2023. Photograph: Majdi Fathi/NurPhoto/REX/Shutterstock View image in fullscreen A view of Palestinian residents among makeshift shelter tents after they have been forcibly displaced by Israeli attacks in Rafah, Gaza, on 30 December 2023. Photograph: Abed Zagout/Getty Images View image in fullscreen An aerial view of tents set up by the Egyptian and Palestinian Red Crescent organizations, for Palestinians displaced by Israeli attacks in al-Mawasi, Gaza, on 30 December 2023. Photograph: Mohammed Fayq/Getty Images View image in fullscreen Residents and civil defense teams carry out a search-and-rescue operation amid the rubble of buildings following an Israeli attack in Beit Lahia, Gaza, on 29 December 2023. Photograph: Khalil Alkahlut/Getty Images View image in fullscreen Hassan Samih Dawla, a 45-year-old tailor displaced by Israeli strikes from northern Gaza, provides tailoring services using a bicycle-powered sewing machine on 30 December 2023 in Rafah, Gaza. Dawla, who is originally from the Beach camp near Gaza City and has been in the sewing profession for 25 years, created a sewing machine that could run on bicycle power instead of electricity to cope with the frequent power outages that have followed the outbreak of war in October. Photograph: Ahmad Hasaballah/Getty Images\nUpdated at 01.00 CET\n30 Dec 2023 00.10 CET Cultural and health workers in Chicago gathered over the weekend in front of the Art Institute of Chicago to publicly mourn hundreds of Palestinian workers from those industries who have been killed by Israeli strikes. In a post on Saturday, the Jewish peace advocacy group Jewish Voice for Peace called for a ceasefire in Gaza, adding: “Their names will be remembered.” Last night, Chicago cultural workers and health workers gathered in front of the @artinstitutechi to publicly mourn 100s of workers from those industries killed in Israel’s genocidal attacks on #Gaza and the Occupied Territories. Their names will be remembered. #CeaseFireNow pic.twitter.com/mnlXQy9Aau — JVP Chicago (@JVPChicago) December 30, 2023\nUpdated at 00.48 CET\n30 Dec 2023 23.37 CET Organization of Islamic Cooperation hails South Africa's decision to launch case with ICJ against Israel on 'genocidal' acts in Gaza The Organization for Islamic Cooperation has “welcomed” South Africa’s decision to launch a case at the International Court of Justice in which it accuses Israel of carrying out “genocidal” acts across Gaza. According to Qatari news agency QNA, the 57-member OIC, which Qatar is a part of, stressed that Israel is “committing a genocide by its indiscriminate targeting of civilian population … forcibly displacing them, preventing them from obtaining basic needs and humanitarian aid, and destroying buildings and health, educational and religious facilities”. It added that the OIC called on the International Court of Justice to “respond swiftly and take urgent measures to put an end to the genocide committed by the Israeli occupation forces in the occupied Palestinian territory”. South Africa’s decision to file a case against Israel earlier this week comes as Israeli strikes have killed more than 21,600 Palestinians across the densely populated Gaza strip – which human rights organizations have described as an “open-air prison” – since 7 October.\nUpdated at 00.43 CET\n30 Dec 2023 23.05 CET Tim Kaine, a US Democratic senator representing Virginia, has condemned the Joe Biden administration’s arms transfer to Israel, joining a handful of other Democrats who are criticizing Biden for bypassing congressional review in the foreign transfer of weapons. Kaine’s criticism comes as Israeli strikes have killed more than 21,600 Palestinians across Gaza since 7 October, while internally displacing more than 1.9 million survivors from their homes. The Guardian’s Edward Helmore reports: Virginia senator Tim Kaine has added his voice to a rising chorus within the Democratic party questioning the Biden administration’s legislatively unconstrained transfer of US munitions to Israel. In a news release on Saturday, the Democratic senator – a member of the Senate armed services committee – said weapons transfers must come under congressional oversight. “Just as Congress has a crucial role to play in all matters of war and peace, Congress should have full visibility over the weapons we transfer to any other nation. Unnecessarily bypassing Congress means keeping the American people in the dark,” Kaine wrote. “We need a public explanation of the rationale behind this decision – the second such decision this month,” he added. On Friday, the US Defense Security Cooperation Agency said the US secretary of state, Antony Blinken, had approved the sale of 155mm projectiles and related equipment valued at $147.5m, an increase from an earlier approved order for tens of thousands of rounds of the heavy artillery munitions. For the full story, click here: Virginia senator Tim Kaine condemns Biden’s arms transfer to Israel Read more\nUpdated at 23.28 CET\n30 Dec 2023 22.33 CET Here are some images coming through the newswires of pro-Palestine rallies held around the world this weekend, in which thousands of protestors called for a ceasefire in Gaza, where more than 21,600 Palestinians have been killed in Israeli strikes: View image in fullscreen Pro-Palestine demonstrators rally to demand a ceasefire in Gaza at Place Edmond-Michelet, in Gaza, in Paris, France, on 30 December 2023. Photograph: Ait Adjedjou Karim/ABACA/REX/Shutterstock View image in fullscreen People stage a protest against Israeli attacks on Gaza and show solidarity with Palestinians at Adenauerplatz Square in Berlin, Germany, on 30 December 2023. Approximately 1,200 people attended. Photograph: Cuneyt Karadag/Getty Images View image in fullscreen Demonstrators raise placards and Palestinian flags as they march through the streets of Yemen’s Houthi-controlled capital, Sana’a, to express solidarity with the people of Gaza, on 29 December 2023. Photograph: Mohammed Huwais/AFP/Getty Images View image in fullscreen Members of the Palestine Solidarity Committee carry placards as they participate in a mass rally to support the Palestinian people in Dhaka, Bangladesh, on 29 December 2023. Photograph: Zabed Hasnain Chowdhury/NurPhoto/REX/Shutterstock View image in fullscreen Demonstrators play dead in front of a nativity scene (unseen) representing a city in ruins with the figures wrapped in shrouds, at the Plaça de Sant Jaume, to protest against Israel’s attacks on Gaza, in Barcelona, Catalonia, north-eastern Spain, 29 December 2023. Photograph: Alejandro García/EPA View image in fullscreen Hundreds gather at the King Abdullah I Mosque in Amman, Jordan, on 29 December 2023, to express their solidarity with the Palestinian resistance movement and their opposition to Israel’s occupation and aggression in Gaza. Photograph: Natascha Tahabsem/ZUMA Press Wire/REX/Shutterstock\nUpdated at 22.50 CET\n30 Dec 2023 21.48 CET The Palestine Red Crescent Society has transferred more than five injured Palestinians after an Israeli strike hit a house in the Maghazi refugee camp in central Gaza, the PRCS said on Saturday. 🚨The PRCS teams have just transferred more than 5 injuries 🚑due to Israeli shelling of a house in the Maghazi camp in the central #Gaza Strip.#HumantarianHeroes pic.twitter.com/5E7cE1Ec2o — PRCS (@PalestineRCS) December 30, 2023\nUpdated at 21.52 CET\n30 Dec 2023 20.57 CET Benjamin Netanyahu says border zone between Gaza strip and Egypt 'must be in our hands' The Israeli prime minister, Benjamin Nentanyahu, said that the border zone between the Gaza strip and Egypt should be under Israel’s control. During a press conference on Saturday, Netanyahu said, “The Philadelphi corridor - or to put it more correctly, the southern stoppage point [of Gaza] - must be in our hands. It must be shut. It is clear that any other arrangement would not ensure the demilitarisation that we seek,” Reuters reports. He went on to threaten to attack Iran directly over the exchanges of fire across the Israel-Lebanon border, saying, “If Hezbollah expands the warfare, it will suffer blows that it has not dreamed of - and so too Iran.”\nUpdated at 23.12 CET\n30 Dec 2023 20.26 CET With more than 21,600 Palestinians killed by Israeli forces since 7 October, Israel forces have expanded their ground operations across the strip, where more than 1.9 million surviving Palestinians have been displaced as a result. The Guardian’s Emma Graham-Harrison reports: Israeli planes bombed refugee camps in Gaza on Saturday as troops expanded ground operations and tens of thousands of Palestinians fled their homes, setting the stage for a new year as bloody and destructive as the last three months of 2023. The threat of wider escalation also looms large over the region, as skirmishes on the northern boundary with Lebanon intensify, and Israeli officials have hinted that the “diplomatic hourglass” is running out to reach a negotiated solution. For now there seems little hope of even a temporary break in attacks, even after Egypt hosted leaders for talks this week and pushed plans for a staged break in the war. A senior Hamas official told AP on Saturday they are firm in their position that there will be no hostage releases without a permanent ceasefire. Israel will not accept ending a war its leaders describe as existential and “without limit”. The Israeli prime minister, Benjamin Netanyahu, says Hamas must be destroyed after the brutal attacks of 7 October, when gunmen broke into Israel and murdered 1,200 people, the majority civilians. The scale of death and suffering inside Gaza has isolated Israel internationally, with even allies like the UK now calling for a “sustainable ceasefire”. More than 21,600 people have been killed in Gaza, the majority women and children, and thousands more buried under the rubble, health authorities in the Hamas-run strip say. For the full story, click here: As Gaza death toll mounts, Israelis look in vain for any sign of victory Read more\nUpdated at 20.31 CET\n30 Dec 2023 19.59 CET The Israeli prime minister, Benjamin Netanyahu, said on Saturday that Israel was “fighting on all fronts” in a war which he said would last many more months until victory is achieved, Reuters reports. Netanyahu’s address came as Israel entered its 13th week of war on Gaza during which it has killed over 21,500 Palestinians in what it has declared as its fight against Hamas.\nUpdated at 20.18 CET", "source_domain": "www.theguardian.com", "text": null, "title": "UN reports surge in people fleeing to Rafah as fighting intensifies - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/30/israel-gaza-war-live-hamas-palestinians-khan-younis-deaths-un-aid-us"}