{"authors": [], "date_download": "2024-02-05 15:20:41", "date_modify": "None", "date_publish": "2023-12-31 08:21:27", "description": "Russia has launched a fresh drone assault on Ukraine after promising that strikes on the Russian border city of Belgorod “would not go unpunished”", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-russia-kharkiv-b2471453.html.json", "image_url": "https://static.independent.co.uk/2023/12/31/08/Russia_Ukraine_War_38314.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussia launched a fresh drone assault on Ukraine on Saturday night, after promising that strikes on the Russian border city of Belgorod earlier in the day “would not go unpunished”.\nThe Ukrainian Air Force said Sunday that it had shot down 21 of 49 drones launched by Russian forces overnight.\nTwenty-eight people were wounded in an attack on the eastern city of Kharkiv, regional Gov. Oleh Syniehubov said Sunday. A central hotel, apartment buildings, kindergarten, shops and administrative buildings sustained damage, according to the regional prosecutor’s office.\nIn the Kyiv region that surrounds the capital, a Russian drone attack caused a fire to break out at a critical infrastructure facility, local officials said. They did not identify the facility further.\nThe Russian attacks came after shelling in the center of the Russian border city of Belgorod Saturday killed 24 people, including three children.\nA further 108 people were wounded in the strike, regional governor Vyacheslav Gladkov said Sunday, making it one of the deadliest attacks on Russian soil since the start of Moscow’s invasion of Ukraine 22 months ago.\nRussian authorities accused Kyiv of carrying out the attack, which took place the day after an 18-hour Russian aerial bombardment across Ukraine killed at least 41 civilians.\nRussia’s Defense Ministry said it identified the ammunition used in the strike as Czech-made Vampire rockets and Olkha missiles fitted with cluster-munition warheads. It provided no additional information, and The Associated Press was unable to verify its claims.\n“This crime will not go unpunished,” the ministry said in a statement on social media.\nIn an emergency meeting at the U.N. Security Council demanded by Russia Saturday night, envoy Vasily Nebenzya accused Kyiv of a “terrorist attack.” In comments carried by Russian state media, Nebenzya claimed Ukraine had launched “a deliberate act of terrorism directed against civilians.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia launches fresh drone strikes on Ukraine after promising retaliation for Belgorod attack", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-russia-kharkiv-b2471453.html"}