{"authors": ["Natalie Lisbona", "Natalie Lisbona In Tel Aviv"], "date_download": "2024-02-05 15:20:43", "date_modify": "None", "date_publish": "2023-12-31 01:29:33", "description": "Israeli troops fought street battles against Hamas terrorists in southern Gaza yesterday as they sought to capture the key city of Khan Yunis.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12913623%2FIsraeli-Hamas-Tel-Aviv-Iran-Hezbollah-Lebanon-Syria.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/31/01/79471359-0-image-a-152_1703985976468.jpg", "language": "en", "localpath": null, "maintext": "Israel fought in streets against Hamas in southern Gaza to capture Khan Yunis\nIsraeli troops fought street battles against Hamas terrorists in southern Gaza yesterday as they sought to capture the key city of Khan Yunis.\nThe military said it targeted Hamas strongholds, as well as an explosives-making factory, a 'war-room' used by the terrorists and several underground tunnel networks.\nThe assault deep into the south of Gaza came as Israel's army also launched strikes on Iran-backed Hezbollah terrorists in neighbouring Lebanon and Syria.\nThe ground offensive in Khan Yunis was yesterday accompanied by strikes on refugee camps in the outskirts of the city where the Israel Defence Force (IDF) said Hamas hideouts were located.\nThe deadly air and land attacks killed at least 165 Gazans and left 250 others wounded, the Hamas-run health ministry said.\nAFTERMATH: A child is hauled from the rubble after Israeli strikes on Gaza\nPalestinians inspect the damage following Israeli strikes on the Zawayda area of the central Gaza Strip\nAs the Bureij, Nuseirat and Maghazi camps were being bombed, the IDF showered them with leaflets in Arabic telling the almost 90,000 residents and 61,000 displaced Gazans to move southwards.\nThe IDF's Lt-Col Peter Lerner told The Mail on Sunday: 'We are killing tens of Hamas terrorists every day. So far we have killed 8,000 – that is about a third.\n'Our end-game is to restore security and stability to Israel. We will protect our forces and our country. We will not live under threat – we have an obligation to our country.'\nLt-Col Lerner added that Iran-backed Hezbollah in Lebanon was firing anti-tank guided missiles, drones and rockets into Israel every day, which could lead to an all-out war between the two sides.\n'There are 50 to 60 different daily incidents from the Lebanese border,' he said. 'They are risking the stability of the region. Hezbollah needs to look closely at what is going on in Gaza, and if they continue they will bear full responsibility.'\nThe offensive came amid a furious diplomatic row between Israel and South Africa after it accused Tel Aviv of carrying out genocide against Palestinians. South Africa also urged the International Court of Justice at the Hague to order a halt of attacks.\nIn response, the Israeli government said it 'rejected with disgust' the genocide claims, and in turn accused South Africa of collaborating with Hamas terrorists.\nA view of the damaged buildings and cars as residents search for their belongings among the rubble after Israeli attack on Nuseirat refugee camp in Deir al-Balah, Gaza\nSmoke billowing over Khan Yunis in the southern Gaza Strip during the Israeli bombardment, on December 30, 2023\nIsrael's air and ground offensive against Hamas has displaced as much as 85 per cent of the Gaza Strip's 2.3 million residents", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli army is locked in street battles in Hamas stronghold as Tel-Aviv also launches strikes on Iran-backed Hezbollah militants in Lebanon and Syria", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12913623/Israeli-Hamas-Tel-Aviv-Iran-Hezbollah-Lebanon-Syria.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}