{"authors": ["Laura Parnaby", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:20:44", "date_modify": "None", "date_publish": "2023-12-31 14:42:45", "description": "Michael Lucas, 51, who owns one of the largest gay porn production companies in the world, posted a photo of his name written on an IDF rocket bound for Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12914345%2FPro-Israeli-porn-star-gay-boycott-Michael-Lucas-Sharok-Israel-Palestine-rocket-missile-signed-IDF-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/31/14/79479733-0-image-m-15_1704032869605.jpg", "language": "en", "localpath": null, "maintext": "A pro-Israeli gay porn star is being boycotted by others in the industry for writing his name on an IDF rocket bound for Gaza.\nMichael Lucas, 51, who owns one of the largest gay porn production companies in the world, faced a fierce backlash online after he posted a photograph of the deadly weapon scrawled with his name in red sharpie.\nThe adult film actor shared the photo in response to Jake Shields - a retired UFC star and outspoken critic of the attacks - who tweeted a similar image of projectiles signed with his name too.\nWhile Shields slammed the move by Israel's military as 'a clear threat to our lives and on missile I'm being forced to pay for with my tax dollars', Lucas shared the opposite view.\n'Hahaha I actually asked to write my name,' the gay porn giant wrote to his 295,400 followers on X, formerly Twitter. 'Got a pic before and after. Did you get them too? Amazing difference!'\nA pro-Israeli gay porn giant is being boycotted by others in the industry for writing his name on an IDF rocket bound for Gaza and sharing a photograph of the missile on X\nMichael Lucas, 51, who owns one of the largest gay porn production companies in the world, faced a vociferous online backlash after he posted a photograph of his name written on an IDF projectile bound for Gaza\nShahrokh Mosavi Nejad, 39 (pictured) is among the porn stars who condemned Lucas' tweet while calling for a boycott of his New York City based adult film empire, Lucas Entertainment\nThe callous tweet drew criticism from around the world, including from others in the porn industry calling for actors to boycott Lucas Entertainment, the star's New York City based production company.\nIranian-American porn star Shahrokh Mosavi Nejad, 39, highlighted the 20,000 death toll in Gaza which continues to climb and slammed Lucas for supporting 'genocide'.\n'Anyone who thinks writing notes on missiles is some kind of sick flex is an accessory to murder and genocide of innocent #Palestinian civilians in my book,' LA-based Mosavi Nejad wrote.\nSeveral other big names in the adult film industry slammed Lucas for his tweet, with some saying they would no longer feature on his studio's roster.\n'I don't want to draw more attention to the post; I find it both saddening and reprehensible,' Kyle Overton, who goes by the porn name Sean Xavier told his more than 320,000 followers on X.\n'For those that are inquiring, I will no longer be promoting my work with that studio, nor accepting future offers to work with them.'\nShields, whose post condemning the rockets first sparked the conversation, also described Lucas as a 'demon'.\nLucas hit back at his critics, telling DailyMail.com that they are 'a small aggressive group of Jew-haters'.\n'They are calling for a boycott of my company because of my public support for Israel and its Defense Forces,' he said.\n'In a very Soviet style - that I know all too well - they are demanding that others denounce me publicly for my \"crime\" of supporting Israel.\n'This boycott is a reflection of how anti-Semitism has blossomed all over the world in recent months.\n'Gay porn performers who not once condemned the massacre of Jews on October 7th are suddenly \"concerned\" about Palestinians.'\nHe added that there was 'nothing new' about writing names on artillery shells, which has also been done on Ukrainian missiles.\nLucas' tweet sparked the fierce backlash against his adult film entertainment company\nMosavi Nejad, 39, highlighted the 20,000 death toll in Gaza resulting from the retaliatory Israeli airstrikes - and called for a boycott of Lucas' empire\nHe also told the New York Post that he is 'not intimidated' by his detractors and he 'won't delete the tweet no matter how many threats I continue to receive'.\nMeanwhile Mosavi Nejad, known by his porn name as The Sharok, doubled down on his criticism of Lucas on New Year's Eve.\nHe described the adult film titan as 'a man who's been a menace to our industry' and is now 'promoting genocide'.\n'There’s a difference between supporting Israel and making light of thousands of innocent people being murdered in your name and literally cheering them on,' he said. 'That is vile, sociopathic behavior.'\nMosavi Nejad's social media is brimming with posts in support of Palestine, highlighting videos of children who have died in Gaza, while promoting mass protests around the world calling for a ceasefire.\nMeanwhile Lucas, who was born and raised in Soviet Russia as Andrei Treyvas according to his 2007 biography, has long been an outspoken supporter for Israel.\nHe recently shared a video of IDF soldiers thanking him for his 'generosity'.\n'Michael Lucas, thank you very much for the amazing night we had last night and you for your generosity. We love you. Thank you very much,' the IDF squad said in the clip shared to Lucas' Instagram.\nLucas has donated funds to Israel and he recently shared a video on Instagram of IDF soldiers thanking him for his 'generosity'\nLucas also met Jerry Seinfeld during the Jewish-American comedian's visit to Tel Aviv earlier this month, and he shared a photograph with him on social media\nMosavi Nejad's social media is brimming with posts in support of Palestine, highlighting videos of children who have died in Gaza\nIranian-American porn star Mosavi Nejad has also shared photos of mass protests around the world calling for a ceasefire. (Pictured: a demo in Berlin on October 22 shared to his Instagram)\nLucas also met Jerry Seinfeld during the Jewish-American comedian's visit to Tel Aviv earlier this month, and he shared a photograph with him on social media.\nSeinfeld and his wife, Jessica Sklar, traveled to Israel to visit Kibbutz Be'eri where more than 100 residents were slaughtered by Hamas terrorists.\nIsrael began its onslaught in Gaza after Hamas terrorists massacred 1,200 Israelis on October 7 in a surprise attack - the worst atrocity carried out against the Jewish people since the Holocaust.\nLucas has produced and starred in films including Michael Lucas La Dolce Vita, and his 2009 production Men of Israel was the first major adult film to feature an all-Jewish cast, according to the Los Angeles Times.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pro-Israeli porn star, 51, claims he is being boycotted by pro-Palestinian porn stars for signing a rocket used by the IDF in Gaza with his own name", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12914345/Pro-Israeli-porn-star-gay-boycott-Michael-Lucas-Sharok-Israel-Palestine-rocket-missile-signed-IDF-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}