{"authors": ["Alex Hammer", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:14:57", "date_modify": "None", "date_publish": "2024-01-29 16:03:04", "description": "The suicide drone trailed an American aircraft returning to base - Tower 22 close to the Syrian border - and US defenses confused the two.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13019669%2FAir-defenses-base-Jordan-confused-suicide-drone-FRIENDLY-aircraft-attack-Iran-backed-terrorist-killed-three-soldiers.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/29/16/80561837-0-image-a-10_1706544154369.jpg", "language": "en", "localpath": null, "maintext": "An Iran-backed drone which killed three American troops in Jordan on Saturday tricked US forces into thinking it was one of their own, a Pentagon official told Politico.\nThe suicide drone trailed an American aircraft returning to base - Tower 22 close to the Syrian border - and US defenses confused the two.\nIt was launched from Iraq by a militia backed by Iran, the main supporter of anti-Israel group Hezbollah, according to US officials. At least 34 people were also injured in the strike.\nThe attackers saw an 'opportunity' to trail the US plane and 'exploited' it, according to a US Department of Defense official who spoke with Politico on condition of anonymity.\nThree American soldiers have been killed in suicide drone strike on a US base in Jordan, US Central Command said on Sunday. Pictured: Marines talk to their comrades on the ground during military maneuvers in the Middle Eastern Country, which borders Syria and Iraq\nThe drone attack late Saturday night impacted a US outpost located in the northeast part of the country known as Tower 42, near the Syria border, and resulted in at least 34 other injuries\nModern military aircraft, naval vessels and ground vehicles are fitted with technology known as Identification Friend or Foe (IFF) Transponders, which identify 'friendly' vehicles.\nIt's unclear whether the system in use at the Jordan base malfunctioned or if human error was involved.\nThe defense official also told Politico that just 90 minutes after the strike on Tower 22, Iranian proxies launched a second drone at a US base at al-Tanf Garrison, which is just across the border in Syria.\nThis drone was shot down by a US drone called RTX's Coyote uncrewed aerial system, according to the outlet.\nPresident Joe Biden announced the deaths of three American troops the morning after the attack.\n'Today, America’s heart is heavy,' he wrote from the White House.\n'Last night, three U.S. service members were killed - and many wounded - during an unmanned aerial drone attack on our forces stationed in northeast Jordan near the Syria border.'\nMeanwhile, conflict in the war-torn Middle Eastern region continues to escalate, with the war in Gaza still ongoing, and Iran currently exchanging airstrikes with US ally Pakistan.\nThe names of those killed have not been released. They are the first American soldiers killed in the Middle East since Oct. 7 when Hamas launched an attack on Israel.\n'While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq,' Biden said in his statement.\n'Jill and I join the families and friends of our fallen - and Americans across the country - in grieving the loss of these warriors in this despicable and wholly unjust attack.'\nAs of Sunday morning, Iran - the main backer of anti-Israel group Hezbollah - and its proxies are the main suspects, officials said. Pictured: US Marines monitor Eager Lion multinational military maneuvers in Quweira, a city in Jordan located closer to Israel\nPresident Joe Biden on Sunday said the soldiers died 'risking their own safety for the safety of their fellow Americans, and our allies and partners with whom we stand in the fight against terrorism'\nAn outspoken enemy of both the US and Israel, Iran currently trains the Hezbollah militia group (seen here in Baghdad in 2019), which for years has sought to join the Palestinian cause. The group has not been named as responsible for Saturday's attack\nHe added how the three fallen soldiers 'embodied the very best of our nation' - them being 'unwavering in their bravery... unflinching in their duty... [and] unbending in their commitment to our country.'\nHe declared they died 'risking their own safety for the safety of their fellow Americans, and our allies and partners with whom we stand in the fight against terrorism.'\n'It is a fight we will not cease,' Biden, 81, proclaimed.\nWhile not identifying the militants responsible, the statement confirmed the strike was the work of anti-Western jihadists operating somewhere in the region.\nBoth countries, as of Sunday, boast a bevy of Iran-aligned militias, including Hezbollah and several other Shia militant groups.\nSince the Syrian War in 2011, Iran has also backed multiple Palestinian terror groups based in Gaza, and various terrorist groups in Bahrain and elsewhere across the Middle East.\nSince the war - which served to intensify Iranian economic, political and religious operations in the country - Iran has openly used its Islamic Revolutionary Guard Corps-Qods Force to fund these terrorist organizations.\nIn 2019, the nuclear-capable country acknowledged the involvement of the force in the Iraq and Syria conflicts, spurring the US to designate the Iranian army as a Foreign Terrorist Organization.\nIran has also been known regional militant and proxy groups to achieve deniability in such strikes, as well as shield it from accountability for its destabilizing policies.\nThe country is also currently embroiled in an artillery-laden game of chicken with its own neighbor in Pakistan, which is one of NATO's main allies in the Middle East.\nThe country is also currently embroiled in an artillery-laden game of chicken with its neighbor Pakistan, which is one of NATO's main allies in the Middle East. Pictured: Smoke billowing over the Iranian city Saravan last Thursday\nBoth countries, as of Sunday, boast a bevy of Iran-aligned militias, including Hezbollah and several other Shia militant groups including the Houthi, seen here as Yemenis recently militarily trained by the movement hold their guns and chant slogans in an armed popular parade before heading to Israel in the Gaza Strip to fight on December 2\nJust last week, Pakistan's air force launched retaliatory airstrikes on two alleged militant positions in Iran, days after an Iranian airstrike killed two children in their own country.\nThe air attacks in Sistan and Baluchestan province killed at least seven - and added to tensions already present between the two nations and the region as a whole.\nThey also added to a death toll in the Middle East that is well into the thousands since the conflict in Gaza broke out in October.\nA few weeks ago, Pakistan recalled its ambassador to Tehran because of Tuesday's strikes by Iran inside Pakistan's southwestern Baluchistan province. Iran claimed it targeted bases for a militant Sunni separatist group.\nIt drew strong condemnation from Pakistan, which denounced the attack as a 'blatant violation' of its airspace and said it killed two children.\nIf Marhamati's account of the casualties is correct, the country duplicated Pakistan's minor-killing offense at least two fold.\nAs Iranians continue to assess the full scope of the attack, the war more than a thousand miles west in Israel continues to rage.\nAnother 1,000 miles southwest, four fresh strikes were carried out by the US on Yemen, targeting anti-ship ballistic missiles used by another rebel group backed by Iran, the Houthi.\nEarlier in the month, shortly after Iran's attack on Pakistani soil, the group warned that British and American ships in the Red Sea have now become 'legitimate targets', given the state of the greater conflict\nAnother 1,000 miles southwest, four fresh strikes were carried out by the US on Yemen , targeting anti-ship ballistic missiles used by the Houthis, another group backed by Iran that is against US involvement in the region\nTwo weeks ago, shortly after Iran's attack on Pakistani soil (seen here), the Iran-backed group warned that British and American ships in the Red Sea have now become 'legitimate targets', following joint strikes against military sites run by another group backed by Iran, the Houthis\nThe string of incidents have fueled concerns about the danger of the Israeli offensive sparking a wider conflict and a simultaneous rise in gas prices, as it is also one of the most important routes for oil and liquefied natural gas shipments in the Middle East\nThe Houthis have since targeted ships in the region sporadically, with the attacks ramping up recently.\nIn response, the US launched Operation Prosperity Guardian - an international coalition to safeguard the region, with many other countries, including Spain and the UK, taking part.\nA reported 1,200 commercial ships have passed through the sea since the operation was launched on December, with none hit by drone or missile strikes until the first phase of the Sunday strike, when militants attacked the Hangzhou with several missiles.\nUS Navy Vice Admiral Brad Cooper on Friday had already warned that even with the taskforce, the Houthis do not seem set on ending their 'reckless' attacks, after targeting more than 100 ships in the Red Sea since November.\nThe Sunday attack shows the group's continued resolve to support Hamas, which Israel recently pledged to continue to try to eradicate.\nThe incidents have fueled concerns about the danger of the Israeli offensive sparking a wider conflict and a simultaneous rise in gas prices, as it is also one of the most important routes for oil and liquefied natural gas shipments in the Middle East.\nOn Sunday the official representative of the Jordanian Cabinet of Ministers denied that the Saturday strike occurred in the country at all, saying it instead happened at a well-known US military base at Tanf in Syria, not on Jordanian territory.\nThe US has yet to confirm those claims, but has issued statements citing American intelligence that indicate otherwise.\nThe military branches the soldiers belonged to, as of Sunday, have yet to be specified.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Iran-backed suicide drone deliberately 'trailed' US aircraft to confuse air defenses that it was friendly, Pentagon official says", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13019669/Air-defenses-base-Jordan-confused-suicide-drone-FRIENDLY-aircraft-attack-Iran-backed-terrorist-killed-three-soldiers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}