{"authors": [], "date_download": "2024-02-05 15:20:46", "date_modify": "None", "date_publish": "2023-12-31 11:04:20", "description": "The U.S. military says it shot down two anti-ship ballistic missiles fired toward a container ship by Yemen’s Houthi rebels in the Red Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fbeirut-ap-red-sea-yemen-houthi-b2471491.html.json", "image_url": "https://static.independent.co.uk/2023/12/31/11/Red_Sea_Shipping_28458.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. military said Sunday it shot down two anti-ship ballistic missiles fired toward a container ship by Yemen’s Houthi rebels in the Red Sea. Hours later, four boats tried to attack the same ship, but U.S. forces opened fire, killing several of the armed crews, the U.S. Central Command said. No one was injured on the ship.\nThe Singapore-flagged MAERSK HANZGHOU reported they had already been hit by a missile Saturday night while transiting the Southern Red Sea and requested assistance, CENTCOM said in a statement. The USS GRAVELY and USS LABOON responded to the call for help, and the Denmark-owned vessel was reportedly seaworthy and no injuries were noted, the statement added.\n“This is the 23rd illegal attack by the Houthis on international shipping since Nov. 19,” CENTCOM said.\nIn another statement, CENTCOM said the same ship issued an additional distress call about a second attack “by four Iranian-backed Houthi small boats.” The attackers fired small arms weapons at the MAERSK HANZGHOU, getting to within 20 meters (about 65 feet) of the vessel, and attempted to it, CENTCOM said.\nA contract-embarked security team on the ship returned fire, the central command said. U.S. helicopters from the USS Dwight D. Eisenhower aircraft carrier and GRAVELY responded to the distress call and while issuing verbal warnings to the attackers, the small boat crews opened fire on the helicopters using small arms, the statement said.\n“The U.S. Navy helicopters returned fire in self-defense,” sinking three of the four boats, killing the crews while the fourth boat fled the area, CENTCOM said, and no damage to U.S. personnel or equipment was reported.\nThe Iran-backed Houthis have claimed attacks on ships in the Red Sea that they say are either linked to Israel or heading to Israeli ports. They say their attacks aim to end Israel’s air-and-ground offensive targeting the Gaza Strip following the attack by the Palestinian militant group Hamas on Oct.7.\nOn Saturday, the top commander of U.S. naval forces in the Middle East said Houthi rebels have shown no signs of ending their “reckless” attacks on commercial ships in the Red Sea even as more nations join the international maritime mission to protect vessels in the vital waterway and trade traffic begins to pick up.\nSince the Pentagon announced Operation Prosperity Guardian to counter the attacks just over 10 days ago, 1,200 merchant ships have traveled through the Red Sea region, and none has been hit by drone or missile strikes, Vice Adm. Brad Cooper said in an Associated Press interview.", "source_domain": "www.independent.co.uk", "text": null, "title": "US forces shoot down ballistic missiles in Red Sea, kill gunmen in attack by Yemen's Houthi rebels", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/beirut-ap-red-sea-yemen-houthi-b2471491.html"}