{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:20:47", "date_modify": "None", "date_publish": "2023-12-31 20:44:31", "description": "Heavy bombing continues, while Benjamin Netanyahu says Israel has shown unparalleled ‘morality’ in its conduct in Gaza", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F31%2Fisraeli-airstrikes-kill-dozens-in-gaza-netanyahu-hamas.json", "image_url": "https://i.guim.co.uk/img/media/4b508e514dcf4439b3390cd674b1243e3f3d3e44/0_0_7917_4753/master/7917.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d0468ae7d40e3709032d88a1b6200f0a", "language": "en", "localpath": null, "maintext": "At least 100 people have been killed in Gaza in the past 24 hours, as the three-month-old conflict between Israel and Hamas rolls into the new year with no end in sight and only tentative Israeli government plans for discussing the day after the war is over.\nThe Hamas-run territory’s health authority said about 48 people were killed overnight on Sunday in heavy Israeli bombing of Gaza City, where pockets of fierce fighting are ongoing despite claims by the Israel Defense Forces that the north of the blockaded exclave is largely under Israeli operational control.\nAnother strike killed 20 people sheltering at al-Aqsa University in the west of Gaza City, witnesses said.\nIn the southern half of Gaza, areas previously identified as evacuation zones for the strip’s population of 2.3 million, about 85% of whom have fled their homes, have been heavily attacked with airstrikes and artillery over the past week as Israel broadens its ground operation.\nIsrael is now targeting Nuseirat, Maghazi and Bureij, a belt of overcrowded and poorly serviced camps in the centre of the strip built to house Palestinian refugees who fled their homes during the 1948 war over Israel’s creation. About 35 people were killed by bombardment of the area on Sunday.\n“They were innocent people,” Hussein Siam, whose relatives were among the dead in a strike on the central neighbourhood of Zawayda, told the Associated Press. “Israeli warplanes bombarded the whole family.”\nThe camps’ populations have swelled with hundreds of thousands of newly displaced people since the war broke out after Hamas’s 7 October attack on Israel, in which the militant group killed 1,140 people and seized up to another 250 as hostages.\nRear Adm Daniel Hagari, the chief military spokesperson, said late on Sunday that Israel was withdrawing some forces from Gaza as part of its “smart management” of the war. He did not say how many, and held out the possibility they would return at a later point in the war.\nIsraeli media said up to five brigades, numbering thousands of soldiers, would be withdrawn, but it was not immediately clear if it represented a normal troop rotation or a new phase in the fighting. Hagari also said some reservists would return to civilian life to bolster Israel’s wartime economy.\nIsrael’s retaliatory war has killed about 21,800 people, injured another 55,000 and left approximately half of Gaza’s housing stock in ruins from bombings and ground fighting.\nNew estimates suggest that a quarter of Gaza’s population could die within a year from preventable diseases owing to a lack of sanitation, the collapse of the health system and hunger as desperate families weather the winter conditions in tents and makeshift shelters.\nOn Sunday, the Israeli foreign minister said the country was prepared to let ships deliver aid to the Gaza Strip immediately as part of a proposed sea corridor from Cyprus, a plan first proposed in November.\nThe Israeli military said on Sunday it had killed around a dozen enemy fighters in multiple ground battles across Gaza and it was homing in on the southern town of Khan Younis, where it believes senior Hamas officials are hiding.\nIsrael has vowed to continue the war effort until “total victory” over Hamas, despite the growing casualty toll and international pressure for a ceasefire, including from the country’s most important ally, the US. Its war goals seem to be slipping away: troops are bogged down in ground fighting, senior Hamas leadership figures have not been killed, and Hamas has retained its ability to fire rockets at Israel.\nOn Sunday the Israeli prime minister, Benjamin Netanyahu, said Israel had displayed unparalleled “morality” in its conduct in Gaza. He rejected a case filed by South Africa at the international court of justice on Friday alleging that Israel was committing genocidal acts in Gaza.\nView image in fullscreen Displaced Palestinians at in a tent camp in Rafah, southern Gaza Strip. Photograph: Ibraheem Abu Mustafa/Reuters\nThe threat of a wider war looms large over the region, as skirmishes with the Iran-backed militia Hezbollah intensify on Israel’s northern boundary with Lebanon.\nThe US military said on Sunday that its forces had shot and killed several Iran-backed Houthi rebels from Yemen when they tried to attack a cargo ship in the Red Sea, a serious escalation in Houthi attacks on international shipping lanes that the fundamentalist group says are in solidarity with Palestine. Washington has assembled a multinational naval taskforce to deter such attacks.\nFor now there seems little hope of even a temporary break in the fighting in Gaza, even after Egypt hosted Hamas leaders for talks last week and pushed plans for a staged break in the war involving a second release of Israeli hostages and Palestinian prisoners before an eventual ceasefire.\nThe US news outlet Axios and the Israeli website Ynet, both citing unnamed Israeli officials, reported that Qatari mediators had told Israel that Hamas was prepared to resume talks on new hostage releases in exchange for a ceasefire.\nNetanyahu, when asked about the process on Saturday, said Hamas had been “giving all kinds of ultimatums that we didn’t accept”. “We are seeing a certain shift [but] I don’t want to create an expectation,” he said, without elaborating.\nSince 7 October, the normally fractious country has somewhat united, but that solidarity is showing signs of waning. Saturday night’s weekly protests in Tel Aviv aimed at putting pressure on the government to prioritise the release of the estimated 129 hostages still in Hamas captivity were joined this week by thousands of people protesting against Netanyahu and his government.\nIsrael is deeply divided over the longtime leader’s suitability for high office, as well as by this year’s controversial judicial overhaul, which could help him evade corruption charges he denies.\nWhat happens to Gaza when Israel declares that the war is over is still unclear. Netanyahu has reportedly repeatedly refused to hold meetings, or has cancelled scheduled meetings, with security officials on discussing the “day after”, which are now set for Tuesday.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli airstrikes kill scores in Gaza as war enters a new year", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/31/israeli-airstrikes-kill-dozens-in-gaza-netanyahu-hamas"}