{"authors": ["World News"], "date_download": "2024-02-05 15:20:52", "date_modify": "None", "date_publish": "2023-12-30 20:01:04", "description": "Russia will not provide any explanations about an unidentified object that briefly entered Poland’s airspace until it receives evidence that shows the object was a Russian […]", "filename": "https%3A%2F%2Fjerseyeveningpost.com%2Fmorenews%2Fworldnews%2F2023%2F12%2F30%2Frussia-refuses-to-give-explanation-over-suspected-missile-which-flew-over-poland%2F.json", "image_url": "https://d3gvyx4eg3tne0.cloudfront.net/wp-content/uploads/2023/12/Img37263616.jpg", "language": "en", "localpath": null, "maintext": "Russia will not provide any explanations about an unidentified object that briefly entered Poland’s airspace until it receives evidence that shows the object was a Russian missile, Russia’s top diplomat in Poland said on Saturday.\nPoland’s defence forces said an unknown object travelled 24 miles into the country’s airspace on Friday from the direction of Ukraine before leaving minutes later and vanishing off radars.\nThe head of the Polish armed forces, General Wieslaw Kukula, said “everything indicates” it was a Russian missile.\nPoland’s foreign ministry demanded explanations from Moscow.\nRussia’s charge d’affaires in Warsaw, Andrei Ordash, told Russian state news agency RIA Novosti on Saturday that Poland’s claims were “unsubstantiated”.\n“We will not give any explanations until we are presented with concrete evidence, because these accusations are unsubstantiated,” Mr rdash told RIA Novosti.\nAbout 500 Polish territorial defense troops combed an area between the city of Zamosc and the border with Ukraine for any traces of the object on Saturday, but officials said nothing suspicious was found.\nPoland’s border with Ukraine is also the European Union and Nato’s border with Ukraine.", "source_domain": "jerseyeveningpost.com", "text": null, "title": "Russia refuses to give explanation over suspected missile which flew over Poland", "title_page": null, "title_rss": null, "url": "https://jerseyeveningpost.com/morenews/worldnews/2023/12/30/russia-refuses-to-give-explanation-over-suspected-missile-which-flew-over-poland/"}