{"authors": ["Juliana Cruz Lima"], "date_download": "2024-02-05 15:20:54", "date_modify": "None", "date_publish": "2023-12-30 11:42:53", "description": "UKRAINIAN defenders have attacked military facilities across Russia with drones in a \"revenge blitz\" against Putin, reports have claimed.It is underst", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25201176%2Fukraine-massive-drone-strike-putin-russia%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/newspress-collage-sudx17wrm-1703940895694.jpg?1703940915&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "UKRAINIAN defenders have attacked military facilities across Russia with drones in a \"revenge blitz\" against Putin, reports have claimed.\nIt is understood that more than 70 drones were used for attacks in Moscow, Belgorod, Tula, Tver, and Bryansk in a massive strike - a day after an 18-hour aerial barrage across Ukraine killed at least 39 civilians.\n5 Ukraine has launched a massive drone attack across many Russian facilities today Credit: telegram via x osinttechnica\n5 Strikes were recorded in cities like Moscow and Belgorod, pictured above Credit: Twitter/@Lastkombo\n5 Today's drone attacks on Putin's Russia came after an 18-hour aerial barrage across Ukraine yesterday, pictured Credit: Reuters\nRussia's emergency ministry said 14 people including two children were killed and more than 100 injured in Belgorod, the BBC reports.\nDespite its constant attacks on Ukraine, Russia's ministry of defence put out an appalled statement vowing to retaliate and punish Ukraine for the overnight shelling.\nRussia made unverified claims that it identified the ammunition used in the strike as Czech-made Vampire rockets and Olkha cluster munitions.\nThe statement adds that if the Vilkha missiles hit their targets directly and released cluster munitions, \"the consequences would be immeasurably more severe\".\n\"This crime will not go unpunished,\" the statement concludes.\nUkraine has not yet commented directly on the situation in Belgorod, but Ukrainian media - citing intelligence sources - say only military targets have been attacked.\nIt has also claimed civilians were killed by faulty Russian missile defences rather than Ukrainian missiles.\nA Ukrainian media report, citing a security source, said Kyiv fired at military targets in Russia's Belgorod region, but \"due to unprofessional actions by Russian air defence\", fragments of munitions fell in the city centre.\nWebsite Pravda quoted the insider as saying that \"deliberate and planned provocations\" on the part of Russia were also to blame.\nUkrainian media reported a group of UAVs hit the Kremniy El plant, one of the largest manufacturers of electronics for Russian military equipment.\nIt reportedly included long-range missiles and Pantsir anti-aircraft systems.\nRussia's president has been briefed on the attacks, his spokesperson said.\nAn initial statement from the Russian defence ministry on Saturday said 13 missiles were destroyed over the wider region overnight.\nLater, it said 32 drones had been shot down in the Bryansk, Oryol, Kursk and Moscow regions\n\"Unlike the Russian terrorist attacks on the territory of Ukraine, the Security and Defense Forces attacked exclusively the enemy's military facilities,\" sources told Ukranian outlet Suspilne.\nThe governor of Bryansk region meanwhile said two villages were targeted and a child, born in 2014, had been killed.\nSeparately, the governor of nearby Belgorod said the attacks on the region had damaged 55 homes, two private businesses, a football ground, a leisure centre and a pre-school.\nCities across western Russia have come under regular attack from drones since May, with Russian officials blaming Kyiv.\nUkrainian officials haven't acknowledged responsibility for attacks on Russian territory or the Crimean peninsula.\nBut larger aerial strikes against Russia have previously followed heavy assaults on Ukrainian cities.\nRussian drone strikes against Ukraine continued on Saturday, with the General Staff of the Ukrainian Armed Forces reporting that 10 Iranian-made Shahed drones had been shot down across the Kherson, Khmelnytskyi, and Mykolaiv regions.\nOn Friday, Moscow's forces launched 122 missiles and dozens of drones across Ukraine, an 18-hour onslaught described by one air force official as the biggest aerial barrage of the war.\nAs well as the 39 deaths, at least 160 people were wounded and an unknown number were buried under rubble in the assault, which damaged a maternity hospital, apartment blocks, and schools.\nRussia's ongoing aerial attacks have also sparked concern for Ukraines neighbours.\nPoland's defense forces said Friday that an unknown object had entered the country's airspace before vanishing off radars, and that all indications pointed to it being a Russian missile, AP reports.\nSpeaking to Russian state media outlet RIA Novosti on Saturday, Russia's Charge d'Affaires in Poland, Andrei Ordash, said that Moscow would not comment on the event until Warsaw had given the Kremlin evidence of an airspace violation.\n\"We will not give any explanations until we are presented with concrete evidence because these accusations are unsubstantiated,\" he said.\nIt comes after a hacked document revealed how Putin was humiliated after losing 74 sailors when Ukraine blitzed warship Novocherkassk in a Storm Shadow missile strike.\nThe embarrassing death toll is far higher than Russia’s claim of one dead, a civilian port worker, and six wounded.\nAnother 27 were wounded in the attack on Feodosia port in annexed Crimea, according to the source.\nMoscow does not dare tell its people about the scale of the deaths and injuries - and has been seeking to downplay the losses.\nIt amounts to Putin's largest naval loss in a single incident during the 22-month war.\nThe destruction of the Novocherkassk landing ship claimed seven times more lives than the sinking of Putin's prized Moskva.\nThe new death toll was revealed in a document unearthed by the Ukrainian hacker group Cyber Resistance.\nIt showed Putin’s naval commander-in-chief Admiral Nikolai Yevmenov had even requested a rare day of mourning following the explosion.\nIt appears this request was never granted as the Kremlin seeks to downplay the military disaster.\nNovocherkassk was likely packed with munitions when it was hit by the Storm Shadow missile on Boxing Day.\nThe ship was torn apart and left nothing more than a twisted wreck.\nIt is also known that two pro-Putin media outlets in annexed Crimea - Sevastopol News portal and NTS media outlet - carried reports on the true death toll of 74.\nHowever, the publications quickly removed them - almost certainly based on censorship by the FSB counterintelligence service.\nThe reports remain available in cached files online.\nPutin has repeatedly refused to publish details of losses in a succession of war disasters.\nThe tyrant is reportedly furious in the wake of the attack, and on Friday launched a “revenge” missile and kamikaze drone onslaught on Ukraine.\nAt least 30 died and 160 were wounded.\n5 The Russian Ministry of Defense had announced earlier today it had allegedly repelled drone attacks Credit: Twitter/@Lastkombo", "source_domain": "www.thesun.co.uk", "text": null, "title": "Russia vows to 'punish' Ukraine after huge attack with 70 drones & missiles in one of deadliest strikes on Vlad's cities", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25201176/ukraine-massive-drone-strike-putin-russia/"}