{"authors": [], "date_download": "2024-02-05 15:20:56", "date_modify": "None", "date_publish": "2023-12-30 12:00:33", "description": "What to expect in Gaza, Ukraine, the US elections, China, Europe and the rest of the world", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F30%2Fworld-2024-guardian-writers-what-to-look-out-for.json", "image_url": "https://i.guim.co.uk/img/media/c80cc9d9c7a84607e042020e873ddf2943defd8a/168_463_4142_2485/master/4142.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1f2dfaf6c91d666c2a5d67e4ae24e871", "language": "en", "localpath": null, "maintext": "The year 2024 will be a critical one. The future of Gaza and the West Bank may hinge in part on whether Donald Trump returns to the White House – as may the outcome of the war in Ukraine. China will be locked in a race against time as its population ages. And the natural world will reach a new series of tipping points. But there are some reasons for cautious optimism.\nWith so much happening, it can be hard to know where to look. Here Guardian correspondents offer their take on what to watch out for in 2024.\nGaza conflict could spread to West Bank\nView image in fullscreen Protesters shout slogans during a rally in support of the Gaza Strip after the Friday noon prayer in Ramallah in the occupied West Bank on 29 December. Photograph: Zain Jaafar/AFP/Getty Images\nThe fifth and bloodiest Gaza war shows no sign of slowing or stopping.\nIsrael Defense Forces (IDF) officials have said they expect hostilities to continue into January before a second pause for humanitarian aid or an exchange of hostages and prisoners can take place. While Joe Biden has told Israel’s prime minister, Benjamin Netanyahu, his patience is wearing thin over the huge loss of Palestinian life, his administration has not followed through with cuts to military aid or arms and munitions sales.\nWhat “the day after” in Gaza will look like is still unclear. Netanyahu has ruled out allowing control of Gaza to revert to the West Bank’s weak and corrupt Palestinian Authority, which is in any case deeply unpopular with the Palestinian public. Israel’s far-right coalition government is unstable, but Netanyahu is determined to stay in office.\nThe fighting could spread to occupied East Jerusalem and the West Bank, where the Islamist group has active cells and higher levels of popular support. The risk of escalation between Israel and the formidable Iran-backed Shia faction Hezbollah to the north in Lebanon remains high.\nWhat 2024 will look like in Israel and the occupied Palestinian territories will also hinge on whether Trump wins November’s election in the US. The former president is a strong supporter of the Israeli right and could lend his approval to policies such as the annexation of the West Bank.\nBethan McKernan, Jerusalem correspondent\nThe ‘final battle’ for the White House\nView image in fullscreen Donald Trump arrives to speak at a campaign rally at the University of New Hampshire’s Whittemore Center Arena in Durham, New Hampshire, on 16 December. Photograph: Joseph Prezioso/AFP/Getty Images\nThe 2024 US presidential election will feel like the third episode of a trilogy. First, there was Trump’s shocking victory over Hillary Clinton in 2016. Then there was his bruising defeat by Biden in 2020, followed by election denialism and the storming of the US Capitol on 6 January 2021.\nNow, in November, comes what Trump has billed as “the final battle”. He is expected to dispense with Republican primary rivals Ron DeSantis and Nikki Haley in short order. Then he will seek to regain the White House while fending off 91 criminal charges in four jurisdictions, raising the unique prospect of a presidential nominee commuting between campaign rallies and courtrooms.\nTrump is already trying to blur the distinction and turn his legal troubles to his political advantage, claiming he is a victim of a deep state conspiracy. The White House may be his only get-out-of-jail card. That makes him desperate and dangerous.\nThe former president tells his supporters: “I am your retribution.” The lies are bigger, the grievances more petty, the extremism more extreme. There are plenty of pundits and historians who predict that a Trump second term would hollow out American democracy and spell a drift towards Hungarian-style authoritarianism.\nStanding in the way is Biden, who can point to a healthy economy, a long list of legislative accomplishments and robust support for reproductive rights. But he is, at 81, the oldest president in American history. Does he have what it takes for a long and gruelling campaign? Can he win back young and progressive voters disenchanted by his handling of the Israel-Hamas war?\nSome Democrats worry the answer is no, especially after a series of polls show Trump winning a hypothetical matchup, but struggle to come up with a viable alternative at this stage in the game. Their anxiety is heightened by potential third-party candidates and what might be the first “AI election”, with deepfakes set to turbocharge the crisis of trust and spread of disinformation.\nIt all makes for a combustible mix in a country where the threat of political violence is increasingly real. In 2020 the system performed admirably under the strains of the coronavirus pandemic and Trump’s attacks. The centre held and, as Biden put it, democracy prevailed. But it turns out that was not the end of the drama. The third act is still to come.\nDavid Smith, Washington bureau chief\nCrisis points for the natural world\nView image in fullscreen The McDougall Creek wildfire burns on the mountainside above houses in West Kelowna, British Columbia, Canada, on 18 August. Photograph: Darryl Dyck/AP\nAlongside increasingly alarming warnings about the state of Earth’s climate, the natural world is reaching a new series of crisis points. Wildlife populations have plunged by an average of almost 70% since 1970. Climate tipping points are approaching and our planet is on course to breach the 1.5C climate threshold by 2027. Humans are driving the largest loss of life since the time of the dinosaurs, and governments have repeatedly failed to take action, never meeting a single UN target on biodiversity loss.\nAt the end of 2022, the world came together at the biodiversity Cop15 in Montreal to agree on a new set of targets, promising that this decade would be different. In 2024, the world will meet again to check progress and there are signs that targets – which include protecting nearly a third of the planet for nature, restoring huge areas of degraded ecosystems and eliminating billions in harmful subsidies – are finally being taken more seriously.\nWhen the figures are in for 2023, the world may record a significant drop in deforestation for the first time in years, as leaders of countries that steward large rainforests take their responsibilities more seriously. Brazil and Colombia have both recorded slowing losses; Indonesia and Malaysia have maintained big falls. Amid the gloom, there is cause for optimism: stopping deforestation is crucial for keeping the 1.5C warming target alive and avoiding the destruction of some of the world’s most alive places.\nOver time, nature will continue gaining centrality in international negotiations, as seen with Cop28’s focus on agriculture – the main driver of biodiversity loss and responsible for a third of greenhouse emissions – and with the Cop16 biodiversity summit.\nAs the climate crisis escalates, it will accelerate the loss of wildlife. We are seeing increasing awareness that these two crises are entwined, and that understanding will only deepen as we see the effects of climate breakdown on the natural world, and the central role of nature-based solutions in addressing it.\nThe issue of nature loss will become even more prominent in 2024, as its consequences become more visible in back yards and beaches, and as people observe first-hand the decline of beloved species and precious ecosystems.\nPatrick Greenfield and Phoebe Weston, biodiversity correspondents\nA Chinese race against time\nView image in fullscreen Kindergarten children dressed in traditional floral-print padded coats perform to welcome the upcoming New Year’s Day on 29 December in Huzhou city, Zhejiang province, China. Photograph: VCG/Getty Images\n2024 will be the year in which Beijing learns the difference between what it can control – and what it can’t.\nThe year kicks off with a presidential election in Taiwan, which will set the tone for cross-strait relations for the next four years. Beijing still holds out (increasingly vain) hope of convincing Taiwan to accept annexation and is expected to wage interference and influence operations in an attempt to push voters towards Beijing-friendly candidates. But after years of escalating military harassment, threats and intimidation of the island, there is little appetite for Chinese rule.\nDomestically, the problems caused by China’s ageing, shrinking population will start to become even more acute. Despite a host of incentives to encourage people to have more children – including tax breaks, subsidised IVF and other subsidies – young women are refusing to toe the party line.\nAlthough Beijing has made it clear that procreation is a national priority, and tightened the atmosphere for open discussion such that feminist groups that promote child-free lives are shut down – women are voting with their bodies. With an ever-increasing cohort of pensioners who expect comfortable retirement support and are willing to protest when their benefits are cut, China’s policymakers will have to find alternative ways of supporting the greying population.\nOne way could be opening the door to migrant workers – an approach that China, like other east Asian countries, has long rejected. Although China has a worryingly high youth unemployment rate, many blue-collar industries such as manufacturing have labour shortages.\nThe government expects nearly 30m manufacturing jobs to go unfilled by 2025. Xi Jinping, China’s leader, has called on the country’s youth to “eat bitterness” – a Chinese phrase for enduring hardship – to help the economy. But as with the women who are refusing to have children, young people aren’t listening.\nAmy Hawkins, senior China correspondent, and Helen Davidson, correspondent in Taiwan\nSweden may finally join Nato\nView image in fullscreen A Swedish army combat team patrolling a village street in Gotland, Sweden. Photograph: Bezhav Mahmoud/TT News Agency/AFP/Getty Images\nIt’s nearly two years since Finland and Sweden’s then prime ministers, Sanna Marin and Magdalena Andersson, held a joint press conference in Stockholm in which they made their interest in joining Nato publicly known.\n“Everything had changed” with Russia’s invasion of Ukraine, said Marin.\nMuch has changed since that meeting of the two former Social Democrat leaders in April 2022. Marin, who has left politics for the Tony Blair Institute, and Andersson, now in opposition, have both been replaced and their countries’ planned joint route to Nato has diverged.\nWhile Finland sped ahead – joining Nato in April, marking the fastest Nato accession in the bloc’s history – Sweden’s application has stalled at the final hurdle as it continues to wait for the final green light from Turkey and Hungary.\nProviding this happens – experts say it’s a question of when rather than if, while Sweden’s defence minister, Pål Jonson, said in November he was confident Sweden would soon be a Nato member – the accession of historically neutral Sweden will mean that all of the Nordics will be represented in the alliance, creating a new power base in northern Europe and, critically, making the Baltic a Nato sea. Already, Sweden has signed a deal with the US giving full access to 17 of its military bases and Sweden’s Nato integration process is well under way.\nMiranda Bryant, Nordic correspondent\nA decisive year for Ukraine\nView image in fullscreen A missile explodes in the sky over Kyiv, Ukraine, on 29 December. Photograph: Gleb Garanich/Reuters\nUkraine enters the new year in perhaps a gloomier mood than at any time since the beginning of Russia’s full-scale assault on the country in February 2022. After the initial panic, in the first year of the war there was a national rallying around president Volodymyr Zelenskiy, remarkable resilience and a series of battlefield gains that led many to believe victory could be just around the corner.\nThe second half of 2023 provided a sobering counterpoint to those hopes: stalemate on the battlefield, rising casualties and exhaustion, and wavering international commitment, most notably from Ukraine’s key ally the US, as Republicans threatened to block US financial aid. In addition, back at home a simmering dispute between Zelenskiy’s team and the commander-in-chief, Valerii Zaluzhnyi, is increasingly spilling into public view.\nThe coming year is likely to be decisive for the war and the future of Ukraine, but how things pan out will depend on many things, not least on how strong western support remains for Kyiv. The impact on the tone and substance of the Ukraine debate of a Trump presidential run, let alone a victory, could be enormous.\nWhat happens in Moscow will be important, and the domestic political scene in Kyiv is also likely to become turbulent. The biggest question is whether Zelenskiy’s fears that Zaluzhnyi has political ambitions will turn out to be true.\nMarch 2024 was supposed to see presidential elections, with Zelenskiy’s five-year term expiring, but a brief floating of the idea of holding an election was met with fierce opposition by civil society and would-be political opponents, who claimed it would be supremely unfair to hold an election in wartime, and would simply result in a coronation for Zelenskiy.\nOne of the biggest questions is whether exhaustion and battlefield losses will force Kyiv to seek some kind of a peace deal with Moscow. Up to now, the realisation that any deal would be weak and likely to be discarded by Vladimir Putin whenever he felt ready to attack again has prevented all talk of a ceasefire. As the months tick by, that equation may change.\nShaun Walker, central and eastern Europe correspondent\nWill Argentina’s Javier Milei moderate now he is in power?\nView image in fullscreen Protesters rally against Javier Milei’s economic changes outside the supreme court in Buenos Aires on 27 December. Photograph: Rodrigo Abd/AP\nArgentina will enter uncharted political waters in 2024 after the radical libertarian Javier Milei became president in December, turning Buenos Aires into a new place of pilgrimage for the Trumpian global far-right.\nFew analysts dare to guess how Milei – a mercurial TV celebrity nicknamed “El Loco” (the madman) – will govern, although expect Donald Trump to visit him soon.\nDuring his insurgent campaign, the 53-year-old outsider brandished a chainsaw to symbolise his desire for radical change and austerity. Two days into his presidency he devalued Argentina’s currency by more than 50% and cut transport and energy subsidies.\nMilei claims such “shock’ measures are the only way to avoid a hyperinflation “catastrophe” – and millions of voters agree. But they will hit Argentina’s working and middle classes hard. Mass protest, violence and police repression are likely as social movements and unions take to the streets to resist Milei’s “anarcho-capitalist” shake-up. “We know that in the short term the situation will get worse,” the new president admitted in his inaugural speech.\nThe future is easier to predict in El Salvador, where another rightwing populist, Nayib Bukele, will seek reelection in February and is assured victory given the sky-high approval ratings his authoritarian crackdown on crime has produced. Tens of thousands have been jailed since Bukele imposed a “state of exception” in 2022, pacifying many gang-run barrios but stirring fears over El Salvador’s rapid transformation into a police state.\nThe result of Mexico’s election, in June, looks similarly predictable, with the outgoing president, Andrés Manuel López Obrador, likely to elect his chosen heir, Mexico City’s former mayor Claudia Sheinbaum. Sheinbaum would become Mexico’s first female (and first Jewish) president, although the opposition candidate, an Indigenous businesswoman called Xóchitl Gálvez, may give her a run for her money.\nIn Venezuela, the opposition leader María Corina Machado also hopes to become the first female president of her crisis-hit homeland by challenging Nicolás Maduro in the presidential election. But few fancy her chances against the authoritarian incumbent who took power in 2013 and shows no sign of relinquishing power. Some suspect Maduro is deliberately manufacturing a crisis with neighbouring Guyana over the Essequibo region in order to declare a state of exception and postpone an election he fears losing.\nIn Latin America’s biggest country, Brazil, the big question in 2024 is whether the former far-right president, Jair Bolsonaro, will face arrest for a litany of alleged crimes committed during his turbulent 2019-2023 presidency, including inciting the January 2023 uprising that sought to bring down the government of his successor.\nTom Phillips, Latin American correspondent\nMigration: a collective failure of Europe\nView image in fullscreen An Italian coastguard vessel carrying people rescued at sea passes a tourist boat near the Sicilian island of Lampedusa, Italy. Photograph: Yara Nardi/Reuters\nNearly 2,200 people have died or gone missing in 2023 while attempting to cross the central Mediterranean from north Africa to reach Europe. It is described as the world’s deadliest route and a liquid graveyard for thousands of asylum seekers, whose bodies wash up on the shores of north Africa every day.\nLampedusa, the small Sicilian island closer to Tunisia than Italy, has had an increase in migrant arrivals since last summer. To contain what rightwing governments in Europe describe as an “invasion”, Europe has once again raised walls at its borders by enacting controversial agreements with the countries from where the migrants depart, such as Tunisia, which has surpassed Libya as the main departure point for people trying to reach Italy.\nHowever, one of the most controversial deals was signed in early November by Italy’s far-right government, which announced plans to create centres in Albania to accommodate 3,000 asylum seekers.\nThe agreement has been criticised by aid workers and NGOs, who label it a “further blow” to EU solidarity and draw comparisons to the UK’s deal with Rwanda. Italy and the UK may have set a dangerous precedent that other countries dealing with an increase in migrant arrivals could follow.\nIn 2024, we may see non-EU countries transformed into detention centres in exchange for the promise of EU membership. Serbia and Bosnia, countries at the centre of the Balkan migration route, could benefit from such deals.\nThe more recent signal of this new shift in direction came before Christmas, as negotiators from the European parliament and the Council of the EU reached a political agreement on a fresh migration and asylum pact. The pact will encompass a pre-entry screening process and amplify dependence on countries beyond the EU to oversee migration affairs. By endorsing its deals, Brussels aims to transfer the responsibility of protecting people outside its borders.\nIn 2024, we may see fewer migrants on European territories, but an increasing number of deaths at the gates of Europe, with asylum seekers forced to undertake increasingly hazardous routes to avoid violence from border guards.\nLorenzo Tondo, Italy and the migration crisis correspondent\nPolitical timebombs in the European Union\nView image in fullscreen Geert Wilders arrives at Cafe Seepaardje to respond to the results of the Dutch elections on 22 November. Photograph: Hollandse Hoogte/Shutterstock\nPolitics in Brussels in 2024 will be dominated by three issues. Two of them are well known: Ukraine and migration. Both are challenging but the strategies are well rehearsed. But it is the spectre of far-right parties establishing themselves in the heart of the EU, the European parliament, that is causing nervousness that EU values around equality and discrimination will be challenged by those promoting xenophobia, racism and climate denial.\nThat is why there is such a rush to get new laws over the line in the first two months of 2024. With European parliamentary elections due to take place in June, the cut off point for new laws to be agreed is the second week in February, giving officials and politicians enough time to legally finesse and translate the laws before the final plenary session in April.\nThe complexion of the new parliament matters more than most because it will determine EU-wide priorities up to 2029 at a time when the EU is expected to expand to include Ukraine and Moldova. Hungary’s threats to block Ukraine’s entry in late 2023 is a flavour of how knife-edge enlargement could be.\nIf hard-right parties gain a foothold in parliament there are fears that the perceived “normalisation” will deliver electoral upsets elsewhere, including France. This is why the politics of migration is so important.\nOne senior official working in the field said the EU needed to make a quantum leap and “denationalise” the issue completely, setting up a continent-wide body to deal with it collectively.\n“Migration is here. It is a fact of life. Poverty and climate change in Africa will not go away. But the agenda is driven too much by national narratives about closing borders; there needs to be a complete change in approach,” the source said.\nLisa O’Carroll, Brussels correspondent\nFamiliar faces in south Asia\nView image in fullscreen Dancers welcome Mohammad Sayeed Khokon, an executive member of the Bangladesh Awami League Central Committee, during his election campaign in Dhaka, Bangladesh, on 28 December. Photograph: Anik Rahman/NurPhoto/Rex/Shutterstock\nAs it is in much of the world, 2024 will be a big year for elections in south Asia with Bangladesh, Pakistan and India all due to go to the polls within the first six months. Yet amid fears of rising authoritarianism across the region, few expect these elections to be a boost to democracy and instead will probably return some very familiar faces back to power at the top.\nIn the buildup to the Bangladesh election on 7 January, where the prime minister, Sheikh Hasina, is seeking a fourth term in power, all pretence of free and fair elections has gone. Tens of thousands of opposition leaders have been jailed, opposition protests have been hit with police violence and dozens have been killed.\nThe opposition Bangladesh National party has now said it will boycott the polls. The pre-election crackdown has been deemed so bad that the global watchdog Civicus has downgraded Bangladesh’s civil space to “closed”, its worst ranking.\nThere are similarly low expectations that Pakistan’s elections – due in early February but with strong suggestions of further delay – will offer voters a free or fair choice. Pakistan’s most popular political leader, the former prime minister Imran Khan, remains in jail after his spectacular fallout with the powerful military.\nA concerted effort has been made by the military to ensure that Khan will not be able to contest and that his Pakistan Tehreek-e-Insaf party has been systematically demolished, even as support among voters remains strong. Instead, the military’s chosen candidate will be the three-time former prime minister Nawaz Sharif, who has been brought back from the cold after five years of exile, in an attempt to bring back some stability to the economically ailing country. Despite several legal obstacles and lacklustre public support, Sharif’s return to power is seen as almost guaranteed.\nIn India there are almost 1 billion eligible voters and all eyes will also be on its elections expected to be held in April or May. With just a few months to go, the likelihood of the nationalist prime minister, Narendra Modi, returning to power for a third term is seen as almost inevitable.\nHe has overseen an unprecedented consolidation of power and his Hindu nationalist politics are highly popular, particularly in the populous northern states, while the opposition coalition is seen as weak and fractured and many of its leaders have been jailed. Yet in Modi’s first two terms, there was a rise of creeping authoritarianism and a persecution of minorities, and many fear a third term could see a further erosion of India’s democracy and religious equality.\nHannah Ellis-Petersen, South Asia correspondent\nRapprochement in north-east Asia\nView image in fullscreen The South Korean president, Yoon Suk Yeol (right), and the Japanese prime minister, Fumio Kishida, have spent this year mending fences. Photograph: Jung Yeon-je/AP\nThe year of the dragon could be when Japan’s prime minister, Fumio Kishida, finally runs out of puff. As his country prepared to see out 2023, his Liberal Democratic party [LDP] was embroiled in a funding scandal that could result in legal action being taken against MPs who allegedly failed to report income raised at party events. The first allegations were levelled at the largest faction – once headed by the assassinated former prime minister Shinzo Abe – but media reported in mid-December that prosecutors were also examining payments involving members of Kishida’s own faction. Japan is not due to hold a general election until October 2025 at the latest, but Kishida could face a challenger when the party votes for a president – who automatically becomes prime minister – in September 2024. Assuming that the deeply unpopular Kishida survives that long.\nNorth Korea’s sanctions-busting development of nuclear weapons, ballistic missiles and, in late 2023, spy satellites, has spawned a rapprochement of sorts between the leaders of north-east Asia’s three economic powerhouses: Kishida, the Chinese leader, Xi Jinping, and the South Korean president, Yoon Suk Yeol. South Korea and its former colonial ruler, Japan, spent this year mending fences after years of rancour over their wartime legacy. Now there is mild optimism that the spirit of cooperation could extend to Beijing, after the countries agreed that their leaders should meet in 2024 for the first time since 2019.\nJapanese politicians’ ties to the Unification Church continue to generate headlines 18 months after Abe’s assassination. The suspect, Tetsuya Yamagami, has told investigators the “Moonies” destroyed his family after his mother, a member, donated huge sums to the organisation. Yamagami, who blamed Abe’s grandfather for helping the conservative church gain a foothold in postwar Japan, will be back in the spotlight in 2024 if, as some media reports suggest, he appears in court in the first hearing of what promises to be one of the most closely watched trials in living memory.\nJustin McCurry, Japan and Korea correspondent", "source_domain": "www.theguardian.com", "text": null, "title": "The world in 2024: Guardian writers on what to look out for", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/30/world-2024-guardian-writers-what-to-look-out-for"}