{"authors": [], "date_download": "2024-02-05 15:20:57", "date_modify": "None", "date_publish": "2023-12-30 14:18:32", "description": "Russian emergency services say 10 people have been killed and 45 more injured by shelling on the border city of Belgorod", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Frussia-ap-moscow-ukraine-kyiv-b2471279.html.json", "image_url": "https://static.independent.co.uk/2023/12/30/14/Russia_Ukraine_54741.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nShelling in the center of the Russian border city of Belgorod killed 10 people and injured 45 more on Saturday, emergency services said.\nRussian officials accused Kyiv of carrying out the attack, which took place the day after an 18-hour aerial Russian barrage across Ukraine killed at least 39 civilians.\nImages of Belgorod on social media showed cars set alight and plumes of black smoke rising among damaged buildings as air raid sirens sounded. One strike hit close to a public ice rink in the very heart of the city.\nEarlier on Saturday, Moscow officials had reported shooting down 32 Ukrainian drones over the country’s Moscow, Bryansk, Oryol, and Kursk regions.\nThey also reported that cross-border shelling had killed two other people in Russia. A man died and four other people were injured when a missile struck a private home in the Belgorod region late Friday evening and a 9-year-old was killed in a separate incident in the Bryansk region.\nCities across western Russia have come under regular attack from drones since May, with Russian officials blaming Kyiv. Ukrainian officials never acknowledge responsibility for attacks on Russian territory or the Crimean peninsula. However, larger aerial strikes against Russia have previously followed heavy assaults on Ukrainian cities.\nRussian drone strikes against Ukraine continued Saturday, with the General Staff of the Ukrainian Armed Forces reporting that 10 Iranian-made Shahed drones had been shot down across the Kherson, Khmelnytskyi, and Mykolaiv regions.\nOn Friday, Moscow’s forces launched 122 missiles and dozens of drones across Ukraine, an onslaught described by one air force official as the biggest aerial barrage of the war.\nAs well as the 39 deaths, at least 160 people were wounded and an unknown number were buried under rubble in the assault, which damaged a maternity hospital, apartment blocks, and schools.\nWestern officials and analysts recently warned that Russia limited its cruise missile strikes for months in an apparent effort to build up stockpiles for massive strikes during the winter, hoping to break the Ukrainians’ spirit.\nFighting along the front line is largely bogged down by winter weather after Ukraine’s summer counteroffensive failed to make a significant breakthrough along the roughly 1,000-kilometer (620-mile) line of contact.\nRussia’s ongoing aerial attacks have also sparked concern for Ukraine’s neighbors.\nPoland’s defense forces said Friday that an unknown object had entered the country’s airspace before vanishing off radars, and that all indications pointed to it being a Russian missile.\nSpeaking to Russian state media outlet RIA Novosti Saturday, Russia’s Charge d’Affaires in Poland, Andrei Ordash, said that Moscow would not comment on the event until Warsaw had given the Kremlin evidence of an airspace violation.\n“We will not give any explanations until we are presented with concrete evidence because these accusations are unsubstantiated,” he said.", "source_domain": "www.independent.co.uk", "text": null, "title": "10 killed by shelling on Russia's Belgorod following Moscow's aerial assault against Ukraine", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/russia-ap-moscow-ukraine-kyiv-b2471279.html"}