{"authors": [], "date_download": "2024-02-05 15:20:58", "date_modify": "None", "date_publish": "2023-12-30 02:11:16", "description": "At least 30 killed and 160 wounded across Ukraine in what Kyiv calls biggest Russian air attack of war; Poland claims Russian missile entered its airspace", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F30%2Frussia-ukraine-war-at-a-glance-what-we-know-on-day-675.json", "image_url": "https://i.guim.co.uk/img/media/4498b1762c208a82f1cea0f5246688cea107339a/0_556_8402_5045/master/8402.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=619f4c6edd33a63c649ccaba64e71a29", "language": "en", "localpath": null, "maintext": "Russia launched a huge wave of missile strikes on Ukrainian cities, including the capital, in what Ukraine’s defence minister called the biggest air attack of the war. At least 30 civilians were killed and 160 injured in the strikes on residential buildings in Kyiv, Lviv, Kharkiv and other cities in the west and south on Friday morning. A shopping centre and maternity hospital were hit in the central city of Dnipro, Ukrainian officials said. In Odesa, three people were killed and another 26 injured, including two children and a pregnant woman, when three rockets hit residential buildings. Rescue operations were continuing in the cities.\nThe Ukrainian air force said it shot down 87 cruise missiles and 27 drones of a total 158 aerial “targets” fired by Russia. Kyiv’s defence minister, Rustem Umerov, said it was the “most massive air attack of this war”, which began in February 2022, and involved 18 strategic bombers. The army chief, Gen Valerii Zaluzhnyi, said infrastructure and industrial and military facilities had been targeted.\nVolodymyr Zelenskiy said Russia launched about 110 missiles in the attack. “Today, Russia used nearly every type of weapon in its arsenal,” the Ukrainian president said on social media. “Russian terror must and will lose.”\nPoland’s armed forces said an unknown airborne object, which they identified as a Russian missile, entered the country’s airspace from the direction of Ukraine for less than three minutes. “It was monitored by us on radars and left the airspace,” said Poland’s defence chief, Gen Wiesław Kukuła. The object penetrated about 40km (25 miles), Poland said, adding that Nato radar also confirmed the object left Polish airspace. The Russian charge d’affaires, summoned to the Polish foreign ministry, said Warsaw had provided no evidence of a missile entering its airspace.\nAt a hastily convened meeting of the UN security council, most council members – including the US, France and Britain – condemned the attacks. “Tragically, 2023 is ending as it began, with devastating violence against the people of Ukraine,” UN assistant secretary general Khaled Khiari said after briefing the council on the attacks.\nBritain will send about 200 air-defence missiles to Ukraine after the Russian strikes, the UK defence minister said on Friday. Grant Shapps posted on X (formerly Twitter) that Britain was “moving rapidly to bolster Ukraine’s air defence in the wake of Putin’s murderous airstrikes”. The prime minister, Rishi Sunak, said on social media: “These widespread attacks on Ukraine’s cities show Putin will stop at nothing to achieve his aim of eradicating freedom and democracy.”\nA Ukrainian strike on a residential building in the Russian city of Belgorod left one person dead, the regional governor said late on Friday. The attack killed one person and wounded four others, Vyacheslav Gladkov said, adding that the city’s water supply system was damaged. The Russian defence ministry said air defence systems destroyed a total of 13 missiles over the region, which borders Ukraine.\nThe US president, Joe Biden, demanded Congress “step up” and overcome divisions on sending aid to Ukraine, saying the massive Russian air attack demonstrated that the Kremlin hoped to “obliterate” the pro-western country. Biden said in a statement: “Unless Congress takes urgent action in the new year, we will not be able to continue sending the weapons and vital air defense systems Ukraine needs to protect its people. Congress must step up and act without any further delay.”\nUkrainian officials urged the country’s western allies to provide it with more air defences to protect itself against aerial attacks such as Friday’s. Their appeals have come as signs of war fatigue strain efforts to keep support in place.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war at a glance: what we know on day 675", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/30/russia-ukraine-war-at-a-glance-what-we-know-on-day-675"}