{"authors": [], "date_download": "2024-02-05 15:20:59", "date_modify": "None", "date_publish": "2023-12-30 14:25:05", "description": "Russia’s top diplomat in Poland says Moscow won't provide any explanations about an unidentified object that briefly entered Poland’s airspace until it receives evidence that shows the object was a Russian missile", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fpoland-ap-warsaw-russia-ukraine-b2471283.html.json", "image_url": "https://static.independent.co.uk/2023/12/30/14/Poland_Ukraine_58765.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussia will not provide any explanations about an unidentified object that briefly entered Poland’s airspace until it receives evidence that shows the object was a Russian missile, Russia’s top diplomat in Poland said Saturday.\nPoland’s defense forces said an unknown object traveled 40 kilometers (24 miles) into the country’s airspace Friday from the direction of Ukraine before leaving minutes later and vanishing off radars. The head of the Polish armed forces, Gen. Wiesław Kukuła, said “everything indicates” it was a Russian missile.\nPoland’s Foreign Ministry demanded explanations from Moscow. Russia’s charge d’affaires in Warsaw, Andrei Ordash, told Russian state news agency RIA Novosti on Saturday that Poland's claims were “unsubstantiated.”\n“We will not give any explanations until we are presented with concrete evidence, because these accusations are unsubstantiated,” Ordash told RIA Novosti.\nSome 500 Polish Territorial Defense troops were combing an area between the city of Zamosc and the border with Ukraine for any traces of the object.\nPoland’s border with Ukraine is also the European Union and NATO's border with Ukraine.", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia wants evidence before giving explanations about an object that entered Poland's airspace", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/poland-ap-warsaw-russia-ukraine-b2471283.html"}