{"authors": ["Léonie Chao-Fong", "Maya Yang", "Martin Belam", "Reged Ahmad"], "date_download": "2024-02-05 15:20:59", "date_modify": "None", "date_publish": "2023-12-30 00:08:59", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F29%2Fisrael-gaza-war-live-updates-hamas-egypt-delegation-ceasefire-cairo.json", "image_url": "https://i.guim.co.uk/img/media/9d55c0654c420b24c85a3c65b9f611f8c2d0b89b/0_105_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=b28f182969075a97061bcf2a38580e0a", "language": "en", "localpath": null, "maintext": "From 29 Dec 2023 20.05 CET Israel rejects genocide case as 'baseless' - full statement Here’s the full Israeli foreign ministry response to news that South Africa has launched a case at the International court of justice (ICJ) accusing Israel of “genocidal” acts in Gaza. Israel rejects “with disgust” the “blood libel” spread by South Africa in its application to the UN’s top court, Israeli foreign ministry spokesperson Lior Haiat posted on social media. He continued: South Africa’s claim lacks both a factual and a legal basis, and constitutes a despicable and contemptuous exploitation of the Court. South Africa is cooperating with a terrorist organization that is calling for the destruction of the State of Israel. The Hamas terrorist organization - which is committing war crimes, crimes against humanity and sought to commit genocide on 7 October - is responsible for the suffering of the Palestinians in the Gaza Strip by using them as human shields and stealing humanitarian aid from them. Israel is committed to international law and acts in accordance with it, and directs its military efforts solely against the Hamas terrorist organization and the other terrorist organizations cooperating with Hamas. Israel has made it clear that the residents of the Gaza Strip are not the enemy, and is making every effort to limit harm to civilians and to facilitate the entry of humanitarian aid to the Gaza Strip. We call on the International Court of Justice and the international community to completely reject South Africa’s baseless claims. Israel rejects with disgust the blood libel spread by South Africa in its application to the International Court of Justice (ICJ).\nSouth Africa's claim lacks both a factual and a legal basis, and constitutes a despicable and contemptuous exploitation of the Court.\nSouth Africa… pic.twitter.com/dqyhY8WYE0 — Lior Haiat 🇮🇱 (@LiorHaiat) December 29, 2023\nUpdated at 21.42 CET\n29 Dec 2023 00.49 CET Three Palestinian brothers who were detained by Israeli soldiers in Gaza have said they and other men were beaten, stripped to their underwear, burnt with cigarettes and subjected to other forms of mistreatment during their detention. Sobhi Yaseen, his brothers Sady and Ibrahim told Reuters they were taken by the Israeli military from their homes in northern Gaza in early December, and held for up to two weeks at unknown locations including a military barracks or camp. Sobhi told the news agency that while he was detained, he was beaten and that his captors were “smoking and putting out cigarettes on our backs, spraying sand and water on us, urinating on us”. Ibrahim described having his hands bound and being blindfolded as he was held for interrogation. He said he was not allowed to sleep and forced to stand for hours, while soldiers “would hit you alternately in the head and body”. In response, the Israel Defence Forces (IDF) spokesperson’s office said it was operating “to dismantle Hamas’ military capabilities” and rescue hostages captured by the Palestinian militant group. Detainees were treated in accordance with international law, and were often required to hand over clothes to ensure they were not carrying weapons or explosives, the office said.\n29 Dec 2023 00.19 CET The UK ambassador to the United Nations underscored her country’s commitment to Israel’s security during her address to security council members in New York. Barbara Woodward, speaking at a UN security council meeting earlier today, noted Israel’s need to address the threat posed by Hamas “but too many civilians have been killed”. She said Israel must comply with international humanitarian law and clearly differentiate between terrorists and civilians during its military actions. Israel must also stop settler violence immediately and hold the perpetrators accountable, she said, as she urged Israel to adhere to its commitments and cease all settlement activity in the Occupied Palestinian Territory. Both Israel and the Palestinian Authority (PA) should demonstrate a genuine commitment to a two-State solution, she added.\n29 Dec 2023 23.27 CET A Hamas official has responded to Israeli media reports that the militant group has “agreed in principle” to resume talks on a new hostage release deal. As we reported earlier, a report claimed Qatari mediators have told Israel that Hamas “agrees in principle” to return to the negotiating table to try to reach a deal on the release of further hostages held in Gaza in exchange for a weeks-long pause in fighting. Osama Hamda, a senior Hamas official, told Al Jazeera that there is currently no talk of a hostage exchange before fighting in Gaza stops. He added that a possible release of captives in exchange for a month-long ceasefire, a detail that was reported by Israeli media, has not been discussed.\n29 Dec 2023 23.12 CET A US citizen living in Egypt was arrested in Kenya after allegedly seeking to join a terrorist organisation in the wake of the Hamas 7 October attacks on Israel, authorities said. Karrem Nasr, 23, of Lawrenceville, New Jersey, was arrested on 14 December after flying from Egypt to Nairobi, where he was planning to meet with members of the al-Shabaab terrorist group before travelling to train in Somalia, where the terror organisation is based, according to federal prosecutors. Nasr was “motivated by the heinous terrorist attack perpetrated by Hamas” on 7 October and “devoted himself to waging violent jihad against America and its allies,” they said. He was returned to the US on Thursday and was scheduled to appear on Friday before a federal magistrate in Manhattan, AP reported. He has been charged with attempting to provide material support to a designated foreign terrorist organisation, and faces up to 20 years in prison if convicted.\n29 Dec 2023 22.58 CET Julian Borger Any case at the UN’s international court of justice (ICJ) is likely to take years to resolve, but South Africa has called for the court to convene in the next few days to issue “provisional measures” calling for a ceasefire in Gaza. In March 2022, the ICJ ordered Russia to halt its offensive in Ukraine, an order which was supposed to be legally binding, but Moscow ignored it anyway. Any such ruling however is likely to significantly sway international public opinion. Article IX of the Genocide Convention allows any state party to the convention to bring a case against another to the ICJ, even if it doesn’t have any direct link to the conflict in question. Last year, the court ruled that the Gambia could bring a genocide claim against Myanmar. The court also ruled in a case between Croatia and Serbia that depriving a people of food, shelter, medical care and other means of subsistence constitutes genocidal acts. Susan Akram, director of the international human rights clinic at Boston University, said: Genocidal intent is assumed to be the most difficult element to prove, but Israelis in charge of prosecuting this conflict have made a plethora of statements that easily prove the requisite intent to ‘destroy in whole or in part’ the Palestinian population in Gaza. As examples, Akram pointed to Israeli defence minister Yoav Gallant’s reference to Palestinians in Gaza as “human animals” and Israeli army Major General Ghassan Alian’s subsequent statement that: “Human animals must be treated as such. There will be no electricity and no water [in Gaza], there will only be destruction. You wanted hell, you will get hell.”\n29 Dec 2023 22.37 CET Biden bypasses Congress again for weapons sale to Israel The Joe Biden administration has once again bypassed congressional review for weapons sale to Israel as more than 21,000 Palestinians have been killed by Israeli strikes since October 7. On Friday, the US state department said that secretary of state Antony Blinken informed Congress that he had made a second emergency determination covering a $147.5m sale for equipment required to make the 155mm shells that Israel has already purchased function. The State department said: Given the urgency of Israel’s defensive needs, the secretary notified Congress that he had exercised his delegated authority to determine an emergency existed necessitating the immediate approval of the transfer. The emergency determination allows the purchase to bypass the requirement of congressional review for foreign military sales. Earlier this month, Blinken made a similar decision, approving $106m worth of 14,000 rounds of tank ammunition to Israel. For the full story, click here: Biden administration again bypasses Congress for weapons sale to Israel Read more\nUpdated at 22.50 CET\n29 Dec 2023 22.14 CET A member of the UK parliament, Claudia Webbe, has hailed South Africa’s decision to launch a case against Israel in the International Court of Justice over accusations of Israel committing “genocidal” acts in Gaza. Webbe, who represents Leicester East, tweeted: “I fully support South Africa invoking the Genocide Convention today, against Israel, at the International Court of Justice. The UK government, prime minister and Labour party leader should consider their complicity and position. Ceasefire now.” As a UK Member of Parliament, I fully support South Africa invoking the Genocide Convention today, against Israel, at the International Court of Justice.\nThe UK government, Prime Minister and Labour Party leader should now consider their complicity and position.\nCeasefire Now — Claudia Webbe MP (@ClaudiaWebbe) December 29, 2023", "source_domain": "www.theguardian.com", "text": null, "title": "UN humanitarian chief ‘strongly condemns’ attack on aid convoy - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/29/israel-gaza-war-live-updates-hamas-egypt-delegation-ceasefire-cairo"}