{"authors": [], "date_download": "2024-02-05 15:21:02", "date_modify": "None", "date_publish": "2023-12-30 22:16:07", "description": "The South American country and its neighbour Guyana, a former British colony, are involved in a territorial dispute.", "filename": "https%3A%2F%2Fguernseypress.com%2Fnews%2Fworld-news%2F2023%2F12%2F30%2Ftroops-to-stay-in-place-until-imperialist-british-boat-leaves-says-venezuela%2F.json", "image_url": "https://www.guernseypress.com/resizer/AMDr7I06eMp0_vQHVJSEg7-QlAM=/1200x900/cloudfront-us-east-1.images.arcpublishing.com/mna/EBWJ6Q7KHVGC3J6IGY5DLQQWAA.jpg", "language": "en", "localpath": null, "maintext": "Venezuela said on Saturday it will continue to deploy nearly 6,000 troops until a British military vessel sent to neighbouring Guyana leaves the waters off the coast of the two South American nations.\nIn a video posted to X, the Venezuelan defence minister, Vladimir Padrino, appeared surrounded by military officers in front of a marked up map of Venezuela and Guyana, a former British colony.\nMr Padrino said the forces are “safeguarding our national sovereignty”.\n“Armed forces have been deployed not just in the east of the country, but across the entire territory,” he said.\nThe defense ministry confirmed to the Associated Press that the video was made at a military base in Venezuela’s capital, Caracas.\nThe video comes after weeks of tensions between the two countries over Venezuela’s renewed claim to a region in Guyana known as Essequibo, a sparsely populated stretch of land roughly the size of Florida that is rich in oil and minerals.\nOperations generate about 1.0 billion US dollars (£780 million) a year for the impoverished country of nearly 800,000 people that saw its economy expand by nearly 60% in the first half of this year.\nVenezuela has long argued it was cheated out of the territory when Europeans and the US set the border.\nGuyana, which has controlled the zone for decades, says the original agreement was legally binding and the dispute should be decided by the International Court of Justice in the Netherlands.\nThe century-old dispute was recently reignited with the discovery of oil in Guyana, and has escalated since Venezuela reported that its citizens voted in a December 3 referendum to claim Essequibo, which makes up two-thirds of its smaller neighbour.\nCritics of Venezuelan president Nicolas Maduro say the socialist leader is using the tensions to distract from internal turmoil and stoke nationalism in the lead-up to presidential elections next year.\nIn recent weeks, the leaders of Guyana and Venezuela promised in a tense meeting that neither side would use threats or force against the other, but failed to reach agreement on how to address the bitter dispute.\nTensions came to another head with Friday’s arrival in Guyana of the Royal Navy patrol ship, HMS Trent, most recently used to intercept pirates and drug smugglers off Africa.\nIt is equipped with cannons and a landing pad for helicopters and drones and can carry about 50 Royal Marines.\nMr Maduro said the ship’s deployment violates the shaky agreement between Venezuela and Guyana, calling its presence a threat to his country.\nIn response, Maduro ordered Venezuela’s military – including air and naval forces – to conduct exercises near the disputed area.", "source_domain": "guernseypress.com", "text": null, "title": "Troops to stay in place until ‘imperialist’ British boat leaves, says Venezuela", "title_page": null, "title_rss": null, "url": "https://guernseypress.com/news/world-news/2023/12/30/troops-to-stay-in-place-until-imperialist-british-boat-leaves-says-venezuela/"}