{"authors": [], "date_download": "2024-02-05 15:21:04", "date_modify": "None", "date_publish": "2023-12-30 21:49:33", "description": "Venezuela says it will continue to deploy nearly 6,000 troops until a British military vessel sent to neighboring Guyana leaves the waters off the coast of the two South American nations", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fvenezuela-ap-guyana-british-nicolas-maduro-b2471386.html.json", "image_url": "https://static.independent.co.uk/2023/12/30/21/Venezuela_Guyana_Territorial_Dispute_14498.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nVenezuela said Saturday it will continue to deploy nearly 6,000 troops until a British military vessel sent to neighboring Guyana leaves the waters off the coast of the two South American nations.\nIn a video posted to X, Venezuelan Defense Minister Vladimir Padrino appeared surrounded by military officers in front of a marked up map of Venezuela and Guyana, a former British colony.\nPadrdino said the forces are “safeguarding our national sovereignty.”\n“Armed forces have been deployed not just in the east of the country, but across the entire territory,\" he said. \"They will be there until this British imperialist boat leaves the disputed waters between Venezuela and Guyana.\"\nThe Defense Ministry confirmed to The Associated Press that the video was made at a military base in Venezuela's capital, Caracas.\nThe video comes after weeks of tensions between the two countries over Venezuela's renewed claim to a region in Guyana known as Essequibo, a sparsely populated stretch of land roughly the size of Florida that is rich in oil and minerals. Operations generate some $1 billion a year for the impoverished country of nearly 800,000 people that saw its economy expand by nearly 60% in the first half of this year.\nVenezuela has long argued it was cheated out of the territory when Europeans and the U.S. set the border. Guayana, which has controlled the zone for decades, says the original agreement was legally binding and the dispute should be decided by the International Court of Justice in the Netherlands.\nThe century-old dispute was recently reignited with the discovery of oil in Guyana, and has escalated since Venezuela reported that its citizens voted in a Dec. 3 referendum to claim Essequibo, which makes up two-thirds of its smaller neighbor.\nCritics of Venezuelan President Nicolas Maduro say the socialist leader is using the tensions to distract from internal turmoil and stoke nationalism in the lead up to presidential elections next year.\nIn recent weeks, the leaders of Guyana and Venezuela promised in a tense meeting that neither side would use threats or force against the other, but failed to reach agreement on how to address the bitter dispute.\nTensions came to another head with Friday's arrival in Guyana of the Royal Navy patrol ship HMS Trent, most recently used to intercept pirates and drug smugglers off Africa. It is equipped with cannons and a landing pad for helicopters and drones and can carry around 50 marines.\nMaduro said the ship's deployment violates the shaky agreement between Venezuela and Guyana, calling its presence a threat to his country. In response, Maduro ordered Venezuela's military — including air and naval forces — to conduct exercises near the disputed area.\n“We believe in diplomacy, in dialogue and in peace, but no one is going to threaten Venezuela,” Maduro said. “This is an unacceptable threat to any sovereign country in Latin America.”\nGuyana's government rejected Maduro's claims, with officials saying that the visit was a planned activity aimed at improving the nation’s defense capabilities and that the ship’s visit would continue as scheduled.\nDuring talks earlier in December, Guyanese President Irfaan Ali said his nation reserved its right to work with partners to ensure the defense of his country. Guyana has a military of only 3,000 soldiers, 200 sailors and four small patrol boats known as Barracudas, while Venezuela has about 235,000 active military personnel in its army, air force, navy and national guard.\n“Nothing that we do or have done is threatening Venezuela,” Guyana’s vice president, Bharrat Jagdeo, told reporters in Georgetown, the nation’s capital.", "source_domain": "www.independent.co.uk", "text": null, "title": "Venezuela says troops will stay deployed until British military vessel leaves waters off Guyana", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/venezuela-ap-guyana-british-nicolas-maduro-b2471386.html"}