{"authors": [], "date_download": "2024-02-05 15:21:05", "date_modify": "None", "date_publish": "2023-12-30 12:51:16", "description": "Charities say the situation is so bad that ‘in an ocean of human misery and in a world that seems to be falling apart, Gaza stands out’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-gaza-war-death-toll-children-b2470815.html.json", "image_url": "https://static.independent.co.uk/2023/12/28/09/Israel_Palestinians_96562.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael’s bombardment of Gaza has caused a record-breaking number of child casualties and a pace of killing “unseen in a generation”, human rights groups have warned, as Israeli tanks push deeper into the besieged strip.\nIsrael unleashed a total siege and its heaviest targeting yet of Gaza in retaliation for the 7 October attack by Hamas who killed 1,200 people and took 240 hostages.\nSince then, Israeli strikes have killed at least 21,000 people, three-quarters of them women and children, while thousands more are feared trapped under rubble, according to the health ministry in the Hamas-run strip.\nIsrael has questioned the death toll but provided no alternative. Its army has expressed regret for civilian deaths, accusing Hamas of operating in densely populated areas and using civilians as human shields – a charge the group denies.\nThe speed and intensity of the killings is “record-breaking”, said James Denslow from Save the Children, adding that the charity had estimated more than 30,000 children have been killed or maimed over the past 12 weeks.\nThey based their calculations on a combination of Gaza ministry of health numbers and UN figures, plus other reports of casualties and those missing on the ground.\n“This is the highest number of children killed and maimed in one conflict since 2006 when United Nations records began,” Mr Denslow told The Independent.\n“This is also 21 times higher than the number of children killed and maimed in Ukraine last year,” he added.\nThe UN has verified that 131,311 children have been killed or maimed across conflict situations since 2006. These numbers – which go up to 2022 – are woefully low estimates, particularly in countries such as Syria, where rights groups say accessing the death toll is near impossible.\n“But even if we go by the caveated numbers in Gaza, in just over two months they are already a quarter of a way through that total number of children killed and maimed in 17 years,” said Mr Denslow. “For the intensity, it is something I have never seen before.”\nPalestinian children wait to receive food cooked by a charity kitchen in Rafah (Reuters)\nJan Egeland, head of the Norwegian Refugee Council, said that aside from the besieged areas of Syria during the worst days of 2015, the “scale of the killing of civilians has not been seen in a generation”.\nHe said such a child death toll had not likely been recorded since the genocide in Rwanda 30 years ago.\n“In an ocean of human misery and in a world that seems to be falling apart, Gaza stands out,” he added.\nAn Israeli military spokesperson said: “The IDF [Israel Defense Forces] is committed to mitigating civilian harm during operational activity. In that spirit, the IDF makes great efforts to estimate and consider potential civilian collateral damage in its strikes... IDF military lawyers are on hand at all levels of command to ensure that strikes comply with international legal obligations, including proportionality.”\nMore than 2.3 million people – half of them children – live in Gaza, a tiny 42km strip that even before the war was subject to a crippling 15-year siege by both Israel and Egypt.\nThe UN has repeatedly begged for a ceasefire saying there are no safe areas within the strip and no way to get out for civilians who have been displaced multiple times since October and are running out of food, water and medical supplies.\nDespite international pleas to wind down the attack, including from its ally the US, Israel has only escalated its ground offensive in Gaza in the closing days of the year.\nYoung children arrive at Nasser Hospital in Khan Younis after being injured in Israeli airstrikes (Getty Images)\nThis week, Israeli tanks thrust deep into central Gaza after days of relentless bombardment that forced tens of thousands of already displaced Palestinian families to flee to the overwhelmed city of Deir al-Balah along the Mediterranean coast.\n“Over 150,000 people – young children, women carrying babies, people with disabilities and the elderly – have nowhere to go,” the main UN organisation operating in Gaza, UNRWA, said in a social media post.\nGaza’s health ministry said on Thursday the humanitarian and health conditions of the now 1.9 million displaced people have reached “catastrophic levels beyond description”.\nHalf of the displaced are children who are now struggling with dehydration, malnutrition, respiratory and skin diseases and extreme cold, the statement added. Some 50,000 pregnant women, meanwhile, are suffering from thirst and malnutrition.\nAmid growing alarm, the UN Security Council last week adopted a resolution to boost humanitarian aid but stopped short of calling for a ceasefire after a week of vote delays and intense negotiations to avoid a United States veto.\nThe US and Israel oppose a ceasefire, believing it would only benefit Hamas. Washington instead supports pauses in fighting to protect civilians and free hostages taken by Hamas.\nPalestinian children sit by the fire next to the rubble of a house in Khan Younis (Reuters)\nRights groups say without a proper ceasefire it is impossible to tend to the needs of the civilians under such conditions.\n“There are around 300,000 destroyed or damaged housing units. It is impossible to provide emergency shelters and do repairs for more than 1.2 million people,” Mr Egeland said.\nIsrael has defended its actions, saying it has identified a “humanitarian zone” for civilians in an area called Mawasi – which is smaller than London’s Heathrow airport.\n“Mawasi is a ‘moonscape’,” Mr Egeland continued. “You can't put 1.5 million people on the moon without water, without shelter, without toilets.”\nMr Denslow said this deadly combination of the geography of Gaza, the density of demographics, the percentage of children, the use of explosive weapons with a wide area affected, and the ferocity of the hostilities had led to the record-breaking casualty toll.\n“Children are unable to get away from the front line. There are no safe places. And the death toll is just the top of the pyramid of harm,” he said.\n“Below that are serious life-changing injuries, [and] then the fact that people are homeless.\n“Below is the mental health impact this will have. Four out of five children in Gaza were already showing signs of depression before the war, which is the fifth conflict any 15-year-old in Gaza would have experienced.\n“Their resilience levels have been shot to pieces by recent history that has no endgame in sight.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel-Gaza war: Israeli bombing is killing and maiming children at a record pace, warn human rights groups", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-war-death-toll-children-b2470815.html"}