{"authors": ["Reged Ahmad", "Léonie Chao-Fong", "Maya Yang", "Martin Belam", "Helen Livingstone"], "date_download": "2024-02-05 15:21:06", "date_modify": "None", "date_publish": "2023-12-29 00:52:12", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F28%2Fisrael-gaza-war-live-macron-calls-for-lasting-ceasefire-as-israel-intensifies-attacks-on-gaza.json", "image_url": "https://i.guim.co.uk/img/media/3b2507a236b08bc126c2505538c7f93136f474cf/115_129_5483_3290/master/5483.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d2c833be35fa7e43eb32384dc030391a", "language": "en", "localpath": null, "maintext": "From 28 Dec 2023 18.40 CET Israeli military 'regrets harm to civilians' after dozens killed in refugee camp strike The Israeli military has said it “regrets the harm” caused by an Israel Defense Forces (IDF) strike that killed dozens of people in the Maghazi refugee camp in the centre of Gaza earlier this week. About 86 people were killed in the Israeli airstrike in the Maghazi camp, east of Deir al-Balah, late on Sunday, according to figures by the UN human rights office. An Israeli military official, speaking to Israel’s Kan news today, said: The type of munition did not match the nature of the attack, causing extensive collateral damage that could have been avoided. 00:01:33 Gaza refugee camp reduced to rubble after one of deadliest nights of Israel-Gaza war – video In a later statement, the IDF said: A preliminary investigation revealed that additional buildings located near the targets were also hit during the strikes, which likely caused unintended harm to additional uninvolved civilians. The IDF said it “regretted the harm” to noncombatants in the incident, saying that the strike had targeted Hamas operatives but caused unexpected harm to civilians who were not involved.\nUpdated at 18.49 CET\n29 Dec 2023 01.52 CET This blog is now closing and a new one will open later today, but for all of our latest updates – see our full coverage of the Israel-Gaza war, and a summary of the key events so far.\n29 Dec 2023 01.45 CET The United Nations Office for the Coordination of Humanitarian Affairs (OCHA) has released its daily report on the war. Here is what the report had to say on internally displaced people: Preliminary estimates by humanitarian actors on the ground indicate that at least 100,000 internally displaced persons (IDPs) have arrived in Rafah over the past days, following the intensification of hostilities in Khan Younis and Deir al Balah, and the Israeli army’s evacuation orders. Already on 20 December, Rafah was estimated to be the most densely populated area in Gaza, exceeding 12,000 people per square kilometre. The new influx of IDPs has further exacerbated conditions related to the already overcrowded space and limited resources. And this on aid: Supplies of medical aid and food have continued to entered Gaza in the past days through Rafah crossing with Egypt. This included 110 trucks on 27 December and another 76 trucks on 28 December. These quantities remain well below the daily average of 500 truckloads (including fuel and private sector goods) that entered every working day prior to 7 October. Key impediments remain on carrying out humanitarian operations inside Gaza. As noted by the Secretary-General, “an effective aid operation in Gaza requires security; staff who can work in safety; logistical capacity; and the resumption of commercial activity. These four elements do not exist.”\n29 Dec 2023 01.23 CET Let’s find out more about Judith Weinstein – An American, Canadian and Israeli woman who was thought to have been held hostage in Gaza. Weinstein and her husband, Gad Haggai, had been thought to be among the hostages still held in captivity. Six days ago, the Israeli kibbutz that they lived in, Nir Oz, announced that Haggai was killed on 7 October and his body was taken to Gaza. On Thursday, the kibbutz said it had learned that Weinstein was also killed on the same day and her body is also being held in Gaza, Associated Press reports. It was not immediately clear how Israeli authorities determined their deaths. US president Joe Biden said he was “devastated” to learn of Weinstein’s death, especially after hearing about the couple during a meeting with their daughter. The families “have been living through hell for weeks. No family should have to endure such an ordeal,” he said in a statement. It’s understood that Weinstein, 70, and Haggai, 73, were taking an early morning walk near their home in kibbutz Nir Oz on the morning of the attack. Weinstein was born in New York and was an active member of the kibbutz, a small community near the Gaza border, where she taught English to children with special needs. The kibbutz said she also taught meditation techniques to children and teenagers who suffered from anxiety as a result of rocket fire from Gaza. Haggai was a retired chef and jazz musician. “Judy dedicated her life to serving others, spending years teaching English and using her passions for poetry, puppeteering, and mindfulness to empower children of all backgrounds,” her family said in a statement. Nir Oz was one of the hardest-hit Israeli communities on 7 October with roughly one quarter of its residents killed or kidnapped.\nUpdated at 01.27 CET\n29 Dec 2023 01.00 CET The Palestinian Freedom Theatre in the occupied West Bank will welcome actors back this weekend, just over a fortnight after an Israeli raid on the centre, Agence France Presse reports. Its artistic director Ahmed Tobasi told AFP the theatre in Jenin refugee camp had become a symbol of Palestinian resistance against Israel’s occupation of the West Bank. He said troops broke into and vandalised the small cultural centre earlier this month during a wider raid on Jenin, leaving behind a trail of damage and Stars of David graffitied across the walls. The theatre said soldiers also arrested several employees in their homes. Tobasi, who said he was among those detained, is now back at work and determined to keep the centre open. “For me, this is resistance,” the 39-year-old said as he gave AFP a tour of the theatre, which was set up in 2006. Soon after the raid on 13 December a Freedom Theatre appeal for the release of its staff won international support, with demonstrations in the streets of New York and Paris and playwrights, actors and directors from Britain to Mexico expressing their support. The Israeli army described the wider raid on Jenin, which Palestinian health authorities say killed 11 people, as designed to combat “terrorists” in the camp. Staff spent several days clearing up and plan to stage their first big event, an end-of-year workshop for young actors, on Sunday. The army has not responded to AFP’s request for comment.\n28 Dec 2023 00.40 CET Reged Ahmad here picking up the blog from Leonie Chao-Fong. Italy has objected to Israel’s intention to nominate the mayor of one of the main West Bank settlements as ambassador to Rome, Agence France-Presse is reporting – citing a diplomatic source. In July, the Israel’s foreign ministry put forward the name of Benny Kashriel, mayor of Ma’ale Adumim, near Jerusalem, to succeed Alon Bar, a career diplomat due to retire in the summer of 2024. Kashriel, 72, has been mayor of the urban settlement of nearly 40,000 inhabitants since 1992, and heads a local branch of the right-wing Likud party of prime minister Benjamin Netanyahu. Israel has not yet submitted an official request to Rome for accreditation. But a diplomatic source told AFP on Thursday, confirming press reports, that Italian authorities had sent a number of messages indicating that they considered the appointment inappropriate. Contacted by AFP, Israel’s foreign ministry declined to comment. Italy’s right-wing coalition government led by Giorgia Meloni supports Israel in its war against Hamas in the Gaza Strip. But Rome also considers that the settlements established in the Palestinian territories occupied by Israel since 1967 – and deemed illegal by the United Nations – are an obstacle to peace.\n28 Dec 2023 23.44 CET Israeli airstrikes hit near the Syrian capital, Damascus, and in the country’s south, Syria’s defence ministry and state media has said. A statement from the Syrian defence ministry reads: At approximately 23:05 (20:05 GMT) today, the Israeli enemy carried out air strikes from the direction of the occupied Syrian Golan, targeting some points in the southern region. The strikes are believed to have targeted a Syrian army air defence base and a radar station in the Tel al-Sahn area in the Sweida province in south-western Syria, according to sources, Reuters reported.\nUpdated at 23.52 CET\n28 Dec 2023 23.26 CET Hamas delegation to visit Cairo to discuss Egypt's ceasefire proposal – report A Hamas official has said that a delegation from the Palestinian militant group is due in Cairo on Friday to give its “observations” about an Egyptian proposal for a ceasefire that would end the war in Gaza. The Hamas official, speaking on condition of anonymity, told AFP: A high-level delegation from the Hamas political office will visit Cairo tomorrow to meet Egyptian officials and give the response of the Palestinian factions, including several observations, to their plan. The official said these observations focus on “the modalities of the planned exchanges and the number of Palestinian prisoners to be freed, as well as obtaining guarantees for a complete Israeli military withdrawal from Gaza”. As we reported earlier, Egypt has said that it put forward a framework proposal to end the conflict in Gaza. The plan includes three stages ending with a ceasefire, according to an Egyptian official, who added that further details of the plan would be released once it had received responses. The plan was put last week to officials of Hamas and Islamic Jihad, which is also battling Israeli forces in the territory, AFP reported. Citing sources close to Hamas, it said the plan provides for renewable ceasefires, a staggered release of hostages held by Hamas in exchange for Palestinian prisoners in Israel, and ultimately a ceasefire to end the war. It also provides for a Palestinian government of technocrats after talks involving “all Palestinian factions”, which would be responsible for governing and rebuilding in postwar Gaza, it said.\nUpdated at 23.52 CET\n28 Dec 2023 23.12 CET Benjamin Netanyahu has cancelled a war cabinet meeting that was scheduled for tonight to discuss Israel’s plan for Gaza after the war with Hamas ends. The Israeli prime minister has reportedly refused requests from security officials to make plans for control of Gaza after the war with Hamas ends. Netanyahu’s decision to cancel tonight’s meeting, the Times of Israel reported, has been “influenced by his far-right coalition partners” who have rejected any discussion about the role of the Palestinian Authority (PA) in a postwar Gaza governance. The report continues: This leaves few if any other options, but Netanyahu has appeared committed to keeping his coalition intact and has accordingly sought to delay ‘day-after’ discussions for nearly three months. The outlet reported that Netanyahu has agreed to discuss the matter at a meeting of the larger security cabinet on Tuesday.", "source_domain": "www.theguardian.com", "text": null, "title": "Netanyahu cancels war cabinet meeting due to discuss plans for Gaza after war - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/28/israel-gaza-war-live-macron-calls-for-lasting-ceasefire-as-israel-intensifies-attacks-on-gaza"}