{"authors": ["Greg Woodfield", "Greg Woodfield For Dailymail.Com"], "date_download": "2024-02-05 15:21:08", "date_modify": "None", "date_publish": "2023-12-29 19:27:03", "description": "Joaquin 'El Chapo' Guzman was sentenced to life in prison in 2019 and a judge this week denied his request for an appeal, insisting his trial was fair and correct.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12909901%2FJoaquin-Chapo-Guzman-DEA-agent-Mike-Vigil-toast.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/29/15/79384105-0-image-a-143_1703865215368.jpg", "language": "en", "localpath": null, "maintext": "Caged cartel drug lord Joaquin 'El Chapo' Guzman 'is toast' following his doomed bid to get a judge to review his life sentence, a famed former DEA boss and undercover agent tells DailyMail.com.\nMike Vigil, an ex-head of international operations for the Drug Enforcement Administration, said in an exclusive interview: 'I don't believe he'll ever see daylight again now. And his influence is gone.'\nGuzman, former leader of Mexico's murderous Sinaloa cartel, has been languishing in the supermax jail in Florence, Colorado – dubbed the Alcatraz of the Rockies – since 2019.\nNew York City judge Brian Cogan, who presided over his headline-grabbing trial in Brooklyn, on Tuesday threw out the request to review the ruling that sentenced the notorious crime boss to life behind bars for drug trafficking.\nJoaquin 'El Chapo' Guzman is seen on January 19, 2017, being handed over to U.S. law enforcement. Guzman was sentenced to life in prison in 2019 and a judge this week denied his request for an appeal, insisting his trial was fair and correct\nLegendary former DEA undercover agent Mike Vigil told DailyMail.com, 'I don't believe he'll ever see daylight again now'\nVigil, who incredibly survived years working undercover posing as a cartel member in both Mexico and Colombia, said: 'Guzman's influence on the Sinaloa cartel has vanished – his lines of communications are pretty much zero now.\n'He doesn't have any of the access or contact to the cartel that he enjoyed when he was previously incarcerated in Mexico and escaped.\n'He's now toast. And I believe he'll be resigning himself to the fact that his life is over with.\n'In fact, he won't even know exactly where he is in the supermax. That is deliberately kept from all prisoners.\n'The cell windows are just slits, so it doesn't allow someone like him to determine a fixed location for, maybe, an assault force to free him. And that's if he could get information out, which is virtually impossible. He has no interaction with other inmates and it's minimal with guards.'\nDespite the final nailing of El Chapo, the Sinaloa cartel's reach and power has become even more fearsome, publicly aided by the emergence of his four kingpin sons known as Los Chapitos (the little Chapos).\nBut Vigil warned against believing a highly publicized DEA war on the brothers will dent the power of Mexico's most feared crime organization.\nThe once-mocked siblings have helped create the fentanyl scourge now blighting the United States – with one, Ovidio Guzman-Lopez, currently being held in the US after his September extradition.\nTheir Chapitos faction is led by Ivan Archivaldo Guzman Salazar followed by Jesus Alfredo, with Ovidio next in the pecking order and then Joaquin Jr.\nHowever, Vigil insisted: 'The DEA administrator Anne Milgram has made it appear that if they capture all the Chapitos, it's going to have a major impact on the trafficking of fentanyl to the United States.\n'And it's not. Because the Chapitos don't run the cartel, they're members, but the cartel is going to continue producing fentanyl without them.\n'Even if you arrest all of them tomorrow it's not going to have an impact because Sinaloa is the most powerful cartel that has ever existed.\n'It currently operates in six of the seven continents. It only doesn't operate in Antarctica because nobody lives there.'\nMike Vigil pictured on a 'seek and destroy' mission for drugs in Colombian jungle in the early 1980s\nVigil (center) with Colombian national police in front of 25 tons of marijuana they seized on one of many missions in the 1980s\nMike Vigil rose to become the DEA’s head of international operations. 'Guzman's influence on the Sinaloa cartel has vanished – his lines of communications are pretty much zero now,' he told DailyMail.com\nVigil told DailyMail.com the reason Sinaloa has been operating terrifyingly smoothly since El Chapo was deported to the United States in 2017 is, in fact, primarily down to elusive real boss Ismael 'El Mayo' Zambada.\n'The guy is a very, very capable leader and he has been running the show since Guzman has been incarcerated,' said Vigil.\nIsmael 'El Mayo' Zambada is leading the Sinaloa Cartel while his former associate and cartel co-founder El Chapo serves a life sentence in a U.S. prison\n'Zambada is the equivalent of Carlo Gambino, the Mafia's boss of bosses, in that he has never spent one minute in a jail. He has never been captured.\n'Security forces have come close about three times to snaring him, but he never comes down from the Sierra Madre mountain range.\n'And if Chapo Guzman had stayed up there as well, he'd probably still be a free man. Make no mistake, Zambada is running things.'\nVigil also blamed Mexican president Andres Manuel Lopez Obrador for the cartel's continued rise – saying he has deliberately hampered US efforts to fight the killer waves of drugs entering America, including Zombie drug Xyalzine, also known as tranq.\n'Lopez Obrador has basically curtailed the activities of DEA and other US law enforcement agencies in Mexico and he continues to follow that policy of abrazos no balazos (hugs not gunshots),' he said.\n'He did that because he felt that by not confronting the cartels that it would minimize violence. Mexico was suffering from about 33,000 killings a year and he felt that if he didn't confront the cartels, they wouldn't kill as many people.\n'Well that didn't work. Because the six-year term of Lopez Obrador is going to be the bloodiest one in the history of Mexico. The cartels now operate with complete impunity. They murder people like it's going out of style.\n'Lopez Obrador is a very narcissistic leader and he refuses to admit that his policy is a failed policy.'\nSinaloa cartel bosses have turned to flooding the US with synthetic drugs because they are so cheap and easy to produce, said Vigil.\nThe effects can now be witnessed in horrifying scenes in American cities such as Philadelphia and Portland, Oregon, where Zombie drug users lie collapsed on the sidewalks or are barely able to stagger around.\n'It costs cartel members pennies to make these drugs,' said the former DEA chief. 'They import the precursor chemicals from China and don't have to rely on an opium poppy harvest.\n'But I always cringe when people say cartels are producing fentanyl and similar in super labs. That gives you the illusion that they're like a pharmaceutical lab.\n'They're not super labs. They're metal tubs with someone using a piece of wood to stir the chemicals. It's that simple and that cheap.'\nVigil told DailyMail.com the reason Sinaloa has been operating terrifyingly smoothly since El Chapo was deported to the United States in 2017 is, in fact, primarily down to elusive real boss Ismael 'El Mayo' Zambada\nVigil also blamed Mexican president Andres Manuel Lopez Obrador for the cartel's continued rise – saying he has deliberately hampered US efforts to fight the killer waves of drugs entering America, including Zombie drug Xyalzine, also known as tranq\nEl Chapo had filed habeas corpus petitions – civil suits to assess if an imprisonment was lawful – and asked for legal representation in his appeal in the Eastern District of New York.\nJudge Cogan threw it out, writing: 'This was perhaps the most notorious criminal prosecution of the decade, and the charges of which the petitioner was convicted could well have resulted in the death penalty but for the terms of the extradition.'\nThe ruling rejected arguments that El Chapo's defense did not sufficiently explore a plea bargain and cites sealed evidence suggesting the drug lord still controls billions of dollars in assets, even if not in his name.\nGuzman, who was responsible for thousands of deaths in his decades-long reign as cartel boss, escaped from Mexican prisons twice.\nHis most spectacular freedom bid was in July 2015 in an elaborate and ventilated one-mile tunnel at a maximum-security jail in Almoloya, west of Mexico City. He was recaptured in January 2016.\nHe lost his latest legal freedom attempt months after his former beauty queen wife Emma Coronel, 34, was released after serving less than two years of a three-year sentence imposed in November 2021 for drug trafficking.\nCoronel celebrated walking out free September with a party at a Los Angeles nightclub arranged by her attorney Mariel Colon Miro. She had been transferred to a half-way house in Long Beach, California, after spending about 18 months in a federal prison in Texas.\nHaving twice escaped from Mexican prisons, El Chapo has been held since 2019 at the supermax prison in Colorado known as the 'Alcatraz of the Rockies'\nGuzman is currently in the supermax prison in Florence, Colorado\nGuzman, who was responsible for thousands of deaths in his decades-long reign as cartel boss, escaped from Mexican prisons twice\nMike Vigil with half a ton of seized cocaine in Mexico during an operation in the mid 1980s\nHowever, Vigil believes the dual US and Mexican citizen may now be fearing cartel bosses could take vengeance because of her plea deal.\nShe agreed to turn over about $1.5million in illicit proceeds from her husband's illegal operations as part of her sweetheart bargain.\nDespite admitting helping El Chapo move at least 450 kilograms of cocaine, 90 kilograms of heroin and nearly 90,000 kilograms of marijuana into the United States, she received what is considered a light sentence even in light of the deal.\n'Three years was relatively minimal and then she didn't even serve the three years, she served close to two years,' said Vigil.\n'She's potentially in a situation where she'll be fearing for her life at the moment.\n'When you talk about drug lords and drug organizations, you're talking about people that suffer from severe paranoia.\n'I don't suffer from extreme paranoia, but if I were a cartel leader or member and I saw that they only gave her three years and she got out in less than two, I'd wonder what else was going on.'\nHe continued: 'She's got access to a lot of Chapo Guzman's fortune. She's got dual citizenship.\n'She would not be as vulnerable in California where she could reasonably hide. I'm sure she'll have different apartments and things of that nature. They could probably get to her, but not as easy as in Mexico.'\nCoronel has 11-year-old twin daughters with El Chapo, who she married on her 18th birthday in 2007. She was arrested a Dulles International Airport in February 2021.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Joaquin 'El Chapo' Guzman will never see daylight again, famed former DEA agent Mike Vigil says, after judge rejects drug lord's bid to appeal life sentence", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12909901/Joaquin-Chapo-Guzman-DEA-agent-Mike-Vigil-toast.html?ns_mchannel=rssns_campaign=1490ito=1490"}