{"authors": ["Katherine Lawton"], "date_download": "2024-02-05 15:21:09", "date_modify": "None", "date_publish": "2023-12-29 13:47:20", "description": "The Operational Command of the Armed Forces said the object entered from the side of the border with Ukraine and was observed by radars of the country's air defense system.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12909745%2FPolish-military-hunt-unidentified-airborne-object-entered-airspace-vanished-radars.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/29/14/79436225-0-image-a-39_1703858932428.jpg", "language": "en", "localpath": null, "maintext": "Unidentified airborne object is said to have entered from direction of Ukraine\nPoland's armed forces are hunting an unidentified airborne object that entered its airspace and then vanished off radars.\nThe Operational Command of the Armed Forces said the object entered from the side of the border with Ukraine and was observed by radars of the country's air defense system from the moment it crossed the border until the signal disappeared.\nIt added that troops have been mobilized to identify and find the object, as local authorities said it crossed the border near the town of Hrubieszow.\nThere were no immediate reports of any explosion or casualties.\nIt comes as Russia conducted one of its biggest attacks overnight in Ukraine since the launch of its invasion - targeting the country with 158 drones and missiles.\nPolish President Andrzej Duda has called an emergency meeting of the National Security Council (BBN) after the object entered Poland's airspace.\nPolish soldiers patrol near Sosnowa-Debowa village, eastern Poland, on December 29 after an unidentified object entered the country's airspace\nThe Operational Command of the Armed Forces said the object entered from the side of the border with Ukraine\nPolish President Andrzej Duda has called an emergency meeting after an unidentified object entered Poland's airspace. Pictured: Polish Defence Minister Wladyslaw Kosiniak-Kamysz, chief of General Staff Gen. Wieslaw Kukula (left) and the forces' operational commander Gen. Maciej Klisz (right)\nRussia conducted one of its biggest attacks overnight in Ukraine since the launch of its invasion. An explosion of a missile is seen during a Russian missile and drone strike in Kyiv, Ukraine on December 29\nPolish armed forces operational commander Gen. Maciej Klisz speaks next to Polish Defence Minister Wladyslaw Kosiniak-Kamysz during a press conference after the National Security Council (BBN) meeting in Warsaw, Poland, on December 29\nThe Operational Command said on social media platform X: 'In the morning, an unidentified aerial object entered the airspace... and from the moment it crossed the border until the signal disappeared, it was observed by the radars of the country's air defence system.\n'In accordance with applicable procedures, the operational commander of the armed forces mobilized the available forces and resources at his disposal.'\nPrivate broadcaster TV Republika reported that a search for the object was happening near the town of Hrubieszow in southern Poland.\n'We received information that an object appeared on the radar near Hrubieszow,' Krzysztof Komorski, governor of the Lublin region said on X. 'We have no confirmation that it fell within our region.'\nOne owner of the orchards in the Komarów-Osada commune in the Lublin region claimed the object was black, between one and two metres long and was flying quite low.\nGeneral Wieslaw Kukula, chief of the general staff of the Polish armed forces, said: 'Everything indicates that a Russian missile entered Polish airspace... it also left our airspace.\nPolish President Duda has called an emergency meeting of the National Security Council (BBN) after an unidentified object entered Poland's airspace from the side of the Ukrainian border\nPolish soldiers patrol near Sosnowa-Debowa village, eastern Poland on December 29\nChief of General Staff of the Polish Army Gen. Wieslaw Kukula speaks next to Polish Defence Minister Wladyslaw Kosiniak-Kamysz (left) and Armed forces' operational commander Gen. Maciej Klisz (right) during a press conference after the National Security Council (BBN) meeting\n'We have national and allied radar confirmation,' he told reporters.\nThe missile was in Polish airspace for three minutes, said Maciej Klisz, operational commander of the Polish army.\n'We sent our forces, fighter jets, to intercept it and shoot it down if necessary but the duration and the flight path... made this impossible and allowed the missile to leave Polish territory,' Klisz said.\nKlisz said Poland's air defence system had been put on alert because of a wave of Russian drone and missile strikes on Ukraine.\nThe army said it had also carried out a ground search in the place where the signal from the missile was lost.\nPolish civilian and military authorities have held emergency meetings and Polish President Andrzej Duda has spoken to NATO chief Jens Stoltenberg following the incident, officials said.\nIn November 2022, a Ukrainian air defence missile fell in the Polish village of Przewodow near the border, killing two civilians.\nThe explosion occurred at a grain storage site near a school about six kilometres from the border during another intensive Russian bombardment of Ukraine.\nSmoke rises in the sky over the city after a Russian missile and drone strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine December 29\nThere was initial doubt about whether the missile was Russian, raising concern that NATO could become directly involved in the war as member state Poland is covered by the alliance's collective defence agreement.\nRussia targeted Ukraine with 158 drones and missiles overnight, aiming for critical infrastructure, industry and military facilities, the Ukrainian military said.\nA stray Ukrainian missile struck the Polish village of Przewodow in southern Poland in November 2022 in an incident that raised fears of the war in Ukraine spilling over the border.\nIn April, a military object was found in a forest close to the village of Zamosc near the northern city of Bydgoszcz. It was later reported to be a Russian missile.\nPolish officials said emergency services, including police and volunteer army units, were scouring the area but it was unclear whether the object had landed on Polish territory. There were no reports of casualties.\nPrime Minister Donald Tusk was due to meet with army and security services chiefs around midday local time.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Polish military say Russian missile entered its airspace from direction of Ukraine then vanished off radars", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12909745/Polish-military-hunt-unidentified-airborne-object-entered-airspace-vanished-radars.html?ns_mchannel=rssns_campaign=1490ito=1490"}