{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:14:59", "date_modify": "None", "date_publish": "2024-01-29 12:37:33", "description": "De-banking occurs when a financial institution closes the account of someone deemed to acting criminally or someone who could post a reputational risk to the bank.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13018719%2Fsnl-trump-debanking-joke-meaning.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/29/12/80584561-0-image-a-16_1706531834510.jpg", "language": "en", "localpath": null, "maintext": "NBC's flagship show Saturday Night Live is being mocked for trying to ridicule ex-President Donald Trump's use of the phrase 'de-bank' during a rally last week.\nDuring the show's Weekend Update segment, host Colin Jost, a Harvard graduate, said that he didn't know 'What the hell 'de-bank' means?'\n'Trump did have a slight stumble this week while talking about banks, and he introduced an interesting new term called de-bank. I don't know what the hell de-bank means, but you might have to take 'de-ambulance' to see 'de-doctor,' Jost, who serves as SNL's head writer, joked.\nDe-banking, which can also be referred to as de-risking, occurs when a financial institution closes the account of someone deemed to acting criminally or someone who could post a reputational risk to the bank.\nIn the UK, the phrase became mainstream in 2023 when Trump associate Nigel Farage saw his account closed by British bank Coutts & Co. Farage is an avid fan of Donald Trump's and has attended rallies in Iowa and New Hampshire so far this year.\n'We’re also going to place strong protections to stop banks and regulators from trying to de-bank you from your— Your political beliefs, what they do! They want to de-bank you,' Trump told supporters at an event in New Hampshire last week.\n'Trump did have a slight stumble this week while talking about banks, and he introduced an interesting new term called de-bank. I don't know what the hell de-bank means, but you might have to take 'de-ambulance' to see 'de-doctor,' Jost quipped\nTrump made the remarks during a campaign rally in New Hampshire last week\nA former close aide of Sen. Ted Cruz's, Steve Guest, rushed to Trump's defense after the SNL gag posting on X: 'The woke smugness from SNL is out of control.'\nAnother conservative activist, Doug Powers, wrote: 'SNL's in such a hurry to dunk on Trump that they made themselves look like idiots again.'\nA California State Senate candidate, Michael Oxford, also had a hot take.\n'This is similar to when Dennis Prager said they are putting tampons in men's bathrooms, and Bill Maher's entire audience laughed at him. The left doesn't realize what's happening, until it's too late. Then their cognitive dissonance forces them to justify why it's a good thing,' he wrote.\nEarlier in the bit, Jost and his fellow host Michael Che mocked Trump's legal troubles, including being forced to pay $83 million to the woman he sexually assaulted in the 1990s.\nJost pointed out that despite murdering two people, OJ Simpson was only asked to pay his victims families $33 million, which would be worth around $63 million today.\n'The only way this could've gone worse for Trump is if they took away his businesses. Which is, of course, what happens in next week's trial,' referencing Trump's next legal battle in New York City.\nTrump superfans were outraged by Jost's joke on X\nWriting for MSNBC's website, Ja'han Jones wrote that Trump 'appeared' to be referring to far-right activists who have seen their accounts frozen in recent years, including MAGA zealot Laura Loomer.\nOne of the hosts of The New Abnormal podcast, Andy Levy, also had a take on Trump's comments and de-banking.\n'The interesting thing here is that most of this 'debanking' is done against sex workers. You know, places like PayPal will not allow it to be used as a payment method for OnlyFans and for stuff like that. Generally, this sort of thing is used to target sex workers,' he said.\nThe practice is similar to social media companies choosing to de-platform certain people, such as Trump.\nFollowing the deadly white nationalist protests in Charlottesville, Virginia, in 2017, Google, Facebook and PayPal began banishing extremist groups and individuals who identified as or supported white supremacists.\nA March 2023 Newsweek feature found that charities such as The National Committee for Religious Freedom (NCRF) were de-banked.\nThe group later told by JP Morgan-Chase that it would be allowed to maintain a customer if it provided a list of donors. The charity refused.\nA similar group, Alliance Defending Freedom, encountered a problem with Fidelity Charitable saying that donors could not donate to the ADF without disclosing personal information.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "'The woke smugness is out of control': SNL is blasted after mocking Trump for using the term 'de-bank' claiming he made it up even though it is a common term to describe financial institutions closing", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13018719/snl-trump-debanking-joke-meaning.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}