{"authors": [], "date_download": "2024-02-05 15:21:11", "date_modify": "None", "date_publish": "2023-12-29 17:38:01", "description": "Poland’s defense forces say an unknown object entered the country’s airspace Friday morning from the direction of Ukraine and then vanished off radars, and that all indications pointed to it being a Russian missile", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fpoland-ap-ukraine-nato-andrzej-duda-b2470985.html.json", "image_url": "https://static.independent.co.uk/2023/12/29/17/Poland_Ukraine_96269.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPoland’s defense forces said an unknown object entered the country’s airspace Friday morning from the direction of Ukraine and then vanished off radars, and that all indications pointed to it being a Russian missile.\n“Everything indicates that a Russian missile intruded in Poland’s airspace. It was monitored by us on radars and left the airspace. We have confirmation of this on radars and from allies\" in NATO, said Poland’s armed forces chief, Gen. Wiesław Kukuła.\nPoland’s defense forces said the object penetrated about 40 kilometers (24 miles) into its airspace and left it after less than three minutes. The defense forces said both its radar and NATO radar confirmed that the object left Polish airspace.\nKukula said steps were being taken to verify those findings and eliminate the possibility of a technical error.\nThere was no comment from Russian officials.\nNATO Secretary General Jens Stoltenberg said on X, formerly Twitter, that he had spoken with Poland’s president about the “missile incident” and said NATO was vigilant and monitoring the situation “as the facts are established.”\nU.S. National Security Advisor Jake Sullivan spoke with the head of Poland's National Security Bureau, Jacek Siewiera, to express the “United States’ solidarity with Poland, our close NATO ally, as it deals with reports of a missile temporarily entering Polish airspace,” the White House said.\nSullivan pledged technical assistance to Poland and assured that President Joe Biden was following the issue closely.\nIt was not immediately clear where the object disappeared from radar or in which direction it had been going. Troops were mobilized to identify and find it. There were no immediate reports of any explosion or casualties.\nThe governor of Lublin province in eastern Poland, Krzysztof Komorski, told the Onet news portal that the object appeared on radars near the town of Hrubieszow, where a border crossing with Ukraine is located. Komorski said he had no information to indicate it landed in Lublin province.\nPoland's border with Ukraine is also the European Union and NATO border with Ukraine.\nPrime Minister Donald Tusk convened a meeting with the defense minister, military commanders and heads of national security bodies, followed by a meeting of the National Security Bureau with President Andrzej Duda, the supreme commander of Poland’s armed forces.\nDuda said through an aide that there was “no threat at the moment\" and nothing to suggest that ”anything bad\" should be expected.\n“The most important is that no one was hurt,\" said the aide, Grazyna Ignaczak-Bandych.\nOn Friday, Ukrainian officials said Russia launched more than 100 missiles and dozens of drones against Ukrainian targets overnight in what an air force official called the biggest aerial barrage since Russia's full-scale invasion of Ukraine in February 2022.\nIt was not clear whether the object that Poland reported was related to the barrage.\n“As a result of such massive attacks, this can happen. The enemy is attacking our border territories, including in the west. This is another signal for our partners to strengthen the Ukrainian air defense,\" Yurii Ihnat, spokesperson for Ukraine’s Air Force, said on national television about the incident.\nPoland has been supporting Ukraine with military, humanitarian and political assistance.\nThis is not the first time an unauthorized object has entered Poland's airspace from the direction of Ukraine since Russia's full-scale invasion. In November 2022, two men were killed when a missile struck the village of Przewodow, a few kilometers from the border. Western officials said they believed a Ukrainian air defense missile went astray.\n___\nAssociated Press writers Hanna Arhirova in Kyiv, Ukraine, and Matthew Lee in Washington contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Poland says 'everything indicates' a Russian missile briefly entered its airspace and left", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/poland-ap-ukraine-nato-andrzej-duda-b2470985.html"}