{"authors": ["Etan Nechin"], "date_download": "2024-02-05 15:21:13", "date_modify": "None", "date_publish": "2023-12-29 15:02:19", "description": "Military service defines who you are in Israeli society but dissent has a long tradition, despite the many obstacles, says writer Etan Nechin", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F29%2Ftal-mitnick-israel-soldier-military-service-society.json", "image_url": "https://i.guim.co.uk/img/media/d18cdbfaf002b722c75196b4670bcae8bfc07334/0_119_5488_3294/master/5488.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=46c152999838554b1e759b9fca9575e7", "language": "en", "localpath": null, "maintext": "Last week, 18-year-old Tal Mitnick was jailed for 30 days for refusing Israel Defense Forces enlistment, becoming the first conscientious objector imprisoned since the Israel-Hamas war began. “I refuse to believe that more violence will bring security. I refuse to take part in a war of revenge,” Mitnick wrote in a statement.\nMilitary conscription is a unifying cornerstone in Israeli society. It is hard to completely trust the IDF figures due to a lack of transparency, but its official numbers show that 69% of men and 56% of women are conscripted for service at 18. This makes the military uniform an emblem of collective national identity, perhaps even more important than the flag, epitomised by the Israeli maxim: “A nation building an army is a nation building itself.”\nThe military is so ingrained in the fabric of society, the service is as much a sociological phenomenon as an ideological duty. Most soldiers aren’t fighters. They have roles from cooks, to radio DJs, to teachers. The army has learned to absorb groups it dismissed in the past, like LGBTQ+ people, and even serves vegan food. You can serve in the military and still live at home, treating it as a regular day job.\nWhereas military service in the US and UK is considered “a way out” – from poverty or a lower social class – in Israel, it’s the opposite. It’s a way into society, where jobs are advertised for “post-army” folks, where social clout is measured by your achievements in the military, and where casual conversations invariably drift to “where did you serve?” The military serves as a gateway to a complete Israeli identity, bridging all strata of the social hierarchy.\nYet even with the ubiquity of the military, an undercurrent of dissent exists. Like Mitnick, I also refused IDF enlistment. Examples of refusals are rare but have happened throughout Israel’s history. There are the 3,000 reserve soldiers who protested against the first Lebanon war in 1983, of whom 160 were jailed for their refusal to serve. And also figures like Knesset member Ofer Cassif, who objected to serving in the West Bank, as well as pilots rejecting missions they considered illegal, and a handful of teenagers annually facing jail for opposing service in the occupied territories, with groups like Mesarvot supporting their journey.\nUnlike a majority of conscientious objectors who make up a slender slice of Israel’s populace and often hail from its upper tiers, I came from a small village at Israel’s periphery and went to school on a kibbutz where the ethos of service and sacrifice was strongly felt. Expressing hesitation about the militaristic culture and already deemed problematic by my school, I was tagged during my army processing to be sent to an assessment board.\n00:01:09 Young child pulled out of rubble alive after airstrike hits Rafah in Gaza – video\nOpting out of service isn’t straightforward. Refusal is rare partly because the army leaves little room for dissent. The Israeli high court of justice has ruled that while absolute pacifism is a valid reason for exemption, “selective refusal” – rejecting specific duties – is illegal. This stance, especially the refusal to serve in the occupied territories, is seen as a threat to national unity. Those few exempted on grounds of pacifism are also restricted from discussing the occupation or Israel’s politics more widely.\nThe IDF’s handling of refusers is also not consistent. Some face trials and multiple imprisonments before being discharged by a military psychiatric board. Others, like myself, are sent directly to this board. There, I had to articulate my beliefs to a tribunal of officers, which at 17 were more intuitive than clearly defined. The main method the army uses to release refusers is by declaring them mentally unfit for service, implying that in Israel dissent is equated with insanity.\nThe experience of getting out is disorienting, like stepping into an alternative reality. In my case, in the post-school wilderness and unskilled, I ended up in construction, a field shared by Palestinians, migrant workers and marginalised groups. Choices are slim for those who made the ethical choice to refuse enlistment, with plenty of personal and social ramifications.\nOur refusal to serve wasn’t a gesture for external validation, or even to seek acknowledgment from Palestinians who were segregated from us by language and fences; but about taking a stand against the moral decay within – showing others and ourselves there is another path.\nBut refusers aren’t heroes. No one who has refused thinks they are. I know I didn’t. I didn’t find valour in my decision – but alienation. The choice to reject something central to my society meant I could never be fully part of it. There are even moments of self-doubt and guilt – have I neglected my duty? This is felt especially keenly when friends confront conflict and loss, however removed we are from their cause.\nRefusal isn’t heroic but it expresses a different kind of resolution – the resolution to stand alone, to navigate the complexities of dissent, and to remain true to your beliefs in the face of societal dissonance; to realise that rebellion is required when facing a violent and unsustainable status quo.", "source_domain": "www.theguardian.com", "text": null, "title": "Like Tal Mitnick, I refused to serve Israel as a soldier. It’s important to understand why", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/29/tal-mitnick-israel-soldier-military-service-society"}