{"authors": ["Jordan King"], "date_download": "2024-02-05 15:21:14", "date_modify": "None", "date_publish": "2023-12-29 07:32:20", "description": "Venezuela and Guyana are in dispute over an oil-rich region", "filename": "https%3A%2F%2Fwww.standard.co.uk%2Fnews%2Fworld%2Fvenezuela-guyana-latest-nicolas-maduro-uk-warship-hms-trent-b1129429.html.json", "image_url": "https://static.standard.co.uk/2023/12/29/7/50/Opposition%20And%20Officialism%20Demonstrate%20On%20Venezuela%27s%20Independence%20Day-vo8f74y3.jpeg?width=1200&auto=webp&quality=75", "language": "en", "localpath": null, "maintext": "The region has been under Guyana's control for decades, but in December, Venezuela relaunched its historical claim to the Essequibo through a referendum in which it asked voters in the country whether the Essequibo should be turned into a Venezuelan state. As tensions over the region escalated, the leaders of both countries met in the Caribbean island of St Vincent, and signed an agreement which said they would solve their dispute through nonviolent means. During the talks, however, Guyana's President Irfaan Ali said his nation reserved its right to work with its partners to ensure the defence of his country. On Thursday, Guyanese officials described the visit of HMS Trent as a planned activity aimed at improving the nation's defense capabilities and said the ship's visit will continue as scheduled. \"Nothing that we do or have done is threatening Venezuela,\" Guyana's Vice President Bharrat Jagdeo told reporters in Georgetown, the nation's capital. HMS Trent is a patrol and rescue ship that was recently used to intercept drug traffickers off the West Coast of Africa. It can accommodate up to 30 sailors and a contingent of 18 marines, and is equipped with 30 mm cannons and a landing pad for helicopters and drones. The ship had been sent to Barbados in early December to intercept drug traffickers, but its mission was changed on Dec. 24, when it was sent to Guyana. Authorities did not specify when it was expected to arrive off Guyana's shores. The UK Ministry of Defence said the ship would be conducting joint operations with Guyana's defense forces. The nation of 800,000 people has a small military that is made up of 3,000 soldiers, 200 sailors and four small patrol boats known as Barracudas. Venezuela says it was the victim of a land theft conspiracy in 1899, when Guyana was a British colony and arbitrators from Britain, Russia and the United States decided the boundary.", "source_domain": "www.standard.co.uk", "text": null, "title": "Venezuela to hold military drills after UK sends warship to Guyana", "title_page": null, "title_rss": null, "url": "https://www.standard.co.uk/news/world/venezuela-guyana-latest-nicolas-maduro-uk-warship-hms-trent-b1129429.html"}