{"authors": [], "date_download": "2024-02-05 15:21:15", "date_modify": "None", "date_publish": "2023-12-28 12:02:14", "description": "Weeks before Taiwan holds elections for its president and legislature, China has renewed its threat to use military force to annex the self-governing island democracy it claims as its own territory", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fchina-ap-taiwan-taipei-william-lai-b2470407.html.json", "image_url": "https://static.independent.co.uk/2023/12/28/12/Taiwan_China_25984.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWeeks before Taiwan holds elections for its president and legislature, China renewed its threat to use military force to annex the self-governing island democracy it claims as its own territory.\nDefense Ministry spokesperson Col. Wu Qian on told reporters Thursday at a monthly briefing that China’s armed forces would “as always take all necessary measures to firmly safeguard our national sovereignty and territorial integrity.”\nTaiwan’s 23 million people overwhelmingly favor maintaining the island’s de-facto independent status, leaving the Jan. 13 polls to be decided largely by concerns over housing prices, health care, employment and education. China has continued sending warships and fighter jets near Taiwan as an intimidation tactic, even as Taiwan’s military said it's raising alert levels before the vote.\nThe ruling party's candidate, William Lai, holds a lead in most surveys, while the main opposition Nationalist Party's candidate, Hou You-yi, has sought to appeal to voters who fear a military conflict with China that could draw in the United States and lead to massive disruptions in the global economy.\nHou's campaign literature, distributed Thursday in Taipei, affirmed his opposition to Taiwan independence and concurrence with Beijing's view of Taiwan as a part of China.\nLong a melting pot of Asian and European cultures, Taiwan was a Japanese colony for 50 years until 1945, when it was handed over to Chiang Kai-shek's Chinese Nationalist government. The Nationalists, also known as the Kuomintang, then relocated to the island in 1949 after the Communist Party under Mao Zedong emerged victorious from a brutal conflict on the Chinese mainland in which millions were killed.\nDuring Thursday's news conference, Wu repeated accusations that the U.S. was prompting Taiwan into deliberately raising tensions with China. Beijing has provided no evidence, but the claim meshes with China's posing itself as an unofficial ally of Russia in opposing the long-predominant Western liberal order, in favor of authoritarian rule.\n“Any attempt to use Taiwan to contain China is doomed to failure. … Seeking independence by military force is a dead end,” Wu said.\nTaiwan has answered Chinese military expansions with boosts to its navy, air and ground forces, all backed by the possibility of swift intervention by U.S. and allied forces spread across the Asia-Pacific.\nChina maintains the world's largest standing military with more than 2 million enlisted, along with the largest navy and the second-highest annual defense budget, after the U.S.\nYet, the post of defense minister has been vacant since the former occupant, Li Shangfu, dropped from view in August and was officially dismissed in October with no word on the cause or his current circumstances. The mysterious dismissal of Li, along with that of ex-Foreign Minister Qin Gang, have raised questions about support within the regime for Communist Party leader and head of state Xi Jinping, who has effectively made himself leader for life and has sought to eliminate all political opponents.\nEven as the defense minister position remains vacant, Xi appointed two newly promoted full generals to key military commands Monday. Wang Wenquan will act as political commissar of the Southern Theater Command that oversees China's operations in the highly contested South China Sea. Hu Zhongming will take over as navy commander as China works to establish itself as a global maritime power to protect its trade interests, consolidate its hold over the South China Sea and East China Sea islands, and expand its global interests in order to diminish U.S. power.", "source_domain": "www.independent.co.uk", "text": null, "title": "China reaffirms its military threats against Taiwan weeks before the island's presidential election", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/china-ap-taiwan-taipei-william-lai-b2470407.html"}