{"authors": ["Jane Clinton"], "date_download": "2024-02-05 15:21:15", "date_modify": "None", "date_publish": "2023-12-28 16:08:11", "description": "Ukraine president thanks US for final aid package under current US legislation", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F28%2Frussia-ukraine-war-live-us-state-department-calls-on-congress-to-act-swiftly-to-resume-flow-of-aid-to-kyiv.json", "image_url": "https://i.guim.co.uk/img/media/aa0bfad062ef37bb333792c8665dcc88b29d4748/0_508_7623_4574/master/7623.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=abb83d7e1e09b5a8c0f91de3a97f6b07", "language": "en", "localpath": null, "maintext": "From 28 Dec 2023 16.10 CET Volodymyr Zelenskiy thanks US for latest aid package saying security of Europe and US relies on forceful response to Russia Volodymyr Zelenskiy has thanked the United States for its arms package worth up to $250m. In his post on social media he wrote: US leadership in the coalition of over 50 countries providing Ukraine with military aid is critical to countering terror and aggression not only in Ukraine but around the world. Over the course of this year, the US has provided 34 military aid packages worth over $24bn. “Patriots,” “Abrams,” armored vehicles, ATACMS, DPICM, air defense, missiles, artillery rounds, mine clearing capabilities, and other critical equipment. A historic decision to provide Ukraine with F-16 jets was made. We will always be grateful for all of this support. To defend freedom and security not only in Ukraine and Europe but also in the United States, we must continue to respond to ongoing Russian aggression in the most forceful and resolute manner possible. I thank @POTUS Joe Biden, Congress, and the American people for the $250 million military aid package announced yesterday.\nAdditional air defense missiles and components, anti-tank weapons, ammunition, mine clearing, and other equipment will cover Ukraine’s most pressing needs.… — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) December 28, 2023\nUpdated at 16.43 CET\n28 Dec 2023 17.08 CET The time is just after 6pm in Kyiv and we are now closing the blog. Here is a summary of events. Russian occupation authorities vastly and deliberately undercounted the dead in the flooding after the explosion that destroyed the Kakhovka Dam an investigation by the Associated Press (AP) has found. Russia said 59 people drowned in the territory it controls, but the AP investigation claims the number is at least in the hundreds in the town of Oleshky alone.\nThe United States has announced a fresh package of arms to Ukraine , worth up to $250m. The package comes amid growing Republican opposition to continued financial support for Kyiv. The state department has said the US Congress should “act swiftly” to renew the flow of aid to Ukraine .\nVolodymyr Zelenskiy has thanked the United States for the fresh military aid package. In a post on X, Zelenskiy wrote: “We must continue to respond to ongoing Russian aggression in the most forceful and resolute manner possible.”\nRussian forces struck Vovchansk in Kharkiv oblast on the morning of 28 December, killing a 66-year-old woman and wounding another resident, reported Oleh Syniehubov, the regional governor.\nRussian navy’s Ropucha-class landing ship tank (LST) Novocherkassk was completely destroyed on 25 December 2023 following a Ukrainian strike while alongside at the port of Feodosia, on the south coast of Russian-occupied Crimea, the latest summary from the UK’s Ministry of Defence (MoD) has said.\nRussia’s foreign minister, Sergei Lavrov, has warned that no one worldwide could be certain of escaping unscathed from western machinations in 2024, Reuters reported. In an interview released by the official Tass news agency, Lavrov added that the west’s dominance was “slipping away”.\nRussia is resolved to achieve its goals in its military operations in Ukraine, Lavrov has said, adding that what he called the west’s strategy to inflict a strategic defeat on Russia had “completely failed”.\nThe G7 countries intend to discuss a “peace formula” proposed by the Ukrainian president Volodymyr Zelenskiy, which they agreed on at a “secret summit” held about 10 days ago, Lavrov said in an interview with Russian state media.\nIn an interview with RIA state news agency and the Rossiya 24 TV channel, Lavrov said some in the west were suggesting Moscow should discuss peace in Ukraine because the United States and its allies had failed to defeat Russian forces in Ukraine. He added he believed there were signs the west was changing its tactics and strategy on Ukraine.\nA Panama-flagged bulk carrier, which was heading to a River Danube port to load grain hit a Russian mine in the Black Sea on Wednesday, injuring two crew members, Ukrainian officials said on Thursday.\nRussia is resolved to achieve its goals in its military operations in Ukraine, Lavrov said, adding that what he called the west’s strategy to inflict a strategic defeat on Russia had “completely failed”.\nRussia has lost 356,670 personnel since the beginning of the war until 28 December, according to the Ukrainian army’s general staff. Other losses include 5,940 tanks, 11,015 APVs, 8,391 artillery systems and 6,503 drones.\nUkraine and Hungary are preparing a meeting between Volodymyr Zelenskiy and Viktor Orbán in the near future, the Ukrainian president’s chief of staff said on Thursday.\nUkraine’s air defence systems shot down seven out of eight Russia-launched Shahed drones overnight, the country’s air force said on Thursday. Drones were downed in three central and southern regions, the air force said on the Telegram messenger. The Russian defence ministry said it thwarted a Ukrainian drone attack over Moscow-occupied Crimea overnight.\nFinland will be the first country to “suffer” in the event of an escalation of tensions between Russia and Nato due to its proximity to the former, the RIA news agency cited senior Russian diplomat Mikhail Ulyanov, permanent representative of Russia to international organisations in Vienna as saying: “...since they are our neighbours, if, God forbid there is some escalation, they will be the first to suffer.”\nThe United States has proposed that working groups from G7 nations explore ways to seize $300bn in frozen Russian assets, according to the Financial Times.\nTwo Russian men have been sentenced to long prison terms for reading poems criticising Russia’s military attack on Ukraine . Artyom Kamardin was sentenced to seven years in prison and Yegor Shtovba to five years and six months. Both men were convicted of “inciting hatred” and “calling for activities threatening state security”.\nA raunchy celebrity-studded party in Moscow has prompted outrage among Russian politicians and law enforcement agencies, in one of the starkest examples to date of how Vladimir Putin is moving the country in a conservative and anti-liberal direction.\nRussia’s space state agency Roscosmos said has said that a cross-flight programme with Nasa to the International Space Station (ISS) had been extended until 2025, Interfax news agency reported.\nUpdated at 17.44 CET\n28 Dec 2023 17.02 CET Pjotr Sauer View image in fullscreen The influencer Nastya Ivleeva at her ‘almost naked’ party at Moscow’s Mutabor nightclub. The event triggered a backlash from conservative politicians and supporters of the Ukraine war. Photograph: Nastya Ivleeva A raunchy celebrity-studded party in Moscow has prompted outrage among Russian politicians and law enforcement agencies, in one of the starkest examples to date of how Vladimir Putin is moving the country in a conservative and anti-liberal direction. The party, which took place on 20 December, was a dress-up ball held at a Moscow nightclub with the theme “almost naked”, and was organised by the popular Instagram influencer Anastasia Ivleeva and attended by a number of household celebrity names who have stayed in the country since Putin launched his invasion of Ukraine in February 2022. The scantily clad stars wore flesh-coloured mesh, lace, and lingerie, with one rapper attending in nothing but a sock, in what appeared to be a tribute to the famous 1987 Red Hot Chili Peppers album cover. “Everyone was having a good time, no one could imagine what a mess this would all become,” said one person who attended the party who asked not to be named. Footage of the party quickly spread across Russian social media, causing outrage among pro-war commentators and nationalist officials. “There is a war going on in the country, but these beasts, scum are organising all this, these brutes who don’t care what’s going on,” said Vladimir Solovyov, Russia’s most prominent television propagandist, in a Telegram post. Read the full report here.\n28 Dec 2023 17.02 CET Ukraine and Hungary are preparing a meeting between Volodymyr Zelenskiy and Hungary’s prime minister, Viktor Orbán, in the near future, the Ukrainian president’s chief of staff said on Thursday. Andriy Yermak made his remarks after a call with the Hungarian foreign minister, Péter Szijjártó, Reuters has reported. Yermak said on the X social media platform: “We are working to organise a meeting between the two leaders in the near future.”\nUpdated at 17.05 CET\n28 Dec 2023 16.33 CET One person killed and another injured after Russian attack in Kharkiv Oblast, regional governor said Russian forces struck Vovchansk in Kharkiv Oblast on the morning of 28 December, killing a 66-year-old woman and wounding another resident, reported Oleh Syniehubov, the regional governor. The second victim, a 63-year-old woman, was being treated on the scene, he wrote on Telegram earlier today. The attack, possibly carried out with multiple-launch rocket systems, caused a car to catch fire, according to Syniehubov. ⚡️Governor: Russian attack in Kharkiv Oblast kills 1, injures 1.\nRussian forces struck Vovchansk in Kharkiv Oblast on the morning of Dec. 28, killing a 66-year-old woman and wounding another resident, reported Oleh Syniehubov, the regional governor. https://t.co/lW8AQtBpvf — The Kyiv Independent (@KyivIndependent) December 28, 2023\nUpdated at 16.43 CET\n28 Dec 2023 16.10 CET Volodymyr Zelenskiy thanks US for latest aid package saying security of Europe and US relies on forceful response to Russia Volodymyr Zelenskiy has thanked the United States for its arms package worth up to $250m. In his post on social media he wrote: US leadership in the coalition of over 50 countries providing Ukraine with military aid is critical to countering terror and aggression not only in Ukraine but around the world. Over the course of this year, the US has provided 34 military aid packages worth over $24bn. “Patriots,” “Abrams,” armored vehicles, ATACMS, DPICM, air defense, missiles, artillery rounds, mine clearing capabilities, and other critical equipment. A historic decision to provide Ukraine with F-16 jets was made. We will always be grateful for all of this support. To defend freedom and security not only in Ukraine and Europe but also in the United States, we must continue to respond to ongoing Russian aggression in the most forceful and resolute manner possible. I thank @POTUS Joe Biden, Congress, and the American people for the $250 million military aid package announced yesterday.\nAdditional air defense missiles and components, anti-tank weapons, ammunition, mine clearing, and other equipment will cover Ukraine’s most pressing needs.… — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) December 28, 2023\nUpdated at 16.43 CET\n28 Dec 2023 16.06 CET The United States has proposed that working groups from G7 nations explore ways to seize $300bn in frozen Russian assets, according to the Financial Times. The topic was discussed this month by both G7 finance ministers and their deputies, according to people briefed on the calls. According to the FT the US, backed by the UK, Japan and Canada, has proposed preparatory work should start so it can be ready for a potential meeting of G7 leaders on around 24 February – the date of Putin’s 2022 offensive on Kyiv.\nUpdated at 16.44 CET\n28 Dec 2023 14.13 CET An investigation by the Associated Press has found that Russian occupation authorities vastly and deliberately undercounted the number of dead people in one of the most devastating episodes of the 22-month war in Ukraine — the flooding that followed the catastrophic explosion that destroyed the Kakhovka dam in the southern Kherson region. Russia said 59 people drowned in the territory it controls. But an AP investigation claims the number is at least in the hundreds in the town of Oleshky alone. Health workers and others who were in Oleshky told the news agency that Russian authorities hid the true number by taking control of the issuance of death certificates, immediately removing bodies not claimed by family, and preventing local health workers and volunteers from dealing with the dead people. An exact death toll – in Oleshky, the occupied area’s most populous town before the war, and beyond – may never be known, even if Ukrainian forces retake the territory and are able to investigate. “The scale of this tragedy, not just Russia, but even Ukraine doesn’t realise,” said Svitlana, a nurse who initially oversaw the process of collecting death certificates and later escaped to Ukrainian-controlled territory. “It’s a huge tragedy.”\nUpdated at 15.37 CET\n28 Dec 2023 13.37 CET Here are some further comments from the Russian foreign minister, Sergei Lavrov, coming to us via Reuters. In an interview with RIA state news agency and the Rossiya 24 TV channel, Lavrov said some in the west were suggesting Moscow should discuss peace in Ukraine because the United States and its allies had failed to defeat Russian forces in Ukraine. He added he believed there were signs the west was changing its tactics and strategy on Ukraine. Lavrov said: The west is really changing its tactics – maybe even thinking about clarifying the strategy. Because if the ‘strategic defeat of Russia’ is a strategy, forgive the tautology, then this strategy failed miserably. There are some approaches, some whispers: why don’t you [Russia] meet with someone in Europe who would be ready to talk, talk about Ukraine without Ukraine itself.”\nUpdated at 13.40 CET\n28 Dec 2023 13.28 CET Two Russian men sentenced to prison terms for reciting poetry criticising Russia's invasion of Ukraine View image in fullscreen Russian poets Artyom Kamardin (left) and Yegor Shtovba (right) pictured during their verdict announcement at a court in Moscow on 28 December 2023. Photograph: Alexander Nemenov/AFP/Getty Images Two Russian men have been sentenced to long prison terms for reading poems criticising Russia’s military assault on Ukraine. Artyom Kamardin was sentenced to seven years and Yegor Shtovba to five years and six months to cries of “Shame!” from their supporters in the courtroom, according to Agence France-Presse. Kamardin, 33, said his detention in September 2022 was violent, claiming officers raped him and forced him to film an apology video while threatening his then girlfriend Alexandra Popova, now his wife. On the eve of his arrest he had recited his poem “Kill me, militia man!” on a Moscow square where dissidents have been gathering since the Soviet era. Kamardin also shouted slogans against the imperial “New Russia” project aiming to annex the south of Ukraine. Both men were convicted of “inciting hatred” and “calling for activities threatening state security”. Kamardin told the court he did not know his actions broke the law and asked for mercy. “I am not a hero, and going to prison for my beliefs was never in my plans,” he said in a statement, posted on his supporters’ Telegram channel. Shtovba, 23, also said he did not break the law. In his last statement in court, published by independent site Mediazona, he asked the judge: “What have I done that’s illegal? Read poetry?” Nikolai Dayneko, who was arrested at the same time, was sentenced to four years in prison last May after entering a pre-trial agreement, according to OVD-info. This is the latest in a string of heavy sentences against Russians who have protested against the invasion of Ukraine, in trials critics have denounced as absurd.\nUpdated at 13.35 CET\n28 Dec 2023 13.09 CET Footage has been posted that appears to show the Kherson railway station after Russian forces’ shelling on 26 December in which one policeman was killed and four people were injured. A train was set to evacuate residents when the shelling took place. Interior Minister Ihor Klymenko said after the incident that about 140 civilians had been at the station in the early evening and quick action by police to direct them away saved many lives. The Guardian has not been able to independently verify the footage. The Kherson railway station after Russian forces' shelling on the evening of 26 December.\n📹https://t.co/tEgDi4vHLthttps://t.co/i9L5rIQB5K pic.twitter.com/aMArDpDpTe — Euromaidan Press (@EuromaidanPress) December 28, 2023\n28 Dec 2023 12.34 CET View image in fullscreen A view of the Panama-flagged bulk carrier. Photograph: State Border Guard Service Of Ukraine/Reuters More on the Panama-flagged bulk carrier incident (see 09.25am) The carrier, which was heading to a River Danube port to load grain hit a Russian mine in the Black Sea on Wednesday, injuring two crew members, Ukrainian officials said on Thursday. It was the latest incident of a civilian vessel hitting an explosive in the Black Sea in what Kyiv says is a further example of stepped-up Russian attacks on shipping and port infrastructure, Reuters has reported. Ukraine’s southern military command said on Telegram: A Panama-flagged civilian vessel was blown up on an enemy sea mine in the Black Sea...The vessel lost its course and control, and a fire broke out on the upper deck. A captain and a sailor, an Egyptian citizen, were injured, with the latter hospitalised in the city of Izmail, the head of the Odesa regional prosecutor’s office said at a briefing. He added that the incident happened early on Wednesday at a river mouth. Moscow has increased attacks on Ukraine’s port infrastructure since mid-July, when it quit a UN-brokered deal that allowed safe passage of Ukrainian grain shipments via the Black Sea. Kyiv since has established an alternative route, which hugs the western shores of the Black Sea. It said Russian forces have been repeatedly dropping explosive devices in its vicinity.\nUpdated at 13.02 CET\n28 Dec 2023 11.56 CET The UK defence secretary, Grant Shapps, has said Russia “misled” when it claimed the Novocherkassk was “damaged”. Reposting the Ministry of Defence’s latest update on Ukraine, Shapps added on Twitter, formerly X: “It has been completely destroyed!” He continued: It’s crucial that in 2024 the civilised world continues to back Ukraine in this epoch defining battle currently playing out in Europe. Russia misled when it claimed Putin’s warship Novocherkassk was merely 'damaged' - it has clearly been completely destroyed!\nIt's crucial that in 2024 the civilised world continues to back Ukraine in this epoch defining battle currently playing out in Europe.\nRead the latest UK… https://t.co/cRSWNVQZsy — Rt Hon Grant Shapps MP (@grantshapps) December 28, 2023\nUpdated at 12.05 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: Zelenskiy says security of Ukraine, Europe and US relies on forceful response to Russia - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/28/russia-ukraine-war-live-us-state-department-calls-on-congress-to-act-swiftly-to-resume-flow-of-aid-to-kyiv"}