{"authors": ["Pjotr Sauer", "Artem Mazhulin"], "date_download": "2024-02-05 15:21:18", "date_modify": "None", "date_publish": "2023-12-28 15:05:30", "description": "Package including anti-aircraft missiles is likely to be last supplied without congressional approval", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F27%2Fus-ukraine-military-aid-weapons.json", "image_url": "https://i.guim.co.uk/img/media/4d90c14050c4e2e6a4d19dd949b9a9abda134465/0_287_5712_3427/master/5712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ebdbd247b352e3623dc6326fec5032f9", "language": "en", "localpath": null, "maintext": "The US announced a $250m (£196m) Ukraine military aid package on Wednesday, the last remaining tranche of weapons available for Ukraine under existing authorisation.\nThe package, provided through the presidential drawdown authority, will be pulled from Pentagon stockpiles, with Congress now needing to decide whether to keep supporting Kyiv’s battle against Russian invasion.\nThe package of arms includes Stinger anti-aircraft missiles, additional Himars ammunition, Javelin and AT-4 anti-armour systems as well as artillery and small arms ammunition. It is the Biden administration’s 54th disbursement of military equipment to Ukraine since August 2021.\nIn a statement, the US Department of Defense said: “These capabilities will support Ukraine’s most pressing needs to enable its forces to defend their sovereignty and independence. US leadership is essential to sustaining the coalition efforts of about 50 allies and partners currently supporting Ukraine. Security assistance for Ukraine is a smart investment in our national security.”\nThe presidential drawdown authority, a US foreign policy tool, allows for the speedy delivery of defence department stocks to foreign countries in crisis.\nThe Ukrainian president, Volodymyr Zelenskiy, on Thursday thanked “Joe Biden, Congress, and the American people” for the latest military aid package.\n“US leadership in the coalition of over 50 countries providing Ukraine with military aid is critical to countering terror and aggression not only in Ukraine but around the world,” the Ukrainian leader said.\n“To defend freedom and security not only in Ukraine and Europe but also in the United States, we must continue to respond to ongoing Russian aggression in the most forceful and resolute manner possible,” he added.\nCongress this month failed to approve the $50bn in fresh security aid for Ukraine as negotiators fell short of a deal for aid with Republicans demanding to pair with a domestic border crackdown.\nNews of more US military aid to Ukraine came after Biden announced another $200m military aid package earlier in December amid concerns that the war had reached a deadlock and growing Republican opposition to renewing a larger $61bn package of aid. Ukraine is separately waiting to receive a €50bn (£43.5bn) package from the EU, delivery of which has looked uncertain after Hungary blocked the European Union from approving the aid.\nUS critics of continued financial support for Ukraine have grown louder on Capitol Hill in recent months. They include senior Republicans, particularly far-rightwingers Matt Gaetz and Marjorie Taylor Greene, who have insisted on White House concessions on border security as a condition for a deal.\nA December Financial Times poll found that 48% of those questioned believed the US was spending “too much” in military and financial aid to bolster Kyiv’s war effort against Russia, compared with 27% who said Washington was spending the right amount.\nZelenskiy, earlier this month urged the US to continue supporting Ukraine, arguing the west must not “betray the soldier” in the fight for freedom.\n[Ukrainians] haven’t given up and won’t give up,” Zelenskiy said. “We know what to do. And you can count on Ukraine. And we hope just as much to be able to count on you.”\nBoth Ukrainian and Russian soldiers are struggling to make much progress along the frontline of the 22-month war.\nThe exhaustion of two years of fighting, the continued loss of life at the front and frustration at the slow pace with which western partners continue to provide weaponry have soured the mood in Kyiv, while the fighting in the Middle East has taken attention away from Ukraine and slowed flows of ammunition.\nAfter a largely failed Ukrainian summer offensive, Russian forces now have the initiative across multiple fronts.\nOn Monday, Russia’s defence minister, Sergei Shoigu, told Vladimir Putin in a meeting that its forces had gained full control of Maryinka in Ukraine’s east, marking one of Moscow’s most significant battlefield gains since last spring.\nUkrainian troops now face shortages of artillery shells and have had to scale back some operations.\n“For Ukraine, the immediate future is one of several months of hard fighting without critical resources, while endeavouring to regenerate the combat power that was expended over 2023,” Jack Watling, a senior research fellow for land warfare at the Royal United Services Institute, wrote in the Guardian this week.\nAs continued weapons supplies looked uncertain, Ukraine’s minister of strategic industries said on Wednesday that Kyiv was working to increase its own weapons manufacturing in 2024.\nOleksandr Kamyshin told a briefing Ukraine was producing six Bohdana self-propelled artillery units a month. Bohdanas are the only Ukrainian-produced self-propelled gun using Nato-standard 155mm rounds, making it a strategically important weapon for Kyiv.\nKamyshin also said the country next year aimed to produce up to 1,000 long-range strike drones, which have a range of about 1,000km (620 miles), and 10,000 middle-range drones.\nHis words came as Russia fired almost 50 Shahed drones at targets in Ukraine on Wednesday and shelled a train station where more than 100 civilians were gathered to evacuate.\nUkrainian officials said the barrages killed at least six people and knocked out power in most of the southern city of Kherson.", "source_domain": "www.theguardian.com", "text": null, "title": "US to provide Ukraine with up to $250m in arms and equipment", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/27/us-ukraine-military-aid-weapons"}