{"authors": [], "date_download": "2024-02-05 15:21:19", "date_modify": "None", "date_publish": "2023-12-28 00:18:10", "description": "The United States will transfer $250m in arms and munitions to Ukraine", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fbiden-ukraine-aid-package-war-russia-b2470162.html.json", "image_url": "https://static.independent.co.uk/2023/12/24/16/EEUU-CONGRESO-UCRANIA_93750.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States will transfer $250m in arms and munitions to Ukraine as part of what could be the final package of American defence assistance to Kyiv amid a refusal to authorise more funds by Republicans in Congress.\nIn a statement, Secretary of State Anthony Blinken said the weapons and equipment package “provides up to $250m of arms and equipment under previously directed drawdowns for Ukraine” in the form of “air defense munitions, other air defense system components, additional ammunition for high mobility artillery rocket systems, 155mm and 105mm artillery ammunition, anti-armor munitions, and over 15 million rounds of ammunition”.\n“A coalition of more than 50 countries continues to provide critical support for Ukraine’s forces. It is imperative that Congress act swiftly, as soon as possible, to advance our national security interests by helping Ukraine defend itself and secure its future,” Mr Blinken added.\nThe arms package announced by the Biden administration could be the last bit of US assistance provided for Kyiv’s fight against Russia, as many Republicans continue to oppose further support to Ukraine because it would be counted as a win for Mr Biden in an election year.\nEarlier this month, Mr Biden slammed House and Senate Republicans for appearing to do the bidding of the Russian government by blocking the supplemental appropriations bill he called for in October to allocate billions of dollars towards Ukraine’s defence against Russia’s invading forces.\nSpeaking alongside Ukrainian President Volodymyr Zelensky during a 12 October press conference at the White House, Mr Biden said the US was “rapidly coming to an end of our ability to help Ukraine” without passage of the supplemental spending bill, and he warned that Russian president Vladimir Putin was “banking” on US legislators not being able to agree to advance the funding bill.\n“Moscow celebrated when Republicans voted to block Ukraine aid last week — a host of a Kremlin run shows literally said and I quote: ‘Well done Republicans, that’s good for us,’” Mr Biden recalled, apparently referring to a recent Daily Beast report detailing the gleeful reaction to the GOP’s intransigence on Russian state television.\nThe president added: “If you’re being celebrated by Russian propagandists, it might be time to rethink what you’re doing”.\nHouse and Senate Republicans and Senate Democrats have been at an impasse over the GOP’s demand that Mr Biden agree to draconian changes to US immigration policies meant to make it more difficult — if not impossible — for largely non-white immigrants from South and Central America and other countries to claim asylum at the US-Mexico border or receive protection from removal from the country.\nThe GOP hostage-taking, which is reminiscent of other Republican-induced crises over funding for the US government and the federal debt ceiling, has held up funding for multiple US defence priorities in recent weeks.\nAdditionally, some Republicans in both chambers remain intractably opposed to appropriating further defence aid to Kyiv because it would be seen by their political base as a win for Mr Biden, and because many GOP voters believe conspiracy theories espoused by former president Donald Trump and his allies, who claim that Mr Biden’s steadfast support for Ukraine stems from alleged bribes paid to him through his son, Hunter Biden.\nThere is no evidence to support any such claims of corruption, but some GOP members have cited the outlandish theories to justify their lack of support for further aid to Kyiv.", "source_domain": "www.independent.co.uk", "text": null, "title": "Biden authorises final $250m aid package for Ukraine after Congress fails to approve more funds", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-ukraine-aid-package-war-russia-b2470162.html"}