{"authors": [], "date_download": "2024-02-05 15:21:25", "date_modify": "None", "date_publish": "2023-12-28 05:04:02", "description": "The number of Israeli soldiers wounded in the war with Hamas is growing", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-gaza-strip-israeli-hamas-benjamin-netanyahu-b2470263.html.json", "image_url": "https://static.independent.co.uk/2023/12/28/05/Israel_War_Wounded_Soldiers_18140.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIgor Tudoran spent just 12 hours inside the Gaza Strip before a missile slammed into his tank, leaving him with a life-altering injury.\n“Already within the tank, I understood from the condition of my leg that I would lose it. But the question was how much of it will I lose,” he said, seated on a bed in the hospital where he has been treated since he was wounded last month.\nTudoran, 27, a reservist who volunteered for duty after the Oct. 7 attack on southern Israel by Hamas that triggered the war, lost his right leg beneath the hip. He has kept up a positive attitude — but concedes that his hopes of becoming an electrician may no longer be possible.\nTudoran is part of a swelling number of wounded Israeli fighters, yet another sizable and deeply traumatized segment of Israeli society whose struggles are emerging as a hidden cost of the war that will be felt acutely for years to come. Given the large numbers of wounded, advocates worry the country is not prepared to address their needs.\n“I have never seen a scope like this and an intensity like this,” said Edan Kleiman, who heads the nonprofit Disabled Veterans Organization, which advocates for more than 50,000 soldiers wounded in this and earlier conflicts. “We must rehabilitate these people,” he said.\nIsrael's Defense Ministry says roughly 3,000 members of the country's security forces have been wounded since Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people, mostly civilians, and taking 240 people hostage. Nearly 900 of those are soldiers wounded since Israel began its ground offensive in late October, in which troops have engaged in close combat with Hamas militants. More than 160 soldiers have been killed since the ground operation began.\n“They add up,” said Yagil Levy, who teaches civil-military relations at Israel’s Open University, of the wounded. “There could be a long-term impact if we see a big rate of people with disabilities that Israel must rehabilitate, which can produce economic issues as well as social issues.”\nThe war has also brought unprecedented suffering to Palestinians in Gaza, where more than 21,000 have been killed, close to 55,000 wounded and amputations have become commonplace. Most of the tiny enclave’s population has been displaced.\nIsraelis still largely stand behind the war's objectives and it is mostly seen as an existential battle meant to restore a sense of security lost in Hamas’ attacks. The media hardly cover the hardship endured by Palestinians, and their plight barely registers in Israeli public discourse.\nIn a country with compulsory military service for most Jews, the fate of soldiers is a sensitive and emotional topic.\nThe names of fallen soldiers are announced at the top of hourly newscasts. Their funerals are packed with strangers who come to show solidarity. Their families receive generous support from the army.\nBut historically the plight of the wounded, though lauded as heroes, has taken a backseat to the stories of soldiers killed in battle. After the fanfare surrounding tales of their service and survival recedes, the wounded are left to contend with a new reality that can be disorienting, challenging and, for some, lonely. Their numbers have not had significant bearing on public sentiment toward Israel's wars in the way that mounting soldiers' deaths have.\nThe exceptionally large numbers of wounded in this war, however, will provide a visible reminder of the conflict for years to come.\nPrime Minister Benjamin Netanyahu emphasized their sacrifice during a recent visit to wounded soldiers at Sheba Medical Center, Israel’s largest hospital, which has treated and rehabilitated many of the injured. “You are genuine heroes,” he said.\nAt Sheba, soldiers and civilians wounded in the war spilled out into the corridors on a recent day and passed the time with their families on an outdoor deck. Soccer paraphernalia adorned the wounded soldiers’ hospital beds as did the ubiquitous Israeli flag.\nOne man who had lost a leg after being attacked at the Nova music festival on Oct. 7 lay in the sun on the hospital grounds, his wheelchair parked nearby. The Israeli pop diva Rita handed out hugs to some wounded soldiers. A military helicopter carrying more wounded landed nearby.\nThe Israeli Defense Ministry said it was working at “full capacity” to assist the wounded, and that it was cutting red tape and hiring employees to deal with the influx.\nJonathan Ben Hamou, 22, who lost his left leg beneath the knee after a rocket-propelled grenade struck the bulldozer he was using to help clear the way for other troops, is already looking forward to the day when he can use a state-funded prosthetic.\nBen Hamou, who mostly uses a wheelchair since the incident in early November, said that he eventually plans to pursue his goal of attending a military commanders’ course.\n“I’m not ashamed of the wound,” said Ben Hamou, who filmed the RPG’s moment of impact as well as his evacuation to hospital. “I was wounded for the country in a war inside Gaza. I am proud.”\nBut Kleiman, who himself was wounded in an operation in the Gaza Strip in the early 1990s, said he thinks Israeli authorities are not grasping the severity of the situation.\nThe disabled veterans group is ramping up efforts to address what he suspects will be the overwhelming needs of a new cadre of wounded soldiers. He said the organization is tripling its manpower, adding therapists and employees to help wounded veterans navigate bureaucracy and upgrade rehab centers.\nKleiman said the number of wounded is likely to stretch close to 20,000 once those diagnosed with post-traumatic stress disorder are included.\nHe said if wounded soldiers don’t receive the mental and physical care they need, including making their homes or cars accessible, it could stunt their rehabilitation and delay or even prevent their reentry into the workforce.\n“There are wounded whose lives have been ruined,\" said Idit Shafran Gittleman, a senior researcher at the Institute for National Security Studies, a Tel Aviv research center. \"They will have to contend with their wound their entire lives.”\n___ Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war", "source_domain": "www.independent.co.uk", "text": null, "title": "The number of wounded Israeli soldiers is mounting, representing a hidden cost of war", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-gaza-strip-israeli-hamas-benjamin-netanyahu-b2470263.html"}