{"authors": ["Perkin Amalaraj"], "date_download": "2024-02-05 15:15:00", "date_modify": "None", "date_publish": "2024-01-29 00:55:28", "description": "UN secretary general Antonio Guterres, 74, today urged Western states to resume funding after hundreds of millions of dollars were pulled off the table following serious allegations", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13017351%2FPalestinian-aid-agency-centre-October-7-scandal-faces-claims-staff-ferried-Hamas-gunmen-massacre-sites-celebrated-attacks-online-murdered-Israelis.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/28/19/80563335-0-image-m-49_1706469999390.jpg", "language": "en", "localpath": null, "maintext": "The UN's secretary general has begged the West to resume funding the only aid agency allowed in the Gaza Strip, following allegations that several staff members helped Hamas carry out its terror attack on October 7.\nAntonio Guterres, 74, today urged Western states, including the UK, US, Canada and much of continental Europe, to resume funding after hundreds of millions of dollars were pulled off the table, following the allegations made by Israel on January 26.\nIsrael accused 12 employees of the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) of helping Hamas in its efforts to attack Israel on October 7.\nNew claims of UNRWA's alleged involvement with the October 7 massacre have tonight emerged.\nDavid Bedein, of Israel's Centre for Near East Policy Research, told the Sun that survivors claimed that the agency's staff were 'involved in actual murder — wielding guns and killing people'.\nHe said: 'People under attack recognized their attackers.'\nAntonio Guterres, 74, (pictured) today urged Western states, including the UK, US, Canada and much of continental Europe, to resume funding UNRWA after hundreds of millions of dollars were pulled off the table\nThe eight countries that have so far pulled funding from UNRWA provided nearly 60% of UNRWA's budget in 2022 (File image)\nInternally displaced Palestinians outside the UNRWA school in Rafah, southern Gaza Strip, January 28 2024\nWhat is UNRWA? The UN agency for Palestinian refugees, known as UNRWA, employs thousands of staffers and provides vital aid and services to millions of people across the Middle East. In Gaza, it has been the main supplier of food, water and shelter to civilians during the Israel-Hamas war. Israel has long railed against the agency, accusing it of tolerating or even collaborating with Hamas and of perpetuating the 75-year-old Palestinian refugee crisis. The Israeli government has accused Hamas and other militant groups of siphoning off aid and using UN facilities for military purposes, allegations that the agency has denied. UNRWA was established to provide aid to the estimated 700,000 Palestinians who fled or were driven out during the 1948 war surrounding the country's creation. UNRWA operates schools, health clinics, infrastructure projects and aid programs in refugee camps that now resemble dense urban neighborhoods in Gaza, the Israeli-occupied West Bank, Lebanon, Syria and Jordan. It has 13,000 employees in Gaza alone, the vast majority of them Palestinians. In Gaza, where some 85% of territory's 2.3 million people have fled their homes, over 1 million are sheltering in UNRWA schools and other facilities Source: Associated Press Advertisement\nBedein says that while 12 people have so far been implicated, they are only the 'tip of the iceberg.'\n'We've been researching UNRWA for years and found it's been thoroughly infiltrated by Hamas.'\nWhile UNRWA did not specify how many employees were implicated in the scandal, the US, the first to pull its funding, said 12 were involved.\nWithin hours, the UK and several other countries, including Australia, Canada, Italy, Germany, Switzerland, Finland and the Netherlands, responded to the claims in the same manner.\nThe eight countries that have so far pulled funding from UNRWA provided nearly 60% of UNRWA's budget in 2022.\nGuterres said in a statement: 'The abhorrent alleged acts of these staff members must have consequences.\n'But the tens of thousands of men and women who work for UNRWA, many in some of the most dangerous situations for humanitarian workers, should not be penalized. The dire needs of the desperate populations they serve must be met.'\nThe secretary-general added that of the 12 accused employees, nine were immediately terminated, one was confirmed dead and two were still being identified.\nHe said they would be held accountable, including through criminal prosecution.\nA UN spokesperson separately warned that if funding did not come back, aid efforts would have to stop by the end of February.\nProtests against the UK's decision to suspend funding to UNRWA sprung up outside Downing Street tonight.\nDozens of people, many carrying Palestinian flags, were seen across the road from the Cabinet Office, on Whitehall, central London.\nThey crowded round the statue of Field Marshal Viscount Montgomery of Alamein to protest the British government's decision.\nThe October 7 Hamas attack, which UNRWA employees allegedly took part in, in southern Israel killed about 1,200 people, mostly civilians, and militants took about 250 hostages.\nIsrael launched a massive military operation in response, which has so far killed more than 26,000 Palestinians, according to local health officials, destroyed vast swaths of Gaza and displaced nearly 85% of the territory's people.\nIsrael says its air and ground offensive has killed more than 9,000 militants, without providing evidence.\nThe besieged territory is in the grip of a severe humanitarian crisis, with a quarter of the population facing starvation as fighting and Israeli restrictions hinder the delivery of aid.\nUNRWA provides basic services for Palestinian families who fled or were driven out of what is now Israel during the 1948 war surrounding the country's creation.\nThey live in built-up refugee camps in Gaza, the Israeli-occupied West Bank, Jordan, Lebanon and Syria.\nThe refugees and their descendants are the majority of Gaza's population. Since the war began, most of the territory's 2.3 million people depend on the agency's programs for 'sheer survival,' including food and shelter, UNRWA Commissioner-General Philippe Lazzarini said.\nThat lifeline could 'collapse any time now,' he said after funding was suspended.\nSmoke rises over Khan Younis, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas\nAlready, the amount of aid entering Gaza has been well below the daily average of 500 trucks before the war.\nAnd in the past week, hostages' family members and supporters have blocked aid trucks from entering at the Kerem Shalom crossing.\nDozens of protesters again blocked the entry on Sunday, chanting 'No aid will cross until the last hostages return.'\nThe military later declared the area around the crossing a closed military zone, which would prohibit protests there.\nMany have called for a more rigid ceasefire deal between Hamas and Israel to be negotiated.\nTwo senior Biden administration officials said US negotiators were making progress on a potential agreement under which Israel would pause military operations against Hamas for two months in exchange for the release of more than 100 remaining hostages.\nThe officials, who requested anonymity to discuss the ongoing negotiations, said that emerging terms of the deal would play out over two phases, with the remaining women, elderly and wounded hostages to be released in a first 30-day phase.\nThe emerging deal also calls for Israel to allow more humanitarian aid into Gaza.\nTwo senior Biden administration officials said US negotiators were making progress on a potential agreement under which Israel would pause military operations against Hamas for two months\nInternally displaced Palestinians move past Israeli tanks after the Israeli army told residents of Khan Younis camp to leave their homes and head towards Rafah camps near the Egyptian border\nAn Israeli tank stands amid the rubble as Palestinians fleeing Khan Younis, due to the Israeli ground operation\nCIA Director Bill Burns was expected to discuss the contours of the emerging agreement during meetings Sunday in France with David Barnea, the head of Israel's Mossad intelligence agency, Qatari Prime Minister Mohammed bin Abdulrahman Al Thani, and Egyptian intelligence chief Abbas Kamel.\nIsraeli Minister of Defense Yoav Gallant, in comments to troops on Sunday, said that 'these days we are conducting a negotiation process for the release of hostages' but vowed that as long as hostages remain in Gaza, 'we will intensify the (military) pressure and continue our efforts - it's already happening now.'\nMore than 100 hostages, mainly women and children, were released in November in exchange for a weeklong cease-fire and the release of 240 Palestinians imprisoned by Israel.\nThe conflict has begun to spill out into the wider Middle East region, with states including Iran and Yemen ramping up military action.\nThree American troops were killed in a drone strike in Jordan today, the first US fatalities in months of strikes against American forces across the Middle East by Iranian-backed militias amid the war in Gaza.\nPalestinians fleeing Khan Younis, due to the Israeli ground operation, move towards Rafah\nThe destroyed Hamad Towers following an Israeli military operation in the town of Khan Younis, southern Gaza Strip, January 26 2024\nA Palestinian man holds a flour bag as others wait to receive theirs from the United Nations Relief and Works Agency\nUS Central Command said 25 service members were injured, while other US officials were working to conclusively identify the group responsible for the attack, but assessed that one of several Iranian-backed groups was responsible.\nJordanian state television quoted a government spokesperson as contending the attack happened across the border in Syria, while US officials insisted it took place in Jordan, which American troops have long used as a basing point.\nThe US in recent months has struck targets in Iraq, Syria and Yemen to respond to attacks on American forces and to deter Iranian-backed Houthi rebels from continuing to threaten commercial shipping in the Red Sea.\nThe war in Gaza has sparked concerns about a regional conflict. The United States, Israel's closest ally, has increasingly called for restraint in Gaza and for more humanitarian aid to be allowed into the territory while supporting the offensive.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Palestinian UN aid agency at centre of October 7 scandal faces claims staff ferried Hamas gunmen to massacre sites, celebrated attacks online and even murdered Israelis", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13017351/Palestinian-aid-agency-centre-October-7-scandal-faces-claims-staff-ferried-Hamas-gunmen-massacre-sites-celebrated-attacks-online-murdered-Israelis.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}