{"authors": [], "date_download": "2024-02-05 15:21:28", "date_modify": "None", "date_publish": "2023-12-28 20:12:33", "description": "President Nicolás Maduro has ordered Venezuela’s armed forces to conduct defensive exercises in the Eastern Caribbean after the United Kingdom announced it would send a warship to Guyana’s territorial waters during a border dispute between the South American neighbors", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fnicolas-maduro-ap-guyana-venezuela-british-b2470588.html.json", "image_url": "https://static.independent.co.uk/2023/12/14/05/Venezuela_Guyana_Dispute_65090.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPresident Nicolás Maduro ordered Venezuela’s armed forces to conduct defensive exercises in the Eastern Caribbean after the United Kingdom sent a warship toward Guyana’s territorial waters as the South American neighbors dispute a large border region.\nIn a nationally televised address on Thursday, Maduro said that 6,000 Venezuelan troops, including air and naval forces, will conduct joint operations off the nation’s eastern coast -- near the border with Guyana.\nMaduro described the impending arrival of British ship HMS Trent to Guyana’s shores as a “threat” to his country. He argued the ship’s deployment violates a recent agreement between the South American nations.\n“We believe in diplomacy, in dialogue and in peace, but no one is going to threaten Venezuela,” Maduro said in a room where he was accompanied by a dozen military commanders. “This is an unacceptable threat to any sovereign country in Latin America.”\nVenezuela and Guyana are currently involved in a border dispute over the Essequibo, a sparsely populated region the size of Florida with vast oil deposits off its shores.\nThe region has been under Guyana’s control for decades, but in December, Venezuela relaunched its historical claim to the Essequibo through a referendum in which it asked voters in the country whether the Essequibo should be turned into a Venezuelan state.\nAs tensions over the region escalated, the leaders of both countries met in the Caribbean island of St Vincent, and signed an agreement which said they would solve their dispute through nonviolent means.\nDuring the talks, however, Guyana’s President Irfan Ali said his nation reserved its right to work with its partners to ensure the defense of his country.\nHMS Trent is a patrol and rescue ship that was recently used to intercept drug traffickers off the West Coast of Africa. It can accommodate up to 30 sailors and a contingent of 18 marines, and is equipped with 30mm cannons and a landing pad for helicopters and drones.\nThe ship had been sent to Barbados in early December to intercept drug traffickers, but its mission was changed on Dec. 24, when it was sent to Guyana. Authorities did not specify when it was expected to arrive off Guyana's shores.\nThe United Kingdom’s Defense Ministry said the ship would be conducting joint operations with Guyana’s defense forces.\nThe nation of 800,000 people has a small military that is made up of 3,000 soldiers, 200 sailors and four small patrol boats known as Barracudas.", "source_domain": "www.independent.co.uk", "text": null, "title": "Venezuela will hold military exercises off its shores as a British warship heads to Guyana", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/nicolas-maduro-ap-guyana-venezuela-british-b2470588.html"}