{"authors": ["Harry Davies", "Manisha Ganguly"], "date_download": "2024-02-05 15:21:38", "date_modify": "None", "date_publish": "2023-12-27 05:00:58", "description": "Israel appears to be receiving munitions from stockpile, but there has been little transparency", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F27%2Fgaza-war-puts-us-extensive-weapons-stockpile-in-israel-under-scrutiny.json", "image_url": "https://i.guim.co.uk/img/media/c30014ddeecc226b9fce9d22d4d537ba0b1ab6c0/0_365_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7eebc69bfda8001628366f87cc8eb0e7", "language": "en", "localpath": null, "maintext": "Their precise location is classified, but somewhere in Israel there are multiple closely guarded warehouses that contain billions of dollars’ worth of weapons owned by the US government.\nLong shrouded in secrecy, the warehouses are part of an extensive but previously little-known stockpile now facing scrutiny as pressure mounts on the Biden administration over its support for Israel’s bombardment of Gaza.\nThe stockpile was first established in the 1980s to rapidly supply US forces for any future Middle East conflicts. However, over time, Israel has been permitted in certain situations to draw from its extensive supplies.\nIsrael now appears to be receiving munitions from the stockpile in significant quantities for use in its war on Gaza, yet there has been little transparency about transfers from the arsenal.\nIn interviews with the Guardian, multiple former US officials familiar with American security assistance to Israel have described how the stockpile enables expedited arms transfers to the Israel Defense Forces (IDF). It can also shield movements of US weapons from public and congressional oversight, they said.\n“Officially it’s US equipment for US use,” a former senior Pentagon official said, “but on the other hand, in an emergency, who’s to say we’re not going to give them the keys to the warehouses?”\nSince the emergency of the Hamas massacre on 7 October, Israel has dropped tens of thousands of bombs in Gaza, and it has been open about its demand for large amounts of US-supplied munitions.\nThere are widely held concerns that Israel’s bombing of Gaza has been indiscriminate. And with close to 20,000 people dead in Gaza, according to local authorities, the US is facing questions about the quantities and categories of bombs it is providing to Israel and the proportion being made available through the secretive pre-positioned stockpile.\nIn Washington, lawmakers have raised concerns about proposals by the White House that would relax rules on the kinds of weapons placed in the stockpile, waive spending caps on its replenishment and give the Pentagon greater flexibility to make transfers from the arsenal.\nJosh Paul, who recently resigned from the state department in protest at Washington’s continued lethal assistance for Israel, said the proposed changes to the stockpile were part of a drive by the Biden administration to find new ways to supply Israel.\nDescribing internal US deliberations in October, he said: “There was a press from the White House to say essentially we need to figure out every possible [legal] authority that we could give Israel that would get it weapons as fast as possible.”\nAn abundance of munitions\nThe full contents of the pre-positioned stockpile – known as the War Reserve Stocks for Allies-Israel (WRSA-I) – are not publicly disclosed, though former officials say the Pentagon provides Congress with an annual breakdown of what it holds.\nThe report may be classified, but earlier this year an unusually candid description of the stockpile’s contents emerged when a former US military chief recalled in an op-ed touring the WRSA-I warehouse.\n“The current stockpile is full of so-called dumb munitions [those without sophisticated guidance systems],” he said, including “thousands of ‘iron bombs’ that are simply dropped from aircraft so gravity can do its work”.\nView image in fullscreen Israeli Air Force shared an image of the M117 dumb bomb on Oct 12 with the caption on X: “arming and continuing the series of attacks.” Photograph: Israeli Air Force\nIn 2020, this abundance of dumb munitions in the stockpile was highlighted by a pro-Israel thinktank, the Jewish Institute for National Security of America, which complained that WRSA-I had become “obsolete” because of its high levels of unguided bombs and shortage of precision-guided munitions (PGMs).\nIn its latest aerial bombardment of Gaza, however, Israel has relied heavily on these lower-accuracy unguided munitions, which weapons experts say has undercut claims by the IDF that it is trying to minimise civilian casualties.\nIsrael has not denied its use of unguided munitions, which can pose significant risks to civilians when used in densely populated areas. Its air force repeatedly shared images on social media at the beginning of the offensive of dumb bombs, such as M117s, attached to its fighter jets.\nIt is not possible to ascertain how frequently M117s were being used in Gaza or the manner of their deployment, but between 40% and 45% of the munitions used by Israel have been unguided, according to US intelligence assessments reported by CNN. The Pentagon did not respond to questions about what proportion of these munitions were from WRSA-I.\nQuick Guide Unguided and precision-guided munitions – explained Show Unguided munitions, also known as dumb bombs, do not have guidance systems but follow a ballistic trajectory, guided by gravity, and can therefore be imprecise. These munitions, which tend to be based on older designs, have a higher chance of causing civilian casualties when used in densely populated areas like Gaza.\nPrecision-guided munitions (PGMs) are designed to increase the chances of the munition damaging or destroying its intended target while reducing collateral damage. Greater accuracy is achieved using in-built systems such as laser, GPS and radar technology to guide the weapon. An unguided munition can become a PGM when a guidance tail kit – such as a US-made Joint Direct Attack Munitions (JDAM) – is attached, converting the munition into a guided bomb unit (GBU). These bombs can carry payloads of thousands of pounds; heavy GBUs can flatten buildings and are referred to as bunker busters. Was this helpful? Thank you for your feedback.\nA former senior US official familiar with WRSA-I said that when it came to air-to-ground munitions, “we’ll give them whatever they need”, though they noted that Israel had its own domestically produced supplies of unguided munitions, unlike PGMs for which it largely relies on sales from the US.\nUS-supplied tail kits allow Israel to convert its stocks of unguided bombs into precision-guided ones, heavy 2,000lb versions of which appear to have been used in airstrikes on the Jabalia refugee camp in northern Gaza.\nDefence analysts say there is little transparency about the categories and quantities of arms that the US is providing to Israel, but one transfer from WRSA-I emerged in October when Axios reported that the US would supply Israel with 155mm artillery shells. The unguided munitions, intended for Israel’s ground campaign in Gaza, were held in large volumes in WRSA-I.\nThe 155mm shells are particularly hazardous, according to Marc Garlasco, a former UN war crimes investigator, as each shell releases 2,000 lethal fragments, and “their accuracy degrades over distance, increasing the likelihood of civilians and civilian infrastructure getting hit by errant shells”.\nView image in fullscreen The manufacturing of 155mm artillery shells at a plant in Scranton, Pennsylvania. Photograph: Brendan McDermid/Reuters\nImages published by Gaza police’s explosive ordnance disposal team last month appeared to show munition fragments of 155mm artillery shells being removed from buildings in Gaza. It is not known whether they were of US origin or from its stockpile.\nThe IDF and Israel’s defence ministry did not respond to requests for comment.\nBypassing controls\nAlthough Israel maintains WRSA-I and pays for its storage, its access to the stockpile is not unlimited, said Sarah Harrison, a former US defence department lawyer who is now an analyst at Crisis Group.\n“There’s only one other stockpile like this, in [South] Korea, it’s very unique and allows for a transfer to happen fast,” she said. “But the stockpile does not authorise Israel to just take things and take things for free,” as there has to be a legal authority for each transfer of equipment.\nFormer officials said that where transfers from WRSA-I can differ from regular arms sales between the US and another country was that the equipment can be drawn from the stockpile before the processes that account for the transferred equipment are fully completed.\n“We sort of retroactively build a foreign military sales case, which may or may not need to be notified to Congress, depending on what they took and what quantities,” said Josh Paul, the former state department official.\nPaul, who until October worked on the US’s foreign arms transfers, said he was concerned by the expedited process as it could bypass the state department’s pre-transfer controls. “There’s no review of human rights, there’s no review of regional balance, there’s none of the conventional arms transfer policy review that would normally happen,” he said. “Essentially, it’s take what you can and we’ll sort it out later.”\nA Pentagon spokesperson acknowledged it was “using foreign military financing and sales authorities to expedite delivery of security assistance, where feasible”. They said the US was “leveraging several avenues and sources to provide Israel security assistance, to include stockpiles in Israel and the US.”\nArms control experts say the speed and opacity of these transfers make it difficult to understand what is leaving WRSA-I, the legal mechanisms used for drawdowns and the extent to which Congress is being made aware of what support the US is providing to Israel via the stockpile.\nNow, the White House is seeking to use its supplemental spending request to further relax rules related to WRSA-I, a move that senators led by Elizabeth Warren have said would harm their ability to “determine whether US assistance is contributing to disproportionate civilian harm”.\nBrian Finucane, a former legal adviser at the state department, said Israel enjoyed many existing exceptions from procedural safeguards in its defence partnership with the US, and “any additional shortcut in fuelling conflict in the Middle East should be concerning”.\nHe said: “Do these arm transfers make sense strategically? Does pouring additional gasoline on the fire make sense in terms of US national interests or in achieving peace and stability in the region?”", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza war puts US’s extensive weapons stockpile in Israel under scrutiny", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/27/gaza-war-puts-us-extensive-weapons-stockpile-in-israel-under-scrutiny"}