{"authors": [], "date_download": "2024-02-05 15:21:39", "date_modify": "None", "date_publish": "2023-12-27 19:13:36", "description": "Tel Aviv teen is first conscientious objector jailed during Israeli war against Hamas", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Ftal-mitnick-israel-draft-hamas-b2470097.html.json", "image_url": "https://static.independent.co.uk/2023/12/27/18/newFile-2.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nTal Mitnick is the first conscientious objector to face jail time for refusing to enlist in the Israeli military during its ongoing war against Hamas, but he may not be the last.\nLike few times in the country’s history, youth are questioning a bedrock element of Israel’s security state, the vaunted Israeli Defense Forces, and signalling an intention to avoid enlisting.\nMitnick, an 18-year-old from Tel Aviv, entered the Tel Hashomer enlistment centre on Tuesday, flanked by supporters, and announced his intention to refuse the country’s compulsory military service.\n“I believe that slaughter can not solve slaughter,” he said in a video statement shared by Mesarvot, a conscientious objector group. “The criminal attack on Gaza won’t solve the atrocious slaughter that Hamas executed. Violence won’t solve violence. And that is why I refuse.”\nIn a separate written statement, he added that he believed Israel’s extended military response to the 7 October Hamas attack had not been effective at protecting civilian lives in Israel or Gaza.\n\"We must recognize the fact that after weeks of the ground operation in Gaza, at the end of the day - negotiations, an agreement, brought back the hostages. It was actually military action that caused them to be killed,” he said. “Because of the criminal lie that ‘there are no innocent civilians in Gaza,’ even hostages waving a white flag shouting in Hebrew were shot to death. I don’t want to imagine how many similar cases there were that were not investigated because the victims were born on the wrong side of the fence.”\nHe’s been sentenced to 30 days in a military prison, and could face repeated detention if he continues to object to military service.\nMilitary service is mandatory for most Jewish Israelis, though some are allowed exemptions on religious grounds. Those with political objections to army service are not considered valid objectors.\nAt various points, groups of soldiers have waged high-profile attempts to refuse service or to carry out various operations, including a group of Israeli Air Force pilots in 2003, though 2023 has taken things to a new level.\nIn March, as thousands of Israelis protested a planned judicial reform viewed as an effort to curtail the power of the courts over Prime Minister Benjamin Netanyahu, who faces a corruption trial, roughly 700 military reservists resigned in protest.\nAt the time, Mr Netanyahu said, “There’s no room for refusals,” calling military service “the first and most important foundation of our existence in our land.”\nThen, in August, a group of over 200 high school students said they would oppose their eventual enlistment, protesting both the judicial reform and the “occupation” of Gaza and the West Bank.\n“For me, to give full support to settler violence, decades of military rule, and judicial reform that gives all the power to corrupt and clerical politicians completely crosses my red line,” Lily Hochfeld, 17, told972 magazine at the time. “I can no longer enlist in such an army and not fear for my future and that of my country.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Israeli teen jailed for refusing to enlist in army during Hamas war", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/tal-mitnick-israel-draft-hamas-b2470097.html"}