{"authors": ["Adam Fulton", "Fran Lawther", "Léonie Chao-Fong", "Yohannes Lowe"], "date_download": "2024-02-05 15:21:41", "date_modify": "None", "date_publish": "2023-12-27 00:16:11", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F26%2Fisrael-gaza-war-live-updates-hamas-palestinians-deaths-idf-strikes-un.json", "image_url": "https://i.guim.co.uk/img/media/24dc5b2a11ddc7cb4279987a88f2df6e7b60995c/0_64_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=9c694a888c70eba659ec40d014186a68", "language": "en", "localpath": null, "maintext": "26 Dec 2023 00.53 CET The United States has welcomed the appointment Sigrid Kaag of the Netherlands as the UN coordinator for humanitarian aid to Gaza. State department spokesman Matthew Miller said on X (formerly Twitter) that the US looked forward to working closely with Kaag “to accelerate and streamline provision of live-saving humanitarian relief” to Palestinian civilians in the territory. We welcome today’s @UN appointment of Sigrid Kaag as Senior Humanitarian and Reconstruction Coordinator for Gaza. We look forward to working closely with her and @UNOPS to accelerate and streamline provision of live-saving humanitarian relief to Palestinian civilians in Gaza. — Matthew Miller (@StateDeptSpox) December 26, 2023\nUpdated at 01.46 CET\n26 Dec 2023 00.15 CET UN names Netherlands' Sigrid Kaag aid coordinator for Gaza Sigrid Kaag, the Dutch former deputy prime minister and a Middle East east expert, has been appointed the United Nations’ coordinator for humanitarian aid to Gaza. The announcement by the UN secretary general, António Guterres, on Tuesday follows the security council’s adoption of a resolution on Friday requesting him to expeditiously appoint a senior humanitarian and reconstruction coordinator for Gaza, where more than 2 million civilians are in desperate need of food, water and medicine, the Associated Press reports. Guterres said Kaag, who speaks fluent Arabic and five other languages, “brings a wealth of experience in political, humanitarian and development affairs as well as in diplomacy” to her new post. She is expected to start on 8 January. “She will facilitate, coordinate, monitor, and verify humanitarian relief consignments to Gaza,” he said, adding that Kaag will also establish a UN mechanism to accelerate aid deliveries “through states which are not party to the conflict”. View image in fullscreen ‘Wealth of experience’: Sigrid Kaag. Photograph: Geert Vanden Wijngaert/AP Gaza’s entire population of 2.3 million population is in food crisis, with 576,000 people at catastrophic or starvation levels and the risk of famine “increasing each day”, according to a report released last Thursday by 23 UN and nongovernmental organisations. It blamed the widespread hunger on insufficient aid entering Gaza. Israel stopped all deliveries of food, water, medicine and fuel into the territory after the militant Hamas group’s 7 October rampage in southern Israel which killed about 1,200 people. The Israel-Gaza war has so far killed more than 20,900 people in Gaza, according to its Hamas-run health ministry. After US pressure, Israel allowed a trickle of aid in through Egypt, but UN agencies say that for weeks only 10% of food needs has been entering Gaza. Last week, Israel opened the Kerem Shalom crossing into the territory and truck traffic increased but an Israeli strike on Thursday morning on the Palestinian side of the crossing stopped aid pickups, the UN agency for Palestinian refugees said. This is Adam Fulton picking up our live coverage. It’s 1.15am in Gaza City and Tel Aviv\nUpdated at 03.14 CET\n26 Dec 2023 23.45 CET Here is the latest full report on the Israel-Gaza war from the Guardian’s Bethan McKernan in Jerusalem: Israel is engaged in a “multi-front war”, its defence minister has said, hinting at military operations across the Middle East as the war in Gaza showed new signs of a dangerous regional escalation. Speaking in parliament on Tuesday, Yoav Gallant said Israel was “coming under attack from seven theatres: Gaza, Lebanon, Syria, Judea and Samaria [an Israeli term for the West Bank], Iraq, Yemen and Iran”. “We have already responded and taken action in six of these theatres,” he told the Knesset, without specifying. Iran-allied militias around the Middle East have attacked Israel and US military installations across the region since Hamas launched its devastating attack on southern Israel on 7 October, killing 1,140 people and taking up to 250 hostage. Fears of regional escalation as Israel warns of ‘multi-front’ war Read more\n26 Dec 2023 23.21 CET The US has downed 12 drones, three anti-ship ballistic missiles and two land attack cruise missiles fired by the Houthis in the Southern Red Sea, according to US Central Command on X. U.S. assets, to include the USS LABOON (DDG 58) and F/A-18 Super Hornets from the Eisenhower Carrier Strike Group, shot down twelve one-way attack drones, three anti-ship ballistic missiles, and two land attack cruise missiles in the Southern Red Sea that were fired by the… pic.twitter.com/vRQ5e6Au6d — U.S. Central Command (@CENTCOM) December 26, 2023 The post came after the Yemeni rebel group said it carried out drone attacks targeting the Israeli port city of Eilat, as well as a commercial vessel in the Red Sea earlier in the day.\nUpdated at 23.53 CET\n26 Dec 2023 22.26 CET France is “gravely concerned” by Israel’s announcement that it will intensify and prolong fighting against Hamas in Gaza, the French foreign ministry has said. A statement from the ministry said France “strongly reiterates its call for an immediate truce leading to a ceasefire”, while condemning the “systematic bombing that has again left many civilian victims in recent days”.\n26 Dec 2023 22.09 CET Israel Defense Forces (IDF) said nine of its soldiers were wounded in an anti-tank missile fired by Lebanon’s Hezbollah group on Tuesday. The IDF soldiers were evacuating a civilian who had been injured in an earlier Hezbollah attack on a church, the army said. One of the soldiers was in a “serious condition”, it said. The Israeli army said that in the earlier attack, the missile had hit a Greek Orthodox church in Iqrit, referring to an abandoned Palestinian Christian village whose inhabitants were forced to leave during the 1948 war and creation of Israel, AFP reported. Israeli military spokesperson Daniel Hagari accused Hezbollah of “committing war crimes by indiscriminately attacking places of worship”.\nUpdated at 22.32 CET\n26 Dec 2023 21.40 CET The Emir of Qatar, sheikh Tamim bin Hamad al-Thani, held a phone call with the US president, Joe Biden, on Tuesday to discuss the latest developments in Gaza, according to Qatari state media. The pair also spoke about current joint mediation efforts for calming the situation in Gaza to reach a permanent ceasefire, according to a report from the Qatari state news agency.\nUpdated at 22.43 CET\n26 Dec 2023 21.20 CET Israel's military says it has expanded Gaza offensive into refugee camps The Israeli military said it has expanded its ground offensive in the Gaza Strip to the densely populated urban refugee camps in the central part of the Palestinian territory. As we reported earlier, people in central Gaza described a night of shelling and airstrikes shaking the Nuseirat, Maghazi and Bureij refugee camps on Tuesday. The camps are crowded with Palestinians whose families fled during the 1948 war as well as with civilians who recently fled northern Gaza in the early stages of Israel’s ground offensive. “We have expanded the fighting to an area known as the central camps,” Israel’s military spokesperson, Daniel Hagari, told a news conference today, Associated Press reported. He added: We will continue to adapt the operation, the method and the composition of the forces according to the operational need.\nUpdated at 21.24 CET\n26 Dec 2023 21.01 CET Israel’s national security minister, Itamar Ben-Gvir, has said he will not extend the term of the country’s Prison Service commissioner, Katy Perry. In a statement from his ministry, Ben-Gvir said he did not have enough faith in Perry to allow her to continue in her current position, the Jerusalem Post reported. The Israeli minister also accused Perry of having conducted negotiations with imprisoned Hamas militants on the terms of their incarceration, the Times of Israel reported. In response, a statement from Perry said: An unsurprising decision by an irresponsible minister that combines unfounded and baseless claims, a detachment from reality and childishness that show his lack of understanding of the prisons service. Israeli war cabinet minister Benny Gantz’s National Unity party also responded to the announcement, warning that replacing senior officials “at this time harms the functioning of the country during a time of war and is not right”.\nUpdated at 21.05 CET", "source_domain": "www.theguardian.com", "text": null, "title": "UN names Netherlands’ Sigrid Kaag aid coordinator for Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/26/israel-gaza-war-live-updates-hamas-palestinians-deaths-idf-strikes-un"}