{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:21:42", "date_modify": "None", "date_publish": "2023-12-27 18:23:26", "description": "About 85% of Gaza’s population have been forced to leave their homes and are faced with fresh horrors each day", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F27%2Fmiserable-in-every-sense-displaced-families-in-gaza-face-daily-ordeal.json", "image_url": "https://i.guim.co.uk/img/media/72ecf0eb4f7b08bcad75b2ef2b9a4cdf62fd7ded/0_223_6123_3675/master/6123.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=973396565c5b0da3350e268ca1626a2f", "language": "en", "localpath": null, "maintext": "The residents of Sheikh Radwan, a district in the north of Gaza City, are no strangers to warfare. Born and raised in the neighbourhood, Emad Jameel’s entire life has been defined by fighting. His childhood was dominated by the first and second intifada, or Palestinian uprisings, and since Hamas seized control of Gaza in 2007, leading Israel to impose a near-total air, land and sea blockade, Sheikh Radwan has been repeatedly hit by airstrikes both during and outside wartime.\nThrough it all, however, Jameel, now 31, found solace in friends and family. But he never dreamed of a war like the one Gaza is suffering now, and he never imagined himself homeless, cast adrift from his community and ferrying his children from place to place across the besieged territory in search of ever-elusive safety.\nOn Wednesday, the local health ministry in Gaza said that 21,000 people had now been killed, with thousands more feared to be lying under rubble, and more than 55,000 people injured, as the territory continued to come under heavy bombardment.\n00:01:01 Drone footage shows latest widespread destruction in northern Gaza – video\n“Why are we subjected to such torture? Is it because we live in a cursed place, or is it because the whole world enjoys watching our suffering?” the clothing shop assistant said by phone.\n“All I want is to return to my home, even if it is in ruins. I want to live in a tent there and not in unfamiliar places with strangers.”\nTwo weeks after the newest war in Gaza erupted after the slaughter of 1,140 Israelis and kidnap of 250 more in an unprecedented attack by Hamas, Jameel, his wife and three children couldn’t endure the relentless Israeli airstrikes any more. They put some food, clothes and important papers into rucksacks and followed the Israel Defense Forces (IDF) evacuation order to move south of Gaza City, below the river that bifurcates the 141 sq mile (365 sq km) ribbon of land, which the military said would be safer.\nView image in fullscreen Palestinians receive portions of food at a makeshift charity kitchen in Rafah on 25 December. Photograph: Ismael Mohamad/UPI/Rex/Shutterstock\nAfter walking for a day, they arrived in Madinat al-Zahra, just north of the Gaza River, staying with distant relatives, but after Israeli troops began a ground operation encircling Gaza City, the entire group realised they needed to flee again. Next was the Bureij refugee camp, which the IDF had said was an evacuation zone, where the group of 17 crowded into a school with hundreds of others.\nOver the next few weeks, clean water, food and basic supplies grew scarce, and fierce fighting continued.\nLast week, Israeli soldiers began a new push into Bureij and several other areas in central Gaza backed by airstrikes and artillery, inflicting some of the worst bloodshed so far in the 12-week-old war. The IDF asked the thousands of people sheltering in the camp to move again, this time to the nearby town of Deir al-Balah.\nNow, the family of five are living in two tents they were given by an aid organisation in wet, wintry conditions, and Jameel is trying to secure a place for them to stay in Rafah, on Gaza’s border with Egypt, before they are inevitably forced to move again.\nOur existence is marked by humiliation, standing in queues, and asking people for food and drink Emad Jameel\n“Life is miserable in every sense of the word. We are unsure what to do or where to go. Our existence is marked by humiliation, standing in queues, and asking people for food and drink.”\nJameel and his family are far from alone in their ordeal. About 85% of Gaza’s 2.3 million people have been displaced from their homes – many, like Jameel, multiple times - and the UN’s latest food security assessment estimates that one in four people in Gaza are starving.\nFresh horrors surface each day: on Wednesday, Israel returned the bodies of 80 men that officials said had been collected from northern Gaza in order to check that no Israeli hostages were among them. They were reburied in blue body bags in a mass grave in Rafah’s cemetery, and the religious affairs ministry said photos of the corpses had been taken in the hopes that families could identify them at a later date.\nAnd a second verified video has emerged showing dozens of men in Gaza – among them at least three boys – stripped to their underwear and kneeling with their hands tied behind their backs as they are held captive by Israeli soldiers at the Yarmouk Stadium in Gaza City. An earlier video of the same scene, believed to date from mid-December, also showed elderly men. The IDF has said that detainees found to have no links to militant activity are released “when it’s possible to do so”. Rights groups have said that the footage is evidence of war crimes.\nView image in fullscreen Palestinians in Deir al-Balah. Photograph: Anadolu/Getty Images\nBut the violence shows no sign of ebbing, despite international pressure on Israel to scale back its operations to focus on Hamas’s leaders. Israel’s military chief, Herzi Halevi, said on Tuesday that the war would last many more months; ceasefire talks mediated by Qatar and Egypt appear to have stalled.\n“Our lives have become a constant journey from place to place. Every place we move to becomes increasingly difficult to live in over time … We carry our belongings with us, never knowing where to go,” Jameel said.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Miserable in every sense’: displaced families in Gaza face daily ordeal", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/27/miserable-in-every-sense-displaced-families-in-gaza-face-daily-ordeal"}