{"authors": ["Stacy Liberatore", "Stacy Liberatore For Dailymail.Com"], "date_download": "2024-02-05 15:15:02", "date_modify": "None", "date_publish": "2024-01-29 21:19:30", "description": "New Jersey officials approved two contracts for offshore wind farms (stock), which a resident told DailyMail.com are the most expensive contracts signed by the states' Board of Public Utilities.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsciencetech%2Farticle-13020439%2Foffshore-wind-project-new-jersey-two-farms.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/29/20/80602355-0-image-a-19_1706560252258.jpg", "language": "en", "localpath": null, "maintext": "The companies will be paid up to $131 per MW, compared to $100 for previous\nContracts are the most expensive signed by the state's Board of Public Utilities\nNew Jersey officials have approved two giant offshore wind projects slated for energy production by 2032 - but the plans could cost residents $1 billion each year.\nThe state's Board of Public Utilities (BPU) sold the plots to Leading Light Wind and Attentive Energy Two, which are set to produce around 3,740 megawatts of electricity combined over the 20-year life of the contracts.\nMike Dean, a Monmouth County resident, told DailyMail.com that they are the most expensive contracts signed by the BPU.\nThe contractors will be paid up to $131 per megawatt in the first year, compared to the previous bids that started at $80 and went up to $100, Dean explained.\nThe announcement also follows a string of marine deaths along the New Jersey coast, which appeared to see an increase with offshore wind surveys conducted in nearby waters.\nThe state's Board of Public Utilities (BPU) sold the plots to Leading Light Wind and Attentive Energy Two, which are set to produce around 3,740 megawatts of electricity combined over the 20-year life of the contracts\n'These latest contracts are more evidence that the harms and costs of offshore wind industrialization are limitless,' said Dean.\n'Ratepayers are being asked to bear the full egregious costs for these projects in exchange for zero environmental benefits.'\n'Paving the ocean is no way to save the planet.'\nThe BPU chose the two projects due to the pair generating enough electricity to power 1.8 million homes in New Jersey an effort to replace fossil-fuel burning generators.\nLeading Light Wind said its project will create 7,500 new jobs in in the state and add $3.7 billion in economic development.\nAttentive Energy Two said its project would 'generate billions of dollars in economic activity' and deliver more than 15,000-job years.\nBPU officials estimated the two projects would also cut carbon dioxide emissions by 6.4 million tons annually.\nDailyMail.com has contacted Leading Light Wind and Attentive Energy for comment.\nNew Jersey Congressman Jeff Van Drew commented on the projects in a post shared to X.\nThe contractors will be paid up to $131 per megawatt in the first year, compared to the previous bids that started at $80 and went up to $100. The announcement also follows a string of marine deaths along the New Jersey coast, which appeared to see an increase with offshore wind surveys conducted in nearby waters\n'Offshore wind hurts our supply chain, national defense operations, the environment, the fishing industry, shore communities' tourism industry, and will cause energy rates to skyrocket,' the Republican posted.\nLeading Light Wind is set to provide 2,400 MW, while Attentive Energy Two has committed to 1,342 MW.\nAccording to the BPU, the two projects will raise the cost of electricity by 'only' $6.84 per month for a typical residential customer, $58.73 for a typical commercial customer, and $513.22 per month for a typical industrial customer, as reported by Save Jersey.\nHowever, the pricing is based on 2023 dollars and as the US faces high inflation rates, many believe the prices will be automatically increased and cost ratepayers more money in the end.\nWhile the cost per customer appears low, Save New Jersey reported that with 3.7 million residents, 538,000 commercial customers, and over 11,000 industrial accounts, that equates to nearly $1 billion a year that will be paid to the two companies for 20 years.\nThe BPU also noted that with the construction of the offshore wind farm will come many jobs - the projects are set to add 5,128 direct full-time equivalent jobs for one year during the first ten years of operation.\nAccording to the BPU, the two projects will raise the cost of electricity by 'only' $6.84 per month for a typical residential customer, $58.73 for a typical commercial customer, and $513.22 per month for a typical industrial customer\nThose jobs are set to cost $75 million each year, adding $7.5 billion more to electric bills.\nNew Jersey has long planned for offshore wind farms along the coast.\nDutch-owned Orsted was set to develop the Ocean Wind 1 and Ocean Wind 2 projects for Southern New Jersey, which would erect 98 turbines 15 miles off the coast.\nConstruction was due to start this fall and was expected to be operational in 2025, but Orsted announced cancellations for both projects last November.\nOrsted cited 'macroeconomic factors, including high inflation, rising interest rates and supply chain constraints' that led to the decision.\nIt is believed Orsted began blasting the seafloor with sonar as early as 2016 - the same time an unprecedented number of whales and dolphins began washing up on beaches, according to New Jersey Senator Mike Testa.\nAlong with the added electric bill increase, residents are concerned about seeing another mass die-off of marine life along their beaches. The red markers indicated dead humpback whales from 2022 through 2023\nSonar is used to map the seafloor for suitable windmill locations, but many believe the loud sound is disrupting animals' movements, sending them into boats or onto the shore\nBut now residents are again faced with more wind turbines to be erected along their beaches.\nHowever, unlike Orsted who was going 15 miles off the coast, the two new contractors plan for no closer than 40 miles inland.\nREAD MORE: Project of nearly 150 offshore wind turbines set for New York is halted due to 'inflation' The agreement, signed in 2022, stated the companies would sell a megawatt-hour for $107.50, but due to 'unforeseeable economic forces, BP and Equinor requested a price increase to $177.84/MWh. Advertisement\nThe distance has been an issue with New Jerseyans who said the towering steel turbines would obstruct scenes of the shore.\nAlong with the added electric bill increase, residents are concerned about seeing another mass die-off of marine life along their beaches.\nToms River resident Trisha DeVoe, a conservation biologist and activist for Save our Whales, told DailyMail.com in a previous interview: 'Over the previous 10-year period, from 2013 to2022, the average number of humpback whales to strand in New Jersey yearly was 2.6.\n'In the 12 months from December 22 to the present, there were 11 humpback whale strandings in New Jersey, more than four times the previous 10-year average.\n'We hunted whales to near extinction, and scientists estimate that we only have about anywhere from 25 to 33 percent of the historical numbers before the whaling industry.'\nDeVoe did not associate the deaths with wind farming activities, but she and many other residents of the Garden State are calling for a stop to the projects until independent research can determine what is killing the marine life.\nSonar is used to map the seafloor for suitable windmill locations, but many believe the loud sound is disrupting animals' movements, sending them into boats or onto the shore.\nIn 2022, a group of 14 beaked whales fell foul of mid-frequency Navy sonar activity and were beached.\nTwo years later, 34 whales beached along North Carolina's Outer Banks while the military conducted offshore sonar training.\nHowever, the US Department of Environmental Protection (DEP) reported: 'As of August 2023, no offshore wind-related construction activities have taken place in waters off the New Jersey coast.\n'DEP is aware of no credible evidence that offshore wind-related survey activities could cause whale mortality.\n'While DEP has no reason to conclude that whale mortality is attributable to offshore wind-related activities, DEP will continue to monitor.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Offshore wind projects set to cost $1 BILLION a year for New Jersey residents - as state approves two massive farms that some claim kill marine life", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sciencetech/article-13020439/offshore-wind-project-new-jersey-two-farms.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}