{"authors": [], "date_download": "2024-02-05 15:21:49", "date_modify": "None", "date_publish": "2023-12-27 14:04:25", "description": "Three US soldiers were injured in a drone attack in northern Iraq, which Iranian-backed Kataib Hezbollah group claimed credit for", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F27%2Fbiden-airstrikes-iran-militias-us-troops-wounded.json", "image_url": "https://i.guim.co.uk/img/media/ae2f98cb7f11ba34f88ab5c824ad70ced21257ba/0_348_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ed262004d3086d5b518711efefb0e045", "language": "en", "localpath": null, "maintext": "Joe Biden ordered the US military to carry out retaliatory airstrikes against Iranian-backed militia groups after three US service members were injured in a drone attack in northern Iraq.\nA national security council spokesperson, Adrienne Watson, said one of the troops suffered critical injuries in the attack that occurred earlier on Monday. The Iranian-backed militia Kataib Hezbollah and affiliated groups, under an umbrella of Iranian-backed militants, claimed credit for the attack that utilized a one-way attack drone.\nIraqi officials said that US strikes targeting militia sites early on Tuesday killed one militant and wounded 18. They came at a time of heightened fears of a regional spillover of the Israel-Hamas war.\nIran announced on Monday that an Israeli strike on the outskirts of the Syrian capital, Damascus, killed one of its top generals, Seyed Razi Mousavi, who had been a close companion of Gen Qassem Suleimani, the former head of Iran’s elite Quds force. Suleimani was slain in a US drone strike in Iraq in January 2020.\nIranian officials vowed revenge for the killing of Mousavi, but did not immediately launch a retaliatory strike. The militia attack on Monday in northern Iraq was launched before the strike in Syria that killed Mousavi.\nBiden, who was spending Christmas at the presidential retreat at Camp David, Maryland, was alerted to the attack by the White House national security adviser, Jake Sullivan, shortly after it occurred on Monday and ordered the Pentagon and his top national security aides to prepare response options to the attack on an airbase used by American troops in Irbil.\nSullivan consulted with the US defense secretary, Lloyd Austin. Biden’s deputy national security adviser, Jon Finer, was with the president at Camp David and convened top aides to review options, according to a US official who was not authorized to comment publicly and requested anonymity.\nWithin hours, Biden convened his national security team for a call in which Austin and Gen CQ Brown, chair of the joint chiefs of staff, briefed Biden on the response options. Biden opted to target three locations used by Kataib Hezbollah and affiliated groups, the official said.\nThe US strikes were carried out at about 4.45am on Tuesday in Iraq, less than 13 hours after the US personnel were attacked. According to US Central Command, the retaliatory strikes on the three sites “destroyed the targeted facilities and likely killed a number of Kataib Hezbollah militants”.\n“The president places no higher priority than the protection of American personnel serving in harm’s way,” Watson said. “The United States will act at a time and in a manner of our choosing should these attacks continue.”\nThe latest attack on US troops follows months of escalating threats and actions against American forces in the region since the 7 October Hamas attack on Israel that sparked the devastating war in Gaza.\nThe dangerous back-and-forth strikes have escalated since Iranian-backed militant groups under the umbrella organization called the Islamic Resistance in Iraq and Syria began striking US facilities on 17 October, the date that a blast at a hospital in Gaza killed hundreds. Iranian-backed militias have carried out more than 100 attacks on US bases in Iraq and Syria since the start of the Israel-Hamas war more than two months ago.\nIn November, US fighter jets struck a Kataib Hezbollah operations center and command and control node, after a short-range ballistic missile attack on US forces at al-Assad airbase in western Iraq. Iranian-backed militias also carried out a drone attack at the same airbase in October, causing minor injuries.\nThe US has also blamed Iran, which has funded and trained the Hamas group, for attacks by Yemen’s Houthi militants against commercial and military vessels through a critical shipping choke point in the Red Sea.\nskip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThe Biden administration has sought to prevent the Israel-Hamas war from spiraling into a wider regional conflict that either opens up new fronts of Israeli fighting or draws the US in directly. The administration’s measured response – where not every attempt on American troops has been met with a counterattack – has drawn criticism from Republicans.\nThe US has thousands of troops in Iraq training Iraqi forces and combating remnants of the Islamic State group, and hundreds in Syria, mostly on the counter-IS mission. They have come under dozens of attacks, though as yet none fatal, since the war began on 7 October, with the US attributing responsibility to Iran-backed groups.\n“While we do not seek to escalate conflict in the region, we are committed and fully prepared to take further necessary measures to protect our people and our facilities,” Austin said in a statement.\nThe clashes put the government of the Iraqi prime minister, Mohammed Shia al-Sudani, in a delicate position. He came to power in 2022 with the backing of a coalition of Iranian-backed parties, some of which are associated with the same militias launching the attacks on US bases.\nA group of Iranian-backed militias known as the Popular Mobilization Forces were key in the fight against Islamic State militants after the extremist group overran much of Iraq in 2014. The PMF is officially under the command of the Iraqi army, but in practice the militias operate independently.\nIn a statement on Tuesday, Sudani condemned both the militia attack in Irbil and the US response.\nAttacks on “foreign diplomatic mission headquarters and sites hosting military advisers from friendly nations … infringe upon Iraq’s sovereignty and are deemed unacceptable under any circumstances,” the statement said.\nHowever, it added that that the retaliatory strikes by the US on “Iraqi military sites” – referring to the militia – “constitute a clear hostile act”. Sudani said some of those injured in the strikes were civilians.", "source_domain": "www.theguardian.com", "text": null, "title": "Biden orders airstrikes against Iran-backed militias after US troops wounded in Iraq", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/27/biden-airstrikes-iran-militias-us-troops-wounded"}