{"authors": ["Andrew Lawrence"], "date_download": "2024-02-05 15:21:50", "date_modify": "None", "date_publish": "2023-12-27 17:00:11", "description": "The controversy over Hasan Minhaj’s onstage storytelling was a sign of the shifting demands placed on standup comics", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F27%2Fstandup-comedy-demands-hasan-minhaj-truth-lying.json", "image_url": "https://i.guim.co.uk/img/media/31fe7a6ad1820910f881ac3c280c4370230bf9d3/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e60fcc98cec8bf6e7b846acd6083fce1", "language": "en", "localpath": null, "maintext": "No one gets into standup comedy expecting a routine factcheck. But that’s what happened when a September profile of Hasan Minhaj in the New Yorker called out the former host of the Netflix series Patriot Act for misrepresenting his truth in two Netflix standup specials. In one, Minhaj described a white FBI informant infiltrating his mosque and an anthrax scare involving his young daughter (neither happened as Minhaj described them, the magazine found). In another, he recalled a white high school crush who jilted him on prom night for seemingly no other reason than his being of Indian descent (she denied it went down like that). The magazine said Minhaj’s stories “blur the lines between entertainment and opinion journalism”, triggering an intense public debate about whether the comedian had stooped to claiming race-based victimhood to advance his career. Bill Maher likened Minhaj, a peer, to Jussie Smollett.\nIn a 21-minute video rebuttal, Minhaj made a case for punching up his biography while poking holes in the New Yorker’s hallowed vetting process. “With everything that’s happening in the world,” Minhaj intoned, “I’m aware even talking about this now feels so trivial. But being accused of faking racism is not trivial. It is very serious, and it demands an explanation.”\nHis staunch defense did the job of rallying his fans back onto his side, but not in time to undo the damage. Minhaj, a clear frontrunner to replace Trevor Noah as The Daily Show’s permanent host, was reportedly dropped from contention in what looked for all the world like punishment for using creative license in a creative medium. “It’s so bizarre to me,” says the Last Comic Standing finalist Laurie Kilmartin. “Because when you look at how modern standup started, it was a thing that happened in between strippers. It’s gutter art. We’re not trying to win a Pulitzer prize.”\nIt used to be that comedians were the ones holding the powerful and persuasive to account, at no time more so than when Jon Stewart factchecked the Bush administration and its enablers in the mainstream media from behind The Daily Show desk. But as conventional wisdom of the past has given way to the age of bespoke truths, The Daily Show and other comedy institutions are no longer society’s only funny factcheckers. Ever since standup comedy, a longtime fixture of clubs and late-night TV, achieved mainstream ubiquity, individual comics are doing that job too. And yet standup comedians balk at the prospect of that sobering treatment being turned on their own work.\nView image in fullscreen Hasan Minhaj performs at the 13th Annual Stand Up for Heroes Benefit in New York, November 2019. Photograph: Stephen Lovekin/Shutterstock\nIn April 2023, Selective Outrage – Chris Rock’s hotly anticipated, post-Oscars clapback – became Netflix’s highest rated comedy special, with more than 36m hours of total engagement. Certainly, more people streamed that special than Jada Pinkett Smith’s docudrama on Cleopatra, released the same month. Fact-based film and TV projects have themselves been checked against the official record since time immemorial; Pinkett Smith’s decision to cast a Black actor as Cleopatra raised hackles in Egypt, with academics arguing the queen probably looked more like Elizabeth Taylor. Even music lyrics are taken as articles of fact that can potentially be used in court, as we’re seeing with Young Thug’s racketeering trial in Georgia. There’s little doubt that much of the curiosity for Rock’s special stemmed from a factchecking impulse to square his first-hand experience with third-hand perspectives of the slap seen ’round the world.\nWhen the world was turned upside down by Covid and the racial reckoning, Dave Chappelle emerged as the man who could make sense of it all. After the 2020 Netflix special 8:46, named for the time it took for Derek Chauvin to kill George Floyd, Chappelle was widely celebrated for putting laughs aside and speaking to the heart of the tragedy. It was only after pivoting to making transphobic jokes in 2021’s The Closer special – a theme Chappelle returned to again on stage this year after promising to back off (and figures to touch on again in a year-end special) – that the top comic has been taken more seriously as a spreader of misinformation.\n“Chappelle is by far the lying-est comedian,” said Jesse David Fox, a comedy journalist at Vulture, citing the 2017 special The Age of Spin. In it, Chappelle argues for not throwing away the “valuable legacy” Bill Cosby left in spite of his history of alleged sexual abuses and, by way of example, notes how Cosby paid for the public address (PA) system for the 1963 March on Washington – a fact that’s easily disproved. “Because he’s raised so much gravitas,” says Fox of Chapelle, “he just gets away with it.”\nThat gravitas comes from the new “expectation for comedians [to be] up there with public intellectual people”, says Fox, who also wrote 2023’s How Comedy Conquered Culture – and the Magic That Makes It Work. “They’re not just held to the same standard as a famous director. They’re held to the same standard as [the ABC evening news anchor] David Muir.”\nIn 2023, there was little circumventing the demand for truth in comedy. A year after raising hackles for featuring Chappelle at an Ohio show, John Mulaney drew scrutiny again for a bit in his Baby J special about hawking his $12,000 Rolex for half the price to buy drugs – a story Vulture went to lengths to confirm. In an interview with the Hollywood Reporter, Mulaney copped to omitting the saddest part of that anecdote: that he accidentally dumped $3,000 of the $6,000 he made from selling the Rolex in the trash. “I didn’t want to tell that story of, you know, ‘And there I was, selling a watch I had just bought, and I felt so small,’” he said. “I didn’t want to have that tone, you know? I really wanted to present these stories almost as if I was proud of them.”\nView image in fullscreen Dave Chappelle performs at Madison Square Garden in August. Photograph: Eduardo Muñoz/Reuters\nLike Minhaj, Mulaney builds connection with his audience through “emotional truths”, as Minhaj described 70% of his comedic style to the New Yorker (the other 30% he called “hyperbole, exaggeration, fiction”). But the veteran standup Kevin McCaffrey cautions: “There’s a difference in lying for the laugh and lying for the clap.”\nWhere Mulaney aims to please, this year’s most controversial young comic, Matt Rife (you may know him from TikTok – or his cheekbones), takes factchecks as fighting words. In his 2023 Netflix special Natural Selection, Rife needled women who turn to astrology for help choosing mates. “Just because Jupiter has a ring and you don’t doesn’t mean you should run to the planets for magical relationship advice,” he cracked. The influencer Bunny Hedaya reacted to the clip by posting a video of her six-year-old son offering a humble correction: “Actually, it’s Saturn that has the rings.”\nInstead of taking pushback good-naturedly, the 28-year-old Wild ’n Out regular allegedly unloaded on the kid in the comments, slagging off his mother for buying “presents with the money she makes on OnlyFans”. (Hedaya does not appear to have a presence on that platform, whereas Rife has an account and a debut special named Only Fans.) For too many observers, the exchange seemed about on par for a comic who had apologized for a domestic violence joke in his special by directing the offended to a website for special needs helmets, a gambit that Rife’s bedrock of women fans heard as a breakup line. Lost in the exchange between Rife and Hedaya’s son was the fact that both were right: Saturn and Jupiter each have rings. “The star comedians are just the most amazing level of sensitive babies now,” McCaffrey said.\nThis wasn’t just a year that saw Rob Schneider rail against wokeism in an “unfiltered” comedy special to a friendly Fox Nation crowd. It was the year Joe Rogan opened an “anti-cancel culture” comedy club in Austin, Texas, expressly to remain unchecked. “I’m drunk and high on mushrooms,” he enthused on opening night. “You can’t fire me from my own club, bitch!”\nIn one clip from his dreaded Christmas Day special for Netflix, Armageddon, Ricky Gervais does the extra work to delineate fact from fiction in a sick punchline that has him calling Make-a-Wish kids “retarded”.\n“These are all jokes,” he disclaims. “I don’t even use that word in real life, the r-word.” It goes to show how swiftly standup comedy has evolved from resenting the masses for not taking a joke to resenting them for taking a joke as gospel.\nMinhaj’s work makes it especially tough on audiences to suspend disbelief. Where a more traditional standup might paint a picture in a listener’s mind with little more than a mic in hand, Minhaj drew on compelling visual aids. The FBI informant bit was underscored by Al Jazeera footage of an actual informant. In interviews with a New Yorker staff writer, Clare Malone, Minhaj admitted his story never happened – to which some say, so what?\nView image in fullscreen Matt Rife on The Kelly Clarkson Show this year. Photograph: NBC/Weiss Eubanks/NBCUniversal/Getty Images\n“That he experienced racism and Islamophobia matters more than whether it happened exactly as he said it,” said Kilmartin, who judges her peers far more harshly for being actual hypocrites. “When Louis CK was positioning himself as the ultimate cool feminist when in real life he wasn’t, that’s when you lose your audience. You can’t be that different from your stage persona. But at the same time, if somebody’s talking about a perceived experience, you have to give them some latitude. If you’re trying to get laughs from a male audience talking about sexism or a white audience talking about racism, you have to change things a bit or they won’t participate. They’ll get defensive.”\nFor the prom bit, Minhaj deployed immersive staging to set the scene, including a screengrab of what looks like the blurred-out faces of his would-be prom date with her now husband – “Indian as fuck,” he vented, pointing out the irony. Minhaj also closely collaborated with factcheckers on Patriot Act, an extra step that made his material seem that much more airtight. Just as affecting was Minhaj’s use of similarly high production value in his rebuttal video. The whole spiel had the feel of a Daily Show production, with Minhaj at a desk as a series of supposedly exculpatory graphics and audio recordings flashed over his shoulder. (The New Yorker stands by its story.)\nBut in the end he would be forced to admit that much of his standup was embellished for dramatic effect. (He later revealed that actors played the real people shown in the onstage screengrab.) Minhaj told the magazine about his routines: “The emotional truth is first. The factual truth is secondary.”\n“It does seem like that interview with him was done in … I don’t want to say in bad faith,” McCaffrey said. “But it does feel like there was an agenda, for sure. I think Hasan is paying a price for being a person that people believed did give a shit about what was real.”\nThat a magazine factcheck would ultimately cost Minhaj a job doing the fake news is an irony that will surely make its way into a future Minhaj Netflix special. He was already drawing on the experience during a recent appearance at New York’s Beacon Theater. After relaying a story about a girl cheating on him in high school, Minhaj warned the audience: “Don’t factcheck me.”\n“I had to go head-to-head with one of the most dangerous organizations in the world,” he said, ruling out the US military or the Israeli Defense Forces. “I am talking about a white woman with a keyboard.” But in the new era of the standup intellectual, many audiences will see Minhaj’s warning less as a challenge than as a call of duty.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Lying for the laugh’: should comedians tell us the truth?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/27/standup-comedy-demands-hasan-minhaj-truth-lying"}