{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:21:51", "date_modify": "None", "date_publish": "2023-12-27 18:49:53", "description": "Security officials keen to arrange meeting as ‘time running out’, according to reports", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F27%2Fbenjamin-netanyahu-israel-refuses-to-discuss-postwar-plan-for-gaza-strip.json", "image_url": "https://i.guim.co.uk/img/media/288e7b9f82a789eb49cc2c5bfe6d715e3200f23b/180_167_3796_2278/master/3796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b60ead43d59be780bdc835b4babd761c", "language": "en", "localpath": null, "maintext": "The Israeli military expanded its ground offensive in the Gaza Strip to the densely populated urban refugee camps in the central part of the territory as the prime minister, Benjamin Netanyahu, was reported to have refused requests from security officials to make plans for control of Gaza after the war with Hamas ends.\nOver the last few days, three requests to the prime minister’s office were conveyed on behalf of the directors of the Mossad, the Shin Bet, the Israel Defense Forces (IDF) chief of staff and the defence ministry to arrange a meeting on decisions relating to “the day after” Israel declares it has achieved its goals against the Palestinian militant group in control of the Gaza Strip, Israel’s Channel 12 reported on Tuesday night.\nAll those requests were refused, the network said. “Time is running out and decisions need to be made already about how to act with regard to all the relevant actors inside and outside the Gaza Strip. The Americans want explanations,” it quoted an unnamed security official as saying.\nTuesday’s report comes amid allegations in the Israeli media that Netanyahu and his defence minister, Yoav Gallant, have also refused to discuss the long-expected transition from the current “high intensity” stage of fighting to a new phrase focused on the more precise targeting of Hamas’s leaders, as well as a report that Netanyahu did not allow Gallant to hold detailed discussions with the Mossad about a possible hostage release deal.\nNetanyahu may wish to postpone such discussions to protect his position as prime minister: his wartime unity government will disband after the conflict ends, and any solution for Gaza that involves Palestinian actors, such as the return of the West Bank’s Palestinian Authority, threatens the stability of his far-right coalition government.\nA spokesperson for the prime minister’s office said a date for a cabinet discussion on “the day after” had been set a month ago and would take place in the coming days.\nIn his first interview since the hostilities broke out, the Palestinian Authority president, Mahmoud Abbas, said on Tuesday night that the war was “beyond a catastrophe”, accusing Netanyahu of planning “to get rid of the Palestinians”.\nOn the ground in Gaza, Israel has broadened its offensive against Hamas, expanding into several overcrowded refugee camps near the central town of Deir al-Balah, as well as launching heavy airstrikes on the southern towns of Khan Younis and Rafah – all areas the military had told Palestinians to seek shelter earlier in the war.\nOn Wednesday, thousands of Palestinian families who fled Bureij camp, heavily targeted overnight, set up tents in the streets of Deir al-Balah.\n“It was a night of hell. We haven’t seen such bombing since the start of the war,” said Rami Abu Mosab, speaking from Bureij, where he has been sheltering since fleeing his home in northern Gaza.\nHe said warplanes flew overhead, and gunfire and explosions echoed from the eastern edge of the camp. A home near his shelter was hit, but no one was able to reach the area, he said. The health authority in the Hamas-run strip said that more than 200 people had been killed in the last 24 hours.\nHouse-to-house fighting has also been reported in the north of Gaza, despite comments from the IDF chief of staff over the weekend that the military had largely achieved operational control above the Gaza River.\nSince Christmas Eve, the besieged Palestinian territory has suffered some of the deadliest days of the 12-week-old conflict to date, sparked by Hamas’s devastating attack on southern Israel on 7 October in which militants killed 1,140 people and took up to 250 hostage.\nIsrael’s retaliatory war on the Hamas-controlled Gaza Strip has already become one of the most destructive conflicts of the 21st century, with estimates suggesting more than 20,900 people have been killed, 55,000 injured, and 85% of the Palestinian territory’s 2.3 million people forced to flee their homes.\nDespite rising international outcry over the humanitarian disaster, including growing criticism from the US, Israel’s most important ally, Netanyahu has said that Israel will push on until “complete victory” over Hamas.\n00:01:01 Drone footage shows latest widespread destruction in northern Gaza – video\nRon Dermer, a member of Israel’s war cabinet, is expected to meet with US officials in Washington on Wednesday. Divisions within the Biden administration over Israel policy have been growing, with some officials saying the US has underestimated the scale of disillusionment in the global south over perceived hypocrisy in calling out Russian war crimes in Ukraine, but finding a multitude of reasons to justify the large-scale killings of Palestinians in Gaza.\nAlso on Wednesday, the UN appointed Sigrid Kaag, the Netherlands’ outgoing finance minister, as aid coordinator to the Palestinian territory, following last week’s watered-down security council resolution, which called for aid to be delivered to Gaza “at scale”.\nAbout 200 trucks a day are currently entering Gaza, but aid agencies say this is a fraction of what is needed. Before the latest conflict broke out, about 500 goods and aid trucks entered the territory every day.\nThe war in Gaza is also showing new signs of dangerous regional escalation, even as ceasefire talks mediated by Egypt and Qatar appear to have stalled.\nIn the occupied West Bank, Israeli forces killed at least six Palestinians during an overnight raid in the refugee neighbourhood of Nur Shams, according to the Palestinian health ministry, bringing the total number of casualties in the territory to 300.\nIsrael and the powerful Iran-backed Lebanese group Hezbollah have traded near-daily volleys of missiles, airstrikes and shelling across the frontier since 7 October: an Israeli strike on a house overnight killed a Hezbollah fighter and two relatives, local officials and state media said.\nBehind the scenes, the US is leading intense negotiations to try to de-escalate the hostilities on the Blue Line that separates the two countries, where the risk of miscalculation setting off a regional war drawing in Iran and its proxies in Lebanon, Syria, Iraq and Yemen is highest.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel widens offensive in central Gaza as Netanyahu refuses to discuss postwar plan", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/27/benjamin-netanyahu-israel-refuses-to-discuss-postwar-plan-for-gaza-strip"}