{"authors": ["James Callery"], "date_download": "2024-02-05 15:21:53", "date_modify": "None", "date_publish": "2023-12-27 10:04:55", "description": "Palestinian President Mahmoud Abbas said the was unprecedented in the history of the Palestinian people. He called it a 'grave crime ' against his people.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12903315%2FPalestines-president-says-Gaza-unrecognisable-blames-prolonging-war-Israel-says-conflict-months-war-annihilation.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/27/10/79363939-0-image-m-29_1703671346299.jpg", "language": "en", "localpath": null, "maintext": "Palestine's president says that Gaza is unrecognisable due to the damage sustained during the Israeli offensive and has blamed the US for prolonging the war.\nThe assault has seen at least 241 people killed over the last 24 hours, as the war rages into its third month.\nPalestinian president Mahmoud Abbas described the Gaza Strip conflict as 'beyond a war of annihilation', adding that it was unprecedented in the history of the Palestinian people.\nIsrael's army chief Herzi Halevi said the war would continue for 'many more months' so that Israel's 'achievements are preserved for a long time'.\nOn an Egyptian TV channel in his first interview since the start of the war, Abbas said that the West Bank could cave in at any time.\nThe shrouded bodies of Palestinians killed in nothern Gaza, which were taken and later released by Israel, are buried in a mass grave in Rafah, on the southern Gaza Strip, on December 26, 2023\nThe destruction at the Khalifa Bin Zayed School following Israeli attacks, in Beit Lahia, Gaza, on December 26, 2023\nInjured Palestinian people are taken to a hospital after the Israeli attacks on a building in Khan Yunis, Gaza, on December 26, 2023\nHe accused Washington of lengthening the war by vetoing UN draft resolutions aimed at securing a ceasefire.\nAbbas has called the war a 'grave crime' against his people.\nIsrael says it struck more than 100 sites yesterday, amid reports of imminent ground operations in central Gaza.\nLoud blasts could be heard from the Gaza Strip across the perimeter with Israel in the early hours of Wednesday.\nSix Palestinians died in an overnight Israeli drone strike in the Nur Shams refugee camp in Tulkarem in the West Bank, Palestinian medical sources said.\nGaza's health ministry said 382 people had sustained injuries over the same 24-hour period.\nFootage released from Gaza City yesterday appears to show IDF soldiers rounding up men stripped down to their underwear.\nPalestinian President Mahmoud Abbas has described the Gaza Strip conflict as 'beyond a catastrophe'\nPalestinian girls search the rubble of a building following Israeli bombardment in Rafah in the southern Gaza Strip, on December 26, 2023\nPalestinians injured in Israeli attacks are brought to Al Aqsa Martyrs Hospital for medical treatment as the attacks continue in Deir al Balah, Gaza, on December 24, 2023\nThe video shows several men standing in the middle of a stadium in front of armed soldiers.\nSeveral men are later shown sitting on the grass with their hands behind their backs as others are lined up with their hands raised in front of troops.\nMore than 20,900 Palestinians, two-thirds of them women and children, have been killed since the start of the war, according to the Health Ministry in Hamas-run Gaza, which doesn't differentiate between civilians and combatants among the dead.\nAbout 1,200 people were killed after Hamas raided southern Israel on October 7, with around 240 people taken hostage. Israel says it aims to free the more than 100 hostages who remain in captivity in Gaza.\nLieutenant General Halevi, chief of staff of the Israel Defense Forces (IDF), told a news conference: 'There are no shortcuts when it comes to thoroughly dismantling a terrorist organisation except being stubborn and determined in the fighting.'\n'There are no magic solutions,' he added.\nA plume smoke erupts over the northern Gaza Strip during Israeli bombardment from southern Israel on December 27, 2023 amid continuing battles between Israel and the Palestinian terrorist group Hamas\nHe promised to arrest or eliminate the Hamas leadership even if it would take time to do so.\nHalevi also noted that the IDF is close to taking apart all of the Hamas battalions in northern Gaza.\nIsraeli and Arab media say that Egypt has put forward a ceasefire plan.\nThis would see the phased release of all Israeli hostages and an undetermined number of Palestinian prisoners held in Israeli jails, culminating in the suspension of Israel's offensive, according to reports.\nDozens of hostages were released from Gaza in exchange for Palestinian prisoners in a previous temporary truce deal negotiated by Qatar.\nBut so far both sides have defied calls for a lasting ceasefire.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Palestine's president says Gaza is unrecognisable and blames US for prolonging war as Israel says the conflict could last 'many months': 'A war beyond annihilation'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12903315/Palestines-president-says-Gaza-unrecognisable-blames-prolonging-war-Israel-says-conflict-months-war-annihilation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}