{"authors": [], "date_download": "2024-02-05 15:21:54", "date_modify": "None", "date_publish": "2023-12-27 22:44:49", "description": "The U.S. is announcing what officials say could be the final package of military aid to Ukraine unless Congress approves supplemental funding legislation that is stalled on Capitol Hill", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-congress-pentagon-washington-b2470188.html.json", "image_url": "https://static.independent.co.uk/2023/12/27/22/Russia_Ukraine_War_90888.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. on Wednesday announced what officials say could be the final package of military aid to Ukraine unless Congress approves supplemental funding legislation that is stalled on Capitol Hill.\nThe weapons, worth up to $250 million, include an array of air munitions and other missiles, artillery, anti-armor systems, ammunition, demolition and medical equipment and parts. The aid, provided through the Presidential Drawdown Authority, will be pulled from Pentagon stockpiles.\nIn a statement, Lt. Col. Garron Garn, a Pentagon spokesman said there is no more funding to replace the weapons taken from department stocks. And the Ukraine Security Assistance Initiative, which provides long-term funding for future weapons contracts, is also out of money.\nAs a result, Garn said Wednesday, “Without the supplemental funding, there will be a shortfall in replenishing U.S. military stocks, affecting American military readiness.”\nPresident Joe Biden is urging Congress to pass a $110 billion aid package for Ukraine, Israel and other national security needs. It includes $61.4 billion for Ukraine, with about half to replenish Pentagon stocks. It also includes about $14 billion for Israel as it fights Hamas and $14 billion for U.S. border security. Other funds would go for security needs in the Asia-Pacific.\nDue to an accounting error that overvalued some of the weapons sent to Ukraine over the past year or more, there is still about $4.2 billion in restored drawdown authority. But since the Pentagon has no money to replenish inventory sent to Kyiv, the department will have to “rigorously assess” any future aid and its implications on the U.S. military's ability to protect America, Garn said.\nThis is the 54th tranche of military aid taken from department shelves and sent to Ukraine, and it is similar in size and contents to many of the other recent packages.\nU.S. defense and government leaders have argued that the weapons are critical for Ukraine to maintain its defense and continue efforts to mount an offensive against Russian forces during the winter months.\nIn a Pentagon briefing last week, Air Force Maj. Gen. Pat Ryder noted the recent letter that the Defense Department comptroller sent to Congress warning that the U.S. will be using up the last of its replenishment funds by the end of the year.\n“Once those funds are obligated, we will have exhausted the funding available for us to provide security assistance to Ukraine,” said Ryder, the Pentagon press secretary. “We would, again, continue to urge the passage of the supplemental that we’ve submitted. ... It is imperative that we have the funds needed to ensure that they get the most urgent battlefield capabilities that they require.”\nThe latest aid package comes as the war in Ukraine drags on into its 22nd month. Russia fired almost 50 Shahed drones at targets in Ukraine and shelled a train station in the southern city of Kherson where more than 100 civilians were gathered to catch a train to Kyiv. And a day earlier, Ukrainian warplanes damaged a Russian ship moored in the Black Sea off Crimea as soldiers on both sides are struggling to make much progress along the front lines.", "source_domain": "www.independent.co.uk", "text": null, "title": "US announces new weapons package for Ukraine, as funds dwindle and Congress is stalled on aid bill", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-congress-pentagon-washington-b2470188.html"}