{"authors": [], "date_download": "2024-02-05 15:21:56", "date_modify": "None", "date_publish": "2023-12-26 20:09:50", "description": "The head of Colombia’s largest remaining rebel group says it will only abide by a recent agreement to suspend the kidnappings of civilians for ransom if the government keeps its promise to finance projects that could provide the rebels with alternate sources of income", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Feln-ap-colombia-bogota-luis-diaz-b2469683.html.json", "image_url": "https://static.independent.co.uk/2023/12/26/20/Colombia_Rebels_Kidnapping_20444.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe head of Colombia’s largest remaining rebel group said on Monday it would only abide by a recent agreement to suspend the kidnappings of civilians for ransom if the government keeps its promise to finance projects that could provide the rebels with alternate sources of income.\nIn a column published on Christmas Day, National Liberation Army commander Antonio García argued that Colombian officials and journalists had misinformed the public on Dec. 17, when they announced that the rebels had agreed to stop kidnappings, if a cease-fire with the government is extended next year.\nColombians have grown angry at kidnappings by the guerrillas, known by their Spanish initials as the ELN.\nGarcía said that while such an agreement was reached during a recent round of peace talks in Mexico City, the government had also agreed in the talks to create a committee that would find ways to finance the peace talks and the current ceasefire and determine what kind of activities will be funded.\nThe conflict between the government and the leftist rebels of the ELN dates back to the 1960s. The larger Revolutionary Armed Forces of Colombia, or FARC, agreed a peace deal with the government in 2016, but the ELN still has about 2,000 to 4,000 fighters in Colombia and neighboring Venezuela.\nELN leader García wrote that public funding for the cease-fire should be “linked” to the suspension of kidnappings.\n“Peace is not designed for just one side to win,” he wrote. “Everyone must benefit, especially the country.”\nGarcía's announcement marks a setback for Colombia's first leftist government, which had described the tentative agreement by the ELN to stop kidnappings as an important step towards peace.\nThe current talks between both sides began in November of 2022. While they produced a six-month cease-fire that ends on Jan. 30, there has been little progress on other fronts.\nIn October Colombian officials pressured the ELN to stop kidnapping civilians for ransom after one of its squadrons shocked the nation, by abducting the parents of soccer star Luis Díaz near their home in the north of the country.\nDíaz's mother was quickly rescued by police, while his father was released 12 days later, after multiple protests and mediation efforts.\nBut García warned the group would not be forced into giving up kidnappings.\n“We have not come to an agreement in the peace talks, on political, judicial or economic detentions” he said in a message posted on X, formerly Twitter.\nColombia's Defense Ministry says the group is holding at least 38 hostages.", "source_domain": "www.independent.co.uk", "text": null, "title": "Colombia's ELN rebels say they will only stop kidnappings for ransom if government funds cease-fire", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/eln-ap-colombia-bogota-luis-diaz-b2469683.html"}