{"authors": [], "date_download": "2024-02-05 15:21:57", "date_modify": "None", "date_publish": "2023-12-26 18:53:04", "description": "Ukrainian warplanes damaged a Russian ship moored in the Black Sea off Crimea, both countries say", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fcrimea-ap-ukraine-black-sea-kyiv-b2469666.html.json", "image_url": "https://static.independent.co.uk/2023/12/26/05/Russia_Ukraine_War_Special_Forces_74276.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nUkrainian warplanes damaged a Russian ship moored in the Black Sea off Crimea, both countries said Tuesday, bolstering Ukrainian morale after battlefield disappointments and doubts about the future of Western aid.\nThe planes fired guided missiles at the landing ship Novocherkassk, which is moored at a base in the city of Feodosia, Russia’s Defense Ministry said. Video on Russian and Ukrainian social media showed an explosion in the port.\nUkrainian authorities claimed the ship was destroyed. They said it was likely carrying ammunition and possibly drones.\nThe 360-foot Novocherkassk can carry 10 tanks and 225 sailors.\n“We saw how powerful the blast and detonation were. It’s extremely difficult for a ship to survive something like that,” Ukrainian air force spokesman Yurii Ihnat said on U.S.-backed Radio Liberty.\n“The Russian fleet has become smaller,” Ukrainian air force Cmdr. Mykola Oleschuk said in a mocking message on the social media app Telegram. He urged Russians to leave Crimea “while it’s not too late.”\nOver the last few months, Ukrainian forces have conducted a string of attacks around Crimea, a Black Sea peninsula invaded and illegally annexed by Russia in 2014. Ukrainian President Volodymyr Zelenskyy credits those attacks, mostly with naval drones, with allowing Ukraine to restore navigation in the Black Sea and export of millions of tons of grain.\nIn September, a Ukrainian attack hit the headquarters of Russia’s Black Sea Fleet in the Crimean city of Sevastopol, killing one serviceman. Ukraine launched more missiles against the city the following day.\nBut despite high hopes for a broader Ukrainian summer counteroffensive, the front line barely moved, and political disputes in allied countries have left billions of dollars of aid in doubt.\nThis week, President Joe Biden is struggling to secure congressional support for continuing American assistance to Ukraine. Even though he’s repeatedly promised that the United States would back Ukraine for “as long as it takes” to defeat the Russian invasion, there’s no sign of a bipartisan deal to maintain the flow of supplies as the war approaches its third year.\nShowing Ukrainian forces’ difficulties on the battlefield, commander-in-chief Valerii Zaluzhnyi said Tuesday that his troops had retreated to the northern outskirts of the city of Marinka.\nRussia said Monday that it had taken Marinka, which sits about 20 kilometers (12 miles) west of Donetsk, the largest city in Russian-held territory.\nZaluzhnyi told journalists Tuesday that Ukrainian troops had held Marinka for almost two years but Russians “were destroying it street by street, house by house.”\n“Our forces prepared a defensive line beyond this settlement. But I can say that this town no longer exists,” Zaluzhnyi said. He compared Russian tactics in Marinka to its tactics in Bakhmut, which was reduced to rubble by the time the Russian army captured the city.\nAgainst that backdrop, the attack on the Novocherkassk offered some hope to Ukraine's allies.\nU.K. Defense Secretary Grant Shapps wrote on X that, “This latest destruction of Putin’s navy demonstrates that those who believe there’s a stalemate in the Ukraine war are wrong!\"\n“They haven’t noticed that over the past 4 months 20% of Russia’s Black Sea Fleet has been destroyed,” Shapps wrote. “Russia’s dominance in the Black Sea is now challenged.”\nRussia also said Tuesday two Ukrainian fighter jets were destroyed by anti-aircraft fire during the attack. Ihnat, of the Ukrainian air force, denied that.\nThe Russia-appointed head of Crimea, Sergei Aksyonov, said one person was killed in Tuesday's attack and Defense Minister Sergei Shoigu briefed Russian President Vladimir Putin, according to Russian news agencies that provided no details.\nShoigu touted Russian accomplishments in the war this year, saying, \"The main efforts in the outgoing year were focused on achieving the goals of the special military operation. The main one is to disrupt the counteroffensive of the Ukrainian armed forces, loudly announced by Ukraine and its NATO allies. This task has been successfully completed.”\nRussian authorities use wording “special military operation” for the war it started in Ukraine nearly two years ago.\nThe Novocherkassk was damaged in an attack in March 2022, about a month after the war started, but Ihnat said it has been recently used to transport weapons and soldiers to the Zaporizhzhia region, which is partly held by Russian forces.\nThe Ukrainian air force's Tuesday morning update said that Russia launched 19 drones, mostly against the Odesa and Mykolaiv regions — 13 of which were shot down — over the past night. The remaining drones caused infrastructure damage, but no casualties were reported, according to Ukraine’s presidential office.", "source_domain": "www.independent.co.uk", "text": null, "title": "Ukraine damages a Russian landing ship in the Black Sea after battlefield disappointments", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/crimea-ap-ukraine-black-sea-kyiv-b2469666.html"}