{"authors": ["Helen Livingstone", "Maya Yang", "Yohannes Lowe", "Rachel Hall", "Adam Fulton"], "date_download": "2024-02-05 15:15:03", "date_modify": "None", "date_publish": "2024-01-29 01:59:18", "description": "This blog has now closed. You can see our full report on the drone attack that killed three US soldiers in Jordan here and our report on western countries’ decision to cut funding to UNRWA here. And see all coverage of the Israel-Gaza war and Middle East crisis here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F28%2Fmiddle-east-crisis-live-israel-gaza-hamas-us-negotiations-hostages-fighting.json", "image_url": "https://i.guim.co.uk/img/media/5297522d4dfd62f4baec0d86de5008016c6d5731/793_735_9417_5650/master/9417.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=76d6ba97b6547b8a65fd284b98547ca3", "language": "en", "localpath": null, "maintext": "From 28 Jan 2024 18.02 CET Three US service members killed in drone attack on US forces in north-east Jordan, says Joe Biden Three US service members have been killed during an unmanned aerial drone attack on US forces in north-east Jordan near the Syria border on Saturday night. In a statement released on Sunday, Joe Biden said that while an investigation into the attack remains underway, the US knows “it was carried out by radical Iran-backed militant groups operating in Syria and Iraq.” Biden added that many others were wounded. He went on to add: Jill and I join the families and friends of our fallen—and Americans across the country – in grieving the loss of these warriors in this despicable and wholly unjust attack … We will carry on their commitment to fight terrorism. And have no doubt – we will hold all those responsible to account at a time and in a manner our choosing. At least 34 personnel are being evaluated for possible traumatic brain injury, according to a US official, Reuters reports. The attacks mark the first fatalities of US troops in the region since Israel’s war in Gaza began on 7 October.\nUpdated at 18.35 CET\n29 Jan 2024 02.59 CET Closing summary We’re closing our live coverage of the Middle East crisis for the time being but we’ll be back with you in the coming hours. In the meantime, here are the key developments: Three US service members have been killed during an unmanned aerial drone attack on US forces in north-east Jordan near the Syria border on Saturday night. In a statement released on Sunday, Joe Biden said that while an investigation into the attack remains underway, the US knows “it was carried out by radical Iran-backed militant groups operating in Syria and Iraq”.\nThe US will respond to the attack on its troops, Biden said. During a campaign event at South Carolina on Sunday following the attack which killed three US service members and injured dozens of others, Biden said: “We shall respond.” In his earlier statement he also said: “Have no doubt - we will hold all those responsible to account at a time and in a manner of our choosing.”\nA senior official with Hamas, Sami Abu Zuhri, said the attacks on US forces were tied directly to Israel’s ongoing war in Gaza. Speaking to Reuters, Abu Zuhri said: “The killing of three American soldiers is a message to the US administration that unless the killing of innocents in Gaza stops, it must confront the entire nation.”\nAt least 165 Palestinians were killed and 290 injured over the past 24 hours, Gaza’s health ministry said on Sunday . That brings the total number of Palestinians killed in the Israeli onslaught on Gaza to 26,422 since 7 October, not including the thousands thought to be buried under the rubble of collapsed buildings. The huge death toll comes despite last week’s ICJ interim ruling that Israel must do everything possible to avoid killing Palestinian civilians.\nPalestinian medics and residents said Israel continued to bomb areas around the two main hospitals in Khan Younis, hindering efforts by rescue teams to respond to desperate calls from people caught in the Israeli bombardment . “There is a complete failure of the healthcare system at Nasser and Al-Amal hospitals,” said health ministry spokesperson Ashraf al-Qidra.\nThe United Nations secretary general, António Guterres, has appealed to the 10 donor countries that have withdrawn funding from the UN Relief and Works Agency for Palestine Refugees to reconsider, saying the agency and Palestinians in desperate need should not be penalised due to the alleged acts of a dozen staff . Guterres said nine UNRWA staff had already been dismissed for alleged involvement in Hamas’s attack on Israel on 7 October and any UN employee involved in acts of terror would be held accountable, including through criminal prosecution. Aid agencies have repeatedly warned in recent weeks that ordinary Gazans are at risk of famine after Israel stopped most food aid from entering the territory and cut off water supplies.\nTalks on Sunday initiated by Qatar, the US and Egypt and aimed at brokering a hostage deal between Israel and Hamas were “constructive” but “significant gaps” remain, a statement from the Israeli prime minister’s office has said . US officials have reportedly proposed an initial 30-day temporary ceasefire to allow for the remaining female, elderly and wounded Israeli hostages to be freed. This would be followed by a second 30-day pause where Israeli soldiers and male hostages would be released, in tandem with an increase in the trickle of aid permitted into Gaza.\nFar-right Israeli ministers and ministers belonging to Benjamin Netanyahu’s Likud party have attended a conference on the resettlement of Gaza, at which the national security minister Itamar Ben Gvir said Israelis needed “to find a legal way to voluntarily emigrate [Palestinians],” Haaretz newspaper has reported. Communications minister Shlomo Karhi told the conference that in war, “‘voluntary’ is at times a state you impose [on someone] until they give their consent.’”\n29 Jan 2024 02.47 CET The Palestinian prime minister Mohammad Shtayyeh has called for the countries that have paused their funding to the United Nations Relief and Works Agency for Palestine Refugees (UNRWA), to reverse the decision. Aid agencies had already been saying that Gazans face famine after Israel prevented most food supplies from getting through and cut off water supplies. 00:01:40 Palestinian PM urges countries to reverse decision to freeze UNRWA funds – video\n29 Jan 2024 02.17 CET Far-right Israeli ministers attend conference on resettlement of Gaza, 'voluntary' transfer of Palestinians Far-right Israeli ministers and ministers belonging to Benjamin Netanyahu’s Likud party have attended a conference on the resettlement of Gaza, at which the national security minister Itamar Ben Gvir said Israelis needed “to find a legal way to voluntarily emigrate [Palestinians],” Haaretz newspaper has reported. The conference held in Jerusalem on Sunday was attended by thousands of people including finance minister Bezalel Smotrich as well as other members of the Knesset and coalition government, rabbis, settlement activists and families of soldiers fighting in Gaza. In his speech, Ben Gvir said: If we don’t want another October 7, we need to go back home and control [Gaza]. We need to find a legal way to voluntarily emigrate [Palestinians] and impose death sentences on terrorists … I turn to you, prime minister [Benjamin] Netanyahu: this is time for brave decisions. Members of the Likud party, who have talked openly about the “voluntary emigration” of Palestinians since the war began, returned to the theme at the conference, according to Haaretz. Communications minister Shlomo Karhi said that in war, “‘voluntary’ is at times a state you impose [on someone] until they give their consent.’” Tourism minister Haim Katz meanwhile said that, “Today, after 18 years [from disengagement from Gaza], we have the opportunity to rebuild and expand the land of Israel. This is our final opportunity.” View image in fullscreen Israeli national security minister Itamar Ben Gvir (C) dances at a conference calling for the establishment of Israeli settlements in the Gaza Strip on Sunday. Photograph: Abir Sultan/EPA\n29 Jan 2024 01.50 CET As we reported earlier, it was another deadly weekend for Palestinians in Gaza, with at least 165 Palestinians killed and 290 injured over the past 24 hours, according to the territory’s health ministry. That brings the total death toll to 26,422 since 7 October, not including the thousands thought to be buried under the rubble of collapsed buildings. It is difficult to independently verify details of the dead but the Associated Press reported that at last 17 people were killed in two Israeli airstrikes that hit apartment buildings in central Gaza. Another Israeli strike hit a building in Zawaida, also in central Gaza, killing 13 people and another strike on an apartment block in the Nuseirat refugee camp killed four people. Another 10 Palestinians were killed in a strike that hit a residential building in the Shati refugee camp in Gaza City, AP reported, citing Dr Moataz Harara, a physician at al-Shifa hospital, where the dead were taken. In addition, Al Jazeera on Sunday reported the killing of two brothers, 13 -year-old Nahedh Barbakh and 20-year-old Ramez Barbakh, who it said were shot dead by Israeli forces on Wednesday on a supposedly safe route while carrying a white flag as they followed Israeli evacuation orders to flee their home in Khan Younis. It was not possible to verify the report.\n29 Jan 2024 01.17 CET 'Significant gaps' remain after Gaza ceasefire talks, Israel says Israel has said “significant gaps” remain between the parties after Gaza ceasefire talks initiated by the US, Qatar and Egypt and held at an unspecified location in Europe. A statement by prime minister Benjamin Netanyahu’s office said the talks were “defined as constructive”, adding: “There are still significant gaps which the sides will continue to discuss at additional mutual meetings to be held this week.” The intelligence summit in Europe – with the participation of Mossad Director David Barnea, ISA Director Ronen Bar, Maj.-Gen, (Res.) Nitzan Alon, the Director of the CIA, the Prime Minister of Qatar and the Egyptian Intelligence Minister – concluded a short while ago. — Prime Minister of Israel (@IsraeliPM) January 28, 2024 The statement did not elaborate on what the gaps were and there were no statements from the other parties. The talks have reportedly focused on a pause in Israel’s brutal military assault on Gaza in exchange for the release of Israeli hostages held by Hamas.\n29 Jan 2024 01.02 CET Rowena Mason In the UK, the Labour MP Kate Osamor has had the whip suspended while she is investigated for saying Gaza should be remembered as a genocide on Holocaust Memorial Day. The MP for Edmonton in north London is due to meet party whips on Monday after issuing an apology over the message she sent on the eve of the day marking the murder of 6 million Jews during the second world war. Osamor had distributed the message to her party members, saying Holocaust Memorial Day should be observed, but other genocides should also be remembered – listing Gaza as one of them. The former shadow development secretary, who served in Jeremy Corbyn’s top team, shared a photograph of herself signing the Westminster remembrance book of the Holocaust Educational Trust. She also wrote that there was an ‘“international duty” to remember the victims of the Holocaust, as well as “more recent genocides in Cambodia, Rwanda, Bosnia and now Gaza”. Labour suspends Kate Osamor over Gaza comments in Holocaust message Read more\n28 Jan 2024 00.46 CET Gunmen captured after deadly attack on Catholic church in Istanbul Two gunmen who opened fired inside a Catholic church in Istanbul, killing one person, have been detained, AFP reports. The news agency writes: The shooting, condemned by Pope Francis and Turkish officials, was claimed by the so-called Islamic State group in a statement issued on its Telegram channels. Two masked men carried out the attack at around 11.40 am (0840 GMT) at the Santa Maria church in the Sariyer district, on the European side of Turkey’s largest city, interior minister Ali Yerlikaya said on social media. Turkish officials said it looked like a targeted attack against one person rather than against the Catholic church. The minister said an individual initially identified only as CT was the target of the gun attack and had lost his life. He was among those attending Sunday’s service. Turkish police detained the two suspects as they fled the scene, Yerlikaya announced late on Sunday, identifying the victim as Tuncer Cihan. Istanbul governor Davut Gul said there had been no other injuries. Local officials said around 40 people attended the mass including Poland’s consul general in Istanbul Witold Lesniak and his family. They also suggested that, but for a weapons malfunction, there might have been more casualties. View image in fullscreen Turkish police officers stand guard in a cordoned off area outside Santa Maria church in Istanbul, Turkey on Sunday. Photograph: Emrah Gürel/AP\n28 Jan 2024 00.31 CET Israeli forces are raiding the West Bank city of Jenin, Al Jazeera is reporting citing the Palestinian news agency Wafa. The broadcaster also said clashes had erupted in the village of Muthalath al-Shuhada, south of Jenin and that Israeli soldiers had stormed residential neighbourhoods in the town of Ya’bad, south-west of Jenin. Israeli forces have repeatedly raided cities and towns across the occupied West Bank since Hamas 7 October attack on Israel. According to the UN agency Ocha, 361 Palestinians including 92 children have been killed by Israeli forces and settlers as of Friday.\n28 Jan 2024 00.12 CET A US Muslim group has criticised former House of Representatives Speaker Nancy Pelosi after she suggested, without offering evidence, that some protesters demanding a ceasefire in Gaza could be linked to Russia and urged the FBI to investigate. Her comments were dismissed as “unsubstantiated smears” by the Council on American-Islamic Relations (CAIR), who said such remarks amounted to dehumanization of the Palestinian people, Reuters reported. Pelosi made the remarks in a CNN interview after she was asked whether opposition to President Joe Biden’s policy in the war in Gaza could hurt the Democrat in November’s presidential election. She said: For them to call for a ceasefire is Mr. Putin’s message, Mr. Putin’s message. Make no mistake, this is directly connected to what he (Russian President Vladimir Putin) would like to see. I think some of these protesters are spontaneous, and organic, and sincere. Some I think are connected to Russia. Some financing should be investigated and I want to ask the FBI to investigate that. Pelosi’s comments marked the first time a prominent US lawmaker has accused Russia’s leader of backing US protesters calling for a ceasefire. The Russian embassy in Washington was not immediately available to comment. Protests demanding a ceasefire in Gaza have recently occurred across the US, including near airports and bridges in New York City and Los Angeles, vigils outside the White House and marches in Washington. Demonstrators have also interrupted Biden speeches and events. The protests have been organised by a range of human rights, Jewish and anti-war activist groups. Ibrahim Hooper, a spokesperson for CAIR, said: It is unconscionable that an individual with such influence in this nation would spread unsubstantiated smears targeting those who seek an end to the slaughter of civilians in Gaza and a just resolution to that conflict. CAIR national executive director Nihad Awad added that Pelosi’s comments: echo a time in our nation when opponents of the Vietnam War were accused of being communist sympathisers and subjected to FBI harassment. View image in fullscreen Former US House Speaker Nancy Pelosi (R) with US President Joe Biden. Photograph: Sarah Silbiger/EPA This is Helen Livingstone, taking over from my colleague, Maya Yang.\nUpdated at 00.16 CET\n28 Jan 2024 23.56 CET Summary Here is where the day stands: Three US service members have been killed during an unmanned aerial drone attack on US forces in north-east Jordan near the Syria border on Saturday night. In a statement released on Sunday, Joe Biden said that while an investigation into the attack remains underway, the US knows “it was carried out by radical Iran-backed militant groups operating in Syria and Iraq”. Biden added that many others were wounded.\nThe US will respond to the attack on its troops over the weekend, Biden said on Sunday. During a campaign event at South Carolina on Sunday following the attack which killed three US service members and injured dozens others, Biden said: “We shall respond.” Biden also went on to ask for a moment of silence.\nUS central command (Centcom) said that it is currently withholding the identities of the service members killed in Saturday night’s attack until 24 hours after their families have been informed. In a statement released on Sunday, Centcom said: “As a matter of respect for the families and in accordance with DoD [Department of Defense] policy, the identities of the service members will be withheld until 24 hours after their next of kin have been notified.”\nUS defense secretary Lloyd Austin has responded to the attacks on US troops in Jordan, saying: “ Iran-backed militias are responsible for these continued attacks on US forces, and we will respond at a time and place of our choosing.”\nJordan has condemned the “terrorist attack” on a military advance post along the border with Syria, Reuters reports. It added that it is cooperating with the US to secure the border and fight terrorism.\nA senior official with Hamas, Sami Abu Zuhri, said that last night’s attacks on US forces were tied directly to Israel’s ongoing war in Gaza which have killed more than 26,000 Palestinians since last October. Speaking to Reuters, Abu Zuhri said: “The killing of three American soldiers is a message to the US administration that unless the killing of innocents in Gaza stops, it must confront the entire nation.”\nUpdated at 23.59 CET\n28 Jan 2024 23.39 CET World Health Organization chief Tedros Ghebreyesus has joined UNRWA’s appeals to donors to continue funding the agency for Palestinian refugees. In a tweet on Sunday, Tedros wrote: We appeal to donors not to suspend their funding to UNRWA at this critical moment. Cutting off funding will only hurt the people of Gaza who desperately need support.” We appeal to donors not to suspend their funding to @UNRWA at this critical moment. Cutting off funding will only hurt the people of #Gaza who desperately need support.https://t.co/xx85VOCIjx — Tedros Adhanom Ghebreyesus (@DrTedros) January 28, 2024 Since last October, Israel’s attacks on Gaza have left close to 2 million Palestinians forcibly displaced amid shortages in food, water, fuel and medical supplies.\n28 Jan 2024 23.06 CET Famine in Gaza 'inevitable', UN special rapporteur says The UN special rapporteur on the right to food said that the Gaza strip is facing “inevitable famine” due to western countries to pause funding following Israel’s accusations that several of the group’s staff members participated in Hamas’s attacks last October. The Guardian’s Bethan McKernan and Ruth Michaelson report: Michael Fakhri, the UN special rapporteur on the right to food, said on Sunday “famine was imminent” and now ‘inevitable’, in a comment following the news that the US and nine other countries were suspending additional funding to the UN Relief and Works Agency for Palestinian Refugees (UNRWA). ‘This collectively punishes over 2.2 million Palestinians,’ he said. According to the UN secretary-general,António Guterres, 12 UNRWA staff members were identified by Israel, nine of which had been fired, one killed and the identities of two more were being checked. A UN investigation has been launched. Israel has not publicly shared the details of its allegations against the UNRWA employees, which according to the Axios website were provided by the Israel Defense Forces (IDF), and internal security service, the Shin Bet. The information ‘pointed to the active participation of UNRWA staffers along with the use of the agency’s vehicles and facilities’, it reported. Read the full story here: Famine in Gaza is being made ‘inevitable’ says UN rapporteur Read more\nUpdated at 02.44 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Far-right Israeli ministers call for resettlement of Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/28/middle-east-crisis-live-israel-gaza-hamas-us-negotiations-hostages-fighting"}