{"authors": [], "date_download": "2024-02-05 15:21:57", "date_modify": "None", "date_publish": "2023-12-26 22:31:25", "description": "Attacks on merchant ships by Iranian-backed Yemeni militia in the Red Sea have caused havoc with global supply routes", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fhouthi-drones-red-sea-centcom-b2469703.html.json", "image_url": "https://static.independent.co.uk/2023/12/26/21/GCEsN1za4AAJDSZ.jpeg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nUnited States forces shot down a barrage of drones and missiles over the southern Red Sea that were fired from Yemen by Iranian-backed Houthi rebels, the US Central Command announced.\nThe USS Laboon destroyer and F-18 Super Hornets destroyed 12 one-way attack drones, three anti-ship ballistic missiles, and two land attack cruise missiles fired from Houthi-controlled territory over 10 hours on Tuesday, Central Command said in a statement.\nThere were no reported injuries or damage to ships.\nDrone and missile attacks by Yemen-based Houthi rebels against cargo ships in the Red Sea have disrupted global supply chains and forced most large shipping companies to halt shipping through the vital corridor.\nDefense Secretary Lloyd Austin last week announced a new US-led multinational operation to protect ships operating in the Red Sea and Gulf of Aden.\nThe operation includes military personnel from the United Kingdom, Canada, France, Italy, the Netherlands, Spain and Bahrain.\nThe USS Laboon destroyer shot down a barrage of drone and missiles over the Red Sea fired from Somalia by Houthi rebels on 26 December, the US Central Command says (US Central Command)\nThe US had already deployed the Eisenhower Carrier Strike Group to the Middle East in early November, amid rising tensions over the devastating Israeli operation in Gaza that has claimed more than 20,000 Palestinian lives.\nThe Biden administration has blamed Iran, which also funds and trains Hamas, for attacks by Houthi militants against commercial and military vessels entering the Suez Canal.\nThe US earlier on Tuesday carried out strikes against Iran-backed militia groups in Iraq after three US service members were wounded in drone strikes on Erbil Air Base in northern Iraq on Christmas Day.\nThe Kataib Hezbollah militia and affiliated groups, under an umbrella of Iranian-backed militants, claimed responsibility for the attack, which left one service member in a critical condition.\nUS forces in the Middle East have faced escalating threats since the 7 October Hamas terror attacks on Israel, which claimed the lives of around 1200 Israelis.\nOn Monday, Iran vowed to take revenge for the death of one of its top generals, Seyed Razi Mousavi, who was killed on the outskirts of the Syrian capital of Damascus.\nMousavi had been a close ally of General Qassem Soleimani, the former head of Iran’s elite Quds Force, who was killed in a US drone strike in Iraq in January 2020.\nPresident Joe Biden was briefed on Monday’s drone attack on US forces in Iraq and ordered the Department of Defense to prepare a response, according to White House national security council spokesperson Adrienne Watson.", "source_domain": "www.independent.co.uk", "text": null, "title": "US shoots down 12 Houthi attack drones and five missiles in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/houthi-drones-red-sea-centcom-b2469703.html"}