{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:21:58", "date_modify": "None", "date_publish": "2023-12-26 05:12:26", "description": "Airstrikes were carried out on Christmas Day by U.S. forces against militants in Iraq, who earlier in the day had launched a suicide drone at a U.S. base, injuring three.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12900469%2Firaq-usa-airstrikes-Kataib-Hezbollah-erbil.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/26/05/79335381-0-image-m-9_1703567319411.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden on Christmas Day authorized air strikes in Iraq against militants behind a suicide drone strike earlier in the day, which wounded three U.S. service members - one of them critically.\nBiden, who is spending Christmas at Camp David, was briefed on the attack which injured the U.S. trio at a base by Erbil airfield.\nThe president then took the decision to retaliate, and the U.S. military carried out the strikes at 1:45 GMT, likely killing 'a number of Kataib Hezbollah militants' and destroying multiple facilities used by the group.\nGeneral Michael Erik Kurilla, head of U.S. Central Command, said the airstrikes were a direct reprisal.\nJoe Biden is seen on December 23 shortly before boarding Marine One to fly to Camp David for the Christmas holidays\n'These strikes are intended to hold accountable those elements directly responsible for attacks on coalition forces in Iraq and Syria and degrade their ability to continue attacks,' he said.\n'We will always protect our forces.'\nThe Pentagon did not disclose details about the identity of the service member who was critically wounded or offer more details on the injuries sustained in the attack.\nLloyd Austin, the Defense Secretary, said: 'My prayers are with the brave Americans who were injured.'\nThe White House National Security Council said Biden was briefed on the attack on Monday morning and ordered the Pentagon to prepare response options against those responsible.\n'The President places no higher priority than the protection of American personnel serving in harm's way. The United States will act at a time and in a manner of our choosing should these attacks continue,' NSC spokesperson Adrienne Watson said.\nFootage shared by a journalist with Kurdish TV reportedly showed the moment of impact\nThe Erbil base used by the U.S. troops. Washington has around 2,500 soldiers deployed in Iraq\nMonday's military attack and U.S. retaliation is the latest back-and-forth since a surge in violence began in mid-October, when Iran-aligned militias started targeting U.S. assets in Iraq and Syria over Washington's backing of Israel in its war against Hamas in Gaza.\nSince October 17, there have been 103 attacks against its troops in Iraq and Syria.\nThe majority of those attacks have been claimed by Islamic Resistance in Iraq, which opposes U.S. support for Israel in its war against Hamas in the Gaza Strip.\nIn early December, the U.S. embassy in Baghdad was targeted with rocket fire. That attack, the first of its kind since the start of the war in Gaza, was not claimed by any group.\nThe office of Prime Minister Mohammed Shia al-Sudani announced several arrests and said some had links to the security services.\nWashington has around 2,500 soldiers deployed in Iraq and about 900 in Syria.\nThe international coalition has been fighting the Islamic State group since 2014.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US launches airstrikes against Iran-backed militants in Iraq after drone attack left three American troops wounded with one in a critical condition", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12900469/iraq-usa-airstrikes-Kataib-Hezbollah-erbil.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}