{"authors": [], "date_download": "2024-02-05 15:22:19", "date_modify": "None", "date_publish": "2023-12-26 14:07:35", "description": "US attacks Iran-backed militias in Iraq after American troops injured in drone strike", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Firan-hezbollah-biden-drone-attack-b2469551.html.json", "image_url": "https://static.independent.co.uk/2023/12/26/13/2023-12-26T103236Z_163423353_RC2X45AD7JS7_RTRMADP_3_ISRAEL-PALESTINIAINS-USA-IRAQ.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nUS military forces carried out “necessary and proportionate strikes” against Iran-backed militia groups in Iraq, including Kataib Hezbollah, on Christmas day, according to Defense Secretary Lloyd Austin.\nThe attacks were in response to a “one-way attack drone” strike on Erbil Air Base in northern Iraq that injured at least three US service members. One is in critical condition, according to the Pentagon.\nIranian-backed militia Kataib Hezbollah and affiliated groups, under an umbrella of Iranian-backed groups, claimed credit for the attack, according to the White House.\nUS strikes in response targeted three facilities said to be used by Kataib Hezbollah and affiliated groups in Iraq, Mr Austin said.\nPresident Joe Biden was immediately briefed on the drone attack and had ordered the US Department of Defense to prepare a response, according to White House national security council spokesperson Adrienne Watson. The president directed the strikes following a call with Mr Austin and members of Mr Biden’s national security team, Ms Waton said in a statement.\nThose strikes targeted the groups’ locations “focused specifically on unmanned aerial drone activities,” she said. Mr Austin said the retaliatory strikes “intended to disrupt and degrade capabilities of the Iran-aligned militia groups directly responsible.”\n“The president places no higher priority than the protection of American personnel serving in harm’s way,” according to the White House. “The United States will act at a time and in a manner of our choosing should these attacks continue.”\nMonday’s airstrikes follow a series of attacks believed to be launched by Iranian-backed militia groups against US and coalition militaries in Iraq and Syria in the shadow of Israel’s US-backed bombardments in Gaza, where more than 20,000 Palestinians have been killed In Israel’s campaign against Hamas since October 7, according to Gaza’s health ministry.\nThe Biden administration has launched similar strikes in Syria, while commercial shipping in the region has also come under fire during Israel’s siege.\nKataib Hezbollah “poses a high threat” to US personnel in both Iraq and Syria, according to a description from the US Director of National Intelligence website. Approximately 3,500 US troops are stationed in Iraq and Syria.\nMr Austin stressed that the US does “not seek to escalate conflict in the region” but remains “committed and fully prepared to take further necessary measures to protect our people and our facilities,” he said in a statement.\nUS airstrikes on Monday “likely killed a number of Kataib Hezbollah militants,” according to a statement from US Central Command. “There are no indications that any civilian lives were affected,” the statement added.\nIraqi officials, however, said at least 19 people “including civilians” were killed in the attack.\nThe office of Iraqi Prime Minister Mohammed Shia al-Sudani called the US strikes “hostile acts” that “infringe upon Iraq’s sovereignty and are deemed unacceptable under any circumstances or justification.”\nThe prime minister’s office condemned the attack as a “clearly hostile, unconstructive act that does not serve the interests of long-term common interests,” according to the statement.\nThe strikes are “intended to hold accountable those elements directly responsible for attacks” against coalition forces and to “degrade their ability” to continue them, according to US Gen Michael Erik Kurilla, head of US Central Command.", "source_domain": "www.independent.co.uk", "text": null, "title": "US attacks Iran-backed militias in Iraq after American troops injured in drone strike", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/iran-hezbollah-biden-drone-attack-b2469551.html"}