{"authors": [], "date_download": "2024-02-05 15:22:20", "date_modify": "None", "date_publish": "2023-12-26 17:08:10", "description": "Mexico has launched its army-run airline, with the first Mexicana airlines flight taking off from Mexico City bound for the Caribbean resort of Tulum", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fandres-manuel-lopez-obrador-ap-mexico-mexico-city-caribbean-b2469638.html.json", "image_url": "https://static.independent.co.uk/2023/12/26/17/Mexico_Army_Airline_47804.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nMexico launched its army-run airline Tuesday, when the first Mexicana airlines flight took off from Mexico City bound for the Caribbean resort of Tulum.\nIt was another sign of the outsized role that President Andrés Manuel López Obrador has given to Mexico’s armed forces. The airline’s military-run holding company now also operates about a dozen airports, hotels, trains, the country’s customs service and tourist parks.\nGen. Luís Cresencio Sandoval, Mexico’s defense secretary, said that having all those diverse businesses run by the military was “common in developed countries.”\nIn fact, only a few countries like Cuba, Sri Lanka, Argentina and Colombia have military-run airlines. They are mostly small carriers with a handful of prop planes that operate mostly on under-served or remote domestic routes.\nBut the Mexicana airline plans to carry tourists from Mexican cities to resorts like Cancun, Puerto Vallarta, Los Cabos, Zihuatanejo, Acapulco and Mazatlan. Flights appear to be scheduled every three or four days, largely on weekends.\nThe carrier hopes to compete mainly on price: the first 425 tickets sold offered prices of about $92 for the flight from Mexico City to Tulum, which the government claimed was about one-third cheaper than commercial airlines.\nMexicana also hopes to fly to 16 small regional airports that currently have no flights or very few. For those worried about being told to “Fasten your seatbelt, and that’s an order,” the cabin crew on the Mexicana flight appeared to be civilians. In Mexico, the air force is a wing of the army.\nSandoval said the airline began operations with three Boeing jets and two smaller leased Embraer planes, and hopes to lease or acquire five more jets in early 2024.\nLópez Obrador called the takeoff of the first Boeing 737-800 jet “a historic event” and a “new stage,” marking the return of the formerly government-run airline Mexicana, which had been privatized, then went bankrupt and finally closed in 2010.\nThe airline combines Lopez Obrador's reliance on the military — which he claims is the most incorruptible and patriotic arm of the government — and his nostalgia for the state-run companies that dominated Mexico's economy until widespread privatizations were carried out in the 1980s.\nLópez Obrador recalled fondly the days when government-run firms operated everything from oil, gas, electricity and mining, to airlines and telephone service. He bashed the privatizations, which were carried out because Mexico's indebted government could no longer afford to operate the inefficient, state-owned companies.\n“They carried out a big fraud,” the president said at his daily morning news briefing. “They deceived a lot of people, saying these state-run companies didn't work.”\nIn fact, the state-run companies in Mexico accumulated a well-deserved reputation for inefficiency, poor service, corruption and political control. For example, Mexico's state-run paper distribution company often refused to sell newsprint to opposition newspapers.\nWhen the national telephone company was owned by the government, customers routinely had to wait years to get a phone line installed, and were required to buy shares in the company in order to eventually get service, problems that rapidly disappeared after it was privatized in 1990.\nWhile unable to restore the government-run companies to their former glory, the administration depicts its efforts to recreate them on a smaller scale as part of a historic battle to return Mexico's economy to a more collectivist past.\n“This will be the great legacy of your administration, and will echo throughout eternity,” the air traffic controller at Mexico City's Felipe Angeles airport intoned as the first Mexicana flight took off.\nLópez Obrador has also put the military in charge of many of the country's infrastructure building projects, and given it the lead role in domestic law enforcement.\nFor example, the army built both the Felipe Angeles airport and the one in Tulum.\nApart from boosting traffic at the underused Felipe Angeles airport, the army-run Mexicana apparently will provide flights to feed passengers into the president’s Maya Train tourism project. The army is also building that train line, which will connect beach resorts and archaeological sites on the Yucatan Peninsula.\nThe army, which has no experience running commercial flights, has created a subsidiary to be in charge of Mexicana.", "source_domain": "www.independent.co.uk", "text": null, "title": "Mexico's army-run airline takes to the skies, with first flight to the resort of Tulum", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/andres-manuel-lopez-obrador-ap-mexico-mexico-city-caribbean-b2469638.html"}