{"authors": ["Ciaran Mcgrath"], "date_download": "2024-02-05 15:15:04", "date_modify": "None", "date_publish": "2024-01-29 13:48:00", "description": "The F-35 is 'the only system that can help us succeed in the future's battlegrounds', chief of the General Staff Lt Gen Karel Rehka.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1860888%2Fvladimir-putin-russia-nato-czech-republic-fighter-jets-ukraine.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5186831.jpg", "language": "en", "localpath": null, "maintext": "US Air Force F-35 jets deploy to Lithuania\nThe Czech Republic has confirmed a deal with the United States to buy 24 F-35 jets at a cost of more than £5billion, sending a strong message to Russian President Vladimir Putin from its former Eastern Bloc ally. Czech Defence Minister Jana Cernochova and US Ambassador Bijan Sabet put pen to paper on a memorandum of understanding which marks the Czech military’s biggest-ever purchase. The Czechs also signed a letter of offer and acceptance, the final step in completing a contract between the governments, the Czech Defence Ministry announced. Ms Cernochova said: “By signing this intergovernmental agreement, our country and also our army enter a new era.” The Czech government approved the deal in September.\nRelated articles Tories ditch party for Reform UK with members growing sick of 'abhorrent' spats\nThe purchase of the F-35s sends a huge signal to Vladimir Putin\nThe first of the 24 fighter jets should be delivered in 2031, with the rest by 2035. The American aircraft will replace the 14 JAS-39 Gripen fighter jets from Sweden, which are currently used by the Czech army. The Czechs will pay almost £4billion ($5billion) to the US for the aircraft, training of pilots, ammunition and other costs, Ms Cernochova previously said. The remaining money will be used to finance an upgrade of the Caslav air force base in central Czech Republic, fuel and training of staff, she said. In a pointed message to the Russian President, chief of the general staff Lt Gen Karel Rehka said: “The F-35 is the only system that can help us succeed in the future’s battlegrounds, and that in the case of need, we’ll manage to effectively defend ourselves against aggression, together with our allies.”\nJana Cernochova, Czech Republic defence minister, pictured with US opposite number Lloyd Austin\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nLt. Gen. Mike Schmidt, program executive officer for the F-35 Joint Program Office at the US Air Force, said: \"We are pleased the government of Czech Republic is now officially a part of the F-35 Lightning II program of record. \"This partnership with the Czech Ministry of Defense will deliver and sustain the F-35 aircraft for decades, while providing the Czech Air Force with unmatched interoperability and ensuring it has the capability to counter current and future threats.\" F-35s are now operating from 32 bases worldwide. There are two full US F-35 squadrons based at RAF Lakenheath, in Suffolk. Bridget Lauderdale, Lockheed Martin's vice-president and general manager of the F-35 program, said: \"The F-35 is the best solution for the Czech Republic's future fighter fleet with fifth generation capabilities enhancing the nation's effectiveness in the 21st century security battlespace.\" The Czech ministry has been negotiating the deal with the US for more than a year during Russia’s invasion of Ukraine. Grant Shapps has said he is \"working hard\" to ensure the Armed Forces are not depleted, amid warnings that military personnel are leaving faster than they can be replaced. The UK Defence Secretary stressed he was taking steps to ensure Britain has \"the men and women we need for our Armed Forces\", as MPs debated the UK's military action against Yemen-based Houthi rebels. Ministers have in recent weeks highlighted rising tensions around the globe, with Mr Shapps warning of movements towards a \"pre-war world\".\nDefence Secretary Grant Shapps says he is 'working hard' to ensure the Armed Forces are not depleted\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Putin threat as ex-Soviet nation spends £5.2bn on US F-35s", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1860888/vladimir-putin-russia-nato-czech-republic-fighter-jets-ukraine"}