{"authors": ["Bethan Sexton", "Bethan Sexton For Dailymail.Com"], "date_download": "2024-02-05 15:22:21", "date_modify": "None", "date_publish": "2023-12-25 02:44:19", "description": "Palestinians were seen carrying bodies of the dead, including a baby, following the strike on the Maghazi refugee camp east of Deir al-Balah on Sunday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12899167%2FPalestinians-killed-Gaza-refugee-camp-christmas-eve.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/25/03/79311121-0-Palestinians_who_were_arrested_by_the_Israeli_military_in_the_no-a-52_1703473402908.jpg", "language": "en", "localpath": null, "maintext": "Death of IDF soldier Sgt. Birhanu Kassie, 22, during the conflict brings number of Israeli troops killed to 15\nPalestinians seen carrying bodied of the dead, including a baby as well as wounded following the bombing\nAt least 68 people have been killed at a refugee camp in Gaza during a devastating Christmas Eve Israeli airstrike thought to be one of the deadliest since the war began.\nFrantic Palestinians were seen carrying the dead, including a baby, and wounded following the strike on the Maghazi refugee camp east of Deir al-Balah.\nOne bloodied young girl looked stunned while her body was checked for broken bones. The 68 fatalities include at least 12 women and seven children, according to early hospital figures from Gaza officials.\n'We were all targeted,' said Ahmad Turokmani, who lost several family members including his daughter and grandson. 'There is no safe place in Gaza anyway.'\nMeanwhile, the number of Israeli soldiers killed in combat over the weekend rose to 15.\nAt least 68 people have been killed in a deadly Christmas Eve Israeli airstrike on Maghazi refugee camp east of Deir al-Balah, according to Gaza health officials\nThe fatalities include fatalities are said to include at least 12 women and seven children, according to early hospital figures from Gaza officials. Pictured: Palestinians wounded in the Israeli bombardment of the Gaza Strip are brought to the hospital in Deir al Balah, Gaza Strip\nPalestinians mourn relatives killed in the Israeli bombardment of the Gaza Strip outside a morgue in Khan Younis on Sunday\nEarlier, the Health Ministry in Gaza gave the death toll of the refugee camp airstrike as 70. The Israeli military had no immediate comment.\nAs Christmas Eve fell, smoke rose over the besieged territory, while in the West Bank Bethlehem was hushed, its holiday celebrations called off.\nIn neighboring Egypt, tentative efforts continued on a deal for another exchange of hostages for Palestinians held by Israel.\nThe war has devastated parts of Gaza, killed roughly 20,400 Palestinians and displaced almost all of the territory´s 2.3 million people.\nThe mounting death toll among Israeli troops - 154 since the ground offensive began - could erode public support for the war, which was sparked when Hamas-led militants stormed communities in southern Israel on October 7, killing 1,200 and taking 240 hostage.\nIsraelis still largely stand behind the country´s stated goals of crushing Hamas´ governing and military capabilities and releasing the remaining 129 captives, despite rising international pressure against Israel´s offensive, and the soaring death toll and unprecedented suffering among Palestinians.\n'The war exacts a very heavy price from us, but we have no choice but to continue fighting,' Israeli Prime Minister Benjamin Netanyahu said.\nIn a nationally televised speech, Israeli President Isaac Herzog appealed for the country to remain united. 'This moment is a test. We will not break nor blink,' he said.\nThere has been widespread anger against his government, which many criticize for failing to protect civilians on October 7 and promoting policies that allowed Hamas to gain strength over the years. Netanyahu has avoided accepting responsibility for the military and policy failures.\nPalestinians salvage their belongings after an Israeli strike in Rafah, Gaza Strip. The Maghazi strike is thought to be one of the most deadly since the war began\nPalestinians wounded in the Israeli bombardment of the Gaza Strip are brought to the hospital in Deir al Balah, Gaza Strip\nMeanwhile, the number of Israeli soldiers killed in combat over the weekend rose to 15\nA Palestinian woman stands in her home after an Israeli strike in Rafah, Gaza Strip\n'Over time, the public will find it hard to ignore the heavy price paid, as well as the suspicion that the aims that were loudly heralded are still far from being attained, and that Hamas is showing no signs of capitulating in the near future,' wrote Amos Harel, military affairs commentator for the Haaretz newspaper.\nThe Israeli military said it had completed the dismantling of Hamas´ underground headquarters in northern Gaza, part of an operation to take down the vast tunnel network and kill off top commanders that Israeli leaders have said could take months.\nEfforts toward negotiations continued. The head of the Palestinian Islamic Jihad, Ziyad al-Nakhalah, arrived in Egypt for talks. The militant group, which also took part in the October 7 attack, said it was prepared to consider releasing hostages only after fighting ends. Hamas´ top leader Ismail Haniyeh traveled to Cairo for talks days earlier.\nIsrael´s offensive has been one of the most devastating military campaigns in recent history. More than two-thirds of the 20,000 Palestinians killed have been women and children, according to the Health Ministry in Gaza, which does not differentiate between civilians and combatants.\nOn Friday, Israeli airstrikes on two homes in Gaza killed 90 Palestinians, including dozens from an extended family, according to rescuers and hospital officials.\nOne of the homes, located in Gaza City, became one of the deadliest airstrikes in the war after 76 people from the al-Mughrabi family were killed, said Mahmoud Bassal, a spokesman for Gaza´s Civil Defense department.\nThe Palestinian Red Crescent said a 13-year-old boy was shot and killed in an Israeli drone attack while inside al-Amal Hospital in Khan Younis, a part of Gaza where Israel's military believes Hamas leaders are hiding.\nAn Israeli strike overnight hit a house in a refugee camp west of the city of Rafah, on Gaza´s border with Egypt. At least two men were killed, according to Associated Press journalists in the hospital where the bodies were taken.\nAt least two people were killed and six others wounded when a missile stuck a building in the Bureij refugee camp in central Gaza.\nPalestinians who were arrested by the Israeli military in the north of the Gaza Strip and released through the Kerem Shalom crossing in the south wait for treatment in Rafah\nPalestinians were seen carrying the bodies of the dead, including a baby, as well as the wounded following the strike\nAn Israeli Apache helicopter fires flares over the Gaza Strip, as seen from southern Israel\nPalestinians reported heavy Israeli bombardment and gunfire in Jabaliya, an area north of Gaza City that Israel had claimed to control. Hamas´military arm said its fighters shelled Israeli troops in Jabaliya and Jabaliya refugee camp.\nIsrael faces international criticism for the civilian death toll but it blames Hamas, citing the militants´ use of crowded residential areas and tunnels. Israel has launched thousands of airstrikes since Oct. 7. It says it has killed thousands of Hamas militants, without presenting evidence.\nIsrael also faces allegations of mistreating Palestinian men and teenage boys detained in homes, shelters, hospitals and elsewhere during the offensive. It has denied abuse allegations and said those without links to militants are quickly released.\nSpeaking to the AP from a hospital bed in Rafah after his release, Khamis al-Burdainy of Gaza City said Israeli forces detained him after tanks and bulldozers partly destroyed his home. He said men were handcuffed and blindfolded.\n'We didn´t sleep. We didn´t get food and water,' he said, crying and covering his face.\nAnother released detainee, Mohammed Salem, from the Gaza City neighborhood of Shijaiyah, said Israeli troops beat them. 'We were humiliated,' he said. 'A female soldier would come and beat an old man, aged 72 years old.'\nThe United Nations Security Council has passed a watered-down resolution calling for the speedy delivery of humanitarian aid for hungry and desperate Palestinians and the release of all the hostages, but not for a cease-fire.\nBut it was not immediately clear how and when deliveries of food, medical supplies and other aid, far below the daily average of 500 before the war, would accelerate. Trucks enter through two crossings: Rafah, and Kerem Shalom on the border with Israel. Wael Abu Omar, a spokesman for the Palestinian Crossings Authority, said 123 aid trucks entered Gaza on Sunday.\nSmoke rises following an Israeli bombardment in the Gaza Strip, as seen from southern Israel, Sunday, Dec. 24, 2023\nIsraeli army troops are seen near the Gaza Strip border, in southern Israel, Sunday, Dec. 24, 2023. The army is battling Palestinian militants across Gaza in the war ignited by Hamas' Oct. 7 attack into Israel\nIsraeli soldiers carry the flag-draped casket of Staff Sgt. Birhanu Kassie during his funeral at Mt. Herzl military cemetery in Jerusalem, Sunday, Dec. 24, 2023. Kassie, 22, was killed during Israel's ground operation in the Gaza Strip\nThe head of the World Health Organization, Tedros Adhanom Ghebreyesus, reiterated U.N. calls for a humanitarian cease-fire, adding on social media that 'the decimation of the Gaza health system is a tragedy.'\nAmid concerns about a wider regional conflict, the U.S. Central Command said a patrol ship in the Red Sea on Saturday shot down four drones launched from Houthi-controlled areas in Yemen, a while two Houthi anti-ship ballistic missiles were fired into international shipping lanes.\nThe Iran-backed Houthis say their attacks are aimed at Israel-linked ships in an effort to stop the Israeli offensive in Gaza.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "At least 68 Palestinians, including seven children, are killed in Gaza refugee camp in one of the deadliest Israeli airstrikes since the war began as 15 IDF soldiers are also slaughtered in bloody Chr", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12899167/Palestinians-killed-Gaza-refugee-camp-christmas-eve.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}