{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:22:22", "date_modify": "None", "date_publish": "2023-12-25 13:00:07", "description": "‘Safe’ evacuation zone of Deir al-Balah is hit amid some of the deadliest fighting in the war", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F25%2Fgaza-death-toll-rise-of-more-than-100-shows-no-let-up-in-israeli-offensive.json", "image_url": "https://i.guim.co.uk/img/media/63c8ca81701b9ed910561cad3d1f0cde966d6d88/0_0_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e3d14bfea0d6523816819c4d0c5005ec", "language": "en", "localpath": null, "maintext": "The Gaza Strip is facing some of the deadliest fighting to date in the present war as Israel expands its offensive just days after the UN security council passed a resolution calling for more aid and urgent steps for a sustainable ceasefire.\nMore than 100 people were killed in Israeli airstrikes late on Sunday in the centre of the besieged Palestinian territory, including at least 70 in bombings that hit a residential block in the Maghazi refugee camp near Deir al-Balah, health officials in Gaza said.\nDeir al-Balah was also hit overnight despite previously being identified by the Israel Defense Forces (IDF) as an “evacuation zone” for Palestinians fleeing the fighting.\nThe Palestinian Red Crescent published footage from al-Aqsa Martyrs hospital, in Deir al-Balah, showing dazed and bloodied children covered in rubble dust. There were also dozens of white body bags.\nAt the scene of the attack on Maghazi, people screamed and shouted in the dark as they tried to dig for survivors from the collapsed buildings.\n“We were all targeted,” Ahmad Turkomani, who lost several family members, including his daughter and grandson, told the Associated Press. “There is no safe place in Gaza anyway.”\nThe Israeli military said it was reviewing the Maghazi incident.\nThe latest casualties came after an earlier announcement on Sunday from the Gaza health ministry that Israeli airstrikes had killed 166 Palestinians in 24 hours, one of the single deadliest days of the 12-week-old conflict.\nMore than 20,400 Palestinians have been killed since Israel declared war in response to the 7 October attack by Hamas on Israel, in which the Palestinian militant group killed 1,140 people and seized another 240 as hostages.\nThis year’s Christmas celebrations across Israel and the occupied Palestinian territories were cancelled in solidarity with the people of Gaza.\nInstead of the traditional parade and joyous midnight service in the occupied West Bank town of Bethlehem, where Jesus was believed to have been born, Palestinian Christians held a subdued mass with hymns and prayers for peace.\n“This day is supposed to be a day of love and happiness but look around you, there are no smiles on people’s faces. Bethlehem is sad and dark. There are no decorations, no carols or a Christmas tree,” said the Reverend Louis Salman. “I blame the decision-makers who watch what is happening to the children of Gaza and do nothing.”\nFor Israel, the war has also exacted what the prime minister, Benjamin Netanyahu, called on Sunday a “very heavy cost” – 15 Israeli soldiers have been killed in intense ground skirmishes with Hamas since Friday, bringing the total to 156 combat losses.\nHamas cells are using IEDs, ambushes and their extensive tunnel network to inflict significant losses on the Israel Defence Forces in house-to-house combat, aided by knowledge of the densely packed urban territory.\nDespite the long-awaited UN security council resolution, on Friday, which called for urgent action from all parties to work towards a ceasefire, fighting on the ground has intensified since the collapse of the seven-day truce at the start of December.\nIsrael has expanded its operations into the southern half of the 365-sq-km strip, raising fears for the territory’s 2.3 million residents, almost all of whom have already sought shelter south of the Gaza River after being told by the Israeli army it would be safer there.\nThe UN has warned that a quarter of the population is starving and that an increase in aid since 17 December amounts to a fraction of what is needed for people to survive the cold and wet winter conditions.\nAid that did arrive, the World Food Programme said, was difficult to distribute because of the fighting and lack of fuel and usable roads. In some cases desperate people have looted arriving aid vehicles.\nOver the weekend Israel’s military chief of staff, Herzi Halevi, said his forces had largely achieved operational control in the north of Gaza, and would broaden the offensive further into the south, but residents still present in Gaza City and the north’s Jabalia camp said the fighting had worsened.\nOn Monday, details emerged of a ceasefire proposal put forward by Egypt, a key mediator between Israel and Hamas.\nTalks mediated by Qatar, which led to a seven-day ceasefire at the end of November, and the release of 100 hostages in exchange for 240 Palestinian women and children held in Israeli jails, appear to have stalled.\nIsrael’s security cabinet was expected to discuss the Egyptian plan on Monday night.\nIslamic Jihad, a smaller Palestinian militant group allied to Hamas, said a delegation led by its exiled leader, Ziad al-Nakhala, was in Cairo on Sunday. His arrival came after talks attended by Hamas’ chief based outside Gaza, Ismail Haniyeh, in recent days, in a positive sign that indirect discussions were under way.\nThe three-stage plan would entail an initial cessation of hostilities for at least a week and the release of all remaining Israeli civilian hostages held in Gaza; then a week in which female soldiers would be released in return for Palestinian prisoners in Israeli jails; and finally a month-long negotiation period for release of male soldiers in exchange for Israeli withdrawal.\nOn Monday night it emerged Hamas and Islamic Jihad had reportedly rejected the Egyptian proposal.\nSeparately, three security sources said an Israeli airstrike outside the Syrian capital Damascus had killed a senior adviser in Iran’s Revolutionary Guards.\nThe sources told Reuters the adviser, known as Sayyed Razi Mousavi, was responsible for coordinating the military alliance between Syria and Iran, which supports Hamas in Gaza.\nThe Revolutionary Guards, in a statement read on Iranian state television, said Israel “will pay for this crime”.\nWashington, Israel’s most important ally, has urged Israeli officials to shift away from large-scale aerial and ground operations in the Gaza Strip to a new phase in the war focused on precise targeting of Hamas leaders.\nBut despite rising international outcry over the humanitarian disaster in Gaza, including growing criticism from the US, Netanyahu has said that Israel will push on until “complete victory” over Hamas was achieved.\n“We wouldn’t have succeeded up until now to release more than 100 hostages without military pressure,” Netanyahu said during a speech in the Knesset in Jerusalem on Monday. “And we won’t succeed at releasing all the hostages without military pressure.”\nFamilies of the more than 100 Israeli hostages still held in Gaza watched Netanyahu’s speech from the parliamentary gallery, many of them holding signs calling for Israel to reach a deal and chanting “Now!”", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli airstrikes kill more than 100 as assault on Gaza widens", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/25/gaza-death-toll-rise-of-more-than-100-shows-no-let-up-in-israeli-offensive"}