{"authors": ["Kelly Laco", "Executive Editor Of Politics For Dailymail.Com"], "date_download": "2024-02-05 15:22:24", "date_modify": "None", "date_publish": "2023-12-25 06:18:08", "description": "The annual Reagan National Defense survey released last earlier this month revealed that 51 percent of Americans think China is the 'greatest threat to the U.S.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12882223%2Fchina-aggression-congress-fighting-greatest-threat.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/19/18/79137949-0-image-a-6_1703010383751.jpg", "language": "en", "localpath": null, "maintext": "Over the last year, China's many acts of aggression have not gone unnoticed by Americans, who consider the communist nation to be the greatest threat to the United States.\nThe annual Reagan National Defense survey released last earlier this month revealed that 51 percent of Americans think China is the 'greatest threat to the U.S.' and an 77 percent of Americans view China as an enemy, with only 15 percent considering the communist state an 'ally.'\nA number of recent incidents - including the Chinese spy balloon that traveled across the nation, Chinese spies caught on military bases, nationals illegally entering the U.S. through the southern border and increasing acts of aggression toward Taiwan - is putting Americans and Congress on high alert.\nIn January, former Speaker Kevin McCarthy created the first-ever House Select Committee on the Chinese Communist Party (CCP), which has been tackling the many challenges poised by China over the year.\nDailyMail.com breaks down the greatest acts of aggression by China toward the U.S. that occurred in 2023:\nThe spy ballon\nA Chinese 'spy balloon' flew across the U.S. in February, becoming a closely-watched phenomenon for days before the Biden administration shot it down.\nThe balloon gathered intelligence from several American military sites before it was shot down\nThe balloon entered U.S. airspace on 28 January and was shot down on 4 February after passing over nuclear missile sites, including the Malmstrom Air Force Base in Montana.\nAnd the balloon gathered intelligence from several American military sites before it was shot down, according to two senior U.S. officials and a former senior administration official.\nThe sources said China could have gathered more intelligence if not for the Biden administration's efforts to block it.\nChina previously claimed that the balloon was a civilian weather balloon that strayed off course. The foreign ministry condemned its shooting down as an 'overreaction.'\nBut the presence of the balloon caused Secretary of State Antony Blinken to cancel a previously scheduled meeting with his counterpart in China.\nChinese spies caught on military bases\nA shocking report alleged that there have been more than 100 instances in which U.S. military bases were infiltrated by Chinese nationals.\nThe Chinese nationals posed as 'tourists' wandered onto a missile launch site in New Mexico, as first reported by the Wall Street Journal.\nIn addition, some reportedly staged as scuba divers in order to get close to a Florida rocket launch site, while others claimed to be staying on an Army base in Alaska.\nTh operatives have reportedly claimed to be tourists who are 'lost' and unable to find their way to a Burger King or McDonalds coincidentally close to a U.S. military base.\nFort Wainright in Alaska, the center of the U.S. military's operations in the Arctic, was the subject of an apparent espionage attempt, the Wall Street Journal reports\nGovernment officials say that Chinese nationals are often 'pressed into service' and required to report their findings back to the Chinese government.\n'This is just part of the avalanche of Chinese espionage we are under,' Rep. Mike Waltz, R-Fla., told DailyMail.com in reaction.\nU.S. troops targeted in Guam\nChina currently has the capabilities to attack Guam, where over 20,000 U.S. troops are stationed.\nChairman Mike Gallagher of the House Select Committee on the Chinese Communist Party is concerned about how Guam is 'highly vulnerable' to an attack from China which has the capability to launch 'potentially hundreds of inbound cruise missiles' directed at the U.S. territory.\nIn a letter last month to Secretary of the Army Christine Wormuth obtained by DailyMail.com, the chairman warned that the U.S. has 'significant gaps in capabilities' to defend its over 20,000 troops if Chinese cruise missiles are fired at Guam.\nChina currently has the capabilities to attack Guam , where over 20,000 U.S. troops are stationed\nGuam is the location of the Navy's only submarine base in the western Pacific. It also hosts a 'strategically important' air base with bombers and fighter jets.\n'Such deficiencies put at grave risk our ability to use Guam as a vital submarine port and base to support operations in any contingency with the PRC,' wrote Gallagher.\nAgression toward Taiwan\nChina has been ramping up its aggression toward neighboring country Taiwan in recent years through both disinformation campaigns and military pressure.\nChinese propaganda is 'systematically sowing seeds of doubt about America's staying power in Taiwan and elsewhere,' President and CEO of the Ronald Reagan Presidential Foundation and Institute David Trulio told DailyMail.com.\nTrulio also mentioned the 'unrelenting pressure 'that the Chinese are putting on Taiwan economically and also through misinformation.\n'And it's very ominous, it's unrelenting, and that's something that really has to be addressed,' he detailed, particularly before Taiwan's 'critical' upcoming election in January.\nThe Chinese use a 'whole portfolio' of pressure tactics including TikTok, but in particular economic coercion and also military pressure.\nHe said that China uses targeting sanctions or other economic pressure tactics to different parts of Taiwan even to influence voters there.\nAs a result, Taiwan is growing 'frustrated' with the United States' ability to provide promised weapons - with defense experts calling it a 'serious' problem.\nChinese illegally enter U.S. through southern border\nPresident Biden's policies are allowing Chinese spies to use the southern border to gain entry into the U.S. and pose a long-term threat to national security.\nHouse Homeland Security Committee Chairman Mark Green, R-Tenn., told DailyMail.com that there has been a 'massive increase' of Chinese nationals tied to the People's Liberation Army (PLA) that have gained access to the U.S. by crossing over the border.\nAnd there have been over 17,800 Chinese nationals released into the U.S. this year alone, he claimed.\n'I still happen to think that the southern border is becoming quickly becoming our number one threat,' Sen. Kevin Cramer, R-N.D., previously told DailyMail.com.\n'It's just too easy to come in. We don't catch a lot of them. And we already know that it's having a devastating effect on our society,' he continued.\nSen. Kevin Cramer, R-N.D., said that although there are security challenges abroad, the United State's own southern border is becoming 'the most imminent' threat\nChina's online 'manipulation efforts' including TikTok\nChina's online 'manipulation' tactics and 'deception' techniques - through TikTok and other methods - are putting the U.S. on high alert.\nThe CCP flexes its 'discourse power' through propaganda, diplomacy, proxies and also covert operations, say experts.\nFor example, Young TikTok users in the fall 'discovered' Osama bin Laden's 2002 'Letter to America' glorifying and defending the September 11 attacks.\nDiscussion of the 'Letter to America' surged on TikTok, with young people describing the screed as revelatory and insightful.\nBin Laden justified the terror atrocity by arguing that America's support for Israel's right to exist made Americans legitimate targets.\nTikTok worked to remove the videos using the hashtag, but some say it was an attempt by the CCP to improperly influence American youth against their own government.\nExpansion of United Front work\nThe U.S. has little grasp of how deep China's network of espionage and influence operations runs through the nation, a dire warning from Congress has revealed.\nThe Chinese Communist Party's (CCP) presence on American soil has already revealed itself in the network of secret police stations in major cities and the 'Little Red Classrooms' in kindergartens.\nNow, members of the bipartisan House China Select Committee have released a memo detailing how the U.S. has failed to combat Beijing's infiltration - and it could get worse.\nThe threat comes from the united front, a political strategy Xi Jinping has called his 'magic weapon.'\nThere are three main tactics used by the CCP in this endeavor: silencing criticism of China, a push for propaganda, and manipulation through spy tactics and other 'illegal operations.'\nIt's the plan the CCP uses to influence beyond its circle without the information appearing to come directly from the Chinese government.\nChina spends billions on the united front system each year. United front is affiliated with some 600 groups in the U.S., according to a 2020 Newsweek report, that are all in regular touch with the CCP.\nChinese agents harassing dissidents on American soil\nOver the past year, there has been numerous instances of CCP targeting, including one that was singled out and harassed by communist agents just a few weeks ago in San Francisco, California, during President Xi Jinping 's participation in a summit.\nOne former Hong Kong native, Anna Kwok, told lawmakers about her firsthand experience being a victim of the CCP's transnational repression on American soil.\nShe says it is evidence that the CCP's United Front network is growing within the United States.\nDue to her advocacy work on Capitol Hill, she was put on a list by the CCP for a $1 million bounty and arrest warrant for 'colluding with foreign forces.'\nKwok - who lives in D.C. - said that since then, she feels as if she has a 'bold target on my back.'\n'Even though I was in the Land of the Free, I was not free; I was trapped in the constant mental pressure of being hunted. Of course, this was the CCP’s goal: they wanted to cripple my advocacy initiatives against their regime.'\nPro-democracy protesters critical of Xi's human rights violations and rising threats against Taiwan demonstrated outside the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco, California in November\nKwok detailed horrifying comments on her X profile, including threats and gender-based harassments.\nShe went on to say that during the APEC protests, her coalition of dissidents protested peacefully outside of Xi's event venues. But they were met with 'harassment, intimidation, stalking, and even violent assault from pro-Beijing protesters.'\nIn addition, 'suspicious men' dressed similarly to the national security agents in Hong Kong followed them around, she said.\nKwok was 'baffled' that the harassment occurred in 'broad day light' in the United States.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "From the China spy balloon to the infiltration of sensitive military bases: ALL the examples of growing Chinese aggression as Americans consider the hostile nation to be the GREATEST threat to the U.S", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12882223/china-aggression-congress-fighting-greatest-threat.html?ns_mchannel=rssns_campaign=1490ito=1490"}