{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:22:26", "date_modify": "None", "date_publish": "2023-12-25 16:00:46", "description": "The streets are usually thronged with tourists and pilgrims but this year the town is mourning the dead of the Gaza war", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F25%2Fno-room-for-the-people-of-gaza-the-persecution-mirrors-that-of-jesus-birth-says-popes-patriarch.json", "image_url": "https://i.guim.co.uk/img/media/1129fce90c9616485818965e95242dfd59f8d614/421_508_4468_2681/master/4468.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1d02fec484afab87f3e04872a7fd0177", "language": "en", "localpath": null, "maintext": "In the days leading up to Christmas, Cardinal Pierbattista Pizzaballa, the Latin Patriarch of Jerusalem, said that one particular Bible verse kept running through his mind.\n“When Mary and Joseph arrived in Bethlehem she gave birth to the Lord in a manger because ‘there was no room for them’,” he told about 5,000 people during the Christmas Eve midnight mass service in the Palestinian town where Christians believe Jesus was born.\n“There was no room for them,” he repeated, quoting from the book of Luke. “It seems this year there is no room for the people of Gaza … Even though their suffering ceaselessly cries out to the whole world.”\nChristmas celebrations have been cancelled across the Holy Land this year as the region mourns the estimated 20,000 Palestinians killed in the current war between Israel and Hamas.\nOn Sunday night the streets of Bethlehem, in the occupied West Bank, should have thronged with pilgrims and tourists accompanied by Christmas music. This Christmas Eve every shop and restaurant was closed.\nManger Square, next to the church of the Nativity, which was built on the spot where Jesus is believed to have been born, was grey and sad without decorations. For the first time in living memory there was no traditional Christmas tree at its centre.\nCelebrations in Bethlehem usually culminate with a parade and Catholic midnight mass on Christmas Eve at the church of St Catherine. Spaces are usually filled months in advance, but attendance was expected to be so low this year that the Franciscan order, which assigns tickets and deals with security for the event, scrapped the usual protocols. Instead, the prayer service was open to everyone.\nAfter a silent parade as the bishops and patriarchs of Jerusalem arrived in the city for the service, the pews were unexpectedly full inside the church. Palestinians of various faiths, and from many different areas, had traversed Israeli checkpoints to go to Bethlehem and pay their respects to Gaza’s dead, and pray for the safety of the living.\nSome wore the black and white keffiyeh associated with Palestine. The atmosphere was hushed and sad.\nBefore the latest war broke out after the attack by Hamas on 7 October which killed 1,140 people, there were about 1,300 people in Gaza’s tiny Christian community. Now that number is believed to be closer to 800.\nThe Catholic Holy Family church, in Gaza City, became a makeshift shelter but it has been repeatedly hit by Israeli airstrikes.\nLast week Pizzaballa said the Israeli army had placed the church under siege, and shot and killed two Christian women. Pope Francis condemned the attack, which the Israel Defense Forces denied knowledge of.\nThe pope also devoted his Christmas Day blessing in St Peter’s Basilica, in the Vatican, to a call for peace in the world, noting that the biblical story of the birth of Christ in Bethlehem sent a message of peace – but that Bethlehem “is a place of sorrow and silence” this year.\nAt the Christmas Eve service in St Catherine’s, Pizzaballa told the congregation that every December he sought permission from the Israeli authorities for a pastoral visit to Gaza. He reflected on the community’s resilience and patience.\n“We won’t abandon you,” he said, addressing people in the Gaza Strip, who are facing a Christmas unlike any other.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Sorrow and silence’ in Bethlehem as Christmas festivities are cancelled", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/25/no-room-for-the-people-of-gaza-the-persecution-mirrors-that-of-jesus-birth-says-popes-patriarch"}