{"authors": ["Adam Cailler", "Image", "Pool Afp Via Getty Images", "Ap"], "date_download": "2024-02-05 15:22:26", "date_modify": "None", "date_publish": "2023-12-25 20:59:27", "description": "Although Russia and President Vladimir Putin does not celebrate Christmas at the same time as the rest of the world, Putin has been labelled as having a 'habit' of ruining the festive day", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fworld-news%2Fwar-mad-vlad-putin-often-31748710.json", "image_url": "https://i2-prod.dailystar.co.uk/incoming/article31748712.ece/ALTERNATES/s1200/1_Vladimir-Putin.jpg", "language": "en", "localpath": null, "maintext": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSomething went wrong, please try again later.\nRussian President Vladimir Putin has been labelled a Grinch after one of his enemies claimed he has a “habit of ruining Christmas ”.\nDespite the fact that Russian doesn't celebrate Christmas with the rest of the world, Putin was given the honour by an Estonian member of the European Parliament.\nFormer head of the Estonian Defense Forces and sitting Member of the European Parliament, Riho Terras said when talking about Ukraine. \"Ukraine's forces are running low. And they are also running out of equipment and weapons. And Russia doesn't have that much either, but they can now rally for this particular Christmas offensive. You can see it happening. Russian President Vladimir Putin often has a habit of ruining Christmas.”\nREAD MORE: UK Christmas Covid chaos as NHS nurses demand Britain 'masks up' again\nWant more news? Click here.\n(Image: POOL/AFP via Getty Images)\nTerras was referencing Putin's increased offensive of his invasion into Ukraine last Christmas, and he was rumoured to have been pondering similar moves over this Christmas period, too.\nAlthough it hasn't quite happened yet, Putin could launch even more aggression in just a few days time as many in Ukraine decided to break with Russian tradition and celebrated Christmas today, rather than do it the Russian Orthodox way in January.\nBut any increased action by Russia could see even more support from Ukraine. Terras went on: “I believe that political circles understand that Ukraine needs to be supported militarily. If the front were to fall apart and the Russians were to take something big back, it would send a bad message to the whole world.\n(Image: AP)\n“That, actually, the strongest military alliance in the world, together with like-minded countries around the world, cannot stand up to autocratic states. I do not think it will go that far, but of course, the threat is there, and that is why we have to fully commit.”\nUkraine's leaders proposed a new plan to call up more than 500k new soldiers to the armed forces, but the plan has not yet been given government approval.\nFor the latest breaking news from the Royal Family and stories from the Daily Star, sign up for our newsletter by clicking here.", "source_domain": "www.dailystar.co.uk", "text": null, "title": "War mad Vlad Putin 'often has a habit of ruining Christmas,' rages enemy leader", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/world-news/war-mad-vlad-putin-often-31748710"}