{"authors": ["Oli Smith"], "date_download": "2024-02-05 15:22:28", "date_modify": "None", "date_publish": "2023-12-24 22:11:00", "description": "An entire Russian military unit vented their anger at 'lies' from the country's chaotic leadership in a rare outburst caught on camera.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1848932%2Fvladimir-putin-russia-military-army-revolt-ukraine.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5130711.jpg", "language": "en", "localpath": null, "maintext": "Russian ammunition base hit by Ukraine with huge blast\nThe furious reaction of Russian soldiers was filmed just moments after they were told that they were being reassigned from Territorial Defences to \"stormtroopers\" in the Ukraine war. In the video, several Russian troops raged at the betrayal, with three of them speaking directly to the camera. One soldier said they \"were lied to\" by their commanders, as another added the military would \"sell them out in Ukraine\". The social media account Visegrad 24 tweeted the video, which was posted on Telegram, adding: \"A Russian military unit is upset with its commanders after having been reclassified from territorial defense into stormtroopers They say that they haven’t even been able to practice shooting for weeks, and now suddenly they are to storm Ukrainian trenches.\" READ MORE: Tell us if you are worried about Vladimir Putin declaring World War 3\nSeveral Russian troops raged at the betrayal, with three of them speaking directly to the camera\nThe soldier in the video tells the camera: \"We have been here since the 26th of November. Our officers lied to our faces that we are Territorial Defences. \"The Lt. Colonel just came out and said we are now a motor rifle unit. We are stormtroopers! We're stormtroopers now - not Territorial Defences.\"\nSoldiers were being reassigned from Territorial Defences to 'stormtroopers' in Ukraine\nHe added: \"They just told us! They lied to us! We haven't held guns for two weeks. We went to the shooting range to throw grenades, but they had run out of them.\" Another soldier chimed in: \"They didn't even have a bus for us, we had to walk 10km from here to there.\" A third soldier tells the camera: \"How the f*** are we meant to fight under these officers? They will sell us out in Ukraine. F*******!\"\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nAnger towards Vladimir Putin and the chaotic Russian military leadership is growing among the troops\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Putin rocked by troop revolt as entire Russian military unit rage at Ukraine war 'lies'", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1848932/vladimir-putin-russia-military-army-revolt-ukraine"}