{"authors": ["Oli Smith"], "date_download": "2024-02-05 15:22:28", "date_modify": "None", "date_publish": "2023-12-24 23:00:00", "description": "Turkish leader Recep Tayyip Erdogan launched a blitz across northern Iraq and Syria, as the volatile Middle East continues to erupt in violence.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1848946%2FTurkey-Iraq-Syria-Middle-East-Gaza.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5130775.jpg", "language": "en", "localpath": null, "maintext": "President Erdogan threatens to get involved in Israel war\nIsrael's war in Gaza continues to dominate the headlines, while Houthi-controlled areas in Yemen have disrupted world trade for weeks with attacks on ships in the Red Sea. However, another conflict is brewing in the Middle East, as long-standing tensions between Kurdish militants and Turkey boil over into air strikes and gunfights. The violence first erupted on Thursday when soldiers from the Kurdistan Workers Party (PKK) killed 12 Turkish soldiers stationed at bases in Iraq. The PKK troops released footage of the stunning ambush, which shows the Kurdish forces trekking through snowy landscapes before firing on Turkish army bases. Turkey was swift to retaliate, with a series of air strikes bombarding nearly 30 PKK targets in Syria and northern Iraq on Saturday. READ MORE: Latest snow maps show 14-day Polar blast hitting hours after Christmas\nThe PKK troops released footage of the ambush\nThe Turkish defence ministry said the targets included bases, shelters, and oil facilities believed to be used by PKK militants. The military also claims to have killed at least 16 PKK militants and wounded 14 more in ongoing face-to-face clashes. Referencing the PKK's Syrian-based sister group, the People's Protection Units (YPG), the Turkish defence ministry said: \"Wherever it is, our fight against the terrorist organisation PKK/YPG will continue until the last terrorist is neutralised!\" Turkey says the airstrikes were simply “self-defense” to end “terrorist attacks” and secure its borders. The PKK rebuked Turkey, and said that only four of their members were killed.\nLong-standing tensions between Kurdish militants and Turkey spill over into air strikes\nThey accused Turkey of \"lies\" and of trying to \"present their defeat to the Turkish public in a different way\". The PKK had attacked Turkish bases which had been set up in Kurdish-majority northern Iraq as part of its efforts to fight the Kurdish group, who are designated a terrorist organisation by Turkey, the EU and US. The PKK have fought a long-standing guerrilla war with Turkey since 1984, leading to more than 40,000 killed and human rights abuses on both sides. The YPG in Syria called the airstrikes \"unjustified\" and complained that they would hinder its fight against ISIS militants in the region.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending\nThe Turkish defence ministry said the targets included bases, shelters, and oil facilities", "source_domain": "www.express.co.uk", "text": null, "title": "Another bloody Middle East conflict breaks out as Turkey bombards Iraq and Syria", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1848946/Turkey-Iraq-Syria-Middle-East-Gaza"}