{"authors": [], "date_download": "2024-02-05 15:22:29", "date_modify": "None", "date_publish": "2023-12-24 10:39:28", "description": "Rescue officials in Gaza say an Israeli airstrike killed 76 members of an extended family", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-hamas-israeli-united-states-b2468740.html.json", "image_url": "https://static.independent.co.uk/2023/12/23/09/Israel_Palestinians_82510.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAn Israeli airstrike killed 76 members of an extended family, rescue officials said Saturday, a day after the U.N. chief warned again that nowhere is safe in Gaza and that Israel's ongoing offensive is creating “massive obstacles” to the distribution of humanitarian aid.\nFriday's strike on a building in Gaza City was among the deadliest of the Israel-Hamas war, now in its 12th week, said Mahmoud Bassal, a spokesman for Gaza's Civil Defense department. He provided a partial list of the names of those killed — 16 heads of households from the al-Mughrabi family — and said the dead included women and children.\nAmong the dead were Issam al-Mughrabi, a veteran employee of U.N. Development Program, his wife, and their five children.\n“The loss of Issam and his family has deeply affected us all. The U.N. and civilians in Gaza are not a target,” said Achim Steiner, the head of the agency. “This war must end.”\nIsrael declared war after Hamas militants stormed across the border on Oct. 7, killing some 1,200 people and taking some 240 hostages. Israel has vowed to keep up the fight until Hamas is destroyed and removed from power in Gaza and all the hostages are freed.\nMore than 20,000 Palestinians have been killed in Israel's war to destroy Hamas and more than 53,000 have been wounded, according to health officials in Gaza, a besieged territory ruled by the Islamic militant group for the past 16 years.\nIsrael blames Hamas for the high civilian death toll, citing the group’s use of crowded residential areas for military purposes and its tunnels under urban areas. It has unleashed thousands of airstrikes since Oct. 7, and has largely refrained from commenting on specific attacks, including discussing the intended target.\nOn Friday, the U.N. Security Council adopted a watered-down resolution that calls for immediately speeding up aid deliveries to desperate civilians in Gaza.\nThe United States won the removal of a tougher call for an “urgent suspension of hostilities” between Israel and Hamas. It abstained in the vote, as did Russia, which wanted the stronger language. The resolution was the first on the war to make it through the council after the U.S. vetoed two earlier ones calling for humanitarian pauses and a full cease-fire.\nU.N. Secretary-General Antonio Guterres reiterated his longstanding call for a humanitarian cease-fire. He expressed hope that Friday’s resolution may help this happen but said “much more is needed immediately” to end the ongoing “nightmare” for the people in Gaza.\nHe told a news conference that it's a mistake to measure the effectiveness of the humanitarian operation in Gaza by the number of trucks.\n“The real problem is that the way Israel is conducting this offensive is creating massive obstacles to the distribution of humanitarian aid inside Gaza,” he said. He said the prerequisites for an effective aid operation don’t exist — security, staff that can work in safety, logistical capacity especially trucks, and the resumption of commercial activity.\nIsrael’s aerial and ground offensive has been one of the most devastating military campaigns in recent history, displacing nearly 85% of Gaza’s 2.3 million people and leveling wide swaths of the tiny coastal enclave. More than half a million people in Gaza — a quarter of the population — are starving, according to a report this week from the United Nations and other agencies.\nShielded by the Biden administration, Israel has so far resisted international pressure to scale back. The military spokesman, Rear Adm. Daniel Hagari, said late Friday that forces are widening the ground offensive “to additional areas of the strip, with a focus on the south.” He said operations were also continuing in the northern half of Gaza, including Gaza City, the initial focus of Israel's ground offensive.\nThe army said Saturday that it carried out airstrikes against Hamas fighters in several locations of Gaza City. The military says it has killed thousands of Hamas militants, including about 2,000 in the past three weeks, but it has not presented any evidence to back up the claim. It says 139 of its soldiers have been killed in the ground offensive.\nIn the aftermath of the U.N. resolution, it was not immediately clear how and when aid deliveries would accelerate. Currently, trucks enter through two crossings — Rafah on the border with Egypt and Kerem Shalom on the border with Israel.\nAs part of the approved resolution, the U.S. negotiated the removal of language that would have given the U.N. authority to inspect aid going into Gaza, something Israel says it must continue to do to ensure material does not reach Hamas.\nIsrael’s ambassador to the U.N., Gilad Erdan, thanked the U.S. for its support and sharply criticized the U.N. for its failure to condemn Hamas’ Oct. 7 attacks. The U.S. vetoed a resolution in October that would have included a condemnation because it didn’t also underline Israel’s right to self-defense.\nHamas said in a statement that the U.N. resolution should have demanded an immediate halt to Israel’s offensive, and it blamed the United States for pushing “to empty the resolution of its essence” before Friday’s Security Council vote.\n___\nMagdy reported from Cairo. Associated Press writer Edith M. Lederer at the United Nations contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israeli strike kills 76 members in one Gaza family, rescue officials say as combat expands in south", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-hamas-israeli-united-states-b2468740.html"}