{"authors": ["Isabelle Hajek"], "date_download": "2024-02-05 15:15:04", "date_modify": "None", "date_publish": "2024-01-29 22:53:21", "description": "THREE soldiers who were killed in a surprise aerial drone attack in Jordan have been identified by the Pentagon following the tragedy.Sgt. William Jer", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25590123%2Fpentagon-soldiers-jordan-killed-drones-middle-east-conflict%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/lb-soldiers-killed-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "THREE soldiers who were killed in a surprise aerial drone attack in Jordan have been identified by the Pentagon following the tragedy.\nSgt. William Jerome Rivers, 46; Spc. Kennedy Ladon Sanders, 24; and Spc. Breonna Alexsondria Moffett, 23, died on January 28.\n3 Sgt. William Jerome Rivers, Spc. Breonna Alexsondria Moffett, and Spc. Kennedy Ladon Sanders were killed in an aerial drone strike while on base in Jordan Credit: Reuters\n3 The soldiers' deaths mark the first American servicemen casualties recorded since the Israel-Palestine conflict began in October Credit: AFP\n3 The outpost where the attack occurred is named Tower 22 and 350 servicemen are currently stationed there Credit: U.S. Sun\nTheir deaths mark the first time American troops have been killed by enemy fire in the Middle East since the beginning of the Israel-Palestine conflict, which began in October.\nBetween the three, they held a total of 18 medals and commendations for their service while working as engineers for the military.\nThe soldiers were killed on Sunday by \"radical Iran-backed militant groups\" at a small US outpost in northeast Jordan, the Department of Defense said in a press release.\nThe Pentagon said the soldiers died when \"a one-way unmanned aerial system (OWUAS) impacted their container housing units.\"\nPentagon deputy press secretary Sabrina Singh told reporters on Monday that an Iranian Islamic Revolutionary Guard Corps-backed militia was to blame for the attacks.\nPrevious military intel suggested that the group works out of Syria and Iraq.\nPresident Joe Biden said the US will \"respond\" and \"hold all those responsible to account at a time and in a manner of our choosing.\"\n\"Three US service members were killed - and many wounded - during an unmanned aerial drone attack on our forces stationed in northeast Jordan near the Syria border,\" he said on Sunday.\n\"While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq.\"\nThe president called the three American service members killed \"patriots in the highest sense\" as he vowed to hold those responsible for their deaths accountable.\n\"We will carry on their commitment to fight terrorism,\" he added.\n\"And have no doubt - we will hold all those responsible to account at a time and in a manner our choosing.\"\nThe outpost where the attack occurred is named Tower 22 and 350 servicemen are currently stationed there.\nOfficials initially said that 34 people had been injured but it emerged on Monday that 40 were wounded.\nEight of the injured were evacuated with some in critical condition but all were later said to be medically stable.\n'PEOPLE WERE ACTUALLY IN THEIR BEDS'\nSingh went on to say that this attack was unlike others as it occurred during the \"pretty early morning,\" when personnel were still asleep.\n\"People were actually in their beds when the drone impacted,\" Singh said.\nOfficials have identified the drone to be a \"type of Shahed drone.\"\nThese style drones have recently also been supplied to Russia by Iran.\nIran's foreign ministry spokesperson, Nasser Kanaani, said claims that Iran was involved in the attack were \"baseless.\"\nKanaani said that \"resistance groups\" do not take orders from the Islamic Republic.\nIran's Mission to the US issued a statement, insisting, \"Iran had no connection and had nothing to do with the attack on the US base.\n\"There is a conflict between US forces and resistance groups in the region, which reciprocate retaliatory attacks.\"\nIran-backed fighters in east Syria have started evacuating their posts, fearing US airstrikes, according to Omar Abu Layla, a Europe-based activist who heads the Deir Ezzor 24 media outlet.\nGeorgia Governor Brian Kemp issued a statement via X, formerly Twitter, on Monday, mourning the three service members.\n\"Marty, the girls, and I are saddened to learn of the deaths of three service members based out of Georgia. These Soldiers gave the last full measure of devotion in service to this country,\" he began.\n\"This inexcusable loss of life and the attack from terrorists that resulted in these casualties is a reminder of why we stand with the friends of liberty.\n\"The entire Kemp family asks that Georgians everywhere join us in keeping the loved ones of those lost in this attack in our thoughts and prayers in the days ahead.\"\nGeneral Michael Erik Kurilla, the Commander of the US Central Command, shared a tribute as well.\n\"We are deeply saddened by the loss of our three Army Soldiers who made the ultimate sacrifice while serving their country in Jordan. Our prayers are with these loyal and courageous Soldiers’ families, friends, and the entire 718th Engineer Company - we honor their selfless service and dedication to duty,\" read the X post.", "source_domain": "www.thesun.co.uk", "text": null, "title": "Three US soldiers killed in Jordan drone attack pictured by Pentagon after early morning raid struck as they slept", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25590123/pentagon-soldiers-jordan-killed-drones-middle-east-conflict/"}