{"authors": ["Charles Harrison"], "date_download": "2024-02-05 15:22:30", "date_modify": "None", "date_publish": "2023-12-24 16:34:00", "description": "Iran is reportedly threatening to shut down a major shipping route entirely if Israel does not ease its siege of Gaza.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1848890%2Findia-tanker-iran-attack-houthi-israel-warning-strait-gibraltar.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5130579.jpg", "language": "en", "localpath": null, "maintext": "Indian Ocean: Vessel struck by unclaimed done attack\nA chemical tanker in the Indian Ocean was struck by a drone launched by Iran, according to the US Department of Defense. A Pentagon spokesperson has said a boat called CHEM PLUTO was hit at around 6am UK time in a “one-way attack drone fired from Iran”. It was 200 nautical miles from the coast of India at the time of the incident. Nobody was hurt in the attack, the US government deparment said. The Pentagon says it was the seventh attack launched by Iran on commercial shipping since 2021, and follows a warning from Foreign Secretary Lord David Cameron that Iran represented a “danger” to the world.\nREAD MORE Britain plans to bomb Iranian-backed rebels threatening world economy\nThe attacked vessel was “Israel-affiliated”, according to Hereford-based global maritime risk firm Ambrey. It comes as vessels off the coast of Yemen are facing an increasing number of threats from the Hamas-affiliated Yemeni rebel group, the Houthis. The group say their attacks are aimed at Israel-linked ships in support of Gaza as it is besieged by Israel. Another incident took place in the Red Sea on Saturday, the United Kingdom Maritime Trade Operations (UKMTO) agency confirmed. Approximately 50 nautical miles west of Hodeidah, Yemen, multiple reports say drones flew low above a vessel before exploding around 1.5 nautical miles from the ship.\nThe MV Chem Pluto which was struck by what is reportedly an Iranian drone\nVessels were advised to transit with caution, the agency said in a statement. Iran has threatened to close the Strait of Gibraltar and the Mediterranean Sea unless Israel stops bombing Gaza. Brigadier General Mohammad Reza Naqdi, a senior member of the country’s Islamic Revolutionary Guard Corps said: “They shall soon await the closure of the Mediterranean Sea, [the Strait of] Gibraltar and other waterways.” He did not say how Iran intended to achieve this. While Iran does not border the Mediterranean, it’s proxy militias in southern Lebanon and Syria do have access to the sea, through which about a fifth of global maritime trade passes. Several major shipping companies have already been forced to reroute their vessels to avoid the Red Sea.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial", "source_domain": "www.express.co.uk", "text": null, "title": "Tensions threaten to explode as 'Iranian drone' attacks chemical tanker in Indian Ocean", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1848890/india-tanker-iran-attack-houthi-israel-warning-strait-gibraltar"}