{"authors": ["Ashley Nickel", "Ashley Nickel For Daily Mail Australia"], "date_download": "2024-02-05 15:22:31", "date_modify": "None", "date_publish": "2023-12-24 04:51:30", "description": "The ABC's Perth office came under attack in the early hours of Sunday after pro-Palestine presenter Antoinette Lattouf was fired by the broadcaster.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12897711%2FABC-Perth-vandalised-Antoinette-Lattouf-pro-Palestine.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/24/04/79296975-0-image-m-19_1703391069905.jpg", "language": "en", "localpath": null, "maintext": "READ MORE: Antoinette Lattouf is suing the ABC for unfair dismissal\nABC Radio's Perth office has been vandalised by a pro-Palestine supporter after Antoinette Lattouf was axed from ABC Sydney Mornings.\nLattouf was dismissed as the ABC's temporary presenter in Sydney on Wednesday over a series of social media posts criticising the Israeli Defence Forces.\nIn her posts, Lattouf questioned the legitimacy of footage filmed at a pro-Palestine rally in front of the Sydney Opera House where people were heard chanting 'gas the Jews' and accused the IDF of rape during raids of the Gaza Strip.\nA flood of complaints from the ABC's Jewish listeners reached chairwoman Ita Buttrose, leading to Lattouf being fired.\nIn the early hours of Sunday morning, a protester accused the ABC of 'censorship' and called the reason for Lattouf's termination 'an affront to the very idea of journalistic integrity'.\nAntoinette Lattouf (above) was fired from the ABC for sharing numerous posts criticising the Israeli Defense Forces online\nFootage sent to The Australian showed a vandal wearing a white headscarf spray-painting over the ABC Radio logo at the broadcaster's Fielder Street office.\n'Boycott - justice for Antoinette,' they wrote.\nThe protester then wrote 'free Palestine' on the building's next window.\n'Direct action was taken against the ABC Radio office in Boorloo/Perth to protest [the] unjust firing of Antoinette Lattouf over her factual reporting of the Israeli genocide against the people of Palestine,' a message alongside the clip read.\n'This act of censorship by the ABC management is an affront to the very idea of journalistic integrity.\n'While the ABC cower in the face of external pressure, 100 journalists have been killed while reporting on the genocide being committed by the state of Israel.'\nIt follows a similar graffiti protest at the ABC's Melbourne Headquarters on Friday.\nThe protest has no yet been reported to Western Australia Police.\nA pro-Palestine protester filmed themself vandalising the ABC's Perth office (above), writing 'boycott - justice for Antoinette'\nThe vandalism (above) which accused the broadcaster of 'censorship' was not reported to police\nOn Thursday Lattouf shared she was 'disappointed' in the ABC and believes she was 'terminated unlawfully'.\n'This is not a win for journalism or critical, fair thinking,' she said.\nLattouf has since lodged an application with Fair Work.\nLattouf had been filling in for Sarah Macdonald as host of the ABC Sydney Mornings radio program last week but was told on Wednesday she was no longer needed for her shifts on Thursday and Friday.\n'ABC Sydney casual presenter Antoinette Lattouf will not be back on air for her remaining two shifts this week,' an ABC spokesperson told Daily Mail Australia.\nHer submission to the Fair Work Commission alleges she was fired after sharing an Instagram post from Human Rights Watch, which breached the ABC's policies.\nIt also alleges ABC Managing Director David Anderson had made the decision to terminate Lattouf's position at the national broadcaster.\nDaily Mail Australia contacted the ABC for comment.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Shock development after ABC star Antoinette Lattouf was dumped from the airwaves just days into her new job", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12897711/ABC-Perth-vandalised-Antoinette-Lattouf-pro-Palestine.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}