{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:22:32", "date_modify": "None", "date_publish": "2023-12-24 20:47:55", "description": "Worries mount for desperate civilians as Israel expands its operations in the southern half of territory", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F24%2Fisrael-gaza-deadly-fighting-kills-scores-palestinians.json", "image_url": "https://i.guim.co.uk/img/media/d5cb3cc143ee77ad5c8592152217cfaec0a2d6cd/0_149_4465_2679/master/4465.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=96556f8d677cfd8302f9adec764ac0f9", "language": "en", "localpath": null, "maintext": "Fierce fighting across the besieged Gaza Strip over the past 24 hours has killed 166 Palestinians and 13 Israeli soldiers, in one of the single deadliest days of the new conflict between Israel and the militant group Hamas to date.\nHeavy bombing and shelling of Jabaliya, in the north of the Palestinian territory, overnight continued into Sunday morning, residents of the area said, while in Gaza City, the Israel Defense Forces (IDF) have begun a ground operation in the central neighbourhood of Tufah. In the southern half of the strip, aerial and ground attacks continue in the territory’s second city, Khan Younis.\nAt least 166 people had been killed since Saturday, the health ministry in the Hamas-run territory said, bringing the total number of dead to 20,424, although thousands more are believed to be buried under the rubble. The ministry does not distinguish between civilian and militant deaths, but about 70% of those killed are believed to be women and children.\nThis figure did not include the toll of at least 70 killed late on Sunday night following an Israeli airstrike that hit central Gaza’s Maghazi refugee camp. Palestinian authorities said the number of casualties was likely to climb.\nThe Palestine Red Crescent Society reported an attack on one of its main bases in Khan Younis and said a 13-year-old child had been shot dead by an Israeli drone while inside the city’s al-Amal hospital. Another six people were killed in a strike on a house in the central Bureij refugee camp and two in a strike in Rafah, the strip’s southernmost town, on the border with Egypt, the agency said.\nOn Sunday morning the IDF announced the names of eight soldiers who were killed on top of another five announced killed in action on Saturday night, bringing the total to 154 combat losses since Israel declared war in response to Hamas’s 7 October attack on Israel in which militants killed 1,140 people and seized another 240 as hostages.\nOn Sunday, the Israeli prime minister, Benjamin Netanyahu, said: “The war is exacting a very heavy cost from us; however we have no choice [but] to continue to fight.” At least some of the weekend’s Israeli casualties were killed in friendly fire incidents, two Israeli newspapers reported.\nAlso on Sunday, an Israeli military spokesperson said its forces had killed 8,000 Palestinian fighters, saying that the figure was drawn from accounts of targeted strikes, battlefield tallies and interrogations of captives. Hamas has never said how many of its members have been killed.\n00:01:24 Footage captures widespread destruction in the streets of Khan Younis – video\nThe mounting death tolls come despite Israeli claims that after 12 weeks of conflict it has achieved almost complete operational control over northern Gaza, and growing worries for desperate civilians in the south as Israel expands its operations into that half of the territory. Almost all of the strip’s 2.3 million residents have already sought shelter south of the Gaza River after being told by the Israeli army it would be safer.\nJoudat Imad, 55, a father of six, had to leave an area of the Nuseirat refugee camp in central Gaza on Sunday. He had taken his family there from Gaza City after a map published by the IDF marked it as an evacuation zone.\n“I was lucky to get a tent in Rafah,” he told Reuters by phone. “From an owner of two buildings to a refugee in a tent awaiting aid – that is what this brutal war has turned us to. The world is sick and inhumane that it can’t see Israel’s brutality and it is helpless to stop this war of destruction and starvation.”\nConditions across Gaza are dire. The World Food Programme’s (WFP) most recent food security update said the situation is worst in the north, where 90% of people have gone a full day and night without eating. Clean water, electricity and access to medical treatment are also hard to find, with aid agencies warning that an increase in aid since 17 December is a fraction of what is needed for the population to survive the winter. Aid that gets in, the WFP said, is difficult to distribute because of the fighting and lack of fuel and usable roads.\nAfter days of objections from the US, Israel’s most important ally, the UN security council managed to pass a resolution on Friday which urges steps to allow “safe, unhindered, and expanded humanitarian access” to Gaza and “conditions for a sustainable cessation” of fighting. Washington eventually abstained from the vote, contending it would let Iran-backed Hamas regroup and rearm.\nEfforts mediated by Qatar aimed at brokering a second ceasefire and round of hostage exchanges, after a first at the end of November saw about 100 Israelis released in return for 240 Palestinian women and children in Israeli jails, appear to have faltered, with Israeli officials turning to the Egyptian channel in search of progress. A number of Hamas leaders who live outside Gaza travelled last week to Cairo, a positive sign that indirect talks were held.\nJoe Biden discussed the Israeli campaign in Gaza in a 45-minute phone call with Netanyahu on Saturday night, a statement from the White House said.\nThe US president “emphasised the critical need to protect the civilian population including those supporting the humanitarian aid operation, and the importance of allowing civilians to move safely away from areas of ongoing fighting”, as well as “the importance of securing the release of all remaining hostages,” his office said.\nDespite growing international outcry over the humanitarian disaster in Gaza, including growing criticism in Washington, Netanyahu has repeatedly said that Israel will push on until “complete victory” over Hamas is achieved. US officials have urged their Israeli counterparts to shift away from large-scale aerial and ground operations in the Gaza Strip to a new phrase in the war focused on the precise targeting of Hamas leaders, but have also stressed that they will not “dictate timelines or terms”.\nThe IDF’s main focus now appears to be finding and destroying Hamas’s extensive network of tunnels in the Gaza Strip, which high-ranking officers have admitted has proved to be far more difficult than anticipated. Generals have estimated that the army will need at least several more weeks to fulfil that goal.\nMeanwhile, the situation on Israel’s northern border with Lebanon, where it has been engaged in cross-border attacks with the powerful Iran-backed militia Hezbollah since 7 October, remains volatile; behind the scenes, the US is leading intense negotiations to try to de-escalate tensions that could spark a regional war.\nIn the Red Sea, Yemen’s Houthi rebels, also aligned with Iran, have disrupted global trade with missile and drone attacks on international vessels, ostensibly in solidarity with the Palestinian people. A drone the US defence department said it believed was launched from Iran also struck a chemical tanker in the Indian Ocean on Saturday.\nIn comments made at his weekly cabinet meeting on Sunday, Netanyahu denied reports that Biden had persuaded him not to launch a pre-emptive attack on Hezbollah during the first days of the war.\n“Israel is a sovereign state,” Netanyahu said. “Our decisions in the war are based on our operational considerations, and I will not elaborate on that.”", "source_domain": "www.theguardian.com", "text": null, "title": "Deadly 24 hours of fighting across Gaza Strip kills scores of Palestinians", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/24/israel-gaza-deadly-fighting-kills-scores-palestinians"}