{"authors": ["City A.M. Reporter"], "date_download": "2024-02-05 15:22:33", "date_modify": "None", "date_publish": "2023-12-24 14:56:45", "description": "Israel bombed areas of Jabalia in the northern Gaza Strip overnight, with fighting throughout Sunday morning, residents and Palestinian media said, as Gaza health authorities and the Israeli military both announced mounting death tolls.", "filename": "https%3A%2F%2Fwww.cityam.com%2Fisrael-bombs-northern-gaza-palestinians-say-166-killed-in-24-hours%2F.json", "image_url": "https://www.cityam.com/wp-content/uploads/2023/10/GettyImages-1732781550.jpg", "language": "en", "localpath": null, "maintext": "Israel bombs northern Gaza; Palestinians say 166 killed in 24 hours\nAn image of an Israeli strike targeting Gaza City (Getty images)\nIsrael bombed areas of Jabalia in the northern Gaza Strip overnight, with fighting throughout Sunday morning, residents and Palestinian media said, as Gaza health authorities and the Israeli military both announced mounting death tolls.\nIsrael says it has achieved almost complete operational control over northern Gaza and is preparing to expand a ground offensive against Hamas militants to other areas. But Jabalia residents reported persistent aerial bombardment and shelling from Israeli tanks, which they said had moved further into the town on Saturday.\nA Gaza health ministry spokesman said on Sunday 166 Palestinians had been killed in the past 24 hours, taking the total Palestinian death toll to 20,424. Tens of thousands have been wounded, with many bodies believed trapped under rubble. Almost all of Gaza’s 2.3 million people have been displaced.\nThe Israeli military said nine soldiers had been killed in the past day, bringing to 155 its published combat losses since it began its ground incursion in response to Hamas’ Oct. 7 rampage into Israel, in which militants killed 1,200 and took 240 hostages.\nThe daily toll was one of the highest for Israeli forces of the ground assault so far.\n“This is a difficult morning, after a very difficult day of fighting in Gaza,” Prime Minister Benjamin Netanyahu said at a cabinet meeting on Sunday. “The war is exacting a very heavy cost from us; however we have no choice (but) to continue to fight.”\nThe White House said on Saturday U.S. President Joe Biden and Netanyahu had discussed the Israeli campaign.\nBiden “emphasized the critical need to protect the civilian population including those supporting the humanitarian aid operation, and the importance of allowing civilians to move safely away from areas of ongoing fighting”, the White House said in a statement.\n“The leaders discussed the importance of securing the release of all remaining hostages,” the White House said.\nEgyptian and Qatari mediators have been trying to break the deadlock to end the violence. A delegation of the Palestinian Islamic Jihad group, which also has captives in custody in Gaza, arrived in Cairo for talks with Egyptian officials over “ways to end the Israeli aggression on our people in Gaza”, an official of the group told Reuters on Sunday.\nNetanyahu, speaking at a weekly cabinet meeting on Sunday, dismissed reports that the United States had convinced Israel not to expand its military campaign.\nThe Wall Street Journal reported on Saturday that Netanyahu was persuaded by Biden not to attack the militant Hezbollah group in neighbouring Lebanon out of concerns it would launch an attack on Israel.\n“Israel is a sovereign state,” Netanyahu said. “Our decisions in the war are based on our operational considerations, and I will not elaborate on that.”\nThe U.N. Security Council averted a threatened U.S. veto on Friday, after days of wrangling, by removing from a draft resolution a call for an immediate end to the war. The U.S. and Israel oppose a ceasefire, contending it would let Iran-backed Hamas regroup and rearm.\nWashington abstained from the final statement, which urges steps to allow “safe, unhindered, and expanded humanitarian access” to Gaza and “conditions for a sustainable cessation” of fighting.\n‘THE WORLD IS SICK AND INHUMANE’\nIsrael has long urged residents to leave northern areas of Gaza, but its forces have also been bombarding targets in central and southern parts of the enclave.\nSix Palestinians were killed and several wounded in an Israeli air strike on a house at the Bureij refugee camp, in the centre of the Gaza Strip, where the Israeli army ordered people to evacuate and head west towards Deir Al-Balah city, medics said.\nJoudat Imad, 55, a father-of-six, had to leave an area in the Nusseirat refugee camp in central Gaza after a map published by the army marked it as a place people had to evacuate.\n“I was lucky to get a tent in Rafah,” he told Reuters by phone. “From an owner of two buildings to a refugee in a tent awaiting aid – that is what this brutal war has turned us to. The world is sick and inhumane that it can’t see Israel’s brutality and it is helpless to stop this war of destruction and starvation.”\nIn Rafah, on Gaza’s southern border with Egypt, an Israeli air strike on a house killed two people, Palestinian medics said.\nThe Palestinian Red Crescent reported an attack on one of its main bases in Khan Younis in the southern Gaza Strip. It said a 13-year-old child had been shot dead by an Israeli drone while inside the Al-Amal Hospital.\nThe Israeli military has expressed regret for civilian deaths but blames Hamas for operating in densely populated areas or using civilians as human shields, an allegation the group denies.\n‘TOUGH BATTLE’\nYiftah Ron-Tal, a former commander of the Israeli ground forces, described the built-up Gaza battlefield as “the most complicated and fortified” in the world, requiring infantry, tanks, artillery and engineer corps.\n“…I think what’s happening now is a product of a tough battle in a condensed area and in this kind of battle, sadly, there are many losses,” he told army radio.\nThe conflict has spread, as Yemen’s Iran-aligned Houthi forces disrupt global trade with missile and drone attacks on vessels in the Red Sea in retaliation for Israel’s assault on Gaza.\nThe United States shot down four drones launched from Houthi-controlled areas of Yemen towards a U.S. destroyer in the southern Red Sea on Saturday, bringing to 15 the number of such attacks on commercial shipping, U.S. Central Command said.\nA drone launched from Iran struck a chemical tanker in the Indian Ocean on Saturday, the U.S. Defense Department said.\nAn Iranian Revolutionary Guards commander said the Mediterranean Sea could be closed if the United States and its allies kept committing “crimes” in Gaza, Iranian media reported, without elaborating.\nReuters – by Nidal al-Mughrabi and Emily Rose", "source_domain": "www.cityam.com", "text": null, "title": "Israel bombs northern Gaza; Palestinians say 166 killed in 24 hours", "title_page": null, "title_rss": null, "url": "https://www.cityam.com/israel-bombs-northern-gaza-palestinians-say-166-killed-in-24-hours/"}