{"authors": ["Ruth Bashinsky", "Ruth Bashinsky For Dailymail.Com"], "date_download": "2024-02-05 15:22:35", "date_modify": "None", "date_publish": "2023-12-24 16:53:34", "description": "More than 200 Americans have moved to Israel since the barbaric Hamas attack on Israel on October 7. More than 2,600 across the globe have moved since the Hamas attack.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12898301%2FIsrael-immigrants-America-Hamas-war-antisemitism.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/24/15/79304321-0-image-m-20_1703430463594.jpg", "language": "en", "localpath": null, "maintext": "Aaron Gold, 26, moved from his home in Philadelphia to Israel on November 16 despite the crisis\nMore than 200 Americans have moved to Israel since the barbaric Hamas attack on Israel on October 7.\nAaron Gold, 26, was visiting friends in Israel when the war broke out. After returning to his home in Philadelphia he felt a strong desire to return to the Holy Land despite the ongoing war.\n'Hezbollah could attack now, they could attack in six months, they could attack in six years,' he told The Times of Israel. 'You can't plan it.'\nA product manager at Deloitte, Gold packed his bags and left the City of Brotherly Love heading to Israel. He said 'making aliyah' (moving to the Land of Israel that is one of basic principles of Zionism) has always been a dream.\nOn November 16 it became official.\nGold is one of the 218 Americans, as of December 24, that are part of the 2,662 who have moved to Israel after the October 7 attack when Palestinian militant extremist group slaughtered more than 1,200 people and 240 hostages, Israeli officials said.\nAaron Gold, 26, pictured with his mother at the airport. Gold was among one of 218 Americans who left the United States to move to Israel after the October 7 Hamas attack on Israel.\nProtestors gather in New York on December 18 for a pro-Palestine activist march as they participate in a Global Strike for Gaza to demand a ceasefire\nGroups gather holding Israeli flags as they are smile as they return back to their homeland\nThe highest numbers are from Russia at 1,635; followed by the United States at 218 Ukraine at 128, 116 people from France and 106 from Belarus.\nThe ministry said the numbers are smaller than the average in recent years. During the same period last year, there were 16,400 new immigrants that arrived in Israel, due mostly in part, to the war in Ukraine, and when political discord in Israel had already depressed immigration beyond the usual rate, as per the news outlet.\nYona and Mikhael Benichou were planning to move to Israel from their native France once their oldest son started university, but after October 7 they expedited their plans to immigrate.\nYona told the news outlet the events of October 7 was 'the straw that broke the camel's back,' and on October 31 they arrived in their new country.\nThe term used for new arrivals is called 'olim.'\nPeople gather at the airport holding up welcome signs and Israeli flags for the new arrivals\nAnother young man leaves his country to embark on a new life in Israel after the October 7 attack\nShe shared one disturbing event that occurred in their hometown of Marseilles before their exit when they were spit on by a group of rugby fans while walking down the street.\nThe family had been wearing items that showed that they were Jewish before the anti-Semitic attack.\nShe told the Jewish Telegraphic Agency, 'I was in total shock, I didn't know how to react. Lots of other people saw what happened but no one tried to help us.'\nYona added, 'the antisemites were always there. But after October 7, we felt like they have a platform to do whatever they like and that no one — and definitely not the French authorities — can stop them.'\nThe International Fellowship of Christians and Jews purchased flights for the Benichous family and donated $2,000 towards furnishings for the family's new home in the Israeli city of Beit Shemesh.\nSince October 7, the organization has help 317 people 'make aliyah.'\nThe new immigrants are known as 'olim.' The term is used for those Jews who move to Israel despite the uncertainty that lies ahead.\nThe group's president, Yael Eckstein told The Times of Israel that she anticipates more people moving to Israel once the war ends. There are also concerns about the spike in antisemitism.\nShe said she has seen an 'increase in the number of requests for information about the immigration process from countries where cases of antisemitic incidents have risen.'\nAnother non-profit organization called Nefesh B'Nefesh, also called Jewish Souls United, helps facilitate aliyah from the United States, Canada and the United Kingdom.\nSince the start of the war, the organization helped facilitate aliyah for 384 people from the United States and Canada.\nThe group's vice president of communications, Yael Katsman told JTA those individuals, who arrived in Israel had begun the process of relocating long before October 7 attack.\nEckstein and Katsman noted that there has been a 'vast surge' in interest since the October 7 attacks - marking an 'an unprecedented increase' of more than 100% in aliyah applications compared to the same time last year, the news outlet reported.\nThe dramatic increase, is due in part, they said to the increased 'commitment to building Israel' by Diaspora Jewry during 'difficult historic events.'\nThe Jewish Agency chairman Major General Reserve Doron Almog told The Jerusaleum Post last month that the agency expects one million olim (new immigrants) in Israel during the next few years.\nHe said, 'over the next few years, we anticipate a million new immigrants due to the increasing antisemitism in Jewish communities around the world.'\nLat month, the CEO of the Anti-Defamation League said in an appearance on MSNBC that anti-Semitism has increased by a staggering 388 percent since Hamas' barbaric assault on Israel that began on October 7\nThe ADL Center on Extremism said preliminary data showed 312 reported U.S. anti-Semitic incidents from Oct. 7 to Oct. 23, including harassment, vandalism and assault. Pictured: Pro-Palestine groups fill NYC's Grand Central Terminal\nThe 218 Americans who have moved to Israel comes as the country has seen a staggering rise in antisemitism.\nLat month, the CEO of the Anti-Defamation League said in an appearance on MSNBC that anti-Semitism has increased by a staggering 388 percent since Hamas' barbaric assault on Israel that began on October 7.\nJonathan Greenblatt, who is also the director of the advocacy group, told The Sunday Show that his group has seen attacks on everyday businesses that are run by Jewish people, in addition to attacks on individuals and places of worship.\n'I'm not talking about stores producing IDF [Israel Defense Forces] T-shirts; I'm talking about a coffee shop on Long Island, an ice cream parlor in the Bay Area, a restaurant in Chicago,' he said.\n'Antisemitism has been intensifying and increasing. We've seen it normalized, and from the far-right and from the hard left,' Greenblatt added.\nGreenblatt also raised the issue of the spate of anti-Semitic incidents that have taken place on campuses of Ivy-league colleges including Harvard and Cornell.\nThe ADL Center on Extremism said preliminary data showed 312 reported U.S. anti-Semitic incidents from Oct. 7 to Oct. 23, including harassment, vandalism and assault.\nAbout 190 of those were directly linked to the war between Israel and Hamas.\nAmong examples cited by ADL were alleged physical assault; violent online messages, especially on messaging platform Telegram; and rallies where 'ADL found explicit or strong implicit support for Hamas and/or violence against Jews in Israel.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Over 200 Americans move TO Israel since Hamas barbaric attack launched a war and wave of antisemitism", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12898301/Israel-immigrants-America-Hamas-war-antisemitism.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}