{"authors": ["Maya Yang", "Amy Walker", "Adam Fulton"], "date_download": "2024-02-05 15:22:37", "date_modify": "None", "date_publish": "2023-12-24 00:17:56", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F23%2Fisrael-gaza-hamas-war-latest-updates-un-security-council-resolution-us-live.json", "image_url": "https://i.guim.co.uk/img/media/968f4c2547155439836c13150d586840bc69d21d/0_267_4000_2399/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=b9eb1b0697bf8830c4ad4b9a19a2d391", "language": "en", "localpath": null, "maintext": "From 23 Dec 2023 18.49 CET UNRWA: 'People in Gaza are people. They are not pieces on a checkerboard' The director of UNRWA affairs, Thomas White, reiterated the absence of safety across the Gaza strip as more than 1.9 million Palestinians remain displaced as a result of Israel’s attacks. In a tweet on Saturday, White wrote: People in Gaza are people. They are not pieces on a checkerboard - many have already been displaced several times. The Israeli Army just orders people to move into areas where there are ongoing airstrikes. No place is safe, nowhere to go. People in #Gaza are People. They are not pieces on a checkerboard - many have already been displaced several times. The Israeli Army just orders people to move into areas where there are ongoing airstrikes. No place is safe, nowhere to go. @UNRWA — Thomas White (@TomWhiteGaza) December 23, 2023 White’s comments come as the number of Palestinians killed by Israeli strikes reach more than 20,200 since October 7. An additional 53,688 Palestinians have been injured by Israeli strikes, Gaza’s health ministry announced.\nUpdated at 22.40 CET\n24 Dec 2023 01.17 CET We’ll shut this blog now – it’s nearly 2.15 am in Gaza City and Tel Aviv. Our live coverage will continue later in the day.\n23 Dec 2023 00.53 CET Summary Here is where things stand: A shortage in fuel, power, medical supplies and health specialists as a result of Israel’s attacks across Gaza has left al-Ahli hospital’s emergency care and surgical services “paralyzed ”, the World Health Organization said. “Al Ahli is a shell of a hospital … There are no operating theaters any more due to the lack of fuel, power, medical supplies and health workers,” Richard Peeperkorn, the WHO’s Palestine representative, said.\nWater and sanitation services in Gaza are at the point of collapse, Unicef said on Saturday. Amid Israel’s deadly attacks across the strip, which have killed more than 20,000 Palestinians and displaced nearly 2 million survivors, Unicef said that the deteriorating humanitarian situation is raising the risk of large-scale disease outbreaks.\nThe US president Joe Biden spoke with the Israeli prime minister Benjamin Netanyahu on Saturday, the White House said. According to Netanyahu’s office, Netanyahu voiced appreciation towards the US for its stance at the UN security council. Netanyahu’s office also added that he “made clear that Israel will pursue the war until all of its objectives are fully met”.\nTwo Qatari Armed Forces aircraft carrying aid for Palestinians displaced by Israeli strikes in Gaza has headed to El Arish, Egypt. In an announcement on Saturday, Qatar’s foreign ministry said that the two aircraft carrying 33 tons of aid consisting of food and medical supplies are en route to Gaza.\n“We are not getting the humanitarian supplies that we need to cater and respond to a humanitarian crisis this size and this scale,” UNRWA spokesperson Juliette Touma has said. Speaking to CGTN, Touma added: “The more that we have these evacuation orders that the Israeli authorities continue to issue … we will see an exodus of people continue to search for safety, search for shelter.”\nThe director of UNRWA affairs, Thomas White, reiterated the absence of safety across the Gaza Strip as more than 1.9 million Palestinians remain displaced as a result of Israel’s attacks. In a tweet on Saturday, White wrote: “People in Gaza are people. They are not pieces on a checkerboard - many have already been displaced several times. The Israeli Army just orders people to move into areas where there are ongoing airstrikes. No place is safe, nowhere to go.”\nIn response to the UN security council’s passage of a resolution on Gaza aid delivery, Médecins Sans Frontières said that it “falls painfully short of what is required to address the crisis in Gaza”. In a series of tweets on Saturday, MSF said: “The watered-down resolution on #Gaza will not ensure the massive scale-up and rapid flow of humanitarian aid needed, as bombs continue to rain down on Palestinian civilians, force mass displacement, and deny access to vital medical care and humanitarian assistance.”\nUpdated at 01.04 CET\n23 Dec 2023 00.29 CET The White House has released a readout of US president Joe Biden’s call with Israeli prime minister Benjamin Netanyahu on Saturday: President Joseph R Biden Jr spoke today with prime minister Benjamin Netanyahu of Israel. The leaders discussed Israel’s military campaign in Gaza to include its objectives and phasing. The president emphasized the critical need to protect the civilian population including those supporting the humanitarian aid operation, and the importance of allowing civilians to move safely away from areas of ongoing fighting. The leaders discussed the importance of securing the release of all remaining hostages. They agreed to remain in regular consultation both directly and through their respective national security teams.\nUpdated at 01.02 CET\n23 Dec 2023 00.04 CET Hundreds of protesters marched in London on Saturday in calls for a boycott of Israeli-linked brands and a ceasefire in Gaza, where Israeli strikes have killed more than 20,000 Palestinians. The Guardian’s Geneva Abdul reports: Hundreds of people have marched along Oxford Street in London calling for an immediate ceasefire in Gaza and a boycott of “Israel-linked” brands, as traffic in the busy shopping district was brought to a standstill days before Christmas. “There can be no Christmas as usual while a genocide is happening,” the organisers and activist group Sisters Uncut wrote on social media on Saturday, calling for the boycott of brands including Puma, HP and Axa. “When we disrupt the flow of capital we strike at the heart of the brutal occupation. We will continue to shut it down in solidarity with the Palestinian people,” the group said, sharing videos of protesters armed with Palestinian flags and placards beneath Carnaby’s glittering decorations while chanting “shut it down” outside Puma. Protesters outside two Zara stores chanted “while you’re shopping, bombs are dropping” and “Zara, Zara, you can’t hide, stop supporting genocide” referring to Israel’s retaliatory campaign, which has killed more than 20,000 people in Gaza, according to the health ministry, most of them women and children. For the full story, click here: London protest calls for Gaza ceasefire and boycott of Israel-linked brands Read more\nUpdated at 01.02 CET\n23 Dec 2023 23.02 CET US residents are funding illegal Israeli settlements in the West Bank, along with paramilitary groups and Israel Defense Forces units currently operating in Gaza. The Guardian’s Jason Wilson reports: An Israeli crowdfunding platform, IsraelGives, has allowed US residents to donate millions of dollars since 7 October to causes including illegal West Bank settlements, paramilitary groups, and Israel Defense Forces (IDF) units currently operating in Gaza and the occupied West Bank. Legal experts say that some of these campaigns may be illegal under US tax law, but that this is rarely enforced on donors to Israeli causes. While contributions from wealthy US nonprofits or individuals to illegal settlements have been previously reported, IsraelGives’s established crowdfunding platform, attached to an international network of linked non-profits, may allow smaller donors in the US and beyond to claim tax deductions on funds sustaining war and settlement in the occupied territories. The revelations come amid an escalating humanitarian crisis caused by IDF attacks killing civilians in Gaza, and mounting campaigns in the US to enforce laws that should prevent US non-profits from funding illegal settlements. For the full story, click here: Revealed: how US residents are funding illegal settlements in the West Bank Read more\n23 Dec 2023 22.32 CET Fans attending a Celtics football game in Glasgow, Scotland, raised banners in a show of solidarity with Palestine on Saturday. Pictures posted on social media showed fans carrying banners that read “Many homes they are sad tonight”, “They whisper someone’s name by the candlelight” and “20,000+ killed – 8,000+ children”. Celtic fans once again showing support for Palestine.\n“Many homes they are sad tonight.\nThey whisper someone's name by the candlelight.\n20,000+ killed - 8,000+ children.” pic.twitter.com/NKEB7yuvNe — Leyla Hamed (@leylahamed) December 23, 2023 At a Celtic game today in Glasgow:\n“Many Homes they are sad tonight\nThey whisper someone’s name by the candlelight\n20,000 + killed, 8000+ children”\n🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸🇵🇸 pic.twitter.com/WChIIp8AuP — sarah (@sahouraxo) December 23, 2023 Green Brigade back at Celtic Park after a two month ban and straight back to showing support for the Palestinians. pic.twitter.com/ZPkiEYppDD — Liam O'Hare (@Liam_O_Hare) December 23, 2023\nUpdated at 00.27 CET\n23 Dec 2023 22.06 CET WHO: Gaza's al-Ahli hospital is 'paralyzed' and 'shell of a hospital' A shortage in fuel, power, medical supplies and health specialists as a result of Israel’s attacks across Gaza has left al-Ahli hospital’s emergency care and surgical services “paralyzed,” the World Health Organization said. “Al Ahli is a shell of a hospital. Until two days ago, it was the only hospital where injured people could get surgery in northern Gaza and it was overwhelmed with patients needing emergency care. There are no operating theaters any more due to the lack of fuel, power, medical supplies and health workers,” Richard Peeperkorn, the WHO’s Palestine representative, said. He went on to add that al-Ahli hospital is “only operating as a hospice currently with no or very little care”. Al-Ahli was the sole hospital offering surgical care for the injured in northern #Gaza. A severe lack of fuel, power, medical supplies, and health specialists has paralysed its emergency care and surgical services. Dr Rik Peeperkorn, @WHOoPt Representative, describes the… pic.twitter.com/rCiMiZMS84 — WHO in occupied Palestinian territory (@WHOoPt) December 23, 2023\nUpdated at 00.25 CET\n23 Dec 2023 21.13 CET Jerusalem’s church leaders defended their meeting with Israeli president Isaac Herzog on Sunday after it sparked criticism from Palestinians. Agence France-Presse reports: A statement from the president’s office announced the meeting on Thursday, quoting Herzog as saying that he expected the “Christian world to express clear condemnation” of the deadly October 7 Hamas attack in southern Israel. The meeting, attended by patriarchs and heads of churches in the city including the Latin Patriarch of Jerusalem Pierbattista Pizzaballa, triggered condemnation not just from the militant group Hamas but also the Palestinian community critical of the Israeli military offensive in Gaza. In a joint statement defending the meeting, the church leaders said the meeting was “not a mere exchange of holiday season pleasantries”. It was aimed, they said, at “demanding, on behalf of Christians worldwide, an immediate cessation of the bloodshed in Gaza”. Hamas had earlier denounced the meeting, saying in a statement that it was “shocked” by the image of Christian leaders in occupied Palestinian territories meeting with Herzog and accused them of not speaking out “about the difficult times our people are facing”.\nUpdated at 00.21 CET\n23 Dec 2023 20.45 CET Unicef: Water and sanitation services in Gaza on verge of collapse Water and sanitation services in Gaza are at the point of collapse, Unicef said on Saturday. Amid Israel’s deadly attacks across the strip, which have killed more than 20,000 Palestinians and displaced nearly 2 million survivors, Unicef said that the deteriorating humanitarian situation is raising the risk of large-scale disease outbreaks. Children are being forced to drink salinated or polluted water, in turn putting them at risk of death and disease, it added. Water and sanitation services in Gaza are at the point of collapse, putting children at serious risk of illness and death.\nWe need rapid, safe and unimpeded humanitarian access to all children and families in need. pic.twitter.com/izOoh8dxyw — UNICEF (@UNICEF) December 23, 2023\nUpdated at 21.51 CET\n23 Dec 2023 20.17 CET The US president Joe Biden spoke with the Israeli prime minister Benjamin Netanyahu on Saturday, the White House said. According to Netanyahu’s office, Netanyahu voiced appreciation towards the US for its stance at the UN security council, Reuters reports. Netanyahu’s office also added that he “made clear that Israel will pursue the war until all of its objectives are fully met”. A staunch ally of Israel, the US earlier this month vetoed a security council resolution that called for an immediate humanitarian ceasefire between Israel and Hamas. In its latest round of voting at the security council, the US abstained from a highly watered-down resolution – which ultimately passed – surrounding the delivery of aid into Gaza.\nUpdated at 20.36 CET\n23 Dec 2023 19.46 CET Two Qatari Armed Forces aircraft carrying aid for Palestinians displaced by Israeli strikes in Gaza has headed to El Arish, Egypt. In an announcement on Saturday, Qatar’s foreign ministry said that the two aircraft carrying 33 tons of aid consisting of food and medical supplies are en route to Gaza. Today’s delivery brings the total number of aid planes sent to Gaza by Qatar to 49, with a total of 1,534 tons of aid. Two Qatar Armed Forces Aircraft Carrying Aid for Palestinians in Gaza Heads to Egypt's El Arish#MOFAQatar pic.twitter.com/mrnt2xmyc0 — Ministry of Foreign Affairs - Qatar (@MofaQatar_EN) December 23, 2023\nUpdated at 19.58 CET\n23 Dec 2023 19.17 CET “We are not getting the humanitarian supplies that we need to cater and respond to a humanitarian crisis this size and this scale,” UNRWA spokesperson Juliette Touma has said. Speaking to CGTN, Touma added: The more that we have these evacuation orders that the Israeli authorities continue to issue … we will see an exodus of people continue to search for safety, search for shelter … The combination of the war and the siege and the lack of availability of basic supplies including food has led to … unprecedented levels of hunger and starvation. \"The more evacuation orders that Israeli authorities continue to issue, we will see an exodus of people continue to search for safety\"@JulietteTouma @CGTNOfficial: Combination of war, siege & lack of aid has caused unprecedented levels of hunger & starvation across📍#GazaStrip pic.twitter.com/d4iTmIWtwH — UNRWA (@UNRWA) December 23, 2023\nUpdated at 19.57 CET\n23 Dec 2023 18.49 CET UNRWA: 'People in Gaza are people. They are not pieces on a checkerboard' The director of UNRWA affairs, Thomas White, reiterated the absence of safety across the Gaza strip as more than 1.9 million Palestinians remain displaced as a result of Israel’s attacks. In a tweet on Saturday, White wrote: People in Gaza are people. They are not pieces on a checkerboard - many have already been displaced several times. The Israeli Army just orders people to move into areas where there are ongoing airstrikes. No place is safe, nowhere to go. People in #Gaza are People. They are not pieces on a checkerboard - many have already been displaced several times. The Israeli Army just orders people to move into areas where there are ongoing airstrikes. No place is safe, nowhere to go. @UNRWA — Thomas White (@TomWhiteGaza) December 23, 2023 White’s comments come as the number of Palestinians killed by Israeli strikes reach more than 20,200 since October 7. An additional 53,688 Palestinians have been injured by Israeli strikes, Gaza’s health ministry announced.\nUpdated at 22.40 CET\n23 Dec 2023 18.23 CET Médecins Sans Frontières: UN security council resolution 'falls painfully short' In response to the UN security council’s passage of a resolution on Gaza aid delivery, Médecins Sans Frontières said that it “falls painfully short of what is required to address the crisis in Gaza”. In a series of tweets on Saturday, MSF said: The watered-down resolution on #Gaza will not ensure the massive scale-up and rapid flow of humanitarian aid needed, as bombs continue to rain down on Palestinian civilians, force mass displacement, and deny access to vital medical care and humanitarian assistance. The watered-down resolution on #Gaza will not ensure the massive scale-up and rapid flow of humanitarian aid needed, as bombs continue to rain down on Palestinian civilians, force mass displacement, and deny access to vital medical care and humanitarian assistance... — MSF International (@MSF) December 23, 2023 “The way Israel is prosecuting this war, with US support, is causing massive death and suffering among Palestinian civilians and is inconsistent with international norms and laws. Even war has rules,” it added. The way Israel is prosecuting this war, with US support, is causing massive death and suffering among Palestinian civilians and is inconsistent with international norms and laws. Even war has rules... — MSF International (@MSF) December 23, 2023\nUpdated at 21.58 CET\n23 Dec 2023 17.53 CET The Palestine Red Crescent Society remains operating at its medical point in Jabalia in northern Gaza amid Israeli bombardment. In a video released on Saturday, PRCS workers can be seen treating Palestinians injured by Israeli strikes in a makeshift tent amid a shortage of medical supplies across the strip. 🫶The heroes of the Palestine Red Crescent continue their work at the PRCS medical point in #Jabalia, northern #Gaza👏\n📷 Fimed by PRCS volunteer, Firas Ajrami#HumantarianHeroes pic.twitter.com/nUDS8Qbk4P — PRCS (@PalestineRCS) December 23, 2023\nUpdated at 18.47 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Death toll from Israeli attacks tops 20,000 - As it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/23/israel-gaza-hamas-war-latest-updates-un-security-council-resolution-us-live"}