{"authors": [], "date_download": "2024-02-05 15:22:38", "date_modify": "None", "date_publish": "2023-12-24 23:04:48", "description": "Palestinian health officials say death toll after attack on Maghazi camp likely to rise", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F24%2Fdeaths-israel-strike-on-refugee-camp-in-central-gaza.json", "image_url": "https://i.guim.co.uk/img/media/8f17443c59752b32c320cdffcabbb57cc6f0f61f/0_322_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15121e373d24cb861559ba6e3be4c32c", "language": "en", "localpath": null, "maintext": "An Israeli airstrike on a refugee camp in central Gaza has killed at least 70 people, Palestinian health officials have said as they warned the toll was likely to rise and the strikes that began hours before midnight continued into Christmas Day.\nThe fatalities at the Maghazi camp, east of Deir al-Balah, included at least 12 women and seven children, according to early hospital figures issued late on Sunday night.\n“We were all targeted,” said Ahmad Turokmani, who lost several family members including his daughter and grandson. “There is no safe place in Gaza anyway,” he told the Associated Press.\nThe Palestinian health ministry spokesperson, Ashraf al-Qidra, said the death toll was likely to climb. “What is happening at the Maghazi camp is a massacre that is being committed on a crowded residential square,” he told Reuters.\nView image in fullscreen Children injured in Israeli attacks are brought to al-Aqsa Martyrs hospital in Deir al Balah, Gaza on 24 December. Photograph: Anadolu/Getty Images\nThe Israeli military said it was reviewing the incident. A spokesperson for the Israel Defense Forces said: “Despite the challenges posed by Hamas terrorists operating within civilian areas in Gaza, the IDF is committed to international law including taking feasible steps to minimise harm to civilians.”\nHamas issued a statement calling the airstrike “a horrific massacre” and said it was “a new war crime”.\nThe camp has suffered previous strikes including one in November when the Gaza health ministry said more than 30 people were killed.\nThe Palestinian Red Crescent published footage of the wounded from the latest strike being transported to hospitals. It said Israeli warplanes were bombing main roads in central Gaza, hindering the passage of ambulances and emergency vehicles.\nMedics said a separate Israeli airstrike in Khan Younis in southern Gaza killed eight Palestinians.\nClergy cancelled Christmas celebrations in Bethlehem, the Israeli-occupied Palestinian West Bank city where tradition has it that Jesus was born in a stable 2,000 years ago.\nView image in fullscreen A nativity scene in the Evangelical Lutheran Christmas Church in Bethlehem, occupied West Bank shows baby Jesus wrapped in a keffiyeh and placed in rubble to show solidarity with the people of Gaza. Photograph: Maja Hitij/Getty Images\n“Tonight, our hearts are in Bethlehem, where the Prince of Peace is once more rejected by the futile logic of war, by the clash of arms that even today prevents him from finding room in the world,” Pope Francis said, presiding at Christmas Eve Mass in St Peter’s Basilica in Rome.\nPalestinian Christians earlier held a Christmas vigil in Bethlehem with candle-lit hymns and prayers for peace in Gaza instead of the usual celebrations.\nThere was no large tree, the usual centrepiece of Bethlehem’s Christmas celebrations. Nativity figurines in churches were placed amid rubble and barbed wire in solidarity with the people of Gaza.\nSince a week-long truce collapsed at the start of the month, fighting has only intensified on the ground, with war spreading from the north of the Gaza Strip to the full length of the densely populated enclave.\nThe Israeli military said 10 of its soldiers had been killed in the past day, after five were killed the previous day, its worst two-day losses since early November.\n“This is a difficult morning, after a very difficult day of fighting in Gaza,” the Israeli prime minister, Benjamin Netanyahu, told his cabinet on Sunday. “The war is exacting a very heavy cost from us; however we have no choice [but] to continue to fight.”\nIn a later video message he said troops would fight on deeper into Gaza until “total victory” over Hamas.\nIn a nationally televised speech, the Israeli president, Isaac Herzog, appealed for the country to remain united. “This moment is a test. We will not break nor blink,” he said.\nIsrael has been under pressure from its closest ally the US to shift its operations into a lower density phase and reduce civilian deaths.\nThere has been widespread anger against Netanyahu’s government, which many criticise for failing to protect civilians on 7 October and promoting policies that allowed Hamas to gain strength over the years. Netanyahu has avoided accepting responsibility for the military and policy failures.\n“Over time, the public will find it hard to ignore the heavy price paid, as well as the suspicion that the aims that were loudly heralded are still far from being attained, and that Hamas is showing no signs of capitulating in the near future,” wrote Amos Harel, military affairs commentator for the Haaretz newspaper.\nOn Saturday, Israel’s military chief of staff said his forces had largely achieved operational control in the north of Gaza and would expand operations further in the south.\nBut residents say fighting has only intensified in northern districts.\nDiplomatic efforts, mediated by Egypt and Qatar, on a new truce to free remaining hostages held by militants in Gaza have yielded little public progress, although Washington described the talks last week as “very serious.”\nIslamic Jihad, a smaller militant group allied to Hamas, said a delegation led by its exiled leader Ziad al-Nakhlala was in Cairo on Sunday. His arrival followed talks attended by the Hamas chief, Ismail Haniyeh, in recent days.\nThe militant groups have so far said they will not discuss any release of hostages unless Israel ends its war in Gaza, while the Israelis say they are willing to discuss only a temporary pause in fighting.\nThe Cairo talks would centre on “ways to end the Israeli aggression on our people”, said an Islamic Jihad official.\nThe delegation would reaffirm the group’s position that any exchange of hostages will have to secure the release of all Palestinians jailed in Israel, “after a ceasefire is achieved,” the official said.\nIsraeli media reported on Sunday that Egypt had put forward to Hamas a three-stage deal that would take several weeks and ultimately end with the release of all hostages and the cessation of hostilities and withdrawal of Israeli troops from Gaza.\nIn an initial phase Hamas would release women, children, the sick and elderly in exchange for Palestinian prisoners, Haaretz newspaper reported. In the second phase, Hamas would release female soldiers and the two sides would exchange bodies.\nIn the third phase, Hamas would release all remaining hostages and cease hostilities against Israel while Israeli forces would withdraw from Gaza.\n“On the surface, the plan appears to be a formula that both parties would be pleased to reject,” Haaretz added.\nIsrael has ruled out a ceasefire until it has eliminated Hamas, and Hamas has said it will not consider a hostage deal until Israel agrees to end hostilities.\nHamas and Islamic Jihad, both sworn to Israel’s destruction, are still believed to be holding more than 100 hostages from among 240 they captured during their 7 October rampage through Israeli towns, when they killed 1,139 people.\nSince then, Israel has besieged the Gaza Strip and laid much of it to waste, with more than 20,400 people confirmed killed, according to authorities in Hamas-ruled Gaza, and thousands more are believed dead under the rubble. Tens of thousands more have been wounded.\nThe vast majority of the 2.3 million Gazans have also been driven from their homes and the United Nations says conditions are catastrophic.\nAssociated Press and Reuters contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "At least 70 killed in Israeli strike on refugee camp in central Gaza, health ministry says", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/24/deaths-israel-strike-on-refugee-camp-in-central-gaza"}