{"authors": ["Rachel Bowman", "Rachel Bowman For Dailymail.Com"], "date_download": "2024-02-05 15:15:05", "date_modify": "None", "date_publish": "2024-01-29 18:50:33", "description": "The soldiers killed in a drone strike on a US base in Jordan on Saturday have been identified as as Specialist Kennedy Ladon Sanders, Specialist Breonna Moffett and Sgt. William Rivers.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13020295%2FKennedy-Ladon-Sanders-identified-drone-strike-jordan.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/29/21/80606797-0-image-a-23_1706565052201.jpg", "language": "en", "localpath": null, "maintext": "The three American soldiers killed in suicide drone strike on a US base in Jordan have been identified as Specialist Kennedy Ladon Sanders, 24, Specialist Breonna Moffett, 23, and Sgt. William Rivers, 46.\nThe drone attack late Saturday impacted a base in the northeast part of the country known as Tower 22 near the Syria border, resulting in the three deaths and injuring at least 34 other troops.\nThe troops were in their sleeping quarters at the time and the Pentagon confirmed Monday that the victims were likely in bed.\nThe three soldiers were assigned to the 718th Engineer Company, a US Army Reserve unit based out of Fort Moore, Georgia.\nPentagon Deputy Press Secretary Sabrina Singh told reporters: 'What was different about this attack is where it landed. It did impact where the living quarters, and I believe it was pretty early morning so people were actually in their beds when the drone impacted.'\nKennedy Ladon Sanders, 24, was among three US soldiers killed in the drone strike\nSgt. William Jerome Rivers, 46, of Carrollton, Georgia died in the drone strike of a US airbase in Jordan\nSpecialist Breonna Moffett, 23, of Savannah, Georgia has been identified as one of the soldiers killed in the drone strike\nThe drone attack late Saturday night impacted a US outpost located in the northeast part of the country known as Tower 22, near the Syria border, and resulted in at least 34 other injuries\nChief of Army Reserve, Lt. Gen. Jody J. Daniels, said: 'The loss of Sergeant William J. Rivers, Specialist Breonna A. Moffett and Specialist Kennedy L. Sanders has left an indelible mark on the United States Army Reserve.\n'On behalf of the U.S. Army Reserve, I share in the sorrow felt by their friends, family, and loved ones. Their service and sacrifice will not be forgotten, and we are committed to supporting those left behind in the wake of this tragedy.'\nRivers, of Carrollton, Georgia enlisted in the Army Reserve in 2011 as an Interior Electrician.\nHis awards and decorations include the Army Achievement Medal, National Defense Service Medal, Global War on Terrorism Service Medal, Army Service Ribbon, Overseas Service Ribbon, two Army Reserve Component Overseas Training Ribbon, Armed Forces Reserve Medal with 'M' Device and the Inherent Resolve Campaign Medal with Campaign Star.\nSanders graduated from Ware County High School in 2017 and enlisted in the Army Reserve in 2019 as Horizontal Construction Engineer.\nSanders father, Shawn Sanders, said on Facebook: 'Our family would like to thank you for the respect given to Kennedy. Munchkin will be missed by many.'\nHer mother, Oneida Oliver-Sanders, said: 'I just can’t believe I’ll never be able to hug and kiss my baby again. Life is so unfair. I just want my baby.'\nThe government of Waycross said on Facebook: 'The City is deeply saddened to hear of the passing of Kennedy Ladon Sanders, who gave her life in service to our country.'\n'We offer our heartfelt condolences to her family and friends during this difficult time. In honor of her sacrifice, the City has lowered our flags to half-mast today. We are also working on additional ways to pay tribute to Kennedy and her service.'\n'Our thoughts and prayers are with her loved ones as they mourn this tremendous loss.'\nSander’s awards and decorations include the National Defense Service Medal, Global War on Terrorism Expeditionary Medal, Global War on Terrorism Service Medal, Army Service Ribbon, Overseas Service Ribbon, and the Armed Forces Reserve Medal with 'M' Device.\nMoffett enlisted in the Army Reserve in 2019 as a Horizontal Construction Engineer and received the National Defense Service Medal and the Army Service Ribbon.\nMoffett's mother, Regina RaMo, said, 'This is one of the saddest days of my life. With a heavy heart I have to say that my Angel my first born has going on to be with GOD today. The pain will never go away and my life is forever changed.\n'I will never get to cook your favorite food, we will never get to talk on the phone and I will never see you walk through my front door again. Breonna Moffett was killed this morning. Just know that a piece of my heart and soul will always be missing. Love you Baby Girl. Rest Easy. Always will be my first born.'\nThe city of Waycross will lower their flags to half-mast to honor Sanders sacrifice\nFamily members of the 24-year-old Waycross, Georgia native confirmed Sanders was one of the soldiers killed in the attack. The other two have not been identified\nSanders mother, Oneida Oliver-Sanders, said, 'I just can’t believe I’ll never be able to hug and kiss my baby again. Life is so unfair. I just want my baby'\nSanders graduated from Ware County High School in 2017\nAs of Sunday morning, Iran - the main backer of anti-Israel group Hezbollah - and its proxies are the main suspects, officials said.\nThe Wall Street Journal has reported that the US failed to stop the attack because the enemy drone approached its target at the same time as a US drone returning to base and the two were confused.\nModern military aircraft, naval vessels and ground vehicles are fitted with technology known as Identification Friend or Foe (IFF) Transponders, which identify 'friendly' vehicles.\nIt's unclear whether the system in use at the Jordan base malfunctioned or if human error was involved.\nThe suicide drone was launched by from Iraq by a militia backed by Tehran, according to US officials, and hit the base which sits close to the borders of both Iraq and Syria.\nPresident Joe Biden vowed 'we shall respond' to a suicide drone strike that killed three U.S. service members in Jordan late on Saturday night.\nBiden issued a statement on Sunday mourning the loss of the slain service members - the latest casualty as the unrest in the Middle East persists.\n'Today, America's heart is heavy. Last night, three U.S. service members were killed - and many wounded - during an unmanned aerial drone attack on our forces stationed in northeast Jordan near the Syria border,' Biden said.\n'While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq.'\nHe added how the three fallen soldiers 'embodied the very best of our nation' and declared they died 'risking their own safety for the safety of their fellow Americans, and our allies and partners with whom we stand in the fight against terrorism.'\nMoffett's mother, Regina RaMo, said, 'This is one of the saddest days of my life. With a heavy heart I have to say that my Angel my first born has going on to be with GOD today'\nAll three soldiers were assigned to the 718th Engineer Company, a US Army Reserve unit based out of Fort Moore, Georgia\n'It is a fight we will not cease,' Biden, 81, proclaimed.\nWhile not identifying the militants responsible, the statement confirmed the strike was the work of anti-Western jihadists operating somewhere in the region.\nThe suicide strike comes as conflict in the war-torn region continues to escalate, with the war between Israel and Hamas terrorists in Gaza still ongoing, and Iran currently exchanging airstrikes with U.S. ally Pakistan.\nBoth countries, as of Sunday, boast a bevy of Iran-aligned militias, including Hezbollah and several other Shia militant groups.\nSince the Syrian War in 2011, Iran has also backed multiple Palestinian terror groups based in Gaza, and various terrorist groups in Bahrain and elsewhere across the Middle East.\nIn 2019, the nuclear-capable country acknowledged the involvement of the force in the Iraq and Syria conflicts, spurring the US to designate the Iranian army as a Foreign Terrorist Organization.\nIran has also been known regional militant and proxy groups to achieve deniability in such strikes, as well as shield it from accountability for its destabilizing policies.\nThe country is also currently embroiled in an artillery-laden game of chicken with its own neighbor in Pakistan, which is one of NATO's main allies in the Middle East.\nJust last week, Pakistan's air force launched retaliatory airstrikes on two alleged militant positions in Iran, days after an Iranian airstrike killed two children in their own country.\nThe air attacks in Sistan and Baluchestan province killed at least seven - and added to tensions already present between the two nations and the region as a whole.\nAn outspoken enemy of both the US and Israel, Iran currently trains the Hezbollah militia group (seen here in Baghdad in 2019), which for years has sought to join the Palestinian cause. The group has not been named as responsible for Saturday's attack\nA few weeks ago, Pakistan recalled its ambassador to Tehran because of Tuesday's strikes by Iran inside Pakistan's southwestern Baluchistan province. Iran claimed it targeted bases for a militant Sunni separatist group.\nIt drew strong condemnation from Pakistan, which denounced the attack as a 'blatant violation' of its airspace and said it killed two children.\nIf Marhamati's account of the casualties is correct, the country duplicated Pakistan's minor-killing offense at least two fold.\nAs Iranians continue to assess the full scope of the attack, the war more than a thousand miles west in Israel continues to rage.\nAnother 1,000 miles southwest, four fresh strikes were carried out by the US on Yemen, targeting anti-ship ballistic missiles used by another rebel group backed by Iran, the Houthi.\nEarlier in the month, shortly after Iran's attack on Pakistani soil, the group warned that British and American ships in the Red Sea have now become 'legitimate targets', given the state of the greater conflict.\nThe Houthis have since targeted ships in the region sporadically, with the attacks ramping up recently.\nIn response, the US launched Operation Prosperity Guardian - an international coalition to safeguard the region, with many other countries, including Spain and the UK, taking part.\nA reported 1,200 commercial ships have passed through the sea since the operation was launched on December, with none hit by drone or missile strikes until the first phase of the Sunday strike, when militants attacked the Hangzhou with several missiles.\nThe Sunday attack shows the group's continued resolve to support Hamas, which Israel recently pledged to continue to try to eradicate.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "PICTURED: Three American soldiers killed in early-morning suicide drone strike on base in Jordan", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13020295/Kennedy-Ladon-Sanders-identified-drone-strike-jordan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}