{"authors": ["Jason Wilson"], "date_download": "2024-02-05 15:22:41", "date_modify": "None", "date_publish": "2023-12-23 13:00:25", "description": "Crowdfunding site IsraelGives allows US residents to donate millions to paramilitary groups, IDF units and settlers", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F23%2Fcrowdfunding-us-residents-fund-settlements-west-bank.json", "image_url": "https://i.guim.co.uk/img/media/603043a444ba4a97513a761231847644c3466b06/0_15_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5f82fa2becf9ac6f99f942c7ab3323f2", "language": "en", "localpath": null, "maintext": "An Israeli crowdfunding platform, IsraelGives, has allowed US residents to donate millions of dollars since 7 October to causes including illegal West Bank settlements, paramilitary groups, and Israel Defense Forces (IDF) units currently operating in Gaza and the occupied West Bank.\nLegal experts say that some of these campaigns may be illegal under US tax law, but that this is rarely enforced on donors to Israeli causes.\nWhile contributions from wealthy US non-profits or individuals to illegal settlements have been previously reported, IsraelGives’s established crowdfunding platform, attached to an international network of linked non-profits, may allow smaller donors in the US and beyond to claim tax deductions on funds sustaining war and settlement in the occupied territories.\nThe revelations come amid an escalating humanitarian crisis caused by IDF attacks killing civilians in Gaza, and mounting campaigns in the US to enforce laws that should prevent US non-profits from funding illegal settlements.\nIsraelGives is an Israeli tech company founded in 2009 by Israeli entrepreneurs Jonathan Ben-Dor and Joseph Gitler, according to company filings and the tech sector monitor Crunchbase.\nIt allows non-profits in Israel to solicit funds on a platform that is similar to GoFundMe and other crowdfunding operations, where users can initiate fundraising efforts and set a fundraising goal, and donors can record their name, the amount of their individual donation, or their location on the fundraising page.\nA network of associated non-profits – most of which count co-founder Jonathan Ben-Dor as an officer – allow tax deductions on donations to Israeli non-profits for residents of the US, Canada, the EU, the UK and Australia. It also runs a donor-advised fund, a kind of non-profit entity which have been widely criticized for, among other things, concealing flows of “dark money” to rightwing causes.\nThe company hosts crowdfunding campaigns on several separate websites including israelgives.org, fundme.org.il, and israeltoremet.org. In 2020, Ben-Dor was sole founder of Giving Technology Inc, which provides a customer management system for nonprofits.\nThe Guardian identified at least 450 fundraising campaigns that are currently live on the site. Some 204 of these, initiated after 7 October, sought donations for tactical equipment or logistical support. Named beneficiaries included the IDF, individual IDF units, or paramilitary squads attached to specific Israeli communities, including many attached to West Bank settlements.\nThe international community considers West Bank settlements illegal, but the hardline Benjamin Netanyahu government in June announced plans to expand their construction.\nAfter conversion to US dollar amounts at market rates at the time of reporting, the Guardian determined that donors had pledged $5.3m to military, paramilitary or settlers since 7 October. A high proportion of these donors indicated that they are US residents.\nCampaigns raising funds specifically for illegal settlements included campaigns in support of Efrat, Tene (called Tene Omarum by settlers), Shavei Shomron, and Ma’on (also called Havat Ma’on). All of these fundraisers appear to ask for funding for paramilitary units attached to the settlements.\nThe “Emergency Campaign for Havat Ma’on’s Security Team”, for example, is headed by a video which includes footage of armed settlers undergoing combat training. In the copy for the campaign, the settlers promise to “stand firm against the cruel enemy that threatens our existence as Jews in the Land of Israel”, and promises: “We will do everything to ensure our safe existence here and make it clear to our enemies that we are not to be messed with!”\nThe campaign had raised over $7,700 at the time of reporting, and donors included individuals identifying themselves as residents of US states including Florida, Illinois, New York and Pennsylvania.\nMa’on, founded in 1980, is a 600-person outpost settlement in the extreme south of the occupied West Bank.\nAccording to the Foundation for Middle East Peace: “The Havat Ma’on outpost has a history of violent harassment of Palestinians working land near the outpost and the settlers’ illegally-built access road.”\nThis has continued in the wake of 7 October.\nOn 13 October, Israeli human rights organization B’Teselem circulated a video of a settler from the community shooting a Palestinian man at point-blank range with an AR-style rile in the neighboring village of Tawani as an IDF soldier looked on. Israeli press outlets corroborated the video.\nThe Guardian contacted IsraelGives to ask if it was concerned about exposing international donors to legal liability, citing the Ma’on fundraiser as a specific example, and founder and CEO Jonathan Ben-Dor responded in an email.\nHe wrote that IsraelGives, “the main website for giving in Israel” is a “neutral broker, facilitating giving to any of Israel’s 50,000 registered non-profit organizations”.\nBen-dor said that the site supported “human and civil rights organizations, humanitarian aid projects, and movements for the promotion of democracy, alongside religious and educational activities – some leftwing, some rightwing (some Jewish, some Arab)”.\nHe added: “We also facilitate international giving to those non-profits, when the organization and its cause and mission are in compliance with US law (charitable equivalence)”, a reference to IRS guidelines requiring US givers to demonstrate a “good faith determination that a foreign organization is a qualifying public charity”.\nBen-dor wrote that the Ma’on campaign was “created automatically on our platform through a war-time program designed to provide emergency assistance to communities and families directly affected by the October 7th attacks”.\nHe added that “before funds are released to any campaign, the campaign and its backers go through an extensive [know your customer] and compliance process.”\nBen-dor concluded that the Ma’on fundraiser “has yet to be vetted, approved, or funded, and on the face of it is not a cause that we will support, for the aforementioned reasons”.\nThe Guardian sent additional questions to Ben-Dor about whether he thought donations to West Bank settlements would not comply with US law, but he did not respond. The Guardian also contacted the IRS with general questions about compliance in such cases, but did not receive a response before deadline.\nBen-dor’s apparent caution runs counter to a longer history in which some say that US donations to Israeli organizations engaged in illegal activities have met few sanctions.\nDiala Shamas is senior staff attorney at the Center for Constitutional Rights (CCR), a hunan rights non-profit headquartered in New York City. She said that while donations to communities like Ma’on, “are illegal under international law and could be illegal under US law, the problem has always been one of enforcement”.\nShe believes that attorneys-general could prosecute over donations funding illegal acts, and the IRS could enforce its own rules on equivalence, but “Israeli causes have enjoyed complete impunity”.\nHowever, she pointed to initiatives including the so-called “Not on Our Dime” bill, supported by CCR and other organizations, currently before New York’s state house, which “clarifies that funding Israeli settlement activity … is illegal”, according to a campaign website.\nOther IsraelGives campaigns sought funds for tactical equipment for regular and reserve units of the IDF, and all have enjoyed contributions from US residents.\nOne had raised $25,443 for the “Maglan Friends Foundation”, which said that donors would “contribute directly to Maglan, a special forces elite commando unit of the IDF established to operate behind enemy lines”. Another had raised $2,994 for snipers attached to the 906th infantry batallion – one of six regular infantry divisions fighting in Gaza – with asks including three DJI Mavic 3 drones. Another began, “The soldiers of the IDF Multidimensional Unit … kindly urge you to donate so they can purchase additional specialist tactical gear” to include “22 commando vests”.\nMany of the IDF fundraisers, however, sought money for standard equipment.\nFor example, a fundraiser for reservists in the army’s 636th field intelligence unit pleaded, “we need access to essential tactical equipment, such as helmets flashlights, and boots”. That unit has reportedly been directly involved in combat in Gaza in recent days.\nLara Friedman, president of the Foundation for Middle East Peace and a former diplomat, said that such fundraisers were telling of the strain on Israel’s military. “It’s December 2023, and it sounds like parts of the IDF are basically begging for basic equipment, which is fascinating,” she said.\nShamas, the civil rights lawyer, said Israel’s “record of complete impunity” with respect to the enforcement of international law might lull donors into a false sense of security.\n“This is actually an incredibly risky space to be giving in,” she said, but those giving to Israel did not appear subject to “the level of risk assessment that people have to make when they’re giving in other high-risk places, whether it’s Somalia, Afghanistan, or Palestinians in Gaza”.", "source_domain": "www.theguardian.com", "text": null, "title": "Revealed: how US residents are funding illegal settlements in the West Bank", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/23/crowdfunding-us-residents-fund-settlements-west-bank"}