{"authors": [], "date_download": "2024-02-05 15:22:42", "date_modify": "None", "date_publish": "2023-12-23 01:47:27", "description": "Faith leaders urge an end to violence as the world’s oldest Christian communities endure devastating attacks", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fchristian-ceasefire-gaza-israel-christmas-b2468659.html.json", "image_url": "https://static.independent.co.uk/2023/12/22/18/11041034.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAmerican Christian congregations have renewed urgent calls for a ceasefire as the death toll in Gaza during Israel’s ongoing siege climbs to more than 20,000 within the days before Christmas.\nStatements from Christian leaders pleading for an end to the violence followed Israel’s attacks at a Catholic church and convent in Gaza, where a majority of the small community of Palestinian Christian families have taken refuge during the war.\nOn 16 December, a sniper from the Israel Defense Forces shot two women “without warning” and “in cold blood” at Holy Family Church, according to the Latin Patriarchate of Jerusalem, an ecclesiastical office for the Latin Catholics in the region.\nIn his appeal for a swift end to the conflict, Pope Francis condemned the killings as terrorism.\n“Some are saying, ‘This is terrorism and war.’ Yes, it is war. It is terrorism,” he said in remarks at St Peter’s Square on Sunday.\nRev Timothy P Broglio of the Archdiocese for the Military Services and president of the US Conference of Catholic Bishops wrote that “such violence must not continue”, demanding “the immediate cessation of all hostilities, the release of hostages, and for earnest negotiations towards a peaceful resolution of this conflict.”\n“We resolutely join our voices with the Holy Father, Pope Francis, reminding all parties in this conflict, that war is never the answer but always a defeat,” he added. “We plead, ‘peace, please peace!’”\nTheir statements follow appeals from a growing number of American churches and Christian groups. The National Council of Churches – the nation’s largest ecumenical body, encompassing 38 Christian faith groups – joined a letter with 60 other advocacy groups urging President Joe Biden to publicly support a ceasefire, prioritise the protection of all civilians, including the secure admission of humanitarian aid into Gaza and the release of all hostages.\nA letter to the president from Churches from Middle East Peace – a coalition of more than 30 national Church communions and organisations – demands his support for “immediate ceasefire, de-escalation, and restraint by all involved”.\nThe Episcopal Church’s presiding bishop Michael Curry wrote that “the violence is horrific, and the geopolitics are complex, but my call to love is simple: Stop the killing. Stop all of it. Stop it today.” His letter, written on 7 November as more than 10,000 Palestinians were reported dead, urged world leaders to “stop the next 10,000 from being killed”. Less than two months later, the death toll eclipsed 20,000.\nLast month, with the support of more than 900 Black Christian leaders, clergy purchased a full-page ad in The New York Times to “call for an immediate bilateral ceasefire in the Middle East for the sake of our shared humanity and our collective security”.\nA group of Black Christian faith leaders have also recently met with White House officials and members of the Congressional Black Caucus to address Gaza’s growing humanitarian crisis.\nPax Christi USA, a national Catholic peace organisation, is holding “call-in” days asking members to call the president to “support an immediate ceasefire in Gaza to end the mass slaughter”. A “Ceasefire Carols” campaign is staging Christmas carolling across the US to sing songs of peace. Faith leaders and church groups are holding Christian prayer vigils.\nThey are among the many voices joining a chorus of interfaith groups holding demonstrations across the US urging the Biden administration to join global leaders in pressing Israel to support a ceasefire in a conflict that has now killed roughly one in every 100 people in Gaza, including thousands of women and children.\nPalestinians walk among rubble of buildings in Al-Nuseirat refugee camp in Gaza on 22 December after it was bombed by Israeli airstrikes. (EPA)\nThat scale of destruction in a narrow strip that is home to 2.2 million Palestinians is compounded by warnings of hunger and famine, depleting supplies of clean water and fear of disease, and the mass displacement of 85 per cent of Gaza’s population.\nAn estimated 1,000 Christians lived in Gaza before the war began on October 7, as Israel launched retaliatory bombardments and a ground offensive after Hamas attacks that left 1,200 people dead and took roughly 240 hostages.\nA vast majority of that Christian population is Greek Orthodox, while others are Roman Catholic, Baptist and other Protestant denominations. They are among some of the oldest Christian communities in the world.\nOn 21 October, Gaza’s oldest Greek Orthodox was struck by explosions that killed at least 18 people, according to the Order of St George, an associated order of the church. The dead included family members of former US Rep Justin Amash, the first Palestinian-American member of Congress.\nThe Orthodox Patriarchate of Jerusalem, among the oldest jurisdictions in Christendom, condemned the attack.\n“The Patriarchate stresses that it will not abandon its religious and humanitarian duty, rooted in its Christian values, to provide all that is necessary in times of war and peace alike,” the organisation wrote.\nAmerican Christian groups, reeling from 11 weeks of attacks, are renewing their appeals to end the violence as Palestinian Christian leaders fear the violent erasure of their centuries-old communities.\n“I believe the Christian community will not survive this atrocity,” Rev Mitri Raheb, a Palestinian Lutheran leader in the Israeli-occupied West Bank town of Bethlehem, where Christians believe Jesus was born, told NBC News. “Even those who will survive, who might survive, I’m not sure that they can live in Gaza in a place where life is unlivable.”\nLast month, Palestinian leaders of Christian denominations in Bethlehem – citing the devastation in Gaza – unanimously decided against public Christmas celebrations.\nA nun prays in the grotto believed to be the spot where Jesus was born at the Church of the Nativity on 17 December in Bethlehem in the occupied West Bank. (Getty Images)\nMore than 300 people were trapped at the Holy Family Church where an Israeli sniper fatally shot two women. Seven others were shot and wounded at the compound, according to a statement from the Patriarchate.\nThe office of Prime Minister Benjamin Netanyahu claimed reports of the attack are “not true.”\nUK lawmaker Layla Moran, whose family sought refuge inside the church, told members of Parliament that a tank was positioned outside the complex, soldiers fired into the church, and a convent was bombed.\n“The situation has been desperate for weeks, but now it’s descending,” she said. “The people in the church … are civilians. They have nothing to do with Hamas. They are nuns, orphans, disabled people. They are a small Christian community and they know everyone.”\nThe suffering “is not confined to this church,” she said.", "source_domain": "www.independent.co.uk", "text": null, "title": "US Christian churches renew urgent calls for ceasefire as Christmas approaches", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/christian-ceasefire-gaza-israel-christmas-b2468659.html"}