{"authors": ["Martha Williams", "Martha Williams For Dailymail.Com"], "date_download": "2024-02-05 15:22:43", "date_modify": "None", "date_publish": "2023-12-23 18:58:43", "description": "President Biden got on a 45 minute call with Netanyahu to convince him to stand down from launching strikes on Hezbollah days after the October 7 terror attack on Israel by Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12896631%2FPresident-Biden-convinced-Netanyahu-abort-Israeli-preemptive-strike-Hezbollah.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/23/18/79287971-0-image-a-42_1703354978567.jpg", "language": "en", "localpath": null, "maintext": "President Biden got on a 45 minute call with Netanyahu to convince him to stand down from launching strikes on Hezbollah days after the October 7 terror attack on Israel by Hamas.\nAccording to sources familiar with the phone call, Biden urged Israeli Prime Minister Benjamin Netanyahu to abort Israel's mission to strike against Hezbollah forces in Lebanon.\nThe pre-emptive strike was set to take place in the days after Hamas launched a terror attack at the Supernova music festival in Israel.\nIsraeli warplanes were in the air and ready to go when Biden spoke to Netanyahu on October 11.\nBiden pleaded with the Prime Minister to think about the consequences of the drastic action - and his convincing worked because the attack did not go ahead.\nPresident Biden got on a 45 minute call with Netanyahu to convince him to stand down from launching strikes on Hezbollah days after the October 7 terror attack on Israel by Hamas\nAccording to sources familiar with the phone call, Biden urged Israeli Prime Minister Benjamin Netanyahu to abort Israel's mission to strike against Hezbollah forces in Lebanon\nThe phone call, which hadn't been reported until now, set a pattern for U.S. efforts to de-escalate conflict in the Middle East.\nThe Biden Administration has been relentlessly trying to prevent expansion of the ongoing war along Israel's northern border with Lebanon.\nIsraeli forces engage in war fire with fighters from the Iran-backed Shiite militant group Hezbollah and Palestinian militants along the border on a daily basis.\nThe White House's efforts to de-escalate the conflict in October included sending two aircraft carrier strike groups to the eastern Mediterranean, followed by a nuclear submarine.\nBiden and his administration received a heads up about Israel's plan to launch a pre-emptive strike on the morning of October 11 - when Israeli forces urgently notified the White House that they thought Hezbollah was going to attack.\nU.S. officials said that Israel begged for American support.\nAccording to the Wall Street Journal, 'Biden’s top intelligence, military and national security advisers—including CIA Director William Burns and Director of National Intelligence Avril Haines, Secretary of State Antony Blinken, Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs CQ Brown - convened later that morning for a principal’s committee meeting to discuss Israel’s proposed plans and determined that U.S. intelligence didn’t correspond with Israel’s.'\nAmos Hochstein has been leading the White House's efforts to ease tensions at the Israeli-Lebanese border.\nThe American-Israeli businessman, diplomat and lobbyist has been bouncing between Washington, Beirut and Jerusalem to try and end fighting diplomatically.\nFrench government has been involved in peace efforts - pushing Lebanon to abide by U.N. Security Council resolution 1701 which calls for Hezbollah to pull their forces out of Southern Lebanon and remove themselves at least 18 miles from Israel's border.\nThe Biden Administration has been relentlessly trying to prevent expansion of the ongoing war along Israel's northern border with Lebanon\nLebanese militia have launched at least 200 hits on Israel in their attacks which have left 10 dead, including seven soldiers.\nIsrael responded with almost 1,000 strikes inside the southern Lebanon which have killed over 120 Hezbollah soldiers and 10 Lebanese civilians, The Wall Street Journal reported.\nIsrael has continued to threaten Hezbollah with more intense attacks on Lebanon if their soldiers do not stand down.\nFive days ago it was reported that Israel was planning to invade Lebanon to push Hezbollah back from its northern border, according to reports, amid a barrage of rocket attacks since the war in Gaza broke out and fears that the terror group is 'worse than Hamas'.\nAfter weeks of exchanging cross-border fire, the Israel Defense Forces (IDF) are said to be keen to launch a ground offensive into southern Lebanon which would aim to push the terror group north past the Litani River.\nMilitary and government officials in Israel have said they are determined to prevent a repeat of the October 7 invasion from Gaza, with warnings that the scale of a Hezbollah raid could be even more deadly than the massacre of 1,200 people.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "President Biden convinced Netanyahu to abort Israeli preemptive strike on Hezbollah with just MOMENTS to spare, in effort to prevent all-out Middle East war based on 'unreliable' intel days after Octo", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12896631/President-Biden-convinced-Netanyahu-abort-Israeli-preemptive-strike-Hezbollah.html?ns_mchannel=rssns_campaign=1490ito=1490"}