{"authors": [], "date_download": "2024-02-05 15:22:45", "date_modify": "None", "date_publish": "2023-12-23 23:02:56", "description": "After roughly six hours of exchanging calls, Israeli officials abandoned the original plan", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fbiden-netanyahu-hezbollah-hamas-israel-b2468939.html.json", "image_url": "https://static.independent.co.uk/2023/12/09/15/2023-11-26T160343Z_1411782095_RC2ZU3A6G22I_RTRMADP_3_ISRAEL-PALESTINIANS-USA-HOSTAGES.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nPresident Joe Biden convinced Prime Minister Benjamin Netanyahu not to attack Hezbollah in the days following the 7 October Hamas’ attack on Israel, according to a report.\nThe Wall Street Journal reported that, on 11 October, Israeli aircrafts were in the air waiting for their next commands in preparation for a “pre-emptive strike” against Hezbollah forces.\nAt that moment, Mr Biden reportedly spoke to Mr Netanyahu and urged him to forgo the strike.\nThe president expressed fears that another assault would escalate the existing conflict into a regional war, the paper reported.\nIsrael had obtained intelligence that Hezbollah fighters were planning to enter the country, but US intelligence thought the information was unreliable, according to the outlet.\nThe Journal reported that the White House first heard about the 11 October plan from Israeli officials at around 6.30am that very morning, when they asked for the US’s support.\nNational Security Adviser Jake Sullivan, CIA Director William Burns and Director of National Intelligence Avril Haines, Secretary of State Antony Blinken, Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs CQ Brown were among Mr Biden’s top advisers who all met hours later, the outlet reported. The top advisers assessed the country’s scheme, before eventually deciding that US intelligence didn’t match that of Israel.\nUS intelligence apparently didn’t indicate that Hezbollah – which is designated a terrorist organisation by the US – planned to attack.\nThe president then phoned Mr Netanyahu — with the call spaning 45 minutes, according to the Journal. The two leaders didn’t see eye-to-eye on the issue: Mr Biden reportedly said that de-escalation was key to avoiding a broader war, while Mr Netanyahu and members of his war cabinet insisted that the expanding conflict was unavoidable.\nAfter roughly six hours exchanging calls, Israeli officials abandoned the original plan.\nUS President Joe Biden meets with Israeli Prime Minister Benjamin Netanyahu in Tel Aviv on 18 October (via REUTERS)\nIn the meantime, Israeli soldiers along the Israel-Lebanon border received orders to prepare to combat Hezbollah fighters crossing the border. Those along northern Israel were urged to head into bomb shelters for safety.\nBut – thanks to Mr Biden’s intervention – the fighting never transpired.\nThe Biden administration’s efforts to prevent fighting between Hezbollah and Israeli forces on 11 October appears to be part of a larger strategy.\nThe New York Times reported on Friday 22 December that senior White House Adviser Amos Hochstein has been holding discussions liaising with Israel, Lebanon and Hezbollah to try to minimise tensions along the border and prevent further escalation.\nStill, fighting across the Israel-Lebanon border has resulted in the deaths of nine Israeli soldiers, four Israeli civilians and over 100 Lebanese people, most of whom were Hezbollah militants, PBS reported.", "source_domain": "www.independent.co.uk", "text": null, "title": "Biden convinced Netanyahu not to strike Hezbollah after Hamas attacks, says report", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-netanyahu-hezbollah-hamas-israel-b2468939.html"}