{"authors": ["Damien Gayle", "Nina Lakhani"], "date_download": "2024-02-05 15:22:46", "date_modify": "None", "date_publish": "2023-12-23 06:00:18", "description": "Senior hydrologist warns Israeli plan would constitute one element of the crime of genocide", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F23%2Fisrael-flooding-hamas-tunnels-seawater-risks-ruining-basic-life-gaza-expert.json", "image_url": "https://i.guim.co.uk/img/media/1c489e0eccd532c66e13428d1dfecd534fefeb81/0_117_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a2abd53e53a6b296f9f6b0afc9fc1814", "language": "en", "localpath": null, "maintext": "A potential plan by Israel to flood the Hamas tunnel network with seawater risks “ruining the basic conditions for life in Gaza”, one of the elements of the crime of genocide, a senior hydrologist has told the Guardian.\nEnvironmental experts have warned the strategy – which Israel has yet to commit to – risks causing an ecological catastrophe that will leave Gaza with no drinkable water and devastate what little agriculture is possible in the 141 sq mile territory.\nThe UN special rapporteur for the right to water, Pedro Arrojo-Agudo, compared it to the legend of Romans’ salting of the fields of Carthage to render uninhabitable the territory of their ancient rival. The rapporteur for human rights and the environment, David Boyd, said damaging Gaza’s sole water supply would be “catastrophic” for the environment and human rights.\nMedia reports, photographs and satellite imagery suggest the Israel Defense Forces (IDF) have set up pumps at al-Shati refugee camp on the eastern coastline of the Gaza strip, which they could use to pump millions of gallons of seawater into the tunnels used by the militant group.\nIsraeli soldiers reportedly began trialling pumping seawater into the subterranean network last week, in an effort to drive Hamas’s militants above ground and deny them a significant strategic tool.\nThe environmental consequences could be far-reaching. According to a study from the US military academy West Point, there were 1,300 tunnels stretching over 310 miles (500km) in Gaza at the start of the war in October. It has been estimated it would take 1.5m cubic metres of water to completely fill them.\nMark Zeitoun, director of the Geneva Water Hub and professor at the Geneva Graduate Institute, said seawater pumped into the hundreds of kilometres of tunnels crisscrossing the porous, sandy soil of Gaza would inevitably seep into the aquifer that its 2.3 million residents rely on for about 85% of their water.\nZeitoun, who has worked as a water engineer for the UN in the occupied Palestinian territories, said the aquifer was already badly contaminated from wastewater and from seawater infiltration caused by years of overabstraction.\n“If you add more seawater directly, right on through the sand into the aquifer, it’s not going to turn a top-quality resource into a vulnerable resource, it will turn a vulnerable resource into a catastrophic one,” Zeitoun said.\nHe said the contamination would be such that current neighbourhood-level reverse osmosis desalination methods used by Palestinians in Gaza to treat their water would no longer be feasible.\n“It would ruin the conditions of life of everyone in Gaza,” he said. “I say the conditions of life because I think that’s one of the elements of genocide within the UN convention, the partial or complete physical destruction of the conditions necessary for life of any people.\n“Flooding the freshwater aquifer with seawater would go against every norm humanity has ever developed, including the environment aspects of international humanitarian law/rules of war and the recent principles on the protection of environment in relation to armed conflict and all the progress made towards criminalising harm to the natural environment: ecocide.”\nWim Zwijnenburg, a researcher for the Dutch NGO Pax for Peace, who investigates the environmental impacts of war, warned of additional dangers. “We don’t know what’s stored in the tunnels,” he said.\n“There are reports floating around, which are not verified, but quoted by some sources [that] around 20,000 gallons of fuel is stored in the tunnels. So you have all those kinds of hydrocarbons that can potentially also affect the soil and get into the aquifer and groundwater.”\nFlooding the tunnels would also pose risks for the integrity of the ground on which the communities of Gaza, the world’s most densely populated territory, are built, Zwijnenburg warned. If they were to collapse beneath built-up areas, that could bring whatever buildings remain above them down as well.\nIf implemented in full, the IDF’s tunnel-flooding plan would be the latest move in a long history of Israel’s targeting of Palestinian water supplies. Even before the damage to water infrastructure caused by the latest bombardment of Gaza, supplies were precarious for people in the territory and in the West Bank, said Hadeel Ikhmais, the head of the climate change office at the Palestinian Environmental Quality Authority.\nIn the West Bank, Palestinians have no access to surface water, and must buy water from the Israelis. Israeli settlers and soldiers attacked water supplies in the West Bank about three times a month between January 2022 and mid-2023.\nIn Gaza, the groundwater aquifer is not recharging sufficiently to cope with demand due to a rising population and climate impacts including drought and higher temperatures. In the latest war, desalination plants, water harvesting and water treatment infrastructure have been targeted, leading to waste being discharged into the sea.\n“The disposal of wastewater into the sea makes it much more challenging to desalinate. By targeting water supplies, Israel is trying to make Gaza unliveable for Palestinians,” Ikhmais said.\nThe UN Environment Programme said it had seen reports of Israel beginning to pump water into Gaza’s tunnels. Responding to the Guardian, a spokesperson gave a similar assessment of the potential effects.\n“The coastal aquifer, an underground natural reservoir which runs from the Carmel mountain range in the north to the Sinai peninsula in the south, and the already fragile ecosystem of Gaza must be protected, so there is no impact on agriculture, industry and the environment, and so that people can use the groundwater safely,” the spokesperson said.\n“Any method used by the warring parties during the conflict must take all precautions not to harm civilians, including impacting access to water and food resources.”\nThe Israeli government and IDF did not respond to requests for comment.", "source_domain": "www.theguardian.com", "text": null, "title": "Flooding Hamas tunnels with seawater risks ‘ruining basic life in Gaza’, says expert", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/23/israel-flooding-hamas-tunnels-seawater-risks-ruining-basic-life-gaza-expert"}