{"authors": ["Will Potter For Dailymail.Com"], "date_download": "2024-02-05 15:22:54", "date_modify": "None", "date_publish": "2023-12-22 12:50:50", "description": "Gadi Haggai, 73, has become the first American hostage taken into captivity by Hamas during the October 7 terrorist attacks to die, a group representing hostages' families said on Friday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12893721%2FUS-citizen-hostage-dies-Gaza-Israeli.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/22/14/79254809-0-image-m-29_1703256459702.jpg", "language": "en", "localpath": null, "maintext": "The US-Israeli citizen is the first American hostage to die in the conflict\nHe was snatched by Hamas on October 7 while on a morning walk with his wife\nA US-Israeli dual citizen taken into captivity by Hamas during the October 7 terrorist attacks has become the first American hostage to die, a group representing hostages' families said on Friday.\nGadi Haggai, 73, who also held Israeli citizenship, had not been seen since the brutal attack that claimed the lives of over 1,200 people, when he was taken with his wife Judi on a morning walk around the kibbutz.\nAccording to Israeli outlet Haaretz, Judi was able to call a kibbutz member for help after their abduction, and told them she had been shot in the arm while Gadi had been shot in the head and was 'critically injured.'\nHis body has remained in Gaza since, and although the couple were initially presumed to be held hostage, it is now believed that Haggai may have been killed during the October 7 blitz.\nPresident Joe Biden issued a statement to say he was 'heartbroken' by the news that Haggai is believed to have been murdered.\nJudi, who is also an American citizen, remains in captivity in Gaza.\nGadi Haggai, 73, had not been seen since Hamas' October 7 terrorist attacks, when he was taken with his wife Judi (pictured together) on a morning walk around the kibbutz\nHaggai, who was a cook in the kibbutz dining hall, is survived by four children and seven grandchildren, and was known as a talented musician\n'Jill and I are heartbroken by the news that American Gad Haggai is now believed to have been killed by Hamas on October 7,' President Biden said.\n'We continue to pray for the well-being and safe return of his wife, Judy. Their daughter joined by phone my meeting with the families of hostages last week.\n'Those families bravely shared with me the harrowing ordeal that they have endured over the past months as they await news of their loved ones. It’s intolerable.\n'Today, we are praying for their four children, seven grandchildren, and other loved ones and are grieving this tragic news with them.\n'And I reaffirm the pledge we have made to all the families of those still held hostage: we will not stop working to bring them home.'\nThe US dual national was among some 240 people seized during the October 7 cross-border rampage by Hamas.\nHaggai, who was a cook in the kibbutz dining hall, is survived by four children and seven grandchildren, and was known as a talented musician.\nHe had played music from an early age, and his proficiency with the recorder and flute saw him play in the Israel Defense Forces Orchestra during his military service.\nThe father moved to the United States after his army days and used his saxophone skills to pursue a passion for jazz. He returned to Israel several years later, where he met Judi and the two got married.\nAfter he and Judi were taken hostage almost 12 weeks ago, Haggai's son Ahl pleaded for their safe return.\nHe said he had seen his parents just three days before the terrorist attacks, and fondly recalled his final interaction with his parents, who he called his 'inspiration.'\nIt is believed that Gadi (right) may have been killed during the October 7 attacks, while his wife Judi (left), an American, remains in captivity in Gaza\n'Dad and I always argued about every subject under the sun,' he said. 'And on that Wednesday when they came to visit us, he said 'not today, let's not argue'... and we parted with a hug.'\nHe said he found out about the October 7 attacks as he was woken up by a phone call from his sister, but he said at that point he 'didn't yet know there were terrorists in the kibbutz.'\n'I tried to call my parents, my mom's phone rang once and it disconnected,' he continued. 'Dad's phone rang three times and it disconnected.'\n'The situation became clear to me, that the kibbutz is under attack and people are being murdered, homes set on fire.\n'On Sunday we were informed that their phones pinged in Gaza... it's awful, I feel that I'm stuck in the same place and the world goes on.\n'In some ways, I don't have my home. I ask the Israeli government, the countries of the world, Hamas, Qatar, whoever is involved, bring my parents home.'\nAn Israeli officer walks on the ground of the Super Nova Festival in Re'im, Israel, 17 October 2023, which was attacked by Hamas on 7 October\nSigal Manzuri, whose daughters Norelle and Roya were killed when they attended the Nova festival, hugs family friend Lior Goldstein at a tribute to the people who were killed during the October 7 attack by Hamas gunmen, at the site of the festival\nDrawing on various information sources, an Israeli government-appointed committee has been declaring some hostages dead in absentia.\nHamas has generally not confirmed hostage deaths, but has warned that 'time is running out' for the hostages as the Palestinian militants' war with Israel nears its 12th week.\nAccording to an official Israeli tally, 129 people remain held in Gaza after the rest were repatriated in a November truce or recovered during a military offensive.\nOf those still in Gaza, 22 are dead, the Israeli government says.\nThe forum said that between five and 10 of the hostages hold U.S. citizenship. The U.S. Embassy had no immediate comment.\nIt comes as officials say the Israeli military has killed more than 2,000 'terrorists' since the cease-fire with Hamas ended after six days.\nThe IDF spokesman Daniel Hagari said on Thursday that it took out Hamas extremists 'from the air, sea, and land', which included destroying a tunnel network in the 'Hamas Elite Quarter' in the center of Gaza City.\n'This is a complex network of tunnels connecting hideout apartments to various facilities and bunkers of senior members of the Hamas terrorist organization, which we revealed to the world yesterday,' Hagari said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "U.S. dual citizen taken hostage dies in Gaza, Israeli...", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12893721/US-citizen-hostage-dies-Gaza-Israeli.html?ns_mchannel=rssns_campaign=1490ito=1490"}