{"authors": ["Shauna Brown"], "date_download": "2024-02-05 15:22:56", "date_modify": "None", "date_publish": "2022-09-23 00:00:00", "description": "Good evening.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2023%2F12%2F22%2Ffriday-evening-news-briefing-police-launch-investigation-in%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/news/2022/09/23/TELEMMGLPICT000310354963_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Good evening. Greater Manchester police have launched an investigation into the alleged abduction of British teenager Alex Batty. Elsewhere, drivers have been urged to avoid travelling until after 6pm on Friday due to travel delays.\nPolice launch investigation into Alex Batty’s alleged abduction\nGreater Manchester Police have launched a criminal investigation into the alleged abduction of British teenager Alex Batty. Alex returned to the UK on Saturday to be reunited with his family in Oldham, Lancashire, six years after disappearing on holiday in Spain.\nDrivers face six-hour delays at Dover port\nTravellers faced further disruption on planned Christmas getaways after unexpected strike action on Thursday led to delays at French border controls on Friday. The Port of Dover has warned against anyone travelling to the ferry terminal without a booking.\nSunak won’t reduce migration after visa rules backdown, say Tory MPs\nBackbench MPs voiced “disappointment” and “alarm” after the Home Office announced it was watering down plans to sharply increase the minimum salary required to bring a spouse or partner to the UK.\nEvening Briefing: Today’s essential headlines\nCrime | A new Banksy artwork that appeared on a street in south London was taken down within an hour of the artist verifying the piece was a genuine installation.\nStorm Pia | Woman killed by falling Christmas tree\nMoney | Owner of constipated cat paid nearly £40 for a call\nPrague | Shooter ‘killed newborn baby and her father’\nGuardian | Staff fear for pets in work from home crackdown\nSt. Albans | Cathedral forced to evacuate after 2,000 candles set off fire alarm\nWatch: BMW repurposed into rocket launcher by Ukrainian forces\nA black model of the German car was filmed launching a salvo of missiles at enemy positions near Bakhmut in eastern Ukraine.\nWATCH HERE\nComment and analysis\nRobin Aitken | The BBC has exposed the sinister face of woke\nRobert Clark | The West’s enemies have a new weapon\nHenry Hill | The Government has just reminded us how poor Britain really is\nJames Price | If we can’t travel home for Christmas, Britain really is a helpless country\nYour views | ‘The trans movement is a Trojan horse designed to confuse children’\nWorld news: Israel blows up ‘subterranean city’ in Gaza where Oct 7 massacre was hatched\nThe Israel Defense Force (IDF) said it discovered “terrorist infrastructure” below Palestine Square in the city centre with lengthy tunnels, hiding places and offices belonging to Hamas’s senior military and political leaders.\nAerial footage released by the IDF late on Thursday night showed a series of explosions, destroying the underground infrastructure.\nREAD MORE\nFeature of the day\nSick of Strictly? Here’s your alternative Christmas Day viewing guide\nFinding the bland offerings on terrestrial TV a little uninspiring this year? Our critic Michael Hogan has some suggestions.\nREAD MORE\nBusiness news: Britain at risk of recession as growth revised down\nNew ONS figures show that the economy shrank between July and September.\nThe figures reveal the impact of high interest rates on UK households and will serve as a blow to Prime Minister Rishi Sunak, who at the start of the year made expanding the economy one of his five key pledges.\nLive markets news: German property prices plummet as housing bubble bursts - latest updates\nEditor’s choice\nSophie Ellis-Bextor | ‘I thought I might become a laughing stock’\nKatie Morley | ‘My whirlwind year winning back £2.4m of your money – and uncovering some scandalous behaviour’\nHealth | ‘I was told I couldn’t have children – our baby girl is a Christmas miracle’\nSport briefing: Today’s essential headlines\nFootball | How Declan Rice has transformed Arsenal\nWomen’s Football | What it is like to be a female trailblazer\nEuropean Super League | Arsenal and Liverpool issue snub\nWomen’s Rugby | Best 30 players in Britain right now\nBen Young | ‘English rugby is always obsessed with the next big thing’\nThree things for you\nFashion | The last-minute high street gift guide\nHealth | How to stop Christmas food from ruining your sleep\nReview | Aquaman and the Lost Kingdom: the most numbingly moronic film of 2023", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Friday evening news briefing: Police launch investigation into Alex Batty's alleged abduction", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/news/2023/12/22/friday-evening-news-briefing-police-launch-investigation-in/"}