{"authors": ["Mataeo Smith", "Image", "Anadolu Via Getty Images"], "date_download": "2024-02-05 15:15:07", "date_modify": "None", "date_publish": "2024-01-29 19:35:13", "description": "Amid the polarizing split between opponents and proponents of the Gaza war, Hundreds of civil servants will participate in a hunger strike in protest of the US's support of Israel", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-hundreds-government-workers-hunger-31996691.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31996717.ece/ALTERNATES/s1200/2_US-POLITICS-VOTE-BIDEN.jpg", "language": "en", "localpath": null, "maintext": "Amid the polarizing split between opponents and proponents of the Gaza war, Hundreds of civil servants will participate in a hunger strike in protest of the US's support of Israel\nHundreds of US government workers to do 'hunger strike' in rebuke of Biden's Gaza policy\nMultiple agencies are organising a \"day of fasting\" to bring light to the growing humanitarian crisis in Gaza amid the war between Israel and Hamas.\nGovernment employees of the group United for Peace, formed by officials frustrated with US President Joe Biden's response to the Israeli Defense Forces' (IDF) actions in Gaza, announced that they would take part in the Thursday demonstration.\nThose participating will show up to their respective offices dressed in black or wearing keffiyeh scarves or other symbols of Palestinian solidarity, the Guardian reported.\nThe \"Day of Fasting\" is in response to Israel's use of “starvation as a weapon of war by intentionally withholding food from entering Gaza,\" a federal worker speaking for the group said. The worker, who was not named, cited the UN reporting that there are currently 2 million people in the area at risk of famine.\nREAD MORE: EXCLUSIVE: Expert shares reason the US is 'pushing Middle East conflict into a new realm'\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nWorkers partaking in the demonstration are a part of two dozen government agencies. These agencies include the departments of defense, homeland security and state and also those who are career public servants and political appointees.\nEarlier this month, House speaker Mike Johnson - a Republican from Louisiana - rebuked workers who staged a walkout expressing similar sentiments. “They deserve to be fired,” he said.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nThe representatives of Feds United for Peace aim to force conversation about the war's mounting casualties at a time when many government officials fear retribution from employers for speaking of a cease-fire. Officials say individuals are afraid to even discuss politics as it might affect their work on policy.\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US.\nGovernment personnel have arranged movements against the war under different aliases, like Staffers for Ceasefire who put on a vigil for the enclave outside the White House last month. The group published a statement last week, denouncing the efforts of senior White House officials to increase morale despite the growing frustration among Americans over Biden's support of Israel.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\n“While White House chief of staff Jeff Zients throws a morale-booster party for staff tonight, a child in Gaza is killed every 8 minutes,” Staffers for Ceasefire said in a statement. “We are disgusted by this display of complete apathy towards the lives that have been taken in the region over the last three months.”\nPolitical Scientist Van Jackson who worked in the Pentagon during the Obama administration said he's never seen such protests from government workers. “We are in uncharted territory, and no presidential administration the past 40 years has been denounced by its own staff like this – not collectively, not so publicly, and not with this regularity,” Jackson wrote in his newsletter Un-Diplomatic.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Hundreds of US government workers to do 'hunger strike' in rebuke of Biden's Gaza policy", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/breaking-hundreds-government-workers-hunger-31996691"}