{"authors": ["Wills Robinson", "Wills Robinson For Dailymail.Com"], "date_download": "2024-02-05 15:22:57", "date_modify": "None", "date_publish": "2023-12-22 21:39:44", "description": "The White House welcomed the decision that could help boost the missile stockpile Ukraine needs to defend itself from a Russian onslaught this winter.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12894783%2FJapan-send-Patriot-missiles-U-S-Tokyo-relaxes-post-Second-World-War-export-ban-deadly-weapons-defense-systems-deal-help-Ukraine-war-Russia.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/22/21/79269579-0-image-a-32_1703281202873.jpg", "language": "en", "localpath": null, "maintext": "Japan has agreed to send Patriot missiles to the U.S. in a break from its self-imposed ban on exporting deadly weapons since the end of the Second World War.\nThe White House welcomed the decision that could help boost the missile stockpile Ukraine needs to defend itself from a Russian onslaught this winter.\nThe Pentagon has said that Kyiv is facing a massive shortfall in munitions that could have disastrous consequences in the war with Vladimir Putin's forces.\nCongress also failed to pass a $68 billion bill to give aid to Ukraine after negotiations over adding extra security for the border collapsed.\nBecause of the deal with Tokyo, Washington can now send its supply to President Volodymyr Zelensky.\nThe advanced PAC-3 interceptors, believed to be part of the deal, can destroy large aircraft and missiles and cost roughly $4 million each.\nThe PAC-2 system is designed to take out ballistic missiles by exploding nearby.\nJapan has agreed to send Patriot missiles to the U.S. in a break from its self-imposed ban on exporting deadly weapons since the end of the Second World War. Mime Pence inspects the missile defense system in 2017\nJapan is also trying to strengthen its defense industry as tensions build in the Indo-Pacific and China and North Korea ramp up their military activity.\n'This holds significant meaning in terms of further strengthening the Japan-U.S. alliance. It will contribute not only to Japan's security but also the peace and stability of the wider Indo-Pacific region,' Chief Cabinet Secretary Yoshimasa Hayashi said following the announcement.\nAlthough Japan's new export controls still prevent it from shipping weapons to countries that are at war, it may indirectly benefit Ukraine in its war with Russia as it gives the United States extra capacity to provide military aid to Kyiv.\nIf the U.S. does want to send the missiles to Ukraine, it will require Japan's approval first.\n'This decision will contribute to the security of Japan and to peace and stability in the Indo-Pacific region by ensuring that U.S. forces, in close cooperation with the Japan Self-Defense Forces, will continue to maintain a credible deterrence and response capability,' White House national security adviser Jake Sullivan said in a statement.\nA Japanese government official, who declined to be named because of the sensitivity of the matter, said the missiles would be used to re-stock the U.S. military's arsenal for the safety and security of the Indo-Pacific.\nThe Patriot system is one of an array of sophisticated air defence units supplied by the West to help Ukraine after Russia invaded.\nUnder previous rules, Japan could only export components of arms and was prohibited from delivering completed products.\nThe revised guidelines now allow Tokyo to export completed products to countries where patent holders are based.\nJapan is also trying to strengthen its defense industry as tensions build in the Indo-Pacific and China ramps up its military activity. A missile is pictured in Tokyo in 2016\nA PAC-2 ATM missile is fired in Romania during a training exercise next to the Black Sea in November 2023 (file picture)\nJapan produces Patriot missiles under lisence from U.S. firms Raytheon and Lockheed Martin.\nTokyo is also considering exporting 155mm artillery shells, manufactured under BAE Systems' lisence, to the United Kingdom, the Financial Times reported on Thursday.\nThe Japanese government official said exports are considered once the country where the license holder is based makes a formal request, adding that the United States has so far been the only country to make such a request.\nU.S. Ambassador to Japan Rahm Emanuel, in a post on X, called it a 'historic decision' and a 'significant example of Japan's shared commitment to deterrence,' adding: 'Japan is undertaking a once-in-a-generation defense modernization.'\nJapan's ruling party has been mulling various changes to export controls for several months, as the rules potentially stand in the way of the ability to export next-generation fighter jets in development with Britain and Italy.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Japan will send Patriot missiles to the U.S.: Tokyo relaxes post-Second World War export ban on deadly weapons in defense systems deal that could help Ukraine in its war with Russia", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12894783/Japan-send-Patriot-missiles-U-S-Tokyo-relaxes-post-Second-World-War-export-ban-deadly-weapons-defense-systems-deal-help-Ukraine-war-Russia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}