{"authors": ["Charlie Jones", "Image", "Afp Via Getty Images", "Ap"], "date_download": "2024-02-05 15:23:00", "date_modify": "None", "date_publish": "2023-12-22 13:58:36", "description": "Gadi Haggai was a resident in Kibbutz Nir Oz, one of the hardest hit communities during Hamas’s October 7 attack into southern Israel", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fbreaking-american-citizen-gadi-haggai-31734965.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31734980.ece/ALTERNATES/s1200/0_DNP_CHP_221223Slug_13420-D.jpg", "language": "en", "localpath": null, "maintext": "Gadi Haggai was a resident in Kibbutz Nir Oz, one of the hardest hit communities during Hamas’s October 7 attack into southern Israel\nAn American citizen taken hostage by Hamas in the October 7 raid has died, it has been revealed.\nIn a statement, the kibbutz where he lived said Gadi Haggai, 73, was murdered and that his wife, 70-year-old Judi Weinstein, remains hostage in Gaza.\nThe kibbutz, which hasn't revealed how it found out about Mr Haggai's death, said his body remains in the hands of the terrorists. He was a resident of Kibbutz Nir Oz, one of the hardest hit communities during Hamas’s October 7 attack, which kicked off a full blown conflict in the region.\nHe was a retired chef and jazz musician.\n“Gadi was a man full of humor who knew how to make those around him laugh. A musician at heart, a gifted flautist, he played in the IDF Orchestra and was involved with music his whole life,” the Hostages and Missing Persons Families Forum said in a statement, adding that Haggai’s family had asked for privacy.\nRead more: White House 'raises concerns' with Israel after two Christian women shot dead in Gaza\nImage: AFP via Getty Images) AFP via Getty Images)\nSome 80 of Kibbutz Nir Oz’s roughly 400 residents were taken hostage during Hamas' attach. It is unclear how Mr Haggai died.\nIt is thought that 129 of the 240 hostages abducted by Hamas on October 7 remain in Gaza. During a week long truce, 105 of them were released with four released beforehand.\nImage: AFP via Getty Images) AFP via Getty Images)\nOne has been rescued by IDF soldiers and three accidentally killed by them. The Israel Defense Forces has confirmed the deaths of 22 of those still held by Hamas.\nThe latest conflict between Israel and Hamas is by far the deadliest and most destructive of their five wars since the militant group seized the Gaza Strip in 2007.\nOver 20,000 Palestinians have been killed in Gaza since Israel launched a retaliatory invasion.\nImage: AP) AP)\nAround 1,200 were killed in Israel on October 7 and 139 IDF soldiers killed since the start of the Gaza ground offensive.\nThe United Nations says more than a half-million people are starving in Gaza because not enough food has entered the besieged territory as Israel keeps up its blistering campaign of airstrikes and ground operations.\nTens of thousands of displaced Palestinians are crammed into shelters and tent camps as winter descends, raising fears about the spread of disease. The U.N. Security Council has again delayed a vote on a new resolution to halt the fighting in some way, which would allow for an increase in humanitarian aid deliveries.\nTwo senior European Union officials said Friday that they are “deeply shocked” at an assessment that the entire population of Gaza is at risk of acute food insecurity because of the Israeli offensive there.\n“This is a grave development and should be a wake-up call for the whole world to act now to prevent a deadly human catastrophe,” EU foreign policy chief Josep Borrell and Crisis Management Commissioner Janez Lenarcic said in a statement.", "source_domain": "www.mirror.co.uk", "text": null, "title": "American citizen Gadi Haggai taken hostage by Hamas on October 7 confirmed dead", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/breaking-american-citizen-gadi-haggai-31734965"}