{"authors": ["Douglas Whitbread", "Image", "Archive Photos", "Getty Images Istockphoto"], "date_download": "2024-02-05 15:15:08", "date_modify": "None", "date_publish": "2024-01-28 17:32:26", "description": "The warning came as US president Joe Biden announced today that three US citizens had been killed on a drone strike in Jordan carried out by Iran-backed militias.", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fus-news%2Fworld-war-3-fears-expert-31987543.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31987572.ece/ALTERNATES/s1200/0_explosion-nuclear-bomb-in-ocean.jpg", "language": "en", "localpath": null, "maintext": "The warning came as US president Joe Biden announced today that three US citizens had been killed on a drone strike in Jordan carried out by Iran-backed militias.\nAn ex-UN weapons inspector warns Iran would have enough uranium to make 12 nuclear bombs in just five months, as fears of the possibility of World War Three grow.\nDavid Albright, an American physicist and a weapons expert, said the rogue state’s enrichment of uranium was a “hair’s breadth from 90 percent” - the level most desired to create a nuclear bomb. The chilling claim comes as Joe Biden announced today that three American servicemen were killed and “many” were wounded in a drone attack by Iran-backed militia in Jordan.\nThey were the first US fatalities in months of strikes against American forces across the Middle East by Iranian-backed militias amid the Israel-Hamas war in Gaza, increasing the risk of escalation.\nMr Albright said it was now an “unfortunate reality” that Iran's scientists already possessed the knowledge to build the earth-shattering doomsday weapon. And he revealed that the state could have enough of the radioactive material within one month for six weapons. While after five months, he said this could double.\nREAD MORE: Three US soldiers killed in Jordan drone attack in major Middle East escalation\nImage: Archive Photos) Archive Photos)\nWriting in a report published on the Institute for Science and International Security, which he founded, Mr Albright said: “The unfortunate reality is that Iran already knows how to build nuclear weapons, although there are some unfinished tasks related to the actual construction of them.\n“Today, it would need only about a week to produce enough for its first nuclear weapon. It could have enough weapon-grade uranium for six weapons in one month, and after five months of producing weapon-grade uranium, it could have enough for twelve.”\nMr Albright said condemnation of the country’s uranium enrichment programme had emerged as recently as December 28 last year from the United States and European allies. And this was due to Iran's decision to expand its output of enriched uranium from 60 percent to 90 percent. He said if this trend continued, Iran could be armed with dozens of nuclear weapons in the near future.\nMr Albright said: “This level of enrichment is a hair’s breadth from 90 percent enriched or weapon-grade uranium, the enrichment level most desired for making nuclear weapons. That is also the enrichment level used in Iran’s nuclear weapons designs, which it nearly perfected during its crash nuclear weapons program in the early 2000s, codenamed the Amad Plan.”\nFor all the latest news, politics, sports, and showbiz from the USA, go to The Mirror US\nImage: Getty Images/iStockphoto) Getty Images/iStockphoto)\nMr Albright said Iran could attempt to ‘accelerate’ their efforts so they could create a few “crude nuclear weapons” in the first half of this year. Alternatively, he said they could continue with their ‘Amad nuclear weapons program’ which would allow them to “serially produce annually many warheads”, which may be more difficult and time-consuming.\nHe said: “The accelerated program can be accomplished in a matter of six months and would involve activities conducted in far smaller, more disguisable facilities. This path is a more assured way for Iran to establish itself as a nuclear weapons power while leaving little time for the international community to react.”\nThe warning comes as tensions flare in the Middle East following the deaths of three US soldiers in the drone attack in northeast Jordan, near the border with Syria. Today, Joe Biden said the United States would “hold all those responsible to account at a time and in a manner our choosing.”\nHe added: “While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq.\" Since Israel's war on Hamas in the Gaza Strip began, U.S. troops in Iraq and Syria have faced drone and missile attacks on their bases.\nThe attack on Jordan marks the first targeting American troops in Jordan during the war. Biden, who was in Columbia, South Carolina, was briefed Sunday morning by Defense Secretary Lloyd Austin, national security adviser Jake Sullivan and principal deputy national security adviser Jon Finer", "source_domain": "www.mirror.co.uk", "text": null, "title": "Iran nuclear weapons: WW3 fears as expert warns Iran has enough uranium to make 12 bombs", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/us-news/world-war-3-fears-expert-31987543"}