{"authors": ["Associated Press", "Dailymail.Com Reporter"], "date_download": "2024-02-05 15:23:12", "date_modify": "None", "date_publish": "2023-12-21 14:20:16", "description": "Chairman of the Joint Chiefs of Staff General CQ Brown and his counterpart Gen. Liu Zhenli held a video call on Thursday in their first talks since August 2022.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12889993%2FU-S-Chinas-generals-speak-time-16-MONTHS-Senior-military-officers-hold-video-call-ease-tensions-Xi-warned-Biden-wanted-Taiwan-SOON.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/21/14/79213985-0-image-a-13_1703168344609.jpg", "language": "en", "localpath": null, "maintext": "The United States and China's top military officers have spoken for the first time in 16 months to try and ease tensions and avoid escalation.\nChairman of the Joint Chiefs of Staff General CQ Brown and his counterpart General Liu Zhenli held a video call on Thursday in their first talks since August 2022, when Beijing severed high-level communications in response to Nancy Pelosi's visit to Taiwan.\nTensions have been simmering in recent months, with China upping warnings over its desire to reunify with Taiwan and ships aircraft getting into confrontations in the Pacific and South China Sea.\nThe two superpowers have reopened channels after President Joe Biden and Xi Jinping held talks in San Francisco last month.\nXi reportedly gave Biden a blunt warning that China would soon 'reunify' with Taiwan, but insisted he would prefer to do it 'peacefully' and not by force.\nChairman of the Joint Chiefs of Staff General CQ Brown held a video call with his Chinese counterpart in the first top-level US-China military communication in 16 months\nThe U.S. has consistently viewed military communications with China as critical to avoiding misunderstandings between their armed forces.\nThe Pentagon also views talks as crucial to maintaining a peaceful Indo-Pacific region.\nBrown's call is the first Cabinet-level communication with China since Secretary of State Antony Blinken spoke on December 6 with Chinese Foreign Minister Wang Yi.\nWhile few details about Brown's call were released, a senior U.S. defense official and a senior military official said it was an important first step.\nThese are the kinds of discussions that the U.S. needs to have with China, they said, to avoid misunderstandings or miscalculations as the two militaries interact.\nThe two officials spoke to reporters on condition of anonymity to provide information before the call.\nThey said the U.S. is talking with China at various levels to work out a series of calls and meetings in the coming weeks and months.\nThey include plans to hold the bilateral Defense Policy Coordination Talks early next year and the possible resumption of the China-U.S. Military Maritime Consultative Agreement talks in the spring.\nIn August 2022, Beijing suspended all military contacts with the U.S. when Pelosi became the highest-ranking American lawmaker to visit Taiwan since Newt Gingrich in 1997.\nTensions have been simmering in recent months, with China upping warnings over its desire to reunify with Taiwan and ships aircraft getting into confrontations in the Pacific and South China Sea\nLittle details have been revealed of the call with China's General Liu Zhenli (above), but the U.S. has tried to reopen channels in recent months\nHer visit sparked a surge in military maneuvers by China.\nBeijing dispatched warships and aircraft across the median line in the Taiwan Strait, claiming the de facto boundary did not exist, fired missiles over Taiwan itself, and challenged established norms by firing missiles into Japan´s exclusive economic zone.\nThere also has been an increase in what the Pentagon calls risky Chinese aircraft and warship incidents.\nThe Defense Department in October released video footage of some of the more than 180 intercepts of U.S. warplanes by Chinese aircraft that have occurred in the past two years - more than the total number over the previous decade. In one of the more recent incidents, a Chinese pilot flew within 10 feet (3 meters) of a U.S. Air Force B-52, which was conducting routine operations over the South China Sea in international airspace.\nWhile officials touted the Brown-Liu call as an important initial move, the Pentagon has continued to express concerns about China´s aggressive military interactions in the Indo-Pacific and has worked to build alliances with other nations in the region.\nEarlier this month, Defense Secretary Lloyd Austin met with defense chiefs from Australia and the United Kingdom to forge a new agreement to increase technology cooperation and information sharing, as part of a broader effort to counter China's rapidly growing influence in the Indo-Pacific.\nThe two superpowers have reopened channels after President Joe Biden and Xi Jinping held talks in San Francisco last month. Xi reportedly gave Biden a blunt warning that China would soon 'reunify' with Taiwan , but insisted he would prefer to do it 'peacefully' and not by force\nChinese and Philippine naval and coast guard ships have confronted each other repeatedly around the shoal in the Spratly Islands in recent months\nThe new technology agreement is the next step in widening military cooperation with Australia that includes plans to help equip Sydney with a fleet of eight nuclear-powered submarines.\nAnd the defense leaders pointed to efforts by China to restrict freedom of navigation in the Indo-Pacific as a reason to bolster their cooperation.\nAlso, earlier this week, Admiral John Aquilino, head of U.S. Indo-Pacific Command, expressed concerns about the increased joint military actions by China and Russia in the region.\nSpeaking in Tokyo, he said it is far beyond a 'marriage of convenience' between Beijing and Moscow, and he urged China to stop escalating maritime confrontations with its neighbors.\nChina´s defense ministry, meanwhile, has criticized the U.S. for interfering in both Taiwan and the South China Sea, charging that American arms sales to Taiwan are making the situation more dangerous.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "U.S. and China's top generals speak for the first time in 16 MONTHS: Senior military officers hold video call to ease tensions after Xi 'warned Biden he wanted to take back Taiwan SOON'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12889993/U-S-Chinas-generals-speak-time-16-MONTHS-Senior-military-officers-hold-video-call-ease-tensions-Xi-warned-Biden-wanted-Taiwan-SOON.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}