{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Tom Ambrose", "Geneva Abdul"], "date_download": "2024-02-05 15:23:15", "date_modify": "None", "date_publish": "2023-12-21 02:15:32", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F20%2Fisrael-gaza-war-live-updates-ceasefire-hamas-chief-egypt-hostage-talks-palestine.json", "image_url": "https://i.guim.co.uk/img/media/60d8cdbf5798088dab9e00452dec7666f63b8039/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=709cf111cac697a0ceb448450b4a1331", "language": "en", "localpath": null, "maintext": "From 21 Dec 2023 02.36 CET Israel orders new evacuations from Khan Younis, says UN Israel ordered the evacuation of large areas of southern Gaza’s main city on Wednesday, the United Nations has said. The UN Office for the Coordination of Humanitarian Affairs (OCHA) said Israel had released maps showing new areas covering about 20% of Khan Younis that had been marked for evacuation, Agence-France-Presse reports. Before fighting broke out, the area was home to more than 110,000 people, OCHA said. The area now included 32 shelters that housed more than 140,000 internally displaced people, the vast majority from the north, it added. The Israeli army said on Wednesday that “ground, aerial and naval operations were carried out on dozens of terrorists and terrorist infrastructure” on military command and control centres in Khan Younis. Palestinians gather at the site of an Israeli strike on a house in Khan Younis, southern Gaza. Photograph: Bassam Masoud/Reuters\n21 Dec 2023 02.36 CET Israel orders new evacuations from Khan Younis, says UN Israel ordered the evacuation of large areas of southern Gaza’s main city on Wednesday, the United Nations has said. The UN Office for the Coordination of Humanitarian Affairs (OCHA) said Israel had released maps showing new areas covering about 20% of Khan Younis that had been marked for evacuation, Agence-France-Presse reports. Before fighting broke out, the area was home to more than 110,000 people, OCHA said. The area now included 32 shelters that housed more than 140,000 internally displaced people, the vast majority from the north, it added. The Israeli army said on Wednesday that “ground, aerial and naval operations were carried out on dozens of terrorists and terrorist infrastructure” on military command and control centres in Khan Younis. View image in fullscreen Palestinians gather at the site of an Israeli strike on a house in Khan Younis, southern Gaza. Photograph: Bassam Masoud/Reuters\n21 Dec 2023 02.03 CET Israel uncovers Hamas command centre in Gaza City, military says The Israeli military says it has uncovered a major Hamas command centre in the heart of Gaza City, inflicting what it described as a serious blow to the militant group. The army said it had exposed the centre of a vast underground network used by Hamas to move weapons, militants and supplies throughout the Gaza Strip. Associated Press reports that the Israeli military escorted Israeli journalists into Palestine Square in the heart of Gaza City on Wednesday to show off what it described as the centre of Hamas’s tunnel network. Military commanders boasted that they had uncovered offices, tunnels and elevators used by Hamas’s top leaders. The military released videos of underground offices and claimed to have found a wheelchair belonging to Hamas’s military commander, Mohammed Deif, who has not been seen in public in years. View image in fullscreen Israeli soldiers at the entrance of what the military said was another tunnel discovered earlier this month in Beit Hanun, northern Gaza. Photograph: Atef Safadi/EPA The army’s chief spokesman, Rear Adm Daniel Hagari, said it had located a vast underground complex. They all used this infrastructure routinely, during emergencies and also at the beginning of the war on October 7. Hagari said the tunnels stretched across Gaza and into major hospitals. The claims could not be independently verified.\nUpdated at 02.12 CET\n21 Dec 2023 01.38 CET The al-Ahli hospital in Gaza City is a “shell” of its former self due to lack of fuel, staff and supplies, and bodies have been placed in rows in its courtyard “as they couldn’t be given safe and dignified burials”, the head of the UN World Health Organisation (WHO) has said. Tedros Adhanom Ghebreyesus said WHO and UN had undertaken another joint visit to the al-Ahli and al-Shifa hospitals in northern Gaza, delivering medical supplies and supporting women giving birth. However, colleagues struggled to describe the immense impact recent attacks have had on these health facilities, and the catastrophic conditions remaining patients and health workers face. The WHO chief also said on X (formerly Twitter) that al-Ahli had been overwhelmed with patients needing emergency care. Until two days ago, al-Ahli was northern Gaza’s last hospital functioning where injured people could undergo surgery. But our team learned today that its operating theatres are no long functioning due to the depletion, or complete absence, of specialists, power, fuel, water, food and medical supplies. That has left north Gaza with no functional hospital. Only four hospitals operate at a minimum level, providing very limited care. Al-Ahli Arab Hospital is a “shell” of its former self due to lack of fuel, staff, supplies – @WHO/@UN mission to north #Gaza finds.\nWHO and UN partners undertook another high-risk joint mission today to Al-Ahli Arab and Al-Shifa hospitals in northern Gaza.\nOur teams delivered… pic.twitter.com/tlSI3gbawA — Tedros Adhanom Ghebreyesus (@DrTedros) December 20, 2023 Tedros also said 80 injured patients, including older people and small children, were sheltering in a church within the hospital grounds and in its orthopedic section. They included a 10-year old girl who lost her leg and had no family left to care for her, and an older man awaiting surgery for a gun wound to the chest he may never get, whose entire family had been killed. Without medicines and other essential needs, “all patients will die slowly and painfully”, Tedros said. A humanitarian ceasefire was needed now “more than ever”.\nUpdated at 01.42 CET\n20 Dec 2023 00.39 CET Amnesty International has called for an urgent investigation into Israel’s “enforced disappearance” of Palestinian detainees from Gaza, after reports of deaths in military detention centres. Hundreds of Palestinians are being held in detention centres in southern Israel, having been arrested in military operations across Gaza since war erupted on 7 October. “The Israeli military must urgently disclose the fate and whereabouts of everyone that it has detained since 7 October,” Heba Morayef, Amnesty’s regional director for the Middle East and North Africa, said in a statement on Wednesday. Israeli forces must specify the grounds of arrest for those detained and make every effort to provide families of those in its custody with information, particularly in light of the telecommunications blackouts that have cut off Gazans. Agence France-Presse also reports that Amnesty demanded an investigation into the “inhumane treatment and enforced disappearance” of the detainees from Gaza. The Israeli army said on Tuesday said it was investigating the deaths of detainees arrested in Gaza. It did not provide details regarding how many detainees had died or the circumstances of their deaths. On Tuesday the Israeli newspaper Haaretz reported that “several of them have died” in these detention facilities. The prisoners died at the Sde Teiman base near the city of Beersheva, it said. The detainees held at that facility were “blindfolded and handcuffed for most of the day and the lights are on at the facility throughout the night”, the report said. This is Adam Fulton picking up our live coverage – stay with us for all the latest developments\nUpdated at 00.40 CET\n20 Dec 2023 23.46 CET UN says it has 'disturbing' information alleging IDF soldiers killed 11 Palestinians in front of their families The UN human rights office (OHCHR) has said it received “disturbing” information alleging that Israel Defense Forces (IDF) summarily killed at least 11 Palestinian men in front of their family members in Gaza. A report by the OHCHR in the occupied Palestinian territory says the incident took place on 19 December in Al Remal neighbourhood in Gaza City, and come “in the wake of earlier allegations concerning the deliberate targeting and killing of civilians at the hands of Israeli forces”. Israeli soldiers reportedly surrounded and raided a building where several families were sheltering that night, the report says. The Guardian was unable to confirm the report’s allegations. The IDF has not responded to them. According to witness accounts, Israeli troops allegedly “separated the men from the women and children, and then shot and killed at least 11 of the men, mostly aged in their late 20s and early 30s, in front of their family members”, the report says. It continues: The IDF then allegedly ordered the women and children into a room, and either shot at them or threw a grenade into the room, reportedly seriously injuring some of them, including an infant and a child. The OHCHR said it has confirmed the killings at the buildings, although the details and circumstances of the killings are still under verification. It warned that the allegations “raises the alarm about the possible commission of a war crime”, and called for the Israeli authorities to immediately open an independent investigation.\nUpdated at 00.45 CET\n20 Dec 2023 23.23 CET At least 12 people killed in explosions near Rafah hospital, says Gaza health ministry Gaza’s health ministry has said at least 12 people were killed and dozens wounded in a series of explosions in Rafah in southern Gaza, near the border with Egypt. In a statement, the ministry said: Twelve martyrs and dozens of wounded, including women and children, were recovered from under the rubble when a house and a mosque were targeted hundreds of metres from Kuwaiti hospital. Video footage, which has been geolocated by CNN, show a series of powerful explosions and extensive damage to what appears to be a residential building. A mosque close to the Kuwaiti hospital was also struck, according to geolocated video. AFP has said its correspondents witnessed more than 10 airstrikes that hit several houses near the border. An Al Jazeera broadcast captured an explosion near the hospital in southern Gaza, while one of its correspondents was live on air. 00:01:00 Al Jazeera broadcast captures moment of explosion at Rafah building – video\n20 Dec 2023 23.03 CET The head of the World Health Organization (WHO) has said he is “deeply concerned” about the “toxic mix of disease, hunger and lack of hygiene and sanitation” that people in Gaza are facing. In a social media post, Tedros Adhanom Ghebreyesus warned that Gaza is “already experiencing soaring rates of infectious disease outbreaks”. Cases of diarrhoea among children aged under five are “25 times what they were before the conflict,” he said, adding: Such illnesses can be lethal for malnourished children, more so in the absence of functioning health services. I am deeply concerned about the toxic mix of disease, hunger and lack of hygiene and sanitation that people in #Gaza are facing right now.\nHunger weakens the body’s defenses and opens the door to disease.\nGaza is already experiencing soaring rates of infectious disease… pic.twitter.com/NVJdAt9KvZ — Tedros Adhanom Ghebreyesus (@DrTedros) December 20, 2023\nUpdated at 23.12 CET\n20 Dec 2023 22.57 CET Talks in Egypt attended by the political head of Hamas, Ismail Haniyeh, ended “without results”, a senior Palestinian official has said. The official told the BBC that Egypt “offered a proposal for another humanitarian truce” but that Hamas rejected the idea of a “temporary solution” to the war. Hamas has told Egypt that its position remains that “no exchange deal would happen before a final ceasefire”, the official said, adding: Talks will continue, the Egyptians are optimistic about the possibility of a breakthrough in the coming days, but they are convinced that the situation is difficult, and the negotiations will be difficult and long.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel orders new evacuations in southern Gaza, says UN - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/20/israel-gaza-war-live-updates-ceasefire-hamas-chief-egypt-hostage-talks-palestine"}