{"authors": [], "date_download": "2024-02-05 15:23:18", "date_modify": "None", "date_publish": "2023-12-21 13:36:01", "description": "Gen. CQ Brown, chairman of the Joint Chiefs of Staff, has spoken with his Chinese counterpart", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-joe-biden-taiwan-chinese-beijing-b2467875.html.json", "image_url": "https://www.independent.co.uk/img/shortcut-icons/favicon.ico", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nGen. CQ Brown, chairman of the Joint Chiefs of Staff, spoke with his Chinese counterpart on Thursday, in the first of what officials said will be renewed talks between the two nation's senior military leaders, as the Biden administration works to thaw relations with Beijing.\nThe video call between Brown and Gen. Liu Zhenli is the first senior military communications between the U.S. and China since August 2022, when Beijing suspended all such contacts after former House Speaker Nancy Pelosi’s visit to Taiwan. It comes on the heels of similar conversations between top U.S. and Chinese diplomats, all triggered by the meeting last month between U.S. President Joe Biden and China's President Xi Jinping.\nBiden's meeting with Xi, on the sidelines of the Asia-Pacific Economic Cooperation summit in San Francisco, was aimed in part at restoring the military talks amid escalating concerns about frequent unsafe or unprofessional incidents between the two nations’ ships and aircraft in the Pacific region.\nThe U.S. has consistently viewed military communications with China as critical to avoiding any missteps between their armed forces and to maintaining a peaceful Indo-Pacific region.\nBrown's call is the first Cabinet-level communication with China since Secretary of State Antony Blinken spoke on Dec. 6 with Chinese Foreign Minister Wang Yi.\nWhile few details about Brown's call were released, a senior U.S. defense official and a senior military official said it was an important first step. These are the kinds of discussions that the U.S. needs to have with China, they said, in order to avoid misunderstandings or miscalculations as the two militaries interact. The two officials spoke to reporters on condition of anonymity to provide information before the call.\nThey said the U.S. is talking with China at various levels to work out a series of calls and meetings in the coming weeks and months. They include plans to hold the bilateral Defense Policy Coordination Talks early next year and the possible resumption of the China-U.S. Military Maritime Consultative Agreement talks in the spring.\nIn August 2022, Beijing suspended all military contacts with the U.S. when Pelosi became the highest-ranking American lawmaker to visit Taiwan since 1997, when then-Speaker Newt Gingrich traveled there. Her visit sparked a surge in military maneuvers by China. Beijing dispatched warships and aircraft across the median line in the Taiwan Strait, claiming the de facto boundary did not exist, fired missiles over Taiwan itself, and challenged established norms by firing missiles into Japan’s exclusive economic zone.\nThere also has been an increase in what the Pentagon calls risky Chinese aircraft and warship incidents. The Defense Department in October released video footage of some of the more than 180 intercepts of U.S. warplanes by Chinese aircraft that have occurred in the past two years — more than the total number over the previous decade. In one of the more recent incidents, a Chinese pilot flew within 10 feet (3 meters) of a U.S. Air Force B-52, which was conducting routine operations over the South China Sea in international airspace.\nWhile officials touted the Brown-Liu call as an important initial move, the Pentagon has continued to express concerns about China’s aggressive military interactions in the Indo-Pacific and has worked to build alliances with other nations in the region.\nEarlier this month, Defense Secretary Lloyd Austin met with defense chiefs from Australia and the United Kingdom to forge a new agreement to increase technology cooperation and information sharing, as part of a broader effort to counter China’s rapidly growing influence in the Indo-Pacific.\nThe new technology agreement is the next step in widening military cooperation with Australia that includes plans to help equip Sydney with a fleet of eight nuclear-powered submarines. And the defense leaders pointed to efforts by China to restrict freedom of navigation in the Indo-Pacific as a reason to bolster their cooperation.\nAlso, earlier this week, Adm. John Aquilino, head of U.S. Indo-Pacific Command, expressed concerns about the increased joint military actions by China and Russia in the region. Speaking in Tokyo, he said it is far beyond a “marriage of convenience” between Beijing and Moscow, and he urged China to stop escalating maritime confrontations with its neighbors.\nChina’s defense ministry, meanwhile, has criticized the U.S. for interfering in both Taiwan and the South China Sea, charging that American arms sales to Taiwan are making the situation more dangerous.", "source_domain": "www.independent.co.uk", "text": null, "title": "Top US military officer speaks with Chinese counterpart as US aims to warm relations with Beijing", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-joe-biden-taiwan-chinese-beijing-b2467875.html"}