{"authors": ["Adry Torres", "Adry Torres For Dailymail.Com"], "date_download": "2024-02-05 15:23:18", "date_modify": "None", "date_publish": "2023-12-21 20:03:16", "description": "Colombian businessman Alex Saab may have recovered his liberty, but it does not necessarily mean that he will regain control of the mansion that Colombia confiscated three years ago.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12890683%2Falex-saab-mansion-Colombian-government-seized-Venezuelan-money-launderer-photos.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/21/20/79224479-0-image-a-12_1703188976805.jpg", "language": "en", "localpath": null, "maintext": "Colombian businessman Alex Saab may have recovered his liberty after the United States released the alleged money launderer in a prisoner swap with Venezuela, but it does not necessarily mean that he will regain control of the mansion that the government of Colombian confiscated three years ago.\nSaab, 51, returned to the Venezuelan capital of Caracas on Wednesday and was feted in a ceremony by communist President Nicolás Maduro broadcast live on state media.\nSaab, who also holds Venezuelan citizenship, spent 1,280 days in a United States prison awaiting the start of a money laundering trial following his extradition from Cape Verde, Africa, where he was arrested on June 12, 2020, while refueling a private jet at an airport during an official trip to Iran.\nHe was among 24 Venezuelans who were freed as part of an exchange for the release of 10 American, at least 20 Venezuelans who opposed the Maduro regime and the extradition of fugitive defense contractor Leonard ‘Fat Leonard’ Francis.\nColombian businessman Alex Saab reunited with Venezuelan President Nicolás Maduro on Wednesday after the United States released him from custody as part of a swap for 10 Americans who were jailed in the South American country, the released of 20 government opposition members and fugitive defense contractor Leonard ‘Fat Leonard’ Francis\nThe Colombian government confiscated a $7.6 million mansion that Alex Saab built. The government alleged Saab, a native of Colombia with citizenship in Venezuela, constructed the three-floor residence with illicit money\nSaab, according to the United States government enriched himself by helping Venezuelan regime leader Maduro defraud the oil-rich nation by siphoning off $350 million through state contracts that were meant to construct affordable housing for Venezuela’s government.\nWhile he was waiting in Cape Verde to be turned over to the United States, the Attorney General’s Office of Colombia seized seven properties from Saab.\nOne of the properties, a 15,000-square-foot mansion is reportedly worth $7.6 million and was allegedly constructed by Saab with illicit funds.\nThe mansion, which is currently up for sale, is located in the Caribbean coastal city of Barranquilla.\nA Colombian government official told DailMail.com that it will once again list the mansion for sale in January, 2024\nAlex Saab purchased two lots in northern Barranquilla and built a mansion that features a pool, movie theater and spa\nWalk-in closet at the mansion that Alex Saab built in Barranquilla, Colombia\nThe $7.6 million mansion features a tennis court located on the roof\nSaab built the home after he purchased two lots in the northern Barranquilla neighborhood of Riomar.\nThe three-story home has a red clay tennis court on the roof and a pool in the backyard.\nSaab set up separate rooms that functioned as a spa and movie theater.\nA Colombian government official told DailyMail.com that the property’s listing was temporarily deactivated from the website while they prepare to relaunch the site in January 2024.\nMaduro's government has insisted Saab was traveling to Iran to buy food and medical supplies when he was detained in Cape Verde.\nOfficials have not released the names of the Americans who will be released from Venezuelan prison, but there were reports on Tuesday that they included former United States special forces soldiers Luke Denman and Airan Berry, arrested by President Nicolás Maduro's forces after an alleged coup attempt\nAlex Saab, who was arrested on a U.S. warrant for money laundering in 2020, was released from custody Wednesday\nSaab was previously sanctioned by the U.S. Treasury Department for allegedly running a scheme that included Maduro's inner circle and stole hundreds of millions in dollars from food-import contracts at a time of widespread hunger mainly due to shortages in the South American country.\nA decade into the crisis, grocery stores are now fully stocked, but few can afford food. The monthly minimum wage is about $3.60, just enough to buy a gallon of water.\nThe administration of former President Donald Trump held out Saab as a trophy, spending millions of dollars pursuing the Colombian-born businessman. At one point, it even deployed a Navy warship to the coast of West Africa to warn the Venezuelans.\nMaduro's government has argued that Saab is a Venezuelan diplomat, entitled to immunity from criminal prosecution under international law.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Inside the 15,000-square-foot mansion Colombian government seized from Venezuelan money launderer Alex Saab who was freed by the US in exchange for 10 Americans and fugitive 'Fat Leonard'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12890683/alex-saab-mansion-Colombian-government-seized-Venezuelan-money-launderer-photos.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}