{"authors": [], "date_download": "2024-02-05 15:23:20", "date_modify": "None", "date_publish": "2023-12-21 14:08:20", "description": "The group of lawmakers who are focused on national security and concerned about the US-backed Israeli operation in Gaza includes several military veterans.", "filename": "https%3A%2F%2Fwww.huffingtonpost.co.uk%2Fentry%2Fmoderate-democrats-urge-joe-biden-to-pressure-israel-to-change-its-war-strategy_uk_658445c2e4b0fe4ffe325295.json", "image_url": "https://img.huffingtonpost.com/asset/6584239a240000310027e67f.jpeg?cache=e9bpJ6rWkT&ops=1200_630", "language": "en", "localpath": null, "maintext": "LOADING ERROR LOADING\nA group of six moderate House Democrats with national security backgrounds this week called on US President Joe Biden to pressure Israel to make “an immediate and significant shift of military strategy and tactics in Gaza,” amid renewed pressure on the country to enact a new cease-fire.\nThe Democratic lawmakers warned that the rising civilian death toll and the humanitarian crisis on the ground in Gaza are “unacceptable, not in line with American interests, nor do they advance the cause of security for our ally Israel.”\nAdvertisement\nThe letter dated Monday states, “We also believe it jeopardises efforts to destroy the terrorist organisation Hamas and secure the release of all hostages.”\nThe release of hostages has been one of the main objectives the country has set for the war. Last week, Israel Defense Forces mistakenly killed three Israeli hostages in Gaza, prompting fresh concerns about the conflict.\nThe letter’s signatories include Representatives Jason Crow (Colorado), Mikie Sherrill (New Jersey), Chrissy Houlahan (Pennsylvania), Seth Moulton (Massachusetts), Abigail Spanberger (Virginia) and Elissa Slotkin (Michigan).\nJoined NatSec Dems expressing deep concern to @POTUS for PM Netanyahu’s military strategy in Gaza.\n“The mounting civilian death toll and humanitarian crisis are unacceptable and not in line with American interests; nor do they advance the cause of security for our ally Israel.” pic.twitter.com/RzLjUeFFdz — Rep. Jason Crow (@RepJasonCrow) December 18, 2023\nAdvertisement\nThe lawmakers are members of the Intelligence, Armed Services, and Foreign Affairs Committees but said any efforts they’ve taken so far to push Israel to change course have fallen flat.\nThey stated that Israel’s campaign, which shows no signs of easing, could fail in eradicating Hamas.\n“We know from personal and often painful experience that you can’t destroy a terror ideology with military force alone. And it can, in fact, make it worse,” they said.\n“Accordingly, we urge you to continue to use all our leverage to achieve an immediate and significant shift of military strategy and tactics in Gaza,” the letter continues.\nSo far, more than 20,000 people have died in Gaza, according to local officials.\nNetanyahu has vowed the war, which was prompted by Hamas’ October 7 attack that killed about 1,200 Israelis and saw the kidnapping of hundreds, will continue “until the end.”\nUS Secretary of State Antony Blinken on Wednesday said he expects Israel to shift to a more targeted operation soon, which would “significantly” decrease harm to civilians.\nAdvertisement\n“It’s clear that the conflict will move and needs to move to a lower-intensity phase,” Blinken said.\nPressure is also growing on Israel to enact another ceasefire. Hamas’ leader visited Cairo to take part in discussions about a new pause in fighting that could involve a prisoner swap. The indirect talks between the two sides have been mediated by Egypt and Qatar. An Israeli official told The New York Times that while discussions were ongoing, no final agreement had been made.\nMeanwhile, the Biden administration has continued taking steps to stifle international efforts for accountability in Gaza.\nThe US is privately urging Switzerland to reject a request by Palestine and its allies to hold a conference on violations of the Geneva Conventions, State Department documents reviewed by HuffPost show.\nA United Nations Security Council resolution that could get more aid into Gaza has also been repeatedly delayed. It’s unclear how the US would vote on the matter.", "source_domain": "www.huffingtonpost.co.uk", "text": null, "title": "Moderate Democrats Urge Joe Biden To Pressure Israel To Change Its War Strategy", "title_page": null, "title_rss": null, "url": "https://www.huffingtonpost.co.uk/entry/moderate-democrats-urge-joe-biden-to-pressure-israel-to-change-its-war-strategy_uk_658445c2e4b0fe4ffe325295"}