{"authors": [], "date_download": "2024-02-05 15:23:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Israeli forces and Hamas militants engaged in fierce battles Tuesday in Khan Younis, the Gaza Strip’s second-largest city, while Gaza health official", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274069614%2Fun-security-council-to-vote-on-call-for-humanitarian-pause-in-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702976758.jpg", "language": "en", "localpath": null, "maintext": "Israeli forces and Hamas militants engaged in fierce battles Tuesday in Khan Younis, the Gaza Strip's second-largest city, while Gaza health officials reported deadly Israeli airstrikes near the Egyptian border.\nThe Hamas-run Gaza health ministry said Israeli strikes killed at least 20 people in Rafah.\nThe latest fighting came as the U.N. Security Council is scheduled to vote Tuesday on a resolution calling for a pause in fighting in Gaza to facilitate humanitarian aid deliveries for Palestinian civilians in need of food, water and medicine.\nThe vote had been expected Monday but was pushed back amid ongoing negotiations about the text of the resolution as backers sought enough support for its passage.\nA Security Council resolution calling for a humanitarian cease-fire failed earlier this month with the United States exercising its power as one of the veto-holding members of the council.\nThe U.N. General Assembly overwhelmingly approved a similar resolution last week, but those measures are non-binding.\nIsrael Minister of Defense Yoav Gallant, right, listens to his U.S. counterpart, Secretary of Defense Lloyd Austin, making a joint statement after their meeting about Israel's military operation in Gaza, in Tel Aviv, Dec. 18, 2023.\nU.S. Defense Secretary Lloyd Austin Monday stressed the importance of Israel curbing civilian casualties in densely populated Gaza and reiterated the \"unshakable\" U.S. commitment to supporting Israel in its war against Hamas.\nDuring a joint press conference in Israel with counterpart Yoav Gallant, Austin called for the return of the remaining hostages held by Hamas in Gaza and affirmed \"Israel's bedrock right\" to self-defense.\nAustin added that the United States \"will continue to urge the protection of civilians during conflict and to increase the flow of humanitarian aid into Gaza.\"\n\"We also have some great thoughts about how to transition from high-intensity operations to lower-intensity and more surgical operations,\" he said. \"We had great discussions on all of those issues.\"\nAustin also called for a postwar, two-state solution for Israel and its Palestinian neighbors, stressing that instability and insecurity only play in the hands of Hamas.\nGallant said Israel will gradually transition to the next phase of its operations in Gaza, allowing the local population to first return to the north of the coastal strip.\n'In every area where we achieve our mission, we will be able to transition gradually to the next phase and start working on bringing back the local population,' Gallant said. 'That means that it can be achieved maybe sooner in the north rather than in the south.'\nThree Israeli hostages appear in footage by Hamas at a location given as Gaza, in this still image obtained from handout video released Dec. 18, 2023. (Hamas Military Wing/Handout via REUTERS).\nHamas released a short video Monday showing three elderly male Israeli hostages sitting next to each other pleading for their unconditional release.\nSeventy-nine-year-old Chaim Peri, 80-year-old Yoram Metzger and 84-year-old Amiram Cooper were taken hostage by Hamas militants with about 240 others during Hamas' Oct. 7 terror attack on southern Israel.\nSitting in the middle, Peri speaks to the camera, saying he and other elderly hostages who have health issues are 'suffering greatly in very harsh conditions.'\nHamas, designated a terrorist organization by the United States, United Kingdom and European Union, posted the video on the Telegram messaging service. Israel Defense Forces spokesperson, Rear Admiral Daniel Hagari, called it 'a criminal, terrorist video' that shows 'Hamas' cruelty against very elderly civilians, innocents who need medical care.\"\n'Chaim, Yoram and Amiram - I hope that you hear me this evening,' Hagari said in a televised briefing. 'Know this: We are doing everything, everything, in order to return you back safely.'\nAfter Hamas posted the video, families of Israelis still held hostage by Hamas in Gaza protested outside Israel's Defense Ministry headquarters in Tel Aviv, demanding the immediate release of their loved ones.\nThe sun sets in Egypt across the border from the southern Gaza Strip near tents housing Palestinians displaced by the conflict in Gaza, in Rafah in the southern Gaza Strip on Dec. 18, 2023.\nIsrael vowed to destroy Hamas, which governs Gaza, after Hamas fighters crossed into southern Israel on Oct. 7. Israel said 1,200 people were killed and some 240 captives taken in the terror attack. More than 100 of the hostages remain in Gaza.\nThe Israeli response has killed more than 19,400 people in Gaza, according to the Hamas-run Health Ministry, which does not differentiate between civilian and combatant deaths. The U.N. estimates that thousands more Palestinians lie buried under the rubble in Gaza. Israel says 116 of its soldiers have died in its ground offensive.\nThe U.N. agency for Palestinian refugees, UNRWA, says the conflict has forced an estimated 85% of Gaza's population from their homes, with many of them trying to find a safe place to stay at U.N. shelters in southern Gaza that are several times over their intended capacity.\nSome information for this story came from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "UN Security Council to Vote on Call for Humanitarian Pause in Gaza", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274069614/un-security-council-to-vote-on-call-for-humanitarian-pause-in-gaza"}