{"authors": [], "date_download": "2024-02-05 15:15:09", "date_modify": "None", "date_publish": "2024-01-28 17:01:09", "description": "President Joe Biden says three American service members were killed and “many” were wounded in a drone strike in Jordan", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fjoe-biden-ap-americans-syria-iran-b2486296.html.json", "image_url": "https://static.independent.co.uk/2024/01/28/17/Biden_57166.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThree American service members were killed and “many” were wounded in a drone strike in Jordan, President Joe Biden said in a statement Sunday. He attributed the attack to Iran-backed militia groups.\nThey were the first U.S. fatalities in months of strikes against American forces across the Middle East by Iranian-backed militias amid the Israel-Hamas war in Gaza, increasing the risk of escalation.\nBiden said the United States “will hold all those responsible to account at a time and in a manner our choosing.”\nThe attack Saturday night took place in northeast Jordan, near the border with Syria.\nThere was no immediate reaction from Jordan, a kingdom bordering Iraq, Israel, the Palestinian territory of the West Bank, Saudi Arabia and Syria.\nU.S. troops long have used Jordan, a close American ally. as a basing point. Some 3,000 American troops typically are stationed in Jordan.\n“While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq,” Biden said in his statement.\nHe said the U.S. “will carry on their commitment to fight terrorism.”\nSince Israel’s war on Hamas in the Gaza Strip began, U.S. troops in Iraq and Syria have faced drone and missile attacks on their bases. The attack on Jordan marks the first targeting American troops in Jordan during the war.\nBiden, who was in Columbia, South Carolina, was briefed Sunday morning by Defense Secretary Lloyd Austin, national security adviser Jake Sullivan and principal deputy national security adviser Jon Finer.", "source_domain": "www.independent.co.uk", "text": null, "title": "Biden: Three Americans killed, 'many' wounded in drone attack by Iran-backed militia in Jordan", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/joe-biden-ap-americans-syria-iran-b2486296.html"}