{"authors": [], "date_download": "2024-02-05 15:23:22", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "West Jerusalem has displayed ?an appalling lack of distinction? in its war in Gaza, EU foreign policy chief Josep Borrell said\r\n\r\n\r\nEU foreign", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274069683%2Feus-top-diplomat-slams-israel.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1702980848.jpg", "language": "en", "localpath": null, "maintext": "West Jerusalem has displayed ?an appalling lack of distinction? in its war in Gaza, EU foreign policy chief Josep Borrell said\nEU foreign policy chief Josep Borrell has condemned what he described as Israel's indiscriminate targeting of civilians in Gaza in a post to social media on Monday, declaring an urgent need for a \"humanitarian pause.\"\n\"We are witnessing an appalling lack of distinction in Israel's military operation in Gaza,\" Borrell wrote, citing the recent deaths of \"worshippers, three Israeli hostages, and hundreds of other civilians\" at the hands of the Israel Defense Forces (IDF).\n\"Far too many civilians have been killed in Gaza, as pointed out among others also by the French, German, and UK foreign ministers,\" the diplomat continued. Borrell was referring to a Sunday op-ed co-authored by the UK's David Cameron and Germany's Annalena Baerbock, as well as comments made during a press conference by France's Catherine Colonna that same day.\nThe shooting of a Palestinian Christian mother and daughter at the enclave's only Catholic Church by an Israeli sniper on Saturday attracted condemnation from international religious leaders, including Pope Francis.\n\"They were shot in cold blood inside the premises of the Parish, where there are no belligerents,\" the Latin Patriarchate of Jerusalem said in a statement following the killing, stressing that no warnings had been given. The Israel Defense Forces are reportedly looking into the incident.\nOn Friday, the IDF killed three Israeli hostages who had escaped their captors in Shejaiya in what a preliminary report has concluded was a violation of the military's own rules of engagement. The three men were unarmed, wearing civilian clothing, and waving white flags, but they were shot by a soldier who allegedly felt threatened.\nBorrell last month warned Israel to heed international law in its campaign in Gaza and not give in to the desire for revenge over the October 7 attack by Hamas that left 1,200 Israelis dead. The foreign policy chief said that the conflict could not be \"solved with the mass exodus of more than two million\" people from the enclave.\nAt least 19,453 people have been killed in Israel's bombardment of the Palestinian enclave since October 7, the Gaza Health Ministry reported on Monday. Another 52,286 are said to have been wounded.\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "EU's top diplomat slams Israel", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274069683/eus-top-diplomat-slams-israel"}