{"authors": [], "date_download": "2024-02-05 15:23:27", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Britain will reportedly try to help Kiev reinforce its presence in the Black Sea\r\n\r\n\r\nThe UK will try to help the Ukrainian Navy boost its pres", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274069872%2Fuk-to-sign-naval-security-pact-with-ukraine-telegraph.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1702995233.jpg", "language": "en", "localpath": null, "maintext": "Britain will reportedly try to help Kiev reinforce its presence in the Black Sea\nThe UK will try to help the Ukrainian Navy boost its presence in the Black Sea as part of a new security pact, The Telegraph has reported. The document covers a ten-year period and will be signed in the coming weeks, the British newspaper has claimed.\nThe UK Defense Ministry announced last week that it would provide Kiev with two mine-clearing ships as part of a new maritime coalition also involving Norway. Britain has been one of Ukraine's staunchest backers in the conflict with Russia, furnishing it with weapons, military equipment, and training to the tune of around Pound 4.6 billion ($5.7 billion).\nIn its report on Monday, The Telegraph cited a British-Ukrainian Memorandum of Understanding (MoU) which purportedly aims to \"keep [Kiev] in the fight\" by providing military support focused on naval assets, intelligence, and financial aid.\nAnonymous defense sources told the newspaper that Britain would supply land- and air-based weaponry, with the aim of making Ukrainian forces more \"interoperable\" with NATO.\nThe Royal Navy has been training Ukrainian de-mining crews and drilling commandos for amphibious raids for some time. Last year, London handed over ship-based versions of the Brimstone missile to Kiev.\nUnder the new accord, Britain has also reportedly pledged to continue its Operation Interflex training program, which has already helped prepare 30,000 Ukrainian troops.\nAccording to The Telegraph, the new security pact contains post-conflict security guarantees, although a Defense Ministry spokesperson simply said the UK will continue backing Ukraine \"until the end of this war and beyond.\"\nLast Monday, UK Defense Secretary Grant Shapps announced that two Sandown Class mine countermeasure vessels (MCMVs) from the Royal Navy fleet would be transferred to Ukraine.\nRussian officials have consistently said that no amount of Western military aid will change the course of the conflict with Ukraine. Moscow has also repeatedly warned that such shipments raise the risk of a direct confrontation between NATO and Russia.\nMoreover, the Russian Defense Ministry previously accused the Ukrainian Navy of endangering civilian navigation in the Black Sea by planting hundreds of obsolete Soviet sea mines along its coastline. Some of the mines have ended up floating in open waters after being de-anchored by storms.\nLast spring, Türkiye and Romania reported detecting drifting ordnance in their territorial waters that appeared to be floating naval mines.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "UK to sign naval 'security pact with Ukraine Telegraph", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274069872/uk-to-sign-naval-security-pact-with-ukraine-telegraph"}