{"authors": [], "date_download": "2024-02-05 15:23:30", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "HONG KONG - After spending three years in prison, pro-democracy publisher Jimmy Lai is finally getting his day in court. His trial began in Hong Kong on", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274069095%2Fhong-kong-trial-of-pro-democracy-publisher-jimmy-lai-begins.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702931735.jpg", "language": "en", "localpath": null, "maintext": "HONG KONG - After spending three years in prison, pro-democracy publisher Jimmy Lai is finally getting his day in court. His trial began in Hong Kong on Monday in a national security case that is widely viewed as politically motivated.\nThe 76-year-old founder of the now shuttered Apple Daily newspaper is standing trial on charges under Hong Kong's harsh national security law.\nLai, who was arrested in 2020, is accused of 'collusion with foreign forces' under the national security law and sedition. He rejects the charges, and if convicted, he faces up to life in prison.\nLai's plight has become symbolic of the rapid downfall of Hong Kong's once lauded independent media landscape, which has been gutted in recent years.\nAfter coming into effect in 2020, Hong Kong's national security law has been used to take legal action against hundreds of people. Lai, whose trial is expected to last about 80 days, is among the most high-profile people to face charges under the law.\nPolice officers stand guard as an armored prison van carrying activist publisher Jimmy Lai leaves West Kowloon Magistrates' Courts, in Hong Kong, Dec. 18, 2023.\nThe British national is already serving a sentence of five years and nine months in a separate fraud case.\nThe British and American governments called on Hong Kong authorities to immediately release Lai.\n'As a prominent and outspoken journalist and publisher, Jimmy Lai has been targeted in a clear attempt to stop the peaceful exercise of his rights to freedom of expression and association,' British Foreign Secretary David Cameron said in a statement Sunday.\nWashington echoed London, with State Department spokesperson Matthew Miller saying, 'We urge Beijing and Hong Kong authorities to respect press freedom in Hong Kong.'\nIn response to Cameron's comments on the case, a spokesperson at China's embassy in the U.K. said, 'We firmly oppose and strongly deplore UK politicians' appalling acts of endorsing Jimmy Lai.' The spokesperson went on to urge the U.K. to 'stop sheltering anti-China, Hong Kong destabilisers' and 'stop smearing the National Security Law.'\nWearing a khaki blazer over a blue shirt, Lai waved at relatives and supporters when he entered the Hong Kong courtroom Monday. His wife, Teresa, was among those present.\nJimmy Lai's wife and son Lai Shun Yan leave the West Kowloon Magistrates' Courts during the break of the national security trial of media mogul Jimmy Lai, founder of Apple Daily, in Hong Kong, China, Dec. 18, 2023.\nOutside the heavily guarded courthouse, 67-year-old Alexandra Wong - a prominent pro-democracy activist known as Grandma Wong - staged a solitary protest, shouting slogans like 'Support Jimmy Lai! Stand for the truth!' before police officers led her away.\n'Jimmy Lai has contributed to Hong Kong for decades,' she told VOA's Cantonese service.\n'I support Jimmy Lai because I am a supporter of Apple Daily,' the activist Lui Yuk-Lin told VOA.\nLai is one of more than 250 others, including activists, lawmakers and protesters, jailed under the national security law and sedition charges.\nJimmy Lai's son Sebastien told VOA last week that he has no faith in Hong Kong's judiciary system.\n'This is a 76-year-old man who's been held in a maximum-security prison in solitary confinement,' Sebastien Lai said. 'There's no chance that he'll get a fair trial. The authorities have very deliberately decided to destroy their own legal system in order to target pro-democracy protesters.'\nThe trial is taking place without a jury and with three government-appointed judges, Sebastien Lai added. The Hong Kong government has also prevented Lai's choice of counsel, British lawyer Timothy Owen, from representing him.\n'So there's no semblance of a fair trial,' the younger Lai said.\nOther Hong Kong activists like Joey Siu agree.\n'This kangaroo court that is happening in Hong Kong right now is not a representation of a fair trial. It is not a representation of due process or any kind of judicial independence,' Siu told VOA. 'There's no such thing left in Hong Kong.'\nLast week, the Hong Kong police issued a bounty of 1 million Hong Kong dollars, or about $128,200, for the arrest of Siu, a U.S. citizen, and four other Hong Kong activists.\nSiu, who lives in exile in Washington, added she believes Hong Kong and Beijing are using Lai to intimidate other pro-democracy figures in Hong Kong.\n'They definitely want to use Jimmy's case as an example to deter activists who are still on the ground and those who have already gone into exile,' she said.\nMembers of the media wait outside the West Kowloon Magistrates' Courts during the national security trial of media mogul Jimmy Lai, founder of Apple Daily, in Hong Kong, China, Dec. 18, 2023.\nIn a statement, Caoilfhionn Gallagher, who leads Lai's international legal team, said the world would be watching the trial.\n'Today is a dark day in Hong Kong. A once vibrant city which thrived due to freedoms unknown in mainland China has now become a shadow of its former self,' the statement said.\nHong Kong's Security Bureau did not respond to VOA's email requesting comment. But the Security Bureau previously told VOA that the city's government is committed to defending press freedom.\nHong Kong's former chief executive Carrie Lam previously said the Apple Daily case was about 'a suspicious act of endangering national security,' not media freedom.\nBorn in the southern Chinese city of Guangzhou, Lai fled to Hong Kong as a stowaway on a boat when he was just 12 years old. He worked in a garment sweatshop before eventually founding the clothing brand Giordano.\nThe self-made millionaire founded the critical Apple Daily newspaper in 1995. It was considered Hong Kong's last independent newspaper when authorities forced it to close in 2021 after police froze millions of its assets, raided its office and arrested six top editors.\nShi Jianyu, a researcher at Taiwan's National Defense and Security Research Institute, told VOA's Mandarin service that Lai is noteworthy because his commitment to his beliefs never wavered.\n'If we trace it back to the 1989 Democracy Movement, it has been more than 30 years. Jimmy Lai is different from many other people involved in politics. Some people defected halfway,' he said. 'But Jimmy Lai did not change his attitude.'\nPress freedom groups also renewed calls for authorities to immediately release Lai.\n'The trial is a travesty of justice,' Beh Lih Yi, Asia program coordinator at the Committee to Protect Journalists, said in a statement. 'It may be Jimmy Lai who is in the dock, but it is press freedom and the rule of law that are on trial in Hong Kong.'\nVOA's China Branch, Iris Tong and Henry Ridgwell contributed to this report.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Hong Kong Trial of Pro-Democracy Publisher Jimmy Lai Begins", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274069095/hong-kong-trial-of-pro-democracy-publisher-jimmy-lai-begins"}