{"authors": ["Paul Rogers"], "date_download": "2024-02-05 15:23:32", "date_modify": "None", "date_publish": "2023-12-21 15:00:43", "description": "The official narrative has been that Hamas is weakened, but in reality the IDF’s doctrine of massive force is failing, says academic Paul Rogers", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F21%2Fisrael-losing-war-against-hamas-netanyahu-idf.json", "image_url": "https://i.guim.co.uk/img/media/a4f2481462dd623f97b5b4a26336e2729a05496f/0_192_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=ea3bfca07db7b2ebd3b09e053a7a4984", "language": "en", "localpath": null, "maintext": "Until recently the war narrative on Gaza has been very largely controlled by the Israel Defense Forces (IDF) and the country’s ministry of defence. Israel’s international reputation may have plummeted with the killing of more than 20,000 Palestinians, the wounding of more than 50,000 and the destruction of much of Gaza, but the IDF could still sell a plausible narrative of a severely weakened Hamas, even claiming that the war in northern Gaza was largely complete, and success in southern Gaza would follow before too long.\nThe narrative was helped by severe difficulties for the few journalists still operating in Gaza, including the risk to their personal safety, while the international press corps was stuck in Jerusalem and dependent on IDF sources for much of their information.\nThat changed as a different picture began to emerge. First there was a lack of evidence to support the IDF’s claim of a Hamas headquarters under al-Shifa hospital, then the IDF could not identify the location of the Israeli hostages, despite having some of the world’s most advanced intelligence.\nVery recently there have been two further incidents. On 12 December, there was a skilful triple ambush staged by Hamas paramilitaries in a part of Gaza supposedly controlled by Israeli forces. An IDF unit was ambushed and took casualties. Further troops were sent to aid that unit, and they were then ambushed, as were reinforcements.\nTen IDF soldiers were reported killed and other seriously wounded, but it was their seniority that counted, including as it did a colonel and three majors from the elite Golani Brigade. That Hamas, supposedly decimated and with thousands of troops already killed, could mount such an operation anywhere in Gaza, let alone a district reportedly already under IDF control, should raise doubts about the idea that Israel is making substantial progress in the war.\nA further indication came a few days later, when three Israeli hostages succeeded in getting away from their captors, only to be killed by IDF soldiers, even though shirtless and carrying a white flag. What has since made that worse, and is causing considerable anger in Israel, is that calls from the hostages were picked up by an audio-equipped IDF search-dog five days before they were killed.\nThere are other, wider indications of the IDF’s problems. Official casualty figures have shown more than 460 military personnel killed in Gaza, Israel and the occupied West Bank and about 1,900 wounded. But other sources suggest far greater numbers of wounded.\nTen days ago, Israel’s leading daily, Yedioth Ahronoth, published information obtained from the ministry of defence’s rehabilitation department. The head of the department, Limor Luria, was reported as saying that more than 2,000 IDF soldiers had been registered as disabled since the conflict began – with 58% of all those it had treated suffering from severe injuries to their hands and feet – suggesting a far higher casualty toll than the official figure. Meanwhile, the Times of Israel has reported the number of injured IDF soldiers, Israel Police and other security forces as 6,125. There have also been a number of friendly fire casualties, with the same paper reporting 20 out of 105 deaths due to such fire or accidents during fighting.\nOverall, the IDF is still following the well-rehearsed Dahiya doctrine of massive force in responding to irregular war, causing extensive social and economic damage, undermining the will of the insurgents to fight while deterring future threats to Israel’s security. But it is going badly wrong. Criticism is coming from unexpected quarters, including from the former UK defence minister, Ben Wallace, who has warned of an impact lasting 50 years. Even the Biden administration is becoming thoroughly uneasy at what is unfolding, yet Benjamin Netanyahu and the war cabinet are determined to continue for as long as they can.\nIt is worth recognising why. The 7 October attacks and the brutality involved struck Israel’s assumption of security to the core, which means that the great majority of Israeli Jews have so far continued to support Netanyahu’s response. Even that, though, is fraying and is made worse by the killing of the three hostages by IDF troops.\nAn effect of all this is that the IDF commanders are coming under huge pressure to succeed, and will go as far as the war cabinet will allow. Many of those commanders are highly intelligent if inevitably single-minded people, and will now know that for all Netanyahu’s rhetoric, Hamas, or at least Hamas’s ideas, cannot be defeated by military force. They also know that while talks are stalling, pressure from the families of hostages may soon result in another humanitarian pause. Therefore, their aim will be to damage Hamas as much as they can, as quickly as they can, while they can, whatever the cost to Palestinians. For evidence of this approach, witness this week’s intense air raids.\nWhat makes that possible is Netanyahu’s dependence on an extremist minority of religious fundamentalists and trenchant Zionists in his government. They would not have anything like the wider support in Israel were it not for the tragedy of 7 October, yet they are doing more and more harm to Israel’s long-term security. Not only does Israel risk becoming a pariah state, even among its allies, but it will also fuel a generation of radical opposition from a reconstituted Hamas or its inevitable successor.\nIt needs saving from itself, but that will depend, more than anything, on Joe Biden and the people around him. Perhaps pushed on by the rapidly changing public mood in western Europe, they must recognise their role in bringing an immediate end to this conflict.\nThis article was amended on 22 December 2023 to remove an unverified casualty figure for military personnel, and to include an equivalent figure from a different source.\nPaul Rogers is emeritus professor of peace studies at Bradford University and an honorary fellow at the Joint Service Command and Staff College\nDo you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel is losing the war against Hamas - but Netanyahu and his government will never admit it", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/21/israel-losing-war-against-hamas-netanyahu-idf"}