{"authors": [], "date_download": "2024-02-05 15:23:37", "date_modify": "None", "date_publish": "2023-12-21 04:28:32", "description": "After years of research and DNA testing, historians have identified the remains of an Army private from eastern New Mexico who died during World War II", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-albuquerque-new-mexico-army-france-b2467625.html.json", "image_url": "https://static.independent.co.uk/2023/12/21/04/WWII_Soldier_Identified_48644.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAfter years of combing through military records and making some key deductions, a team of U.S. government historians and researchers has finally put a name to case file X-3212, identifying an Army private from eastern New Mexico named Homer Mitchell who died during World War II.\nThe Defense POW/MIA Accounting Agency this week announced the findings, which were confirmed by laboratory testing and brought closure to Mitchell's family members.\nMitchell is one of nearly 160 service members who have been accounted for over the last fiscal year as part of a massive, yearslong effort headed by the federal agency. The list of service members from various conflicts who have yet to be accounted for tops 81,000, but officials say more than 37,000 of those — mostly from WWII — are considered to be recoverable.\nEach case can take years and involves poring through old reports and medical records, said Sean Everette, who leads outreach and communications for the agency.\nWork on Mitchell's case began in 2018. Researchers determined that X-3212 had to be one of three soldiers who went missing in the Pachten Forest along Germany's western border, with Mitchell being the strongest possibility.\n“It took nearly three years just for the historical research part. It then took the lab almost two more years before Mitchell could be positively identified,” Everette said.\nHearing the news was surreal for Mitchell's family, many of whom are military veterans themselves. Scattered from New Mexico to Oklahoma and Texas, they will be gathering next spring in Portales to bury the soldier.\nMind-blowing is how his great niece, Sonja Dennin, described the news, noting that it's been nearly 80 years since Mitchell died.\nMitchell, the youngest among his siblings, had enlisted in 1943 and underwent training at military bases on the other side of the country before shipping out to Europe.\nHis parents were devastated by his death and the lack of information back then added to the grief, Dennin said Wednesday during a phone interview.\n“He was so young and it was so painful to them — the way he was lost and not being able to properly bury him,\" she said.\nMitchell, 20, was killed on Dec. 10, 1944 as his battalion was hammered by heavy fire from German forces. The battle came just months after he and tens of thousands of other troops landed in Normandy and began their push toward Germany.\nThe intensity of the mortar and artillery strikes during that December battle made recovering the casualties impossible. It wasn't until after the war that the American Graves Registration Command was tasked with investigating and recovering missing American personnel in Europe.\nThey conducted investigations in the area between 1946 and 1950. They were unable to identify Mitchell’s remains among what was found and officially declared him Killed in Action in November 1951.\nIt was learned that after the battle someone buried Mitchell along with three other soldiers at the civilian cemetery in Hüttersdorf, Germany. Those unidentified remains were eventually interred in France, where they had remained until 2021 when historians were able to solidify the link to Mitchell.\nWork by the agency's laboratory then ensued.\n“They do have a methodical way of going about it,” Dennin said, “But, yes, it was comforting to know that when he was initially buried, whoever it was, took care to make sure that he was laid to rest.\"\nDespite remaining family members never getting the chance to know Mitchell, Dennin said they all know of him. An old oval framed portrait of him hung in the home of Dennin's great grandmother until her death. It was passed down to her grandmother and then to her father, who insisted that she take it one day.\nThat portrait will accompany Dennin and her family for the trip to Portales in the spring so it can be displayed during Mitchell's burial.", "source_domain": "www.independent.co.uk", "text": null, "title": "US historians ID a New Mexico soldier killed during WWII, but work remains on thousands of cases", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-albuquerque-new-mexico-army-france-b2467625.html"}