{"authors": ["Chris Mcgreal"], "date_download": "2024-02-05 15:23:39", "date_modify": "None", "date_publish": "2023-12-21 18:47:35", "description": "Committee to Protect Journalists says at least 68 journalists and media workers killed since 7 October", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F21%2Fisrael-idf-accused-targeting-journalists-gaza.json", "image_url": "https://i.guim.co.uk/img/media/15f9d4abab81aeffc69c28c714cea2f632240cda/0_328_4942_2965/master/4942.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=928706abaf4a5abd9d8a1be09730342b", "language": "en", "localpath": null, "maintext": "The Committee to Protect Journalists has accused the Israeli military of targeting journalists and their families in Gaza amid the highest death toll of media workers in any recent conflict.\nThe New York-based CPJ said at least 68 journalists and other media workers had been killed in Gaza, Israel and southern Lebanon since the Hamas cross-border attack on 7 October and subsequent Israeli assault.\n“More journalists have been killed in the first 10 weeks of the Israel-Gaza war than have ever been killed in a single country over an entire year,” it said.\n“CPJ is particularly concerned about an apparent pattern of targeting of journalists and their families by the Israeli military. In at least one case, a journalist was killed while clearly wearing press insignia in a location where no fighting was taking place. In at least two other cases, journalists reported receiving threats from Israeli officials and Israel Defense Forces officers before their family members were killed.”\nThe CPJ called for Israel to “end the longstanding pattern of impunity in cases of journalists killed by the IDF”.\nSixty-one of the journalists killed were Palestinian and three Lebanese. In addition, four Israeli journalists were among the 1,200 people, mostly civilians, killed by Hamas in the October attack.\nIsrael has killed at least 20,000 other Palestinians during the present war, about 1% of the population of Gaza, including more than 8,000 children.\nThe Paris-based group Reporters Without Borders has warned that “journalism is in the process of being eradicated in the Gaza Strip as a result of Israel’s refusal to heed calls to protect media personnel”.\n“Reporters there have no safe refuge and no way of leaving. They are being killed one after another. Since 7 October, the Palestinian territory has been subjected to a veritable eradication of journalism,” it said.\nThe CPJ said there was a “pattern of journalists in Gaza reporting receiving threats, and subsequently, their family members being killed”. It said the 90-year-old father of the Al-Jazeera journalist Anas Al-Sharif was killed by an Israeli airstrike on his home after multiple threats were made to his son.\n“The journalist told Al Jazeera that he had received multiple phone calls from officers in the Israeli army instructing him to cease coverage and leave northern Gaza. Additionally, he received voice notes on WhatsApp disclosing his location,” it said.\nThe CPJ has previously noted that an Israeli airstrike killed eight members of the photojournalist Yasser Qudih’s family following a report by the pro-Israel pressure group HonestReporting suggesting Qudih and three other Gaza-based photographers had prior knowledge of the Hamas attack on Israel. The Israeli foreign ministry retweeted a claim that “AP, CNN, NY Times, and Reuters had journalists embedded with Hamas terrorists on October 7th massacre”. A tweet by a former Israeli ambassador to the UN and member of parliament, Danny Danon, called for their “elimination”.\n“Major media outlets, including Reuters, rejected the claims,” said the CPJ. “HonestReporting subsequently withdrew the accusations, but its report prompted the Israeli prime minister’s office to tweet that the photographers were accomplices in ‘crimes against humanity’, and Israeli war cabinet member Benny Gantz to say they should be treated as terrorists.”\nEarlier this month, an Al Jazeera camera operator, Samir Abudaqa, was wounded in a drone strike and trapped in a UN school. When people attempted to rescue Abudaqa and take him for treatment, they too were shot. He died of his injuries several hours later.\nHuman Rights Watch and other groups found that an IDF attack that killed Reuters journalists Issam Abdallah and injured six others in southern Lebanon was probably a deliberate assault by the IDF on civilians.\nIsrael denies that it targets journalists, saying it only targets Hamas.\nJodie Ginsberg, the CPJ president, called on Israel to be more transparent about the orders given to soldiers in dealing with media workers.\n“It’s hard for us to really understand Israel’s attitude. It says that it doesn’t target journalists yet we have this deadly pattern. Because they will not release their rules of engagement, it’s hard for us to know what the terms are in which they’re viewing journalists who are obviously civilians and should never be targeted in war,” she said.\nIn May, the CPJ released a report documenting a “deadly pattern” of Israeli forces killing journalists even before the latest conflict in Gaza. The group examined the deaths of 20 journalists at the hands of the IDF over the past two decades and “found a pattern of Israeli response that appears designed to evade responsibility”.\n“Israel has never put a soldier on trial for an intentional or unintentional killing of a journalist,” the CPJ said.\nThe US state department spokesman, Matthew Miller, said earlier this week that it had “not seen any evidence that Israel is intentionally targeting journalists”. But Ginsberg said the US has a history of not holding Israel to account for killing journalists.\n“Last year, we had the killing of Shareen Abu Akleh, the Al Jazeera journalist who was a US citizen, and again we’ve really seen no accountability. She was killed in what seems to have been a targeted attack because she was shot in the neck between her helmet and her press jacket,” she said.\n“We’ve really not seen aggressive action from the US in pushing for an independent investigation or holding Israel to account. The US can do much more in terms of holding Israel to account and particularly in investigating whether or not any of these killings involved US weaponry.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli military accused of targeting journalists and their families in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/21/israel-idf-accused-targeting-journalists-gaza"}