{"authors": ["Alex Hammer", "Alex Hammer For Dailymail.Com"], "date_download": "2024-02-05 15:23:40", "date_modify": "None", "date_publish": "2023-12-21 05:45:22", "description": "The individuals - seen exiting a plane upon arrival at Joint Base San Antonio Kelly Annex - were freed earlier Wednesday, in exchange for the US release of an ally of Dictator Nicolas Maduro.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12888381%2Famericans-land-prisoner-swap-venezuela.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/21/05/79200525-0-Americans_freed_by_Venezuelan_President_Nicolas_Maduro_in_a_US_p-a-54_1703136182166.jpg", "language": "en", "localpath": null, "maintext": "Americans freed by Venezuelan President Nicolas Maduro in a US prisoner swap have been photographed landing at a US military base in San Antonio.\nThe individuals were seen exiting a plane upon arrival at Joint Base San Antonio Kelly Annex Wednesday night, hours after the US release of Alex Saab, a close ally of the dictator. Maduro succeeded Hugo Chavez in 2013.\n'I didn't know if I would ever make it out,' Savoi Wright, a Californian arrested in Venezuela in October, told Reuters after descending on the tarmac.\nAccused of laundering millions of dollars in government money at Maduro's behest, Columbian businessman Saab was granted clemency by Joe Biden Wednesday, after being arrested and extradited to the US in 2020.\nBiden Wednesday said he made the 'difficult decision' to absolve Saab so he could free prisoners opposed to the regime, including 10 US citizens. Six looked ecstatic upon touching down Wednesday, but four, for unknown reasons, went unseen.\nOne of the six, a middle-aged man, disembarked on a stretcher.\nScroll down for video:\nAmericans freed by Venezuelan President Nicolas Maduro in a US prisoner swap have been photographed landing at a US military base in San Antonio.\nThe individuals were seen exiting a plane upon arrival at Joint Base San Antonio Kelly Annex Wednesday night, hours after the US release of Alex Saab , a close ally of the dictator. One of the six, a middle-aged man, was seen disembarking on a stretcher\nAs Wright walked, he also sang the famed African-American spiritual: 'Free at last, free at last, thank God almighty, [I'm] free at last.'\nWright, a 38-year-old businessman, conceded he had feared for his life at times during his monthlong detainment, but was more than happy to look forward now that he was home.\nHe, like several others, was held under unclear allegations amid tensions with Maduro's government, and was likely being used as political pawns following the US failure to oust Maduro and install an opposition leader as Venezuela’s president.\nOthers seen were in similarly high spirits, including Eyvin Hernandez, one of three men accused of entering the county illegally through its border with Columbia.\nHernandez, a Los Angeles County public defender who had been imprisoned since March 2022, shook hands with defense officials overseeing the photo-op and appeared in good health.\nThe other two men accused of entering Venezuela illegally, Jerrel Kenemore and Joseph Cristella, were also present, and were seen lining up alongside Hernandez, Wright and fellow freed prisoner Jason Saad.\nSaad was arrested after being accused of being a homeless man living on the streets of the eastern city of Maturin, while Kenemore, 52, was cuffed over the alleged border offense way back in January.\n'I didn't know if I would ever make it out,' Savoi Wright, a Californian arrested in Venezuela in October, told Reuters after descending on the tarmac\nOthers seen were in similarly high spirits, including Eyvin Hernandez, one of three men accused of entering the county illegally through its border with Columbia\nHernandez, a Los Angeles County public defender who had been imprisoned since March 2022, shook hands with defense officials overseeing the photo-op,\nThe other two men accused of entering Venezuela illegally, (from left) Joseph Cristella and Jerrel Kenemore and, were also present, and were seen lining up alongside Hernandez, Wright, and fellow freed prisoner Jason Saad (center)\nSaad, seen here, was arrested after being accused of being a homeless man living on the streets of the eastern city of Maturin\nKenemore, far left, was cuffed over the alleged border offense way back in January. Cristella, to Kenemore's left, was cuffed in September 2022 after moving to the Dominican Republic for a contracting job and taking a trip to Colombia near the border, where he was seized\nFreed American prisoners who were released in Venezuela arrive at Joint Base San Antonio Wednesday\nThe freed Americans are seen smiling Wednesday after being wrongfully detained overseas\nThe last man out of the six, the only to appear injured, was Edgar Jose Marval Moreno, who was carried on a stretcher upon arrival, and was even photographed shedding tears of joy as he clutched a prayer card\nCristella, meanwhile, moved to the Dominican Republic for a contracting job last year, where he found love with a Venezuelan native and the two are engaged.\nIn an interview with Click Orlando, his family said the Orlando resident took a trip to Columbia to meet his fiancé near the Venezuelan border when he was suddenly detained in September of last year, and not seen since.\nThe last man out of the six, the only to appear injured, was Edgar Jose Marval Moreno, who was carried on a stretcher upon arrival, and was even photographed shedding tears of joy as he clutched a prayer card.\nAt several points, he cracked a toothy gear to photographers stationed around the military base, showing his faculties were still there and that he was ready to resume his normal life.\nThe extent of his health - as well as the reason behind his incarceration - was not immediately clear.\nIt was not immediately apparent where the other four Americans said to be part of the were being sent, with officials so far electing to not reveal their identities.\nHowever, it is believed that the four remaining men were jailed on charges that the US technically could not deem unjust, including two former Green Berets - Luke Denman and Airan Berry - who were caught in a May 2020 failed military incursion by Venezuelan dissidents. They were both hit with 20-year sentences.\nIt was not immediately apparent where the other four Americans said to be part of the were being sent, with officials so far electing to not reveal their identities.\nHernandez (C) steps off a plane upon arrival at Joint Base San Antonio Kelly Annex in Texas Wednesday night\nThe deal - aside from serving a breakthrough in relations between the two countries after months of sanctions and powerplays - comes after months of negotiations mediated by the country Qatar.\nIt saw not only Saab released, but a fugitive defense contractor known as 'Fat Leonard' as well, despite his being at the center of a sprawling Pentagon bribery scandal.\nAt points, Moreno cracked a toothy gear to photographers stationed around the military base, showing that his faculties were still there and that he was ready to resume his normal life\nThe extent of his health - as well as the reason behind his incarceration - was not immediately clear.\nThe succession of swaps has raised concerns that the US was incentivizing hostage-taking abroad and producing a false equivalence between Americans who are wrongfully detained abroad and foreigners who have been properly prosecuted and convicted in US courts\nDahud Hanid-Ortiz, a U.S. veteran wanted in Spain for the alleged killing in Madrid of two Cuban women and an Ecuadorian man, could also be one of the four remaining freed prisoners.\nSpecial Envoy for Hostage Affairs Roger Carstens, who accompanied the wrongfully detained Americans on the flight home, told the group: 'It does my heart good to see that you guys are back here on American soil.\n'It’s going to be an interesting transition for you, but at least you will be here in the loving embrace of the country and your families. Welcome home.'\nNot mentioning the four other men, Carstens confirmed that no other US citizens were being held in the South America country.\nThe deal - aside from serving a breakthrough in relations between the two nations after months of sanctions and powerplays - comes after months of negotiations mediated by the country Qatar.\nIt saw not only Saab released, but a fugitive defense contractor known as 'Fat Leonard' as well, despite his being at the center of a sprawling Pentagon bribery scandal.\nThe owner of a ship-servicing company in Southeast Asia, Leonard Glenn Francis Francis fled house arrest last September in Malaysia, but was instead extradited to the US to face justice.\nHis company overcharged the US military by more than $35 million for its services and plied officers with various gifts.\nThe corrupt officers then redirected military vessels to ports that were lucrative for his Singapore-based ship servicing company.\nFrancis was arrested in 2013 and pleaded guilty in 2015 to offering bribes.\nAlex Saab, who was arrested on a U.S. warrant for money laundering in 2020, was released from custody Wednesday\nVenezuela's President Nicolas Maduro - Sabb's friend and alleged string-puller- speaks during the notification ceremony for the referendum about the future of a disputed territory with Guyana\n'Fat Leonard', aka Leonard Glenn Francis is a Malaysian businessman who infiltrated the US Navy in Manila and blackmailed officers into giving him favors and shipping routes\nOfficials have not released the names of the other Americans who will be released from Venezuelan prison, but there were reports on Tuesday that they included former US special forces soldiers Luke Denman and Airan Berry, seen here after arrested by Maduro forces after an alleged coup attempt\nThe deal is the latest concession by the Biden Administration in the name of bringing home Americans jailed overseas.\nPerhaps the most high-profile prisoner exchange came last December when the US Government, over the objections of some Republicans in Congress and criticism from some law enforcement officials, traded Russian arms dealer Viktor Bout for WNBA star Brittney Griner.\nIran released five American detainees in September in exchange for the release of nearly $6 billion in frozen Iranian assets and two Iranian prisoners who had been jailed in the US.\nThe succession of swaps has raised concerns that the US was incentivizing hostage-taking abroad and producing a false equivalence between Americans who are wrongfully detained abroad and foreigners who have been properly prosecuted and convicted in US courts.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Joyful Americans land in Texas after being freed by Venezuela as part of a prisoner swap", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12888381/americans-land-prisoner-swap-venezuela.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}