{"authors": [], "date_download": "2024-02-05 15:23:41", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Defense Minister Sergey Shoigu has claimed that US, UK, and Polish military personnel are operating air defense and multiple launch rocket systems", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274070169%2Fnato-troops-directly-involved-in-ukraine-conflict-russia.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1703009626.jpg", "language": "en", "localpath": null, "maintext": "Defense Minister Sergey Shoigu has claimed that US, UK, and Polish military personnel are operating air defense and multiple launch rocket systems\nSeveral NATO member states have boots on the ground in the Ukraine conflict, Russian Defense Minister Sergey Shoigu has claimed. He alleged that Western military personnel are operating certain weapons systems, and that hundreds of satellites belonging to the US-led military bloc are providing Kiev with surveillance.\nSpeaking at a meeting of Defense Ministry officials on Tuesday, where President Vladimir Putin was also present, Shoigu stated that \"NATO service members are directly operating air defense systems, tactical ballistic missiles, and multiple launch rocket systems\" in Ukraine. He cited radio intercepts featuring English and Polish speakers. According to the minister, Western officers are also playing an active role in preparing Ukrainian military operations as well as training troops, both in their home countries and in Ukraine.\nRussian officials have repeatedly warned that ever-deepening Western involvement in the conflict unnecessarily increases the chances of a direct military confrontation between NATO and Moscow.\nThe Russian defense chief went on to claim that more than 5,000 foreign fighters have been killed since hostilities broke out in February 2022, with 1,427 Polish, 466 US, and 344 UK nationals among them.\n\"Working in the Ukrainian Armed Forces' interest are 410 NATO military and dual-purpose space devices,\" Shoigu estimated.\nHe also lauded Russia's defense industry for ramping up production in the past 18 months and helping prevent ammunition shortages on the front lines. \"Despite the sanctions, we are manufacturing more high-tech weaponry than NATO countries,\" Shoigu continued.\nThe minister concluded by stating that \"as of today, the Russian army is the best-prepared and most combat-ready in the world, armed with cutting-edge weapons tested in combat.\"\nPutin insisted at the same meeting that the West's efforts to inflict a strategic defeat on Russia have failed.\nSpeaking to the Ukrainian branch of US state-run broadcaster Radio Free Europe/Radio Liberty (RFE/RL) on Friday, Kiev's former ambassador to the UK, Vadim Prystaiko, claimed that Britain is developing plans to potentially deploy troops to Ukraine.\nThe diplomat, who was fired after criticizing Ukrainian President Vladimir Zelensky, went on to suggest that while Western officials will deny any such plans, foreign deployments are still possible under certain circumstances.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "NATO troops directly involved in Ukraine conflict Russia", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274070169/nato-troops-directly-involved-in-ukraine-conflict-russia"}