{"authors": [], "date_download": "2024-02-05 15:23:43", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Calls for a cease-fire in Gaza grow among some of Israel’s allies and by protesters at home after Israeli forces intensified their attacks on the enc", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274068276%2Fcalls-for-cease-fire-in-gaza-growing.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702879576.jpg", "language": "en", "localpath": null, "maintext": "Calls for a cease-fire in Gaza grow among some of Israel's allies and by protesters at home after Israeli forces intensified their attacks on the enclave overnight Sunday.\nBritish Foreign Minister David Cameron and his German counterpart, Annalena Baerbock, have called for a \"sustainable cease-fire\" in Gaza in a joint article published in Britain's Sunday Times.\n'Israel will not win this war if its operations destroy the prospect of peaceful co-existence with Palestinians,' they wrote.\nDuring a visit in Israel Sunday, French Foreign Minister Catherine Colonna called for an 'immediate truce' aimed at releasing more hostages, getting larger amounts of aid into Gaza and moving toward 'the beginning of a political solution.'\nIsrael could also face pressure to scale back major combat operations when U.S. Defense Secretary Lloyd Austin visits Monday. Washington is expressing growing unease with civilian casualties even while as it provides vital military and diplomatic support to Israel.\nIn an appearance on ABC's This Week, Senator Chris Van Hollen said that there are \"unacceptable high levels of civilian casualties\" in Gaza and added that the U.S. is seeing \"very loose rules of engagement\" there.\n\"We need to make sure that our [U.S.] values are reflected in this so long as we are providing all of this equipment,\" he stressed.\nTurkish Foreign Minister Hakan Fidan asked U.S. Secretary of State Antony Blinken in a call Sunday for Washington to use its influence over Israel to stop Israeli attacks on Gaza and the West Bank, a Turkish diplomatic source said.\nPalestinians inspect a debris field following an Israeli raid at Kamal Adwan hospital, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in the northern Gaza Strip, Dec. 16, 2023.\nFidan told Blinken that Israel should be made to sit at the negotiating table to discuss a two-state solution after a full cease-fire is achieved.\nPope Francis said Sunday, Israel was using 'terrorism' tactics in Gaza, decrying the reported killing by the Israeli military of two Christian women who had taken refuge at the Latin Patriarchate of Jerusalem, the Catholic authority in the Holy Land.\nThe Patriarchate said in a statement that an Israel Defense Forces (IDF) 'sniper' killed the two women and shot seven other people as they tried to protect others.\nAn Israeli Foreign Ministry spokesperson said the incident was still under review and had no immediate comment on the pope's words.\nIt was the second time in less than a month that the pope used the word 'terrorism' while speaking of events in Gaza.\nIsraeli soldiers are seen in a tunnel the military says Hamas militants used to attack the Erez crossing, in the northern Gaza Strip, Dec. 15, 2023.\nThe Kerem Shalom crossing between Israel and Gaza opened for aid trucks Sunday for the first time since the outbreak of war, officials said, in a move to double the amount of food and medicine reaching civilians in desperate need.\nThe World Health Organization said in a statement Sunday that a U.N. health mission at the emergency department of the Shifa Hospital in northern Gaza said the health facility resembled a 'bloodbath.' The health team was sent there to deliver medical and surgical supplies.\nThe WHO said there were hundreds of wounded patients, with new ones arriving by the minute and trauma injuries being stitched on the floor, with almost no pain management available.\nOut of 24 hospitals in Gaza, only four are still operational in north Gaza and three of those are barely functioning, the WHO said.\nThe Middle East has been a tinderbox since Iranian-backed Hamas launched a terrorist attack on Israel on Oct. 7, killing at least 1,200 people while taking about 240 hostages, according to Israel. Israel's response, with both airstrikes and a ground offensive, has killed more than 19,000 Palestinians, a large percentage of them women and children, according to the Hamas-run Gaza Health Ministry.\nSome information for this story came from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Calls for Cease-fire in Gaza Growing", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274068276/calls-for-cease-fire-in-gaza-growing"}