{"authors": [], "date_download": "2024-02-05 15:23:47", "date_modify": "None", "date_publish": "2023-12-20 01:06:57", "description": "North Korea and Russia have clashed with the United States, South Korea and their allies at an emergency U.N. Security Council meeting on Pyongyang’s latest intercontinental ballistic missile launch, which it called “a warning counter-measure” to threats from the U.S. and other hostile forces", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-north-korea-south-korea-pyongyang-russia-b2466971.html.json", "image_url": "https://static.independent.co.uk/2023/12/20/01/UN_North_Korea_09827.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNorth Korea and Russia clashed with the United States, South Korea and their allies at an emergency U.N. Security Council meeting Tuesday on Pyongyang’s latest intercontinental ballistic missile launch, which it called “a warning counter-measure” to threats from the U.S. and other hostile forces.\nNorth Korean Ambassador Kim Song said this is “the most dangerous year” in the military-security landscape on the Korean Peninsula, pointing to stepped up U.S.-South Korean military exercises and the U.S. deployment of nuclear-powered submarines and other nuclear assets to the area that have raised a “nuclear war danger.”\nThe U.S. and nine allies pointed to five North Korean ICBM launches, over 25 ballistic missiles launches and three satellite launches using ballistic missile technology this year, violating multiple Security Council resolutions and threatening “the peace and stability of its neighbors and the international community.”\nIn a statement read just before the council meeting by U.S. deputy ambassador Robert Wood, surrounded by diplomats from the other countries, the 10 countries condemned the latest ICBM launch on Dec. 17 and all launches before it.\nNorth Korea’s Song urged the international community to think about North Korea’s security concerns, calling its counter-measures an “absolutely reasonable, normal and reflective response” in exercise of its legitimate right to self-defense.\nHe warned the U.S. and South Korea that if they continue “with their reckless and irresponsible military threat,” North Korea’s armed forces “will never remain an onlooker to it and the provokers will be held entirely responsible for all the consequences.”\nNorth Korea will also “continue to build up its strategic power of a more advanced type to contain and control any threat from the U.S. and its followers with immediate, overwhelming and decisive counter-measures,” Song warned.\nThe Security Council imposed sanctions after North Korea’s first nuclear test explosion in 2006 and tightened them over the years in a total of 10 resolutions seeking — so far unsuccessfully — to cut funds and curb its nuclear and ballistic missile programs.\nThe last sanctions resolution was adopted by the council in December 2017. China and Russia vetoed a U.S.-sponsored resolution in May 2022 that would have imposed new sanctions over a spate of intercontinental ballistic missile launches. And the two veto-wielding council members have blocked any council action, including media statements, since then.\nThe 10 countries — Albania, Ecuador, France, Japan, Malta, South Korea, Slovenia, Switzerland, the United Kingdom and the United States — said silence from the Security Council “sends the wrong message to Pyongyang and all proliferators.”\nThey urged North Korea to abandon its unlawful nuclear and ballistic missile programs, “and instead invest in feeding the people in North Korea” and engage in diplomacy. They also urged all Security Council members to overcome their prolonged silence and uphold the nuclear nonproliferation regime.\nRussia’s deputy U.N. ambassador Anna Evstigneeva called attempts to condemn Pyongyang “a one-sided approach.”\nShe warned that the situation is escalating “to a dangerous brink,” pointing to both Pyongyang and Seoul justifying their hostile moves as self-defense. And she accused the United States of deploying its massive military machine in the region, saying this looks “more and more like preparations for an offensive operation,” even though the U.S. says it has no hostile intentions.\nEvstigneeva said Russia again calls for a peaceful settlement of all issues on the Korean Peninsula through political and diplomatic means “without external pressure.”\nWood, the U.S. deputy ambassador, countered that U.S. military exercises are defensive and it’s North Korea that has violated U.N. sanctions — not South Korea, Japan or the U.S. And he said the United States has tried repeatedly to have an unconditional dialogue with Pyongyang but it has refused.", "source_domain": "www.independent.co.uk", "text": null, "title": "North Korea and Russia clash with US, South Korea and allies over Pyongyang's latest missile launch", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-north-korea-south-korea-pyongyang-russia-b2466971.html"}