{"authors": ["David Lengel"], "date_download": "2024-02-05 15:15:11", "date_modify": "None", "date_publish": "2024-01-28 23:30:51", "description": "Minute-by-minute report: The defending champions overcame Lamar Jackson’s No 1 seeds to return to the Super Bowl", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fsport%2Flive%2F2024%2Fjan%2F28%2Fafc-championship-game-kansas-city-chiefs-v-baltimore-ravens-nfl-mahomes-jackson-latest-score-live.json", "image_url": "https://i.guim.co.uk/img/media/1c8610857009ed030701bb88cdf9c41219647957/0_131_3929_2358/master/3929.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=f2ce6625b24503ded02a4593a3992496", "language": "en", "localpath": null, "maintext": "28 Jan 2024 00.24 CET Ravens nosedive Baltimore held KC to 17 points, and shut them out in the second half. With a defensive performance like that, after a season like they had, they cannot lose this game at home. Bad penalties, a subpar rushing game, underwhelming QB play, key turnovers and a KC defense that deserves a lot of credit, sank the Ravens. They can’t lose this game, but they did. The recovery will be long and arduous.\n28 Jan 2024 00.21 CET Road Warriors Well if there was one thing you could say about the Chiefs during this tremendous run of success is that they never had to play big games on the road to get to a Super Bowl. Well, now they’ve knocked off the Bills and the Ravens, two very tough football environments, on consecutive weeks. That’s another box ticked. Now they’ll try to be the first team to win back to back Super Bowls since the 2004 Patriots And speaking of the Patriots, there’s been a lot of talk about Bill Belichick trying to become the all-time leader in head coaching wins, but here comes Andy Reid into the mix, six years younger with an all-time great QB. Reid is in that mix for sure as an Hall-of-Fame coach, even more so if he picks up another ring in Vegas.\n28 Jan 2024 00.12 CET Chiefs 17-10 Ravens, Final The Chiefs run out the clock and are heading back to the Super Bowl for the fourth time in five seasons. That is the stuff of sports dynasties!\n28 Jan 2024 00.09 CET Two minute warning It’s 2nd and 11, Pacheco steams ahead for a few – it’s a two-yard gain. Timeout Baltimore – they’re all out. 3rd. & 9. Now Mahomes goes back to pass, he’s got a man, it’s Marquez Valdes-Scantling, who makes the catch while back peddling! It’s a first down and way more and this game is all but over!\n28 Jan 2024 00.06 CET Chiefs 17-10 Ravens, 2;24 4th quarter The Ravens get done for too many men on the field. Yikes. On 1st and 5, someone jumped offside. Who was it? No, it’s a personal foul on Smith! OK, so now it’s 1st & 10, which is easier to hold han 1s & 5. Interesting way to do it, ok. Pacheco runs on first down and loses a yard. It’s 2nd & 11. Timeout Baltimore – they have one left.\n28 Jan 2024 00.03 CET FIELD GOAL! Chiefs 17-10 Ravens, 2;34 4th quarter It’s good from 43. It’s a one score deep? Should Baltimore try an onside kick? No way. They kick it deep.\n28 Jan 2024 00.01 CET Chiefs 17-7 Ravens, 2;39 4th quarter Under three minutes remaining: on 2nd & 5, McDuffie breaks up a pass heading for Beckham over the middle. 3rd & 5: Jackson, he’s patient, throws it away. But a Ravens receiver is held and thrown down – no flag! So a field goal try coming up to try and make it a one score game.\n28 Jan 2024 23.59 CET Chiefs 17-7 Ravens, 3:17 4th quarter Hill has a catch and he’s down to the KC 30. Defensive ackle Wharton is down for KC – that stops the clock. So, both teams have two timeouts, the Ravens are down two scores. This is doable, crazier things have certainly happened, but the margarin for error is Neopolitain crust thin.\n28 Jan 2024 23.56 CET Chiefs 17-7 Ravens, 3:43 4th quarter Jackson is sacked! And that’s no good! It’s George Karlaftis, who had that fumble recovery earlier, and a sack right now! Suddenly, it’s 3rd & 6…Jackson in the shotgun, little toss to Hill, who bobbles the ball and finally makes the catch for a first down. We’re under four minutes left around midfield.\n28 Jan 2024 23.54 CET Chiefs 17-7 Ravens, 5:00 4th quarter So now with a two-score lead, we are most definitely in chew the clock time, while Baltimore need that ball back as quickly as possible. It’s 3rd & 8 on the KC 27 and Baltimore elect to use a precious timeout, which kind of makes sense. Reid runs it with Pacheco to chew a bit more clock, he’s short of the first down and here’s another KC punt. Good return up to the Ravens 46! Still, a lot of work to do and so little time.\n28 Jan 2024 23.50 CET INTERCEPTION! Chiefs 17-7 Ravens, 6:45 4th quarter Jackson throws a terrible pass into all kinds of traffic in the middle of the endszone, and Bush, who recently entered he game when Edwards left, makes he grab for KC! That was so so poor from Jackson, and smacked of desperation. That really should ice this game.\n28 Jan 2024 23.47 CET Chiefs 17-7 Ravens, 6:55 4th quarter Jackson hits Beckham, again, and then Edwards picks up three for the first down. The clock stops because Edwards is down for KC. This is happening very slowly for Baltimore. So this helps! Agholor has a 39-yard gain on the far sideline! They’re suddenly down to the KC 25!\nUpdated at 23.48 CET\n28 Jan 2024 23.44 CET Chiefs 17-7 Ravens, 8:17 4th quarter On 3rd & 1, Jackson is looking, looking, looking, tries a. last second run, but there’s nowhere to go. Jackson takes a loss and it’s 4th & 3 at the Ravens 18. They’re lining up to go for it! They get the first down! Beckham over the middle. Wow. Breathe now Ravens fans!\nUpdated at 23.45 CET\n28 Jan 2024 23.43 CET Chiefs 17-7 Ravens, 9:40 4th quarter From the one, the long road begins for Baltimore. Jackson goes long for Bateman down the far sideline – it’s overthrown. Now he hits Likely on the sideline – 10 yards, first down. Next play – Odell Beckham, remember him, is streaking down the field, but Jackson overthrows him. The crowd wanted a flag but there’s nothing.\n28 Jan 2024 23.39 CET Chiefs 17-7 Ravens, 10:35 4th quarter It’s 3rd & 13 – this is HUGE. Which is why I used caps. Baltimore blitzes. It’s incomplete! KC will punt. Baltimore will begin at the one! What a punt! Wow! But aside from that, consider how good KC was on offense and how the Ravens have shut them down in the second half. That’s significant. Imagine the momentum Baltimore would have if Flowers doesn’t fumble in the endzone?\n28 Jan 2024 23.35 CET Chiefs 17-7 Ravens, 11:21 4th quarter Now Clowney hits Mahomes late, lowering his head. that’s roughing the passer. Another sloppy flag on Baltimore and it’s a no brainer. That pushes KC across midfield, as if they needed any help. Baltimore’s D must rescue this team! This is a start – they sack Mahomes, who takes his first playoff sack in four games according to CBS TV in the US. Madubuike has the sack!\n28 Jan 2024 23.33 CET Chiefs 17-7 Ravens, 13:24 4th quarter So that just pops the balloon in Baltimore, big time. We were a few inches from a three-point game. And now, welll… …now the Chiefs have it, and they’ve even converted on a 3rd & 7! Mahomes, to Kelce yet again. Meanwhile, Flowers has cut his finger after slamming it on the bench following the fumble. There’s some anger management conversations that need to be had with Mr Flowers. First taunting, then hurting yourself, no good. KC call time, their first.\n28 Jan 2024 23.29 CET FUMBLE! Chiefs 17-7 Ravens, 14:52 4th quarter Jackson finds Flowers, who leaps towards the endzone, but the ball is knocked out by Sneed just before he lands! That’s a fumble and a touchback! No need to challenge that, clear as day, KC ball! Oh wow!\n28 Jan 2024 23.27 CET Chiefs 17-7 Ravens, end 3rd quarter So, what sayeth the Ravens? Jackson says much! A huge strike to Flowers who is wide open on the near side and finally taken down at the 10! That’s a 54-yard play…reduced by 15 because Flowers gets up and taunts Sneed. Flags fly! You can’t do that! Why did he do that? Man oh man. So the Ravens are on the 25 instead. But Jackson comes right back and finds Flowers again, this time cutting across the field, for 14 yards! On the next play, Jackson hits Bateman for a short gain, about two yards. And that’s how the quarter ends. So, Baltimore are on the KC 9 and it’s 2nd & 8. Hard to believe Baltimore can cut this game to three with a TD here, but it’s a true story! And that’s mostly thanks to their defense.\n28 Jan 2024 23.21 CET I cannot imagine how many people turned down the Super Bowl Halftime Show before they settled on Usher. It has been 20 YEARS since \"Yeah!\" @LengelDavid — Hunter Felt (@HunterFelt) January 28, 2024 Sadly, we’ll never know. But it must be an astronomical number.\n28 Jan 2024 23.20 CET Chiefs 17-7 Ravens, 0:49 3rd quarter Ravens great Terrell Suggs emerges from under the stadium to try and energize a crowd that doesn’t have much to be happy about. But this helps matters some: it’s already 3rd & 7. So Mahomes is in the shotgun, being pushed back towards the endzone by Washington, and the Chiefs QB throws it away! So again, the Ravens defense holds! After the punt, Baltimore will try to kickstart their offense at their own 36.\n28 Jan 2024 23.15 CET Chiefs 17-7 Ravens, 2:31 3rd quarter On 2nd & 5, Jackson is looking for Andrews – incomplete. And to make it worse, a holding call on Simpson backs up Baltimore by 10 yards. On 2nd & 15, Jackson from the shotgun, finds Andrews, who slides into the catch near the sideline. So by that math, it’s 3rd & 9. Big play – and KC are blitzing! Reid wraps up Jackson! So Baltimore punts from their own territory down to the KC eight yard line. Once again, KC’s defense holds Jackson and company. And with the 1o-point deficit, in the rain, and time ticking and tocking, it seems like it’s getting late early in Baltimore. The Ravens “D” really needs to make something happen.\n28 Jan 2024 23.10 CET Chiefs 17-7 Ravens, 4:55 3rd quarter Jackson narrowly avoids a sack, and then on the next play, throws a strike in the backfield to Hill, sho streaks down the near sideline for a first down to the KC 42.\n28 Jan 2024 23.09 CET Chiefs 17-7 Ravens, 5:29 3rd quarter Jackson throws left and hits Collins, who is hit out of bounds after an eight yard gain. Now Jackson is waiting, loses patience and is off! He runs for 12, so the Ravens have a little bit of momentum here as the rain falls in Baltimore. Ball at the Ravens 47.\n28 Jan 2024 23.05 CET Chiefs 17-7 Ravens, 7:05 3rd quarter Mahomes spins left, turns right, throws a screen to Pacheco who is going nowhere! So Baltimore hold off KC for a second consecutive possession. The defense is holding their end of the bargain, but Jackson and company need to get it together on offense. The punt goes into the endzone for a touchback. Here comes Jackson and the Ravens offense.\n28 Jan 2024 23.03 CET Chiefs 17-7 Ravens, 7:49 3rd quarter Taylor gets done for holding again, (third time today) pushing KC back into their own territory. It’s 3rd & 13. Big play time for Baltimore.\n28 Jan 2024 23.02 CET Chiefs 17-7 Ravens, 9:12 3rd quarter Mahomes, like clockwork! He finds Watson, who is streaking across the field, for a first down and a 16-yard gain. Now KC are at midfield after Valdes-Scantling makes a catch on the far sideline – a seven-yard gain. Then Kelce takes a forward lateral for a few yards and a first down. This drive is alive, and moving briskly. Baltimore need to make a play here. Ball on the Baltimore 43.\n28 Jan 2024 22.59 CET Chiefs 17-7 Ravens, 11:08 3rd quarter So a pair of three-and-outs, and now KC take up their second drive of the half. Mahomes starts off with a pass to Rice, but he’s hit hard by Queen for a loss of a yard. Now Pacheco runs to his right to the far sideline for five yards. It’s 3rd & 6.\n28 Jan 2024 22.56 CET Chiefs 17-7 Ravens, 12:13 3rd quarter On first down, Edwards is absolutely torn down by Reid – no gain. Then Flowers runs an end around for four, setting up 3rd & 6. Jackson, from the shotgun, throws a terrible pass that’s nearly, and should have been, intercepted by Kansas City. Yuck, that was gross. That’s a bad sequence of football for Baltimore. They kick it back to the KC 21.\n28 Jan 2024 22.52 CET Chiefs 17-7 Ravens, 13:35 3rd quarter We’re back, and so is Kelce, who has a catch to get the Chiefs within three yards of a first down at their own 33. Mahomes scammers back and throws up a floater, and it’s knocked down, incomplete. So that’s a good start for the Baltimore defense. After the punt, the Ravens start at their own 22.\n28 Jan 2024 22.46 CET The numbers Mahomes: 20/25, 161 yards, 1 TD, 106.8 rtg Loved up Kelce: nine catches for 96 yards, 1TD Pacheco: 14 carries for 41, 1 TD Jackson: 5/12 67 yards, 1 TD, 1 fumble lost Flowers: two catches for 39 yards, 1 TD Jackson: four carries for 27 yards The big number is time of possession: Chiefs - 20:39, Ravens - 9:21 Baltimore have been thoroughly outplayed in their own backyard. The score could have been worse. Yet, they’re still in it!\n28 Jan 2024 22.37 CET Chiefs 17-7 Ravens, halftime So that will do it for the first half. One which the Ravens barely had the ball, and one which the Ravens high flying offense was smothered by KC’s defense. Mahomes, amazing. Kelce, amazing. Really, this team is smelling a dynasty right now. This is dynasty football.\n28 Jan 2024 22.34 CET FIELD GOAL! Chiefs 17-7 Ravens, 0:04 2nd quarter It’s good! So now the Chiefs are up 10, and could have been up 13 had Andy Reid not been so greedy earlier in the game, going for it on that 4th & 1 deep in Ravens territory. Regardless, he’s going to be happy going into the lockers after a half like this.\n28 Jan 2024 22.33 CET Chiefs 14-7 Ravens, 0:08 2nd quarter Mahomes finds Kelce for nine yards, and that brings up 4th & 15 and a 52-yard kick attempt for Harrison Butker. Will he have enough leg?\n28 Jan 2024 22.32 CET Chiefs 14-7 Ravens, 0:12 2nd quarter Rice catches a screen pass and waltzes into the endzone, but that’s coming back with a second consecutive holding call on Smith! Wow! And Smith was nowhere near the play – bad bad bad. So it’s 3rd & 24 and KC are out of field goal range, all the way back at the 42. They need about eight yards to get into field goal range. Baltimore calls timeout.\n28 Jan 2024 22.30 CET Chiefs 14-7 Ravens, 0:20 2nd quarter Mahomes takes it himself for the first down, but there’s a holding call on Smith that brings it back! That means it’s 3rd & 14. Huge play here.\n28 Jan 2024 22.28 CET Chiefs 14-7 Ravens, 0:26 2nd quarter Rice has a catch on an out route, a six-yard catch. He stops the clock by running out of bounds. Now they’re in the red zone. It’s 2nd & 4. Mahomes in the shotgun, hit as he throws, incomplete looking for Gray. Big third down here.\n28 Jan 2024 22.27 CET Chiefs 14-7 Ravens, 0:36 2nd quarter Travis Kelce is open at the far yard marker and has yet another catch! Timeout KC at the Baltimore 23. They have two timeouts left.\n28 Jan 2024 22.26 CET Chiefs 14-7 Ravens, 0:43 2nd quarter So if the Chiefs get points here and then come out in the second half and get points, that’s no good for the Ravens. So a really crucial drive coming up. Pacheco gets hit for a loss, and then we have some extra curricular activities with flags flying. Kyle Van Noy, the third guy in a little skirmish for the Ravens, gets done for unsportsmanlike conduct for jawing and pushing with Kelce. Kelce loves this off course. So that doesn’t help the Ravens and either does this roughing the passer penalty by Jones! He basically punches Mahomes in his grill, and suddenly, the Chiefs are close to midfield after 30 yards of stupid penalties.\n28 Jan 2024 22.20 CET Chiefs 14-7 Ravens, 1:46 2nd quarter Jackson is looking for Hill and a first down but it’s incomplete! It forces a punt, 42 yards down to the KC 11. Can we talk about what KC’s defense has done to mute this high flying Ravens offense, on the road? Pretty special performance so far.\n28 Jan 2024 22.18 CET Chiefs 14-7 Ravens, 1:56 2nd quarter Jackson floats a pass down the far sideline looking for Agholor, but it’s incomplete. It’s 3rd & 4 and Ravens HC John Harbaugh wants to talk it over. They have two timeouts left.\n28 Jan 2024 22.15 CET Two minute warning Jackson connects with Likely for a six yard completion as the clock rolls down to the warning. The ball is on the Baltimore 47 and it’s 2nd & 4.\n28 Jan 2024 22.12 CET Chiefs 14-7 Ravens, 2:47 2nd quarter Mahomes throws deep to Rice but Hamilton has him well covered – incomplete. It’s raining in Baltimore, and now it’s 3rd & 10. Mahomes, in the shotgun – Hamilton is blitzing from the corner position, and Mahomes has to throw it away! The Ravens defense finally shows it’s pointy beak, forcing KC’s first punt! And the timing is excellent. The kick is short, just 31 yards, and the Ravens will have a chance to tie this thing up with pretty good field position, starting on their own 41. Remember, the Chiefs get the ball after halftime, so Baltimore really need some points here.\n28 Jan 2024 22.05 CET Chiefs 14-7 Ravens, 3:49 2nd quarter The Chiefs are applying pressure and Jackson barely gets the ball away, so that’s an incompletion setting up 3rd & 9 instead of much worse. But then Chris Jones slaps away Jackson’s pass and now Stout has to come out for his second punt. It’s a 49-yard kick to the Chiefs 29. The Ravens fail to capitalize on Andy Reid’s greed and now KC will have a chance to put a stamp on this first half.\n28 Jan 2024 22.02 CET Chiefs 14-7 Ravens, 4:42 2nd quarter Jackson runs right and picks up four yards. Now Jackson throws and the ball is batted into the air. The ball is high in the air! It’s way way up there! It finally comes down and Jackson has it! He caught his own pass! A 13-yard gain to the Ravens 31. Wow!\n28 Jan 2024 22.00 CET Chiefs 14-7 Ravens, 6:18 2nd quarter Another Kelce catch – he’s the playoff record holder for receptions – but he’s short of the first down. On 4th & short, Pacheco is running into the pack – did he get it? It doesn’t look like it! That’s a huge play for the Ravens! Andy Reid elects to go for it instead of an easy kick for three, and he pays the price. That was really silly. KC just gave life to the Ravens. What’s wrong with a 10-point AFC Championship lead? Gordon Gecko said greed is good. Not in the NFL.\n28 Jan 2024 21.56 CET Chiefs 14-7 Ravens, 7:01 2nd quarter Mahomes is in the shotgun on 2nd & 9. He has a lot of time, really way to much. He moves right before throwing the football away. That means we have a big 3rd & 9.\nUpdated at 21.56 CET", "source_domain": "www.theguardian.com", "text": null, "title": "AFC Championship Game: Kansas City Chiefs 17-10 Baltimore Ravens - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/sport/live/2024/jan/28/afc-championship-game-kansas-city-chiefs-v-baltimore-ravens-nfl-mahomes-jackson-latest-score-live"}