{"authors": ["Germania Rodriguez Poleo", "Germania Rodriguez Poleo For Dailymail.Com"], "date_download": "2024-02-05 15:23:49", "date_modify": "None", "date_publish": "2023-12-20 14:34:30", "description": "Alex Saab, who was accused of helping Maduro defraud the rich-oil nation by serving as his top money-launderer, and arrested in 2020 and awaiting trial.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12885847%2FBiden-administration-Alex-Saab-Prisoner-Swap-Venezuela-Nicholas-Maduro.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/20/14/79172723-0-image-m-13_1703082749902.jpg", "language": "en", "localpath": null, "maintext": "The Biden administration has released a close ally of Venezuelan dictator Nicolás Maduro in a swap for jailed Americans, in the latest sign of the US government's desire to normalize relations with the socialist nation.\nAlex Saab, who was accused of helping Maduro defraud the rich-oil nation by serving as his top money-launderer, was arrested in 2020 and awaiting trial after pleading not guilty. He was released from custody on Wednesday.\nIn exchange, Maduro agreed to free up to 36 prisoners, including the 10 US citizens who were imprisoned in Venezuela.\nConvicted defense contractor Leonard 'Fat Leonard' Francis, a Malaysia native, will also be extradited to the US as part of the deal. The Americans released from Venezuelan prison included former US special forces soldiers Luke Denman and Airan Berry, who were arrested by Maduro forces after a rogue coup attempt in 2019.\nAlso detained in Venezuela were US citizens Eyvin Hernandez, Jerrel Kenemore and Joseph Cristella, who are accused of entering the country illegally from Colombia. More recently, Venezuela arrested Savoi Wright, a 38-year-old California businessman.\nAlex Saab, who was arrested on a U.S. warrant for money laundering in 2020, was released from custody Wednesday.\nOfficials have not released the names of the Americans who will be released from Venezuelan prison, but there were reports on Tuesday that they included former US special forces soldiers Luke Denman and Airan Berry, arrested by Maduro forces after an alleged coup attempt\nSaab's release would be seen as a major concession to Maduro, an authoritarian leader who is himself the target of a $15 million U.S. reward\nSecretary of State Anthony Blinken said on Wednesday there is no higher priority for the US than 'doing everything we possibly can to bring our citizens out of harm's way and make sure they're safe and secure if they get in trouble overseas or are arbitrarily detained.'\n'We also focused on political prisoners [in Venezuela and trying to assure their release,' Blinked added. 'We have a lot of work going on and we hope to have some good news to share later today.'\nThe White House said in a statement: 'Today, ten Americans who have been detained in Venezuela have been released and are coming home, including all six wrongfully detained Americans.\n'These individuals have lost far too much precious time with their loved ones, and their families have suffered every day in their absence. I am grateful that their ordeal is finally over, and that these families are being made whole once more.'\nThe U.S. has long accused Saab of being a bag man for Maduro. Saab's release would be seen as a major concession to Maduro, an authoritarian leader who is himself the target of a $15 million U.S. reward for anyone bringing him to New York to face drug trafficking charges.\nThe chavista regime, which had led a massive campaign to obtain Saab's release, has announced a formal celebration at the Miraflores presidential palace on Wednesday night.\nThe deal will anger the Venezuelan opposition, who have of late criticized the White House for standing by as the leader of the OPEC nation has repeatedly outmaneuvered the U.S. government after the Trump administration´s maximum pressure campaign failed to topple him.\nIn October, the White House eased sanctions on Venezuela´s oil industry, promising to reimpose the restrictions if Maduro by November 30 didn´t live up to his promise to pave the way for free and fair elections next year.\nAlso detained in Venezuela are US citizens Eyvin Hernandez (left), and Joseph Cristella, who are accused of entering the country illegally from Colombia\nJerrel Kenemore was also arrested in Venezuela after being accused of illegally crossing the border from Colombia\nCalifornia businessman Savoi Wright, 38, was detained in November by Venezuelan authorities under unclear accusations\nThat deadline passed and so far Maduro has failed to reverse a ban blocking his chief opponent, María Corina Machado, from running for office. Additionally, he jailed aides of Machado and threatened to invade neighboring Guyana.\nSaab, 51, was pulled off a private jet during a fuel stop in Cape Verde en route to Iran, where he was sent to negotiate oil deals on behalf of Maduro´s government. The charges: conspiracy to commit money laundering tied to a bribery scheme that allegedly siphoned off $350 million through state contracts to build affordable housing for Venezuela´s government.\nMaduro´s government has insisted Saab was traveling to Iran to buy food and medical supplies when he was detained in Cape Verde. Saab was previously sanctioned by the U.S. Treasury Department for allegedly running a scheme that included Maduro´s inner circle and stole hundreds of millions in dollars from food-import contracts at a time of widespread hunger mainly due to shortages in the South American country.\nA decade into the crisis, grocery stores are now fully stocked, but few can afford food. The monthly minimum wage is about $3.60, just enough to buy a gallon of water.\nThe Trump administration held out Saab as a trophy, spending millions of dollars pursuing the Colombian-born businessman. At one point, it even deployed a Navy warship to the coast of West Africa to warn the Venezuelans.\nMaduro´s government has argued that Saab is a Venezuelan diplomat, entitled to immunity from criminal prosecution under international law.\nThe chavista regime, which had led a massive campaign to obtain Saab's release, has announced a formal celebration at the Miraflores presidential palace on Wednesday night\nSaab is seen with his former model wife Camilla, who campaigned for his release\nSaab's wife (far left) is seen posing with Venezuelan dictator Nicolas Maduro and his wife Cilia Flores, as well as other members of the socialist regime\nBut his defense lawyers said last year in a closed-door hearing that before his arrest, Saab had been secretly talking to the U.S. Drug Enforcement Administration, helping authorities untangle corruption in Maduro´s inner circle and agreeing to forfeit millions of dollars in illegal proceeds from corrupt state contracts.\nThe deal is the latest concession by the Biden administration in the name of bringing home Americans jailed overseas. The most notable prisoner exchange came last December when the U.S. government, over the objections of some Republicans in Congress and criticism from some law enforcement officials, traded Russian arms dealer Viktor Bout for WNBA star Brittney Griner.\nThe succession of swaps has raised concerns that the U.S. is incentivizing hostage-taking abroad and producing a false equivalence between Americans who are wrongfully detained abroad and foreigners who have been properly prosecuted and convicted in U.S courts. Biden administration officials say securing the freedom of wrongfully detained Americans and hostages abroad is a core government priority that requires difficult dealmaking.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden administration releases Maduro ally Alex Saab in exchange for at least 10 Americans jailed in Venezuela", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12885847/Biden-administration-Alex-Saab-Prisoner-Swap-Venezuela-Nicholas-Maduro.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}