{"authors": ["Rachel Hagan", "Image", "Afp Via Getty Images"], "date_download": "2024-02-05 15:23:50", "date_modify": "None", "date_publish": "2023-12-20 16:00:20", "description": "Russia's military commanders are ignoring complaints from its troops that they were suffering bouts of fever, now believed to be brutal \"mouse fever\"", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fmouse-fever-makes-you-bleed-31719030.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31244004.ece/ALTERNATES/s1200/0_Military-operation-in-Ukraine-Donetsk-16-Mar-2022.jpg", "language": "en", "localpath": null, "maintext": "Russia's military commanders are ignoring complaints from its troops that they were suffering bouts of fever, now believed to be brutal \"mouse fever\"\nA disease known as \"mouse fever\" that causes people to bleed from their eyes is \"mowing down\" frontline Russian troops, Ukrainian officials have claimed.\nThe country's Main Intelligence Directorate (HUR) reported an outbreak of the disease among Russian units in Kupyansk, as troops are struggling with a lack of winter provisions. It said the disease, a type of streptococcal infection, is transmitted to humans through direct contact with rodents, or by inhaling their faeces. Listing several symptoms, it said it can cause a \"severe headache, body temperature rising to 40 degrees, rashes and redness, decreased blood pressure, haemorrhages in the eyes, nausea and vomiting several times a day\".\nThe agency claimed complaints about the outbreak have been ignored by Russian commanders, who consider it an excuse to avoid fighting. On Telegram the directorate wrote: \"In the Kupyansk direction of the front of the occupiers, mouse fever is mowing down en masse. As a result, mouse fever significantly reduced the fighting ability of Russian rats.\n\"Complaints about fever from personnel of the Russian army, who are involved in the war against Ukraine, were ignored by the command, regarding them as another manifestation of evasion from participating in combat operations. In addition, at the first stage of the course, 'mouse fever' resembles an ordinary flu.\"\nImage: AFP via Getty Images) AFP via Getty Images)\nIt comes as Ukraine's armed forces are taking up a more defensive posture after their summer counteroffensive failed to achieve a major breakthrough against Russia’s army and as winter weather sets in after almost two years of war.\n\"In recent weeks, Ukraine has mobilized a concerted effort to improve field fortifications as its forces pivot to a more defensive posture along much of the front line\", the U.K. Ministry of Defense said in an assessment. The Kremlin’s deep defenses held firm against Ukraine’s monthslong assault, using Western-supplied weapons but without essential air cover, along the around the 600-mile front line.\nRussian President Vladimir Putin is hopeful that Kyiv's Western allies will grow weary of financing the costly Ukrainian war effort, allowing the Kremlin's forces to make a new offensive push next year against a weaker foe. He has put the Russian economy on a war footing to prepare for that.\nBut Ukrainian President Volodymyr Zelenskyy said Tuesday that he’s certain the United States will make good on its promise to provide billions of dollars in further aid for Kyiv to continue its fight. Meanwhile, Ukrainian air defences intercepted 18 of 19 Russian Shahed-type drones overnight, the Ukraine air force claimed Wednesday. Also, Russia fired two S-300 ballistic missiles at Kharkiv in the northeast of Ukraine, it said. No casualties were reported.", "source_domain": "www.mirror.co.uk", "text": null, "title": "'Mouse fever' that makes you bleed from the eyes 'mowing down' Russian troops in Ukraine", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/mouse-fever-makes-you-bleed-31719030"}