{"authors": ["Associated Press", "Joseph Michalitsianos For Dailymail.Com"], "date_download": "2024-02-05 15:23:52", "date_modify": "None", "date_publish": "2023-12-20 14:08:17", "description": "Leonard Glenn Francis, the Malaysian owner of a ship-servicing company in Southeast Asia who is the central character in one of the largest bribery scandals in Pentagon history, will be extradited.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12885753%2FThe-US-released-ally-Venezuelas-president-swap-jailed-Americans-AP-learns.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/20/19/49671149-0-_Fat_Leonard_aka_Leonard_Glenn_Francis_the_Malaysian_businessman-a-9_1703101059049.jpg", "language": "en", "localpath": null, "maintext": "A prisoner exchange deal between the US and Venezuela to free 10 Americans will include extraditing 'Fat Leonard' back to California.\nThe US freed a close ally of Venezuelan President Nicolás Maduro in exchange for the release of the Americans imprisoned in the South American country.\nAlex Saab, a Maduro associate who was arrested on a US warrant for money laundering in 2020, was long regarded as a criminal trophy by Washington.\nThe deal also included the return of fugitive defense contractor Leonard Glenn Francis, nicknamed 'Fat Leonard', who is at the center of a massive Pentagon bribery scandal, officials said on Wednesday.\n'Fat Leonard', aka Leonard Glenn Francis is a Malaysian businessman who infiltrated the US Navy in Manila and blackmailed officers into giving him favors and shipping routes\nFrancis, the Malaysian owner of a ship-servicing company in Southeast Asia, is the central character in one of the largest bribery scandals in Pentagon history.\nHe fled house arrest last September and requested asylum in Venezuela, but will instead be packed off back to the US to face justice.\nHis company overcharged the US military by more than $35 million for its services and plied officers with various gifts.\nThe corrupt officers then redirected military vessels to ports that were lucrative for his Singapore-based ship servicing company.\nFrancis was arrested in 2013 and pleaded guilty in 2015 to offering bribes.\nHe then flipped after his arrest and agreed to testify against the Navy as part of a sweeping prosecution by the Department of Justice's that remains ongoing; seven Navy officers are still awaiting trial and Francis is the star witness.\nThe date of his sentencing had been put off for years as he continued to assist prosecutors. He was preparing to appear on the witness stand in a trial earlier this year to testify against five former naval officers, but he was never called.\nFour of the officers were convicted while the jury was deadlocked on a fifth.\nFrancis is shown with Rear Admiral Bolivar, who was investigated as part of the scandal\nFrancis fled home custody in San Diego in September 2022 and was arrested by Venezuelan police attempting to board a flight at the Simon Bolivar International Airport outside Caracas\nFrancis fled home custody in San Diego on September 4, 2022, by shearing off his GPS ankle bracelet.\nThe crooked contractor ensured his escape by housing court-appointed security guards in windowless garages, keeping no visitor logs, and allowing no night patrols.\nHe was certainly helped by the fact that nobody physically checked on him until six hours after his GPS ankle bracelet registered a problem, and only tried to reach him with calls and texts.\nCourt filings show Francis most recently lived in a $7,000-a-month, five-bedroom, seven-bathroom home in a gated community before he fled.\nWhen officers arrived at the home, it was completely emptied out - apart from the discarded GPS monitor.\nNeighbors witnessed U-Haul moving trucks coming to and from Francis' home in the days before his escape.\nFrancis then fled to Mexico before moving on to Cuba, and then turned up in Venezuela and was arrested at Bolivar International Airport outside Caracas on September 20 as he tried to board a flight to Russia.\nA picture showing a disheveled Francis after he was caught attempting to flee to Russia was released by Interpol Venezuela\nNavy commander Michael Misiewicz, center, lies flat on his back in a boxing ring during Fight Night at a Manila nightclub in a photograph introduced as part of a federal court exhibit\nFrancis last year boasted in a podcast about plying admirals with booze and prostitutes, and the sweet informant deal he struck with the US government.\n'Everybody was in my pocket. I had them rolling around in my palm. I had the Navy by their balls. I turned my torpedo, my guns against them, because they betrayed me,' Francis says in one episode of a nine-part series.\nHe also revealed that the government had arranged for visas for his whole family, saying: 'Everybody came legally. Uncle Sam knows, everybody knows what I'm doing. My children are my children.\n'My wellbeing is more important than anyone else… I am their star witness,' Francis said.\nIn one episode of the podcast, he spoke proudly about going after Michael Misiewicz, a commander who he supplied with prostitutes in Tokyo in exchange for secret shipping routes to Australia.\n'Misciewicz had value, you know, he was like the number two guy in the scheduling department.\n'If you look at him, he's actually a really nice guy, very gentle personality, friendly, great dad to his kids, womanizer...' Francis said, adding that his number two - New Yorker Edmond Aruffo - 'embedded' him.\n'They wanted to have the good life that they could not have. They wanted the fine dining, the fine gifts, hotel rooms, sedans, luxury cars, watches, handbags, fancy meals, alcohol, cigars,' he said.\nHe was arrested in 2013 and pleaded guilty to a massive bribery scheme in 2015 in what has been described as the biggest corruption plot in modern Naval history\nFat Leonard, aka Leonard Glenn Francis, on his warship - the USS Braveheart - which he bought. He is obsessed with American culture and speaks with an American accent, despite never having lived in the US at the time\nFrancis had infiltrated Misiewicz's family and friends while he was working on the USS Blue Ridge out of Manila in 2011.\nHe gave him and his family tickets to the Lion King in Tokyo, bought his wife Marcy a Gucci handbag when she became suspicious of him, and arranged for Michael to sleep with prostitutes in Tokyo on a regular basis.\nThe scheme came crashing down in 2013 after Marcy Misiewicz, Michael's wife, suspected he was cheating on her and confronted him. He struck her and she reported it to the NCIS, which started filtering through Michael's emails.\nAmong them were exchanges with Francis, where Michael had supplied secret shipping routes to Australia.\nFrancis, who had a spy in the NCIS, found out and tried to placate her but he was eventually arrested, along with Misiewicz, who was sentenced to seven years in prison.\nFrancis also suggested that some of the most senior admirals he corrupted were being protected by the Navy, a claim that is bolstered by the fact that some were disciplined in military courts, whereas others were pursued by the Department of Justice.\n'Some of the more senior admirals got handled by the Navy because then they can be brushed under the carpet, it's little more than a slap on the wrist, they call it 'different spanks for different ranks'.\n'If you're an admiral you don't get punished to the same degree as if you're junior,' Wright said.\nThe case has resulted in federal criminal charges against 34 Navy officials, defense contractors, including Francis, and the Glenn Defense Marine Asia corporation.\nSo far, 26 of those have pleaded guilty and many have been sentenced to several years in prison.\nNavy Rear Admiral Robert Gilbeau (left) was sentenced to 18 months in prison and Commander Michael Misiewicz (right) was sentenced to six years\nCaptain Jeffrey Breslau (left) was sentenced to six months and Rear Admiral Bruce Loveless (right) was arrested but he retired from the Navy\nUS officials said the decision to grant Saab clemency was difficult but essential in order to bring home jailed Americans, a core administrative objective that in recent years has resulted in the release of criminals who were once seen as untradeable.\n'Sometimes that means you've got to make some difficult decisions,' White House national security spokesman John Kirby said.\nThe deal guarantees the release of 10 Americans who were held in Venezuela, according to senior administration officials who briefed reporters on condition of anonymity under ground rules set by the White House.\nSeveral of the Americans were formally designated by the US Government as wrongfully detained.\nThe deal represents the US Government's boldest bid to improve relations with the major oil-producing nation and extract concessions from the self-proclaimed socialist leader.\nThe largest release of American prisoners in Venezuela's history was agreed weeks after the Biden administration agreed to suspend some sanctions.\nMaduro and an opposition faction in exchange agreed to work toward free and fair conditions for the 2024 presidential election.\nVenezuela's President Nicolas Maduro speaks during the notification ceremony for the referendum about the future of a disputed territory with Guyana\nSaab is seen with his former model wife Camilla, who campaigned for his release\nThe exchange would also be seen as a major US concession to Maduro, likely angering hard-liners in the Venezuelan opposition.\nThey have criticized the White House for standing by as the leader of the OPEC nation repeatedly outmaneuvered Washington after the Trump Administration´s campaign to topple him failed.\nThe White House eased sanctions on Venezuela's oil, gas and mining industries in October, but threatened to reimpose the restrictions if Maduro, by November 30, did not live up to his promise to pave the way for free and fair elections next year.\nHe is seeking in 2024 to add six years to his decade-long, crisis-ridden presidency. That deadline has passed and so far Maduro has failed to reverse a ban blocking his chief opponent, María Corina Machado, from running for office.\nUS President Joe Biden, who did not confirm any details about the prisoner exchange, told reporters: 'It looks like Maduro, so far, is keeping his commitment on a free election. It ain't done yet. Got a long way to go. But it's good so far.'\nBut days after Maduro's negotiators and the US-backed opposition agreed to work on electoral conditions, the country´s high court, stacked with Maduro loyalists, suspended the opposition's entire primary election process.\nThe attorney general opened criminal investigations against some of the organizers. Maduro, National Assembly leader Jorge Rodriguez and other allies insisted the balloting was fraudulent and challenged the participation of more than 2.4 million voters.\nThe US sanctions remain eased as part of the deal announced Wednesday.\nOfficials have not released the names of the Americans who will be released from Venezuelan prison, but there were reports on Tuesday that they included former US special forces soldiers Luke Denman and Airan Berry, arrested by Maduro forces after an alleged coup attempt\nAlso detained in Venezuela are US citizens Eyvin Hernandez (left), and Joseph Cristella, who are accused of entering the country illegally from Colombia\nIt also requires Maduro's government to release 21 Venezuelans, including Roberto Abdul, who co-founded a pro democracy group with Machado more than two decades ago, and dismiss three arrest warrants.\nAmong the Americans behind bars in Venezuela are two former Green Berets, Luke Denman and Airan Berry, who were involved in an attempt to oust Maduro in 2019.\nAlso detained are Eyvin Hernandez, Jerrel Kenemore and Joseph Cristella, who were accused of entering Venezuela illegally from Colombia.\nMore recently, Venezuela arrested Savoi Wright, a 38-year-old California businessman.\nThe U.S. has conducted several swaps with Venezuela over the past few years.\nThe most notable was a deal in October 2022 for seven Americans, including five oil executives at Houston-based Citgo, in exchange for the release of two nephews of Maduro's wife jailed in the U.S. on narcotics charges.\nSaab, 51, was pulled off a private jet during a fuel stop in Cape Verde en-route to Iran, where he was sent to negotiate oil deals on behalf of Maduro's government.\nAlex Saab, who was arrested on a US warrant for money laundering in 2020, was released from custody Wednesday.\nPedestrians walk near a poster asking for the freedom of Colombian businessman and Venezuelan special envoy Alex Saab, in Caracas, Venezuela\nThe US charges were conspiracy to commit money laundering tied to a bribery scheme that allegedly siphoned off $350 million through state contracts to build affordable housing for Venezuela's government.\nSaab was previously sanctioned by the US Treasury Department for allegedly running a scheme that included Maduro's inner circle\nThe plot stole hundreds of millions in dollars from food-import contracts at a time of widespread hunger mainly due to shortages in the South American country.\nMaduro's government argued Saab was a Venezuelan diplomat who was entitled to immunity from criminal prosecution under international law.\nBut his defense attorneys said last year in a closed-door hearing before his arrest that Saab was secretly cooperating with the US Drug Enforcement Administration.\nThey said he was helping the DEA untangle corruption in Maduro's inner circle and agreed to forfeit millions of dollars in illegal proceeds from corrupt state contracts.\nBut the value of the information he shared with the Americans is unknown; some suggested it may have all been a Maduro-authorized ruse to collect intelligence on the US law enforcement activities in Venezuela.\nWhatever the case, Saab skipped out on a May 2019 surrender date and shortly afterward was charged by federal prosecutors in Miami.\nJerrel Kenemore was also arrested in Venezuela after being accused of illegally crossing the border from Colombia\nCalifornia businessman Savoi Wright, 38, was detained in November by Venezuelan authorities under unclear accusations\nMeanwhile, millions of Venezuelans who have chosen to remain in their country continue to live in poverty.\nThe minimum wage is about $3.60 a month, just enough to buy a gallon of water. The low wages and high food prices have pushed more than 7.4 million people to leave the country.\nThe deal is the latest concession by the Biden Administration in the name of bringing home Americans jailed overseas.\nPerhaps the most-high-profile prisoner exchange came last December when the US Government, over the objections of some Republicans in Congress and criticism from some law enforcement officials, traded Russian arms dealer Viktor Bout for WNBA star Brittney Griner.\nIran released five American detainees in September in exchange for the release of nearly $6 billion in frozen Iranian assets and two Iranian prisoners who had been jailed in the US.\nThe succession of swaps has raised concerns that the US was incentivizing hostage-taking abroad and producing a false equivalence between Americans who are wrongfully detained abroad and foreigners who have been properly prosecuted and convicted in US courts.\nBut Biden Administration officials said securing the freedom of wrongfully detained Americans and hostages abroad was a core government priority that required difficult dealmaking.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US, Venezuela swap prisoners: Maduro ally for 10...", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12885753/The-US-released-ally-Venezuelas-president-swap-jailed-Americans-AP-learns.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}