{"authors": ["Slavoj Žižek", "Slavoj Žižek Is A Philosopher", "Author", "Cultural Theorist", "Intellectual. He Currently Holds Academic Positions At The University Of London", "New York University", "University Of Ljubljana. He Has Authored Or Co-Authored Over Books On Subjects Politics To Philosophy.", "More This Author"], "date_download": "2024-02-05 15:23:53", "date_modify": "None", "date_publish": "2023-12-20 08:00:00", "description": "The West needs to remember that not all freedom movements are progressive or democratic.", "filename": "https%3A%2F%2Fwww.newstatesman.com%2Fworld%2Fmiddle-east%2F2023%2F12%2Fisrael-gaza-palestine-peace.json", "image_url": "https://dl6pgk4f88hky.cloudfront.net/2023/12/20/GettyImages-1816840111-800x418.jpg?1707143034", "language": "en", "localpath": null, "maintext": "Photo by MAHMUD HAMS/AFP via Getty Images\nWhen left-wing critics of Israel characterise what it is doing in Gaza as genocide, they are often accused of inverting the true relationship: Israel is just defending itself while Hamas plans an actual genocide of Jews.\nBut genocidal rhetoric is increasingly present in the public speeches of Israeli politicians themselves. When the defence minister, Yoav Gallant, ordered a “complete siege” of the Gaza Strip after the Hamas attack, he said: “I have ordered a complete siege on the Gaza Strip. There will be no electricity, no food, no fuel, everything is closed… We are fighting human animals and we are acting accordingly.” More recently, in October, when Benjamin Netanyahu referred to the Palestinian people in the besieged Gaza Strip, he invoked the Amalek, a nation in the Hebrew Bible that the Israelites were ordered to wipe out in an act of revenge. “You must remember what Amalek has done to you,” he said in a speech announcing the start of a ground invasion in Gaza, and added that Israeli soldiers were part of a chain that goes back 3,000 years. Genocide justified by religious fundamentalism.\nThere is no place for peace treaties here. Tzipi Hotovely, the Israeli ambassador to the UK, insisted in an interview with Sky News on 16 October that there is no humanitarian crisis in Gaza: “Israel is in charge of the safety of Israelis; Hamas is in charge of the safety of the Palestinians.” Of course, there is no humanitarian crisis among the Palestinians, since the Israeli high command apparently consider them to be not fully human. No wonder that, together with Netanyahu and other leading Israeli politicians, Hotovely resolutely rejects the two-state solution: “human animals” don’t deserve a state.\nA day before three Jewish hostages were mistakenly killed by the Israel Defense Forces (IDF) in Gaza on 15 December, Netanyahu said: “I say this in the face of great pain but also in the face of international pressures. Nothing will stop us.” The addressees of this message are not only the relatives of the remaining hostages, who accuse the government of not doing enough to release the estimated 129 that remain in the Strip; the main addressees are perhaps foreign governments, including the US, that are exerting pressure on Israel to show more restraint. Netanyahu’s ultimate message is: even without the support of its Western allies, nothing will stop Israel in achieving its goals (total annihilation of Hamas; rejection of the two-state solution).\nThe problem with this radical stance is that, as Hani al-Masri, the director-general of the Palestinian Centre for Policy Research and Strategic Studies, pointed out correctly, in pursuing them, Israel is “a prisoner of its own unreachable goals”. Why? Because, to use another quotation, as the anarchist and pacifist president of the Palestine branch of the War Resisters’ International, Natan Hofshi, wrote back in 1946: “Without an understanding with our Arab neighbours, we are building on a volcano and our whole work is in jeopardy.”\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. Sign up directly at saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. Sign up directly at morningcall.substack.com Events and Offers Stay up to date with NS events, subscription offers & updates. The Green Transition Weekly analysis of the shift to a new economy from the New Statesman's Spotlight on Policy team. Your email address Job title Job title\nAdministration / Office\nArts and Culture\nBoard Member\nBusiness / Corporate Services\nClient / Customer Services\nCommunications\nConstruction, Works, Engineering\nEducation, Curriculum and Teaching\nEnvironment, Conservation and NRM\nFacility / Grounds Management and Maintenance\nFinance Management\nHealth - Medical and Nursing Management\nHR, Training and Organisational Development\nInformation and Communications Technology\nInformation Services, Statistics, Records, Archives\nInfrastructure Management - Transport, Utilities\nLegal Officers and Practitioners\nLibrarians and Library Management\nManagement\nMarketing\nOH&S, Risk Management\nOperations Management\nPlanning, Policy, Strategy\nPrinting, Design, Publishing, Web\nProjects, Programs and Advisors\nProperty, Assets and Fleet Management\nPublic Relations and Media\nPurchasing and Procurement\nQuality Management\nScience and Technical Research and Development\nSecurity and Law Enforcement\nService Delivery\nSport and Recreation\nTravel, Accommodation, Tourism\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\nPeace will only emerge when Palestinians are allowed to organise themselves as a strong independent political force, broadly democratic and rejecting all forms of religious fundamentalism – something Israel is doing everything possible to prevent by giving Palestinians one choice: to accept Hamas as the only voice that is fighting for them. The latest opinion polls show that anger over the war is boosting Palestinian support for Hamas, particularly in the West Bank, where the IDF is not conducting an all-out offensive and where Hamas does not have control. Throughout the Arab world, hundreds of thousands are protesting against Israel, and tensions are reaching a point of explosion. Some on the left may see in such an explosion a moment of truth, when liberal-pacifist illusions about the occupation are upended – I see in it a catastrophe, not only for Jews and Palestinians but for the world.\n[See also: The fightback against US anti-Semitism has begun]\nNetanyahu’s “nothing will stop us” speech echoes Vladimir Putin’s statement the day before, on 14 December, in which the Russian president vowed to fight on in Ukraine until Moscow secures the country’s “demilitarisation”, “denazification” and neutrality – unless Kyiv accepts a deal that achieves those goals. “There will be peace when we achieve our goals,” Putin declared. “As for demilitarisation, if they [the Ukrainians] don’t want to come to an agreement – well, then we are forced to take other measures, including military ones.” Putin couldn’t restrain himself from cynically remarking that Russia is demilitarising Ukraine by way of destroying hundreds of its tanks and guns – war is thus presented as the ultimate act of demilitarisation. But did some Western heads of state not make a similar point when, reacting to the desperate calls for a ceasefire in the Gaza conflict, they advocated a “sustainable ceasefire”? Though their idea was a ceasefire that would lead to permanent peace, it ultimately amounts to the claim that the only “sustainable” peace is that which follows a (military) victory.\nThe parallel between Israel-Palestine and Ukraine is imperfect: in the case of the Palestinians and their Israeli neighbours, a compromise between the two peoples is the only way out, while Ukraine is a victim of brutal aggression and has the full right to persevere until victory. Ukraine is now paying the price for exclusively choosing the side of the Western powers, ignoring the link between its struggle for independence with the developing world’s decolonisation process, as well as suppressing its own political left as suspect, somehow associated with Russia. Now that Western states are sceptical about the extent to which they can continue to help Volodymyr Zelensky’s government, Ukraine may find itself in a desperate position.\nWe have to engage with the topic of decolonisation. The scholars Eve Tuck and K Wayne Yang are right when they insist that “decolonisation” should not be used as a universal metaphor: “Decolonisation brings about the repatriation of indigenous land and life; it is not a metaphor for other things we want to do to improve our societies and schools. The easy adoption of decolonising discourse by educational advocacy and scholarship, evidenced by the increasing number of calls to ‘decolonise our schools’, or use ‘decolonising methods’, or ‘decolonise student thinking’, turns decolonisation into a metaphor.” Such a metaphoric universalisation blurs the actual violence of decolonisation. “Decolonised thinking” (done in a safe academic environment) is a poor substitute for the real and brutal struggle of the oppressed against their masters.\nWhat now overshadows this is the violence of Hamas, which was perceived by many as an attempt at actual decolonisation. However, this is where things get more problematic. First, it is all too easy to dismiss the state of Israel as a result of the colonisation of the Palestinian territory – I agree with Edward Said who thought that both Palestinians and Jews have a right to live there, and that they are condemned to live there together.\nI don’t consider Hamas’s stance “leftist” in any meaningful sense of the term, and I don’t envisage a military defeat of Israel as a solution to the Middle East crisis. In a recent piece for Al Jazeera, Jamil Khader, a professor at Bethlehem University, condemns my “lofty aspirational vision” as “completely disconnected from the realities on the ground”. What he finds “incomprehensible” is my insistence on “some liberal politics of hope in this catastrophic context”, like when I see a possible change coming through “the slow rise of solidarity between the Palestinian citizens of Israel and the Jews opposing the all-destructive war”. As a pragmatic realist, I am well aware that such a solidarity is difficult to imagine today. But it is here that we should resuscitate the famous motto of the May 1968 protests in Paris: Soyons réalistes, demandons l’impossible. Be realistic, demand the impossible. The truly dangerous utopia is the idea that the solution to the Middle East crisis can only be achieved through military force.\nThe second point to address on the subject of decolonisation is that the reality of it often is a metaphor for another process. Recall numerous African countries, from Angola to Zimbabwe, where the overthrow of Western imperial control ended up with corrupted social orders in which the gap between the new masters and the poor has become greater than it was before independence. “Decolonisation” was thus a metaphor for (or one aspect of) the emergence of a new class society.\nSouth Africa today has the biggest gap between the poor and the rich – no wonder that a very depressing thing happened to me in July 2023. In a public debate at Birkbeck Summer School in London, a black woman from South Africa, a veteran activist for the African National Congress, which has ruled the country since 1994, said that the predominant stance among the poor black majority is now increasingly a nostalgia for apartheid. Back then, she said, that demographic’s standard of living was, if anything, a little higher than it is today, and there was safety and security (South Africa was a police state, after all). While today, the woman explained, poverty is supplemented by violence and insecurity.\nIf a white person were to say this, they would be, of course, immediately accused of racism – but we should nonetheless think about it. If we don’t do it, the new right will do it for us (as they are already doing, lambasting what they regard as the inability of South Africa’s black citizens to run a country properly). The temptation to risk brutal “decolonisation” irrespective of what follows should be resisted. Mao said: “Revolution is not a dinner party.” But what if the reality is that after the revolution there is nothing to eat?\nThe question we should raise with respect to Hamas is not just what will happen after it loses this war – it is what would happen if Hamas was to survive and continue to rule Gaza? What would be the reality in the Strip, after the waning of enthusiasm for liberation?\n[See also: UN commissioner: “Gazans could start dying of hunger”]", "source_domain": "www.newstatesman.com", "text": null, "title": "What the left gets wrong about Gaza and “decolonisation”", "title_page": null, "title_rss": null, "url": "https://www.newstatesman.com/world/middle-east/2023/12/israel-gaza-palestine-peace"}