{"authors": [], "date_download": "2024-02-05 15:23:57", "date_modify": "None", "date_publish": "2023-12-20 05:43:11", "description": "US wants draft resolution watered down from ‘urgent and sustainable cessation of hostilities’ to ‘urgent suspension of hostilities’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Funsc-vote-us-gaza-ceasefire-israel-hamas-b2467002.html.json", "image_url": "https://static.independent.co.uk/2023/12/20/05/GettyImages-1867955607.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA United Nations Security Council (UNSC) vote to spur more humanitarian aid deliveries to Gaza was delayed by another day on Tuesday as talks continued to try and avoid a third US veto of action over the two-month-long Israel-Hamas war.\nWhile intense negotiations were underway ahead of an expected vote on a resolution drafted by the United Arab Emirates on Monday, it has repeatedly been delayed as diplomats continued to negotiate behind closed doors to get the Joe Biden administration to abstain or vote in favor of the resolution – allowing the measure to pass.\n“We’re still working through the modalities of the resolution,” said UNSC spokesperson John Kirby on Tuesday afternoon when the vote was still set for 5pm. “It’s important for us that the rest of the world understand what’s at stake here and what Hamas did on the 7th of October and how Israel has a right to defend itself against those threats.”\nThe draft resolution would demand Israel and Hamas allow and facilitate land, sea and air deliveries of aid to and throughout the Gaza Strip and ask the United Nations to monitor humanitarian assistance arriving in the Palestinian enclave.\nIt also called for an “urgent and sustainable cessation of hostilities”, but this language was watered down in a new draft circulated early on Tuesday.\nDiplomats said the United States wants to tone down language that \"calls for the urgent suspension of hostilities to allow safe and unhindered humanitarian access, and for urgent steps towards a sustainable cessation of hostilities\".\nThe United States and Israel oppose a ceasefire because they believe it would only benefit Hamas. Washington instead supports pauses in fighting to protect civilians and allow the release of hostages taken by Hamas.\nDiplomats said that Washington is also unhappy with a proposal in the UAE draft resolution that asks UN secretary-general Antonio Guterres to establish a monitoring mechanism in Gaza \"to exclusively monitor all humanitarian relief consignments to Gaza provided through land, sea and air routes of those states that are not parties to the conflict\".\nPalestinian ambassador to the United Nations Riyad Mansour listens to members of the UN Security Council as they break during a meeting on the Israel-Hamas war at the United Nations headquarters on 19 December 2023 in New York City (Getty Images)\nLimited humanitarian aid and fuel deliveries have crossed into Gaza via the Rafah crossing from Egypt, subjected to monitoring by Israel, but UN officials and aid workers say it comes nowhere near to satisfying the most basic needs of Gazans.\nNate Evans, spokesperson for the US mission to the UN, said on Tuesday: \"We believe there needs to be a large increase in humanitarian aid to Gaza, as we have worked to achieve on the ground through our diplomacy. We continue to work constructively with council members on this product.\"\nThe US on 8 December vetoed a Security Council resolution backed by almost all other council members and dozens of other nations demanding an immediate humanitarian cease-fire in Gaza. The 193-member General Assembly overwhelmingly approved a similar resolution on 12 December by a vote of 153-10, with 23 abstentions.\nIn its first unified action on 15 November, with the US abstaining, the Security Council adopted a resolution calling for “urgent and extended humanitarian pauses” in the fighting, unhindered aid deliveries to civilians and the unconditional release of all hostages.\nIsraeli president Isaac Herzog said during a briefing with ambassadors that Israel is “ready for another humanitarian pause and additional humanitarian aid in order to enable the release of hostages.”\nA person holds up a sign during a Pro-Palestine march to participate in a Global Strike for Gaza on 18 December 2023 in New York City, New York (Getty Images)\nSecurity Council resolutions are important because they are legally binding, but in practice many parties choose to ignore the council’s requests for action. General Assembly resolutions are not legally binding, though they are a significant barometer of world opinion.\nNearly 20,000 Palestinians have been killed, according to the Gaza Health Ministry since Israel declared war on Hamas following its surprise attacks in southern Israel on 7 October. The Hamas militants killed about 1,200 people — mostly civilians — and took about 240 hostages back to Gaza.\nHamas controls the Gaza Strip, and its Health Ministry does not differentiate between civilian and combatant deaths. Thousands more Palestinians lie buried under the rubble of Gaza, the UN estimates.\nThe conflict has spread beyond Gaza, including into the Red Sea where Iran-aligned Houthi forces based in Yemen have been attacking commercial vessels with missiles and drones, prompting the creation of a multinational naval operation to protect trade routes.\nUS defense secretary Lloyd Austin said in Bahrain that joint naval patrols would be held in the southern Red Sea and Gulf of Aden, which encompass a major East-West global shipping route.\n\"This is an international challenge that demands collective action,\" Mr Austin said.\nAdditional reporting from the agencies", "source_domain": "www.independent.co.uk", "text": null, "title": "UN Security Council delays Gaza ceasefire vote in bid to avoid US veto", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/unsc-vote-us-gaza-ceasefire-israel-hamas-b2467002.html"}