{"authors": ["Mark Nicol", "Mark Nicol Defence Editor", "Rachael Bunyan"], "date_download": "2024-02-05 15:23:58", "date_modify": "None", "date_publish": "2023-12-20 02:15:30", "description": "The leader of Hamas is flying into Egypt today for talks on a ceasefire in Gaza, after Israel said it was willing to agree another pause in the fighting in exchange for around 40 hostages.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12883851%2FIsrael-agree-ceasefire-Hamas-week-exchange-40-hostages-terror-group-continues-hold-129-people-captive.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/20/02/79155647-0-image-a-1_1703039116332.jpg", "language": "en", "localpath": null, "maintext": "The leader of Hamas is flying into Egypt today for talks on a ceasefire in Gaza, after Israel said it was willing to agree another pause in the fighting in exchange for around 40 hostages.\nInternational pressure is mounting for a new truce that could ramp up aid to the besieged Palestinian territory, with the United Nations due to vote on calling for a ceasefire.\nHamas sources said Wednesday at least 11 people had been killed overnight in Israeli strikes across the Gaza Strip.\nQatar-based Hamas leader Ismail Haniyeh was expected to lead a 'high-level' delegation to Egypt for talks with the country's spy chief, Abbas Kamel, and others on 'stopping the aggression and the war to prepare an agreement for the release of prisoners', a source close to the group said.\nIsrael's leaders are facing growing calls to secure the release of 129 hostages they say are being held in Gaza following the barbaric October 7 attacks and, on Tuesday, signalled a willingness to return to the negotiating table with Hamas.\nIt follows last month's week-long ceasefire in Gaza mediated by Qatar, in which more than 100 female and child hostages were freed.\nInjured Palestinians, including children, are brought to Nasser Hospital to receive medical treatment following Israeli attacks in Khan Yunis, Gaza, on Tuesday\nInjured Palestinians, including children, are brought to Nasser Hospital to receive medical treatment following Israeli attacks in Khan Yunis, Gaza, on Tuesday\nQatar-based Hamas leader Ismail Haniyeh (pictured) was expected to lead a 'high-level' delegation to Egypt for talks with the country's spy chief, Abbas Kamel today\nIsrael has signalled that it is ready for a week-long truce with Hamas in exchange for around 40 hostages (Pictured: IDF soldiers on the Gaza border on Monday)\nIsraeli President Issac Herzog said his country was 'ready for another humanitarian pause and additional humanitarian aid in order to enable the release of hostages'.\nMeanwhile, Israeli Prime Minister Benjamin Netanyahu said he had recently sent his spy chief on two trips to Europe in an effort to 'free our hostages'.\nPalestinian militant group Islamic Jihad, meanwhile, released video footage on Tuesday it claimed showed two hostages alive in its custody in Gaza, ramping up pressure on Israel.\nUS news site Axios reported Monday that David Barnea, head of the Israeli intelligence agency Mossad, met with Qatari Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani and CIA director Bill Burns in Europe to discuss a potential new deal to free hostages.\nAxios also reported Tuesday that Israel had offered to pause the fighting in Gaza for at least one week in exchange for more than three dozen hostages held by Hamas.\nThe war began when Hamas militants burst out of Gaza on October 7, killing around 1,140 people in Israel, mostly civilians, and abducting about 250, according to the latest Israeli figures.\nVowing to destroy Hamas, Israel began a campaign of bombardment, alongside a ground invasion, that Gaza's Hamas-run health ministry says has killed 19,667 people, mostly women and children.\nQatar, backed by Egypt and the United States, helped broker a week-long truce and hostage-prisoner swap in November in which 80 Israeli hostages were freed in exchange for 240 Palestinian prisoners.\nIt comes as the US has indicated that it will stand by Israel ahead of a second UN Security Council vote calling for a ceasefire today after two previous votes were delayed as members wrangled over wording.\nThe latest version of the text calls for the 'suspension' of hostilities, the sources said.\nThe US vetoed a previous ceasefire resolution in the council, sparking condemnation by Palestinian and humanitarian groups, which urged more action to help civilians caught in the conflict.\nAhead of today's delayed vote, diplomats had been struggling to broker a further pause to free hostages and allow humanitarian aid into Gaza.\nUS defence secretary Lloyd Austin said protecting Palestinian civilians is 'both a moral duty and a strategic imperative' after meeting Israeli officials on Monday.\nBritish Foreign Secretary Lord Cameron will also head to Jordan and Egypt this week to call for a 'sustainable truce'.\nA Palestinian child wounded in an Israeli strike is rushed into Nasser hospital, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip on Wednesday\nA Palestinian child receives treatment at Nasser hospital, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip on Wednesday\nResidents and civil defence teams conduct search and rescue operation around the rubble of the building following an Israeli attack on house belonging to Misri family in Deir al-Balah, Gaza on Wednesday\nPalestinians gather at the site of an Israeli strike on a house in Khan Younis on Wednesday\nThe UN estimates 1.9 million of Gaza's 2.4 million residents have been displaced and concerns are growing about the limited ability of aid groups to help.\n'Amid displacement at an unimaginable scale and active hostilities, the humanitarian response system is on the brink,' said Tor Wennesland, the UN's special coordinator for the Middle East peace process.\nYoung Gazans are facing a perilous winter, with the UN children's agency warning that 'child deaths due to disease could surpass those killed in bombardments'.\nOne of the last remaining hospitals in northern Gaza, Al-Ahli, stopped operating after it was stormed and 'put out of action' by Israeli forces, its director Fadel Naim told AFP.\nHomes have been destroyed, forcing many into overcrowded shelters as they struggle to find cooking fuel, food, water and medical care.\nWith power and communication often cut, Gazans are returning to time-worn traditions including using battery-powered radio sets to get news of the war.\n'Here in Gaza, we're moving backwards,' said Salah Zorob, 37, outside his tent. 'They're going to take us back to the Stone Age.'\nIsraeli officials are also considering building a 'humanitarian compound' in northern Gaza to house displaced Palestinian civilians, US news channel CNN has reported.\nIsraeli military spokesman Daniel Hagari said Tuesday that troops were expanding operations in southern Gaza's Khan Yunis area.\n'We must dismantle Hamas, and it will take as long as needed,' he said.\nThe army said a soldier was killed on Tuesday, bringing the death toll to 133 in the Gaza Strip since ground operations began in late October.\nHundreds of Palestinians have been detained in military operations across the territory, and on Tuesday, the army said it was investigating 'the deaths of terrorists in military detention centres' without giving details.\nThe US has urged Israel to protect civilians in Gaza, a call echoed Tuesday by British Foreign Secretary David Cameron, who called on Israel to take a 'much more surgical, clinical and targeted approach' in dealing with Hamas.\nThe Gaza war has sparked fears of regional escalation and seen Israel trade deadly cross-border fire with Iran-backed Hezbollah militants in southern Lebanon.\nThe Israeli army said it had targeted Hezbollah positions on Tuesday after intercepting fire near the border that wounded two reservists.\nYemen's Huthi rebels, meanwhile, have repeatedly fired missiles and drones towards cargo ships in the Red Sea in what they say is a show of support for Palestinians.\nMajor shipping firms have diverted their vessels as a result, and the United States on Monday announced a new multinational naval task force to protect the waterways, through which 12 percent of global trade transits.\nIn its current form, the task force includes warships from the United States as well as Britain, Canada, France, Italy, the Netherlands, Norway and other countries.\nOn Tuesday, Washington pushed to build up the initiative, with Defense Secretary Lloyd Austin telling a virtual meeting with 43 countries, the EU and NATO that the attacks 'threaten the free flow of commerce'.\nA top Huthi official later said any country that acts against the rebels 'will have its ships targeted in the Red Sea'.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "New hope for truce in Gaza as Hamas leader flies to Egypt for talks and Israel says it is willing to agree to another pause in exchange for hostages amid growing UN pressure", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12883851/Israel-agree-ceasefire-Hamas-week-exchange-40-hostages-terror-group-continues-hold-129-people-captive.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}