{"authors": ["Miles Dilworth", "Miles Dilworth For Dailymail.Com At Nellis Air Force Base"], "date_download": "2024-02-05 15:15:12", "date_modify": "None", "date_publish": "2024-01-28 16:38:46", "description": "DailyMail.com joined an RAF Voyager tanker as it took part in an exercise involving US, UK and Australian airmen training for the growing threat of an all-encompassing global conflict.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13001893%2FHow-UK-prepares-war-Nevada-desert-Daily-Mail-joins-Exercise-Red-Flag-drills-fighter-jets-train-enemy-defense-systems-allies-ramp-strikes-Houthi-targets-Yemen.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/24/20/80426249-0-image-a-19_1706128161936.jpg", "language": "en", "localpath": null, "maintext": "Four U.S. Marine Corps F-35 fighters suddenly appear out of the rear windows of our Royal Air Force tanker.\nIn a feat you would scarcely believe possible, the pilots refuel their planes from a hose dangling from the wing of the tanker while flying at 280 knots over the Nevada mountains.\nBut it is at this moment that our Allied fleet becomes sitting ducks.\nAn enemy attack now could wipe us out.\nFortunately, this is all part of the annual Exercise Red Flag - which brings together 3,000 American, British and Australian servicemen - and any hostile missiles would merely be simulations.\nA US Marine Corps F-35 takes on fuel from an RAF Voyager tanker during Exercise Red Flag at Nellis Air Force Base in Nevada\nOver three weeks, around 100 aircraft and 3,000 US, UK and Australian servicemen perform various drills aimed at improving Allied integration, logistics and tactics. Pictured: The cockpit of the RAF Voyager\nColonel Eric A. Winterbottom, Commander of the 414th Combat Training Squadron that leads Red Flag, said the annual exercise is constantly adapting to the evolution of global conflict\nRed Flag has been going on for decades, but Tuesday's drill has added pertinence.\nJust hours earlier, US and UK air forces carried out a fresh series of strikes against Houthi targets in Yemen.\nDailyMail.com is aboard an RAF Voyager tanker. Two such aircraft supported the attacks in Yemen on Monday.\nThis year, Red Flag has gone up a notch.\n'It feels like there is more focus that we need to get this right quickly because we know that the threat in the world is changing,' says RAF Wing Commander Paul Summers, who is also aboard the Voyager flying over thousands of square miles in the west United States.\nFrom the US and Australian side, much of the talk is of honing their skills for operations in the Indo-Pacific and a possible war with China.\nBut the UK also has pressing concerns in its own backyard with the ongoing war in Ukraine.\nAnd that is not to mention the Middle East.\nSummers admits that over the past few decades, the RAF has operated in a 'kind environment' in which the UK didn't face a 'homeland threat'.\n'We're probably not in that place anymore,' he adds.\nRAF Wing Commander Paul Summers said this year's Red Flag had gained added 'focus' due to the increasingly unstable global outlook\nDailyMail.com was aboard the RAF Voyager flight as it refueled four US Marine Corps F-35s and six RAF Typhoons, replicating the partnership currently in operation in Yemen\nRefueling mid-air at high speed can be a fraught situation, with any minor errors leading to potential damage to aircraft or the refueling basket itself\nAircraft carry out exercises across thousands of square miles over mountainous landscapes in the west United States\nA B-2 Spirit stealth bomber at Nellis Air Force base. The bomber is capable of delivering both conventional and nuclear munitions\nRed Flag began in 1975 as a means of giving pilots the experience of their first ten combat missions in a safe training environment.\nNowadays, its focus is on integrating Allied Forces and preparing them for the next phase of global conflict.\nTeams are split into two. The blues, which represents the Allies, take on the reds, manned by pilots who have been trained to adopt the tactics of potential aggressors and whose aircraft have been loaded by simulated enemy weaponry.\nDrills take place over three weeks and cover four main scenarios: defending Allied air space; attacking enemy air space; striking ground targets; and suppression of air defenses.\nToday, the blue team, made up of US, UK and Australian pilots, has the objective of suppressing the air defenses of the red team, composed mainly of Americans.\nThese defenses are made to replicate a 'superior threat' with an integrated air defense system akin to that of China or Russia, says Summers.\nOur Voyager tanker is tasked with refueling the four F-35s and six Typhoons on the blue force.\nUp to 50 other aircraft, including F-22s, F-16s and B-2 bombers, are also involved in the exercise.\nAfter it is complete, everyone will sit down for a six-hour debriefing in which data is poured over to work out who shot down who, which targets were neutralized and ultimately, who won.\nIt gets competitive.\nRAF Flight Lieutenant Simon Tofrick said the key to the precision execution of mid-air refueling was to use references marked on the jets to guide them towards their target\nReal-time data on how the drill is unfolding is analyzed inside the RAF Voyager cockpit\nBefore it gets to that, the F-35s wait patiently for each other to top up on around two tonnes of fuel, with an individual pit stop lasting up to four minutes.\nRAF Flight Lieutenant Simon Tofrick explains that the key to executing this high-speed maneuver is not to aim for the hose itself, which flaps around in the wind, but to use references marked on the jets to guide them towards their target.\n'It can get a little bit spicy,' he says. 'If you miss it in an uncontrolled situation, the basket [attached to the end of the hose] can swing around underneath and do some damage to your aircraft.\n'Or if you were to go in too fast, you could potentially damage the basket as well, which would then knock it out for everybody else.'\nThe Americans carry out this precision airborne dance with aplomb, before peeling away to rejoin the fight.\nBut these are no longer the close combat dogfights made famous by the Battle of Britain.\nToday, the battle for the skies is fought over what are referred to as 'Beyond Visual Range' scenarios, with better radar and increased missile range meaning pilots no longer need to see their friends or enemies.\n'You're not so much that image of a swashbuckling fighter pilot smoking the cigar,' says Dan Armstrong, an Australian F-35 pilot. 'You're operating a computer system, sharing data and it's really a lot more nerdy than you think.\n'It's about managing risk. When do I want to go forward, or stay on the backside? It's a very measured type of fighting. Back in the day, you're just getting stuck in.'\nThe fighter pilots are not the only ones adapting to the evolution of global conflict.\nThe Voyager's role is also of growing importance. In the event of war with China, refueling tankers would be crucial in helping fighter planes and ground-attack aircraft overcome vast distances across the Indo-Pacific.\nAnd for the first time at Red Flag, units will soon scramble to a new base in California to replicate what would happen if an established base was compromised in a real-world scenario.\nIt is part of a growing emphasis on what is known as Agile Combat Employment (ACE).\nColonel Eric A. Winterbottom, Commander of the 414th Combat Training Squadron that leads Red Flag, says the exercise is a 'change in mindset' from being able to build heavily in one location to being light and maneuverable.\n'We've operated for years, [with bases] relatively invulnerable. A lot of the bases in the Middle East, for example, where we were able to build up a large infrastructure, are fairly, semi-permanent.\n'Now we're looking at situations where our bases may be threatened by opponent capabilities.'\nFor the UK, this means a potential missile or cyber attack on its base in Brize Norton, Oxfordshire, by Russia.\nBack in Nevada, the six RAF Typhoons have now lined up alongside the Voyager for refueling, replicating the partnership in operation during the strikes in Yemen on Monday.\nAustralian F-35 pilot Flight Lieutenant Dan Armstrong said the jet's stealth capabilities allowed him to give enemies 'an upper cut without them knowing they're getting punched in the face'\nAn RAF Typhoon carries out drills during Exercise Red Flag. Two RAF Typhoons joined US attacks on Houthi targets in Yemen on Monday\nIt is a stark reminder of how this is not just a drill.\nBut as the threat of an all-encompassing global conflict grows stronger by the day, the Red Flag pilots have every confidence they have the tools to do the job.\nArmstrong enthuses about the world-beating qualities of his F-35, a highly-advanced stealth fighter that pairs state-of-the-art data sharing capabilities with extraordinary acceleration and agility.\n'The real big advantage of the F-35 is stealth, so we can get in close to the enemy and really give them an upper cut without them knowing they're getting punched in the face.\n'The jet is amazingly capable. if I was ever gonna go to war and go downtown, this is one I'd do it in.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "How the US and UK prepares for war over the Nevada desert: Daily Mail joins Exercise Red Flag drills where fighter jets train to take out enemy defense systems as allies ramp up strikes on Houthi targ", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13001893/How-UK-prepares-war-Nevada-desert-Daily-Mail-joins-Exercise-Red-Flag-drills-fighter-jets-train-enemy-defense-systems-allies-ramp-strikes-Houthi-targets-Yemen.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}