{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Richard Luscombe", "Tom Ambrose", "Jamie Grierson", "Reged Ahmad"], "date_download": "2024-02-05 15:24:07", "date_modify": "None", "date_publish": "2023-12-20 02:26:03", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F19%2Fisrael-gaza-war-live-updates-hamas-ceasefire-un-security-council-usa-veto.json", "image_url": "https://i.guim.co.uk/img/media/3831c16b7e3f2ba05d532162d68b0fb70262e46a/0_546_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=a0262046106f1b10c280d505c98519f3", "language": "en", "localpath": null, "maintext": "From 19 Dec 2023 21.45 CET UN security council delays Gaza vote again The UN security council vote on a resolution calling for a new ceasefire in Gaza has been delayed once again. The vote has now been pushed to Wednesday. We reported earlier that security council members were engaged in “intense negotiations” on Tuesday afternoon to try to get to a vote on a draft resolution. The vote, initially scheduled for Monday afternoon, had been expected to take place in New York by early Tuesday afternoon, but diplomats said it was pushed back until later in the day at the request of the US, which vetoed the last one. Under discussion is the language of the resolution sponsored by the United Arab Emirates. Its first draft called for an “urgent and sustainable cessation of hostilities,” but on Tuesday new language circulated calling “for the urgent suspension of hostilities to allow safe and unhindered humanitarian access, and for urgent steps towards a sustainable cessation of hostilities”.\nUpdated at 21.56 CET\n20 Dec 2023 02.45 CET She was born amid war, in a hospital with no electricity in a southern Gaza city that has been bombarded daily. Her family named her al-Amira Aisha – “Princess Aisha”. She didn’t complete her third week before she died, killed in an Israeli airstrike that crushed her family home on Tuesday, writes Associated Press. Its report continues: Her extended family was asleep when the strike levelled their apartment building in Rafah before dawn, said Suzan Zoarab, the infant’s grandmother and survivor of the blast. Hospital officials said 27 people were killed, among them Amira and her two-year old brother, Ahmed. “Just 2 weeks old. Her name hadn’t even been registered,” Suzan said, her voice quivering as she spoke from the side of her son’s hospital bed, who was also injured in the blast. The family tragedy comes as the Palestinian death toll in Gaza nears 20,000, according to the Hamas-run ministry of health. View image in fullscreen Palestinians gather at the site of an Israeli strike on a house in Rafah on Tuesday. Photograph: Shadi Tabatibi/Reuters\n20 Dec 2023 02.18 CET Julian Borger in Washington has filed a full report on the Gaza ceasefire resolution being postponed for a second time at the United Nations security council, amid reported policy differences inside the Biden administration. His report says: While diplomatic efforts struggled in New York in the pursuit of a formalised truce, there was a renewed push for a new hostage deal that would involve a short humanitarian pause in the fight to allow an exchange with Palestinian prisoners. The UN draft resolution, drafted by the United Arab Emirates, had been changed on Tuesday in an effort to avoid a third US veto since the conflict began more than two months ago. Instead of calling for an “urgent and sustainable cessation of hostilities”, the amended text referred to “the urgent suspension of hostilities to allow safe and unhindered humanitarian access, and for urgent steps towards a sustainable cessation of hostilities”. According to diplomatic sources, the US mission in New York believed it had negotiated a text that it could at least abstain on, but when Washington was consulted, new objections were raised, with the White House reportedly taking a more pro-Israel line than the state department. See the full report here: Biden administration policy differences reportedly behind delay in Gaza ceasefire vote at UN Read more\nUpdated at 02.19 CET\n20 Dec 2023 02.05 CET US launches Red Sea protection force after Houthi attacks The United States has launched a multinational operation to safeguard commerce in the Red Sea as attacks by Iran-backed Yemeni militants forced major shipping companies to reroute, stoking fears of sustained disruptions to global trade. Reuters reports that the Houthi militant group, which controls vast amounts of territory in Yemen after years of war, has since last month fired drones and missiles at international vessels sailing through the Red Sea, attacks it says are in response to Israel’s military offensive in Gaza. The Houthi attacks began to take a toll on global trade this week, disrupting a key trade route that links Europe and North America with Asia via the Suez Canal. The group has threatening to target all ships heading to Israel. Oil major BP paused all Red Sea transits, and a slew of top shipping firms including Maersk started diverting shipments normally made through Suez around the Cape of Good Hope on Africa’s southern tip, adding days to journey times and raising costs. The list of companies avoiding the Red Sea continued to grow on Tuesday. View image in fullscreen Armed men on a beach in al-Salif, Yemen, earlier this month after the commercial ship Galaxy Leader, in background, was seized by Houthis in November. Photograph: Khaled Abdullah/Reuters The US defence secretary, Lloyd Austin, who is on a trip to Bahrain – home to the US Navy’s headquarters in the Middle East – said Britain, Bahrain, Canada, France, Italy, the Netherlands, Norway, Seychelles and Spain were among nations involved in the Red Sea security operation. The group would conduct joint patrols in the southern Red Sea and the adjacent Gulf of Aden. Austin announced the initiative as “Operation Prosperity Guardian” and condemned the “reckless Houthi actions”, saying in a statement: This is an international challenge that demands collective action. But it was unclear how many other countries are willing to do what mostly US warships have done in recent days – shoot down Houthi missiles and drones, and rush to the aid of commercial ships under attack.\nUpdated at 02.38 CET\n20 Dec 2023 01.34 CET Israel attacks Hezbollah site in Lebanon, says military, after intercepting rockets The Israeli military has attacked a military structure of the Hezbollah militant group after intercepting six rockets launched from Lebanon, the military said. Minutes after the launches, an Israeli air force aircraft “attacked the launcher and the terrorist squad” that carried out a shooting in Lebanese territory, according to Israel Defence Forces (IDF) spokesman Daniel Hagari. בהמשך להתרעה במרחב יפתח, לוחמי ההגנה האווירית יירטו בהצלחה שישה שיגורים משטח לבנון. דקות ספורות לאחר מכן, כלי טיס של חיל האוויר תקף בשטח לבנון את המשגר ואת חוליית המחבלים שביצעה את הירי >> pic.twitter.com/65avA0E4Oa — דובר צה״ל דניאל הגרי - Daniel Hagari (@IDFSpokesperson) December 19, 2023 Two IDF reserve soldiers were “moderately injured” as a result of the shooting at an IDF post in the Malkia area on the border, Hagari said on X (formerly Twitter). The fighters were evacuated to receive medical treatment at a hospital, their families were informed.\nUpdated at 02.33 CET\n19 Dec 2023 00.52 CET Here’s more on the video released by the Palestinian Islamic Jihad group’s armed wing appearing to show two male Israeli hostages in Gaza pleading for their release. The two men identified were shown in the short video asking for efforts to be intensified so they could reunite with their families, Reuters reports. “We are dying every moment. We are in an unbearable situation,” one of the men said, looking at the camera against a plain background. The two men were both unshaven and appeared to have lost weight. One of them is a farmer aged about 79 who was captured from a kibbutz on 7 October during Hamas’s deadly rampage in southern Israel. The other, 47, was also taken from a kibbutz along with his mother, who was later released. His father was killed, according to media reports. On Monday, Hamas released a short video showing three elderly Israeli hostages the militant group seized during its attack, when it took about 240 people hostage. Israel denounced it as a “criminal, terrorist video”.\nUpdated at 01.11 CET\n19 Dec 2023 00.29 CET Embattled Red Cross insists it remains neutral The president of the International Committee of the Red Cross (ICRC) has insisted on the organisation’s neutrality and said criticism was making it increasingly hard to operate in the Israel-Gaza war. Agence France-Presse reports that the Swiss-based organisation, founded 160 years ago to serve as a neutral intermediary between belligerents in conflict and to visit and assist prisoners of war, has been accused by both sides in the conflict of not providing adequate help to those being held hostage. ICRC chief Mirjana Spoljaric Egger told journalists at a Geneva roundtable event: The pressure we experience now in the context of Gaza and Israel is so much more than what we experienced a year ago on Ukraine and Russia. But she said that abandoning neutrality and “adopting a practice of public denunciations is going to make us irrelevant”. View image in fullscreen ICRC president Mirjana Spoljaric Egger. Photograph: Denis Balibouse/Reuters Spoljaric spoke after returning from a visit to Israel and the occupied West Bank last week, following a visit to Gaza in early December. She met with Israeli prime minister Benjamin Netanyahu, who asked her to “place public pressure on Hamas” in a video of the meeting published on X (formerly Twitter). “Public denouncements are not a tool that has proven effective,” Spoljaric said, adding that “it exposes us to a lot of criticism all the time”. After last month’s exchange of Hamas-held hostages for Palestinian prisoners as part of a truce deal, several dozen captives were transported in ICRC vehicles. But instead of being hailed for its role in bringing out many of the freed hostages, the ICRC has been slammed on social media as a “glorified taxi service” or “Uber”. Spoljaric called the comparisons “unacceptable and outrageous”. This is Adam Fulton picking up our live coverage – stay with us for all the latest developments\nUpdated at 00.33 CET\n19 Dec 2023 23.45 CET The head of International Committee of the Red Cross (ICRC) has deplored the conflict in Gaza as a “moral failure” of the international community. Mirjana Spoljaric, speaking to journalists in Geneva on Tuesday, urged Israel and Hamas to reach a new deal to halt the fighting. She said: I have been speaking of moral failure because every day this continues is a day more where the international community hasn’t proven capable of ending such high levels of suffering. This will have an impact on generations not only in Gaza.\n19 Dec 2023 23.26 CET The Israeli president, Isaac Herzog, has said his country was ready for a humanitarian pause amid growing international pressure to stop fighting in Gaza and a sharply deteriorating humanitarian emergency across the territory. Herzog told a gathering of ambassadors on Tuesday: Israel is ready for another humanitarian pause and additional humanitarian aid, in order to enable the release of hostages’ His comments came as Israel continued its bombardment of the Gaza Strip, striking targets in the Jabalia refugee camp and the southern Rafah district. Gaza health officials estimate at least 100 people were killed in the strike. Here’s our video report: 00:01:04 Israel says it is ready for humanitarian pause as strikes continue across Gaza – video\n19 Dec 2023 23.10 CET We reported earlier that Benjamin Netanyahu was meeting with some of the families of hostages at the Kirya military complex in Tel Aviv today. The Israeli prime minister, who attended the meeting with his wife, Sara, “reiterated his commitment to bring about the release of all the hostages to their homes,” his office said in a statement after the meeting. The statement said: Prime Minister Netanyahu and his wife listened very attentively to the hardship and pain of the hostages’ families.\n19 Dec 2023 22.48 CET The military wing of the Palestinian Islamic Jihad, the al-Quds Brigades, has released a video that it claimed showed two hostages who were taken to Gaza during the 7 October attacks on Israel. The video, which was published on the group’s Telegram account, shows the two male Israeli hostages pleading for their release. It comes a day after Hamas’s military wing released footage it claimed showed three Israeli hostages held in Gaza.\n19 Dec 2023 22.35 CET Israeli officials are considering building a “humanitarian compound” in northern Gaza to house displaced Palestinian civilians, according to a report. The establishment of such a compound would allow some Palestinians to move to northern Gaza after the Israel Defense Forces (IDF) completes its current phase of military operations there, multiple sources told CNN. The planning for the compound is in its early stages and Israel has informed the US that it is exploring the project, the outlet reported. Nearly 85% of Gaza’s population has been displaced by the war, and many of those displaced from northern Gaza will have no home to return to. About 80% of buildings in that part of the territory had been damaged or destroyed by the end of November, according to UN analysis.\n19 Dec 2023 22.18 CET Hamas leader to visit Egypt for Gaza ceasefire talks - report Ismail Haniyeh, the most senior political leader of Hamas, is set to travel to Egypt tomorrow for talks on a ceasefire in Gaza and a prisoner exchange with Israel, according to reports. Haniyeh will head a “high-level” Hamas delegation to Cairo on Wednesday, where he will hold talks with Egypt’s intelligence chief, Abbas Kamel, and others, a source told AFP. The BBC has also been told of the visit. The discussions will be “on stopping the aggression and the war to prepare an agreement for the release of prisoners (and) the end of the siege imposed on the Gaza Strip,” the source said. The talks will focus on “the delivery of humanitarian aid, the withdrawal of the Israeli army from the Gaza Strip and the return of displaced persons to their towns and villages in the north”, the source said. View image in fullscreen Chairman of the Hamas Political Bureau, Ismail Haniyeh pictured in Istanbul on 22 September 2023. Photograph: Anadolu Agency/Getty Images The visit would mark Haniyeh’s second trip to Egypt since the start of the war on 7 October, following a trip in early November. It comes after Qatar’s prime minister held talks with the heads of the CIA and Mossad spy agency on Monday. A Qatari official described the talks as “positive” but said no deal is imminent.", "source_domain": "www.theguardian.com", "text": null, "title": "US launches Red Sea protection force after Houthi attacks - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/19/israel-gaza-war-live-updates-hamas-ceasefire-un-security-council-usa-veto"}