{"authors": [], "date_download": "2024-02-05 15:24:09", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Everyone acknowledges that China declared defence budget is lower than its real expenditure. The only question is how much, and it turns out it could be sever", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274068995%2Fchina-defence-budget-could-be-far-greater-than-declared.json", "image_url": "https://cdn.bignewsnetwork.com/ani1702924582.jpg", "language": "en", "localpath": null, "maintext": "Beijing [China], December 18 (ANI): Everyone acknowledges that China's declared defence budget is lower than its real expenditure. The only question is how much, and it turns out it could be several times higher than what most think.\nWhen China announced its 2023 defence budget on March 5, the figure quoted by the government was CNY 1.5537 trillion (USD 224.59 billion). This represented a rise of 7.2 per cent compared to the previous year, the largest percentage increase in the past four years. In absolute terms, the 2023 budget was approximately CNY103.25 billion (USD 14.92 billion) more than in 2022, underscoring how China's defence spending has rebounded strongly.\nHowever, just how realistic is that figure of USD 224.59 billion? Can Chinese data be believed? Of course, many are rightfully suspicious of statistics released by this one-party state, plus no independent verification of Chinese government data is possible.\nIn fact, most observers doubt that the defence budget proclaimed by Beijing is the real number. Certainly, whole categories of spending are absent, but the discrepancy between the stated and true defence budget could actually be vastly different than any have supposed.This was underscored when Senator Dan Sullivan told the US Senate in June, \"...We had a briefing from some of our top intelligence agency officials. It was a classified briefing, and I asked him if this number was classified. They told me no. They came out and said the real Chinese budget, in terms of the military, is probably close to about USD 700 billion. That is a big budget... They are increasing in real terms 6, 7, 8 per cent - cranking out ships, cranking out fifth-generation aircraft.\"Most assuredly, this figure of USD 700 billion for annual defence spending is astounding when compared with China's declared budget of approximately USD 225 billion. This number, as assessed by the US intelligence community, is three times higher than what Beijing admits to!Such a number would fall only slightly short of the USD 816.7 billion that President Joe Biden authorized Defence America's defence budget in 2023.\nHowever, Senator Sullivan did not provide details on how that figure was reached. For example, was it adjusted for purchasing power parity? Furthermore, it is not unknown for American officials to inflate some aspects in order to exaggerate their own cases for funding.\nNonetheless, a sum of USD 700 billion would equate to about 4 per cent of China's GDP, and would blow out of the water Beijing's reassuring claims that, as a proportion of GDP, its defence budget is \"moderate and below global averages.\"Perhaps the truth is that it far exceeds global averages and perhaps even the 3.5 per cent level of GDP for the USA. The Pentagon's annual report - entitled Military and Security Developments Involving the People's Republic of China 2023 - was quite reserved in its comments on Beijing's defence budget.\nIt said, \"In 2022, China's actual military-related spending could be significantly higher than its officially announced defence budget. Actual PRC military expenses are difficult to calculate, largely due to the PRC's lack of transparency. United Kingdom and Europe-based think tanks estimate that the PRC's actual 2022 defence budget is at least 30-40 per cent higher than the PRC's announced budget.\"As the US Department of Defence (DoD) just noted, estimates vary as to China's real defence spending. For example, Stockholm International Peace Research Institute (SIPRI) estimates in recent years give an average total of about 1.36 times larger than the official defence budget.\nSIPRI also noted, \"It is noteworthy that the gap between the official Chinese national defence budget and the spending estimates made by the US DoD is decreasing.\nSince the DoD has historically always estimated actual Chinese spending to be much higher than the budget, the decreasing gap is a further sign that a growing share of China's spending on military activities is now in the official national defence budget.\"It is remarkable that US intelligence sources, as quoted by Senator Sullivan, should give a figure so divergent from anybody else. Nevertheless, this astonishing figure of USD 700 billion stands out starkly. The fact is that the world does not know, and can only speculate and base its predictions on what the Chinese government announces.\nBeijing could easily hoodwink the world, and it certainly has the motivation to do so to disguise its military build-up.\nUnsurprisingly, there is a total lack of transparency or clarity in China's disclosures. Whereas the US issues very detailed information about defence budgets, expenses and contracts, the Chinese budgetary and acquisition system is totally opaque. In fact, the best detail that China can offer is breaking down spending into three broad categories personnel, training and maintenance, and equipment.\nThe Pentagon stated in its aforementioned 2023 report, \"The PRC's published military budget does not include details of expenditure breakouts, including RD and foreign weapons procurement.\"Truly, there are massive defence-related expenditures that China does not categorise under its formal defence budget. Examples include its space program (which is totally managed by the PLA), a lot of civilian/dual-use RD, facility construction, provincial military base operating costs, defence mobilization funds, and supplemental funding like military pensions and benefits.\nNor are internal security forces included in the official defence budget. It excludes the People's Armed Police (PAP), for example, which is better equipped militarily than many armed forces around the world. The Pentagon estimates that the PAP contains 660,000 personnel. The force, which integrates with the PLA's joint operation system, is directly under the Central Military Commission (CMC), and therefore constitutes part of the communist party's armed forces.\nThe same is true of the China Coast Guard (CCG), the world's largest maritime law enforcement force. Liberally equipped with major surface combatants such as frigates, corvettes and giant cutters - incidentally, the CCG has more than 150 regional and ocean-going vessels that displace more than 1,000 tons - the CCG is directly subordinated under the PAP and therefore the CMC.\nAccording to the Coast Guard Law of February 1, 2021, the CCG can defend Chinese sovereignty claims by using force. This is precisely what it has been doing against Philippine vessels in the vicinity of the Second Thomas Shoal in the Spratly Islands, well within the exclusive economic zone of the Philippines.\nMention also has to be made of the People's Armed Forces Maritime Militia (PAFMM), which is subordinate to the CMC via the National Defense Mobilization Department. \"Gray zone\" operations are the PAFMM's modus operandi, and innumerable fishing boats of the PAFMM mobilize to support Chinese strategic goals in places like the South China Sea or Japan's Senkaku Islands.\nFor instance, dozens of PAFMM vessels swarmed Second Thomas Shoal and Philippine resupply boats in recent days. Since 2014, the PAFMM has amassed in its Spratly fleet at least 235 steel-hulled fishing vessels that displaced more than 500 tons.\nThe true situation of Chinese defence spending becomes even more confusing thanks to China's policy of civil-military fusion. This is where commercial entities get involved in dual-use RD, investment and production that have both civil and military applications. The lines become very blurred as to what is or is not military spending.\nThis military-civil fusion strategy is precisely that, a determined effort to \"fuse\" security strategies into national development ones. This benefits the military by acquiring new technology for military purposes and helping reform national technology industries.\nThe phrase \"military-civil fusion\" has been de-emphasized in favour of \"integrated national strategic systems and capabilities\" in recent times, but one thread of that effort is building military requirements into civilian infrastructure, and another is leveraging civilian logistics and services to support the military.\nAn example is commercial vessels such as ferries that are required to meet military specifications so they can be commandeered for exercises or in times of war.\nThe PLA also benefits from a non-market economy, where equipment is cheaper and the military has greater purchasing power than in competitive markets like the USA.\nIt is estimated that approximately 40 per cent of China's defence budget goes on equipment, both new material and to sustain existing inventories.\nBeijing is putting that money to good use too. China has the world's leading hypersonic missile arsenal, it is the top ship-producing nation in the world by tonnage, and it is increasing shipbuilding capacity in every naval class. It completed the Tiangong Space Station in 2022, and there are further plans to expand it.\nThe US DoD added, \"China is capable of producing ground weapon systems at or near world-class standards; although customers also cite persistent quality deficiencies with some exported equipment, inhibiting the PRC's ability to expand its export markets.\"It must be remembered that the yuan goes further in China than the dollar does in the USA. China, the factory of the world, can produce items more cheaply. The cost of production is significantly cheaper and that means, for example, that a missile or ship can be produced more cheaply by China than an identical one in the USA.\nIf apples are to be compared with apples, then purchasing power parity (PPP) calculations are needed. Interestingly, it turns out that the Chinese economy is larger than that of the USA if PPP is used.\nUsing the same equations for military personnel salaries or the cost of building military equipment, then China gets more bang for its buck. In fact, Bill Greenwalt of the American Enterprise Institute has calculated that China outspends the US in real terms when PPP and extraneous non-defence spending hidden within the defence budget are included.\nEven using direct comparisons, American military recruits cost 16 times more than they do in China. A lowly private in the PLA costs just USD 108 per month, compared to USD 1917.60 for a US Army counterpart. Nor does China spend nearly as much on its veterans or on personnel expenses.\nHowever, the Pentagon noted, \"China is facing adverse demographics such as an aging population and low birth rates. The PLA could respond to the demographics issues by raising pay standards to support recruitment and retention efforts, which would place upward pressure on PLA personnel spending relative to other defence spending categories. The PLA is giving priority to recruiting college graduates with science and engineering backgrounds and those experienced in operating high-tech weapons, suggesting the PLA will have to compete with the private sector to attract top talent.\"China is facing stiff economic headwinds, exacerbated by COVID-19 and Chairman Xi Jinping's harsh response to it. To cope with these challenges, spending on general public services declined 0.7 per cent in 2023, while education expenditure increased just 2 per cent.\nYet, the defence still managed a rise of 7.2 per cent! In this light, we can see how important the PLA is to Xi. China says its spending is an \"appropriate and reasonable\" amount, as China needs it to \"fulfil its responsibilities as a major country.\"Yet, its official military expenditure surpasses the combined defence budgets of the 13 next-largest countries in the Indo-Pacific, including Australia, India, Japan and South Korea.\nChina paints a narrative that it is simply reacting to strategic events and its neighbors activities. It conveniently hides the truth that its own spending is ringing alarm bellsacross the world. If the US assessment of USD 700 billion is even remotely accurate,then the picture becomes even more alarming.\nCould it be that China is hiding behind a \"moderate\" defence budget, whereas it is actually secretly spending billions more than that? With such resources being funnelled its way, a rapidly modernizing PLA is preparing not just to defend China, but to threaten, coerce and perhaps even invade others.\nDefence expenditure has practically doubled over the past decade, growing on average 6 per cent annually after adjustment for inflation.\nFormer and recently deceased premier Li Keqiang said earlier this year: \"Our armed forces, with a focus on the goals for the centenary of the People's Liberation Army in 2027, should work to carry out military operations, boost combat preparedness and enhance military capabilities so as to accomplish the tasks entrusted to them by the party and the people.\"Many are anxious about these \"tasks entrusted\" to the PLA by the party. Bludgeoning Taiwan is certainly one of them, whilst hounding smaller nations in the South China Sea is clearly another. Keqiang also acknowledged, \"We remain committed to the party's absolute leadership over the people's armed forces.\"The PLA is a blunt instrument in Xi's hands, and perhaps it is far better funded than most of the world realizes. (ANI)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "China's defence budget could be far greater than declared", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274068995/china-defence-budget-could-be-far-greater-than-declared"}