{"authors": ["Chris Hughes", "Image", "Pool Afp Via Getty Images", "Ap"], "date_download": "2024-02-05 15:24:10", "date_modify": "None", "date_publish": "2023-12-20 22:47:54", "description": "Ukrainian troops battling Russian invaders and the sub-zero winter temperatures have issued a desperate plea as they fear the Israel-Hamas war has distracted attention from their cause", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fukrainian-troops-beg-please-dont-31721924.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31721937.ece/ALTERNATES/s1200/0_20-Ukraine-EXCL.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian troops battling Russian invaders and the sub-zero winter temperatures have issued a desperate plea as they fear the Israel-Hamas war has distracted attention from their cause\nUkrainian troops battling ­Russian invaders as the winter bites have sent a Christmas message to the West: “Please don’t forget us, we need your support.”\nThey fear the Israel-Hamas war is diverting crucial attention, as well as support and supplies, from their 22-month struggle. Trench warfare in eastern Ukraine is becoming increasingly brutal as temperatures plunge below zero. One soldier, Petro, said: “The best Christmas present you can give us is an assurance of continued support. We need help.” There are doubts over US support after Republicans blocked a £50billion emergency military aid package for Ukraine. The US ­Department of Defense has admitted it is coming to the end of funds available to send to the war-torn country.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)\nBut Ukraine’s President Volodymyr Zelensky said this week he is confident the US will honour its pledge to provide billions of dollars in further aid for Kyiv. The leader said Ukraine’s military wants to mobilise 500,000 more troops, which would cost some £8.4bn. But the possibility of Donald Trump winning a second term as US president is causing uncertainty.\nOne Ukrainian diplomatic source said: “You cannot predict with Trump. But the most important thing is Ukraine’s allies have to show unity, as this is the most powerful tool against Russia. “Ukraine will fight to the very end, with our lives, as we are doing, with or without the help of the West.” The source added the UK, which has committed £4.6bn in military aid, has been enormously supportive.\nFor Petro, on the front line with the Armed Forces of Ukraine’s 14th Regiment, this support has to continue. He said the ground is frozen in sub-zero temperatures and ice, wind, fog and snow drifts are making it look, in parts, like Siberia\nImage: AP) AP)\nHe said: “Winter has a negative impact on everything – on the health of soldiers, on the construction of fortifications, on the intensity of fire.” He added of the front line at Avdeevka in Donetsk Oblast: “Intensity of explosions and fighting mean it can turn into one of the hottest places on the planet.”\nPetro also described repelling waves of Russians who attacked “like lemmings”. And he warned decreased aid affects the operational situation and the psychological state of soldiers and citizens, saying: “Many are rushing to conclude our allies have turned their backs on us, we have become forgotten.\n“We need shells and air defence. Lots of armaments. Please give us this Christmas gift, the assurance we will have everything we need to fight evil, and it will be the best ending to this difficult year.”\nNATO has given billions of pounds of missiles, ammunition and tanks, including the UK’s Challenger 2, but they are used up fast. Bruce Jones, a commentator on the Russian military, said: “The same rate of provision must be maintained or exceeded. The war will not let up just because it is freezing.” He added that military and tactical training must also be kept up or increased simply to maintain parity against Kremlin-sponsored forces.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Ukrainian troops beg 'please don't forget us ' in desperate Christmas message to West", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/ukrainian-troops-beg-please-dont-31721924"}