{"authors": [], "date_download": "2024-02-05 15:24:13", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "British Foreign Minister David Cameron and his German counterpart, Annalena Baerbock, have called for a “sustainable ceasefire” in Gaza in a jo", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274067768%2Fbritish-german-top-diplomats-call-for-sustainable-cease-fire-in-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702820154.jpg", "language": "en", "localpath": null, "maintext": "British Foreign Minister David Cameron and his German counterpart, Annalena Baerbock, have called for a \"sustainable ceasefire\" in Gaza in a joint article published in Britain's Sunday Times.\n'We must do all we can to pave the way to a sustainable ceasefire, leading to a sustainable peace,\" the two diplomats wrote. \"The sooner it comes, the better - the need is urgent.\"\nThe World Health Organization said in a statement Sunday that its staff participated in a U.N, health mission to the Shifa Hospital in northern Gaza Saturday, delivering medicines and surgical supplies, orthopedic surgery equipment, and anesthesia materials and drugs.\nThe facility is \"minimally functional,\" WHO said, operating with a staff of \"only a handful of doctors and a few nurses, together with 70 volunteers.\"\nWHO said \"tens of thousands of displaced people\" have taken shelter in the hospital's buildings and grounds.\nThe Israeli military said Sunday that its troops in Jabalia found an entrance in a child's bedroom that led to Hamas tunnels. Video of the discovery was posted online.\nPrime Minister Benjamin Netanyahu said during a TV news conference Saturday that the accidental killings of the three Israeli hostages by Israeli troops Friday \"broke my heart, broke the entire nation's heart.\"\nNetanyahu called the war between Israel and Hamas an existential war that must be fought until victory, despite pressure and costs, adding Gaza would be demilitarized and under Israeli security control.\n'We are as committed as ever to continue until the end, until we dismantle Hamas, until we return all our hostages,' he said.\nNetanyahu said the offensive in Gaza had helped secure a partial hostage-release deal in November. 'The instruction I am giving the negotiating team is predicated on this pressure, without which we have nothing,' he said.\nHostages waved white flag\nA senior Hamas official, Osama Hamdan, said there will be no further hostage releases until the war ends and Israel accepts the militant group's conditions for an exchange. Netanyahu said Israel would never agree to such demands.\nSeveral hundred families, friends and supporters of Israeli hostages held by Hamas militants in Gaza rallied Saturday in Tel Aviv at the 'Hostages Plaza,' calling on the Israeli government to negotiate the remaining hostages' release.\nIsrael Defense Forces spokesperson Rear Admiral Daniel Hagari said Israeli troops erroneously identified the hostages as a threat and fired on them Friday as they were coming out of a building waving a white flag to show that they were posing no threat.\nA woman holds a sign as relatives and supporters rally in Tel Aviv, Israel, on Dec. 16, 2023, for the release of hostages kidnapped from Israel by Hamas on October 7.\nHe said it was not clear whether the hostages had escaped their captors or had been abandoned. Their deaths occurred in Gaza's Sheijaia district, the scene of bloody battles between Israel's military and Hamas militants. Hagari said the army expressed 'deep sorrow' and is investigating.\nAfter the first two hostages were shot, the third young man ran back into the building screaming for help in Hebrew. The commander issued an order to cease fire, but another burst of gunfire killed the third man, an Israeli military official said.\nAccording to a preliminary investigation, the soldiers who followed the third hostage into the building believed he was a Hamas member trying to pull them into a trap, the Israeli newspaper Haaretz reported.\nThe soldiers' behavior was 'against our rules of engagement,' the military official, who spoke on the condition of anonymity to brief reporters in line with military regulations, told reporters. He noted the incident was being investigated at the highest level.\nThe account of how the hostages died raises questions about the conduct of Israeli ground troops. Palestinians on several occasions have reported that Israeli soldiers opened fire as civilians tried to flee to safety.\nHamas has claimed other hostages were previously killed by Israeli gunfire or airstrikes, without presenting evidence.\nFighting continues\nIntense fighting continued Saturday in Gaza between Israeli forces and Hamas, a U.S.- and EU-designated terror group, despite urgings from U.S. officials for Israel to use more precise targeting of Hamas leaders in Gaza, rather than widespread bombing and ground operations.\nResidents in northern Gaza reported heavy bombing and the sounds of gunbattles overnight and into Saturday in devastated Gaza City and the nearby urban refugee camp of Jabaliya.\nAirstrikes and tank shelling overnight also were reported in the cities of Khan Younis and Rafah. Palestinian media said Saturday that dozens of Palestinians were killed in the airstrikes.\nThe Israeli army said Saturday it had raided two schools in Gaza City, saying they were a hiding place for Hamas. On Friday, the military said its troops had destroyed a Hamas command-and-control hub in Sheijaia and conducted a 'targeted raid' on militant infrastructure in Khan Younis.\nThe Middle East has been a tinderbox since Iranian-backed Hamas launched a terrorist attack on Israel on October 7, killing at least 1,200 people while taking about 240 hostages, according to Israel. Israel's response, with both airstrikes and a ground offensive, has killed more than 18,000 Palestinians, a large percentage of them women and children, according to the Hamas-run Gaza Health Ministry.\nVOA White House Correspondent Anita Powell contributed to this report. Some information for this story came from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.theuknews.com", "text": null, "title": "British, German Top Diplomats Call for Sustainable Cease-Fire in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274067768/british-german-top-diplomats-call-for-sustainable-cease-fire-in-gaza"}