{"authors": ["Harry Thompson", "Joseph Wilkes", "Profile.Php Id", "Image", "Getty Images", "Afp Via Getty Images"], "date_download": "2024-02-05 15:15:13", "date_modify": "None", "date_publish": "2024-01-28 21:29:50", "description": "Former president Donald Trump's furious rant came off the back of a drone strike on US personnel in Jordan, which killed three service people and wounded at least 25 others", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fworld-news%2Fbreaking-donald-trump-declares-we-31988778.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31987182.ece/ALTERNATES/s1200/1_Former-President-Donald-Trump-Holds-A-Campaign-Rally-In-Las-Vegas.jpg", "language": "en", "localpath": null, "maintext": "Never miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nDonald Trump has claimed \"we are on the brink of World War 3\".\nThe former president's furious rant came in the wake of three US troops being killed in a drone strike in Jordan carried out by \"radical Iran-backed militia\" according to the White House. He attacked Joe Biden, claiming this would never have happened if he was in charge.\nFollowing the attack, at least 34 people are understood to be being evaluated for possible traumatic brain injury. In response to the attack, President Biden said the US would “hold all those responsible to account at a time and in a manner of our choosing”.\nREAD MORE: Putin mayor calls for men to 'sneak up' on women and make them pregnant\nFor the latest news from across the globe from the Daily Star, click here.\n(Image: AFP via Getty Images)\nTrump's rant came on his TruthSocial account and argued that it demonstrated the weakness of Biden. Trump said: \"The drone attack on a U.S. Military Installation in Jordan, killing three American Servicemembers, and wounding many more, marks a horrible day for America. My most profound sympathies go to the Families of the Brave Servicemembers we have lost.\n\"I ask all Americans to join me in praying for those who have been wounded. This brazen attack on the United States is yet another horrific and tragic consequence of Joe Biden’s weakness and surrender….\nIf you can't see the poll, click here\n\"Page Two: Three years ago, Iran was weak, broke, and totally under control. Thanks to my Maximum Pressure policy, the Iranian Regime could barely scrape two dollars together to fund their terrorist proxies. Then Joe Biden came in and gave Iran billions of dollars, which the Regime has used to spread bloodshed and carnage throughout the Middle East.\n(Image: Getty Images)\n\"This attack would NEVER have happened if I was President, not even a chance - Just like the Iranian-backed Hamas attack on Israel would never have happened, the War in Ukraine would never have happened, and we would right now have Peace throughout the World. Instead, we are on the brink of World War 3…..\n\"Page Three: This terrible day is yet more proof that we need an immediate return to PEACE THROUGH STRENGTH, so that there will be no more chaos, no more destruction, and no more loss of precious American lives. Our Country cannot survive with Joe Biden as Commander in Chief.\"\nFollowing the attack, Defense Secretary Lloyd Austin said in a statement: “Iran-backed militias are responsible for these continued attacks on US forces, and we will respond at a time and place of our choosing. The president and I will not tolerate attacks on American forces, and we will take all necessary actions to defend the United States, our troops, and our interests.”", "source_domain": "www.dailystar.co.uk", "text": null, "title": "Donald Trump declares 'we are on brink of WW3' as US soldiers killed", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/world-news/breaking-donald-trump-declares-we-31988778"}