{"authors": [], "date_download": "2024-02-05 15:24:18", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "British, German, and French foreign ministers are calling for a ceasefire in Gaza, warning that Israel has lost international sympathy Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274068010%2Feu-diplomats-demand-gaza-ceasefire.json", "image_url": "https://cdn.bignewsnetwork.com/YTk0YmI4MDMtNzY.jpg", "language": "en", "localpath": null, "maintext": "The number of Palestinian civilian casualties and near-total population displacement in Gaza have imperiled a lasting peace agreement\nThe foreign ministers of Germany and the UK called on Israel to stop bombing Gaza on Sunday in a joint editorial published in the Sunday Times and Welt am Sonntag. Their French counterpart echoed the demand during a news conference with the Israeli foreign minister later that day.\n\"Too many civilians have been killed,\" UK Foreign Secretary David Cameron and German Foreign Minister Annalena Baerbock wrote. \"The Israeli government should do more to discriminate sufficiently between terrorists and civilians, ensuring its campaign targets Hamas leaders and operatives.\"\nFrench Foreign Minister Catherine Colonna urged an \"immediate truce\" so as to allow \"progress to be made toward a ceasefire to obtain the release of the hostages, to allow access and the delivery of more humanitarian aid to the suffering civilian population of Gaza, and in fact to move toward a humanitarian ceasefire and the beginning of a political solution.\"\nWhile Germany and France supported Tuesday's call for a stop to hostilities at the UN General Assembly, the UK abstained from voting and has previously only called for \"humanitarian pauses\" in the fighting. Cameron's subsequent decision to side with his EU counterparts bolsters the credibility of warnings from Israel's allies that it is fast losing foreign support for its war.\nUS Defense Secretary Lloyd Austin is expected to pressure Israel to adopt a more targeted strategy when he visits on Monday, as alarm over the consequences of its assault on Gaza reaches a fever pitch. President Joe Biden recently cautioned his Middle Eastern counterpart that the \"indiscriminate bombing\" of Gaza was driving allies away.\nIsrael has killed nearly 19,000 Palestinians since Hamas' surprise attack on October 7, according to the Gaza Health Ministry. Much of Gaza has been reduced to rubble, and 85% of its residents have reportedly been displaced. UN representatives from the World Food Programme have warned that half the population is starving due to Israel's refusal to allow more than a trickle of humanitarian aid inside.\nOn Thursday, Irish Prime Minister Leo Varadkar argued the EU had \"lost credibility\" because of its failure to condemn Israel's actions in Gaza, claiming the rest of the world sees a double-standard in Europe's condemnation of Russia's military operation in Ukraine.\nTuesday's UN resolution passed with 153 nations in favor of a ceasefire, 23 abstaining and 10 against. Seventeen EU members backed the move, compared to just eight who supported a truce in October.\nOver 100 Israeli hostages remain in Gaza. Israeli Defense Forces shot three who managed to escape their captors in Shijaiyah on Friday, claiming to have misidentified the trio, who were waving white flags, as enemy combatants. Some hostages' families have joined the calls for a ceasefire, fearing their loved ones will die under Israeli bombardment.", "source_domain": "www.britainnews.net", "text": null, "title": "EU diplomats demand Gaza ceasefire", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274068010/eu-diplomats-demand-gaza-ceasefire"}