{"authors": [], "date_download": "2024-02-05 15:24:19", "date_modify": "None", "date_publish": "2023-12-20 18:41:00", "description": "The top leader of Hamas is in Egypt for talks on halting the war in Gaza and securing the release of at least some of the estimated 129 Israeli captives held there", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fisraeli-ap-gaza-hamas-ismail-haniyeh-b2467476.html.json", "image_url": "https://static.independent.co.uk/2023/12/20/18/APTOPIX_Israel_Palestinians_80399.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe top leader of Hamas was in Egypt for talks Wednesday on halting the war in Gaza and securing the release of at least some of the estimated 129 Israeli captives held by Palestinian militants. Hamas said that Haniyeh, who is believed to be based in Qatar, would discuss the war with Egyptian officials, without providing more details.\nAt the U.N. Security Council, diplomats are negotiating for the third day on a resolution to pause the fighting and allow desperately needed humanitarian aid deliveries.\nIn Yemen, rebels backed by Iran have threatened to target U.S. warships operating near its waters, a day after Washington announced a new international coalition to protect commercial vessels sailing through the Red Sea. The Houthi rebels have threatened to prevent any ship heading to Israeli ports from passing through the Red Sea and Arabian Sea until food and medicine can enter Gaza freely.\nNearly 20,000 Palestinians have been killed since Israel declared war on Hamas, according to the Health Ministry in Gaza, which does not differentiate between civilian and combatant deaths. Thousands more lie buried under the rubble of Gaza, the U.N. estimates. Israel says more than 130 of its soldiers have died in its ground offensive after Hamas raided southern Israel on Oct. 7, killing about 1,200 people — mostly civilians — and taking about 240 hostages.\nCurrently:\n— Israel wants to fast-track humanitarian aid to Gaza via a maritime corridor from Cyprus.\n— U.S. defense secretary makes an unannounced visit to aircraft carrier stationed near Israel\n— A Palestinian baby girl, born 17 days ago during Gaza war, is killed with her brother in Israeli strike.\n— Diplomats at U.N. Security Council delay vote on Gaza humanitarian resolution, trying to avoid U.S. veto.\n— Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.\nHere’s what’s happening in the war:\nISRAELI TROOPS ENTER ‘VAST TUNNEL NETWORK’ UNDER GAZA CITY\nJERUSALEM — The Israeli military said troops located “a vast tunnel network” under Gaza City that included command and control positions, meeting rooms and hideout apartments for the most senior leaders of Hamas, including Yahya Sinwar and Ismail Haniyeh.\nPeter Lerner, an Israeli army spokesman, said on Wednesday that the rooms were 20 meters (60 feet) underground with elevators, stairs, separate water and electricity shafts, and with water, food, weapons and communications equipment stored for a prolonged stay. He said one of the rooms was an “underground hall” 150 meters (yards) across.\nThe military shared videos of what it said were the underground structures, showing tunnels with concrete walls, blast doors, ventilation systems, security cameras, electronic equipment, and long staircases descending deep into the earth. The military said the complex was centered on Palestine Square in central Gaza City, under stores, government offices and civilian apartment buildings.\nHamas is known to have built kilometers (miles) of tunnels, dubbed the “Gaza metro”, under the coastal enclave to operate in safety from Israeli aircraft.\nISRAELI MILITARY DOG’S BODYCAM RECORDED AUDIO OF HOSTAGES WHO WERE LATER KILLED BY TROOPS\nJERUSALEM — A military search dog with a body camera captured audio of three Israeli hostages shouting for help in Hebrew, five days before they were mistakenly shot to death by Israeli troops, according to the army’s chief spokesman, Rear Adm. Daniel Hagari.\nAccording to new information released Wednesday as part of an ongoing investigation, the dog captured the audio on Dec. 10. In the audio, the hostages can be heard shouting in Hebrew the words “help,” “hostages” and two of their names, “Alon” and “Yotam.”\nSoldiers had sent the dog into a building the Shijaiyah neighborhood of Gaza City, suspecting that militants were in inside. The dog was shot to death by the militants. The militants were killed in a firefight with Israeli forces.\nThe Israeli military believes this is how the hostages were able to escape.\nThe dog’s recording was not reviewed until after the hostages were killed days later, as they tried to make themselves known to Israeli forces.\nThe hostages were shirtless and held a stick with a white cloth as they emerged Friday from a building about a kilometer (mile) from the location that had been searched by the dog. An Israeli sniper killed the first two hostages and the third hostage ran back into the building but was killed by other soldiers chasing him.\nIsrael’s military chief Herzi Halevi has said the shooting was against the military’s rules of engagement.\nIris Chaim, the mother of one of the killed hostages, released a recorded message for the military unit involved in the death of her son.\n“I know that everything that happened is not your fault. It is the fault of Hamas,” she said, adding that she thought soldiers’ actions were “the most right thing to do in that moment.”\nHOUTHI REBELS THREATEN TO STRIKE US WARSHIPS IF YEMEN IS ATTACKED\nCAIRO —The top leader of Yemen's Houthi rebels threatened Wednesday to target U.S. warships if attacks are launched against Yemen, a day after Washington announced a new international coalition to protect commercial vessels sailing through the Red Sea.\nFor weeks, the Iran-backed rebels in Yemen have been attacking ships transiting the Red Sea with drones and ballistic missiles. The group has said their attacks aim to end Israel's military offensive in the Gaza Strip. But the Israeli ties to the commercial ships targeted by the hardline Shia force have grown more tenuous with each attack.\nIn an hourlong speech, Abdel Malek al-Houthi said, “America seeks to militarize the Red Sea and the Gulf of Aden, seeking to turn the region into a war zone.”\nOn Tuesday, Washington announced the establishment of a new international coalition to protect vessels traveling through the Red Sea. The United Kingdom, Bahrain, Canada, France, Italy, Netherlands, Norway, Seychelles and Spain have joined the new maritime security mission, U.S. Defense Secretary Lloyd Austin said. Bahrain is the only Arab country in the coalition, and it does not border the Red Sea. Few additional details about how the maritime alliance will operate were made public.\nThe rebel leader also accused other Arab countries of intercepting its missile fire bound for Israel. In both cases, no specific country was named.\nThe Houthis control the capital, Sanaa, several northern provinces bordering Saudi Arabia as well as much of the western highlands and Red Sea ports.\nUNITED NATIONS SAYS 66% OF GAZANS WHO HAD A JOB BEFORE THE WAR ARE NOW UNEMPLOYED\nCAIRO — The war in Gaza has wiped out some 192,000 jobs, erasing 66% of prewar employment in the blockaded coastal territory.\nThat’s according to new estimates released Wednesday by the U.N. labor agency and the Palestinian Central Bureau of Statistics.\nRuba Jaradat, the regional director of the International Labor Organization, said Gaza’s 2.3 million Palestinians face “a humanitarian catastrophe of epic proportions.”\nGaza was already impoverished before the war. Unemployment had hovered around 50% for years as Israel and Egypt maintained a blockade of the territory. Israel said the blockade was needed to prevent Hamas from importing arms, while the Palestinians and rights groups viewed it as collective punishment.\nThe war has also hurt the economy in the Israeli-occupied West Bank, which has been under a lockdown for more than two and a half months.\nTens of thousands of Palestinians from both territories who worked in Israel had their permits suspended. Palestinians have long relied on such employment, which pays higher wages than those available in the occupied territories.\nThe International Labor Organization says 276,000 jobs in the West Bank have been lost since the start of the war.\nIt says the job loses would increase unemployment across both territories to 46%, compared to 24% at this time last year.\nTHE NETHERLANDS WILL DONATE 24 MILLION EUROS TO GAZA CIVILIANS\nTHE HAGUE, Netherlands — The Netherlands is donating an extra 25 million euros (over $27 million) in humanitarian aid for Palestinian civilians in Gaza amid the ongoing Israel-Hamas war.\nThe aid was announced during a visit Wednesday to the Rafah border crossing by Minister for Overseas Trade and Development Cooperation Geoffrey van Leeuwen. He says the money will be used to buy food, water medical supplies and fuel provided by the Red Cross and Red Crescent and the United Nations.\nVan Leeuwen says that his three priorities are “full humanitarian access, substantially more aid including much-needed fuel for the people of Gaza, and the safety of aid workers in Gaza.”\nThe pledge comes on top of 25 million euros in aid for Gaza that the Dutch government previously announced.\nUN SECURITY COUNCIL AGAIN DELAYS VOTE ON HALTING GAZA WAR\nUNITED NATIONS — Trying to avoid another veto by the United States, the U.N. Security Council postponed voting for the second day in a row on an Arab-sponsored resolution that would deliver humanitarian aid to Gaza during some form of halt in the fighting.\nSecurity Council members remained in intense negotiations Tuesday, as the United States has asked for more time. Talks were ongoing in an effort to get the Biden administration to abstain or vote in favor of the resolution.\nInitially planned for Monday, the vote has been pushed back until Wednesday.\nThe draft resolution on the table Monday morning had called for an “urgent and sustainable cessation of hostilities,” but this language was watered down in a new draft circulated early Tuesday.\nIt now “calls for the urgent suspension of hostilities to allow safe and unhindered humanitarian access, and for urgent steps towards a sustainable cessation of hostilities.” The United States in the past has opposed language on a cessation of hostilities.\nThe draft also calls for the U.N. to establish a mechanism for monitoring the aid deliveries. This could be problematic because it bypasses the current Israeli inspection of aid entering Gaza.\nU.S. National Security Council spokesperson John Kirby said Tuesday afternoon, when the vote was still set for 5 p.m. EST: “We’re still working through the modalities of the resolution.”\nHe said: “It’s important for us that the rest of the world understand what’s at stake here and what Hamas did on the 7th of October and how Israel has a right to defend itself against those threats.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | Talks on Gaza cease-fire and freeing more hostages as Hamas leader is in Egypt", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/israeli-ap-gaza-hamas-ismail-haniyeh-b2467476.html"}