{"authors": [], "date_download": "2024-02-05 15:24:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukraine and the European Commission will soon evaluate progress Kyiv has made in aligning its legislation with that of the European Union and will create", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274068119%2Feu-ukraine-to-soon-outline-framework-for-kyivs-accession-talks.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702858001.jpg", "language": "en", "localpath": null, "maintext": "Ukraine and the European Commission will soon evaluate progress Kyiv has made in aligning its legislation with that of the European Union and will create a framework for EU accession talks expected next year, Ukrainian President Volodymyr Zelenskyy said in his nightly video address Sunday.\n'In the coming days, with the European Commission, we will officially launch the process of assessing Ukrainian legislation for compliance with EU legislation - the screening process,' Zelenskyy said.\nThe European Commission reported last month that Ukraine had fulfilled four of seven recommendations for EU accession negotiations, including hiring anti-corruption officials, preparing the judiciary for a major overhaul and aligning media legislation with EU standards.\nThe commission said it would assess Ukraine's progress again in March, part of a long and complicated pathway to membership that the EU's ambassador to Ukraine, Katarina Mathernova, has described as grueling.\nLast week, EU leaders agreed to open membership talks with Ukraine in a surprise decision as the bloc's 27 member states held a two-day summit. Hungarian Prime Minister Viktor Orban abstained from voting, saying he did not want to take part in what he called a \"bad decision.\" He had said Ukraine had not met three conditions.\nWatch related report by Arash Arabasadi:\nEmbed share Ukraine Inches Closer to EU Membership Embed share The code has been copied to your clipboard. width px height px\nThe URL has been copied to your clipboard\nNo media source currently available\n0:00 0:02:52 0:00\nOrban had pledged for weeks to block moving forward with the negotiations. The other 26 members voted in favor of the accession negotiations after Orban agreed to leave the room. Russia praised Hungary, which is considered Moscow's closest ally in the EU, for objecting to the talks.\nHungary later blocked a $54 billion EU aid package for Ukraine in Kyiv's defensive war\nagainst Russia. The EU is expected to discuss the issue in an emergency session early next year.\nSeparately, Russia deployed an Iskander ballistic missile, a cruise missile and attack drones, during airstrikes overnight, Ukraine's Air Force said Sunday.\nUkraine's air defense systems destroyed the cruise missile and 20 attack drones, the air force said on the Telegram messaging app. The Iskander missile 'did not reach its target,' it said, without providing details.\nReuters could not independently verify the report. It was not clear how many drones Russia launched in total or whether the attack caused any damage or casualties.\nHowever, debris from a downed drone killed a civilian in the Odesa region, the governor of the southern Ukrainian region said Sunday.\nAir defense systems destroyed nine Iranian-made attack drones over Odesa, Governor Oleh Kiper said on the Telegram messaging app, calling it the third Russian air assault on the region in the past week.\nRussian losses in Ukraine\nRussia has lost nearly 350,000 troops in Ukraine since Moscow's invasion of the neighboring country almost two years ago, The Kyiv Independent reported Sunday.\nThe newspaper said the General Staff of Ukraine's Armed Forces has reported 346,070 troops have been lost, including 1,250 casualties in the previous 24 hours.\nFILE - Mourners gather to lay flowers in memory of more than 60 Russian soldiers that Russia says were killed in a Ukrainian strike on Russian-controlled territory, in Samara, Russia, Jan. 3, 2023.\nIn addition, the report said Russia has also lost '5,739 tanks, 10,692 armored fighting vehicles, 10,766 vehicles and fuel tanks, 8,137 artillery systems, 923 multiple-launch rocket systems, 609 air defense systems, 324 airplanes, 324 helicopters, 6,278 drones, 22 ships and boats, and one submarine.'\nThe British defense ministry commented on Russia's announcement this month that several Ukrainian regions - Donetsk, Luhansk, Kherson and Zaporizhzhia - will vote in its presidential election, set for March. The regions were included in Russia's September regional elections.\nThe ministry said in its daily Ukraine intelligence update that, as was the case with regional elections, 'It is almost certain that presidential election voting in the Russian-controlled regions will be neither free nor fair.'\nThe ministry said Russia 'will almost utilize methods, including substantive electoral fraud and voter intimidation to ensure Russian President Vladimir Putin wins in the regions by a substantial margin.'\nRussia has no interest in extending a Black Sea grain deal that the United Nations and Turkey brokered with Russia and Ukraine, Russia's agriculture minister, Dmitry Patrushev, was quoted saying by the RIA news agency. 'Our grain export volumes, taking into account the winding down of the grain deal, have by no means fallen, they even slightly increased,' Patrushev said.\nHe said Russia has its own buyers for its grain exports and added Russia's decision not to extend the deal is largely political.\nRussia withdrew in July from the deal. Russia says it quit the deal which had allowed Ukraine to safely export grain from its Black Sea ports because the arrangement was not delivering grain to the poorest countries, and because it still faces barriers to its own exports of grain and fertilizer.\nSome information is from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.britainnews.net", "text": null, "title": "EU, Ukraine to Soon Outline Framework for Kyiv's Accession Talks", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274068119/eu-ukraine-to-soon-outline-framework-for-kyivs-accession-talks"}