{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:24:23", "date_modify": "None", "date_publish": "2023-12-20 13:29:04", "description": "The Pentagon is keeping its cards close to its chest amid reports that officials have offered Biden an option for direct military strikes against Houthi rebels in Yemen.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12885435%2Fbiden-houthi-iran-military-strikes-red-sea.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/20/13/79087667-0-A_Houthi_military_helicopter_flies_over_the_Galaxy_Leader_cargo_-a-13_1703078929837.jpg", "language": "en", "localpath": null, "maintext": "The Biden administration could be looking at another strategy in its battle with the Houthi rebels in Yemen a step further after it emerged that the cost of shooting down one of the group's drones over the Red Sea is around $2 million.\nEarlier this week, the Pentagon announced a ten country coalition that would serve as a deterrent against terror attacks by the Houthis in the Red Sea corridor.\nDefense Secretary Lloyd Austin announced the pact - which also includes the United Kingdom, Bahrain, Canada, France, Italy, Netherlands, Norway, Seychelles and Spain - early Tuesday in Bahrain.\nShips transiting the Red Sea that have come under attack by drones and ballistic missiles fired from Houthi-controlled areas of Yemen. The disruption could have an adverse impact on western economies over the holiday season.\nIn late November, Iran-backed Houthi rebels fired missiles at a US Navy destroyer off the coast of Yemen in a 'significant escalation' with American forces.\nShips transiting the Red Sea that have come under attack by drones and ballistic missiles fired from Houthi-controlled areas of Yemen\nThe Galaxy Leader cargo ship, seized by the Houthis offshore of the Al-Salif port on the Red Sea in the province of Hodeidah, Yemen, 05 December 2023\nLast week, the USS Mason, shown here, provided assistance to the Strinda, a vessel that was hit by a Houthi rocket\nLast week, a Norwegian-flagged tanker was hit by a cruise missile launched by Houthi rebels in the Red Sea in their latest attack on ships to protest against Israel's bombardment of Gaza.\nThe US military's Central Command reported two more attacks on commercial vessels Monday.\nUS military Central Command said the anti-tank cruise missile, launched from a Houthi-controlled area of Yemen, hit the Strinda and the destroyer USS Mason was providing assistance.\nNow, it has emerged that the Pentagon will 'offer' Biden the option of a 'heavy response' to the Iran-backed militia. In response, National Security Council advisor spokesman John Kirby said that he will not 'telegraph any punches one way or the other,' reports Bloomberg.\nThe Pentagon has described Iran's role with the Houthi group as 'significant', providing military and intelligence support.\nAny strike by the US on the militia could bring a standoff with Iran even closer.\nThe seriousness of the recent attacks, several of which have damaged the vessels, has led multiple shipping companies to order their ships to hold in place and not enter the Bab el-Mandeb Strait until the security situation can be addressed.\nHouthi rebels say they won't let up on their attacks. Pictured is Huthi military spokesman, Brigadier Yahya Saree delivering a statement about the group's recent attacks\nA Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea last month\nType 45 destroyer HMS Diamond is among the British warships now helping to protect the vital Red Sea shipping lane\nOn Wednesday, Trump's former National Security Advisor and former US Ambassador to the United Nations, John Bolton, argued in the Washington Post that the Biden administration was showing weakness with its treatment the Houthis.\nBolton also quoted Iran's foreign minister, Hossein Amir-Abdollahian, who recently told The New York Times that the US must face 'consequences' for its support of Israel.\nAll the imports that could be derailed by the Middle East crisis THAILAND Chicken High street sandwiches Frozen foods BANGLADESH Clothes Shoes Shellfish Fish VIETNAM Sound equipment Mobile phones AUSTRALIA Wine Tobacco JAPAN Cars KENYA Tea Coffee SOUTH AFRICA Grapes Advertisement\n'The Biden administration is not only failing to establish even minimal deterrence; it seems incapable of thinking strategically about U.S. interests in the region, dismaying friends and allies alike,' Bolton wrote.\nHe called the coalition a 'purely defensive measure and therefore insufficient.'\nBolton also mocked the administration's attempts at diplomacy, pointing out that neither Iran or the Houthis themselves appear to be interested.\nThe former ambassador also said that the Houthis should be re-designated as a terror organization.\nSeveral other countries have also agreed to be involved in the determent operation but prefer not to be publicly named, a defense official said on the condition of anonymity.\nThe mission will be coordinated by the already existing Combined Task Force 153, which was set up in April 2022 to improve maritime security in the Red Sea, Bab el-Mandeb and the Gulf of Aden.\nThere have been 39 member nations in CTF 153, but officials were working to determine which of them would participate in this latest effort.\nSeparately, the United States has also called on the United Nations Security Council to take action against the attacks.\nIn a letter to council members, U.S. Ambassador Linda Thomas-Greenfield said Houthi attacks targeting commercial vessels legally transiting the international waterways continue to threaten 'navigational rights and freedoms, international maritime security, and international commerce.'\nThe 15 council members discussed the Houthi threat behind closed doors Monday but took no immediate action.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden weighs up direct military strikes against Houthi sites in Yemen to avoid the $2million cost per shot of bringing down the rebel group's attack drones in bid to protect trade routes through the R", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12885435/biden-houthi-iran-military-strikes-red-sea.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}