{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:24:37", "date_modify": "None", "date_publish": "2023-12-19 15:41:44", "description": "Footage shows the young Israeli soldier standing in front of the barrel of a self-propelled Howitzer as it fires off a round, sending her stumbling to the ground and out of the frame of the camera.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12881495%2FIsraeli-artillery-cannon-deliberately-fired-female-soldier.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/19/15/79130907-0-image-m-67_1703000036266.jpg", "language": "en", "localpath": null, "maintext": "Israeli troops deliberately fired an artillery cannon over the head of a female soldier, video shared online shows, prompting an investigation by the IDF.\nFootage shows the young woman standing in front of the self-propelled howitzer as it fires off a round, sending her stumbling to the ground.\nThe reckless incident prompted a quick response from the Israeli military, which stressed that no one was hurt in the stunt.\n'The incident seen in the video is severe and completely deviates from the IDF's safety regulations,' an IDF spokesperson said.\n'An in-depth investigation into the matter will be held as soon as possible, and punishments will be in order. No one was hurt in the incident.'\nIsraeli troops deliberately fire an artillery cannon over the head of a female soldier, video shared online (pictured) shows, prompting an investigation by the IDF\nThe short clip opens with the woman standing on a mound of dirt.\nTo the right, using the mound as cover, is an Israeli self-propelled howitzer cannon, while a row of trees is seen in the background.\nIt is presumed that the cannon is firing from Israel into the Gaza Strip, which is currently under siege by the Israeli army.\nThe soldier has her hands covering her ears, waiting for the cannon to fire.\nThere is a shout - presumably telling the artillery crew to fire.\nNext, a loud bang rings out as the round is launched from the end of the cannon. The gun recoils, blowing dust into the air, billowing the woman's hair at the same time.\nThe force of the round being fired sends her stumbling backwards to the left off the mound, away from where the mobile artillery cannon is positioned, and out of frame.\nIt is not immediately clear from the footage what model of artillery is being used, but it appeared to be the powerful Sholef (Slammer) which is a self-propelled howitzer that uses a modified chassis from an Israeli Merkava - the IDF's main battle tank.\nSholefs fire 155 mm, 52 calibre ordnance at a rate of up to nine rounds per minute.\nFootage shows the young woman standing in front of the self-propelled howitzer as it fires off a round, sending her stumbling to the ground\nThe reckless incident (pictured) prompted a quick response from the Israeli military, which stressed that no one was hurt in the stunt\nThe footage is the latest to show Israeli soldiers in an unfavourable light, after clips earlier this month showed IDF troops trying to set fire to aid in Gaza and ransacking the home of displaced civilians.\nIt emerged as Israeli troops launched more deadly strikes on Tuesday and raided the last working hospital in Gaza City.\nMeanwhile, the UN Security Council delayed voting on an Arab-sponsored resolution for an urgent cessation of hostilities.\nA strike on a home in Rafah where displaced people were sheltering killed at least 28 people, including women and children, and another killed at least three people.\nThis was according to Associated Press journalists, who reported seeing the bodies arrive at two local hospitals early Tuesday.\nNearly 20,000 Palestinians have been killed since Israel declared war on Hamas, according to the Health Ministry in Gaza, which does not differentiate between civilian and combatant deaths.\nThousands more lie buried under the rubble of Gaza, the UN estimates.\nIsrael says 127 of its soldiers have died in its ground offensive that was launched after Hamas raided southern Israel on October 7, killing about 1,200 people - mostly civilians - and taking about 240 hostages back into Gaza.\nPictured: An Israeli soldier directs an artillery unit near the border with Lebanon on December 19, 2023 in Northern Border, Israel\nThe video also came as the Israeli army suspended a group of soldiers recorded smoking a water pipe and joking in front of Palestinians who were detained and blindfolded, in another incident involving poor discipline.\nThe video, which was uploaded to social media and has garnered millions of views in the past two days, shows soldiers laughing and eating snacks as at least seven Palestinians are sitting blindfolded in the same room in the West Bank city of Jenin.\n'The behavior of the soldiers in the videos is deplorable and stands in stark contrast to the values of the IDF (Israel Defense Forces),' an Israeli army spokesperson said.\nAfter a disciplinary hearing, the reserve duty soldiers were suspended until further notice, the spokesperson said.\nAnd last week, the IDF pledged to crack down on its soldiers' behaviour after videos went viral showing them setting fire to food supplies for Gaza, going through lingerie and chanting racist songs.\nThe videos, seemingly filmed and shared by IDF soldiers themselves (as with the video involving the artillery cannon), show them behaving in derogatory and offensive ways, amid the army's ground assault against the enclave.\nOne video shows soldiers riding bicycles through rubble.\nIn another, a soldier films boxes of lingerie found in a Gaza home. In another, a soldier has moved Muslim prayer rugs into a bathroom.\nOn December 10, Rear Admiral Daniel Hagari, the Israeli military's spokesman, condemned some of the actions seen in the recent videos: 'In any event that does not align with IDF values, command and disciplinary steps will be taken.'\nBut critics have said that the videos reflect a sentiment across Israel that, they argue, cares little for Palestinians who have been killed in the conflict.\n'The dehumanisation from the top is very much sinking down to the soldiers,' said Dror Sadot, a spokesperson for the Israeli human rights group B'Tselem, which has long documented Israeli abuses against Palestinians.\nGhassan Khatib, a former Palestinian cabinet minister, said he can't remember a time when each side was so unwilling to consider the pain of the other.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli artillery cannon is deliberately fired as female soldier stands in front of the barrel, sending her to the ground and sparking IDF investigation", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12881495/Israeli-artillery-cannon-deliberately-fired-female-soldier.html?ns_mchannel=rssns_campaign=1490ito=1490"}