{"authors": [], "date_download": "2024-02-05 15:24:38", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Britain?s military is making contingency plans for deployments to the battlefront, Kiev?s former diplomat to London has claimed\r\n\r\n\r\nBritish mi", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274067971%2Fuk-contemplating-sending-troops-to-ukraine-ex-ambassador.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1702836828.jpg", "language": "en", "localpath": null, "maintext": "Britain's military is making contingency plans for deployments to the battlefront, Kiev's former diplomat to London has claimed\nBritish military leaders are making contingency plans for sending troops to Ukraine in case a disastrous turn of events on the battlefield necessitates their deployment to help fight Russian forces, Kiev's former ambassador to the UK has claimed.\nDespite public opposition, the UK government would directly join the fight in Ukraine if there's a \"catastrophic development of the war,\" such as \"the continuation of the occupation,\" ex-diplomat Vadym Prystaiko said on Friday in an interview with the Ukrainian branch of US state-run broadcaster Radio Free Europe/Radio Liberty (RFE/RL).\nThe possibility of military deployments to Ukraine is a well-kept secret among Kiev's Western allies, Prystaiko said. \"No one will ever admit it, especially politicians. Every time they are asked, they will say, 'no, no no way, come on, we'd rather give them everything they need.\"\nHowever, Prystaiko added, British officers are making plans \"for the worst\" - circumstances dire enough to prompt elected leaders to order a direct military intervention in the former Soviet republic. \"In reality, the military is making calculations that, God forbid, they will have to use armed forces. That's why the military and diplomats are there, to plan for the future.\"\nPrystaiko, who also served a stint as Kiev's foreign minister, was fired as ambassador last July, after he criticized Ukrainian President Vladimir Zelensky. His career downfall began when Zelensky responded sarcastically to a suggestion by the UK's then-defense chief, Ben Wallace, that Ukraine should show more gratitude to its Western benefactors. Asked by Sky News about the tone of Zelensky's remarks, he said, \"I don't believe that this sarcasm is healthy.\"\nWallace's successor as UK defense chief, Grant Shapps, hinted in September at deeper British involvement in the Ukraine crisis, including protection of commercial shipping traffic in the Black Sea. UK Prime Minister Rishi Sunak later said there had been \"misreporting\" when Shapps also seemed to suggest that London might send military instructors to Ukraine.\nRussian officials have repeatedly described the conflict as a battle between Moscow and the \"entire Western military machine.\" British special forces have reportedly operated covertly in Ukraine, and Russian President Vladimir Putin claimed last year that there were entire military units in the country \"under the de-facto command of Western advisers.\"\nPolls have shown consistently strong UK public opposition to deploying troops to Ukraine. Prystaiko said that given the mood of voters, none of Kiev's backers is ready to fight the Russians directly. \"It's very difficult for democratic states that depend on the reelection cycle, that depend on their voters, that have to explain themselves a hundred times to make the first step.\"\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "UK contemplating sending troops to Ukraine ex-ambassador", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274067971/uk-contemplating-sending-troops-to-ukraine-ex-ambassador"}