{"authors": ["Ben Quinn"], "date_download": "2024-02-05 15:24:39", "date_modify": "None", "date_publish": "2023-12-19 15:10:51", "description": "Lib Dem MP Layla Moran describes desperate plight of relatives in Gaza after she was granted urgent question on situation", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fpolitics%2F2023%2Fdec%2F19%2Fforeign-policy-david-cameron-immediate-gaza-ceasefire.json", "image_url": "https://i.guim.co.uk/img/media/c3bad45f87bbce3212cdf7098ec008dfc95902ff/0_414_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=98a11e3b263407ecd45e8839cac2e270", "language": "en", "localpath": null, "maintext": "The Liberal Democrat MP Layla Moran has made an impassioned plea in the House of Commons for the government to back an immediate ceasefire in Gaza as she told of the desperate plight of relatives who had taken refuge in a church there.\nThose inside the Holy Family parish in Gaza City were down to their last can of corn, she told the development minister, Andrew Mitchell, who will meet her on Wednesday. Two women were allegedly killed by an Israeli military sniper in the church on Saturday.\n“The people in this church are civilians. They have nothing to do with Hamas. They are nuns, orphans, disabled people. They are a small community who know everyone. It is categorically untrue to say Hamas are operating from there,” she told MPs after she was granted an urgent question on the situation in Gaza.\nMitchell told parliament he hoped that the UK would be able to support a UN security council resolution vote at 3pm (UK time) to call for a ceasefire. While the UK had abstained from a previous vote, whether it would support another one was dependent on the text, he added.\nThe sometimes bitter fault lines that the conflict has created within both the Conservatives and Labour were once again laid bare as Tory MPs clashed on the question of a supporting a ceasefire.\nFlick Drummond, a Conservative MP among a grouping who added pressure on the government for a shift in its approach to the conflict, said on Tuesday morning that an “annihilation” was taking place in Gaza. She shook her head as her colleague Andrew Percy said it was almost as if some MPs did not want Israel to succeed in wiping out Hamas.\nMitchell said he did not agree with the former immigration minister Robert Jenrick, who said “talk of a sustainable ceasefire was unhelpful” and that the Israel Defense Forces (IDF) “should be allowed to finish the job”.\n“We are working towards a sustainable ceasefire. We are not there yet. We should all be working towards it,” said Mitchell, who added that the UK wanted to see a more “surgical approach” by Israeli forces.\nForeign policy experts including a former head of the armed forces have meanwhile urged David Cameron to back an “immediate ceasefire” in Gaza in the run-up to Tuesday’s crucial UN security council vote.\nThe failure to call for a ceasefire was “strategically ill-advised and morally indefensible”, the British foreign secretary was told in a letter.\nCameron will call for increased coordination between allies to address the “desperate” humanitarian situation, and use a trip to Paris and Rome on Tuesday to reiterate his call for a sustainable ceasefire in Gaza. But the spotlight falls on the UN security council meeting after the US vetoed a previous attempt to pass a ceasefire motion.\n“The UK does not have to follow America’s lead – particularly when US public and opinion is far from united,” says the letter from Gen Lord David Richards, a former head of the armed forces, and others including six former UK ambassadors.\nThey welcomed the “slight positive change in tone” last week, adding: “We implore the United Kingdom to once again work with all members of the UN security council to ensure a renewed resolution for an immediate ceasefire is brought forward, and then to vote in favour of it.”\nRishi Sunak told MPs on the Commons liaison committee that he did not want the Israel-Gaza conflict to last “a moment longer than it has to”, when asked if the UK would back a United Nations resolution on ceasefire.\nHe said it was “clear that too many innocent civilians have died” in Gaza, adding that UK had “repeatedly” urged Israel to show restraint. Pressed over whether Israel had broken international law in its pounding of Gaza, he suggested that Hamas was responsible for hiding amid the civilian population.\nThe prime minister denied that cuts to the UK’s aid budget had contributed to attacks by Houthi rebels in Yemen on commercial shipping in the Red Sea.", "source_domain": "www.theguardian.com", "text": null, "title": "MPs clash in Commons as government urged to back instant Gaza ceasefire", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/politics/2023/dec/19/foreign-policy-david-cameron-immediate-gaza-ceasefire"}