{"authors": [], "date_download": "2024-02-05 15:24:40", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Calls for a cease-fire in Gaza are growing among some of Israel’s allies as Israeli forces have intensified their war on Hamas. British Foreign Minis", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274068022%2Fcalls-for-gaza-cease-fire-grow-as-israel-vows-to-dismantle-hamas.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702841765.jpg", "language": "en", "localpath": null, "maintext": "Calls for a cease-fire in Gaza are growing among some of Israel's allies as Israeli forces have intensified their war on Hamas.\nBritish Foreign Minister David Cameron and his German counterpart, Annalena Baerbock, called for a \"sustainable cease-fire\" in Gaza in a joint article published in Britain's Sunday Times. 'Israel will not win this war if its operations destroy the prospect of peaceful co-existence with Palestinians,' they wrote.\nDuring a visit in Israel Sunday, French Foreign Minister Catherine Colonna called for an 'immediate truce' aimed at releasing more hostages, getting larger amounts of aid into Gaza and moving toward 'the beginning of a political solution.'\nFrance's Foreign Ministry earlier said an employee was killed in an Israeli strike on a home in Rafah on Wednesday. It condemned the strike, which it said killed several civilians, and demanded clarification from Israeli authorities.\nIsrael could also face pressure to do more to protect civilians when U.S. Defense Secretary Lloyd Austin visits Monday. Washington is expressing growing unease with civilian casualties even as it provides vital military and diplomatic support to Israel.\nIn an appearance on ABC's This Week, U.S. Senator Chris Van Hollen said that there are \"unacceptable high levels of civilian casualties\" in Gaza and added that the U.S. is seeing \"very loose rules of engagement\" there. \"We need to make sure that our [U.S.] values are reflected in this so long as we are providing all of this equipment,\" he stressed.\nTurkish Foreign Minister Hakan Fidan asked his U.S. counterpart Antony Blinken in a call Sunday for Washington to use its influence over Israel to stop Israeli attacks on Gaza and the West Bank, a Turkish diplomatic source said.\nPalestinians inspect a debris field following an Israeli raid at Kamal Adwan hospital, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in the northern Gaza Strip, Dec. 16, 2023.\nFidan told Blinken that Israel should be made to sit at the negotiating table to discuss a two-state solution after a full cease-fire is achieved.\nPope Francis said Sunday, Israel was using 'terrorism' tactics in Gaza, decrying the reported killing by the Israeli military of two Christian women who had taken refuge\nat the Latin Patriarchate of Jerusalem, the Catholic authority in the Holy Land.\nThe Patriarchate said in a statement that an Israel Defense Forces (IDF) 'sniper' killed the two women and shot seven other people as they tried to protect others.\nAn Israeli Foreign Ministry spokesperson said the incident was still under review.\nMeanwhile protesters in Israel are pressuring the government to renew hostage negotiations with Gaza's Hamas rulers.\nDuring a TV news conference Saturday Israeli Prime Minister Benjamin Netanyahu said he was heart-broken about the accidental shooting by the Israeli military of the three hostages, who came out of hiding shirtless waving a white flag. He called the Israel - Hamas conflict an existential war that must be fought until victory, despite pressure and costs and said that after the war, Gaza would be demilitarized and under Israeli security control.\nNetanyahu also said that the only way to secure the release of the remaining hostages was intense military pressure on Hamas.\nHamas tunnels\nThe Israeli army said Sunday, it uncovered the biggest Hamas tunnel in the Gaza Strip so far, just a few hundred meters near the Erez crossing, which Israel uses for the controlled entry of Palestinian workers and those travelling for medical care.\nThe tunnel was wide enough to allow small vehicles to travel within the tunnel, according to an AFP photographer who was granted access to the tunnel.\nThe underground passage formed part of a wider branching network that stretched for over four kilometers and came within 400 meters of the Erez border crossing, the army said in a statement.\n'Millions of dollars were invested in this tunnel. It took years to build this tunnel ... Vehicles could drive through,' Israel's chief military spokesperson Rear Admiral Daniel Hagari told reporters.\nIsraeli soldiers are seen in a tunnel the military says Hamas militants used to attack the Erez crossing, in the northern Gaza Strip, Dec. 15, 2023.\nThe honeycomb of passageways features a drainage system, electricity, ventilation, sewage and a communication network as well as rails.\nThe Israeli army said it had found a large cache of weapons stored in the tunnel, ready to be used in an attack.\nThe Israeli military also said Sunday that its troops in Jabalia found an entrance in a child's bedroom that led to Hamas tunnels. Video of the discovery was posted online.\nThe tunnels have been a challenge for Israel's engineers, worried the networks could conceal hostages held by Hamas.\nThe Kerem Shalom crossing between Israel and Gaza opened for aid trucks Sunday for the first time since the outbreak of war, officials said, in a move to double the amount of food and medicine reaching civilians in desperate need in the enclave.\nThe World Health Organization said in a statement Sunday that its staff participated in a U.N, health mission to the Shifa Hospital in northern Gaza Saturday, delivering medicines and surgical supplies, orthopedic surgery equipment, and anesthesia materials and drugs.\nThe facility is \"minimally functional,\" WHO said, operating with a staff of \"only a handful of doctors and a few nurses, together with 70 volunteers.\"\nWHO said \"tens of thousands of displaced people\" have taken shelter in the hospital's buildings and grounds.\nThe Middle East has been a tinderbox since Hamas fighters stormed into nearby Israeli towns on October 7, killing 1,200 people and taking more than 200 hostages. Israel's response, with both airstrikes and a ground offensive, has killed nearly 19,000 Palestinians, a large percentage of them women and children, according to the Hamas-run Gaza Health Ministry.\nIsrael says 121 soldiers have been killed since the ground campaign began on Oct. 27, when tanks and infantry rolled into Gaza's cities and refugee camps.\nSome information for this story came from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Calls for Gaza Cease-Fire Grow as Israel Vows to Dismantle Hamas", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274068022/calls-for-gaza-cease-fire-grow-as-israel-vows-to-dismantle-hamas"}