{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com", "Associated Press"], "date_download": "2024-02-05 15:24:42", "date_modify": "None", "date_publish": "2023-12-19 06:57:15", "description": "The Pentagon has announced the US is joining forces in a 10-nation military pact to counter terror threats in the Red Sea after a series of strikes on commercial vessels.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12879943%2FUS-military-collation-red-sea-Houthi-attack-ships.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/19/06/79115301-0-image-a-20_1702966502720.jpg", "language": "en", "localpath": null, "maintext": "The Pentagon announced the US is joining forces in a 10-nation military pact to try and counter terror threats in the Red Sea after a series of drone and missile strikes on commercial vessels.\nDefense Secretary Lloyd Austin announced the pact - which also includes the United Kingdom, Bahrain, Canada, France, Italy, Netherlands, Norway, Seychelles and Spain - early Tuesday in Bahrain.\nShips transiting the Red Sea that have come under attack by drones and ballistic missiles fired from Houthi-controlled areas of Yemen.\nThe group has said the attacks are in response to the Hamas-Israel war.\nThe seriousness of the attacks, several of which have damaged the vessels, has led multiple shipping companies to order their ships to hold in place and not enter the Bab el-Mandeb Strait until the security situation can be addressed.\nThe Pentagon has announced that the United States is joining forces in a 10-nation military pact to try and counter terror threats in the Red Sea after a series of drone and missile strikes on commercial vessels\nThe US military's Central Command reported two more attacks on commercial vessels Monday.\nThe strikes have been making headlines since an American warship and multiple commercial ships came under attack in the Red Sea in early December.\nThe Houthi, which rules much of Yemen, says its attacks are a show of support for the Palestinians and has vowed they will continue until Israel stops its offensive on the Gaza Strip - more than 1,000 miles from the Houthi seat of power in Sanaa.\nHouthi rebels have been launching a series of attacks on vessels in the Red Sea - as well as launching drones and missiles targeting Israel as it wages war against Hamas in the Gaza Strip.\nThe Yemeni rebels were officially recognized as a terrorist organization by the United States under the Trump administration - until Biden removed the militants from the list in 2021.\nIn October, the Pentagon confirmed that Arleigh Burke-class guided-missile destroyer USS Carney - stationed in the waters between Africa and Asia - was under attack.\nPresident Joe Biden has approved the United States' formation of the coalition\nDefense Secretary Lloyd Austin announced the pact - which also includes the United Kingdom, Bahrain, Canada, France, Italy, Netherlands, Norway, Seychelles and Spain - early Tuesday in Bahrain\nHouthi rebels have been launching a series of attacks on vessels in the Red Sea - as well as launching drones and missiles targeting Israel as it wages war against Hamas in the Gaza Strip. Pictured: Palestinians celebrate by a destroyed Israeli tank at the Gaza Strip fence east of Khan Younis on October 7\nIn late November, Iran-backed Houthi rebels fired missiles at a US Navy destroyer off the coast of Yemen in a 'significant escalation' with American forces.\nLast week, a Norwegian-flagged tanker was hit by a cruise missile launched by Houthi rebels in the Red Sea in their latest attack on ships to protest against Israel's bombardment of Gaza.\nUS military Central Command said the anti-tank cruise missile, launched from a Houthi-controlled area of Yemen, hit the Strinda and the destroyer USS Mason was providing assistance.\nNow, the collation will look to protect ships in the Red Sea and deter further attacks.\n'This is an international challenge that demands collective action,' Defense Secretary Lloyd Austin said in statement released just after midnight in Bahrain.\n'Therefore today I am announcing the establishment of Operation Prosperity Guardian, an important new multinational security initiative.'\nPictured: USS Carney, DDG 64, in Jacksonville, Florida. The Pentagon said: 'We´re aware of reports regarding attacks on the USS Carney and commercial vessels in the Red Sea and will provide information as it becomes available'\nUS military Central Command said an anti-ship cruise missile 'launched from a Houthi-controlled area of Yemen' hit the Strinda and the destroyer USS Mason (pictured in 2021) was providing assistance\nUS military Central Command said the anti-tank cruise missile, launched from a Houthi-controlled area of Yemen, hit the Strinda (file image) last night\nSome of the countries will conduct joint patrols while others provide intelligence support in the southern Red Sea and the Gulf of Aden.\nSeveral other countries have also agreed to be involved in the operation but prefer not to be publicly named, a defense official said on the condition of anonymity.\nThe mission will be coordinated by the already existing Combined Task Force 153, which was set up in April 2022 to improve maritime security in the Red Sea, Bab el-Mandeb and the Gulf of Aden.\nThere have been 39 member nations in CTF 153, but officials were working to determine which of them would participate in this latest effort.\nSeparately, the United States has also called on the United Nations Security Council to take action against the attacks.\nIn a letter to council members, U.S. Ambassador Linda Thomas-Greenfield said Houthi attacks targeting commercial vessels legally transiting the international waterways continue to threaten 'navigational rights and freedoms, international maritime security, and international commerce.'\nThe 15 council members discussed the Houthi threat behind closed doors Monday but took no immediate action.\nThe United States has also called on the United Nations Security Council to take action against the attacks\nThe 15 council members discussed the Houthi threat behind closed doors Monday but took no immediate action\nTo date, the U.S. has not struck back at the Iranian-back Houthis operating in Yemen or targeted any of the militants´ weapons or other sites.\nOn Monday, Austin did not answer a question as to why the Pentagon had not conducted a counterstrike.\nThe United States and Britain have condemned the attacks on shipping, blaming Iran for its role in supporting the Houthis. Tehran says its allies make their decisions independently.\nSaudi Arabia has asked the United States to show restraint in responding to the attacks.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Pentagon announces new 10-nation military pact to counter terror threat in the Red Sea after spate of drone and missile strikes on commercial vessels", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12879943/US-military-collation-red-sea-Houthi-attack-ships.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}