{"authors": ["Bethan Mckernan", "Ruth Michaelson"], "date_download": "2024-02-05 15:15:17", "date_modify": "None", "date_publish": "2024-01-28 16:59:28", "description": "Countries defunding UNRWA, the main aid distributer in Gaza, accused of collectively punishing more than 2.2 million Palestinians", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F28%2Ffamine-in-gaza-is-being-made-inevitable-says-un-rapporteur.json", "image_url": "https://i.guim.co.uk/img/media/70e29b150dc04261217f59938dae1f00adfe3e17/0_0_7373_4422/master/7373.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a4b9f6b139184a88a89d2b153369ff22", "language": "en", "localpath": null, "maintext": "The Gaza Strip is facing “inevitable famine” because of the decision by western countries to pause funding for the UN’s agency for Palestinian affairs after Israeli accusations that 12 of the group’s employees took part in the Hamas attack on 7 October last year.\nMichael Fakhri, the UN special rapporteur on the right to food, said on Sunday “famine was imminent” and now “inevitable”, in a comment following the news that the US and nine other countries were suspending additional funding to the UN Relief and Works Agency for Palestinian Refugees (UNRWA).\n“This collectively punishes over 2.2 million Palestinians,” he said.\nAccording to the UN secretary-general,António Guterres, 12 UNRWA staff members were identified by Israel, nine of which had been fired, one killed and the identities of two more were being checked. A UN investigation has been launched.\nIsrael has not publicly shared the details of its allegations against the UNRWA employees, which according to the Axios website were provided by the Israel Defense Forces (IDF), and internal security service, the Shin Bet. The information “pointed to the active participation of UNRWA staffers along with the use of the agency’s vehicles and facilities”, it reported.\nAn UNRWA employee in the region said staff lists in Gaza were cross-referenced against UN blacklists and shared with Israel, and that Israeli authorities had not raised significant objections before.\nIt was also unclear yet what reassurances from UNRWA would be required for donors to restart funding, they said.\nAbout half of Gaza’s population was already heavily dependent on UNRWA assistance before the war, the organisation providing help so essential that in some areas it supplants state services inadequately run by Hamas. The organisation provides schooling, medical care, flour for local bakeries, and runs desalination plants to ensure Palestinians can get clean water.\nSince 7 October, when the Palestinian militant group launched an unprecedented attack on Israeli territory, killing about 1,140 people, UNRWA’s schools have become shelters for those displaced amid the Israeli bombing campaign which has killed more than 26,400 people. The agency is also the main vector for aid distribution.\n“This will be a catastrophic situation,” said Haneen Harara, a worker at a Dutch non-governmental organisation, sheltering in Gaza’s southernmost city of Rafah. Her family had already spent hours each day queuing and walking to find what little food and water was available, much of it provided by UNRWA, she said. “If UNRWA shuts down it will make the situation so much worse. Even before this news there were huge limits on the aid entering Gaza.”\nWhile UNRWA staff are trained for emergency responses, the worst-case scenario planning for Gaza envisioned 150,000 displaced people in 50 shelters for a maximum duration of 50 days. The war, entering its fourth month, has displaced 85% of the population from their homes and left civilians facing acute shortages of food, water and medicine in cold and wet winter conditions.\nView image in fullscreen Palestinian children forced out of the north of the Gaza Strip at makeshift shelters in Deir al-Balah, 28 January. Photograph: Mohammed Saber/EPA\nThe funding freeze drastically threatens the already meagre supply of aid reaching the besieged coastal territory. Humanitarian groups including the UN estimate that 500 lorries carrying aid are required daily to provide the minimum help required, but the number at the moment able to cross through Egyptian and Israeli checkpoints is often below 100.\nPrior to the donor decision, UNRWA had already been forced to make new distribution plans for food to accommodate the thousands of people camped in their shelters and often just as many outside, also on the verge of starvation after being displaced multiple times.\nUNRWA’s crisis has also overshadowed the historic interim ruling on Friday from the world’s top court that Israel must “take all measures within its power” to avoid civilian deaths in Gaza and enable the delivery of humanitarian aid in order to prevent “acts of genocide” in the strip.\nFakhri, the UN special rapporteur, said on X on Sunday: “The day after [the international court of justice] concluded that Israel is plausibly committing genocide in Gaza, some states decided to defund UNRWA for the alleged actions of a small number of employees. This collectively punishes +2.2 million Palestinians. Famine was imminent. Famine is now inevitable.”\nThe agency, established in 1949 after the creation of Israel, supports more than 5.6 million Palestinians in the occupied territories, including in Jerusalem, plus refugees and their descendants in Syria, Lebanon and Jordan. It had already struggled to raise funding in recent years, an issue dramatically exacerbated by Donald Trump’s 2018 decision to cut US support, later restored by the Biden administration. In 2022, the US was the agency’s biggest donor, providing $340m.\nA total of 152 UN employees have been killed in the war to date. Earlier this week, Hamas and Israel traded blame for an attack on an UNRWA building in Khan Younis being used as a shelter in which 13 people were killed.\nIt is widely believed in Gaza that anyone who crossed the fence into Israel on 7 October – whether or not they took part in the atrocities – has been put on an Israeli target list for assassination by drone or airstrike. Hundreds of Palestinians, among them petty criminals and civilians, also entered Israel along with Hamas in the chaos of that morning.\nMuthanna al-Najjar, a journalist who went to Nir Oz kibbutz, filmed the abduction of the Bibas family and in the footage can be heard imploring the gunmen not to hurt them. His family home in Khan Younis was hit by an airstrike in October, and homes belonging to several other relatives were targeted during a single night in November; altogether he lost 23 family members in the attacks. The IDF did not immediately respond to a request for comment.\nNajjar said: “Even though I handled the situation humanely, preventing harm to the settlers [Israelis] during my work, Israel destroyed my house with a missile.”", "source_domain": "www.theguardian.com", "text": null, "title": "Famine in Gaza is being made ‘inevitable’, says UN rapporteur", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/28/famine-in-gaza-is-being-made-inevitable-says-un-rapporteur"}