{"authors": ["Ellie Doughty"], "date_download": "2024-02-05 15:24:46", "date_modify": "None", "date_publish": "2023-12-19 15:03:07", "description": "VLADIMIR Putin is desperately trying to take down Ukraine on six fronts in suicidal \"meat assaults\" - with Russia reportedly haemorrhaging 1,000 soldi", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25104385%2Fputin-attacking-ukraine-losing-soldiers-election%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/228-separate-battalion-127th-separate-867170611.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "VLADIMIR Putin is desperately trying to take down Ukraine on six fronts in suicidal \"meat assaults\" - with Russia reportedly haemorrhaging 1,000 soldiers a day in recent battles.\nKremlin kingpin Vlad is understood to have lost over 340,000 troops since the beginning of his brutal invasion in Ukraine - and has an election coming up to contend with.\n6 Ukraine holds off Russian forces on six different fronts in Ukraine Credit: EPA\n6 Russian President Vladimir Putin lost 1,000 soldiers a day during the weekend's brutal fighting Credit: AFP\n6\nSix different key points on the frontline were bombarded by fighting over the weekend, as Russian forces targeted Kupiansk, Lyman, Bakhmut, Avdiivka, Marinka and Zaporizhzhia.\nIn just one day over 100 different bloody battles took place.\nRussia lost 1,250 men on Sunday alone, while Saturday's death toll hit 930, Ukraine's General Staff stats report.\nTheir figures put the total Russian losses over a three-day bombardment to 3,270 troops.\nIt comes as the Russian dictator pushes towards the 2024 election, where he plans to renew his decades-long rule.\nHe is all but certain to win the no-doubt rigged election, despite his painfully slow grind in Ukraine that is coming up on two years.\n\"The enemy launched a missile strike and six airstrikes and bombarded the positions of our forces and populated areas 62 times using multiple-launch rocket systems.\"\nCountless attacks by Russian forces from land and air were reportedly rebuffed on the different fronts.\nVlad's forces have apparently lost tens of thousands of tanks, armoured vehicles, rocket systems, aircraft, ships, submarines and drones alongside troops.\nThe recent figures emphasise this latest humiliating blow to the despot's efforts in Ukraine.\nUkrainian official Anton Gerashchenko said Putin is now on the hunt for more soldiers to pad out his \"meat assaults\" on Ukraine.\nHe is reportedly \"simplified obtaining Russian citizenship\" for people in Belarus, Moldova and Kazakhstan to increase recruits.\nGerashchenko said those citizens will now no longer need to have lived in Russia for five years, or have knowledge about its history and laws.\nRussian Defense Minister Sergei Shoigu has said the country is also increasing the size of its armed forces to over one million people.\nJust days ago embarrassing footage showed a Russian fighter jet shot down by Putin's own missiles.\nAnd days before a Russian pilot nearly died in another embarrassing friendly fire near miss.\nThe wives and girlfriends of Russian soldiers even told Vlad to \"go to the frontline yourself - and die\".\nIn a message posted to a Telegram channel fighting for mobilised troops to be brought home, the women wrote: \"Vladimir, what have you brought people to?\n\"We Russians have no hope left under your leadership.\n\"Finish your work and sit down at the negotiating table.\"\nAnd just last week, the president faced a fresh embarrassment when he hosted his first TV call-in show since the war began.\nThe closely-regulated \"Direct Line with Vladimir Putin\" saw civilians and journalists ask him questions live on air.\nDespite trying to talk his way out of some of the trickier lines of questioning, including some on falsely imprisoned Evan Gershkovich, Putin couldn't avoid this humiliation.\nMessages from angry citizens popped up on a huge screen in front of him, asking: ''Why is your 'reality' at odds with our lived reality?\" and telling him to \"quit\".\nOne even said: \"Don't run for another term as Russian president - make way for the young!\"\nBut the dictator will no doubt run again in the so-called elections scheduled for March 2024.\nHe has twice changed Russia's constitution to extend his time in power, and could well sit at the head of the table until his mid-80s.\nSince former president Boris Yeltsin handed him the keys in 1999, Putin has served as president for longer than any other Russian ruler with the exception of Josef Stalin.\nIncredibly, around 80 per cent of civilians approve of Putin's performance in power, according to a recent independent poll.\nThis could be more to do with the brutal crackdowns in Russia reserved for those who criticise the establishment.\nThe weekend triumph for Ukraine comes amid a brutal wintry fight to hold back against Putin's armies.\nBuried in icy trenches in sub-zero temperatures, Russia has failed to break the long-standing brutal stalemate as Zelenskyy's forces hold off on the frontline.\n6 Civilians in Lyman, one of the war-torn six fronts Credit: Reuters\n6 Ukraine is holding off Vlad's forces in an icy tundra battleground Credit: Newsflash", "source_domain": "www.thesun.co.uk", "text": null, "title": "Putin attacking Ukraine on SIX fronts and 'losing 1,000 soldiers a day' in suicidal 'meat assaults' as he pushes for win", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25104385/putin-attacking-ukraine-losing-soldiers-election/"}