{"authors": [], "date_download": "2024-02-05 15:24:47", "date_modify": "None", "date_publish": "2023-12-19 02:34:34", "description": null, "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fus-affirms-support-israel-calls-mount-gaza-ceasefire-1722256.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721976/mother-her-daughter-prepare-traditional-bread-their-destroyed-house-rafah-southern-gaza-strip.jpg", "language": "en", "localpath": null, "maintext": "The United States vowed Monday it would continue to arm Israel in its campaign against Hamas, even as it called for more humanitarian aid to Palestinians in the devastated Gaza Strip.\nFighting raged on in the third month of the bloodiest-ever Gaza war, with the Hamas-run health ministry reporting another 110 people killed in strikes on the Jabalia camp near Gaza City.\nThe UN Security Council in New York was set to vote on another call for a ceasefire in the besieged territory, after previous bids were vetoed by Israel's key ally the United States.\nBut the vote was postponed until Tuesday as negotiations continued over the text of the document, diplomatic sources at the United Nations told AFP.\nVisiting Israel, US Defense Secretary Lloyd Austin said: \"We must get more humanitarian assistance in to the nearly two million displaced people in Gaza and we must distribute that aid better.\"\nHe confirmed Washington was \"Israel's greatest friend\" and would continue to provide \"critical munitions, tactical vehicles and air defence systems\".\nAustin added that his visit did not aim to \"dictate timelines or terms\" for the war.\nAustin is touring the Middle East as concerns grow over the war's spread around the region, with Iran-backed Huthi rebels in Yemen attacking international shipping in the Red Sea in solidarity with Hamas.\nThe attacks have disrupted global trade, driving up oil prices, with energy giant BP among the latest major firms to stop using the vital route that leads to the Suez Canal.\nThe United States on Monday announced a 10-nation coalition to quell Huthi attacks in the Red Sea, with Britain, France, Bahrain and Italy among the countries joining.\nThe war in Gaza began when its Islamist rulers Hamas launched an unprecedented attack on October 7, killing around 1,140 people in Israel, mostly civilians, and abducting 250, according to an AFP tally based on official Israeli figures.\nGaza's health ministry says Israel's military response has killed more than 19,400 people, mostly women and children, while reducing vast areas to rubble.\nInternational alarm has mounted over the plight of 2.4 million Gazans enduring daily bombardment, food and water shortages and mass displacement.\nHuman Rights Watch charged that Israel \"is using starvation of civilians as a method of warfare\".\n\"Israeli forces are deliberately blocking the delivery of water, food and fuel, while wilfully impeding humanitarian assistance, apparently razing agricultural areas,\" the New York-based organisation said.\nAn Israeli foreign ministry spokesman said \"Human Rights Watch... has no moral basis to talk about what's going on in Gaza,\" charging that the group had ignored \"the suffering and the human rights of Israelis\".\nThe head of the UN agency for Palestinian refugees, Philippe Lazzarini, earlier said he \"would not be surprised if people start dying of hunger, or a combination of hunger, disease, weak immunity\".\nIsrael has approved aid deliveries into Gaza via its Kerem Shalom crossing, aside from the Rafah crossing with Egypt, and dozens of trucks entered through Kerem Shalom on Monday, an AFP journalist said.\nState Department spokesman Matthew Miller told reporters on Monday that commercial trucks had entered Gaza, a first since the war began, joining UN-led deliveries.\nIt is \"a critical step towards improving the lives of the Palestinian people in Gaza\", Miller said.\nAt the Rafah crossing, many families gathered in the hopes of finally being allowed across to safety.\n\"We've been here for about a month,\" said Safa Fathi Hamad. \"We are going to die, food is very limited and we have no protection.\"\nPrime Minister Benjamin Netanyahu on Sunday again vowed Israel would destroy Hamas, free the hostages and ensure Gaza would never again become \"a centre for terrorism\".\nThe army has reported 129 deaths in Gaza since it launched ground operations in late October.\nThe army released a report Sunday detailing part of a vast Hamas tunnel network, big enough to drive vehicles through, featuring rails, power lines, drainage systems and a communications network.\nA Hamas official in Lebanon downplayed the Israeli discovery, saying that the tunnel had already served its purpose.\nIsrael has faced mounting global pressure to either slow, suspend or stop hostilities.\nThat includes the families of the remaining 129 hostages believed held in Gaza, whose anger and fear intensified after Israeli forces mistakenly shot dead three hostages who had escaped their captors.\nThe trio waved white flags and used food leftovers to write a Hebrew-language message on a white sheet before they were shot, reports said.\nIsraelis protested Monday in central Tel Aviv, calling for swift action to release the remaining hostages.\nHamas's military wing released footage it claimed showed three of those still held captive. The video featured three bearded men sitting on chairs at an undisclosed location and asking to be released.\nQatar, which helped mediate a week-long truce and hostage-prisoner exchange last month, has said there are \"ongoing diplomatic efforts to renew the humanitarian pause\".\nUS news platform Axios on Monday reported that Mossad chief David Barnea, CIA director Bill Burns and Qatari Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani met in Warsaw.\nAs the war rages on, special concern has focused on hospitals, most of which no longer function, and several of which have been the scenes of major fighting.\nThe UN humanitarian agency OCHA said in a statement: \"As hostilities continue and health needs increase, it is critical that... hospitals across the Gaza Strip are urgently restored.\"\nWorld Health Organization chief Tedros Adhanom Ghebreyesus said the UN agency was \"appalled by the effective destruction\" of northern Gaza's Kamal Adwan hospital.\nOutside the hospital, the muddy ground scarred by tank and bulldozer tracks, Abu Mohammed stood crying as he searched for his son.\n\"I don't know how I will find him,\" he said, pointing to the debris.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "US Affirms Support For Israel As Calls Mount For Gaza Ceasefire", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/us-affirms-support-israel-calls-mount-gaza-ceasefire-1722256"}