{"authors": ["Emma Graham-Harrison", "Julian Borger"], "date_download": "2024-02-05 15:24:48", "date_modify": "None", "date_publish": "2023-12-19 18:17:46", "description": "UK and Germany demand ‘sustainable ceasefire’ as Israel’s military campaign enters 11th week", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F19%2Fpalestinian-casualties-in-gaza-near-20000-with-nearly-2m-people-displaced.json", "image_url": "https://i.guim.co.uk/img/media/3acf542f9494cee304b1ded98cd07b994a404aae/0_0_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dbb91f8014534e374652f25a932af504", "language": "en", "localpath": null, "maintext": "Israeli forces killed 25 people in bombings in southern Gaza, hit a refugee camp in the north and raided one of the area’s last operating hospitals, as the number of Palestinians killed in the territory climbed towards 20,000.\nThe death toll from airstrikes and grim conditions for nearly 2 million people displaced from their homes with little access to food, clean water or sanitation is fuelling growing international anger, even among Israel’s close allies.\nIn Rafah in southern Gaza, a series of Israeli airstrikes hit three adjacent homes killing 25 people, according to Palestinian media reports, and a further 10 were killed in a strike on the Jabalia refugee camp in the north.\nRecent attacks inside a church compound and a school in Gaza, and a raid that shut down one of the last operating hospitals in Gaza City, have also heightened concerns about protection of civilians as a report of prisoner deaths in Israeli custody in the Israeli newspaper Haaretz has raised fresh questions about how Israel is prosecuting its war.\nThe US appears increasingly isolated in its steadfast support for a military campaign now entering its 11th week as the UN security council was weighing up a new resolution calling for the suspension of hostilities to allow for greater flows of humanitarian aid under UN monitoring.\nThe 14 other council members were locked in negotiation with the US on wording that would avoid a repeat US veto and the vote was postponed until Wednesday amid disagreements between US diplomats and the White House, which was insisting on a text that put less pressure on Israel and gave it a more explicit role in deciding what goods could enter Gaza, according to sources at the UN.\nThe UK and Germany – staunch allies of Israel – have added their voices to demands for a reduction in violence by calling at the weekend for a “sustainable ceasefire” and the UK foreign secretary, David Cameron, on Tuesday urged Israel to take a “much more surgical, clinical and targeted approach” in dealing with Hamas.\nIsraeli President Isaac Herzog said that Israel is ready for another humanitarian pause in order to enable the release of hostages, but he added: “We don’t intend to stop our attack on Hamas in order to undermine their military capabilities or their ability to rule Gaza.”\nIn addition to longstanding concerns about the humanitarian catastrophe inside Gaza, there has been a growing focus on Israel’s rules of engagement after the military said three Israeli hostages killed by its troops in the territory were bare-chested and carrying a white flag when they were shot.\nThose calling for Israel to moderate its assault say the shooting of the three unarmed men seeking to surrender – in circumstances only made public when they were later identified as hostages – highlighted a disregard for the lives of non-combatants as Israel’s military pursues Hamas through Gaza.\nThe UK Foreign Office minister Andrew Mitchell told parliament on Tuesday he was “particularly disturbed” by reports from the Holy Family parish in Gaza City, where relatives of the Liberal Democrat MP Layla Moran have sought refuge.\nThe Latin Patriarchate of Jerusalem, which oversees the church, said over the weekend that Israeli snipers killed two women “in cold blood” as they tried to cross a courtyard to use a toilet at the church compound where they were sheltering.\nA shell fired from a tank destroyed the compound’s generator, which powered respirators used by disabled people sheltering there, the statement added.\nRefugees sheltering at a school a couple of miles away were also killed by Israeli troops in early December, a survivor told Reuters.\nYousef Khalil, a grandfather, described witnessing the attack at a school in Jabalia refugee camp, saying Israeli soldiers entered in the night when he was sleeping by his family and fired indiscriminately, killing nine people, including children.\nFootage taken by Reuters reporters in mid-December shows bloodstained bedding and at least two bodies in the school, with bullet holes and bloodstains low to the ground. Israel’s military said it was looking into the Reuters report.\nUN officials on Tuesday expressed anger about the collapse of healthcare in Gaza, where hospitals lack basic supplies and Israeli attacks have killed patients injured by previous airstrikes.\n“I’m furious that children who are recovering from amputations in hospitals are then killed in those hospitals,” said James Elder, a spokesperson for Unicef.\nThose who are injured in north Gaza have little hope of medical treatment, with most hospitals closed after intense fighting in the area. Israeli forces on Monday raided one of the last functioning healthcare facilities, al-Ahli hospital, detaining most of its staff and in effect shutting it down, according to St George’s Cathedral in Jerusalem, which runs the complex.\n“It has been a great mercy for the many wounded in Gaza City that we were able to keep our Ahli Anglican hospital open for so long,” priest Don Binder wrote in a Facebook post late on Monday. “That ended today.”\nAfter the raid, two doctors, four nurses and two janitors were left to care for more than 100 seriously wounded patients, with no running water or electricity, the priest said. An Israeli tank was parked on the rubble at the hospital’s entrance, blocking anyone from entering or leaving.\nThe health ministry in Gaza said on Tuesday that 19,667 people had been killed by Israeli strikes since 7 October, and more than 52,000 had been injured. Thousands more victims are buried under the rubble of collapsed buildings.\nMost of the dead are women and children, though the total also includes fighters. The UN says casualty figures provided by the Hamas-run health ministry have proved reliable during previous conflicts with Israel.\nThe UN estimates 1.9 million of Gaza’s 2.4 million residents are displaced.\nIsrael’s military says Hamas is responsible for all civilian casualties, arguing that the militant organisation uses Palestinians as human shields. It claims that the group places military facilities and fighters in buildings that include schools and hospitals. Hamas denies those claims.\nSpeaking alongside the US defence secretary, Lloyd Austin, on Monday, the Israeli defence minister, Yoav Gallant, said Israeli forces operated legally and “to minimise the harm to the civilian population”.\nIsrael’s military has said its troops found explosives planted in a medical clinic in a Gaza City suburb, destroyed Hamas tunnels and killed Hamas operatives during recent operations. It says 132 troops have been killed in Gaza since its ground invasion began in late October.\nIsrael launched the attacks on Gaza after Hamas fighters broke through the border fence and entered Israel on 7 October, where they killed about 1,200 people – mostly civilians – and took more than 200 people hostage.\nBenjamin Netanyahu, the Israeli prime minister, has sworn to “destroy” Hamas, and described the war as an existential struggle for survival, vowing to continue fighting despite mounting international censure.\nHaaretz has reported that hundreds of Palestinians arrested in Gaza on suspicion of involvement in terrorism have been held for weeks at an Israeli detention centre, where several have died in unclear circumstances.\nThe detainees are reportedly blindfolded and handcuffed for most of the day, and the lights are left on at the facility throughout the night. The handcuffs permit limited movement but allow the detainees to eat, Haaretz reported.\nThe Israel Defense Forces said that the prisoners who died were terrorists and that the circumstances of their deaths at the Sde Teiman base were being examined.\nThe Associated Press and Reuters contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "Palestinian death toll in Gaza nears 20,000 with nearly 2 million people displaced", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/19/palestinian-casualties-in-gaza-near-20000-with-nearly-2m-people-displaced"}