{"authors": [], "date_download": "2024-02-05 15:24:49", "date_modify": "None", "date_publish": "2023-12-19 10:00:46", "description": "Israel has struck southern Gaza, killing at least 28 people, and raided one of the last functioning hospitals in the north", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fgaza-ap-hamas-israel-palestinians-b2466421.html.json", "image_url": "https://static.independent.co.uk/2023/12/19/08/Israel_Palestinians_58524.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsraeli strikes killed at least 28 Palestinians in southern Gaza and troops raided one of the last functioning hospitals in the north as the country pressed ahead with its offensive against Hamas on Tuesday with renewed backing from the United States, despite rising international alarm.\nThe offensive, launched in response to Hamas' Oct. 7 attack into Israel, has killed nearly 20,000 Palestinians, displaced some 1.9 million, demolished much of northern Gaza and sparked attacks on U.S. and Israeli targets across the region.\nAttacks on ships in the Red Sea by Yemen's Iran-backed Houthi rebels have led major shipping companies — as well as the oil and gas giant BP — to suspend trade through the vital waterway, prompting the U.S. and its allies to launch a new mission to counter the threat.\nBut after meeting with Israeli officials Monday, Defense Secretary Lloyd Austin said he was “not here to dictate timelines or terms.\"\nHis remarks signaled that the U.S. would continue shielding Israel from growing international calls for a cease-fire as the United Nations Security Council was set to hold another vote Tuesday, and that Washington would keep providing vital military aid for one of the 21st century's deadliest air and ground wars.\nA strike on a home in Rafah where displaced people were sheltering killed at least 25 people, including women and children, and another killed at least three people, according to Associated Press journalists who saw the bodies arrive at two local hospitals early Tuesday.\nRafah, which is in the southern part of Gaza where Israel has told Palestinians to seek shelter, has been repeatedly bombarded in recent days, as Israel has struck what it says are militant targets across the territory, often killing large numbers of civilians.\nFierce battles raged in northern Gaza, where Hamas continues to put up still resistance across what is now a battered wasteland seven weeks after Israeli tanks and troops stormed in.\nHOSPITAL RAID\nIsraeli forces raided the Al-Ahli Hospital in Gaza City overnight and into Tuesday, according to the church that operates it, destroying a wall at its front entrance and detaining most of its staff.\nAlso known as the Baptist Hospital, it was the scene of an explosion early in the war that killed dozens of Palestinians, and which an Associated Press investigation later determined was likely caused by a misfired Palestinian rocket.\nDon Binder, a pastor at St. George’s Anglican Cathedral in Jerusalem, which runs the hospital, said the raid left just two doctors, four nurses and two janitors to tend to over 100 seriously wounded patients, with no running water or electricity.\n“It has been a great mercy for the many wounded in Gaza City that we were able to keep our Ahli Anglican Hospital open for so long,” Binder wrote in a Facebook post late Monday. “That ended today.”\nHe said an Israeli tank was parked on the rubble at the hospital's entrance, blocking anyone from entering or leaving.\nThere was no immediate comment from the Israeli military. Forces have raided other hospitals across Gaza, accusing Hamas of using them for military purposes. Hospital staff have denied the allegations and accused Israel of endangering critically ill and wounded civilians.\nIn November, after raiding and largely emptying Shifa Hospital — Gaza's largest — the military revealed what it said was a militant hideout beneath the facility and other evidence that Hamas fighters had been inside the compound. It has yet to substantiate its allegations that Shifa was a major Hamas command center, which would weigh on the question of whether it was protected under international law.\nShifa is once again treating hundreds of wounded patients and sheltering tens of thousands of displaced people under harsh conditions, according to the World Health Organization, which described its emergency room as a “bloodbath.” Witnesses said an Israeli strike hit the medical compound Monday, killing and wounding several people.\nINTERNATIONAL CONCERNS\nThe U.N. Security Council delayed to Tuesday a vote on an Arab-sponsored resolution calling for a halt to hostilities to allow unhindered access to humanitarian aid. Diplomats said negotiations were taking place to get the U.S. to abstain or vote “yes” on the resolution after it vetoed an earlier call for a cease-fire.\nFrance, the United Kingdom and Germany — some of Israel’s closest allies — joined global calls for a cease-fire over the weekend. In Israel, protesters have called for negotiations with Hamas to facilitate the release of scores of hostages still held by the group.\nPrime Minister Benjamin Netanyahu has insisted that Israel will keep fighting until it ends Hamas rule in Gaza, crushes its military capabilities and frees all the hostages taken during the Oct. 7 attack. For now, at least, he seems to have full U.S. support for a campaign that could last months or years.\nSpeaking alongside Austin, Israeli Defense Minister Yoav Gallant said only that “the war will take time.”\nMilitants killed some 1,200 people, mostly civilians, on Oct. 7 and abducted 240 others. Nearly half were released in November during a weeklong cease-fire, in exchange for Israel releasing 240 Palestinian prisoners. Those released on both sides were mainly women and children.\nHOSTAGE TALKS\nCIA Director William Burns met in Warsaw with the head of Israel’s Mossad intelligence agency and the prime minister of Qatar on Monday, the first known meeting of the three since the cease-fire, which they had played a key role in brokering. But U.S. National Security Council spokesperson John Kirby said the talks were not “at a point where another deal is imminent.”\nAiming to increase public pressure on the Israeli government, Hamas released a video late Monday showing three older Israeli hostages pleading for Israel to bring them home.\nThe comments were likely made under duress, but the video signaled Hamas wants to move on to discussions of releasing sick and old men. Israel has said it wants around 19 women and two children freed first. Hamas says the women include soldiers, for whom it is expected to make greater demands.\nHamas and other militants are still holding an estimated 129 captives.\nMore than 19,400 Palestinians have been killed since the start of the war, according to the Health Ministry in Hamas-run Gaza, which has said that most are women and minors and that thousands more are buried under rubble. The ministry does not differentiate between civilian and combatant deaths.\nIsrael’s military says 131 of its soldiers have been killed in the Gaza ground offensive. It says it has killed thousands of militants, without providing evidence. Israel blames civilian deaths on Hamas, saying it uses them as human shields, but the military rarely comments on individual strikes.\n___\nMagdy reported from Cairo.\n___\nFind more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel strikes south Gaza and raids a hospital in the north as war grinds on with renewed US support", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/gaza-ap-hamas-israel-palestinians-b2466421.html"}