{"authors": ["Morgan Phillips", "U.S. Political Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:24:58", "date_modify": "None", "date_publish": "2023-12-19 21:34:05", "description": "President Joe Biden is in hot water with young voters as he sheds approval on both sides over his handling of the war in Gaza, according to a new poll.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12881565%2FYoung-voters-flip-TRUMP-desert-Biden-New-dire-poll-Joe-shows-75-voters-29-disapproving-handling-Gaza-saying-Donald-general-election.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/19/23/79134669-0-image-a-6_1703028124503.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden is in hot water with young voters as he sheds approval on both sides over his handling of the war in Gaza, according to a new poll.\nThirty-three percent of respondents to a New York Times/Sienna College poll said they approved of Biden's handling of the Israeli-Palestinian conflict while 57 percent said they disapprove.\nAt the same time more respondents thought Trump would do a better job at handling the conflict than Biden - 46 percent to 38 percent.\nThe president is in particular trouble with young voters, usually a reliable Democratic base. Three-quarters of voters between 18 and 29 do not approve of Biden's handling of the conflict in Gaza.\nPresident Joe Biden is in hot water with young voters as he sheds approval on both sides over his handling of the war in Gaza , according to a new poll\nIn another shock finding, young voters are now breaking for Trump: 49 percent said they would back the former president over the current one in the next election, versus 43 percent who said they would back Biden.\nMonths ago in July, young voters backed Biden over Trump by 10 points.\nOverall voters back Trump over Biden 46 to 44 percent, according to the poll.\nEconomic concerns remain top of mind, but are less prominent than they were some months ago. Thirty-four percent of registered voters list economic or inflation-related concerns as their top issue, down from 45 percent in October 2022.\nAsked what they think Israel's course of action should be - ceasing its bombing campaign or continuing, a narrow plurality, 44 percent, think Israel should stop its military campaign to protect civilian casualties.\nSome 20,000 Palestinians have been killed since the October 7 attack, according to the Hamas-linked Gaza Health Ministry.\nSlightly fewer, 39 percent, think Israel should continue its offensive, even if it means more civilian casualties.\nNearly half of young people believe Israel is intentionally killing civilians. Three-quarters say Israel is not taking enough precautions to avoid civilian casualties.\nThe broader electorate of all ages is more pro-Israel. But still, some 48 percent said they believe Israel is not being careful enough to avoid civilian casualties.\nThe conflict is unveiling deep partisan divides.\nSeventy-six percent of Republicans said they sympathized with Israel over the Palestinians, while only 31 percent of Democrats said the same. Another 34 percent said they sympathized more with Palestinians and 16 percent said they sympathized with both sides.\nNearly three-quarters of Jewish Americans identify as Democrats but Republicans for years have implored them to flee the party which they accuse of undermining Israel's government.\nAfter stalwart support of Israel's offensive for many weeks, the White House has only recently begun to show daylight between itself and the military campaign.\nThe White House on Monday said it had spoken to the Israeli government about the killing of two women sheltering at a Catholic church in the Gaza strip, saying there needs to be better deconfliction to protect civilians and humanitarian workers.\n'We have raised our concerns about this particular incident with the with the Israeli government - about the need for those who have injuries or who have been wounded, to be able to be safely evacuated so they can receive appropriate medical treatment,' White House spokesman John Kirby told reporters.\nNahida Khalil Anton and her daughter Samar Kamal Anton were sheltering at Holy Family, the only Catholic Church in the Gaza Strip when they were killed by a sniper.\nKirby said President Joe Biden, National Security Adviser Jake Sullivan and Defense Secretary Llyod Austin all raised concerns to Israel about taking care to ensure civilians and humanitarian workers are not at risk.\nSeven more people were shot and wounded by Israeli forces as they tried to protect others inside the compound from the deadly assault.\nThe Israeli Defense Force said the incident is still under review while insisting it 'does not target civilians, no matter their religion.'\nBut the some 300 people still trapped in the church have described how Israeli tanks and snipers have surrounded the walled compound and were shooting at anyone emerging from the buildings there.\nThey say Israeli tanks have shot towards the church, missing it by mere inches and instead knocking out the building's generator and fuel supplies - rendering it uninhabitable for the women, children and disabled people who fled there.\nThe Holy Family church has been a refuge for hundreds of Christians since the war broke out following Hamas's deadly attack on Israelis. There are also 54 disabled people seeking shelter there.\nMore respondents thought Trump would do a better job at handling the conflict than Biden - 46 percent to 38 percent\nNearly three-quarters of Jewish Americans identify as Democrats but Republicans for years have implored them to flee the party which they accuse of undermining Israel's government\nCivil defense teams and Palestinians conduct search and rescue operations for the people in a building\nThe IDF separately acknowledged the deaths of three Israeli hostages in Gaza on Friday, expressing its 'deep remorse over the tragic incident' in a statement and saying it had launched an immediate investigation.\nLast week during a campaign reception Biden said Israel is losing support due to its 'indiscriminate bombing campaign' and claimed its current government does not want a two-state solution.\nBiden speculated that Israel must 'strengthen and change' its government in order to maintain backing across the world.\nA senior U.S. official said National Security Adviser Jake Sullivan made clear in Israel this week that Netanyahu needs to wrap up his nation's bombing campaign on Gaza in 'weeks not months.'\nIsrael lost some 1,200 when Hamas launched an attack on October 7.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Young voters flip to TRUMP and desert Biden: New dire poll for Joe shows 75% of voters under 29 disapproving of his handling of Gaza and more saying they would back the Donald in a general election", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12881565/Young-voters-flip-TRUMP-desert-Biden-New-dire-poll-Joe-shows-75-voters-29-disapproving-handling-Gaza-saying-Donald-general-election.html?ns_mchannel=rssns_campaign=1490ito=1490"}