{
    "authors": [],
    "date_download": "2024-02-05 15:14:32",
    "date_modify": "None",
    "date_publish": "2024-01-30 10:07:25",
    "description": "Biden says strike on Tower 22 carried out by Iranian-backed militia and marks significant escalation in growing conflict in middle east",
    "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fus-name-soldiers-jordan-drone-attack-joe-biden-b2487104.html.json",
    "image_url": "https://static.independent.co.uk/2024/01/30/07/1963642866.jpg?quality=75&width=1200&auto=webp",
    "language": "en",
    "localpath": null,
    "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe US government has released the names of three soldiers killed in a drone attack by Iranian-backed militia in Jordan – the first deadly strike on American personnel sinze the start of the war in Gaza that sent regional tensions soaring.\nThe US Department of Defence said the three service members killed on Monday were all part of the Army Reserve, naming them as: Sgt William Jerome Rivers, 46 of Carrollton, Georgia; Specialist Kennedy Ladon Sanders, 24 of Waycross, Georgia; and Specialist Breonna Alexsondria Moffett, 23, of Savannah, Georgia.\nAll three were assigned to the 718th Engineer Company, 926th Engineer Battalion, 926th Engineer Brigade, Fort Moore, Georgia.\nAs the Biden administration scrambled to find what went wrong, officials suggested human error could have been behind an enemy drone striking the Tower 22 desert base unchallenged.\nAmerican military personnel might have misidentified an adversary’s drone as one of their own, allowing it to proceed to the base, a possible oversight that resulted in the deaths, according to a preliminary report.\nPresident Joe Biden said the strike on Tower 22 near the Syrian border had been carried out by an Iranian-backed militia, and marked a significant escalation in the growing conflict in the Middle East.\nMr Biden vowed to strike back and \"hold all those responsible to account at a time and in a manner (of) our choosing\".\nThe deadly drone strike occurred late on Sunday at the logistics support base located at Tower 22 of the Jordanian Defense Network where around 350 American soldiers are deployed.\nThe Pentagon said that more than 40 troops were wounded in the attack with most suffering cuts, bruises, and brain injuries. Eight had to be medically evacuated to the Baghdad Diplomatic Support Center.\n\"I am outraged and deeply saddened by the deaths of three of our US service members and the wounding of other American troops in an attack last night against US and coalition forces, who were deployed to a site in northeastern Jordan near the Syrian border to work for the lasting defeat of ISIS,\" secretary of defense Lloyd J Austin III said in a statement.\nSatellite image shows a view of the base, known as Tower 22, which is operated by US troops as part of an international coalition against the Islamic State (IS) jihadist group, near Jordan's border with Iraq and Syria in the northeastern Rwaished District (Planet Labs/AFP via Getty Images)\nAccording to two undisclosed officials cited in the AP report, an enemy drone approached the Tower 22 base in Jordan while a US drone was returning at a low altitude. As a result, it could be possible that no effort was made to thwart the enemy drone, which struck the outpost, they said.\nAsked if the failure to shoot down the enemy drone was “human error,” Ms Singh responded that the US Central Command was still assessing the matter.\nThe strike primarily affected a sleeping trailer, with minimal damage to surrounding trailers from the explosion and debris. Although Tower 22 lacks significant air defense systems, it does have counter-drone measures like Coyote drone interceptors.\nDeputy Pentagon press secretary Sabrina Singh doubled down on the US government’s assertion that Iranian proxies were behind the attack.\n\"In terms of attribution for the attack, we know this is an [Islamic Revolutionary Guard Corps ]-backed militia,\" she said.\n\"It has the footprints of Kataib Hezbollah. But not making a final assessment on that, our teams here are continuing to do the analysis. We know that Iran is behind it. And certainly as we’ve said before ... Iran continues to arm and equip these groups to launch these attacks, and we will certainly hold them responsible.\"\nIran on Monday denied it was behind the Jordan strike.\n\"These claims are made with specific political goals to reverse the realities of the region,\" Iran’s state-run IRNA news agency quoted foreign ministry spokesman Nasser Kanaani as saying. Iran regularly denies involvement in attacks linked back to it through the militias it arms across the wider Mideast.\nIt was the first time that US personnel were directly hit since Israel’s war on Hamas and the subsequent bombing of Gaza since 7 October has spread to a wider region of the Middle East with Iran-backed Houthi rebels attacking commercial vessels in the Red Sea.\nThe US has, however, maintained a difficult balancing act of defending its national security and its forces while remaining cautious of not escalating it further.\nThe Biden administration has said they are “not looking for a war with Iran” but said their patience has worn thin after more than two months of attacks by Iranian proxies on US troops in Iraq, Syria and Jordan and on US Navy and commercial vessels in the Red Sea.\nThe proxy groups, including Yemen’s Houthi rebels and Iraq-based Kataeb Hezbollah, say the attacks are in response to Israel’s ongoing military operations in Gaza.\nMr Austin who met Nato secretary general Jens Stoltenberg said: “The president and I will not tolerate attacks on US forces, and we will take all necessary actions to defend the US and our troops.”",
    "source_domain": "www.independent.co.uk",
    "text": null,
    "title": "US names three soldiers killed by Jordan drone ‘mistaken for American aircraft’",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/us-name-soldiers-jordan-drone-attack-joe-biden-b2487104.html"
}