{"authors": ["Rachel Bowman", "Rachel Bowman For Dailymail.Com"], "date_download": "2024-02-05 15:15:18", "date_modify": "None", "date_publish": "2024-01-28 17:27:35", "description": "The Biden administration is considering withholding or delaying offensive military equipment from Israel to use as leverage to scale down their military attack on Gaza.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13016121%2FBiden-weapon-sales-leverage-Israel-Gaza-attack.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/28/16/80560115-0-image-a-35_1706459112448.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden is reportedly considering using weapons sales as a means to convince Israel's Prime Minister Benjamin Netanyahu to scale back their attack on the Gaza Strip.\nSources told NBC News that the Pentagon has been directed by the Biden administration to review what weaponry Israel has requested that could be used as leverage to scale down their military attack on Gaza.\nAt least 26,422 Palestinians have been killed and 65,087 injured by Israeli counterstrikes since October 7, the Hamas-run Gaza health ministry said Sunday.\nBiden has been facing mounting pressure to call for a ceasefire in the Israel-Hamas war that started on October 7 when Hamas launched a terror attack that killed some 1,200 people and took 253 hostages.\nSeveral of the president's speeches have been interrupted by protestors demanding a ceasefire.\nThe Biden administration is reportedly considering using weapons sales as a means to convince Israel 's Prime Minister Benjamin Netanyahu to scale back their attack in Gaza\nPresident Joe Biden has been facing mounting pressure to call for a ceasefire in the Israel-Hamas and several of his recent speeches have been interrupted by protestors\nIsrael Prime Minister Benjamin Netanyahu has vowed to 'continue to do what is necessary' in Gaza after the UN's top court told Israel to prevent genocide\nSources said Israel is asking the United States for more weapons including large aerial bombs, ammunition and air defenses.\nThe weaponry has reportedly been discussed using as leverage are 155 mm artillery rounds and joint direct attack munitions, which are guidance kits that convert dumb bombs into precision-guided munitions.\nThe administration is focusing on withholding or delaying offensive military equipment and is likely to continue to send defense systems, sources said.\nBiden has privately told Netanyahu that he won't support Israel's war in Gaza lasting a year and is concerned both about the growing death toll in Gaza and about the impact the war is having on younger U.S. voters in the run-up to the 2024 elections.\nA senior administration official anonymously told NBC News, 'There’s a lot more that needs to be done and they need to be more careful about.'\nA spokesperson for the White House National Security Council told Reuters, 'There has not been a change in our policy.'\n'Israel has a right and obligation to defend themselves against the threat of Hamas, while abiding by international humanitarian law and protecting civilian lives, and we remain committed to support Israel in its fight against Hamas. We have done so since Oct. 7, and will continue to.'\nThe U.S. took the rare step Thursday of condemning at attack on a UN facility in Khan Younis that was housing an estimated 30,000 refugees.\nState Department spokesman Vedant Patel in a statement that 'We deplore today's attack on the UN's Khan Younis training center.'\n'Civilians must be protected, and the protected nature of UN facilities must be respected, and humanitarian workers must be protected so that they can continue providing civilians with the life-saving humanitarian assistance that they need,' he added. Israel denied that its forces struck the center.\nBiden embraced Netanyahu after October 7 and has kept up the flow of U.S. military assistance while the White House has backed Israel's right to defend itself even amid calls for a ceasefire.\nSources said Israel is asking the United States for more weapons including large aerial bombs, ammunition and air defenses\nThe administration is focusing on withholding or delaying offensive military equipment and is likely to continue to send defense systems. Israeli soldiers pictured on top their tanks returning from a mission\nAt least 26,422 Palestinians have been killed and 65,087 injured by Israeli counterstrikes since October 7, the Hamas-run Gaza healthy ministry said on Sunday. A Palestinian child pictured walking amidst rubble in Rafah on Sunday\nMakeshift tents for Palestinian refugees in Rafah is pictured. On Thursday, the U.S. took the rare step of condemning an attack on a UN facility in Khan Younis that was housing an estimated 30,000 refugees\nNetanyahu has vowed to 'continue to do what is necessary' in Gaza after the UN's top court told Israel to prevent genocide, but stopped short of calling for a ceasefire as it ruled on a case brought by South Africa at The Hague on Friday.\nHe said: 'Like every country, Israel has the basic right to defend itself. The court in the Hague rightfully rejected the outrageous request to take that away from us.'\n'We will continue to do what is necessary to defend our country and defend our people.'\nThe International Court of Justice demanded that Israel try to contain death and damage in its military offensive, ruling that Israel must do all it can to prevent genocide, including refraining from killing Palestinians or causing harm to them.\nBut the court stopped short of ordering a ceasefire in Gaza in a genocide case filed by South Africa.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden is planning to throttle Israel's arms supply as fury grows against Netanyahu's bombing campaign in Gaza", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13016121/Biden-weapon-sales-leverage-Israel-Gaza-attack.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}