{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:25:00", "date_modify": "None", "date_publish": "2023-12-19 18:46:13", "description": "Demonstrations demanding safe return of hostages, and accidental deaths of three Israeli hostages, have not dampened mood for continued ground assault in Gaza", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F19%2Fevery-minute-is-critical-support-for-war-in-israel-still-high-despite-protests.json", "image_url": "https://i.guim.co.uk/img/media/f283929d1ab5a67577882e97dce6fe76358890fb/0_134_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=18e8fd2575df326ffdef5877f8677ec7", "language": "en", "localpath": null, "maintext": "Friday nights in many parts of Israel are quiet; during Shabbat, there is no public transport, and more observant Jewish believers refrain from using electricity or doing anything that could resemble work.\nThe 24 hours of rest is often spent at home with family. Last Friday, however, about 1,000 people took the rare step of protesting on the streets of Tel Aviv after nightfall, after the news that three Israeli hostages held in the Gaza Strip had been shot dead by the Israel Defense Forces (IDF).\nYotam Haim, Alon Shamriz and Samer Talalqa were killed on Friday morning, after apparently managing to escape their Hamas captors in Gaza City. The three men, all in their 20s, approached an Israeli army unit shirtless and with their hands up to show they were not carrying weapons or explosives. One of the three was waving a makeshift white flag.\nAccording to the IDF’s preliminary inquiry, released on Friday evening, a sniper nevertheless shot two of the men, and the third, who ran into a building while shouting “Help” in Hebrew, was also shot.\nThe army said the killings went against the IDF’s rules of engagement, and were being investigated at the highest level. But the immediate public reaction has been shock, rather than anger, as Israelis grapple with the senseless and avoidable loss of the three hostages’ lives, and at the same time, continue to give full-fledged support for the war effort in Gaza.\nFriday night’s spontaneous demonstration outside the IDF’s headquarters was followed by a weekly Saturday night protest, led by the hostage families, pressing for their loved ones’ safe return.\n“We all warned that combat might lead to the hostages being hurt. Regrettably, I was right … The hostages are experiencing hell and are in real mortal danger. Every day, every hour, every minute is critical,” Raz Ben Ami said in a speech. The 57-year-old was released from Gaza in the November ceasefire, but her husband Ohad, also 57, is still there.\n“A military operation alone won’t save the hostages’ lives. Freeing the hostages in exchange for prisoners is urgent and critical … I’m begging you,” she said, addressing Israel’s war cabinet. “You promised you would get the hostages back alive. What are you waiting for?”\nThe new conflict in the besieged Gaza Strip that has killed nearly 20,000 people was triggered by an unprecedented attack on Israel by Hamas on 7 October, killing 1,140 people. The Palestinian militant group also seized 250 hostages, taking children and elderly people back to the Palestinian territory as bargaining chips – as well as soldiers abducted from military bases.\nEighty Israelis and 20 captives of other nationalities were released in exchange for 240 Palestinian women and children held in Israeli prisons at the end of November before the war resumed at an even fiercer tempo. About 128 hostages remain in Gaza, almost all of them adult men, although Israeli officials believe that several of that number have died.\nDespite last week’s events, public opinion in Israel is still very much in favour of the war. Almost all of the country’s Jewish population does military service, and some 360,000 reservists have been mobilised – more than in any other conflict.\n“In Israel, the people are the army and the army is the people. It’s impossible to direct criticism directly at the army because their children, husbands and brothers are still busy serving right now,” said Dahlia Scheindlin, a political analyst and author of The Crooked Timber of Democracy in Israel.\n“I don’t see [the hostage shootings] have changed support for the war. It’s hard to feel there’s a sea change … There’s certainly support for another hostage deal. But there’s a disconnect between intense grief and anguish, anger at the government, and the enduring sense among the Israeli public that the war is absolutely necessary.”\nNonetheless, several family members of the hostages have publicly expressed worry that their loved ones’ plight is slipping down the Israeli government’s agenda: the release of most of the women and children in captivity has diminished the public pressure to secure the remaining hostages’ freedom, the Israeli daily Haaretz said last week.\nThe paper also noted that the families have identified what they say is an online campaign against them: “Hundreds of comments and posts on social media have in recent days called to stop the pressure on the government – and have even blamed the families for supposedly weakening the government’s position and putting soldiers’ lives at risk,” it reported.\nThose worries were further inflamed by a story in the Israeli media last week that the prime minister, Benjamin Netanyahu, had blocked David Barnea, the head of the Mossad, from travelling to Qatar to resume hostage talks.\nThat decision appears to have been reversed, however, after the IDF shootings of the hostages. Over the weekend Barnea visited Doha, an important mediator with Hamas, and reportedly met Qatar’s prime minister, Sheikh Mohammed bin Abdulrahman Al Thani, and the CIA director, William Burns, in Warsaw on Monday.\nDoha said there were “ongoing diplomatic efforts to renew the humanitarian pause”. Those comments were supported on Tuesday by Israel’s president, Isaac Herzog, who told heads of foreign diplomatic missions at a briefing that Israel was “prepared to hold another humanitarian pause in Gaza to advance the release of more Gaza hostages”.\nProgress on a second deal can’t come quickly enough for those families in Israel still waiting for news of their relatives in Gaza, 10 weeks after they were captured.\n“We keep getting coffin after coffin, body after body. The soldiers are being put in insane situations,” Danny Elgarat, whose brother, Itzik, was kidnapped from the Nir Oz kibbutz, told the crowd on Saturday. “I can’t understand what they’re waiting for.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘They are experiencing hell’: have the deaths of hostages impacted Israelis’ support for the war?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/19/every-minute-is-critical-support-for-war-in-israel-still-high-despite-protests"}