{"authors": [], "date_download": "2024-02-05 15:25:00", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukraine will be strengthening its air defense, Ukrainian President Volodymyr Zelenskyy said in his nightly video address Saturday. \"We have already", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274067520%2Fukraine-to-strengthen-air-defense-protect-skies-from-drones.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702793212.jpg", "language": "en", "localpath": null, "maintext": "Ukraine will be strengthening its air defense, Ukrainian President Volodymyr Zelenskyy said in his nightly video address Saturday.\n'We have already reached agreements on this,' he said. 'The theme of air defense arises in almost every meeting and talk with world leaders. There will be more systems, more protection for the sky.'\nZelenskyy said that this past week, Ukraine shot down 104 Shahed drones out of the 112.\n'Each destroyed drone means saved lives and preserved infrastructure,' he said.\nDuring a Russian drone attack across Ukraine Saturday, Ukraine's air force said its forces and mobile groups of drone hunters shot down 30 of the 31 Iranian-made Shahed drones targeting 11 Ukrainian regions.\nThe targeted areas included Kyiv, the capital, and the southern region of Kherson and the western region of Khmelnytskyi.\n'The drones attacked in groups, in waves, and from different directions,' said Serhiy Popko head of Kyiv's military administration.\nUkraine has signed contracts for joint cooperation on technology weapons production with Western partners in its effort to boost its defense industry at home and to reduce dependence on Western military supplies.\n'We have dozens of new contracts between companies on joint production or technology exchange,' Defense Minister Rustem Umerov said in a Facebook post.\nThe drive to increase production at home has become critically important as the future of large-scale military aid from the United States and European Union appears more uncertain and Western stockpiles have become more depleted.\nActivists rally in front of Kyiv City Council, demanding local authorities allocate more funds to the Armed Forces of Ukraine, in Kyiv, Ukraine, Dec. 16, 2023.\nKyiv has hosted a number of conferences with members of the international defense industry. This week it held a conference with the largest British defense manufacturers, while last September it hosted more than 250 Western weapons producers, followed by a joint Ukraine-U.S. defense conference in Washington in December\n'We signed a memorandum with the United States on joint production and technical data sharing,' Umerov said.\nUkraine is also seeking more agreements like its venture with German arms producer Rheinmetall AG to service and repair Western weapons, and an agreement with two U.S. firms to jointly manufacture 155 mm artillery shells.\nDomestic defense output has tripled in 2023, according to the strategic industries ministry, and is expected to increase six times more next year.\nEU sanctions approved\nAustria has approved a 12th package of EU sanctions on Russia after Ukraine removed Raiffeisen Bank International RBIV.VI from a blacklist, according to Ukraine's government website and an EU diplomat, Saturday.\nAustria had been pushing Ukraine to remove the bank from a Ukrainian list dubbed 'international sponsors of war.'\nThe blacklist has no legal standing, but it is symbolically important, reinforcing public pressure on Raiffeisen to quit Russia, something the Austrian bank has said it is willing to do but which has yet to happen.\n'The status is suspended for the period of bilateral consultations involving representatives of the European Commission,' the Ukrainian government website said Saturday on Raiffeisen's status.\nTurkey, Romania and Bulgaria will sign a joint plan to clear mines floating in the Black Sea. Turkish Defense Minister Yasar Guler said Saturday in Ankara.\nGuler said the 'Trilateral Initiative' would only include Turkey, Romania, and Bulgaria for now, and their defense ministers planned to hold a signing ceremony in Istanbul on January 11.\n'Due to the Ukraine-Russia war, there are mines placed in both Ukrainian and Russian ports. These untangle sometimes, and reach our straits due to the current,' Guler told journalists.\nTurkey, which maintains good ties with both Kyiv and Moscow, is also working with the United Nations, Ukraine and Russia to revive the Black Sea grain initiative which Moscow quit earlier this year, though there have been no public signs of progress on those talks.\nTruck driver dies in blockade\nA third Ukrainian truck driver has died in blockades at the Polish border organized by Polish truckers, Ukraine's Suspilne public broadcaster said Saturday.\nAn official from Ukraine's international trucking association, said the driver got sick at the Korczowa-Krakovets crossing - one of four crossing points blocked by the protesters. He died while being taken to a hospital. Two other truckers died last month after getting stuck in the blockades, Suspilne said.\nFILE - Ukrainian truck drivers wait to cross from Poland back into Ukraine in Korczowa, Poland, Dec. 7, 2023. A Ukrainian driver who got sick at the Korczowa-Krakovets crossing - one of four crossing points blocked by protesters- died while being taken to a hospital.\nPolish drivers have been blocking crossings since November 6, demanding that the European Union reinstate a system requiring Ukrainian companies to secure permits to operate in the bloc and the same for European truckers to enter Ukraine.\nThe protesting truckers say Ukrainian products are undercutting prices of local products. Kyiv says the volume of wartime traffic makes a truck permit system impracticable.\nOne of the crossing points, Dorohusk-Yahodyn, was reopened to traffic this week, but could again be closed after a court ruled that a Polish mayor could not ban truckers from holding a protest in his commune.\nSome information came from The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.britainnews.net", "text": null, "title": "Ukraine to Strengthen Air Defense, Protect Skies from Drones", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274067520/ukraine-to-strengthen-air-defense-protect-skies-from-drones"}