{"authors": ["Reged Ahmad", "Léonie Chao-Fong", "Richard Luscombe", "Tom Ambrose", "Rachel Hall", "Adam Fulton"], "date_download": "2024-02-05 15:25:02", "date_modify": "None", "date_publish": "2023-12-19 01:14:56", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F18%2Fisrael-gaza-war-hamas-live-news-updates-idf-attacks-ceasefire-un-vote-palestine.json", "image_url": "https://i.guim.co.uk/img/media/fe9bab1fdd15701cdc27c6906a4fad0c5cf6c943/0_48_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=537650a3c09cb0ee66e1730e021b73ec", "language": "en", "localpath": null, "maintext": "21.17 CET UN security council postpones Gaza vote Patrick Wintour\nThe UN security council has postponed a vote calling for a sustainable cessation of hostilities to give more time to meet US objections to the wording of the draft resolution.\nThe vote was due on Monday mid afternoon in New York but the US said it could not support a reference to a cessation of hostilities, but might accept suspension of hostilities.\nThe Arab countries negotiating the text said they had been encouraged by the US approach which suggested the White House was trying to find some wording that they could support as opposed simply to vetoing resolutions, the position it adopted on a humanitarian pause on 18 October and on an urgent humanitarian ceasefire on 9 December.\nDivisions within the US administration have been growing with some officials saying the US is misunderstanding the scale of disillusionment in the Global South over US perceived hypocrisy in calling out Russian war crimes in Ukraine, but finding a multitude of reasons to justify the large scale killings of Palestinians in Gaza.\nA range of US diplomats have visited Jerusalem to urge the Israeli government to adopt different military tactics, but with only limited success, and a US support for a suspension of hostilities at the UN, if it happened, would be a signal of US frustration with the Israeli government.\nThe US has also previously rejected cessation of hostilities resolutions at the 15 strong security council due to the absence of clear criticism of Hamas for its killing of more than 1,000 Israelis, including many women and children on 7 October. The latest draft prepared by the United Arab Emirates simply condemns all acts of terrorism, and calls for all hostages to be released unconditionally.\nPressure has been building on the US after the UN general assembly on 12 December voted by 153 to 10 with 23 abstentions to call for an urgent cessation of hostilities. Permanent members of the security council cannot apply their veto on the General Assembly votes as they can on those held at the security council.\nBut general assembly votes are expressions of world opinion and do not have the force of law supposedly attached to security council resolutions. In practice many resolutions are ignored.\nThe sense of US isolation at the General Assembly was a mirror image of the isolation Russia experienced at the Assembly last year over the invasion of Ukraine.\nIn a bid to win over the British foreign secretary, Lord Cameron, the draft resolution as prepared on Monday had called for a sustainable ceasefire, matching the wording he had used in a weekend article jointly penned with his German counterpart. The wording was designed to make it easier for the UK to move from an abstention, the UK position the last time the issue was debated at the Security Council, to a positive vote in favour.\nThe UK has on occasion on Middle East issues voted positively for resolutions initially opposed by the US, notably in January 2009 when Gordon Brown instructed the UK envoy to back a UN ceasefire resolution after 13 days of fighting between Israel and Hamas in Gaza. The UK stance helped force the US move from opposition to abstention.\nA UN call for a suspension of hostilities would in conjunction with other parts of the resolution put pressure on Israel to allow humanitarian aid into Gaza at scale, and by land sea and air. A monitoring process would be established to overcome blockages to aid reaching Gaza.", "source_domain": "www.theguardian.com", "text": null, "title": "US announces creation of multinational operation in Red Sea after attacks from Yemen’s Houthis - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/18/israel-gaza-war-hamas-live-news-updates-idf-attacks-ceasefire-un-vote-palestine"}