{"authors": ["Lucy Thornton", "Susie Beever", "Image", "Ap", "Press Association Images"], "date_download": "2024-02-05 15:25:04", "date_modify": "None", "date_publish": "2023-12-19 07:31:46", "description": "Thousands have been evacuated from Grindavik in Iceland after a volcanic eruption on Monday night following a series of small earthquakes - which has been described as 'close to the worst case imaginable'", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Ficeland-volcano-thousands-forced-flee-31704573.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31704610.ece/ALTERNATES/s1200/1_Volcano-Erupts-Near-Grinkavik.jpg", "language": "en", "localpath": null, "maintext": "Thousands have been evacuated from Grindavik in Iceland after a volcanic eruption on Monday night following a series of small earthquakes - which has been described as 'close to the worst case imaginable'\nSome 4,000 people have fled after a volcano in Iceland erupted overnight following weeks of preparations.\nFiery magma made its way down the side of the volcano after it began erupting shortly after 10pm Icelandic time on Monday night near to the small fishing town of Grindavik. A series of earthquakes were recorded in the evening, before grainy footage captured the flash of an eruption at the Sundhjuka crater at 10.17pm.\nGrindavik was evacuated last month after geologists predicted an imminent eruption due to heightened seismic activity, while a nearby power plant has also since been emptied and a wall built around it. The location of the magma fissure streaming down the volcano's side was not far from the Svartsengi power plant, locals said.\nThe fishing town of around 3,400 people sits on the Reykjanes Peninsula, about 31km south west of capital Reykjavik and near to the Blue Lagoon, one of the country's biggest tourist attractions. The geothermal spa which sees 700,000 visitors a year has also been closed down ahead of Monday night's eruption.\nThe Icelandic Met Office said in their latest update: “A volcanic fissure eruption started yesterday evening at 22:17 (December 18th) on Sundhnúkagígaröðin East of Mt. Sýlingarfell. The event began with a powerful seismic swarm at 9pm yesterday evening resulting in an eruption at 22:17.\n“Large lava fountains were observed in the beginning of the eruption and intense seismicity over the dike. The power of the eruption has decreased with time as well as the seismicity and deformation. The IMO will have a meeting with the Civil Defense 9.30am today.”\nImage: AP) AP)\nLocals claim they saw a 150-metre tall \"volcanic walls of fire\". Arnar Kristinn Stefànsson told The Mirror: “Of all the volcanic eruptions on the peninsula of Reykjanes we can see it clearly from our town Hafnafjörður. I went out to take pictures and the sky is literally red.”\nThe President of Iceland, who declared a State of Emergency, promised the public “we are prepared” and had to “wait to see what the forces of nature have in store.” Despite warnings onlookers caused tailbacks on the highway overlooking the eruption and others ventured even closer.\nAt one point Icelandic Police who pleaded with people to stay away had to close the main road to the airport to discourage rubbernecking. They asked: “An eruption has begun. We ask people not to be in front of the responders and not to go in the direction of the eruption. \"It is important that roads and other things are as accessible as possible.”\nIceland sits atop a mid-Atlantic gap between two tectonic plates, which is why the island sees heightened tectonic activity, volcanic eruptions and geothermal springs. The current eruption, which was confirmed by Iceland's Meteorological Office, is expected to produce mainly magma rather than hot ash.\nImage: Press Association Images) Press Association Images)\nThe last majorly disruptive eruption was in 2010 when Eyjafjallajokull spewed out a huge ash cloud which ground thousands of flights across Europe and the Atlantic to a halt out of fears the cloud could damage aircraft and pose a hazard. Iceland's foreign minister, Bjarne Benediktsson said on X that there were currently \"no disruptions to flights to and from Iceland and international flight corridors remain open\".\nHowever, volcanologist Thorvaldur Thordarson described Monday's eruption as \"close to the worst case imaginable\" given how quickly the lava was flowing. \"This is the worst place, it looks like it,\" he said, adding the eruption had thrown streams of magma as high as 150m into the air.\n\"West of the pasture and up there, and then probably up through the Sundhnúkar crater row, which are just north of it. There are super-high plumes of magma. Now it’s a total guess, but the highest plumes are probably 150 metres. This means that the lava is flowing very quickly from the crater. This may be close to the worst case imaginable. Unfortunately.\"\nThe Government’s Civil Protection department said in a statement: “Iceland is no stranger to volcanic activity and experiences a volcanic event every five years, on average. Three eruptions have occurred on the Reykjanes Peninsula in the last three years, none of which caused harm to people or disrupted air traffic.\n“Icelandic authorities and the public are highly prepared for such events, and Iceland has one of the world’s most effective volcanic preparedness measures. Iceland’s geoscientists possess vast experience in dealing with volcanic activities.”", "source_domain": "www.mirror.co.uk", "text": null, "title": "Iceland volcano: Thousands forced to flee deadly magma as eruption takes place near power plant", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/iceland-volcano-thousands-forced-flee-31704573"}