{"authors": [], "date_download": "2024-02-05 15:25:05", "date_modify": "None", "date_publish": "2023-12-19 13:55:07", "description": "Russian President Vladimir Putin has declared that the military has seized the initiative on the battlefield in Ukraine after repelling Kyiv’s counteroffensive and is well positioned to achieve Moscow’s goals", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fvladimir-putin-ap-ukraine-russia-sergei-shoigu-b2466580.html.json", "image_url": "https://static.independent.co.uk/2023/12/19/14/Russia_Putin_42786.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussian President Vladimir Putin declared Tuesday that the military has seized the initiative on the battlefield in Ukraine after repelling Kyiv's counteroffensive and is well positioned to achieve Moscow's goals.\nPutin's speech at a meeting with top military brass came a day after he presented documents to Russia’s Central Election Commission to seek reelection in the March presidential vote that he's all but certain to win.\n“Our troops are holding the initiative,” he said. “We are effectively doing what we think is needed, doing what we want. Where our commanders consider it necessary to stick to active defenses they are doing so, and we are improving our positions where it's needed.”\nThe Russian leader hailed the troops for repelling Ukrainian attacks during the summer counteroffensive.\n“The enemy has suffered heavy casualties and to a large extent wasted its reserves while trying to show at least some results of its so-called counteroffensive to its masters,” Putin said, adding that ”the myth about invulnerability of Western weapons also has collapsed.\"\n“All attempts by the West to deliver us a military defeat, a strategic defeat, were shattered by the courage and fortitude of our soldiers, the growing might of our armed forces and the potential of our military industries,” Putin said.\nDuring the counteroffensive that began in early June, Ukrainian forces have failed to make any significant gains as they faced multiecheloned Russian defensive lines, including sprawling minefields.\nSpeaking at the same meeting, Russian Defense Minister Sergei Shoigu said that the Russian minefields spread for 7,000 kilometers (more than 4,300 miles).\nShoigu said that 650,000 Russian soldiers have received combat experience in Ukraine, turning the Russian army into “the best prepared and capable army in the world, armed with advanced weapons that have been tested in combat.”\n“Despite the sanctions, we produce more high-tech weapons than NATO countries,” Shoigu said.\nHe declared that the Russian arms industries have increased the output of tanks by 5.6 times, the number of drones built by 16.8 times and bolstered the production of artillery munitions by 17.5 times since the start of what the Kremlin calls “the special military operation” in Ukraine.\nShoigu said the military has received more than 1,500 new and modernized tanks, more than 2,500 armored infantry vehicles and 237 new planes and helicopters.\nWhile hailing the military's performance, Putin noted the need to improve military communications, streamline the use of intelligence and counterartillery means, and increase supplies of precision munitions and drones. He added that Russia also needs to expand the capability of its satellite assets.\nPutin particularly emphasized the importance of bolstering the country's nuclear forces, saying that their role has increased amid “the changing character of military threats and the emergence of new military-political risks.”\nPutin reaffirmed his long-held argument that he sent Russian troops into Ukraine to counter security threats to Russia posed by Western plans to incorporate the country in NATO. Ukraine and its Western allies have denounced the move by Moscow as an unprovoked act of aggression.\nShoigu charged that military personnel from NATO countries operate Ukraine’s air defense systems, multiple rocket launchers and tactical missile systems and also help plan military operations and train troops. He didn't provide specifics to support his claim.\n“The West isn't abandoning its strategy of containment of Russia and its aggressive goals in Ukraine,” Putin said. \"Well, we also aren't going to abandon the goals of the special military operation.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Putin hails Russia's military performance in Ukraine and he vows to achieve Moscow's goals", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/vladimir-putin-ap-ukraine-russia-sergei-shoigu-b2466580.html"}