{"authors": ["James Gordon", "James Gordon For Dailymail.Com"], "date_download": "2024-02-05 15:25:07", "date_modify": "None", "date_publish": "2023-12-18 05:16:18", "description": "North Korea fired an intercontinental ballistic missile into the sea Monday in a resumption of its high-profile weapons testing activities, South Korea said.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12875665%2FNorth-Korea-fires-nuclear-capable-missile-range-target-ENTIRE-United-States-Japan-says.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/18/05/79073045-0-The_Hwasong_18_is_North_Korea_s_first_ICBM_to_use_solid_fuel_whi-a-17_1702876273527.jpg", "language": "en", "localpath": null, "maintext": "North Korea launched another long-range ballistic missile on Monday with the potential capability of striking the United States, Seoul and Tokyo officials said, extending the record-breaking number of weapons tests this year.\nThe firing followed the test of a shorter-range missile on Sunday night, with the back-to-back launches coming immediately in the wake of another bout of fearsome rhetoric between North Korea and the US-South Korean allies.\nJapan's defense ministry said it was an ICBM-class missile with a potential range of more than 9,000 miles that would cover all of the United States.\nJapanese Prime Minister Fumio Kishida described the two launches as a 'threat to peace and stability', while the US State Department also quickly condemned them.\nAfter North Korea test-fired another long-range missile, a woman in Seoul walks past a television screen showing a news broadcast with file footage of a previous missile test\nAn ICBM in a launching drill at the Sunan international airport in Pyongyang, North Korea (file)\n'These launches, like the other ballistic missile launches Pyongyang has conducted this year, are in violation of multiple United Nations Security Council resolutions,' a US State Department said in a statement.\nSouth Korea's military said it had detected the launch of a long-range ballistic missile from the Pyongyang area on Monday morning that flew 620 miles before splashing down in the East Sea, also known as the Sea of Japan.\nThe South reported the missile flew up rather than across, a method Pyongyang has previously said it employs in some weapons tests to avoid flying over neighboring countries.\nThe United Nations Security Council has adopted many resolutions calling on North Korea to halt its nuclear and ballistic missile programs since it first conducted a nuclear test in 2006.\nNorth Korean leader Kim Jong Un has overseen a record-breaking number of weapons tests this year that have been condemned by the West\nNorth Korea fired an intercontinental ballistic missile into the sea Monday in a resumption of its high-profile weapons testing activities, its neighbors said\nNorth Korea previously test-fired four ICBMs this year. It first launched the Hwasong-18- its most advanced and powerful ICBM, in April, then again in July.\nThe Hwasong-18 is North Korea's first ICBM to use solid fuel, which makes it easier to transport and faster to launch than liquid-fueled versions.\nSouth Korea's Joint Chiefs of Staff spokesperson said they were analyzing whether Monday's launch was a solid-fueled ICBM.\nPark Won-gon, a professor of North Korean Studies at Ewha University, said there was a high possibility Pyongyang test-fired a Hwasong-18\n'The Hwasong-18 uses solid fuel, so there will be no preparation time, and it can be fired immediately from a mobile launcher, and it can be seen as a weapon system with a practical ability to strike the US mainland,' Park explained.\nThe Hwasong-18 is North Korea's first ICBM to use solid fuel, which makes it easier to transport and faster to launch than liquid-fueled versions\nNorth Korea last year declared itself an 'irreversible' nuclear power and has repeatedly said it will never give up its nuclear program, which the regime views as essential for its survival.\nThe United States and South Korea on Friday held their second session of the Nuclear Consultative Group in Washington, where they discussed nuclear deterrence in the event of conflict with the North.\nOn Saturday, they warned that any nuclear attack from Pyongyang on the United States and South Korea would result in the end of the North Korean regime.\nA spokesperson for North Korea's defense ministry on Sunday slammed the allies' plans to expand annual joint military exercise next year to include a nuclear operation drill.\n'This is an open declaration on nuclear confrontation to make the use of nuclear weapons against the DPRK a fait accompli,' said a statement carried by the KCNA news agency, using the official acronym for North Korea.\nNorth Korea's missile launch came as the nation marks the anniversary of leader Kim Jong Un's father and predecessor Kim Jong Il\n'Any attempt to use armed forces against the DPRK will face a preemptive and deadly counteraction,' it added.\nThe North's launch of its military spy satellite launch last month further damaged ties.\nThe North portrayed it as a major breakthrough, claiming it was providing images of US and South Korean military sites.\nThat launch fractured a military agreement between the Koreas established to de-escalate tensions on the peninsula.\nFollowing the spy satellite launch, both sides ramped up security along the Demilitarized Zone (DMZ) separating them.\n'If North Korea does something reckless that destroys peace, all that awaits them is a hell of destruction,' South Korea's Defense Minister Shin Won-sik warned in a meeting with top military commanders last week.\nKCNA also cited North Korean leader Kim Jong Un as saying his military had 'eyes overlooking a very long distance and a strong fist beating a very long distance'.\nProfessor Park said the 'fist' referred to the Hwasong-18.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "North Korea fires nuclear-capable missile with range to target ENTIRE United States, Japan says", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12875665/North-Korea-fires-nuclear-capable-missile-range-target-ENTIRE-United-States-Japan-says.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}