{"authors": [], "date_download": "2024-02-05 15:25:09", "date_modify": "None", "date_publish": "2023-12-18 18:50:26", "description": "France’s foreign minister is urging Lebanese leaders to work on reducing tensions along the border with Israel, warning that the raging Israel-Hamas war, now in its third month, could spread to other parts of the region", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisrael-ap-hezbollah-france-hamas-b2466162.html.json", "image_url": "https://static.independent.co.uk/2023/12/18/18/Lebanon_France_59118.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFrance’s foreign minister urged Lebanese leaders on Monday to work on reducing tensions along the border with Israel, warning that the Israel-Hamas war could still spread to other parts of the region.\nCatherine Colonna's visit to Lebanon came a day after she visited Israel, where she called for an “immediate truce” aimed at releasing more hostages, getting larger amounts of aid into Gaza and moving toward “the beginning of a political solution.”\nWhile she was in Beirut, Lebanon’s militant Hezbollah group exchanged fire with Israeli troops along the tense frontier, which seen violent exchanges since Oct. 8 — a day after the Palestinian militant Hamas group attacked southern Israel, killing 1,200 people, most of them civilians.\nIn Beirut, Colonna held talks with Lebanon’s caretaker Prime Minister Najib Mikati and Parliament Speaker Nabih Berri about the situation Lebanon's southern border. Officials from France, once Lebanon’s colonial ruler, have visited Lebanon over the past two months, urging for calm. For the past few years, Lebanon has been in the grips of the worst economic crisis in its modern history, which has significantly destabilized the country.\nIsrael and Lebanon's Hezbollah, an Iran-backed Shiite militant group, are bitter enemies that last fought a war in the summer of 2006. Israel estimates that Hezbollah has around 150,000 rockets and missiles on Lebanese soil, aimed at Israel.\nDuring the meeting with Colonna, Mikati called on Israel to implement the U.N. Security Council resolution 1701 that ended the 2006 war saying Israel should abide by it, according to a statement released by his office. He was apparently referring to almost daily violations of Lebanese air space by Israel’s air force.\nThe resolution also states the border area in southern Lebanon must be “free of any armed personnel, assets and weapons” other than Lebanese government forces and U.N. peacekeepers. Under the resolution, Hezbollah should not have military presence in the border region.\nA day after the Hamas-Israel war started, Hezbollah fighters have been attacking Israeli posts along the Lebanon-Israel border. Israeli tanks, artillery and air force have been also striking areas on the Lebanese side of the border.\n“The dangers of the conflict spreading are still high” Colonna said, adding that she came to Lebanon to urge all parties to avoid expanding the conflict. “I am very worried. ... escalation must stop.”\nOn Friday, U.S. National Security Adviser Jake Sullivan said during a visit to Israel that a “negotiated outcome” is the best way to reassure residents of northern Israel, where tens of thousands of its civilians have been evacuated from Israeli towns and villages along the border with Lebanon. Some have said they have no plans to return home as long as Hezbollah fighters are across the border in Lebanon.\nEarlier Monday, Lebanon’s state news agency said an Israeli drone fired a missile at a building close to where the funeral of a Hezbollah fighter was being held in a southern border village, without inflicting any casualties. On Sunday, Israeli strikes killed three Hezbollah fighters in southern Lebanon; more than 100 Hezbollah fighters have been killed since Oct. 8.\nIn Monday's strike, the missile hit the roof of a building about 40 meters (yards) from a square where the funeral of Hezbollah fighter Hassan Maan Surour was underway in the border village of Aita al-Shaab, the state-run National News Agency said.\nHezbollah claimed it targeted one of Israel's Iron Dome missile defense systems batteries in northern Israel while the Israeli military said its fighter jets struck a series of Hezbollah targets on Monday, including infrastructure, a launch post and a military site.", "source_domain": "www.independent.co.uk", "text": null, "title": "France urges Lebanese leaders to work on bringing calm along the border with Israel", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israel-ap-hezbollah-france-hamas-b2466162.html"}