{"authors": ["Yuval Shany"], "date_download": "2024-02-05 15:15:19", "date_modify": "None", "date_publish": "2024-01-28 14:22:30", "description": "The case brought by South Africa was weak, but the judgment may encourage Israel’s allies to push for a change of tactics, says Yuval Shany of the Hebrew University of Jerusalem", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F28%2Ficj-israel-gaza-ruling-genocide.json", "image_url": "https://i.guim.co.uk/img/media/158f0b278c4264c3b8e97491ce56efac90ea5208/527_0_7350_4413/master/7350.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=f310effc0a9c05112aa7910c06a9b74c", "language": "en", "localpath": null, "maintext": "The decision by the international court of justice (ICJ) to issue provisional measures in the case brought by South Africa against Israel on the basis of the genocide convention came as no shock to most longtime observers of the court. Although most of the evidence presented by South Africa in support of its claims that Israel is violating the convention was merely circumstantial in nature (relying heavily on inferences drawn from the high death toll in Gaza, the dire humanitarian situation on the ground and statements by Israeli officials which could be read as eliminationist in nature), most judges were not willing to determine, at this early stage of the proceedings, that the case was implausible.\nIn fact, only two judges (Julia Sebutinde from Uganda and Aharon Barak from Israel) were ready to accept Israel’s position: that Hamas’s extensive use of human shields, the harm mitigation efforts by the Israel Defense Forces (IDF) and the causal disconnect between the aggressive statements uttered by Israeli politicians and the actual cabinet directives provided to the IDF, rendered the South African genocide case implausible.\nIndeed, as an institution that serves as the “principal judicial organ of the United Nations”, it would have been very surprising had the ICJ declined to intervene in this high-stakes case, which has attracted huge international attention, and which relates to a most urgent and serious humanitarian catastrophe about which multiple UN agencies have voiced extreme concern. This is especially so given the fact that the court was quick to intervene less than two years ago in the Russia-Ukraine war.\nStill, you can hardly read the decision as a strong endorsement of the South African legal characterisation of Israel’s conduct. The standard of “plausibility of claims” applied by the court when considering whether or not to issue provisional measures is already a very low and ambiguous standard of proof for factual allegations, and the court muddied it even further by holding that “at least some of the rights claimed by South Africa” are plausible, without indicating which claims are more plausible than others.\nIndeed, one of the judges, Georg Nolte from Germany, has indicated that, for him, it is implausible that the IDF military campaign is being conducted with genocidal intent. He voted with the majority, he said, because “dehumanising and discriminate language” used by Israeli officials causes a risk of future violations of the genocide convention.\nIt is also notable that the most consequential provisional measures requested by South Africa – cessation of the war, non-aggravation of the crisis, repeal of specific measures (such as those instructing north Gaza residents to evacuate to the south) and providing access to fact finders – were rejected by the court. The court did not call for a ceasefire – though talks aimed at negotiating a temporary pause in fighting to allow further hostage releases are reported to have progressed in recent days.\nUltimately, almost all the measures indicated by the court can be regarded as general demands on Israel not to violate various provisions of the genocide convention. Since Israel maintains that its operations are already consistent with international law (including the criminal investigation of acts of incitement, which it has started to undertake), it seems unlikely that the ICJ’s provisional measures will result in an actual and palpable change in Israeli policies relating to the war.\n00:02:12 South Africa and Israel respond to ICJ ruling on war in Gaza – video\nThere are two significant contexts, however, in which the court’s order may complicate things significantly for Israel, potentially leading to a reconsideration of its approach to the conflict. First, the very holding by the court concerning the plausibility of some of the South African claims – weak and vague as it may be – is still likely to generate more political pressure on Israel from its allies. Some of these allies may even be concerned that the order could generate for them a new legal risk – albeit remote – of complicity in violations of the convention should they continue to support Israel’s war effort in its current configuration. As a result, expectations are likely to increase for Israel to do more on the humanitarian front, to apply a greater level of care in its military operations and to move as quickly as possible towards winding down the war.\nSecond, the court’s order to Israel to report to it within a month “on all measures taken to give effect to its order” creates a potential opening for ongoing monitoring of Israel’s conduct in the war by the court. (A similar strategy was adopted by the ICJ in a case between Armenia and Azerbaijan, where it has reconsidered its provisional measures five times within two years.) Complicating any such ongoing monitoring are new allegations by Israel that 12 members of the staff of UNRWA, the UN’s Relief and Works Agency for Palestine – on whose reports the court relied when issuing provisional measures – took part in Hamas’s 7 October attack.\nThe upshot of the ICJ judgment is that international legal scrutiny of Israel’s activity is here to stay – notwithstanding Israel’s deep reservations about international institutions, including international courts. With the ICJ scheduled to hear pleadings next month regarding the legal consequences of Israel’s prolonged occupation of Palestinian territories, and with the international criminal court (ICC) actively investigating allegations of crimes committed by both parties to the Israel-Hamas war, legal and political pressures on Israel are only expected to further increase in the foreseeable future, potentially narrowing its military and policy options.\nYuval Shany is the Hersch Lauterpacht chair in public international law at the Hebrew University of Jerusalem and a senior fellow at the Israel Democracy Institute", "source_domain": "www.theguardian.com", "text": null, "title": "The ICJ’s vague demands for Israel to comply with the law are unlikely to result in palpable change", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/28/icj-israel-gaza-ruling-genocide"}