{"authors": ["Adam Fulton", "Maya Yang", "Yohannes Lowe"], "date_download": "2024-02-05 15:25:11", "date_modify": "None", "date_publish": "2023-12-18 02:58:25", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F17%2Fisrael-gaza-war-live-netanyahu-says-government-committed-as-ever-to-war-in-gaza-as-uk-and-germany-call-for-ceasefire.json", "image_url": "https://i.guim.co.uk/img/media/485a1cbbc4806bfe3a8adb4f2b72f36576af4a4c/0_266_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=7e69d15d95abe7ca0567edbd548ab18c", "language": "en", "localpath": null, "maintext": "From 17 Dec 2023 23.12 CET Brother of Israeli hostage accidentally killed by IDF says army 'murdered' him The brother of Alon Shamriz, a 26-year-old Israeli hostage who was accidentally killed by the Israel Defense Forces and buried on Sunday, said that the Israeli army “abandoned” and “murdered” him. Agence France-Presse reports: Alon Shamriz, 26, was one of the three Israeli hostages shot dead by soldiers during an operation in the Gaza City suburb of Shejaiya, even as they carried a white flag and cried for help in Hebrew. Shamriz, Yotam Haim and Samer Al-Talalqa were killed when troops mistook them for a threat and opened fire, the army said. ‘Those who abandoned you also murdered you after all that you did right,’ Ido, brother of Shamriz said at the funeral in kibbutz Shefayim north of Tel Aviv attended by dozens of relatives and family members. ‘You survived 70 days in hell,’ Shamriz’s mother, Dikla, said in her eulogy. ‘Another moment and you would have been in my arms.’ Israeli media reported that Al-Talalqa was buried on Saturday, while the funeral for Haim was scheduled on Monday. The deaths of the three men, all in their twenties, have sparked protests in Tel Aviv as demonstrators demanded that the authorities offer a new plan for bringing home the remaining hostages held in the Gaza Strip.\nUpdated at 23.21 CET\n18 Dec 2023 03.49 CET Closing summary It’s approaching 4.50am in Gaza City and Tel Aviv and we’ll close this blog in a moment. Our live coverage will resume later today. Here’s a roundup of the latest developments. And you can see all our Israel-Gaza war coverage here. Thanks for reading. Israeli strikes killed 90 Palestinians in Jabalia refugee camp in northern Gaza on Sunday, the Hamas-run Gaza health ministry said. Videos posted online of what appeared to be the aftermath showed Palestinians digging through the rubble for survivors with shovels and their bare hands.\nThe World Health Organization (WHO) has said it is “appalled” after Israel’s deadly raid on northern Gaza’s Kamal Adwan hospital at the weekend. WHO chief Tedros Ghebreyesus said the “effective destruction” of the hospital over the past several days was “rendering it non-functional and resulting in the death of at least eight patients”.\nThe Israeli army has said it uncovered the biggest Hamas tunnel in the Gaza Strip so far, just a few hundred metres from a key border crossing. Such was its size that small vehicles would be able to travel within it, an AFP photographer granted access to it reported. The underground passage formed part of a wider branching network that stretched for more than 2.5 miles (4km) and came within 400 metres of the Erez border crossing, the army said. It would have cost millions of dollars and taken years to construct, Israeli forces said.\nThe United Nations security council could vote as early as Monday on a proposal to demand that Israel and Hamas allow aid access to Gaza – via land, sea and air routes – and set up UN monitoring of the humanitarian assistance delivered. Diplomats said the fate of the draft security council resolution hinges on final negotiations between Israel ally the US, which has council veto power, and the United Arab Emirates, which has drafted the text.\nThe Syrian army has said Israeli missiles launched from the occupied Golan Heights hit sites near Damascus that regional intelligences say targeted Iranian militias’ stronghold near Syria’s holiest Shia Muslim shrine. Syria’s air defences shot down some of the missiles that targeted the countryside around the capital in an incident that injured two soldiers, the army said in a statement on Sunday.\nThe Palestinian health ministry in the occupied West Bank is calling for an international investigation into reports that Israeli forces buried Palestinians alive in the courtyard of Gaza’s Kamal Adwan hospital via bulldozers amid its deadly raid over the weekend. Palestinian health minister Mai Alkaila cited reports from witnesses who said they saw Israeli forces burying Palestinians alive in the courtyard of one of the few remaining functioning hospitals in Gaza, Palestinian news agency Wafa reported. The Guardian could not confirm the reports and Israel had not responded to them.\nThe Kerem Shalom crossing between Israel and Gaza opened on Sunday for aid trucks for the first time since the outbreak of war, officials said, in a move intended to double the amount of food and medicine reaching the territory. Two sources in the Egyptian Red Crescent said trucks had crossed Kerem Shalom on Sunday on their way into Gaza. One said there were 79 trucks.\nFrance said that one of its workers was killed by an Israeli attack in Rafah, Reuters reports. According to French foreign minister Catherine Colonna, who spoke to journalists following a visit to Israel and the West Bank, the man who was killed was a Palestinian national who worked for the French Institute for decades.\nThe director of Israeli spy agency Mossad has met the Qatari prime minister for talks on resuming indirect negotiations on the release of hostages , CNN has reported, quoting diplomatic sources. The sources said the meeting on Friday between David Barnea and Sheikh Mohammed bin Abdulrahman bin Jassim al-Thani was positive, the network said. Reuters has quoted two Egyptian security sources as saying Israel and Hamas are both open to a renewed deal involving a ceasefire and hostage release, although disagreements on detail remain. They said Hamas was insisting on setting the list of hostages to be released unilaterally and demanding Israel withdraw its forces behind pre-determined lines.\nFormer UK defence secretary Ben Wallace has warned Israel that it risks undermining the legal basis for its action in the Gaza Strip , adding to growing international pressure over the escalating conflict. Writing for Britain’s Telegraph, the senior Tory warned against a “killing rage” and said Israel’s “original legal authority of self-defence is being undermined by its own actions”.\nThe US is to announce the launch of an expanded maritime protection force involving Arab states to combat the increasingly frequent Houthi attacks being mounted from Yemen’s ports on commercial shipping in the Red Sea. The force is due to be announced by the defence secretary, Lloyd Austin, during his Middle East visit. Five big shipping companies have now stopped their ships using the Red Sea in the wake of attacks mounted by Houthis in protest at Israel’s efforts to eliminate Hamas in Gaza.\nThe head of the UN agency for Palestinian refugees (UNRWA) has said of the humanitarian crisis in Gaza: “By any account, I haven’t seen anything of this scale.” Philippe Lazzarini went on to say in an interview with Al Jazeera: “Everything is absolutely unprecedented and staggering. The number of people who have been killed … in 40 days, more women and children killed than the number of civilians in the Ukraine war.”\nUpdated at 04.02 CET\n18 Dec 2023 03.24 CET The director of Israeli spy agency Mossad has met the Qatari prime minister for talks on resuming indirect negotiations on the release of hostages, CNN has reported, quoting diplomatic sources. The sources said the meeting on Friday between David Barnea and Sheikh Mohammed bin Abdulrahman bin Jassim al-Thani was positive, the network said. CNN’s report continues: The meeting comes after another trip Barnea was meant to make to Doha was cancelled earlier in the week by the Israeli government. This latest meeting was planned before the Israel Defense Forces (IDF) accidentally killed three Israeli hostages in Gaza on Friday, but that incident has added urgency to the conversations, the source said. On Thursday an Israeli official told CNN that the war cabinet felt “conditions are not right” to try to restart the talks. Qatar and the US have been working to try to resurrect the negotiations, with new proposals made to free more of the more than 100 hostages in Gaza. As we reported earlier, Israel and Hamas are both open to a renewed deal involving a ceasefire and hostage release, although disagreements on detail remain, according to two Egyptian security sources. Reuters said that according to the sources, Hamas is insisting on setting the list of hostages to be released unilaterally and demanding Israel withdraw its forces behind pre-determined lines.\nIsrael agreed on Hamas deciding the list and has asked for a timeline and to review the list in order to decide on ceasefire’s time and duration, the sources said. However, Israel has refused to withdraw, they said.\n18 Dec 2023 02.59 CET Israel's 'killing rage' risks undermining legality of Gaza offensive, says Ben Wallace Former UK defence secretary Ben Wallace has warned Israel that it risks undermining the legal basis for its action in the Gaza Strip, adding to growing international pressure over the escalating conflict. Writing for Britain’s Telegraph, the senior Tory warned against a “killing rage” and said Israel’s “original legal authority of self-defence is being undermined by its own actions”. PA Media reports that intervention by Wallace, who left office earlier this year, is the latest warning to Benjamin Netanyahu’s government amid deepening concern over the scale of civilian casualties. View image in fullscreen Former British defence secretary Ben Wallace says Israel ‘needs to stop this crude and indiscriminate method of attack’. Photograph: Anadolu Agency/Getty Images It comes after the British foreign secretary, David Cameron, called for a “sustainable ceasefire” as he warned that “too many civilians have been killed” in a joint article with his German counterpart in the Sunday Times. Wallace warned: Netanyahu’s mistake was to miss the [Hamas] attack in the first place. But if he thinks a killing rage will rectify matters, then he is very wrong. His methods will not solve this problem. In fact, I believe his tactics will fuel the conflict for another 50 years. Wallace said he was not “calling for a ceasefire with Hamas” but instead that Israel “needs to stop this crude and indiscriminate method of attack”.\nUpdated at 03.01 CET\n18 Dec 2023 02.32 CET In case you missed this earlier, the US is to announce the launch of an expanded maritime protection force involving Arab states to combat the increasingly frequent Houthi attacks being mounted from Yemen’s ports on commercial shipping in the Red Sea, Patrick Wintour reports. The force, provisionally entitled Operation Prosperity Guardian, is due to be announced by the US defence secretary, Lloyd Austin, when he visits the Middle East. Much like the Task Force 153 already operating out of Bahrain, the larger protection force is designed to provide reassurance to commercial shipping companies that Houthi attacks will be seen off, and that the sea remains safe for commercial shipping. Five big shipping companies have now stopped their ships using the Red Sea in the wake of attacks mounted by Houthis in protest against Israel’s efforts to eliminate Hamas in Gaza. The full report is here: US to announce expanded protection force for Red Sea shipping Read more\n18 Dec 2023 02.12 CET Continuing on humanitarian aid as the UN security council moves towards voting on a resolution demanding aid access to Gaza, the Kerem Shalom crossing between Israel and Gaza opened on Sunday for aid trucks for the first time since the outbreak of war, officials said, in a move intended to double the amount of food and medicine reaching the territory. The crossing was closed after Hamas’s 7 October attack and aid was being delivered solely through Gaza’s Rafah crossing with Egypt, which Israel said could only accommodate the entry of 100 trucks a day. Reuters reports that Kerem Shalom, on the border of Egypt, Israel and Gaza, is one of the main transit points for goods in and out of the Palestinian territory, allowing much faster transit than the Rafah passenger crossing a few kilometres away. Israel approved the entry of aid last week. Cogat, the branch of military that coordinates humanitarian aid with the Palestinian territories, said in a statement: Starting today [Sunday], UN aid trucks will undergo security checks and be transferred directly to Gaza via Kerem Shalom, to abide by our agreement with the US. Asked if aid had crossed into Gaza, an Israeli official said yes. View image in fullscreen A humanitarian aid truck is inspected at the Kerem Shalom crossing, seen in footage released last week. Photograph: Cogat/X/Reuters A Palestinian border official confirmed Kerem Shalom was reopened earlier on Sunday in coordination with the UN Palestinian refugee agency and Israel. Part of the aid had arrived in Gaza by Sunday night, while the rest would be completed on Monday, the official said. Two sources in the Egypt Red Crescent said trucks had crossed Kerem Shalom on Sunday on their way into Gaza. One said there were 79 trucks. Israeli prime minister Benjamin Netanyahu’s office has previously said the opening would allow Israel to maintain its commitments to permit the entry of 200 aid trucks a day, agreed on in the hostage deal brokered and implemented last month. As Israel’s campaign in Gaza has gathered pace, the humanitarian situation in Gaza has worsened dramatically, with the UN and other world bodies warning of severe shortages of food, clean water and medicines.\n18 Dec 2023 01.48 CET UN security council moves towards vote on Gaza aid access The United Nations security council could vote as early as Monday on a proposal to demand that Israel and Hamas allow aid access to Gaza – via land, sea and air routes – and set up UN monitoring of the humanitarian assistance delivered, Reuters reports. Diplomats said the fate of the draft security council resolution hinges on final negotiations between Israel ally the US, which has council veto power, and the United Arab Emirates, which has drafted the text. A US official, speaking on condition of anonymity, said: We have engaged constructively and transparently throughout the entire process in an effort to unite around a product that will pass. The UAE knows exactly what can pass and what cannot. It is up to them if they want to get this done. The US wants to tone down language on a cessation of hostilities, diplomats said. The draft text, seen by Reuters, currently “calls for an urgent and sustainable cessation of hostilities to allow safe and unhindered humanitarian access”. View image in fullscreen The UN general assembly in New York. Photograph: Anadolu/Getty Images UN officials and aid agencies warn of a humanitarian catastrophe in Gaza, including mass starvation and disease, with the majority of the Palestinian territory’s 2.3 million people driven from their homes during the two-month-long conflict. A council resolution needs at least nine votes in favour and no vetoes by the US, China, the UK, France or Russia. Earlier this month, Washington vetoed a resolution in the 15-member council that would have demanded an immediate humanitarian ceasefire between Israel and Hamas in Gaza. The 193-member UN general assembly then demanded a ceasefire last week, with 153 states voting in favour.\n18 Dec 2023 01.28 CET On the Israeli army saying it has uncovered the biggest Hamas tunnel in the Gaza Strip so far, such was its size that small vehicles could drive in the tunnel, it has been reported. The army said the tunnel was uncovered near a key border crossing and that it formed part of a wider branching network underground that stretched for more than 4km (2.5 miles). The tunnel would have cost millions of dollars and taken years to construct, and the project was led by Mohamed Yahya, the brother of the Hamas chief, Yahya Sinwar, according to Israeli forces. The passage came within 400 metres of northern Gaza’s Erez border with Israel. View image in fullscreen Israeli soldiers walk through what its military says is the biggest Hamas tunnel it has found in Gaza so far. Photograph: Amir Cohen/Reuters The honeycomb of passageways features drainage and sewage systems, electricity, ventilation and a communication network as well as rails. The floor is compacted earth, the walls are reinforced concrete and the entrance is a metal cylinder with 1.5cm thick walls. The army said it had found a large number of weapons stored in the tunnel. The labyrinth of tunnels beneath Gaza, which the Israeli military has nicknamed the “Gaza Metro”, was initially devised as a way of circumventing the crushing Israeli-Egyptian blockade, in place since 2007. The full story is here: Israeli army says it has uncovered biggest Hamas tunnel yet Read more\nUpdated at 01.30 CET\n18 Dec 2023 01.03 CET Returning to the situation in northern Gaza hospitals, al-Shifa hospital is providing only basic trauma stabilisation, has no blood for transfusions and hardly any staff to care for a constant flow of patients, the World Health Organisation (WHO) has said. After a UN visit to deliver medicines and surgical supplies, the team described the emergency department in the territory’s main health facility as resembling a “bloodbath”, Reuters reports. The WHO said on Sunday there were hundreds of wounded patients at the Gaza City hospital, with new ones arriving by the minute and trauma injuries being stitched on the floor, with almost no pain management available. Only four hospitals of 24 working in north Gaza before the war with Israel began have even partial service, and three of those are barely functioning, the WHO said. View image in fullscreen Displaced Palestinians gathering in the yard of al-Shifa hospital in Gaza City a week ago. Photograph: AFP/Getty Images It said it was urgently gathering information at the Kamal Adwan hospital, where Gazan authorities said Israeli forces this week used a bulldozer to smash through the perimeter of a site Israel has said was used by Hamas fighters. The militant group, which governs Gaza, has denied using the Kamal Adwan or other hospitals for its activities. Israel has also said al-Shifa, which it had occupied earlier in the war, had been used by Hamas. Tens of thousands of Palestinians are believed to remain in north Gaza, after Israelis forces pushed most of the population to the south during the first days of the bombing campaign and ground war after Hamas’s bloody 7 October attack on southern Israel.\nUpdated at 01.09 CET\n17 Dec 2023 00.40 CET Israeli missiles hit sites near Damascus, says Syria The Syrian army has said Israeli missiles launched from the occupied Golan Heights hit sites near Damascus that regional intelligences say targeted Iranian militias’ stronghold near Syria’s holiest Shia Muslim shrine. Reuters reports Syria’s air defences shot down some of the missiles that targeted the countryside around the capital in an incident that injured two soldiers, the army said in a statement on Sunday. It did not give any details on the location of the incident. Since Hamas’s deadly 7 October attack, Israel has escalated its strikes on Iranian-backed militia targets in Syria and also struck Syrian army air defences and some Syrian forces. The Israel Defence Force did not immediately comment on the attack. View image in fullscreen Israeli soldiers training in the occupied Golan Heights this month. Photograph: Gil Eliyahu/Reuters Two regional intelligence sources said the strikes hit an outpost of the pro-Iranian Hezbollah group in the Sayeda Zainab neighourhood of southern Damascus, the site of Syria’s holiest major Shia shrine. They say its main headquarters are in that neighbourhood, where it has a heavy presence and a string of underground bases. The area has attracted thousands of pro-Iranian militia fighters from Lebanon, Iraq and Afghanistan who came into Syria to fight alongside Syrian president Bashar al-Assad’s troops. This is Adam Fulton picking up our live coverage – stay with us for all the latest developments\nUpdated at 00.45 CET\n17 Dec 2023 00.08 CET Summary Here is where the day stands: The Palestinian health ministry in the occupied West Bank is calling for an international investigation into reports that Israeli forces buried Palestinians alive in the courtyard of Gaza’s Kamal Adwan hospital via bulldozers amid its deadly raid over the weekend. Palestinian health minister Mai Alkaila cited reports from witnesses who said they saw Israeli forces burying Palestinians alive in the courtyard of one of the few remaining functioning hospitals in Gaza, Palestinian news agency Wafa reports. The Guardian could not confirm the reports and Israel has not responded to them.\nThe World Health Organization (WHO) said that it is “appalled” following Israel’s deadly raid on Gaza’s Kamal Adwan hospital over the weekend. WHO chief Tedros Ghebreyesus said: “WHO is appalled by the effective destruction of Kamal Adwan hospital in northern #Gaza over the last several days, rendering it non-functional and resulting in the death of at least 8 patients.”\nIsraeli strikes killed 90 Palestinians in Jabalia refugee camp in northern Gaza on Sunday, a Gaza health ministry spokesperson told Reuters. Videos posted online of what appeared to be the aftermath of the latest Israeli strike showed Palestinians digging through the rubble for survivors with shovels and their bare hands. Since 7 October, Israel has attacked Jabalia refugee camp multiple time.\nFrance said that one of its workers was killed by an Israeli attack in Rafah, Reuters reports. According to French foreign minister Catherine Colonna, who spoke to journalists following a visit to Israel and the West Bank, the man who was killed was a Palestinian national who worked for the French Institute for decades.\nIsrael and Hamas are both open to a renewed deal involving a ceasefire and hostage release, although disagreements on detail remain, two Egyptian security sources told Reuters on Sunday. According to the sources, Hamas is insisting on setting the list of hostages to be released unilaterally and demanding Israel withdraw its forces behind pre-determined lines.\nIn a new interview with Al Jazeera on the humanitarian crisis in Gaza as a result of Israel’s strikes, UNRWA chief Philippe Lazzarini said: “By any account, I haven’t seen anything of this scale.” He went on to add: “Everything is absolutely unprecedented and staggering. The number of people who have been killed … in forty days, more women and children killed than the number of civilians in the Ukraine war.”\nThe Palestine Red Crescent Society (PRCS) said that the aid that has been received in Gaza “doesn’t meet 10% of the needs”. It added that since 21 October, 4,367 aid trucks have entered the strip through the Rafah crossing, 60% of which were for the PRCS. It went on to call for “unconditional continued aid entry” into Gaza where more than 1.7 million Palestinians have been displaced as a result Israel’s attacks across the strip.\nUpdated at 00.56 CET\n17 Dec 2023 00.01 CET Palestinian health ministry calls for international investigation into reports of Israeli forces burying Palestinians alive at Kamal Adwan hospital The Palestinian health ministry in the occupied West Bank is calling for an international investigation into reports that Israeli forces buried Palestinians alive in the courtyard of Gaza’s Kamal Adwan hospital via bulldozers amid its deadly raid over the weekend. Palestine’s health minister Mai Alkaila cited reports from witnesses who said they saw Israeli forces burying Palestinians alive in the courtyard of one of the few remaining functioning hospitals in Gaza, Palestinian news agency WAFA reports. Alkaila also urged the international comunity to “not ignore or remain silent about reports of war crimes coming from the Gaza strip”, WAFA added. Writing on Twitter/X, the Palestinian foreign ministry also called for an “immediate international investigation into the initial reports that the occupation committed heinous and horrific crimes in the courtyard of Kamal Adwan hospital”. The Ministry of Foreign Affairs and Expatriates demands an immediate international investigation into the initial reports that the occupation committed heinous and horrific crimes in the courtyard of Kamal Adwan #Hospital.\nتطالب وزارة الخارجية والمغتربين بتحقيق دولي فوري في… — State of Palestine - MFA 🇵🇸🇵🇸 (@pmofa) December 16, 2023 Speaking to Al Jazeera, a witness said: “People were buried alive using bulldozers. Who could do that? All those who committed this crime should be brought to justice and taken to the international criminal court.” Geneva-based Euro-Med Human Rights Monitor also called for an independent investigation into the reports, citing witnesses who said that Israeli bulldozers buried Palestinians alive and that least one of the bodies could be seen amid sand piles. The World Health Organization has said that it is “appalled by the effective destruction” of the hospital, adding that “Gaza’s health system was already on its knees and the loss of another even minimally functioning hospital is a severe blow.” The Guardian could not confirm the Palestinian reports. Israel has not responded to them.\nUpdated at 00.55 CET\n17 Dec 2023 23.30 CET France said that one of its workers was killed by an Israeli attack in Rafah, Reuters reports. According to French foreign minister Catherine Colonna, who spoke to journalists following a visit to Israel and the West Bank, the man who was killed was a Palestinian national who worked for the French Institute for decades. The French foreign ministry said earlier that the man was seeking refuge in the house of a colleague from the French consulate along with two other co-workers and several family members, Reuters reports. “The house was hit by an Israeli air strike on Wednesday evening, which seriously hurt our agent and killed about 10 others,” the ministry said. According to the ministry, the man later died from his wounds by the Israeli strike. It did not provide a date. “We’ve asked for explanations as to why the house ... had been hit,” Colonna told reporters.\nUpdated at 23.35 CET\n17 Dec 2023 23.12 CET Brother of Israeli hostage accidentally killed by IDF says army 'murdered' him The brother of Alon Shamriz, a 26-year-old Israeli hostage who was accidentally killed by the Israel Defense Forces and buried on Sunday, said that the Israeli army “abandoned” and “murdered” him. Agence France-Presse reports: Alon Shamriz, 26, was one of the three Israeli hostages shot dead by soldiers during an operation in the Gaza City suburb of Shejaiya, even as they carried a white flag and cried for help in Hebrew. Shamriz, Yotam Haim and Samer Al-Talalqa were killed when troops mistook them for a threat and opened fire, the army said. ‘Those who abandoned you also murdered you after all that you did right,’ Ido, brother of Shamriz said at the funeral in kibbutz Shefayim north of Tel Aviv attended by dozens of relatives and family members. ‘You survived 70 days in hell,’ Shamriz’s mother, Dikla, said in her eulogy. ‘Another moment and you would have been in my arms.’ Israeli media reported that Al-Talalqa was buried on Saturday, while the funeral for Haim was scheduled on Monday. The deaths of the three men, all in their twenties, have sparked protests in Tel Aviv as demonstrators demanded that the authorities offer a new plan for bringing home the remaining hostages held in the Gaza Strip.\nUpdated at 23.21 CET\n17 Dec 2023 22.23 CET Fears are growing of an all-out Israel-Hezbollah war as fighting escalates. The Guardian’s Julian Borger reports: When the news first broke of the Hamas attack early on 7 October, Itai Reuveni and the other reservists in his paratrooper battalion packed their bags and arrived at their muster point well before their call-up came from the army. The paratroopers did not head south to Gaza but to the northern border, where they believed a far greater threat than Hamas was poised to join the fight: Hezbollah, the Lebanese Shia movement backed by Tehran. ‘We’re here to make sure that no one does to us in the north what they did to us in the south,’ said Reuveni, 40, a master sergeant who in his civilian life does thinktank research on terrorist financing. ‘We understand that Hezbollah is much more sophisticated [than Hamas]. We understand it’s not 3,000 fighters that come over the border, it will be much more, and you’ll also have Iran in the equation. We are here to deal with that.’ Reuveni is not alone in seeing Hezbollah as the greater danger to Israel. The Israeli defence minister, Yoav Gallant, and other hawks in the cabinet argued for a pre-emptive strike against the militant group in the immediate aftermath of the 7 October attack. That caused alarm in Washington, fearful of a regional war that could pull Iran into the fight. With US backing, Benjamin Netanyahu fended off the proposal, but the conviction has taken hold among Israeli politicians, generals and a widening slice of the public that a new war in Lebanon is inevitable. Read the full story here: Fears grow of all-out Israel-Hezbollah war as fighting escalates Read more", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli missiles hit sites near Damascus, says Syria - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/17/israel-gaza-war-live-netanyahu-says-government-committed-as-ever-to-war-in-gaza-as-uk-and-germany-call-for-ceasefire"}