{"authors": [], "date_download": "2024-02-05 15:25:14", "date_modify": "None", "date_publish": "2023-12-18 17:30:36", "description": "The Israeli military has shown journalists what it says is the largest ever Hamas tunnel it has found in Gaza.", "filename": "https%3A%2F%2Fwww.bbc.co.uk%2Fnews%2Fav%2Fworld-middle-east-67754837.json", "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/9A22/production/_132085493_p0h0bd76.jpg", "language": "en", "localpath": null, "maintext": "The Israeli military has shown journalists what it says is the largest ever Hamas tunnel it has found in Gaza, with an entrance close to the Erez checkpoint - the main pedestrian crossing point into Israel.\nOn Sunday, Reuters filmed inside the tunnel, which it said was about three metres wide and deep. The Israel Defense Forces said it was 50m deep and about 4km (2.5 miles) long.\nThe IDF also released footage it said was \"seized during ground operations in Gaza\" and claimed it showed Muhammad Sinwar, the brother of Hamas's leader in Gaza, Yahya Sinwar, driving a car inside the tunnel.\nIsrael has described him in the past as the head of logistics and manpower of the movement, and also says he oversaw construction of the tunnel.\nThe IDF also shared video it said was filmed by Hamas during the construction of the tunnel. The BBC has not been able to verify these two videos or the claims about the tunnels.\nThe BBC has previously verified drone footage released by Hamas in October showing Israeli troops near a tunnel close to Erez. The IDF posted on its Telegram account in October that \"soldiers operating adjacent to the Erez Crossing identified a number of terrorists exiting the shaft of a tunnel\".\nSatellite images appear to show excavation work in the area in late November.", "source_domain": "www.bbc.co.uk", "text": null, "title": "Footage shows inside of 'biggest ever' Gaza tunnel", "title_page": null, "title_rss": null, "url": "https://www.bbc.co.uk/news/av/world-middle-east-67754837"}