{"authors": [], "date_download": "2024-02-05 15:25:15", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Russia launched a drone attack across Ukraine on Saturday. Ukraine’s air force said its forces and mobile groups of drone hunters shot down 30 of the", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274066933%2Frussia-launches-drone-attack-across-ukraine.json", "image_url": "https://cdn.bignewsnetwork.com/voa1702724798.jpg", "language": "en", "localpath": null, "maintext": "Russia launched a drone attack across Ukraine on Saturday.\nUkraine's air force said its forces and mobile groups of drone hunters shot down 30 of the 31 Iranian-made Shahed drones targeting 11 Ukrainian regions.\nThe targeted areas included Kyiv, the capital, and the southern region of Kherson and the western region of Khmelnytsky.\n'The drones attacked in groups, in waves, and from different directions,' said Shehiy Popko head of Kyiv's military administration.\nUkrainian President Volodymyr Zelenskyy said in his daily address that he held a meeting of the Congress of Local and Regional Authorities in Lyiv on Friday. National government officials, including the prime minister, were also in attendance, according to Zelenskyy.\nHe said 'many issues were discussed' at the gathering because 'it is very important for the government to be in constant communication with local governments and for community leaders to understand the current situation' in Ukraine.\nAlso at the meeting, Zelenskyy said, the head of the security service of Ukraine delivered details about the detention of collaborators in Odesa, Kherson region, and Dnipro.\nMeanwhile, Ukraine has signed contracts for joint cooperation on technology weapons production with Western partners in its effort to boost its defense industry at home and to reduce dependence on Western military supplies.\n'We have dozens of new contracts between companies on joint production or technology exchange,' Defense Minister Rustem Umerov said in a Facebook post.\nThe drive to increase production at home has become critically important as the future of large-scale military aid from the United States and European Union appears more uncertain and Western stockpiles have become more depleted.\nKyiv has hosted a number of conferences with members of the international defense industry. This week it held a conference with the largest British defense manufacturers, while last September it hosted more than 250 Western weapons producers, followed by a joint Ukraine-U.S. defense conference in Washington in December.\n'We signed a memorandum with the United States on joint production and technical data sharing,' Umerov said.\nUkraine is also seeking more agreements like its venture with German arms producer Rheinmetall AG to service and repair Western weapons, and an agreement with two American firms to jointly manufacture vital 155 mm artillery shells.\nDomestic defense output has tripled in 2023, according to the strategic industries ministry, and is expected to increase six times more next year.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Russia Launches Drone Attack Across Ukraine", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274066933/russia-launches-drone-attack-across-ukraine"}