{"authors": ["Emily Goodin", "Senior U.S. Political Reporter"], "date_download": "2024-02-05 15:25:17", "date_modify": "None", "date_publish": "2023-12-18 20:28:39", "description": "The White House said it had spoken to the Israeli government about the killing of two women sheltering at a Catholic church in the Gaza strip.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12878431%2FWhite-House-raises-concerns-Israel-sniper-shot-dead-two-Christian-women-Gaza-latest-rift-Washington-Tel-Aviv.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/18/15/79054441-0-Two_women_named_as_Nahida_and_Samar_were_killed_in_cold_blood_by-a-17_1702913532827.jpg", "language": "en", "localpath": null, "maintext": "The White House on Monday said it had spoken to the Israeli government about the killing of two women sheltering at a Catholic church in the Gaza strip, saying there needs to be better deconfliction to protect civilians and humanitarian workers.\n'We have raised our concerns about this particular incident with the with the Israeli government - about the need for those who have injuries or who have been wounded, to be able to be safely evacuated so they can receive appropriate medical treatment,' White House spokesman John Kirby told reporters.\nNahida Khalil Anton and her daughter Samar Kamal Anton were sheltering at Holy Family, the only Catholic Church in the Gaza Strip when they were killed by a sniper.\n'We've been very clear that we believe every effort possible must be made to prevent civilian casualties,' Kirby said.\nPresident Joe Biden and his administration have raised concerns with the Israelis about taking care civilians and humanitarian workers aren't caught in the crossfire during fighting in Gaza\n'More broadly, of course, we are in touch and we'll stay in touch with the UN and our Israeli authorities about the need for deconfliction channels if you will, that can be respected so that when Israel is conducting military operations against Hamas, that it does not ... endanger civilians that are trying to shelter themselves or humanitarian workers. So the need for better deconfliction, quite frankly, has also been a topic of our discussion and multiple channels,' he noted.\nKirby said President Joe Biden, National Security Adviser Jake Sullivan and Defense Secretary Llyod Austin all raised concerns to Israel about taking care to ensure civilians and humanitarian workers are not at risk.\nMeanwhile, Pope Francis condemned the killing of Samar and Nahida as 'terrorism.'\n'Some are saying, 'This is terrorism and war.' Yes, it is war. It is terrorism,' he said.\n'Nahida and her daughter Samar were shot and killed as they walked to the Sister's Convent,' the pontif said, referring to a building in the parish complex. 'One was killed as she tried to carry the other to safety. Seven more people were shot and wounded as they tried to protect others inside the church compound. No warning was given, no notification was provided.'\nHow did Israel kill an elderly woman and her daughter on the grounds of Gaza's only Catholic church?\nSamar (right) and Nahida Khalil Anton (left) were killed at the Holy Family Catholic Church\nSeven more people were shot and wounded by Israeli forces as they tried to protect others inside the compound from the deadly assault.\nNahida's heartbroken son Issa shared a picture of his mother and sister, saying his 'heart was broken' following their deaths.\nMy beloved mother, may Allah have mercy on you, my crown and the light of my eyes,' Issa said. 'Mum, our hearts are broken after you. My dear sister Samar, the light of my eyes, may Allah have mercy on your soul.'\nThe Israeli Defense Force said the incident is still under review while insisting it 'does not target civilians, no matter their religion'.\nBut the some 300 people still trapped in the church have described how Israeli tanks and snipers have surrounded the walled compound and were shooting at anyone emerging from the buildings there.\nThey say Israeli tanks have shot towards the church, missing it by mere inches and instead knocking out the building's generator and fuel supplies - rendering it uninhabitable for the women, children and disabled people who fled there.\nThe Holy Family church has been a refuge for hundreds of Christians since the war broke out on October 7 following Hamas's deadly attack on Israelis. There are also 54 disabled people seeking shelter there.\n'The 54 disabled persons are currently displaced and without access to the respirators that some of them need to survive,' the Patriarchate said.\nHammam Farah, who was related to Samar and Nahida, said the two women had been walking to the Sisters' Convent to use the only bathroom when they were killed.\nLike dozens of Christian families in Gaza, Samar (left) and her mother Nahida (right) had sought refuge from the relentless Israeli bombardments in the territory's only Catholic church\nThe Holy Family church (pictured in 2021) has been a refuge for hundreds of Christians since the war broke out on October 7 following Hamas's deadly attack on Israelis\nPalestinians attend the Roman Catholic Church of Holy Family in Gaza City on Christmas Day on December 25, 2017\n'One was killed as she tried to carry the other to safety,' Farah said. 'Their bodies remain strewn across the church courtyard.'\nFarah said his mother is still trapped inside the church and has described terrifying scenes, with scores of Israeli tanks and snipers surrounding the compound.\nHe shared a message his sister had sent him after she spoke with their mother, which read: 'They can't move out of the church. Last night was horrible.\n'Tanks are around the church with a lot of shooting, it damaged their cars in the church parking lot. There's no food. For the past month, they ate boiled spaghetti only.\n'In the end of call I told her I love you so much. She stopped talking and we cried together and then I said bye.'\nAccording to the Office of the United Nations High Commissioner for Human Rights, it is a war crime to 'intentionally direct attacks against protected objects, namely buildings dedicated to religion'.\nCivilian buildings - like hospitals - can lose their protected status if there is evidence they are being used for military purposes.\nThe IDF separately acknowledged the deaths of three Israeli hostages in Gaza on Friday, expressing its 'deep remorse over the tragic incident' in a statement and saying it had launched an immediate investigation.\nYotam Haim, Samer Fouad Talalka and Alon Lulu Shamriz, were shot dead as they surrendered with makeshift white flags on Friday morning around 10am.\nAccording to a senior official in the IDF's southern command, the incident began after a soldier from Bislamach Brigade's 17th Battalion identified three suspicious figures leaving a building.\nA preliminary IDF investigation revealed the men were shirtless, wielding white flags and calling out for help in Hebrew. An IDF soldier, believing it was a trap, opened fire and shouted 'terrorists!' to colleagues.\nIDF Spokesman Rear Admiral Daniel Hagari said: 'This is a tragic incident, the IDF bears responsibility. This is an area where the soldiers encountered many terrorists, including suicide bombers.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "White House 'raises concerns' with Israel after sniper shot dead two Christian women in Gaza in latest rift between Washington and Tel Aviv", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12878431/White-House-raises-concerns-Israel-sniper-shot-dead-two-Christian-women-Gaza-latest-rift-Washington-Tel-Aviv.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}