{"authors": [], "date_download": "2024-02-05 15:25:19", "date_modify": "None", "date_publish": "2023-12-18 05:03:53", "description": "A gloomy mood hangs over Ukraine’s soldiers nearly two years after Russia invaded their country", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-russia-boxer-kherson-b2465737.html.json", "image_url": "https://static.independent.co.uk/2023/12/18/05/Russia_Ukraine_War_Winter_Gloom_10107.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA gloomy mood hangs over Ukraine's soldiers nearly two years after Russia invaded their country.\nDespite a disappointing counteroffensive this summer and signs of wavering financial support from allies, Ukrainian soldiers say they remain fiercely determined to win. But as winter approaches, they worry that Russia is better equipped for battle and are frustrated about being on the defensive again in a grueling war. Some doubt the judgment of their leaders.\nDiscontent among Ukrainian soldiers — once extremely rare and expressed only in private — is now more common and out in the open.\nIn the southern city of Kherson, where Ukraine is staging attacks against well-armed Russian troops on the other side of the Dnieper River, soldiers are asking why these difficult amphibious operations were not launched months ago in warmer weather.\n“I don’t understand,” said a commander of the 11th National Guard Brigade’s anti-drone unit who is known on the battlefield as Boxer. “Now it’s harder and colder.”\n“It’s not just my feeling, many units share it,” said Boxer, who spoke on condition that only his battlefield name would be used.\nRussia, which illegally annexed the Crimean Peninsula in 2014, controls about one-fifth of Ukraine. After 22 months of war the two countries are essentially in a stalemate along the 1,000 kilometer-long (620 mile-long) front line.\nRussian forces aim to push deeper into eastern Ukraine this winter, analysts say, so that Russian President Vladimir Putin can cite this momentum as he campaigns for reelection, an outcome that is all but certain. Emboldened by recent gains on the battlefield, Putin said last week that he remains fully committed to the war and criticized Ukraine for “sacrificing\" troops to demonstrate success to Western sponsors.\nIn the United States, which has already spent some $111 billion defending Ukraine, President Joe Biden is advocating for an additional $50 billion in aid. But Republican lawmakers are balking at more support — just as some lawmakers in Europe are on the fence about providing another $50 billion to Ukraine, after failing to deliver on promised ammunition.\n“The reason the Ukrainians are gloomy is that, they now sense, not only have they not done well this year ... they know that the Russians' game is improving,” said Richard Barrons, a former British army general. “They see what’s happening in Congress, and they see what happened in the EU.”\nUkraine may be on the defensive this winter, but its military leaders say they have no intention of letting up the fight.\n“If we won’t have a single bullet, we will kill them with shovels,” said Serhii, a commander in the 59th Brigade that is active in the eastern city of Avdiivka and who spoke on condition that only his first name be used. “Surely, everyone is tired of war, physically and mentally. But imagine if we stop — what happens next?”\nBLEAK MOOD\nThe fatigue and frustration on the battlefield are mirrored in Ukraine’s capital, Kyiv, where disagreements among leaders have recently spilled out into the open.\nPresident Volodymyr Zelenskyy last month publicly disputed the assessment by Ukraine’s military chief, Valery Zaluzhny, that the war had reached a stalemate. And the mayor of Kyiv, Vitali Klitschko, has repeatedly lashed out at Zelenskyy, saying he holds too much power.\nDisquiet in the halls of power appears to have filtered down to the military's rank and file, who increasingly have misgivings about inefficiency and faulty decision-making within the bureaucracy they depend on to keep them well-armed for the fight.\nIn the southern Ukrainian region of Zaporizhzhia, where momentum has slowed since the summertime counteroffensive, drones have become a crucial tool of war. They enable soldiers to keep an eye on — and hold back — Russian forces while they conduct dangerous and painstaking operations to clear minefields and consolidate territorial gains. But fighters there complain that the military has been too slow in training drone operators.\nIt took seven months to obtain the paperwork needed from multiple government agencies to train 75 men, said Konstantin Denisov, a Ukrainian soldier.\n“We wasted time for nothing,” he said. Commanders elsewhere complain of not enough troops, or delays in getting drones repaired, disrupting combat missions.\nDefense Minister Rustem Umerov insists Ukraine has enough soldiers and weaponry to power the next phase of the fight.\n“We are capable and able to protect our people and we will be doing it,” he told the Associated Press. “We have a plan and we are sticking to that plan.”\nDEFENSIVE SHIFT\nThe limited momentum Ukraine's forces had during their summertime counteroffensive has slowed — from the forests in the northeast, to the urban centers in the east, to the slushy farmland in the south.\nWith Russia hoping to take the initiative this winter, Ukraine is mainly focused on standing its ground, according to interviews with a half dozen military commanders along the vast front line.\nDespite wet, muddy ground that makes it harder to move tanks and other heavy weaponry around, the Russian army has bolstered its forces in the eastern Donetsk region, where it has recently stepped up offensive maneuvers.\n“The main goal for the winter is to lose as few people as possible,” said Parker, the Ukrainian commander of a mechanized battalion near Bakhmut who asked to go by his battlefield name to speak freely. Bakhmut is a city in eastern Ukraine that Russian forces took after months of heavy fighting.\n“We have to be clear,\" Parker said. \"It’s not possible in the winter to liberate Donetsk or Bakhmut, because they have too many (fighters).”\nAnalysts say Ukraine may even be forced to cede patches of previously reclaimed territory this winter, though Russia is likely to pay a heavy price.\n“If Russia keeps on attacking, the most likely outcome is that they’ll make some very marginal territorial gains, but suffer enormous casualties in doing so,” said Ben Barry, a senior fellow at the International Institute for Strategic Studies in London.\nDRONES AND MEN\nSome Ukrainian commanders across the front line say they lack the fighters and firepower needed to keep Russia's seemingly endless waves of infantrymen at arm's length as they fortify defenses to protect soldiers. That places ever more importance on attack drones — a weapon, they say, that Russia is currently better equipped with.\nIndeed, while Ukrainian soldiers have proven to be resourceful and innovative on the battlefield, Moscow has dramatically scaled up its defense industry in the past year, manufacturing armored vehicles and artillery rounds at a pace Ukraine cannot match.\n“Yes they’re ahead of us in terms of supply,” said Boxer, the commander in Kherson, who credited Russian drones with having longer range and more advanced software. “It allows the drone to go up 2,000 meters, avoid jammers,” he said, whereas Ukrainian drones “can fly only 500 meters.”\nThis is poses a problem for his troops, who have been limited in their ability to strike Russian targets on the other side of the Dnieper River. To eventually deploy heavy weaponry, such as tanks, Ukraine first needs to push Russian forces back to erect pontoon bridges. Until they get more drones, this won’t be possible, said Boxer.\n“We wait for weapons we were supposed to receive months ago,” he said.\nTo sustain the fight, Ukraine will also have to mobilize more men.\nIn the northeastern cities of Kupiansk and Lyman, Russian forces have deployed a large force with the goal of recapturing lost territory.\n“They are simply weakening our positions and strongholds, injuring our soldiers, thereby forcing them to leave the battlefield,” said Dolphin, a commander in the northeast who would only be quoted using his battlefield name.\nDolphin says he has been unable to sufficiently re-staff. \"I can say for my unit, we are prepared 60%,” he said.", "source_domain": "www.independent.co.uk", "text": null, "title": "A gloomy mood hangs over Ukraine's soldiers as war with Russia grinds on", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-russia-boxer-kherson-b2465737.html"}