{"authors": ["Dahlia Scheindlin"], "date_download": "2024-02-05 15:25:20", "date_modify": "None", "date_publish": "2023-12-18 13:34:39", "description": "Israelis and Palestinians are joined at the heart of this mess, says Dahlia Scheindlin, a political analyst in Tel Aviv", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F18%2Fthree-hostages-mistake-benjamin-netanyahu-israelis-palestinians.json", "image_url": "https://i.guim.co.uk/img/media/92c859b1657645bd02a7b84b59443310c45ac384/0_200_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=56c7380137d38d3df1b636561944577b", "language": "en", "localpath": null, "maintext": "From 7 October onward, Israelis have clung to the one hope that unified this normally fractious and now broken society: freeing the hostages held by Hamas in Gaza. The faces of those stolen people haunt us on every street. Hope soared when nearly half of the hostages were released in a temporary ceasefire deal last month, and Israelis took to the streets demanding more.\nThen on Friday, three hostages who had survived 70 days in violent, wartime captivity in Gaza somehow got loose, only for Israeli forces to mistake them as a threat – and shoot them dead. They were shirtless and holding a white flag. Collective misery flowed. Demonstrators stalked the streets of Tel Aviv at midnight, clamouring for a new hostage-release deal, and thousands poured out on Saturday evening, shouting the clipped, almost primal cry, “Now!”\nBut Israel’s government is hardly rushing to cut another such deal. The first one forced painful concessions: Israel released hundreds of Palestinian prisoners, which encourages further hostage-taking; such deals can include dangerous prisoners, and the whole situation left some Israeli families elated as their loved ones returned, while others remain in agony. But if last month Israel faced a terrible double-bind between hostage release and its consequences, the incident on Friday symbolised something else: not a wrenching choice, but the inevitability of the worst possible outcomes.\nNetanyahu’s press conferences are an increasingly grotesque spectacle these days, given his apparent lack of remorse or sense of responsibility. Nevertheless, he got one thing right on Saturday evening: since the tragedy, he said, he could not stop turning over the tiny hypotheticals that could have saved the hostages’ lives. I, too, had spent Saturday with frantic thoughts, such as imagining a split-second question that soldiers can shout when in doubt, that only Israelis would know how to answer – some trivia about local pop culture, or a nickname of a minister. This is what the situation has reduced us to – citizens casting about for tricks when neither the government nor the army can protect us. One must also consider the battlefield where the hostages were killed: Israeli media has reported on claims by the Israel Defense Forces (IDF) that Hamas has laid traps with dolls disguised as babies, with hidden speakers playing crying sounds or pleading in Hebrew, to draw soldiers towards an ambush.\nView image in fullscreen Mourners at the funeral of Alon Shamriz, who was mistakenly killed by the IDF last Friday, at Shefayim kibbutz, Israel, on 17 December 2023. Photograph: Oren Ziv/AFP/Getty Images\nThe IDF chief of staff has sternly admonished soldiers since Friday that, according to the rules of engagement, shirtless people surrendering with white flags, like the hostages (who also called in Hebrew to be saved), should not be killed. But it’s also true that Israeli soldiers have been shooting Palestinians for years with little or no punishment – whether it’s an autistic man in East Jerusalem or an incapacitated Palestinian attacker already immobilised on the ground. Just two weeks ago, a Jewish Israeli who intervened in a terror attack in Jerusalem was shot dead by IDF soldiers. The one-way road to Friday’s nightmare was paved by the de facto indulgence of shoot-first policies. The idea that these unacceptable practices would be targeted only at Palestinians – as if the two populations are not joined at the heart of this mess – is a lie.\nOf course, it was Hamas that lured Israel into the current trap of this filthy war. Blinded by pain, rage and humiliation, Israel only followed one path: overwhelming force. If there were other options, like the targeted, restrained response that Thomas Friedman advocated in the early weeks of the war, Israel’s leaders didn’t seem to consider them. The outcome is incomprehensible death, misery and destruction in Gaza, mistakes, like shooting the hostages, that can that can never be undone.\nWhat of the future? A few weeks into the war, analysts and pundits like me scrambled to imagine “day after” plans to make things better, for Palestinians and for Israelis – for the long term, too. Many ideas have been floated, but Netanyahu quickly rejected most of them. He won’t allow Hamas to remain in power, and who can argue with that? He won’t allow Fatah, because “Hamastan” and “Fatahstan” are just the same, he insists, as if infantile campaign slogans can solve this horror. There will be no international presence, no other party involved in overseeing security. No Palestinian state. Israel’s leadership is not choosing between paths – it has only one road: a long war followed by Israeli security control and no Palestinian political leadership in Gaza. The result will be governance by gangs: Mogadishu on the Mediterranean.\nHamas holds a special place in the history of horrible leaders. In the blood-soaked story of this conflict, the abuse it has wreaked on its own people has neither precedent nor excuse. Palestinians may well conclude, as Hussein Ibish at the Arab Gulf States Institute in Washington has argued, that they should never forgive Hamas.\nAll the alternatives have been slammed shut. And as an Israeli analyst, I’m always being asked for answers – but I have none. It’s not for lack of trying and not for lack of ideas; my devoted peace-oriented Israeli and Palestinian colleagues in civil society, journalism and academia, as well as street and field activists, and even those in politics, have been racking our brains for decades. But for 15 years or so, nobody in power wants to hear them.\nFor now, I think of those three hostages in Gaza who hung tattered sheets out of the window of the building they were in, stained with food to form the words “SOS”. Maybe, eventually, someone will listen.", "source_domain": "www.theguardian.com", "text": null, "title": "Three hostages killed by mistake: Netanyahu’s shoot-first policies are harming all of us", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/18/three-hostages-mistake-benjamin-netanyahu-israelis-palestinians"}