{"authors": ["Elena Salvoni"], "date_download": "2024-02-05 15:25:21", "date_modify": "None", "date_publish": "2023-12-18 09:55:28", "description": "After weeks of exchanging cross-border fire, the Israel Defence Forces are said to be planning an offensive which would aim to push Hezbollah north past the Litani River.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12876149%2FIsrael-new-ground-war-Hezbollah-Gaza-Lebanon.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/18/09/79078901-0-image-a-17_1702893261773.jpg", "language": "en", "localpath": null, "maintext": "Israel is planning to invade Lebanon to push Hezbollah back from its northern border, according to reports, amid a barrage of rocket attacks since the war in Gaza broke out and fears that the terror group is 'worse than Hamas'.\nAfter weeks of exchanging cross-border fire, the Israel Defence Forces (IDF) are said to be keen to launch a ground offensive into southern Lebanon which would aim to push the terror group north past the Litani River.\nMilitary and government officials in Israel have said they are determined to prevent a repeat of the October 7 invasion from Gaza, with warnings that the scale of a Hezbollah raid could be even more deadly than the massacre of 1,200 people.\n'What happened in the south is nothing compared to what they could do here,' a senior Israeli officer told The Times. 'Israeli doctrine is to take the war to the other side.'\nIt comes as Israel's war in Gaza rumbles on, with fresh attacks throughout the night across the besieged Strip including a strike on the Jabalia refugee camp in the north which killed 90 Palestinians, Gaza's health ministry spokesperson said.\nBlack smoke rises from an Israeli airstrike on the outskirts of Aita al-Shaab, a Lebanese border village with Israel in south Lebanon, Monday, Nov. 13, 2023\nHezbollah leader Sayyed Hassan Nasrallah\nsraeli Merkava tanks take part in a military drill near the border with Lebanon in the upper Galilee region of northern Israel on October 24, 2023\nFears have been mounting that Israel's war on Hamas, which has seen more than 18,800 Palestinians killed in 'indiscriminate' strikes on Gaza, according to the health ministry, could spiral into a regional conflict.\nFunded by Iran, Hezbollah has been building its military strength over years, stockpiling a huge arsenal of some 100,000 rockets which could 'overwhelm' Israel's Iron Dome defence system.\nThe border tensions have ramped up over the last 70 days, reviving memories of Hezbollah's devastating 2006 war with Israel that killed more than 1,200 people in Lebanon, mostly civilians, and 160 in Israel, largely soldiers.\nThe conflict ended thanks to a UN ceasefire resolution which agreed that all armed forces, except for UN peacekeepers and the official Lebanese army, would be moved north of the Litani River.\nBut instead, over the years that followed, Hezbollah remained in the south and built up its fortifications near the borders, claiming that it was protecting against the Israeli threat.\nA map showing the Litani River in Lebanon, which a 2006 UN ceasefire resolution agreed non-government forces should be pushed back to\nIsraelis and Lebanese civilians have been killed in constant strikes, with resident living in border communities evacuated en masse in recent weeks.\nThe two sides have continued to exchange threats, with Hezbollah leader Hassan Nasrallah repeatedly boasted that his group's weapons could reach deep into Israeli territory.\nRear Adm. Daniel Hagari, an Israeli military spokesman, warned that Hezbollah was 'dragging Lebanon into an unnecessary war that would have devastating consequences.'\nBenny Gantz, former Israeli Prime Minister who is serving in Netanyahu's war cabinet, warned: 'If the world doesn't get Hezbollah away from the border, Israel will do it,'\nIsrael and Lebanon's Hezbollah have traded fire along the border nearly every day since the war began, and other Iran-backed militant groups have attacked U.S. targets in Syria and Iraq.\nYemen's Iran-aligned Houthi rebels have attacked ships in the Red Sea with missiles and drones, portraying it as a blockade of Israel.\nA strike on what Israel Defense Forces say is a Hezbollah target in a location given as Lebanon\nLebanon's Hezbollah supporters gather to attend a ceremony to honour fighters killed in the recent escalation with Israel last month\nNearly 300 Palestinians have been killed in the Israeli-occupied West Bank since the start of the war, and this has been the deadliest year for Palestinians there since 2005.\nMost have been killed during Israeli military raids, which often ignite gunbattles, or during violent demonstrations.\nU.S. defense leaders are hoping to prevent the risk of wider regional conflict, both through a sustained high level of U.S. military presence and by urging Israel to scale back operations.\nPresident Joe Biden has warned that Israel is losing international support because of its 'indiscriminate bombing.'\nIsraeli Defense Minister Yoav Gallant said last week that his country would continue major combat operations against Hamas for several more months.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel 'is planning a new ground war against Hezbollah after Gaza campaign' with officials warning October 7 massacre would be 'nothing compared' to a terror attack from the north", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12876149/Israel-new-ground-war-Hezbollah-Gaza-Lebanon.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}