{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:25:23", "date_modify": "None", "date_publish": "2023-12-18 07:20:17", "description": "The Secure Community Network, which monitors antisemitic threats and liaises with law enforcement, reported 199 'swatting' incidents across the U.S. on Saturday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12875823%2Fswatting-jewish-site-synagogue-bomb-threat-hoax.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/18/07/79075691-0-image-m-53_1702883819372.jpg", "language": "en", "localpath": null, "maintext": "Jewish sites across the United States reported 199 'swatting' incidents in 24 hours, a security consultancy said on Saturday, highlighting the surge in hoaxes and terrifying rhetoric since the October 7 Hamas attack.\nThe Secure Community Network, which monitors antisemitic threats and liaises with law enforcement, said the surge in swatting - prank calls made to emergency services, in an attempt to send a large number of armed police officers to a site - and bomb threats was deeply troubling.\nMichael Masters, CEO of the network, said it was wrong to see the bomb threat hoaxes and fake emergency calls as harmless jokes, because they heaped trauma upon trauma, and can cause actual injury.\n'The alarming volume of swatting incidents and false bomb threats being carried out across the country is a major concern for the safety and security of the Jewish community in North America, as well as law enforcement,' Masters said.\nThe stunning one-day total comes as 2023 has seen a massive 541 percent jump in similar hoaxes compared to this time last year.\nA member of the New York Police Department patrols in front of the synagogue Congregation Bais Yaakov Nechamia Dsatmar on October 13 in Williamsburg, Brooklyn. The Secure Community Network, which monitors antisemitic threats and liaises with law enforcement, said the surge in swatting since the October 7 Hamas attack on Israel\nHoboken police stand watch outside a synagogue in their New Jersey city. A group says there were 199 'swatting' reporters against Jewish facilities in a single day\n'SCN, community partners, law enforcement, and public safety agencies take these incidents seriously and are working hard to address them,' Masters continued.\n'It's critical to recognize that these are not victimless crimes or innocent pranks: they can have real – and even deadly – consequences.'\nThe network said the 199 reported incidents included 93 in California, 62 in Arizona, 15 in Connecticut, five in Colorado and four in Washington state.\nThe group has recorded a 541 percent increase in swatting, and a 290 percent increase in antisemitic incidents, including vandalism, harassment and assault.\nIn October and November alone, the network has referred 230 individuals to law enforcement, the group said.\nOn December 12, police in California arrested a minor accused of swatting synagogues in Tustin and Fullerton.\nThe suspect is accused of creating an online 'swatting ring,' which brought together fellow extremists and in July and August called in bomb threats at Jewish facilities in California and across the country, including at least 25 synagogues in 13 states.\n'The false swatting threats made in this case drained law enforcement resources and caused a negative financial impact on local communities,' the FBI said in a statement announcing the juvenile's arrest.\n'Evidence has shown that making false threats can cause significant distress to victims and can cause physical injury to first responders or other victims.'\nA bomb threat sent to a synagogue in Newtown Township, Pennsylvania, on Thursday led to the evacuation of the congregation's Jewish day school, disrupting classes for the youngsters at the Shir Ami synagogue.\nOn Saturday, a Boulder, Colorado, synagogue evacuated its Shabbat morning services due to a bomb threat, while a congregation in western Massachusetts canceled its Sunday religious school.\nThe Shir Ami synagogue in Pennsylvania was evacuated on Thursday after a bomb threat\nThis morning during Shabbat religious services — the Jewish day of rest — we had to evacuate my synagogue in Montgomery, AL due to a bomb threat. This is exhausting. I pray for the day that we can worship and live in peace. pic.twitter.com/qjzvvzmqYe — Phillip Ensler (@EnslerPhillip) December 16, 2023\nOn Sunday morning, a synagogue in Maine, the South Portland Congregation Bet Ha'am, was evacuated and searched by police after a bomb threat was emailed to the organization.\nThe arrests do not appear to be blunting the threats.\n'Unfortunately, there is reason to believe that this nationwide trend will continue in the foreseeable future,' the Jewish Federation of Northern New Jersey told community members in an email on Sunday afternoon.\nThey said there had been at least five threats in the area.\nIn Alabama, the state's only Jewish lawmaker, Philip Ensler, posted a video to social media showing the moment that the Torah reading at his synagogue was interrupted and everyone in attendance was ushered outside.\n'This is exhausting,' he tweeted. 'I pray for the day that we can worship and live in peace.'\nA member of the New York Police Department patrols in front of a synagogue on October 13, 2023\nOn Sunday morning, a synagogue in Maine, the South Portland Congregation Bet Ha'am, was evacuated and searched by police after a bomb threat was emailed to the organization\nLast month, the CEO of the Anti-Defamation League said in an appearance on MSNBC that anti-Semitism has increased by a staggering 388 percent since Hamas' barbaric assault on Israel that began on October 7.\nJonathan Greenblatt, who is also the director of the advocacy group, told The Sunday Show that his group has seen attacks on everyday businesses that are run by Jewish people, in addition to attacks on individuals and places of worship.\n'I'm not talking about stores producing IDF [Israel Defense Forces] T-shirts; I'm talking about a coffee shop on Long Island, an ice cream parlor in the Bay Area, a restaurant in Chicago,' he said.\n'Antisemitism has been intensifying and increasing. We've seen it normalized, and from the far-right and from the hard left,' Greenblatt added.\nGreenblatt also raised the issue of the spate of anti-Semitic incidents that have taken place on campuses of Ivy-league colleges including Harvard and Cornell.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "American Jews face 199 swatting and bomb threats across 14 states in a SINGLE day - as 2023 sees 541% spike in threats against synagogues", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12875823/swatting-jewish-site-synagogue-bomb-threat-hoax.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}