{"authors": ["Kathleen Livingstone"], "date_download": "2024-02-05 15:15:20", "date_modify": "None", "date_publish": "2024-01-27 03:07:41", "description": "AMERICAN forces have destroyed an anti-ship missile from Houthi rebels that posed an \"imminent threat\" to US Navy ships in the Red Sea.The attack in Y", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25540355%2Fus-blitz-houthi-rebels-anti-ship-missile-yemen%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/KS-houthi-strike-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "US officials said they launched the strike in 'self-defense'\nBACKFIRE US blitz Iran-backed Houthi rebels’ anti-ship missile in Yemen as it posed ‘imminent threat’ to Navy ships in Red Sea\nAMERICAN forces have destroyed an anti-ship missile from Houthi rebels that posed an \"imminent threat\" to US Navy ships in the Red Sea.\nThe attack in Yemen by US forces was launched at 3:45 am local time on Saturday.\n3 U.S. forces shot down a missile heading towards a warship in the Red Sea fired by Houthi rebels in Yemen on Friday Credit: AP\n3 Houthi rebels targeted the destroyer USS Carney on Friday, marking the first attack on an American warship since tensions began escalating last October (USS Carney, December 6, 2023) Credit: Getty Images\nUS Central Command said the anti-ship missile had been \"aimed into the Red Sea\" and was \"prepared to launch.\"\nWhen US Forces identified it \"in Houthi-controlled areas of Yemen\" they found it \"presented an imminent threat to merchant vessels and the U.S. Navy ships in the region.\"\n\"US Forces subsequently struck and destroyed the missile in self-defense,\" US Central Command said in a statement.\n\"This action will protect freedom of navigation and make international waters safer and more secure for U.S. Navy vessels and merchant vessels.\"\nThe US Navy is currently facing the biggest conflict it has seen at sea in the Middle East in decades.\nEarlier on Friday, Houthi rebels launched a missile at a US warship patrolling the Gulf of Aden.\nThe incident was the first time that the Houthi rebels have targeted a warship since hostilities heated up over trade in October, according to AP News.\nBrad Bowman, a senior director at the Foundation for the Defense of Democracies, said of the attack: “They’re now finally calling a spade a spade, and saying that, yeah, they’re trying to attack our forces, they’re trying to kill us.\"\nThe same day, a 'British' oil tanker — the Marlin Luanda — also came under fire.\nYahya Sarea, a Brigadier General of the Yemeni Armed Forces, said the rebels used “a number of appropriate naval missiles\" in the destructive blast they say was on a British ship.\n\"Yemeni naval forces carried out a targeting operation on the British oil ship in the Gulf of Aden using a number of appropriate naval missiles, the strike was direct and resulted in the burning of the vessel,\" he said.\nThe British military later acknowledged that a vessel had been struck by a missile and was on fire in the Gulf of Aden.\nThe Yemeni general continued noting the strike happened \"in vindication of the oppressed Palestinian people and in support and solidarity with our brothers in the Gaza Strip\".\nHe then called for a ceasefire in Gaza and asked for food and medicine to be allowed in to help Palestinian civilians.\nThe British Marlin Luanda was hit by an anti-ship ballistic missile fired from Yemen, an American military official confirmed to AP.\nAnother anti-ship ballistic missile was shot down when it neared the USS Carney.\nHouthi rebels have repeatedly targeted ships in the Red Sea since November, saying they were avenging Israel’s offensive in Gaza against Hamas.\nThe Iran-backed militants based in Yemen have been linked to Iran's Hezbollah terrorist group by American, British, and other intelligence agencies.\nAmerican forces now say they are taking more proactive steps to prevent further conflicts with rebels in the region.", "source_domain": "www.thesun.co.uk", "text": null, "title": "US blitz Iran-backed Houthi rebels' anti-ship missile in Yemen as it posed 'imminent threat' to Navy ships in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25540355/us-blitz-houthi-rebels-anti-ship-missile-yemen/"}