{"authors": ["Elena Salvoni"], "date_download": "2024-02-05 15:25:25", "date_modify": "None", "date_publish": "2023-12-17 10:39:10", "description": "The IDF shared footage of one of its battalions pushing further into Khan Younis, which it said showed them storming houses, a commander's offices and engaging Hamas fighters.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12873643%2FIsraeli-soldier-grenade-tunnel-Hamas-Gaza.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/17/13/79055727-0-image-a-12_1702821265191.jpg", "language": "en", "localpath": null, "maintext": "Israeli troops claim to have captured holiday homes belonging to numerous Hamas leaders, including a property that the terror group's chief in Gaza, Yahya Sinwar, vacations in.\nDubbed 'Gaza's Bin Laden', Sinwar was elected leader of Hamas in Gaza in 2017, and is considered to be one of the masterminds behind the bloody October 7 attacks.\nHe was raised in Khan Younis and is believed to have had multiple properties in the southern city, which Israel's forces have been increasingly focusing on as their offensive shifts south.\nThe Israeli Defence Forces shared footage of one of its battalions pushing further into the city, which it said showed them storming houses, a commander's offices and engaging Hamas fighters in gun battles as they go.\nIsrael has said in recent days that it is inching closer to uncovering Sinwar's whereabouts, with a senior US official this week warning the Hamas boss that 'his days are numbered'.\nDramatic video shows IDF soldiers pushing further into the southern city of Khan Younis in Gaza\nSmoke billows over Khan Yunis in the southern Gaza strip during Israeli bombardment on December 17, 2023\nThe Israeli troops operating in Khan Younis this weekend uncovered some 30 Hamas tunnels, the IDF said\nYahya Sinwar was elected leader of Hamas in Gaza in 2017, and is considered to be one of the masterminds behind the bloody October 7 attacks\nBefore that, Israel revealed that its troops had surrounded Sinwar's Khan Younis home, saying: 'His house may not be his fortress and he can escape but it's only a matter of time before we get him.'\nHamas's Gaza chief has been in hiding ever since, and while there was no indication of whether he was in his Khan Younis home, Israel has called him 'a dead man walking'.\nDuring the search for Hamas leaders who Israel has vowed to root out, the IDF said it also found weapons stockpiles, useful intelligence, and uncovered some 30 tunnel shafts including in Hamas leaders' properties.\nColonel Elad Tzuri, whose brigade is battling Hamas in the Khan Younis area, said: 'We found weapons, tunnels inside vacation homes of senior Hamas officials. We see a lot of tunnel shafts here, still encountering the enemy but gaining operational control of the area.'\nIt comes after the IDF released dramatic bodycam footage showing the moment an Israeli soldier throws a hand grenade down a tunnel shaft as he comes face-to-face with Hamas fighters in the north of the Gaza Strip.\nBitter fighting continues between Israel's Defence Forces and Hamas despite growing international and domestic pressure to scale back the offensive in the besieged enclave.\nIn a still from a video released by the IDF of the operation in Khan Younis, an Israeli soldier is seen in a tank\nSmoke pours out of a bombed building in the southern city of Khan Younis\nBodycam footage shows Israeli troops in action in the field during an operation which saw them storm Hamas leaders' holiday homes\nIsrael's air and ground assault has seen it target some 200 targets in the past day, including several apartments used by Hamas in the Gaza City suburb of Shejaiya, where it said paratroopers found stockpiles of weapons.\nDuring its operations in the area, a soldier in the IDF's 188th Brigade filmed himself tentatively approaching a tunnel shaft before a terrorist breaks cover to shoot at him and his comrades from inside.\nThey start to return fire before the soldier tells the others to hold off as he pulls the pin on a grenade, throwing it into the tunnel. The IDF said the close-quarters combat was successful and that its troops 'neutralized the terrorist and destroyed the tunnel shaft.'\nThe soldier recording the bodycam footage tells the others to hold fire as he pulls the pin on a grenade\nIsraeli soldiers walk around what the army says is the entrance to a tunnel shaft in which a Hamas fighter is hiding and firing from\nSmoke pours out of the shaft as the two sides exchange fire before an Israeli soldier throws a grenade into the tunnel\nIsrael is pressing ahead with its offensive today after it emerged yesterday that three hostages were killed by IDF troops. The men, all in there 20s, were shirtless and waving a white flag.\nThe incident has raised questions about its conduct in a 10-week-old war that has brought unprecedented death and destruction to the coastal enclave.\nNaama Weinberg, whose cousin Itai remains in captivity, shared her concerns about the safety of the remaining hostages.\n'We don't need dead bodies. We need people alive,' she told the BBC.\nInjured Palestinians, including children, are brought to Nasser Hospital to receive medical treatment following Israeli attacks in Khan Younis\nA wounded boy yells out in pain as he is treated following Israeli attacks on the southern city of Khan Younis\nProtests in Israel continue as loved ones of those still being held captive say the only way to bring them home is through a deal with Hamas.\nIsrael is thought be in negotiations to get hostages returned, with talks reportedly being brokered by Qatar and Egypt, following a temporary ceasefire last month, which saw dozens freed.\nBut Benjamin Netanyahu has been firm that Israel must continue to apply military pressure on Hamas, vowing that his country will continue the war 'until absolute victory'.\nAt a press conference last night, he spoke about Israel remaining 'relentless' in its military and diplomatic efforts 'to bring back all the hostages home safely.'\nIsraeli Prime Minister Benjamin Netanyahu chairs a cabinet meeting at the Kirya, which houses the Israeli Ministry of Defence in Tel Aviv, Israel on December 17\nSmoke rises following an Israeli bombardment in the Gaza Strip, as seen from southern Israel, Saturday, December 16\nIsraeli soldiers on top of a pile of rubble as they operate in the Gaza Strip amid a major ground offensive\nAn Israeli soldier looks on from Merkava tank during operations in the Gaza Strip\nCivil defense teams carry out search and rescue operations under debris of destroyed buildings after Israeli airstrike in Rafah, southern Gaza on December 17\nGaza remained under a communications blackout for a fourth straight day - the longest of several outages over the course of the war, which aid groups say complicate rescue efforts after bombings and make it even more difficult to monitor the war's toll on civilians.\nThe situation is becoming increasingly desperate for hospitals struggling to get supplies amid an overwhelming flow of casualties.\nThe emergency department at Al-Shifa hospital in northern Gaza, devastated by Israeli bombardments, is 'a bloodbath' and 'in need of resuscitation', the World Health Organization said today .\nAs the civilian death toll mounts, Israel has come under significant pressure to scale back major combat operations, with France today calling for an 'immediate and durable' truce.\nAnd in a landmark change in the UK Government's stance towards the conflict in Gaza, the Foreign Secretary David Cameron has called for a 'sustainable ceasefire' between Israel and Hamas.\nLord Cameron published a piece in The Sunday Times today along with German foreign minister Annalena Baerbock saying they 'share the view that this conflict cannot drag on and on'.\nA Palestinian child looks on at the site of an Israeli strike on a house in Rafah in the southern Gaza Strip\nA heartbreaking picture shows small children, looking on distraught at the site of an Israeli strike on a house in Rafah\nPalestinians inspect the site of an Israeli strike on a house, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah in the southern Gaza Strip\nThe pair advocated for an 'end the endless cycle of violence', but stated they were not calling for an 'immediate' ceasefire.\nThe pressure could be piled on further when U.S. Defense Secretary Lloyd Austin visits this week.\nWashington expressing growing unease with civilian casualties and the mass displacement of 1.9 million Palestinians - nearly 85 per cent of Gaza's population - even as it has provided vital military and diplomatic support to its close ally.\nThe air and ground war has flattened vast swathes of northern Gaza and driven most of the population to the southern part of the besieged territory, where many are packed into crowded shelters and tent camps.\nForeign Secretary David Cameron has called for a 'sustainable ceasefire' between Israel and Hamas\nIsrael has continued to strike what it says are militant targets in all parts of Gaza.\nIts onslaught has killed at least 18,800 people, mostly women and children, according to the territory's Hamas government.\nDespite the growing international pressure, Israel has vowed to continue operations until it dismantles Hamas, which triggered the war with its October 7 attack into southern Israel, in which militants killed 1,200 people, mostly civilians.\nIsraeli soldiers walk over tank tracks on a beach in the Gaza Strip as they continue operations\nAn Israeli military vehicle drives down a road as it retreats following a raid at the Nur Shams camp for Palestinian refugees near the northern city of Tulkarm in the occupied West Bank on December 17, 2023\nHamas released over 100 of more than 240 hostages captured on Oct. 7 in exchange for the release of Palestinian prisoners during a brief cease-fire in November. Nearly all freed on both sides were women and minors. Israel has successfully rescued one hostage.\nThere is growing pressure on Prime Minister Benjamin Netanyahu to try to reach a new deal with Hamas for the release of at least some of the hostages. More than 120 people remain in captivity.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israeli troops 'capture Hamas holiday homes': Moment IDF forces raid properties owned by 'Gaza's Bin Laden' and fellow terror chiefs behind Oct 7 massacre", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12873643/Israeli-soldier-grenade-tunnel-Hamas-Gaza.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}