{"authors": ["Matt Strudwick"], "date_download": "2024-02-05 15:25:26", "date_modify": "None", "date_publish": "2023-12-17 17:46:46", "description": "The 26-year-old computer engineering student was one of three Israelis killed this week by his country's soldiers sparking angry demonstrations on the streets in Tel Aviv.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12874211%2Ffuneral-israeli-man-held-hamas-mistakenly-shot-idf.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/17/17/79058859-0-image-m-23_1702835132269.jpg", "language": "en", "localpath": null, "maintext": "Hundreds of mourners have today attended the funeral of Israeli man Alon Lulu Shamriz who was held hostage by Hamas before being mistakenly shot by IDF forces.\nThe 26-year-old computer engineering student was one of three Israelis killed this week by his own country's soldiers sparking angry demonstrations on the streets in Tel Aviv.\nToday Shamriz, of Kibbutz Kfar Aza, was buried at Shefayim, where his mother Dikla emotionally told how he had 'survived 70 days in hell' after being being snatched by the terrorist group on October 7.\nIsrael Defense Forces admitted earlier this week they had accidentally killed Shamriz, Yotam Haim, 28, and Samer Fouad Talalka, 22, in Gaza after mistaking them as a 'threat' during their ongoing ground invasion.\nThey had escaped capture and were shirtless, waving white flags, and speaking Hebrew as they walked towards Israeli soldiers.\nAlon Lulu Shamriz, 26, a computer engineering student, was one of three Israelis killed this week by his country's soldiers sparking angry demonstrations on the streets in Tel Aviv\nShamriz, of Kibbutz Kfar Aza, was buried at Shefayim, where his mother Dikla emotionally told how he had 'survived 70 days in hell' after being being snatched on October 7\nPictures taken at the funeral showed an outpouring of grief as Shamriz's tearful brother Ido was seen bent over with his head in his hands as he is comforted by another mourner.\nOthers show a man holding his heartbroken elderly grandmother in a wheelchair who is hooked up to an oxygen tank.\nREAD MORE: Families of civilians kidnapped by Hamas stage demo after army admitted killing three it mistook for terrorists in Gaza fighting Advertisement\n'Those who abandoned you also murdered you after all that you did right,' Shamriz' brother Ido said at the funeral, reported Times of Israel.\nShamriz's mother Dikla said in her eulogy: 'You survived 70 days in hell. Another moment and you would have been in my arms.\n'We will continue to live for you.'\nIsraeli media reported that Talalka was buried yesterday, while the funeral for Haim was scheduled to take place tomorrow.\nThe deaths of the three men sparked protests in Tel Aviv as demonstrators demanded that the authorities offer a new plan for bringing home the remaining hostages held in the Gaza Strip.\nMilitary spokesman Richard Hecht said the deaths were being investigated and what the soldiers did was 'violation of the rules of engagement'.\nA person looks on as friends and family mourn Shamriz. The deaths of the three men sparked protests in Tel Aviv as demonstrators demanded that the authorities offer a new plan for bringing home the remaining hostages\nThere was an outpouring of grief at the funeral as Shamriz's tearful brother Ido (pictured) was seen bent over with his head in his hands as he is comforted by another mourner\nDikla (centre) and Avi (left), mother and father of Shamriz. Dikla gave a eulogy at the service where she said 'another moment and you would have been in my arms'\nA man holds onto Shamriz's heartbroken elderly grandmother, seen in a wheelchair hooked up to an oxygen tank\nA tearful mourner looked at the floral tributes in memory of Shamriz. Military spokesman Richard Hecht said the deaths were being investigated and what the soldiers did was 'violation of the rules of engagement'\nSamer Fouad Al-Talalka, who was killed by the IDF during fighting near Gaza City today\nYotam Haim, who was killed by the IDF in fighting in the northern Gaza Strip\nThe army's chief spokesman, Rear Adm. Daniel Hagari, said Israeli troops found the hostages and erroneously identified them as a threat.\nHe said it was not clear if they had escaped their captors or been abandoned.\nThe IDF expressed its 'deep remorse over the tragic incident' in a statement and sais it had launched an immediate investigation.\nIDF Spokesman Rear Adm. Hagari said: 'This is a tragic incident, the IDF bears responsibility. This is an area where the soldiers encountered many terrorists, including suicide bombers.'\nThe deaths occurred in the (northern) Gaza City area of Shijaiyah, where troops have engaged in fierce battles against Hamas in recent days.\nThe Israeli military said it will be 'reviewing the incident immediately' adding that 'immediate lessons' have also been learnt.\nThe force said it's mission remains to 'locate the missing and return all hostages home'.\nRelatives and supporters of hostages held by Palestinian militants demonstrate outside the Israeli ministry of defence in Tel Aviv on December 15, 2023\nAn Israeli flag is covered in red paint as relatives of hostages held by Palestinian militants demonstrate outside the Israeli ministry of defence in Tel Aviv on December 15, 2023\nPeople use bullhorns as they protest following an announcement by Israel's military that they had mistakenly killed three Israeli hostages, in Tel Aviv, Israel, December 15, 2023\nSome 250 people were taken hostage when Hamas militants attacked southern Israel on October 7, killing about 1,140 people, mostly civilians, according to updated Israeli figures.\nVowing to destroy Hamas and bring back the hostages, Israel launched a massive military offensive against the Palestinian Islamist movement which has left much of the Gaza Strip in ruins.\nThe territory's Hamas government says the war has killed at least 18,800 people, mostly women and children.\nAt least 129 hostages are still held captive in the Gaza Strip.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hundreds attend funeral of Israeli man Alon Lulu Shamriz who was held hostage by Hamas for 70 days before he was mistakenly shot by IDF forces", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12874211/funeral-israeli-man-held-hamas-mistakenly-shot-idf.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}