{"authors": ["Maya Yang", "Tom Ambrose", "Sammy Gecsoyler", "Adam Fulton"], "date_download": "2024-02-05 15:25:34", "date_modify": "None", "date_publish": "2023-12-17 00:46:06", "description": "This blog has now closed. Read our full report on the latest developments here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F16%2Fisrael-gaza-war-live-updates-hamas-hostages-idf-protest-tel-aviv-news-palestine-us-biden-ceasefire-un.json", "image_url": "https://i.guim.co.uk/img/media/976ae3181489a4c78094c5dd9ada0904b06606d5/0_0_2419_1451/master/2419.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=17e7880bc685750976abf1257d36667d", "language": "en", "localpath": null, "maintext": "From 16 Dec 2023 13.07 CET Israeli hostages killed mistakenly in Gaza were holding white flag, official says Peter Beaumont An initial IDF probe into the hostage killing incident suggests all three men were shirtless, with one carrying a makeshift white flag. On seeing them, one Israeli soldier shouted “terrorists!” to the other forces, initiating fire at the men, according to reports. While two hostages were hit immediately and fell to the ground, the third managed to escape into a nearby building where despite pleas in Hebrew, he was also shot and killed, a military official said.\nUpdated at 13.08 CET\n17 Dec 2023 01.12 CET Closing summary It’s now approaching 3 am in Israel and Gaza and we’re closing this live blog. In the meantime you can read our full report on the latest developments here and read all our coverage of the Israel-Gaza conflict here. In the meantime, here is a summary of the main developments: The UK and Germany have called for a “sustainable” ceasefire in the Gaza conflict, warning that “too many civilians have been killed” by Israel in spite of its right to eliminate the threat posed by Hamas . In a significant shift in tone, the UK’s foreign secretary, David Cameron, in a joint article with the German foreign affairs minister, Annalena Baerbock, wrote: “Our goal cannot simply be an end to fighting today. It must be peace lasting for days, years, generations. We therefore support a ceasefire, but only if it is sustainable.\n“There is a prolonged communications blackout across the Gaza strip that started on Thursday night and has continued over the past 48 hours,” the UNRWA said on Saturday. “Once again, Gazans find themselves completely isolated – cut off from their loved ones and from the rest of the world.”\nAl Jazeera has instructed its legal team to refer the case of what it called “the assassination” of its journalist Samer Abudaqa to the International Criminal Court. In a statement released on Saturday, the network said: “In addition to the assassination of Abudaqa by the Israeli occupation forces in the Gaza strip, the legal file will also encompass recurrent attacks on the network’s crews working and operating in the occupied territories through killing or intentionally physical assault constitutes a war crime.”\nIsraeli prime minister Benjamin Netanyahu has vowed to continue Israel’s war in Gaza while mourning the accidental killing of three Israeli hostages by Israeli forces. Speaking at a press conference on Saturday about Yotam Haim, Samar Al Talalka and Alon Shamriz – the three hostages who were killed by Israeli forces – Netanyahu said that their deaths “broke the hearts of the nation” but vowed to “continue until victory”.\nHundreds of protest ers took to the streets in Tel Aviv in anger and frustration over the Israeli government’s handling of the hostage crisis. Many chanted “Deal now!” in calls for a deal to be agreed upon as soon as possible to rescue the remaining hostages.\nA contractor working for the US Agency for International Development in Gaza was killed alongside his wife and two daughters in an Israeli airstrike in November, said his employer. “We are deeply saddened to confirm the tragic loss of our colleague, Hani Jnena (33), along with his family in Gaza, including his wife, Abeer (32), and their two young daughters, Mariam and Zayna, aged 4 and 2,” Reuters reports non-profit organization Global Communities as saying in a statement.\nTwo Palestinian men were killed by Israeli forces in separate incidents in the West Bank on Saturday, Reuters reports the Palestinian health ministry as saying. A 20-year-old man who was identified as Aziz Abdulrahim Elkhlail by the Palestinian news agency WAFA was shot in the abdomen by Israeli forces in the town of Beit Ummar. He later died from his injuries. Another 25-year-old man was killed by Israeli forces in the city of Tulkarm, according to the Palestinian health ministry.\nPhilippe Lazzarini, the chief of the United Nations Relief and Works Agency, has condemned the “smear campaigns that target Palestinians and those who provide aid to them”, saying that he is “horrified”. Speaking to reporters at the Global Refugee Forum, Lazzarini said: “This war is also fought on TV screens and on social media. It’s also a media war. I am horrified at the smear campaigns that target Palestinians and those who provide aid to them.”\nUpdated at 01.46 CET\n16 Dec 2023 00.39 CET The Palestine Red Crescent Society has visited women displaced by Israeli strikes in shelters across Khan Younis in southern Gaza. “During these visits, they provided health awareness services for pregnant women and those who recently gave birth, monitoring them in terms of breastfeeding, and proper nutrition for mothers, as well as measuring blood pressure and sugar levels for those dealing with chronic illnesses,” the PRCS said. The PRCS community work team conducted visits to displaced women in shelters in #KhanYounis.\n📍During these visits, they provided health awareness services for pregnant women🤰and those who recently gave birth, monitoring them in terms of breastfeeding, and proper nutrition for… pic.twitter.com/HOJVlxHJKB — PRCS (@PalestineRCS) December 16, 2023\n16 Dec 2023 23.54 CET “There is a prolonged communications blackout across the Gaza strip that started on Thursday night and has continued over the past 48 hours,” the UNRWA said on Saturday. “Once again, Gazans find themselves completely isolated – cut off from their loved ones and from the rest of the world,” it added. There is a prolonged communications blackout across the📍#GazaStrip that started on Thursday night and has continued over the past 48 hours.\nOnce again, Gazans find themselves completely isolated - cut off from their loved ones and from the rest of the world. pic.twitter.com/Qktp50U1GT — UNRWA (@UNRWA) December 16, 2023 Since 7 October, Gaza has faced multiple total communications blackouts. In November, Human Rights Watch reported: The Israeli authorities’ actions have included damage to core communications infrastructure, cuts to electricity, fuel blockades, and apparently deliberate shutdowns through technical measures … Shortly after the October 7, 2023 attacks, Israeli authorities announced ‘a complete siege’ on Gaza, cutting off electricity and other basic necessities, acts that amount to unlawful collective punishment, a war crime. Lack of electricity puts Palestinian civilians at grave risk and contributes to communication blackouts. Gaza’s sole power plant ran out of fuel on October 11.\nUpdated at 00.03 CET\n16 Dec 2023 23.23 CET Al Jazeera to refer 'the assassination' of its journalist in Gaza to International Criminal Court Al Jazeera has instructed its legal team to refer the case of what it called “the assassination” of its journalist Samer Abudaqa to the International Criminal Court. In a statement released on Saturday, the network said: On Saturday, December 16, 2023, the network established a joint working group, which comprises of its international legal team and international legal experts who will collaboratively initiate the process of compiling a comprehensive file for submission to the court’s prosecutor. In addition to the assassination of Abudaqa by the Israeli occupation forces in the Gaza strip, the legal file will also encompass recurrent attacks on the network’s crews working and operating in the occupied territories through killing or intentionally physical assault constitutes a war crime. Al Jazeera instructs its legal team to urgently refer the case of Samer AbuDaqa’s assassination to the ICC prosecutor.\nThe legal file will also encompass recurrent attacks and incitement against Al Jazeera crews in the occupied Palestinian territories. pic.twitter.com/41F3euDUbj — Anealla (@anealla) December 16, 2023 On Friday, Al Jazeera announced that Abudaqa was killed in an Israeli missile attack earlier that day. The outlet reported that Abudaqa was working alongside its bureau chief, Wael Al-Dahdouh, and that both were reporting at Farhana school in Khan Younis in southern Gaza when they were attacked by Israeli missiles. Al Jazeera reported that Abudaqa was bleeding and trapped in the school for hours. He was unable to be reached by paramedics due to heavy Israeli shelling around the area. Meanwhile, Dahdouh, who was hit by shrapnel on the upper arm, was able to reach Nasser hospital, where he was treated for minor injuries, Al Jazeera reported. Dahdouh, whose wife, son, daughter and grandson were killed in an Israeli airstrike in October, had warned that Abudaqa was “critically injured”. View image in fullscreen People attend the funeral ceremony of Al Jazeera cameraman Samer Abudaqa, who was killed in the Israeli attacks on Khan Younis, Gaza, on 16 December 2023. Photograph: Belal Khaled/Getty Images\nUpdated at 00.02 CET\n16 Dec 2023 22.26 CET Hundreds rally in Tel Aviv over hostage release as Benjamin Netanyahu vows to continue war in Gaza Israeli prime minister Benjamin Netanyahu has vowed to continue Israel’s war in Gaza while mourning the accidental killing of three Israeli hostages by Israeli forces. Speaking at a press conference on Saturday about Yotam Haim, Samar Al Talalka and Alon Shamriz – the three hostages who were killed by Israeli forces – Netanyahu said that their deaths “broke the hearts of the nation” but vowed to “continue until victory”, the Times of Israel reports. “If only something had been different … we were so close to embracing them,” said Netanyahu, adding: “But we can’t turn back the clock … We will learn the lessons.” Following the killings of the three hostages, initial reports have revealed that one of the hostages was carrying a makeshift white flag. Netanyahu said that Israel will continue working on securing the release of the remaining hostages held by Hamas. “Only military pressure” secured the release of hostages during last month’s truce with Hamas, Netanyahu said, the Times of Israel reports. At the same press conference, Israel’s defense minister, Yoav Gallant, said that he takes full responsibility for yesterday’s incident. “This is one of the most tragic incidents I have ever known,” he added. Meanwhile, hundreds of protestors took to the streets in Tel Aviv in anger and frustration over the Israeli government’s handling of the hostage crisis. Many chanted “Deal now!” in calls for a deal to be agreed upon as soon as possible to rescue the remaining hostages. View image in fullscreen People rally for the release of hostages kidnapped during the deadly 7 October attack by Hamas in Tel Aviv, Israel, 16 December 2023. Photograph: Reuters\nUpdated at 23.36 CET\n16 Dec 2023 21.45 CET Unicef said on Saturday that children in Gaza “need an immediate, long-lasting humanitarian ceasefire”, adding that Gaza is the “most dangerous place in the world to be a child”. Gaza is the most dangerous place in the world to be a child.\nEntire neighborhoods, where children used to play and go to school have been turned into stacks of rubble.\nChildren need an immediate, long-lasting humanitarian ceasefire. Now. pic.twitter.com/GfNXCEy3fN — UNICEF (@UNICEF) December 16, 2023 Approximately 8,000 Palestinian children have been killed by Israeli airstrikes in the last two months. Mental health experts in Gaza have routinely said that there is no such thing as post-traumatic stress disorder for children as the trauma across what human rights groups have condemned as an “open-air prison” has remained constant over the last two decades.\nUpdated at 21.46 CET\n16 Dec 2023 21.13 CET Teams from the Palestine Red Crescent Society are working on setting up the Qatari field hospital in Rafah in collaboration with the Qatari Red Crescent Society. The hospital will include 50 beds, an operating room and an intensive care unit. The Palestinian Red Crescent teams continue working on establishing the Qatari field hospital 🇶🇦in #Rafah, in collaboration with the @QRCS, which will provide healthcare services to thousands of displaced individuals in south of #Gaza.\n📍The hospital, expected to resume… pic.twitter.com/vghAtOdAOw — PRCS (@PalestineRCS) December 16, 2023\n16 Dec 2023 20.46 CET USAid contractor killed in Gaza in Israeli airstrike, says employer A contractor working for the US Agency for International Development in Gaza was killed alongside his wife and two daughters in an Israeli airstrike in November, said his employer. Reuters reports: “‘We are deeply saddened to confirm the tragic loss of our colleague, Hani Jnena (33), along with his family in Gaza, including his wife, Abeer (32), and their two young daughters, Mariam and Zayna, aged 4 and 2,’ non-profit organization Global Communities, which partners with governments and private sector entities for humanitarian work, said in a statement. ‘Based on the information currently available to us, the young family was killed on Sunday, November 5, during an Israeli air strike in the Al Sabra neighborhood of Gaza City at the residence of Hani’s in-laws,’ the statement added. The family had recently sought safety there after fleeing air strikes in their own neighborhood of Al Sheikh in Gaza City, Global Communities said, adding his in-laws were killed as well. In his final message, which was sent on Oct. 10, Jnena wrote: ‘My daughters are terrified, and I am trying to keep them calm, but this bombing is terrifying,’ according to the statement from his employer. Jnena was a member of the non-profit’s IT team in Gaza and was known for ‘his kindness and commitment to delivering essential IT services in challenging conditions,’ Global Communities said.\nUpdated at 20.53 CET\n16 Dec 2023 20.21 CET Gaza hunger crisis 'something completely new', says UNRWA chief In a new interview with the New Statesman, UNRWA chief Philippe Lazzarini warned that Gazans “could start dying of hunger” amid a deteriorating humanitarian crisis as a result of Israel’s attacks across the strip. Lazzarini told the outlet: The [UN’s] World Food Programme is extremely worried that we are now going into starvation. What I can tell you is I saw first hand that people are hungry. This is something completely new in Gaza. We never saw it in previous conflicts. People are really talking about hunger. I would not be surprised if people indeed start dying of hunger, or a combination of hunger, disease, weak immunity.\nUpdated at 20.34 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Al Jazeera asks legal team to refer journalist’s killing to ICC - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/16/israel-gaza-war-live-updates-hamas-hostages-idf-protest-tel-aviv-news-palestine-us-biden-ceasefire-un"}