{"authors": [], "date_download": "2024-02-05 15:25:36", "date_modify": "None", "date_publish": "2023-12-17 07:44:29", "description": "Israel is pressing ahead with its Gaza offensive after a series of shootings, including of three hostages who were shirtless and waving a white flag, raised questions about its wartime conduct", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisrael-ap-gaza-hamas-palestinians-b2465456.html.json", "image_url": "https://static.independent.co.uk/2023/12/17/07/Israel_Palestinians_80727.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael pressed ahead with its Gaza offensive on Sunday after a series of shootings, including of three hostages who were shirtless and waving a white flag, raised questions about its conduct in a 10-week-old war that has brought unprecedented death and destruction to the coastal enclave.\nGaza remained under a communications blackout for a fourth straight day — the longest of several outages over the course of the war, which aid groups say complicate rescue efforts after bombings and make it even more difficult to monitor the war's toll on civilians.\nIsrael could come under further pressure to scale back major combat operations when U.S. Defense Secretary Lloyd Austin visits this week. Washington has expressed growing unease with civilian casualties and the mass displacement of 1.9 million Palestinians — nearly 85% of Gaza's population — even as it has provided vital military and diplomatic support to its close ally.\nThe air and ground war has flattened vast swathes of northern Gaza and driven most of the population to the southern part of the besieged territory, where many are packed into crowded shelters and rain-swamped tent camps.\nIsrael has continued to strike what it says are militant targets in all parts of Gaza. It has vowed to continue operations until it dismantles Hamas, which triggered the war with its Oct. 7 attack into southern Israel, in which militants killed 1,200 people, mostly civilians. Israel has also vowed to return the roughly 129 hostages still held in Gaza.\nSHOOTINGS DRAW SCRUTINY\nMilitary officials said Saturday that the three hostages who were mistakenly shot by Israeli troops had tried to signal that they posed no harm. It was Israel's first such acknowledgement of harming hostages in a war that it says is largely aimed at rescuing them.\nThe three hostages, all in their 20s, were killed Friday in the Gaza City area of Shijaiyah, where troops are engaged in fierce fighting with Hamas. An Israeli military official said the soldiers’ behavior was against the army's rules of engagement and was being investigated at the highest level.\nIsrael says it makes every effort to avoid harming civilians and accuses Hamas of using them as human shields. But Palestinians and rights groups have repeatedly accused Israeli forces of recklessly endangering civilians and firing on those who do not threaten them, both in Gaza and the occupied West Bank, which has seen a surge of violence since the start of the war.\nIsrael on Friday said it was opening a military police investigation into the killing of two Palestinians in the West Bank after an Israeli rights group posted videos that appeared to show troops killing the men — one who was incapacitated and the second unarmed — during a raid.\nIn Gaza, Palestinians on several occasions have said Israeli soldiers opened fire as civilians tried to flee to safety. Hamas has claimed other hostages were previously killed by Israeli fire or airstrikes, without presenting evidence.\nThe offensive has killed more than 18,700 Palestinians, the Health Ministry in the Hamas-run territory said Thursday. It has not been able to update the toll since then because of the communications blackout, and has said for weeks that thousands more casualties are buried under the rubble.\nThe ministry does not differentiate between civilian and combatant deaths, but throughout the war has said that most of those killed were women and children.\nThe plight of Palestinian civilians has gotten little attention inside Israel, where many are still deeply traumatized by the Oct. 7 attack and where support for the war remains strong.\nBut anger over the mistaken killing of the hostages is likely to ramp up pressure on Israeli Prime Minister Benjamin Netanyahu's government to renew Qatar-mediated negotiations with Hamas over swapping more of the remaining captives for Palestinians imprisoned in Israel.\nHamas has said there will be no further hostage releases until the war ends, and that it will demand the release of large numbers of Palestinian prisoners, including high-profile militants.\nHamas released over 100 of more than 240 hostages captured on Oct. 7 in exchange for the release of Palestinian prisoners during a brief cease-fire in November. Nearly all freed on both sides were women and minors. Israel has successfully rescued one hostage.\nU.S.-ISRAEL DIVISIONS\nAustin is set to travel to Israel to continue discussions on a timetable for ending the war's most intense phase. Israeli and U.S. officials have spoken of a transition to more targeted strikes aimed at killing Hamas leaders and rescuing hostages, without saying when it would occur.\nIsrael and the U.S. meanwhile remain far apart on who should run Gaza after the war. Washington wants to see a unified Palestinian government in Gaza and the West Bank as a precursor to eventual Palestinian statehood. A two-state solution enjoys broad support by the international community, which views it as the only way to resolve the decades-old conflict.\nThe internationally recognized Palestinian Authority, which is deeply unpopular among Palestinians, has said it would only return to Gaza as part of a comprehensive solution that creates an independent state in the West Bank, Gaza and east Jerusalem, territories Israel seized in the 1967 war.\nNetanyahu's government, which is deeply opposed to Palestinian statehood, has rejected that scenario, saying it will retain open-ended security control over Gaza after defeating Hamas.\nIt is also opposed to any withdrawal from east Jerusalem, which Israel annexed in a move not recognized internationally, or the West Bank, where more than 500,000 Jewish settlers live in scores of growing settlements, and which is home to some 3 million Palestinians. Hamas, which is pledged to Israel's destruction, said the Oct. 7 attack was a response to Israel's actions in all three territories.\nNetanyahu said Saturday that he was “proud to have prevented the establishment of a Palestinian state” during his more than 16 years in power going back to the late 1990s.\n___\nMagdy reported from Cairo.\n___\nFind more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel presses ahead in Gaza as errant killing of captives adds to concern about its wartime conduct", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israel-ap-gaza-hamas-palestinians-b2465456.html"}