{"authors": [], "date_download": "2024-02-05 15:25:39", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "In the aftermath of Hamas’ bloody raid into Israel on Oct. 7, 2023, many Israelis and people around the world equated the newly ultraviolent and aud", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274064894%2Fis-hamas-the-same-as-isis-the-islamic-state-group-no---and-yes.json", "image_url": "https://cdn.bignewsnetwork.com/cvr1702564731.jpg", "language": "en", "localpath": null, "maintext": "In the aftermath of Hamas' bloody raid into Israel on Oct. 7, 2023, many Israelis and people around the world equated the newly ultraviolent and audacious Palestinian militant organization with the world's deadliest terrorist group, ISIS - the Islamic State group in Iraq and Syria.\nIsraeli Prime Minister Benjamin Netanyahu, for example, linked the two groups directly on Oct. 25, 2023, stating: \"Hamas is ISIS and ISIS is Hamas.\" President Joe Biden and Defense Secretary Lloyd Austin made similar comparisons. Secretary of State Antony Blinken said Hamas killing families \"brings to mind the worst of ISIS.\"\nThere are plenty of reasons for Israel to want the world to think Hamas is ISIS - including the hope of marshaling the sort of overseas support that led to the 2014 creation of the 86-member Global Coalition to Defeat ISIS. In fighting between 2014 and 2019, the coalition reclaimed all the territory the Islamic State group had seized in Iraq and Syria.\nAnd it is true that the Oct. 7 attack displayed tactics that are remarkably similar to those of the Islamic State group. But as a scholar of ISIS specifically, and Middle Eastern militants in general, I am inclined to agree with those who say the comparison between the two terrorist groups overlooks their underlying differences. The similarities are on the surface, in methods and tactics - but their goals and ideologies remain vastly different.\nFundamental differences\nAs various news articles have pointed out, the Islamic State is a Sunni group militantly opposed to the Shia branch of Islam and calls Shiites \"rafida,\" which means \"rejecter of Allah.\" While it is true that most Palestinians in Gaza are Sunni, Shia-led Iran is Hamas' primary benefactor.\nAnd Hamas and ISIS have even met in battle. Bloody clashes between ISIS and Hamas in 2015 resulted from efforts by Islamic State supporters to establish ISIS affiliates in the Hamas-dominated Gaza Strip and the neighboring Sinai Peninsula.\nIn January 2018, leaders of the Islamic State group in the Sinai declared war on the \"Hamas tyrants\" via a lengthy online video that included the execution of a Hamas member.\nThe two groups' differences also include their divergent goals. The Islamic State group aims to create a global theocracy based on the principles of fundamentalist Sunni Islam, with no national or territorial borders.\nHamas, by contrast, is narrowly focused on constructing a Palestinian national state by \"armed resistance to the occupation\" of the Palestinian territories by Israel.\nSo it's pretty clear that Hamas is not ISIS. But it's not that simple either.\nInterconnections and exchanges\nDespite their differences, there are several similarities, including the fact that both groups are on the U.S. list of foreign terrorist organizations. The two organizations have on occasion also shared common strategic, if not necessarily ideological, goals. And, as became obvious on Oct. 7, their tactics have become similar, though in service of different objectives.\nMy long study of Islamic State fighting tactics, including field research in Iraq, leads me to believe Hamas has recently undergone a radical ISIS-inspired transformation that has not yet gotten widespread public attention. Prior to its Oct. 7 blitz, Hamas' actions were limited to lobbing imprecise rockets and digging tunnels into Israel to kidnap or kill small numbers of Israelis.\nBut as University of Miami professor and expert in the study of jihadism Nathan S. French has noted in El Pais, \"Hamas operatives - like other Islamist and jihadist groups - borrow, steal and appropriate tactics and strategies from other similar political, guerrilla, or militant movements.\" And it seems that Hamas has borrowed tactics from ISIS.\nIt's likely that Hamas learned from the hundreds of Palestinians who joined both the core ISIS caliphate in Syria and Iraq and the ISIS affiliate in the Sinai.\nAnd despite their differences, Hamas officials have in the past met directly with leaders of the Islamic State in the Sinai. Those meetings were likely linked to collaboration between the two groups for specific actions that benefited their respective goals, such as weapons smuggling, undermining Egyptian government influence in the Sinai and transporting injured Islamic State fighters to Gaza for medical treatment.\nIn October 2023, an article in the U.K. newspaper The Times cited an intelligence official who said, \"It's clear that the two movements have worked together close enough over the past few years to copy each other's methods, learn tactics and train on weapons they have procured together.\"\nTactical similarities\nIn many ways, Hamas' Oct. 7 surprise attack resembled ISIS attacks, such as a June 2014 blitz in which Islamic State group fighters burst out of secret desert bases to conquer much of northern Iraq, including the country's second-largest city, Mosul.\nBoth groups' attacks took their opponents by complete surprise, indicating a high degree of secrecy and advanced preparation. And both assaults utilized \"technicals\" - pickup trucks with machine guns mounted in their cargo beds and carrying squads of fighters. Both attacking forces used commercial drones to provide air support for their troop movements. And both organizations deployed suicide-attack fighters known as \"inghimasi,\" Arabic for \"plungers into battle.\"\nOn Oct. 7, Hamas fighters reportedly left black ISIS war banners at the scene of several attacks. There were also videos posted online that appeared to show Hamas fighters singing popular ISIS war songs as they stormed into Israel.\nMade for the media\nAn additional notable similarity is that Hamas released ISIS-style videos of the horrific atrocities it inflicted on Israelis. The Islamic State group's media approach involved disseminating videos of mutilation, rape, amputation, slavery, suicide warfare, torture and mass murder.\nOn and after Oct. 7, Hamas fighters similarly uploaded videos and images of their executions of cowering Israeli civilians and other atrocities to a Telegram channel. These visuals made their way to X - formerly known as Twitter - and TikTok and other platforms.\nIsrael Defense Forces spokesman Rear Adm. Daniel Hagari has specifically said those videos are part of why Israel has been equating Hamas with the Islamic State group.\nThe Times of Israel came to a similar conclusion, noting: \"Looking at images of the Hamas assault, it is fair to assume that Hamas learned a lesson from the ISIS terror playbook.\"\nRape as a weapon\nAnother tactic new to Hamas, but not to ISIS, was the alleged rape and mutilation of girls and women. Hamas has denied the allegations. Islamic State religious scholars have previously sanctioned violence against women and told fighters to rape non-Muslim women \"to make them Muslim.\"\nSimilarly, Israel Defense Forces officials have said the Hamas religious leaders gave their fighters ISIS-like religious texts based on extremist interpretations of traditional Islamic jurisprudence telling them captives were \"the spoils of war.\"\nAll these developments indicate that ISIS has had an influence on Hamas, even if their goals remain quite different - or in direct opposition.\nAuthor: Brian Glyn Williams - Professor of Islamic History, UMass Dartmouth", "source_domain": "www.theuknews.com", "text": null, "title": "Is Hamas the same as ISIS, the Islamic State group? No", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274064894/is-hamas-the-same-as-isis-the-islamic-state-group-no---and-yes"}