{"authors": ["Alice Wright", "Alice Wright For Dailymail.Com"], "date_download": "2024-02-05 15:25:42", "date_modify": "None", "date_publish": "2023-12-17 14:51:40", "description": "The Army is facing a TikTok mutiny as Gen Z recruits are taking to social media to whine about low pay, 'sh***y' food and fitness tests.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12855869%2Farmy-tiktok-mutiny-gen-z-recruits.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/12/19/78880767-0-image-m-42_1702408765715.jpg", "language": "en", "localpath": null, "maintext": "The US Army is facing a TikTok mutiny as Gen Z recruits are taking to social media to whine about low pay, 'sh***y' food and fitness tests.\nThe brazen posts - by uniformed troops on US bases - represent an audacious challenge to top brass amid a recruitment crisis. The Army fell short of its target by 25 percent last year.\nOne of the posts by military influencer Anthony Laster slams Army life for having 'No Privacy, The Pay Sucks, Sh***y Food, Disrespectful Leadership, NO SLEEP!' and has been viewed more than 600,000 times.\nLaster, from Chicago, has more than a million followers on TikTok and made the public comments in uniform while on mission in the desert. In another post he claimed he spent his whole day watching TikToks while supposedly fighting the Taliban.\nIt gives a woeful impression of America's fighting forces to potential recruits, which is likely to cause further animosity toward TikTok from critics. Politicians from both sides have concerns about the platform's links with China and accuse it of pushing subversive anti-US propaganda.\nAnthony Laster (pictured) slams Army life for having 'No Privacy, The Pay Sucks, Sh***y Food, Disrespectful Leadership, NO SLEEP!'\nDana Estrella (pictured) makes content to advise those considering signing up to think again\nThe Army expects to end up about 15,000 short of its target of 65,000 recruits for 2023.\nSimilarly, the Navy expects to fall short by 10,000 personnel and the Air Force is projected to miss its goal by 10 percent.\nThe traditional allure of military recruitment is failing to register with Gen Z.\nLast year only 9 percent of young people ages 16-21 said they would consider military service, according to Pentagon data, sliding 13 percent from before the pandemic.\nThe military has faced criticism for using 'woke' advertising campaigns focused on diversity, equity and inclusion as well as drag shows for troops, to appeal to Gen Z.\nThe Army is in the middle of a five-year plan to become a 'model example of diversity, equality and inclusion', with the blessing of the White House.\nHowever, with focus elsewhere it is in the grips of a fitness crisis.\nAround 23 percent of soldiers registered as obese in 2021, according to a recent study of data from the Military Health System Data Repository.\nNot only are recruits not fit enough to join, their fitness is also declining once they're in the ranks leaving officials scrambling to install weight loss and exercise regimens.\nNow disgruntled rank and file officers have found an outlet on TikTok to advise those considering signing up to think again, according to videos viewed by DailyMail.com.\nAmong the major criticisms, the young soldiers complain about having to remain below a certain weight, harsh treatment from their superiors and having to perform menial tasks instead of engaging enemies on the battlefield.\nOne young recruit, Shemar Williams, in uniform and appearing to be on base, looks into the camera and tells his 34,000 followers his 'top five reasons not to join the military'.\nEchoing Laster's grievances, Williams bemoans that 'we do not get paid enough to perform the mission that is tasked to us,' lack of autonomy and sacrifices in family life.\nAccording to federal data, more than 20,000 active-duty troops are on food stamps to make ends meet.\nDiscontent is bubbling over from young rank and file officers who have found an outlet on TikTok\nYoung recruit Gammage filmed herself in her uniform with a clearly identifiable name badge\nGammages' grievances include being blamed for injuries incurred while serving in the military\nSergeant Barber (pictured) has posted videos of himself in uniform on what appears to be a military base\nMore worryingly for recruitment, Williams also adds to his list complaints about things the military attempts to sell to potential recruits as perks, notably 'schooling'.\n'Now I know you think 'woah that is a benefit', Williams explains, 'but there are requirements you have to meet first to get to that schooling. So if you're thinking of joining because of schooling, just go to school.'\nSergeant Barber, 25, filming himself in his uniform admits that he has already been 'counseled because of a TikTok video' nonetheless tells his 68,000 followers 'before you head to the recruiting office, watch this video… If you don't like your freedom being suppressed a little, not really, then I wouldn't join the military.'\nAs well as cautioning against fantasies of getting rich in the army, Barber also says life in the military is 'mopping those floors 99 percent of the time' rather than war combat.\n'Even if you deploy you probably won't see combat today in this world so if that's your mindset. Don't join!'\nFemale recruits have also contributed to the anti-military advice offered on TikTok.\nOne young recruit, Shemar Williams, in uniform and appearing to be on base, tells his 34,000 followers his 'top five reasons not to join the military'\nOne young recruit who could only be identified as Gammage from the name on her uniform, tells those considering a life in the military: 'Don't join the Army until you're mentally prepared to be told you're going over/under weight, treated like you're not a good soldier if you can't run 2 miles in 18 mins or less - oh and you can't get injured either cause then it's your fault'.\nHealth is a barrier to recruitment as well as an issue once recruits are enrolled.\nMore than half (56 percent) of American 18 to 25-year-olds are overweight or obese, according to Johns Hopkins researchers, meaning they can't enlist.\nFitness within the army is also at crisis point, with generals terming it a threat to national security.\nInjury and healthcare are also a concern for a young recruit who identified himself as Treull.\nHe advises against joining the Army because 'this is very physically demanding, the army don't give a f**k if you f***ed up you better see the PT [personal trainer].'\nTreull also complains that commanding officers are 'on a power trip and you can't do nothing'.\nConcluding: 'In the military you're their b***h, if they want to do something to you you're going to do it.'\nTreull (pictured) complains that commanding officers are 'on a power trip'\nA defense official told DailyMail.com: 'DOD Components are required to review and approve non-official mobile applications for use on government-issued devices.\n'The DoD never authorized the use of TikTok, and several organizations have already banned its download onto its mobile devices. Users are required to sign a user agreement when the device is issued.\n'The agreement informs them of the proper device use requirements and their responsibilities for the appropriate use and download of unmanaged applications. Additionally, all DoD personnel are required to take the Annual Cyber Awareness Challenge which has modules specific to mobile devices, social media, and geolocation capabilities.\nAdding: 'DoD Mobile Application policy requires DOD Components to review and prohibit the use of applications that pose potential risk. DoD is currently updating its mobile application security policy to establish a process for prohibiting the installation of any application that DoD believes is inappropriate to be downloaded to a government device as well.\n'In accordance with Division R, Section 102 of the Consolidated Appropriations Act of 2023, U.S. Cyber Command acting through Joint Force Headquarters-Department of Defense Information Network, directed all combatant commands, military services, defense agencies, and DoD field activities to remove TikTok from all government-funded equipment and prohibit users from downloading or accessing the application on government-funded equipment.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US Army faces 'TikTok mutiny' as Gen Z recruits whine about low pay, 'sh***y' food and FITNESS TESTS while on bases in uniform", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12855869/army-tiktok-mutiny-gen-z-recruits.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}