{"authors": [], "date_download": "2024-02-05 15:15:21", "date_modify": "None", "date_publish": "2024-01-27 11:30:37", "description": "Officials in Ukraine say Russia has provided no credible evidence to back its claims that their own forces shot down a military transport plane carrying Ukrainian prisoners of war who were to be swapped for Russian POWs", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-russia-moscow-kyiv-b2485897.html.json", "image_url": "https://static.independent.co.uk/2024/01/27/11/Russia_Ukraine_20820.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nOfficials in Ukraine said Russia has provided no credible evidence to back its claims that their own forces shot down a military transport plane carrying Ukrainian prisoners of war who were to be swapped for Russian POWs.\nThe Ukrainian agency that deals with prisoner exchanges said late Friday that Russian officials had “with great delay” provided it with a list of the 65 Ukrainians who Moscow said had died in the Wednesday plane crash in Russia's Belgorod region.\nUkraine’s Coordination Staff for the Treatment of Prisoners of War said relatives of the named POWs were unable to identify their loved ones in crash site photos provided by Russian authorities. The agency's update cited Ukraine’s military intelligence chief, Kyrylo Budanov, as saying that Kyiv had no verifiable information about who was on the plane.\nThe Russian Defense Ministry said Wednesday that missiles fired from across the border brought down the transport plane that it said was taking the POWs back to Ukraine. Local authorities in Belgorod, which borders Ukraine, said the crash killed all 74 people onboard, including six crew members and three Russian servicemen.\n“We currently don’t have evidence that there could have been that many people onboard the aircraft. Russian propaganda’s claim that the IL-76 aircraft was transporting 65 Ukrainian POWs (heading) for a prisoner swap continues to raise a lot of questions,” Budanov, who heads Ukraine's POW agency, said.\nSocial media users in the Belgorod region posted a video Wednesday that showed a plane falling from the sky in a snowy, rural area, and a huge ball of fire erupting where it apparently hit the ground.\nKyiv has neither confirmed nor denied that its forces downed a Russian military transport plane that day, and Russia's claim that the crash killed Ukrainian POWs could not be independently verified. Earlier Friday, Mykola Oleshchuk, Ukraine’s air force commander, described Moscow’s assertion as “rampant Russian propaganda.”\nUkrainian officials earlier this week confirmed that a prisoner swap was due to happen Wednesday but said it was called off. They said Moscow did not ask for any specific stretch of airspace to be kept safe for a certain length of time, as it has for past prisoner exchanges.\nAn International Committee of the Red Cross spokesperson in Ukraine urged Russia on Friday night to return the bodies of any POWs who might have died in the plane crash.\nIn a live interview with the U.S.-funded Radio Free Europe/Radio Liberty, Red Cross Media Relations Officer Oleksandr Vlasenko also remarked that “very little time” had passed between the initial reports of the incident and Moscow declaring it was ready to return the bodies of the Ukrainian POWs.\nWhile Ukraine and Russia regularly exchange the bodies of dead soldiers, each trade has required considerable preparation, Vlasenko said.\nUkrainian President Volodymyr Zelenskyy has called for an international investigation into the crash. Russia has sole access to the crash site.\nRussian President Vladimir Putin pledged Friday to make the findings of Moscow’s crash investigation public. In his first public remarks on the incident, Putin repeated previous comments by Russian officials that “everything was planned” for a prisoner exchange that day when the aircraft went down.\n“Knowing (the POWs were aboard), they attacked this plane. I don’t know whether they did it on purpose or by mistake, through thoughtlessness,” Putin said of Ukraine at a meeting with students in St. Petersburg.\nHe offered no details to support the allegation that Kyiv was to blame, but said the plane’s flight recorders had been found.\n“There are black boxes, everything will now be collected and shown,” Putin said.\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Ukraine says there's no evidence for Russia's claim that dozens of POWs died in a plane crash", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-russia-moscow-kyiv-b2485897.html"}