{"authors": [], "date_download": "2024-02-05 15:25:43", "date_modify": "None", "date_publish": "2023-12-17 00:12:03", "description": "The trial of Hong Kong’s most famous activist publisher who was arrested under China’s crackdown on dissidents will start this week after being delayed for over a year", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-hong-kong-china-british-beijing-b2465410.html.json", "image_url": "https://static.independent.co.uk/2023/12/17/00/Hong_Kong_Jimmy_Lai_Explainer_27303.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe trial of Hong Kong’s most famous activist publisher who was arrested under China’s crackdown on dissidents will start Monday after being delayed for over a year.\nJimmy Lai, 76, broke into the city's once freewheeling media world about three decades ago, armed with the belief that delivering information is equal to protecting freedom. Now, his own freedom is at stake as he faces a possible life sentence if convicted under a national security law imposed by Beijing following the 2019 pro-democracy protests.\nLai is charged with colluding with foreign forces to endanger national security and conspiring with others to publish seditious publications.\nThe landmark case — tied to the now-defunct pro-democracy newspaper Apple Daily that Lai founded — is seen by many as a trial for press freedom and a test for judicial independence in the former British colony, which was promised to have its Western-style civil liberties remain intact for 50 years after returning to Chinese rule in 1997.\nWHO IS JIMMY LAI?\nLai is the founder of Apple Daily, one of the city's media outlets most critical of the government. He was smuggled into Hong Kong from mainland China at age 12 and embarked on a rags-to-riches path, from working at a glove factory to founding the casual clothing chain Giordano.\nAfter the 1989 Tiananmen Square crackdown, Lai became an outspoken advocate for democracy. Later, following Chinese government attacks on Giordano, Lai sold his shares in the business.\nIn 1995, he launched Apple Daily, which quickly became one of the city’s top-selling newspapers with its sometimes outrageous coverage of politics and celebrities. The paper adopted a strong pro-democracy stance, often urging readers to join protests and denounced the enactment of the security law in June 2020.\nDuring the 2019 protests, Lai took to the street and met with then-Vice President Mike Pence and U.S. Secretary of State Mike Pompeo to discuss the controversial extradition bill that sparked the protests but was eventually withdrawn. After the enactment of the security law, he was openly critical of the legislation and said the city he once knew “is dead.”\nWHAT HAPPENED TO LAI?\nAlthough the 2019 protest movement lacked a clear leader, Lai’s high profile made him a target of the authorities. He was arrested in August 2020 under the law, with about 200 police officers raiding the paper's building.\nThe newspaper was forced to shut down in June 2021 after police froze $2.3 million of its assets, searched its offices and arrested some of its top editors and executives, accusing them of foreign collusion to endanger national security. The paper's final edition sold out in hours, with readers scooping all 1 million copies of it.\nLai is now serving a term of five years and nine months over fraud charges linked to lease violations in a separate case as he awaits his security trial.\nWHAT IS THE SIGNIFICANCE OF LAI'S TRIAL?\nLai's trial is Hong Kong’s first on charges of collusion with foreign forces. He faces two counts of conspiracy to collude with foreign forces and one charge of collusion under the security law. He is also charged with sedition under a colonial-era law that has been increasingly used to quash dissent.\nSix former Apple Daily executives who were also slammed with collusion charges entered guilty pleas last year, admitting to the court they conspired with Lai to call for sanctions or blockade, or other hostile activities against Hong Kong or China.\nProsecutors earlier pointed to the publication’s English version, alleging it was introduced by Lai for the purpose of asking foreign forces to impose sanctions or be hostile to Hong Kong or China. They said Lai was the mastermind of the conspiracy and the six acted to implement the plans.\nEric Lai, a research fellow at Georgetown Center for Asian Law who is not related to Jimmy, said the case will impact whether ordinary advocacy activities with foreign parties constitute a crime in the future. The trial is not just against the media tycoon but also against Apple Daily, he said.\n“The issue of press freedom, the issue of free expressions and the issue of free political participation, even overseas, would be tried,” he said.\nWHAT IS CONTROVERSIAL ABOUT LAI'S TRIAL?\nIn May, the court rejected Lai's request to terminate the proceedings based on the fact they were being heard by judges who were approved by the government.\nRobert Pang, one of Lai’s lawyers, pointed to the lack of transparency in the appointment of the judges, saying that might affect the public’s confidence in the judiciary and the judicial process.\nLai's trial, originally scheduled to start last December, was also postponed while the Hong Kong government appealed to Beijing to effectively block his attempt to hire a British defense lawyer. The city’s authorities subsequently barred the lawyer, Timothy Owen, from representing Lai, citing it would likely pose national security risks.\nThe judges in August proposed a further delay of the trial.\nLai's son, Sebastien, met with Britain’s foreign secretary last week to lobby for Britain's help in freeing his father — who holds British citizenship and who has been labelled by China's Foreign Ministry as “one of the most notorious anti-China elements.”\nThe younger Lai told The Associated Press that he felt “a lot more confident” that he would see his father again after the British government shared an image of him with Cameron, saying the country will continue to \"stand by Jimmy Lai.\"\nBut Sebastien Lai said he doesn't believe the trial will be fair.\n“It’s quite worrying for me, given my father’s age and given that he’s been in prison for three years,” he said.\n___\nAssociated Press writer Sylvia Hui in London contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Hong Kong's activist publisher to stand trial this week under Beijing's crackdown on dissidents", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-hong-kong-china-british-beijing-b2465410.html"}