{"authors": ["Matt Strudwick", "Elena Salvoni"], "date_download": "2024-02-05 15:25:45", "date_modify": "None", "date_publish": "2023-12-17 18:50:43", "description": "Relatives of the UK's first MP of Palestinian descent were among the 300 who have sought sanctuary inside the Holy Family Church, in Gaza City.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12874337%2Fbritish-mp-family-trapped-gaza-church-targeted-israeli-snipers.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/17/18/79060451-0-image-m-15_1702838383263.jpg", "language": "en", "localpath": null, "maintext": "British MP Layla Moran says 'Israeli snipers' targeting a Gaza church, where members of her family are trapped inside, are 'making a mockery of the IDF's claims they don't target civilians'.\nRelatives of the UK's first MP of Palestinian descent were among the 300 who have sought sanctuary inside the Holy Family Church, in Gaza City, yesterday.\nThe Liberal Democrat MP for Oxford West and Abingdon fears they will not survive before Christmas with them being just 'days away from dying' after the last generator pumping water to the church stopped working.\nAn elderly woman and her daughter, named as Nahida and Samar, were shot dead 'in cold blood' by an Israeli sniper while inside the grounds of the Catholic church, the Latin Patriarchate of Jerusalem said.\nIt said in a statement that a gunman had killed the pair at around midday on Saturday, revealing that 'one was killed as she tried to carry the other to safety'.\nBritish MP Layla Moran told ITV 'Israeli snipers' targeting people inside a Gaza church are 'making a mockery of the IDF's claims they don't target civilians'\nThe Liberal Democract MP said her family have been staying on mattresses along with dozens of others in the Holy Family Church since the early days of the war\nMs Moran told ITV today that anyone moving between rooms are 'being shot at'.\n'It's a week to Christmas Eve, these are Christians in a church who went there to seek sanctuary,' she said.\n'This is making a mockery of the assertion by the Israeli Defence Forces (IDF) that they do not target civilians.\nMP Layla Moran's family Layla Moran is Britain's first ever Palestinian MP. Her immediate family are Palestinian Christians from the West Bank, while she has extended family members in Gaza City. She has spoken about her family members being trapped in Gaza - and how she and her sister are trying to get news from their relatives every day as they run out of food and have been reduced to drinking water. Ms Moran's mother Randa is Palestinian while her father James is British. He joined the EU Commission when she was one and the family moved to Brussels. Her mother's family are originally Greek but they moved to Palestine and then Jordan after the diaspora in the 60s. Her great-grandfather was the Palestinian writer Wasif Jawhariyyeh, who wrote memoirs about Palestinian life under Ottoman and British rule. Advertisement\n'They have known for two months that these are civilians. If they thought Hamas were there, they would have come earlier. There were no leaflets dropped, there was no prior warning – nothing. We are terrified for them, we don't know if they are going to last until Christmas.'\nThey had been given no warning and were killed as they were walking towards a convent 'inside the premises of the Parish, where there are no belligerents,' the church said. It added that seven more people were shot and wounded yesterday as they 'tried to protect others inside the church compound'.\nChristian families have been sheltering in the complex since the war erupted, with members of Ms Moran's extended family - a grandmother, her son, his wife and their 11-year-old twins - among the dozens taking refuge as battles rage outside.\nMs Moran said her family have been staying on mattresses along with dozens of others in the Catholic church for more than 60 days.\nA sixth member of her extended family in Gaza City - a grandfather - reportedly died last month after he was unable to reach hospital for medical treatment.\n'I'm now no longer sure they are going to survive until Christmas,' Ms Moran, who has been in contact with her family over the weeks, told the BBC yesterday.\nThe British-Palestinian MP has been sharing regular updates about the dire situation on social media.\nOn Sunday, she said she had been told that 'a tank has taken position outside the church and the building opposite has been taken. The people inside have died.\n'There are snipers at every window pointing into the church. Still shooting anyone emerging from buildings to use eg toilets. Still no food or water.'\nShe said earlier this week that her relatives had told her that two men - a janitor and bin collector - were killed by gunmen as they walked to and from the building.\nTerrified of being killed themselves, people inside the church have reportedly been unable to collect the bodies, which have remained decaying in the street for days.\nI am desperately worried for my extended family in Gaza City.\nThey have no electricity, no water, no food, and now a sniper is inside the Church compound where they are sheltering.\nMy family are not collateral damage. We need an immediate bilateral ceasefire now. pic.twitter.com/zQVpLSdtgN — Layla Moran 🔶🕊️ (@LaylaMoran) December 17, 2023\nTwo women, named as Nahida and Samar, were killed 'in cold blood' by an Israeli sniper, the Latin Patriarchate of Jerusalem said\nPalestinians attend the Roman Catholic Church of Holy Family in Gaza City on Christmas Day on December 25, 2017\nFile image shows a man decorating a Christmas tree outside the Roman Catholic Church of the Holy Family in Gaza City on December 20, 2020\nThe Liberal Democrat MP for Oxford West and Abingdon has been drawing attention to the plight of Palestinians trapped in Gaza amid Israel's unrelenting bombardment of the enclave.\nShe has spoken in Parliament about her extended family in Gaza City having their house bombed by the Israel Defence Forces (IDF), staying in a church and being 'too old' to flee the 25-mile strip.\nThe latest reported deaths will add to fears for Christian Palestinians trapped in the church, and there has been outrage from around the world following Saturday's attack.\nItaly's top diplomat Antonio Tajani issued a 'heartfelt appeal to the Israeli government and army to protect Christian places of worship,' writing on X: 'That is not where the Hamas terrorists are hiding.'\nHammam Farah, a family friend of Nahida and Samar said on X: 'This is a targeted death campaign during the Christmas season on the world's oldest Christian community.'\nGaza's Christians are among the oldest established communities in the Middle East, with their origins dating back to the first century.\nBut there numbers have dwindled since Hamas took complete control of the territory in 2007, falling from 3,000 to around 1,000, Al Jazeera reports.\nThe IDF said: 'The IDF takes claims regarding harm to sensitive sites with the utmost seriousness - especially churches - considering that Christian communities are a minority group in the Middle East.\n'When reviewing incidents that may have taken place in the vicinity of churches in Gaza, it was found that an incident took place during yesterday afternoon in another area in Gaza, near the Latin Church in the Shejayia area.\nA view of partially destroyed building belonging to Beshir family and located on Salah al-Din Road after Israeli attacks in Gaza City, Gaza on December 16\nCivil defense teams carry out search and rescue operations under debris of destroyed buildings after Israeli airstrike in Rafah, Gaza on December 17\n'An initial review suggests that IDF troops, who wee operating against Hamas terrorists in the area, operated against a threat that they identified in the area of the church. The IDF is conducting a thorough review of the incident.\n'Yesterday, a letter from the Latin Patriarchate of Jerusalem was received describing a tragic incident that took place in the Holy Family Parish which is located in the Rimal area in the Gaza Strip. Yesterday morning, representatives of the church contacted the IDF regarding explosions that were heard near the church.\n'During the dialogue between the IDF and representatives of the community, no reports of a hit on the church, nor civilians being injured or killed, were raised. A review of the IDF’s operational findings support this.\n'The IDF only targets terrorists and terror infrastructure and does not target civilians, no matter their religion.\n'The IDF takes vast measures to avoid harm to uninvolved civilians, while fighting against a terrorist organization which does everything to put civilians at risk - including by using civilians and holy sites as human shields for its terror activities.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "'This is making a mockery of the IDF's claims they don't target civilians': British MP Layla Moran claims her family are trapped in Gaza church being targeted by 'Israeli snipers'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12874337/british-mp-family-trapped-gaza-church-targeted-israeli-snipers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}