{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:25:47", "date_modify": "None", "date_publish": "2023-12-16 07:00:52", "description": "The militant group’s ideology and its complex tunnel network means it is no ordinary enemy", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F16%2Fisrael-tempers-claims-of-imminent-hamas-defeat-as-both-sides-seem-set-on-long-war.json", "image_url": "https://i.guim.co.uk/img/media/a694728c47e3ad0fe1832b7465cc8fa91d107aff/0_0_4003_2402/master/4003.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a2cc9fe7554f131739422c5027de429", "language": "en", "localpath": null, "maintext": "Israel’s insistence to the Biden administration that it needs more time to defeat Hamas has raised questions over the level of damage inflicted on the Islamist militant organisation, and whether it is changing tactics in its fight against the Israel Defense Forces.\nIn a week in which nine Israeli soldiers were killed, including two senior commanders and several other officers in a single complex ambush in the Shejaiya neighbourhood of Gaza City, analysts and commentators have begun to question previously bullish assessments about Hamas’s ability to fight.\nWhile the IDF and Israeli media have made much of images of Hamas fighters surrendering and the forces claimed to have killed several thousand Hamas militants, the public language from some senior political and military figures has become more cautious.\nYoav Gallant, Israel’s defence minister, has been among those who have alluded to the difficulties in destroying Hamas in comments made to Joe Biden’s national security adviser this week.\n“Hamas is a terrorist organisation that built itself over a decade to fight Israel, and they built infrastructure under the ground and above the ground and it is not easy to destroy them,” Gallant said. “It will require a period of time – it will last more than several months, but we will win and we will destroy them.”\nGallant’s comments were echoed by Aharon Haliva, the IDF’s intelligence director, who said that he believed that the war against Hamas would take many more months.\nGallant admitted that Hamas was proving harder to destroy despite daily IDF briefings describing the progress of the offensive, not least in the north of the Gaza Strip where full control over areas including Jabaliya and Shejaiya has been described as imminent for well over a week.\nAgainst that, however, Hamas still appears to be engaged in both close-quarters combat and ambushes, including the one in Shejaiya last week, and managing to fire rockets on a daily basis.\nWhile Israel has claimed that as many as 6,000 Hamas fighters may have been killed out of 20-30,000 – a figure at the top end of a range of varying estimates that have emerged – a more useful metric may be the combat effectiveness of individual Hamas units operating in geographic areas of Gaza and their connection to Hamas’s central command.\nAccording to a week-old assessment by the Institute for the Study of War, a US thinktank that surveyed 19 Hamas battalions from the north, Gaza City and central brigades on the basis of open-source information, seven of those battalions had been “degraded”, while it assessed that another six formations in the south, not included in its survey, were under heavy pressure.\nThe report cautioned, however, that while Hamas had been organised at the beginning of the war into what looked like a broadly conventional military fashion, “the actual structure of the [Izz ad-Din] al-Qassam brigades may change as the ground operation progresses and Israeli forces destroy Hamas units or render them combat-ineffective.”\nMichael Milshtein of Tel Aviv University’s Moshe Dayan Centre, who has studied the phenomenon of resistance movements in the Middle East, including Palestinian ones, argued that it had been a mistake to regard Hamas as a conventional state force whose collapse would prove to be a definitive defeat.\n“The fighting is tough. Even in places [such as] Beit Lahia there are still pockets of fighting. I don’t believe we will ever be at the point of zero terrorists and zero weapons in Gaza,” he said.\n“For a month we have been talking about a breaking point for Hamas when you will see its total collapse begin. That kind of term is useful when you are fighting conventional armies and you can find such a point, but the thing about Hamas is it’s not even purely a guerrilla army.\n“I would call it a very flexible entity which combines the characteristic ruling party, an underground organisation and charitable fund. It is not something where if you can kill the supreme commander the whole structure is undermined.\n“Instead it is an ideological organisation where many will fight to the end. I do think even if Israel kills [Hamas leader Yahya] Sinwar – which I wish – there [will] still be others to take his place. It’s in Hamas’s DNA.”\nPolling conducted by the Palestinian Center for Policy and Survey Research this week appeared to reinforce such beliefs surrounding Hamas’s ideology as it found 44% of respondents in the occupied West Bank said they supported the group, up from 12% in September. In Gaza, the militants enjoyed 42% support, up from 38% three months ago.\nMilshtein went further, arguing that he believed Sinwar wanted to survive.\n“His vision is that even if Israel kills 50,000 Palestinians, if he can demonstrate strong standing, the victory belongs to Hamas when the last Israeli soldier retreats.”\nSpeculation surrounding Hamas’s extensive tunnel systems, which are one of its key military assets, is that the emerging strategy of Hamas’s top leadership – who have so far evaded Israel’s attempts to kill or capture them – may be to hunker down in the hope that US and other international pressure brings a quick end to the most intensive combat.\nWhile the tunnel network has been presented until now as a largely homogeneous network, recently analysts have begun to distinguish Hamas’s offensive tunnels, used for infiltrating Israel and ambushing Israeli forces in Gaza, from the more sophisticated “strategic” tunnels used to shelter the group’s leadership, including Sinwar, and to hold hostages.\nAnd while Israel has reportedly experimented with flooding some tunnels, Hamas has also boasted in return that its tunnels have been built to resist flooding.\nWriting in Yedioth Ahronoth, Nadav Eyal described off-the-record conversations with two members of the Israeli security cabinet over the challenges posed by the tunnels.\n“Here is the truth: there is still no answer and organised combat doctrine for the tunnels, ‘and as long as there isn’t one, we’ve got a problem’, a security cabinet member told me.\n“‘The solution,’ said another member, ‘will be a combination of systems. But there’s no guarantee when it’ll get here. Maybe this week, maybe in two months.’”\nAlso unclear is how much of the tunnel system Israel has so far destroyed.\n“IDF intelligence was obviously not surprised by the existence of tunnels,” said Milshtein. “They knew it was a very broad project but it is broader still than was imagined. What that means is that the IDF needs to be very effective in controlling the ground above if it is going to go against what is underground.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israel tempers claims of imminent Hamas defeat as both sides seem set on long war", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/16/israel-tempers-claims-of-imminent-hamas-defeat-as-both-sides-seem-set-on-long-war"}