{"authors": ["Adam Fulton", "Maya Yang", "Sammy Gecsoyler", "Harry Taylor", "Kevin Rawlinson"], "date_download": "2024-02-05 15:25:49", "date_modify": "None", "date_publish": "2023-12-16 02:47:23", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F15%2Fisrael-gaza-war-live-updates-hamas-us-official-palestine-mahmoud-abbas-hostage-body-recovered.json", "image_url": "https://i.guim.co.uk/img/media/3a5a95820008b1727f77c28d046837544107732c/0_91_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=be2f793edc7ed97a626b2e4ecd7ffa05", "language": "en", "localpath": null, "maintext": "16 Dec 2023 03.42 CET Closing summary It’s approaching 4.45am in Gaza City and Tel Aviv and this blog is about to close. We’ll resume our live coverage later today. Here’s a roundup of the latest developments. And you can see all our Israel-Gaza war coverage here. Thanks for reading. The Israel Defense Forces said it shot and killed three hostages after mistakenly identifying them as a threat during fighting in Gaza City. The three were named as Yotam Haim, 28, Samer Fouad Al-Talalka, 25, and Alon Shamriz, 26.\nIsraeli prime minister Benjamin Netanyahu mourned the accidental killings of the three Israeli hostages, saying on X (formerly Twitter): “Together with the entire people of Israel, I bow my head in deep sorrow and mourn the fall of three of our dear sons who were kidnapped.”\nIsrael reopened an aid crossing into the Gaza Strip on Friday after earlier approving the “temporary measure”. Netanyahu’s office said after weeks of pressure that the aid would be allowed to be delivered directly to Gaza through its Kerem Shalom border crossing.\nTwo of the world’s largest shipping firms, Maersk and Hapag-Lloyd, have said they are suspending passage through a Red Sea strait vital for global commerce after Yemeni rebel attacks in the area. The Iran-backed Houthis, who control much of Yemen but are not recognised internationally, say they are targeting shipping to pressure Israel during its war in Gaza.\nThe US should back the UN security council’s action to protect Gaza’s civilians, Human Rights Watch has said. HRW’s UN director, Louis Charbonneau, said on Friday that the US should act at the UN security council to “pressure Israel, as well as Palestinian armed groups, to comply with international humanitarian law and protect civilians”.\nAl Jazeera says its journalist Samer Abudaqa was killed in an Israeli missile attack on Friday. It reports that Abudaqa was working alongside its bureau chief, Wael Al-Dahdouh, and both were reporting at Farhana school in Khan Younis, southern Gaza, when they were attacked by Israeli missiles. It said Abudaqa was trapped in the school for hours and unable to be reached by paramedics due to heavy Israeli shelling around the area.\nThe German airline carrier Lufthansa has said it will resume flights to Tel Aviv starting 8 January. In a statement released on Friday, Lufthansa said: “In a first phase, Lufthansa Airlines will initially offer four weekly flights from Frankfurt and three weekly flights from Munich. Austrian Airlines is planning eight weekly connections and SWISS five weekly flights.”\nIn his address at the Global Refugee Forum, Philippe Lazzarini, chief of the UN agency for Palestinian refugees, said that what continues to shock him is the “ever increasing level of dehumanization” with the ongoing humanitarian crisis in Gaza. He said: “The fact that people can laugh, cheer and mock any type of wrongdoing that we observe in this war, when in fact what is happening in Gaza should outrage anyone, should make us all rethink our values… This is also a make or break moment for all of us and for our shared humanity.”\nUpdated at 03.46 CET\n16 Dec 2023 03.15 CET Israel reopens aid crossing on Gaza border Israel reopened an aid crossing into the Gaza Strip on Friday after earlier approving the “temporary measure”. Prime minister Benjamin Netanyahu’s office said after weeks of pressure that the aid would be allowed to be delivered directly to Gaza through its Kerem Shalom border crossing, Agence France-Presse reports. Before Friday’s reopening, all aid entering the Palestinian territory had to pass through the Rafah border crossing from Egypt. View image in fullscreen Humanitarian aid trucks waiting in line to be inspected at the Kerem Shalom crossing earlier this week. Photograph: Cogat/X/Reuters The UN has said the amount of aid reaching Gaza has been well below the 500 truckloads a day that entered before October 7. A UN official said hunger and desperation were driving people to seize the limited aid that is arriving. UN aid chief Martin Griffiths earlier welcomed Israel’s decision to open the Kerem Shalom crossing, saying on X (formerly Twitter) that it would increase the flow of aid. But what the people in Gaza need most is an end to this war.\nUpdated at 03.19 CET\n16 Dec 2023 02.50 CET Shipping companies suspend Red Sea traffic after Houthi attacks Two of the world’s largest shipping firms, Maersk and Hapag-Lloyd, have said they are suspending passage through a Red Sea strait vital for global commerce after Yemeni rebel attacks in the area. The Iran-backed Houthis, who control much of Yemen but are not recognised internationally, say they are targeting shipping to pressure Israel during its war with Hamas in Gaza, Agence France-Presse reports. The maritime tensions have added to fears that the Gaza conflict could spread. German transport company Hapag-Lloyd said on Friday it was halting “all container ship traffic across the Red Sea until Monday”, after the Houthis attacked one of its vessels. View image in fullscreen A Yemeni coastguard member loyal to the internationally-recognised government rides in a patrol boat in the Red Sea off western Taiz province on Tuesday. Photograph: Khaled Ziad/AFP/Getty Images The Danish firm Maersk made a similar announcement a little earlier. It said: We have instructed all Maersk vessels in the area bound to pass through the Bab al-Mandab Strait to pause their journey until further notice. Maersk said that followed a “near-miss incident involving Maersk Gibraltar yesterday” as well as Friday’s attack, in which the rebels struck a Hapag-Lloyd cargo ship in the Red Sea.\nUpdated at 03.47 CET\n16 Dec 2023 02.20 CET Further to the protest in Tel Aviv, the Times of Israel has reported that anger among hostages’ families has mounted in recent days after reports that the Israeli government has been holding off on initiating a hostage deal proposal with Hamas on the grounds that it believes that only continued military operations in Gaza will “bring the terror group to its knees and back to the table with an offer Israel could accept”. The report continues: Prime minister Benjamin Netanyahu reportedly barred Mossad chief David Barnea from travelling to Qatar for that reason earlier this week. However, Axios reports that Netanyahu has since changed his mind and has agreed to dispatch Barnea to meet Qatari prime minister Mohammed bin Abdulrahman Al Thani in Europe this weekend to discuss resuming negotiations toward another hostage deal. At the Tel Aviv protest, in which large crowds blocked off a road to traffic as they marched towards the Israel Defence Forces’ Kirya military headquarters, the Times said the crowd was heard chanting: Their time is running out! Bring them home now! There is no victory until every last hostage is released! The IDF announced earlier that its troops shot and killed three hostages being held by Hamas after mistakenly identifying them as a threat during fighting in Gaza City.\nUpdated at 02.23 CET\n16 Dec 2023 01.38 CET Hundreds of protesters have blocked a major Tel Aviv intersection after the Israeli military said it accidentally killed three hostages in Gaza, Israel’s Haaretz newspaper is reporting. The protesters are demonstrating in front of the Kirya military base, it said. They are waving signs with the names and pictures of many of the other hostages held by Hamas and are calling for their immediate release. View image in fullscreen The protesters in Tel Aviv. Photograph: Violeta Santos Moura/Reuters This is Adam Fulton picking up our live coverage – stay with us for all the latest news as it unfolds\nUpdated at 02.00 CET\n16 Dec 2023 01.14 CET Summary Here is where the day stands: The Israel Defense Forces announced on Friday that it “mistakenly identified three Israeli hostages as a threat, as a result the force fired at them and they were killed.” The hostages have been named as 28-year old Yotam Haim, 25-year old Samer Fouad Al-Talalka and 26-year old Alon Shamriz.\nIn a tweet on Friday, Israeli prime minister Benjamin Netanyahu mourned the accidental killings of three Israeli hostages by the Israel Defense Forces, saying: “Together with the entire people of Israel, I bow my head in deep sorrow and mourn the fall of three of our dear sons who were kidnapped, among them Yotam Chaim and Samer Fouad al-Talalka.”\nThe US should back the UN security council’s action to protect Gaza’s civilians, Human Rights Watch has said. HRW’s UN director, Louis Charbonneau, said on Friday that the US should act at the UN security council to “pressure Israel, as well as Palestinian armed groups, to comply with international humanitarian law and protect civilians.”\nAl Jazeera has announced that its journalist Samer Abudaqa has been killed in an Israeli missile attack on Friday. It reports that Abudaqa was working alongside its bureau chief, Wael Al-Dahdouh, and both were reporting at Farhana school in Khan Younis in southern Gaza when they were attacked by Israeli missiles. It added that Abudaqa was trapped in the school for hours and was unable to be reached by paramedics due to heavy Israeli shelling around the area.\nThe German airline carrier Lufthansa has announced that it will resume flights to Tel Aviv starting 8 January 2024. In a statement released on Friday, Lufthansa said: “In a first phase, Lufthansa Airlines will initially offer four weekly flights from Frankfurt and three weekly flights from Munich. Austrian Airlines is planning eight weekly connections and SWISS five weekly flights.”\nIn his address at the Global Refugee Forum, Philippe Lazzarini, chief of the UN agency for Palestinian refugees, said that what continues to shock him is the “ever increasing level of dehumanization” with the ongoing humanitarian crisis in Gaza. He said: “The fact that people can laugh, cheer and mock any type of wrongdoing that we observe in this war, when in fact what is happening in Gaza should outrage anyone, should make us all rethink our values… This is also a make or break moment for all of us and for our shared humanity.”\n15 Dec 2023 00.52 CET US senator Elizabeth Warren has issued a letter to Meta chief Mark Zuckerberg in which she demanded answers on reports of Meta censoring pro-Palestinian content. The Guardian’s Kari Paul reports: Warren cited a statement co-signed by more than 90 human rights and civil rights organizations and listed various media reports and concerns about Meta’s censorship, removal and mistranslation of Palestine-related content since Hamas attacks on Israel escalated conflict there in October. “Amidst the horrific Hamas terrorist attacks in Israel, a humanitarian catastrophe including the deaths of thousands of civilians in Gaza, and the killing of dozens of journalists, it is more important than ever that social media platforms do not censor truthful and legitimate content, particularly as people around the world turn to online communities to share and find information about developments in the region,” Warren said in the letter, first published by the Intercept. Hundreds of users have reported that posts on Instagram related to Palestine were limited or removed with little explanation, while others have found their accounts entirely suspended. Meta previously attributed these removals to glitches in its systems, but an independent analysis commissioned by the company in 2021 found that it had previously violated Palestinian human rights by censoring content related to previous Israeli attacks on Gaza. For the full story, click here: Senator demands answers on reports of Meta censoring pro-Palestinian content Read more\n15 Dec 2023 00.17 CET Here are some images coming through the newswires from Gaza where Israeli strikes have killed nearly 19,000 Palestinians while survivors grapple a rapidly deteriorating humanitarian situation amid shortages in food, water, fuel and medical supplies: View image in fullscreen Civil defense teams and local residents conduct a search and rescue operation in the rubble of the building belonging to the Hussein family and destroyed in the Israeli attack in Gaza's Bureij Refugee Camp as Israeli attacks continue in Deir al Balah, Gaza on December 15, 2023. Photograph: Ashaf Amra /Getty Images View image in fullscreen A Palestinian man reacts amid the rubble of buildings destroyed following Israeli bombardment on Rafah, in the southern Gaza Strip, on December 15, 2023, amid continuing battles between Israel and Hamas. Photograph: Said Khatib/AFP/Getty Images View image in fullscreen A Palestinian woman and children looks on following Israeli bombardment on Rafah, in the southern Gaza Strip, on December 15, 2023, amid continuing battles between Israel and Hamas. Photograph: Mohammed Abed/AFP/Getty Images View image in fullscreen Palestinians struggle with cold weather as they stay in the makeshift tents they set up near Al Aqsa Martyrs Hospital in Deir al Balah, Gaza on December 14, 2023. Photograph: Ashraf Amra/Getty Images View image in fullscreen Al Jazeera correspondent Wael Al-Dahdouh receives medical treatment at Nasser Hospital after was wounded by shrapnel during an Israeli airstrike on Khan Yunis, Gaza on December 15, 2023. Photograph: Anadolu/Getty Images\n15 Dec 2023 23.59 CET US urged to back UN security council to protect civilians in Gaza The US should back the UN security council’s action to protect Gaza’s civilians, Human Rights Watch has said. HRW’s UN director, Louis Charbonneau, said on Friday that the US should act at the UN security council to “pressure Israel, as well as Palestinian armed groups, to comply with international humanitarian law and protect civilians”. Charbonneau added that the US should also support calls to restore essential services to Gaza and allow humanitarian aid to reach all those in need. He went on to criticize what he called the US’s “double standards”, saying: The US voting record at the UN has highlighted double standards in Washington’s commitment to the laws of war. While blocking two security council resolutions in October and December, the US abstained from a November vote on a resolution focused on the plight of children in Gaza, which enabled it to pass. All three security council resolutions – the two that were vetoed and the one adopted – called on Israel to protect civilians and allow aid into Gaza and on Palestinian armed groups to release civilians held hostage. The one that passed is legally binding but Israel and Palestinian armed groups have defied it. He added: No permanent security council member – not the US, not Russia – should veto resolutions aimed at stopping mass atrocities.\nUpdated at 00.22 CET\n15 Dec 2023 23.37 CET The third Israeli hostage who was mistakenly killed by the Israel Defense Forces has been identified. The Hostages and Missing Persons Families Forum has identified 26-year old Alon Shamriz, who lived in the Young Generation neighborhood of Kibbutz Kfar Aza. Alon Lulu Shamriz. Photograph: Hostages And Missing Families Forum/Reuters He was described as a dedicated basketball fan who played on the Sha’ar Hanegev basketball team. The forum reports that Shamriz had been accepted to study computer engineering at Sapir College and was about to begin his first year there. The other two hostages who were mistakenly killed by the Israel Defense Forces have been identified as 25-year old Samer Fouad Al-Talalka and 28-year old Yotam Haim.\nUpdated at 23.44 CET\n15 Dec 2023 22.54 CET Benjamin Netanyahu: 'I bow my head in deep sorrow' over accidental Israeli hostages' deaths In a tweet on Friday, Israeli prime minister Benjamin Netanyahu mourned the accidental killings of three Israeli hostages by the Israel Defense Forces, saying: Together with the entire people of Israel, I bow my head in deep sorrow and mourn the fall of three of our dear sons who were kidnapped, among them Yotam Chaim and Samer Fouad al-Talalka. This is an unbearable tragedy. The entire state of Israel will mourn this evening. My heart goes out to the grieving families in their difficult time. I strengthen our brave warriors who penetrate the sacred mission of returning our abducted, even at the cost of their lives. Even on this difficult evening, we will bind up our wounds, learn the lessons and continue with a supreme effort to return all our abductees home safely. יחד עם כל עם ישראל אני מרכין ראש בצער עמוק ומבכה את נפילתם של שלושה מבנינו היקרים שנחטפו, וביניהם יותם חיים וסאמר פואד אל-טלאלקה.\nזוהי טרגדיה קשה מנשוא. מדינת ישראל כולה אבלה בערב זה. ליבי עם המשפחות הדואבות בשעת יגונן הקשה.\nאני מחזק את לוחמינו האמיצים שחדורים במשימה הקדושה… — Benjamin Netanyahu - בנימין נתניהו (@netanyahu) December 15, 2023\nUpdated at 22.57 CET\n15 Dec 2023 22.33 CET The US senator Bernie Sanders is demanding answers on Israel’s “indiscriminate” bombing across Gaza. The Guardian’s Stephanie Kirchgaessner reports: The US’s support for Israel’s bombing campaign in Gaza is facing new scrutiny in Washington following a proposed resolution by the independent senator Bernie Sanders that could ultimately be used to curtail military assistance. It is far from clear whether Sanders has the support to pass the resolution, but its introduction in the Senate this week – by an important progressive ally of the US president, Joe Biden – highlights mounting human rights and political concerns by Democrats on Capitol Hill. Citing the killing of nearly 19,000 people and wounding of more than 50,000 in Gaza since Hamas’s brutal 7 October attack, Sanders said it was time to force a debate on the bombing that has been carried out by the rightwing government of the Israel prime minister, Benjamin Netanyahu, and the US government’s “complicity” in the war. For the full story, click here: Bernie Sanders demands answers on Israel’s ‘indiscriminate’ Gaza bombing Read more\nUpdated at 22.35 CET\n15 Dec 2023 21.55 CET Psychosocial support teams from the Palestine Red Crescent Society have visited Palestinians displaced by Israeli strikes at al-Amal hospital and the PRCS headquarters in Khan Younis. The teams sought to provide patients with psychological first aid to “alleviate their anxiety amid the continuous bombardment in the governate”, the PRCS said. 🫶The PRCS Psychosocial support team reassures displaced people at PRCS Al-Amal Hospital and the PRCS headquarters in #KhanYounis, providing them with initial psychological first aid❤️to alleviate their anxiety amid the continuous bombardment in the governorate.#Gaza pic.twitter.com/PyvEDN1bgR — PRCS (@PalestineRCS) December 15, 2023\nUpdated at 22.14 CET\n15 Dec 2023 21.19 CET Al Jazeera has released a full statement on the killing of its journalist Samer Abudaqa in an Israeli airstrike: Al Jazeera Media Network condemns in the strongest terms the Israeli drone attack on a Gaza school that resulted in the killing of cameraman Samer Abudaqa. The Network holds Israel accountable for systematically targeting and killing Al Jazeera journalists and their families. In today’s bombing in Khan Younis, Israeli drones fired missiles at a school where civilians sought refuge, resulting in indiscriminate casualties. Following Samer’s injury, he was left to bleed to death for over 5 hours, as Israeli forces prevented ambulances and rescue workers from reaching him, denying the much-needed emergency treatment. Al Jazeera Media Network extends its sincere condolences to the family in Gaza and in Belgium of the late colleague Samer Abudaqa. With the killing of Samer Abudaqa number of journalists and media workers killed in Gaza reached over 90. Al Jazeera urges the international community, media freedom organisations, and the International Criminal Court to take immediate action to hold the Israeli government and military accountable for these acts of carnage and crimes against humanity. Al Jazeera Arabic journalist Samer Abu Daqa has been killed, and his colleague Wael al-Dahdouh was wounded in an Israeli attack in Gaza's Khan Younis https://t.co/ARxWAoA2WM pic.twitter.com/EBc2yAe8WB — Al Jazeera English (@AJEnglish) December 15, 2023\nUpdated at 22.04 CET\n15 Dec 2023 20.53 CET Details are starting to emerge of the Israeli hostages who were mistakenly killed by the Israel Defense Forces on Friday. According to the Hostages and Missing Families Forum, Samer Fouad Al-Talalka, who was kidnapped by Hamas on 7 October, was 25 years old when he was killed. Al-Talalka lived in Hura, a Bedouin town in southern Israel. He had worked with his father and brothers at a chicken hatchery near Kibbutz Nir Am and was the eldest of 10 children. The forum also reports that Yotam Haim, another hostage who was mistakenly killed by the IDF, was 28 years old. Haim lived in Kibbutz Kfar Aza and was a dedicated metal music fan. He had played the drums for 20 years and was part of a band called Persephore. Haim is survived by two parents, as well as a brother and a sister. Details have yet to be revealed about the third hostage who was killed. View image in fullscreen Samer Fouad Al-Talalka (left) and Yotam Haim, Israeli hostages killed in Gaza. Photograph: Handout\nUpdated at 23.45 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Lufthansa to resume flights to Tel Aviv in January - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/15/israel-gaza-war-live-updates-hamas-us-official-palestine-mahmoud-abbas-hostage-body-recovered"}