{"authors": [], "date_download": "2024-02-05 15:25:51", "date_modify": "None", "date_publish": "2023-12-16 16:51:33", "description": "The top two U.S. military leaders are traveling to Tel Aviv to advise the Israeli government on how to transition from major combat operations against Hamas in Gaza to a more limited and precise campaign", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisrael-ap-lloyd-austin-hamas-joe-biden-b2465316.html.json", "image_url": "https://static.independent.co.uk/2023/12/16/16/United_States_Mideast_44313.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe top two U.S. military leaders are traveling to Tel Aviv to advise the Israeli government on how to transition from major combat operations against Hamas in Gaza to a more limited and precise campaign — the kind of strategic shift they both have considerable expertise in.\nDefense Secretary Lloyd Austin and Joint Chiefs Chairman Gen. CQ Brown served in leadership roles as U.S. airpower and ground forces moved from major combat to lower-intensity counterterrorism operations in Iraq and Afghanistan. But it is not clear how deeply their advice from lessons learned will resonate with Prime Minister Benjamin Netanyahu's government\nIsrael is still stinging from the deadliest attack ever on its homefront and has pledged to continue its bombardment of Gaza until Hamas, which orchestrated the Oct. 7 attacks, is fully destroyed.\nTheir trip highlights the increased efforts by the Biden administration to convince Israel that it should scale back its offensive, which has flattened much of Gaza's northern region, displaced millions and killed more than 18,700 Palestinians, according to the Health Ministry in the Hamas-run territory.\nIsrael’s push has been complicated by the dense urban population and Hamas' network of tunnels, and the militants are accused of using civilians as “human shields.” The sustained intensity of Israel's campaign has led President Joe Biden to warn that the U.S. ally is losing international support because of its “indiscriminate bombing.\"\nU.S. officials have been telling Israel for several weeks that its window is closing for concluding major combat operations in Gaza without risking the loss of even more backing.\nIn a meeting Thursday, Biden's national security adviser, Jake Sullivan, urged Netanyahu to shift to more targeted operations by smaller military teams hunting specific high-value targets, rather than the sustained broad bombardment that has occurred so far. In response, Israeli Defense Minister Yoav Gallant said his country would continue major combat operations against Hamas for several more months.\nThere are implications for the tens of thousands of U.S. service members deployed in the region.\nAustin on Friday extended the deployment once more of the aircraft carrier USS Gerald R. Ford and a second warship in order to retain a two-carrier presence in the Mediterranean Sea. The ships are seen as vital to deter Iran from widening the Israel-Hamas war into a regional conflict. The approximately 5,000 sailors aboard the Ford were originally due home in early November.\nU.S. warships that were deployed with the Ford have intercepted incoming missiles fired toward Israel from areas of Yemen controlled by Iranian-backed Houthi rebels. They also have shot down one-way attack drones headed toward the ships and responded to calls for assistance from commercial vessels that have come under persistent Houthi attacks near the narrow Bab el-Mandeb Strait.\nAs of Friday, there are 19 U.S. warships in the region, including seven in the eastern Mediterranean. A dozen more stretched down the Red Sea, across the Arabian Sea and up into the Persian Gulf.\nOn Saturday, one of the warships assigned to the Ford carrier strike group, the destroyer USS Carney, “successfully engaged” 14 one-way attack drones launched from Houthi-controlled areas of Yemen, U.S. Central Command said in a statement. Britain reported that a Royal Navy destroyer downed another drone that was targeting commercial ships.\nThe missile and drone attacks have led at least two major shipping companies, Hapag-Lloyd and Maersk, to order their commercial vessels to temporarily pause transits through the strait.\n“The recent attacks on commercial vessels in the Bab al-Mandeb Strait are alarming and pose a significant threat to the safety & lives of seafarers,” Maersk said in a statement posted to its official account on X, formerly known as Twitter, on Friday. “This issue cannot be addressed by the global shipping industry alone, and we urge the international society to come together to find a swift resolution to bring the situation under control.”\nAustin is expected also to visit Bahrain and Qatar and further work toward establishing a new maritime mission to provide increased security for commercial ships sailing in the southern Red Sea. Bahrain is the home of the U.S. Navy’s Central Command headquarters and the international maritime task force charged with ensuring safe passage for vessels in the region.\nQatar has been vital in helping keep what has been a deadly localized war from boiling over into a regional conflict and negotiating hostage release.\nEarlier in his Army career, Austin oversaw the drawdown of forces in Iraq in 2011. He visited Israel days after the Oct. 7 attack by Hamas and has spoken to Gallant, his Israeli counterpart, more than two dozen times since then.\nIn his meetings in Israel, he is likely to continue discussions on how Israelis define different military campaign milestones, to be able to assess when they will have sufficiently degraded Hamas to ensure their own security and shift from major combat operations, a senior U.S. defense official told reporters traveling with Austin.", "source_domain": "www.independent.co.uk", "text": null, "title": "US military leaders head to Israel and will offer advice on shifting to the war's next phase in Gaza", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israel-ap-lloyd-austin-hamas-joe-biden-b2465316.html"}