{"authors": [], "date_download": "2024-02-05 15:25:53", "date_modify": "None", "date_publish": "2023-12-16 09:58:06", "description": "Kuwait’s ruling emir, the 86-year-old Sheikh Nawaf Al Ahmad Al Sabah, has died", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fkuwait-ap-united-arab-emirates-dubai-iraq-b2465192.html.json", "image_url": "https://static.independent.co.uk/2023/12/16/10/Kuwait_Sheikh_Nawaf_Al_Ahmad_Al_Sabah_95547.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nKuwait's ruling emir, the 86-year-old Sheikh Nawaf Al Ahmad Al Sabah, has died, state television reported Saturday.\nKuwait TV broke into programming with Quranic verses just before making the announcement.\nIn late November, Sheikh Nawaf was rushed to hospital for an unspecified illness. In the time since, the tiny, oil-rich nation had been waiting for news about his health. State-run news previously reported that he traveled to the United States for unspecified medical checks in March 2021.\nThe health of Kuwait’s leaders remains a sensitive matter in the Middle Eastern nation bordering Iraq and Saudi Arabia, which has seen internal power struggles behind palace doors.\nSheikh Nawaf was sworn in as emir following the 2020 death of his predecessor, the late Sheikh Sabah Al Ahmad Al Sabah. The breadth and depth of emotion over the loss of Sheikh Sabah, known for his diplomacy and peacemaking, was felt across the region.\nSheikh Nawaf previously served as Kuwait’s interior and defense minister but wasn’t seen as particularly active in government outside those terms. However, he was largely an uncontroversial choice for emir, though his advancing age led analysts to suggest his tenure would be short.\nSheikh Meshal Al Ahmad Al Jaber, now 83, is believed to be the world’s oldest crown prince. He is in line to take over as Kuwait's ruler.\nKuwait, a nation home to some 4.2 million people which is slightly smaller than the U.S. state of New Jersey, has the world’s sixth-largest known oil reserves.\nIt has been a staunch U.S. ally since the 1991 Gulf War expelled the occupying Iraqi forces of Saddam Hussein. Kuwait hosts some 13,500 American troops in the country, as well as the forward headquarters of the U.S. Army in the Middle East.", "source_domain": "www.independent.co.uk", "text": null, "title": "Kuwait's ruling emir, Sheikh Nawaf Al Ahmad Al Sabah, dies at age 86", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/kuwait-ap-united-arab-emirates-dubai-iraq-b2465192.html"}