{"authors": [], "date_download": "2024-02-05 15:15:22", "date_modify": "None", "date_publish": "2024-01-27 05:00:14", "description": "Taiwan's defense ministry says China sent more than 30 warplanes and a group of navy ships toward the island in a 24-hour period", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Ftaiwan-ap-beijing-china-wang-yi-b2485810.html.json", "image_url": "https://static.independent.co.uk/2024/01/27/05/Taiwan_China_32971.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nChina sent more than 30 warplanes and a group of navy ships toward Taiwan, the island’s defense ministry said Saturday.\nThe military pressure comes on the heels of an announcement that senior American and Chinese representatives were expected to meet in the Thai capital as the two countries seek to cool tensions.\nThe Chinese People’s Liberation Army sent 33 aircraft, including SU-30 fighters, and six navy vessels around Taiwan, between 6 a.m. Friday to 6 a.m. Saturday. Of these, 13 warplanes crossed the midline of the Taiwan Strait — an unofficial boundary that's considered a buffer between the island and mainland. Taiwan has monitored the situation and employed its own forces in response to the activities.\nChina claims self-ruled Taiwan as its own territory and in recent years has shown is displeasure at political activities in Taiwan by sending military planes and ships. Taiwan said six Chinese balloons either flew over the island or through airspace just north of it days after the self-governing island elected Lai Ching-te as the new president. Lai’s Democratic Progressive Party largely campaigned on self-determination, social justice and a rejection of China’s threats.\nUnited States National Security Adviser Jake Sullivan and Chinese Foreign Minister Wang Yi were both in Bangkok for talks, though it wasn't clear when the meeting would take place or if it already had.\nU.S. President Joe Biden and Chinese President Xi Jinping met on the sidelines of a summit in November in an effort to patch up frayed relations due to quarrels over a range of economic and geopolitical issues. U.S. National Security Council spokesperson Adrienne Watson said the planned meeting in Bangkok continues the commitment Biden and Xi made \"to maintain strategic communication and responsibly manage the relationship.”\nDuring talks, Foreign Minister Wang would make clear China’s position on Taiwan and on U.S.-China relations, and discuss international and regional concerns, ministry spokesperson Wang Wenbin said Friday.\nAn immediate international concern to both countries is tensions in the Red Sea that have upended global trade by forcing many shippers to avoid the Suez Canal. Beijing said it has been making positive efforts to de-escalate the situation in which Iran-backed Houthi rebels have fired missiles at international ships.", "source_domain": "www.independent.co.uk", "text": null, "title": "Beijing steps up military pressure on Taiwan after the US and China announce talks", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/taiwan-ap-beijing-china-wang-yi-b2485810.html"}