{"authors": [], "date_download": "2024-02-05 15:25:54", "date_modify": "None", "date_publish": "2023-12-16 19:36:52", "description": "Deaths of Hani Jnena, 32, wife and daughters aged 2 and 4 led NGO to call for Biden to demand Israeli accountability", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F16%2Fusaid-contractor-gaza-killed-hani-jnena.json", "image_url": "https://i.guim.co.uk/img/media/d1479c1f20df04a4a7439adafe1ab0be872a2720/0_0_1980_1188/master/1980.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e5487889881024cdc915578306fb9c4", "language": "en", "localpath": null, "maintext": "A contractor for the US Agency for International Development (USAid) in Gaza was killed with his wife and two daughters aged four and two in an Israeli airstrike in November, his employer said on Saturday.\n“We are deeply saddened to confirm the tragic loss of our colleague, Hani Jnena (33), along with his family in Gaza, including his wife, Abeer (32), and their two young daughters, Mariam and Zayna, aged 4 and 2,” the non-profit organization Global Communities, which partners with governments and private-sector entities for humanitarian work, said in a statement.\n“Based on the information currently available to us, the young family was killed on Sunday, November 5, during an Israeli air strike in the Al Sabra neighborhood of Gaza City at the residence of Hani’s in-laws,” the statement added.\nThe family had recently sought safety there after fleeing airstrikes in their own neighborhood of Al Sheikh in Gaza City, Global Communities said, adding that Jnena’s in-laws were killed as well.\nIn his final message, which was sent on 10 October, Jnena wrote: “My daughters are terrified, and I am trying to keep them calm, but this bombing is terrifying,” according to the statement from his employer.\nJnena was a member of the non-profit’s IT team in Gaza and was known for “his kindness and commitment to delivering essential IT services in challenging conditions”, Global Communities said.\nThe latest eruption in the decades-long Israel-Palestine conflict began on 7 October, when Hamas, the Islamist group that rules Gaza, killed 1,200 Israelis and seized 240 hostages in a cross-border raid.\nSince then, Israeli forces have besieged the coastal territory and laid much of it to waste, killing nearly 19,000 people.\nThe Washington Post reported on Saturday that the USAid contractor’s death led to calls from within USAid to the administration of president Joe Biden for accountability from Israel.\nA USAid spokesperson told Reuters the USAid community “grieves the deaths of the innocent civilians and many humanitarian workers who have been killed in this conflict, including courageous individuals like Hani Jnena”.\nThe spokesperson added that the United States is raising concern with Israel in “every conversation” about the need for humanitarian workers to safely distribute assistance and for civilians to be able to access it.\nIn a statement to the Washington Post, the Israel Defense Forces did not confirm or deny Israel’s responsibility in Jnena’s death but said the IDF always follows international law and takes “feasible precautions to mitigate civilian harm”.", "source_domain": "www.theguardian.com", "text": null, "title": "USAid contractor and family killed in Israeli Gaza airstrike, agency says", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/16/usaid-contractor-gaza-killed-hani-jnena"}