{"authors": [], "date_download": "2024-02-05 15:25:56", "date_modify": "None", "date_publish": "2023-12-16 12:19:58", "description": "Racine, Wisconsin is best known for factories and farming. But in 2018, the city on the edge of Lake Michigan became a source of high caliber weapons for one of Mexico's top fentanyl trafficking gangs.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12856731%2Famerica-guns-pipeline-mexico-cartels.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/14/21/78913685-0-image-m-11_1702588798680.jpg", "language": "en", "localpath": null, "maintext": "Racine, Wisconsin is best known for factories, farming, and an extravagant televised prom celebration.\nBut in 2018, Racine's suburban sprawl on the edge of Lake Michigan became a source of high caliber weapons for one of Mexico's top fentanyl trafficking gangs, the Cartel Jalisco Nueva Generacion (CJNG).\nThe cartel exploited permissive federal and state-level gun control rules to buy some of the most powerful weapons available to American civilians, according to two former agents with the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) and two other sources, all with knowledge of the investigation.\nMembers of a local family, working with a cousin in Mexico, enlisted friends and relatives who bought guns on their behalf in Racine and transported them to California and south across the border, according to an indictment from Wisconsin's Eastern District Court unsealed in February.\nTheir clients included a hit squad reporting to CJNG leader Nemesio Oseguera, better known as 'El Mencho,' according to Chris Demlein, one of the former ATF agents.\nThe Racine case unlocked 'the most prolific CJNG firearms trafficking network ever discovered,' said Demlein, who until 2021 served as a senior special agent with ATF and oversaw a multi-agency arms trafficking project that coordinated dozens of investigations.\nAn employee shows a .50 Caliber Barrett M107A1 semi-automatic rifle to Reuters at the Shooters' Sports Center gun store in Racine, Wisconsin, June 26, 2023\nMembers of the Jalisco New Generation Cartel (CJNG) pose for a photo at an undisclosed location, in Michoacan state, Mexico, July 1, 2021. One of the men bears the insignia of the Delta hit squad that reports directly to cartel leader Nemesio Oseguera and that U.S. federal investigators say received a gun that came from the Racine gun store.\nFrom North Carolina to Oregon, the CJNG network has reached deep into the United States to find and buy heavier, rarer firearms, Sloan and Demlein said. Far from the border cities that are the usual sources of weapons for Mexico's criminal groups, relaxed surveillance can make such weapons easier to buy in quantity, they said\nThe Shooters' Sports Center in Caledonia, Racine County, Wisconsin, where members of the Cobian family legally purchased .50 caliber Barrett semi-automatic rifles which were allegedly then smuggled to the Jalisco New Generation Cartel (CJNG) in Mexico. The gun store says it does not condone the illegal movement of firearms.\nThe traffickers in Racine and connected cells in two other locations bought more than $600,000 of high-end military-style firearms in under a year, internal ATF documents allege. It seemed like an unprecedented shopping spree, said Tim Sloan, the other former ATF investigator. Sloan was the first to trace a CJNG gun to Racine.\nRacine was just the tip of the iceberg. The city was a key part of a CJNG firearms network that bought hundreds of guns from more than a dozen U.S. states, specializing in semi-automatic .50 caliber rifles and FN SCAR assault rifles designed for U.S. special forces, internal ATF reports obtained by Reuters allege.\nATF dubbed the Wisconsin case 'Grin and Barrett,' after Barrett, a Tennessee-based weapons maker whose powerful .50 caliber firearms were among those trafficked by the network. Now a unit of Australia's NIOA Group, Barrett did not respond to detailed requests for comment for this report.\nGun runners in Wisconsin's clients included the Delta hit squad that reports directly to CJNG leader Nemesio Oseguera (pictured), better known as 'El Mencho'\nATF spokesperson Kristina Mastropasqua declined to comment on what she described as an open case. Mastropasqua said preventing cross-border firearms trafficking was an ATF priority and new powers had led to 250 people being charged since last year.\nCommenting on this story's findings, Alejandro Celorio, legal advisor to Mexico´s foreign ministry, said those involved in the U.S. firearms business should be more careful to 'prevent their products from falling into the wrong hands.'\nThe Racine Mayor's Office did not respond to a request for comment.\nFrom North Carolina to Oregon, the CJNG network reached deep into the United States to find and buy heavier, rarer firearms, Sloan and Demlein said. Far from the border cities that are the usual sources of weapons for Mexico's criminal groups, relaxed surveillance can make such weapons easier to buy in quantity, they said.\nOverseeing much of the network was Mexican citizen Jesus Cisneros, according to ATF internal presentations that cited his intercepted communications with other suspects about moving .50 calibers and other firearms to Mexico. The Wisconsin indictment charged Cisneros and a local accomplice named Victor Cobian on multiple counts related to gun trafficking.\nOne internal ATF presentation cited more than 28 pending indictments related to the wider network.\nA spokesperson for the Eastern District of Wisconsin Attorney's Office said they could only comment on public court records, adding those records suggested Cisneros was 'the lead player' in the Wisconsin conspiracy.\nCisneros is believed to reside in Mexico, one of the sources with knowledge of the investigation said. The source requested anonymity to speak freely.\nCobian told Reuters in an interview that Cisneros was his cousin and lived in Jalisco. Cobian, who pleaded not guilty to gun-trafficking charges, denied involvement in or knowledge of the alleged trafficking scheme.\nAn employee shows a .50 Caliber Barrett M107A1 semi-automatic rifle to Reuters at a gun store in Racine, Wisconsin, U.S., June 26, 2023\nRailroad tracks cut through the small industrial town of Racine, Wisconsin, U.S., June 27, 2023\nMaria Cobian, mother of Victor Cobian who has been charged with gun running, works at Victor's Again, the bar she owns and is named after her son, in Oak Creek, Wisconsin\nMarco Cobian, whose brother has been indicted by U.S. authorities in an arms trafficking case, talks to Reuters in his garage in Racine, Wisconsin, U.S., June 26, 2023\nA sign illuminates Victor's Again. Local police found several storage cases for high caliber firearms in a dumpster near the bar\nHouses line the streets of the small industrial town of Racine, Wisconsin\nThe driveway sits empty at the house where Oswaldo and Elias Cobian lived when it was raided in 2018 near Racine, Wisconsin, U.S., June 27, 2023. Members of the Cobian family, including Oswaldo and Elias, are accused in a federal indictment of purchasing .50 Caliber Barrett rifles that were then smuggled to the Jalisco New Generation Cartel (CJNG) in Mexico\nMexican law enforcement agencies did not respond to inquiries about Cisneros but did acknowledge that Mexican authorities automatically freeze the accounts of individuals sanctioned by the U.S. Treasury. Cisneros was sanctioned by the U.S. Treasury in February.\nThe indictment charged Cisneros, Cobian and six other accomplices with felonies ranging from false statements to unlicensed gun dealing and smuggling. The alleged accomplices included Cobian's sister and her fiance, who also entered not guilty pleas. A jury trial was set for May 6, 2024, court filings show.\nGUN THIRTY ONE\nThe existence of the wider Cisneros network and Wisconsin's role in it may never have come to light had it not been for a single Barrett .50 caliber rifle picked up by police in a 2018 raid in Mexico's second-largest city, Guadalajara, the state capital of Jalisco.\nSloan, ATF's attache at the U.S. embassy in Mexico City at the time, called the weapon 'the key' to the CJNG gun pipeline.\nWeighing 30 pounds, Barrett .50 calibers are used by militaries around the world for their ability to rip through armored vehicles from over a mile away. They are among the most powerful weapons civilians can buy in the United States through licensed dealers and sell for around $9,000.\nIn Mexico, they are popular with organized criminal groups. CJNG uses .50 calibers to defend routes through which the U.S. Justice Department says thousands of tons of fentanyl and methamphetamine are shipped to U.S. consumers.\nThe cartel´s highly-trained, uniformed squadrons have used the guns to down a police helicopter, to kill 13 policemen in an ambush, and in a failed hit on Mexico City´s top cop, Mexican and U.S. authorities say.\nOn May 21, 2018, gunmen from a CJNG hit squad known as Delta tried to kill a Jalisco government minister - who previously served as the state´s attorney general - in a brazen afternoon attack outside a Japanese restaurant near the city center.\nA few weeks later, on June 9, a team of Mexican Federal Police investigating the attack gathered before dawn outside a Guadalajara cemetery, across from a two-story building used by Delta, detailed handwritten Federal Police records show.\nDelta reports directly to CJNG head Oseguera, according to a cartel organization chart from Mexico´s National Guard. In 2021, a Mexican court convicted Delta gunmen for the Guadalajara attack.\nAgents crept into the bright orange house through the garage. Moving upstairs, they found 36 weapons, including grenade launchers and nearly 8,000 rounds of ammunition, the police records said.\nMembers of the Jalisco New Generation Cartel (CJNG) pose for a photo at an undisclosed location, in Michoacan state, Mexico, October 15, 2022\nMembers of the Jalisco New Generation Cartel (CJNG) pose for a photo as a drone overflies an armoured vehicle at an undisclosed location, in Michoacan state, Mexico, July 1, 2021\nA female member of the Jalisco New Generation Cartel (CJNG) keeps watch at an undisclosed location, in Michoacan state, Mexico, October 15, 2022\nA member of the Jalisco New Generation Cartel (CJNG) stands next to an armoured vehicle at an undisclosed location, in Michoacan state, Mexico, July 1, 2021\nA Jalisco ballistics lab report showed 27 of the firearms were traced to the United States. It did not establish if the weapons were used in the attack.\nBut one of them, a Barrett .50 caliber registered as Gun #31 in the report, led investigators to Wisconsin.\nSHOOTERS' SPORTS CENTER\nSloan traced the weapon to Shooters' Sports Center, a Racine gun shop, where a man called Elias Cobian picked it up on April 9, two months before the Guadalajara raid, according to ATF trace data and purchase records shown by store employees.\nTwo days after Elias picked up the gun, on April 11, his brother Oswaldo Cobian picked up another .50 caliber, the records show. Oswaldo picked up another one a couple of months earlier. Shooters' Sports Center declined to say how much the weapons had sold for.\nThe Cobian brothers are cousins of Victor Cobian. ATF investigation documents allege the cousins worked together closely to traffic weapons.\nVictor's older brother, Marco Cobian, said he was surprised when he heard early in 2018 that an associate of Elias and Oswaldo was going around asking people to buy guns. Later, when Elias and Oswaldo got in trouble, it 'all made sense,' said Marco, who lives in the Racine area and works construction.\nOne successful recruit was Elias and Oswaldo's friend and coworker at an energy infrastructure company, a local man called Patrick Finnell.\nOn July 10, Finnell walked out of Shooters' Sports Center with another Barrett .50 caliber. In an interview, Finnell confirmed buying the weapon. The rifles bought by Finnell and the Cobian brothers were identified in the indictment as being picked up at the store to be trafficked into the arsenal of CJNG.\nFinnell said in the interview he bought the weapon on behalf of the brothers, who he said told him the gun was going to Mexico, adding he thought 'they were full of shit.' Finnell didn't respond to follow-up interview requests.\nThe brothers and Finnell are not charged or named in the Wisconsin indictment, which connects the guns they picked up at Shooters' Sports Center to three unidentified co-conspirators. The brothers could not be contacted for comment. The Wisconsin Eastern District Attorney said it could not comment on individuals not named in the indictment.\nShooters' Sports Center was lucky to sell one Barrett .50 caliber in a normal year, employees said. In just six months in 2018, the crew had picked up four from the store.\nA sign points the way to the Racine County Line Rifle Club in Racine, Wisconsin, U.S., June 28, 2023\nAn employee at the Shooter's Sports Center shows a .50 Caliber Barrett M107A1 semi-automatic rifle to Reuters at the gun store in Racine, Wisconsin, U.S., June 26, 2023\nView of a .50 Caliber Barrett M107A1 semi-automatic rifle at a gun store in Racine\nA water tower stands over the small industrial town of Racine\nA flag that combines the U.S. and Mexican flags flies outside a home in Racine\nIn Wisconsin, licensed dealers can legally sell multiple high-caliber semi-automatic rifles to adults. 'We do not condone the illegal movement of firearms,' store owner Bernie Kupper said in an email. He said it was not unusual for people to refer friends and family to the store.\nFinnell himself bought three more .50 calibers in the Racine area, the first source close to the investigation said. Finnell declined to either confirm or deny whether he bought more for the brothers, saying he would 'rather leave that to the side.'\nThe rash of sales of .50 calibers caught the eye of Wisconsin agents from ATF's field offices in Milwaukee, according to the first source, who requested anonymity to speak freely.\nOver the next few months, the agents dug further.\nQUARTER OF A MILLION GUNS\nIn the past three years alone, Mexican authorities have seized 300 .50 calibers, a record, according to previously unpublished data collated by the Mexican attorney general's office.\nOnce in Mexico, the gun's black market value increases to between $30,000 and $50,000, according to Demlein and Sloan.\nThe great majority of illegal guns in Mexico come from the United States, Mexican and U.S. authorities say. A 2013 University of San Diego study estimated a quarter of a million guns illegally cross the border each year.\nMexico, a country of 127 million people, has tight gun laws - and just a single gun store, located on a military base. By contrast, the United States has nearly 78,000 gun dealers - more than the combined number of McDonald's, Burger King, Subway and Wendy's franchises, according to gun-control advocates Everytown for Gun Safety.\nAfter Mexico launched its drug war in 2006, homicides tripled. Nearly 400,000 Mexicans have been killed, increasingly with firearms. According to Mexico City's Ibero University, guns were responsible for nearly three quarters of murders last year.\nPowerful weapons poured over the border after a U.S. ban on assault rifles expired in 2004, fueling an arms race between criminal groups and Mexican security forces, said Romain Le Cour, a violence researcher in Mexico.\n'Cartels have become more militarized. Their firepower has shot up,' Le Cour said.\nA combination photograph show the homes of Victor Cobian, Oswaldo and Elias Cobian and Patrick Finnell, which were raided by the ATF in 2019 in Wisconsin, U.S., June 27, 2023\nVictor's Again bar, which is owned by Maria Cobian, the mother and aunt of members of the Cobian family investigated by U.S. authorities in an arms trafficking case, in the town of Oak Creek, Wisconsin\nAn employee shows a .50 Caliber Barrett M107A1 semi-automatic rifle to Reuters at the Shooters' Sports Center gun store in Racine\nThe parking lot of a closed K-Mart, where in 2018 law enforcement gathered for a series of raids in the 'Grin and Barrett' case to break up an ongoing operation to legally purchase .50 Caliber Barrett sniper rifles in Racine that were then smuggled to the Jalisco New Generation Cartel (CJNG) in Mexico\nAs well as tighter U.S. gun laws, Mexico needed to improve its own border security and intelligence on gun trafficking, he said. 'They need a disarmament campaign and they need to target the black market.'\nIn the United States, complex gun trafficking investigations that link together cases across multiple states are relatively rare. Compared to efforts to stop drugs moving north, until recently few laws or resources were dedicated to preventing guns moving into Mexico.\nMexican officials are vocal about this disparity at a time when some Republican Party politicians are calling for the U.S. government to send troops into Mexico or drop bombs on cartels as a plank for the 2024 election campaign. Hundreds of thousands of Americans have died from opioid overdoses in recent years.\n'The financial, economic and military power of the Mexican cartels comes from the United States,' said Alfredo Femat, head of the Mexican lower house of Congress foreign relations committee. U.S. guns give drug cartels the 'capacity to wage war' and Mexico pays a heavy human price, he added. Mexico expected the United States to do more to stem the flow of weapons, he said, while acknowledging Mexico should intensify its own efforts.\nMexico is suing nine major gun companies, including Barrett, for $10 billion in damages, arguing the availability of their weapons exacerbates the drug war's carnage.\nThe companies argued in court that Mexico failed 'to control cartel violence within its own borders.' A Boston court dismissed the case, saying federal law 'unequivocally' bars lawsuits seeking to hold gun manufacturers responsible when people use guns for their intended purpose. Mexico has appealed. Barrett did not respond to questions about the case.\nThe Biden administration introduced tougher sentencing for arms trafficking last year. The bill passed with the help of 14 Republican members, while 193 Republican members voted against it, in line with the party's opposition to restrictions on gun rights.\nIn four U.S. states along the Mexico border, federal rules adopted a decade ago to combat rampant trafficking mean gun dealers must report multiple purchases of certain high caliber rifles. In Wisconsin and many other states, there are no such requirements.\nThe indictment says the network also bought FN SCAR assault rifles for CJNG. Belgium's FN Herstal, which makes the gun, said it commends U.S. law enforcement for investigating illegal networks, saying its US-made firearms are only intended for the Defense Department, law enforcement 'and the most reputable authorized dealers.' FN Herstal is not mentioned in the Mexican lawsuit.\nJALISCO HOMETOWN\nIn 1976, Victor Cobian's father, Victoriano Cobian, asked his girlfriend Maria to marry him and move to Racine from Tonaya, a small agave farming town in Jalisco, Maria said in an interview. It was already common for people from Jalisco to migrate to and from Wisconsin, first for farm work, then for better paying factory jobs.\nVictor's cousins Elias and Oswaldo Cobian followed north several decades later. By then, CJNG frequently battled security forces in the area around Tonaya. The town is often described in Mexican media as a hideout for CJNG leader Oseguera.\nVictor's Again bar owner Maria Cobian, the mother and aunt of members of the Cobian family who are being investigated by U.S. authorities in an arms trafficking case, in the town of Oak Creek, Wisconsin\nAn employee shows a .50 Caliber Barrett M107A1 semi-automatic rifle to Reuters at the Shooters' Sports Center gun store in Racine\nMarco Cobian, whose brother has been indicted by U.S. authorities in an arms trafficking case, talks to Reuters in his garage in Racine\nVictoriano and Maria Cobian kept close ties to Tonaya, visiting at least once a year, often with the kids, their oldest son Marco said in an interview. Marco and Maria denied any knowledge about the alleged gun trafficking. Victoriano passed away in 2013.\nVictor Cobian, speaking on his driveway in Racine, said he was unjustly associated with alleged gun-running honcho Cisneros because of their family ties. He said he only knew Cisneros in passing, on the street during family visits to Tonaya.\nVICTOR'S AGAIN\nIn October 2018, agents investigating the Cobian cousins got a break. Local police in Oak Creek, a city neighboring Racine, found multiple storage cases for high caliber firearms in a red dumpster at a construction site, according to the indictment and the two sources close to the investigation. The sources said they suspected the discarded cases were a sign weapons were being trafficked. Oak Creek police declined to comment.\nThe dumpster was near Victor's Again, a bar that Victor Cobian's parents opened in 1991 and named after him.\nAfter the find, agents set up a pole camera facing Oswaldo Cobian's house, one of the sources close to the investigation said. Agents staked out Victor Cobian's home. They gathered bank and phone records and set up surveillance on the bar and other Cobian family member homes, the source said.\nOn February 28, 2019, after gathering intelligence for four months, agents saw the brothers carrying two FN SCAR assault rifles into Oswaldo's garage, both sources said.\nOne of the sources said agents were worried the guns would be moved to the border. They secured a search warrant in less than 24 hours, according to an internal ATF presentation.\nIn the parking lot of an abandoned KMart the next afternoon, around 75 agents from ATF, local police, FBI, and Homeland Security Investigations gathered. Backed by BearCat SWAT vehicles, they raided the homes of Patrick Finnell and Victor, Oswaldo and Elias Cobian, among others.\nAgents recovered 52 firearms, including the two FN SCARs, one of the sources said.\nNo .50 caliber Barrett rifles were found. But Victor Cobian was arrested at his house with three empty Barrett cases and a conversion kit to turn weapons into fully automatic machine guns, according to the source.\nAlso found were two Colt 1911 pistols sporting gold-plated grips and ornately decorated with cartel insignia, the presentation showed.\nVictor said the conversion kit wasn't his. He said he embellished the pistols in homage to his home state of Jalisco and his love of gangster TV shows.\nOne of the pistols, the presentation showed, was engraved with San Judas Tadeo, a saint popular with Mexican narcotraffickers. The other was inlaid with a gold 50-peso coin, similar to coins stolen during a heist of Mexico's Central bank in 2019. Carved below the coin were the letters 'CJNG.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "How a single sniper rifle uncovered America's gun pipeline to the cartels: Weapon seized deep in Mexican gangland led US investigators to Wisconsin town where $600,000-a-year arms smuggling business w", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12856731/america-guns-pipeline-mexico-cartels.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}