{"authors": ["Bethan Mckernan", "Sufian Taha"], "date_download": "2024-02-05 15:25:59", "date_modify": "None", "date_publish": "2023-12-16 18:23:29", "description": "Residents of Jenin say Israeli army seems intent only on revenge as they pick through wreckage of their homes", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F16%2Fisrael-force-support-hamas-soars-west-bank-october-attack.json", "image_url": "https://i.guim.co.uk/img/media/6c72c03b1e937876fbd7e9fb312444ff75c07927/0_355_5328_3197/master/5328.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=fa9087ddabde8ebdc90519856cd61b16", "language": "en", "localpath": null, "maintext": "Fluffy pink slippers on her feet and scarves thrown over her hair and pyjamas, Amal Abu Ghazi, 39, leaned against a wall as she watched her family clear out the rubble from their ruined house in the Jenin refugee camp, in the north of the occupied West Bank.\nHer husband used a stick to smash the remaining shards of glass out of the window frames of their two-storey home and her brothers-in-law hauled out the remains of sofas and tables; somehow, a laptop had managed to survive intact. Israeli soldiers had burst in two nights ago, Abu Ghazi said, arresting her sons, 20 and 18, and ordering the rest of the family to wait outside before troops used explosives to demolish the building.\n“I can’t tell you why. They have been here so many times and they know our family has nothing to do with politics or resistance,” she said.\nIn July this year, the Jenin camp experienced the worst spasm of violence in the West Bank in 20 years in the form of a two-day-long Israel Defense Forces (IDF) incursion that used airstrikes designed to flush out Palestinian militants. Twelve people were killed, including at least three civilians.\nAt the time, it was the biggest Israeli operation in the territory since the second intifada, or Palestinian uprising. But in the wake of 7 October, when Hamas gunmen from the Gaza Strip killed 1,139 Israelis in a devastating surprise attack, raids on this scale have become routine in Jenin and other restive areas of the West Bank.\nAnother 12 people were killed in last week’s raid on Jenin’s camp and about 100 arrested, according to the Palestinian Prisoners Club, a non-governmental rights group. While war is still raging in the Gaza Strip, where nearly 19,000 lives have been lost, the Israeli media has now dubbed Jenin’s slum-like camp “Little Gaza”.\nThe spiralling bloodshed is fuelling both armed Palestinian resistance and popular support for groups such as Hamas, several residents of the Jenin camp said during the Observer’s visit.\n“The army has used my house as a firing position for snipers three times now in the last month,” said 64-year-old Abu Ali as he clambered through his damaged home. “My father was a martyr in the second intifada. My son lives in Europe, far away from this hell, but the youth of the camp, of course they are fighting back. We are just in our homes, and the Israelis come to us, not the other way around.”\nView image in fullscreen Scenes of destruction in Jenin following an Israeli incursion into Jenin refugee camp this week which killed 12 people.\nPhotograph: Anadolu/Getty Images\nThe camp in Jenin is home to around 10,000 Palestinians whose grandparents fled their homes after the creation of Israel in 1948, and it has long been a centre of resistance to the 56-year Israeli occupation of the Palestinian territories. Today it still suffers from high rates of poverty, crime and unemployment.\nA new generation of fighters here, calling themselves the Jenin Brigades, is only loosely affiliated with the traditional Palestinian factions such as Fatah, Hamas and Islamic Jihad. But Hamas, in particular, is riding a wave of newfound popularity in the West Bank in the aftermath of 7 October, polling from the Palestinian Centre for Policy and Survey Research suggests.\nDespite the devastation caused by the new war, support for Hamas had risen in Gaza and more than tripled in the West Bank. Fifty-two percent of Gazans and 85% of West Bank respondents - or 72% of Palestinian respondents overall - voiced satisfaction with the role of Hamas in the war.\nJust 10% of the poll’s 1,712 respondents said they had seen evidence that Hamas committed war crimes during the 7 October attack, despite the fact that extreme violence towards Israeli civilians has been well documented by the international media.\nSupport for Hamas among the Palestinian public has typically spiked during recent conflicts, lead pollster Khalil Shikaki said. The group appears to have also earned significant goodwill for securing the release of 240 Palestinian women and children held in Israeli jails in return for 100 hostages, mostly Israeli, during the week-long ceasefire in Gaza at the end of November.\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nShikaki’s research also found waning patience with the West Bank’s semi-autonomous Palestinian Authority (PA). After 17 years without elections, President Mahmoud Abbas’s administration is widely seen as corrupt and illegitimate: 90% of respondents said that the 88-year-old should resign.\nViewed by many Palestinians as little more than a subcontractor for the Israeli occupation, the PA has no presence or legitimacy in Jenin’s camp and other restive areas such as the Nablus casbah and the Balata and Tulkarm camps.\nThe much-touted idea that the PA should assume responsibility for the Gaza Strip after the war, nearly two decades after being driven out by Hamas, seems ludicrous in the face of such fierce domestic opposition. It has long been feared that Abbas’s death will create a dangerous power vacuum in the West Bank: he has refused to appoint an official successor.\n“Where is the PA when we are arrested and beaten, when the Israelis handcuff us, blindfold us and make us sing Israeli songs at gunpoint?” said 34-year-old Abu Mahmoud. “This week they burned cars for fun and celebrated and they graffitied the mosque and our homes with the Star of David. Before, there were some rules when the army came; now there are not. They act like they are looking for revenge.”\nThe IDF did not immediately respond to a request for comment on the allegations made by the residents of Jenin camp. The army previously told the Observer that it operates in the camp – and everywhere else in the West Bank – in order to minimise the threat of terrorist attacks.\n“Abbas believed in peace,” said Abu Ali, referring to the long dormant peace process with Israel of the 1990s. “Thirty years later, it is clear that dream is over. We have learned that Israel only responds to force, and force must be met with force.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘Israel only responds to force’: support for Hamas soars in West Bank after October attack", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/16/israel-force-support-hamas-soars-west-bank-october-attack"}