{"authors": [], "date_download": "2024-02-05 15:26:00", "date_modify": "None", "date_publish": "2023-12-15 15:44:24", "description": "The race to replace George Santos is set to be close after he was expelled from Congress", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fgeorge-santos-replacement-b2464732.html.json", "image_url": "https://static.independent.co.uk/2023/12/13/19/GettyImages-1824779422%20%281%29.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nNew York Republicans have selected Nassau County legislator Mazi Melesa Pilip as their nominee to replace George Santos after he was ousted from Congress.\nMs Pilip, an Ethiopian immigrant who served as a paratrooper in the Israel Defense Forces, was selected by party leaders, one week after Democratic leaders picked former Rep Tom Suozzi as their nominee to replace Mr Santos.\nHer nomination was confirmed by National Republican Congressional Committee spokeswoman Savannah Viar.\nThe two candidates will only have a short amount of time to campaign, with a special election due to take place on 13 February.\nNRCC Chairman Richard Hudson described Ms Pilip as a “formidable candidate with a unique biography.”\n“A former IDF paratrooper and mother of seven, Mazi’s incredible life stands in stark contrast to career politician Tom Suozzi, who uses his office to make life better for himself instead of his community,” he said.\nMs Pilip is a relative political newcomer. She first won election to the Nassau County legislature in 2021 and won re-election last month.\nGeorge Santos leaves the US Capitol after being expelled on 1 December (Getty Images)\nDespite running as a Republican, Ms Pilip is a registered Democrat, according to The New York Times.\nMeanwhile, Suzan DelBene, who chairs House Democrats’ campaign arm, described Ms Pilip as “serial fraudster George Santos’ close friend” and a “MAGA extremist.”\n“The people of NY-03 have made it clear that they want honest, responsible representation from a steady hand and a trusted leader, yet New York Republicans selected Mazi Melesa Pilip — who recently campaigned with MAGA extremist Mike Johnson and previously endorsed serial fraudster George Santos,” House Majority PAC New York press secretary Alisha Heng added.\nNassau County legislator Mazi Melesa Pilip (John Lamparski/Sipa USA/AP)\nThe special election comes after Mr Santos, who is currently facing a 23-count federal indictment, was expelled from Congress earlier this month after the House Ethics Committee released a report which outlined “substantial evidence” that the former congressman had violated federal law.\nIn the report, Mr Santos was accused of lying about loaning personal money to his 2022 congressional campaign, then “paying himself back” for the fake loans using campaign funds.\nHe also used donor money to splash out on personal indulgences such as Botox, Hermes merchandise, vacations to the Hamptons and Las Vegas, and on OnlyFans, the committee found.\nHe has pleaded not guilty to all the charges against him.\nThe race to replace him is set to be close given the Republicans’ small majority in the House. President Joe Biden previously carried the district by eight percentage points in 2020, according to calculations from Daily Kos Elections. Mr Santos won the district two years later, also by an eight-point margin.", "source_domain": "www.independent.co.uk", "text": null, "title": "Who is the proposed replacement for George Santos?", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/george-santos-replacement-b2464732.html"}