{"authors": ["Adam Fulton", "Gloria Oladipo", "Harry Taylor", "Tom Bryant"], "date_download": "2024-02-05 15:26:01", "date_modify": "None", "date_publish": "2023-12-15 03:35:31", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F14%2Fisrael-gaza-war-live-updates-hamas-leader-power-palestine.json", "image_url": "https://i.guim.co.uk/img/media/7ab607c7323b61228c30ed1b466a6f6fb082d72f/0_205_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=202d55a3a24bfdfb8be4c5ca09e79273", "language": "en", "localpath": null, "maintext": "15 Dec 2023 04.28 CET Closing summary It’s almost 5.30am in Gaza City and Tel Aviv and we’re about to close this blog. Our live coverage will resume later today. Here’s an overview of the latest key developments. And you can find all our Israel-Gaza war coverage here. Thank you for reading. The Palestinian Authority “will look to ultimately have a role in Gaza” and that is something the US is talking about with them, according to a senior US official . The comments came as the US said the White House’s national security adviser, Jake Sullivan, would meet with the Palestinian president, Mahmoud Abbas, in Ramallah on Friday.\nUS president Joe Biden and Sullivan discussed scaling back Israel’s high-intensity operations in Gaza with Israeli prime minister Benjamin Netanyahu , Reuters reported a senior US official as saying. Sullivan told Israel’s Channel 12 television he had “constructive” talks with Netanyahu about Israel shifting to a more precise and targeted phase of operations, without giving details or a timeline. The New York Times reported the US was pushing for a shift by new year.\nBiden has said he wants Israel to “be focused on how to save civilian lives” in Gaza . He said that meant “not stop going after Hamas, but to be more careful”. A White House spokesperson said it wanted Israel’s war in Gaza to “end as soon as possible” but that the US was not dictating a timeline to Israel.\nAll communication and internet services were completely cut off in Gaza on Thursday, Palestinian telecommunication companies said. The update came from the territory’s main telecommunication companies, Paltel and Jawwal.\nThe Israeli military said soldiers were facing disciplinary action after violating its code of conduct during an “operational activity” near a mosque in the West Bank city of Jenin. The soldiers were seen on video singing Hanukkah songs and mocking the Islamic call to prayer over loudspeaker in the mosque during a raid. The incident came during three days of raids in the occupied West Bank, during which Israeli troops killed 12 Palestinians, including one youth shot dead at a hospital, Palestinian officials and international health charities said.\nThe Palestinian Football Association says it has documented the killing of 85 Palestinian athletes , including 55 football players and 30 players in other sports, since the start of the war, the Palestinian news agency Wafa reported. The association said in a report on Thursday that Israeli forces “targeted Palestinian athletes and sports facilities, especially football players and club presidents, administrators, referees and others”, according to Wafa.\nAt least 18,787 Palestinians have been killed and 50,897 wounded in Israeli strikes on Gaza since 7 October, a spokesman for the Hamas-run Gaza health ministry said on Thursday.\nUpdated at 04.35 CET\n15 Dec 2023 03.45 CET Eighty-five Palestinian athletes killed in war, Palestinian report says The Palestinian Football Association says it has documented the killing of 85 Palestinian athletes, including 55 football players and 30 players in other sports, since the start of the war, the Palestinian news agency Wafa is reporting. The association said in a report on Thursday that Israeli forces “targeted Palestinian athletes and sports facilities, especially football players and club presidents, administrators, referees and others”, according to Wafa. The report said the football players killed included 18 children and 37 youths, including two in the West Bank, while four players were wounded in the Gaza Strip between 7 October and 6 December. It said Israeli bombing had led to the destruction of nine sports facilities – four in the West Bank and five in the Gaza Strip. The report said Israeli forces detained three athletes in the West Bank, while in the Gaza Strip the number “is infinite in light of the number of missing people there”.\nUpdated at 03.46 CET\n15 Dec 2023 03.23 CET Hospitals in southern Gaza are overwhelmed and staff are struggling to meet the needs of pregnant women and newborns, the UN sexual and reproductive health agency (UNFPA) says. In a video the agency posted on X (formerly Twitter), it says just five hospitals are still functional in Gaza’s south, where most of the strip’s population of more than 2 million is now located. In the video, which shows footage from inside Nasser hospital in Khan Younis, southern Gaza’s biggest city, a 19-year-old expectant mother says that “nowhere is safe”. The area where we were staying was bombed, so we came to the hospital, but there was bombing in this area as well. I mean, there was bombing while we were on the street. There was barely any distance between us and the bombing yesterday. \"Nowhere is safe,\" says 6 months pregnant Nussaiba.\nShe places her life at risk every time she goes for check-ups at Nasser Hospital in #Gaza.\nSee how @UNFPA—the @UN sexual and reproductive health agency—is taking action to make #motherhood safer: https://t.co/ZUIn0Ek0JO pic.twitter.com/OnZ8XjlwFv — UNFPA (@UNFPA) December 14, 2023 The woman says she also has a nine-month-old daughter she is breastfeeding. When I’m out of milk, I can’t manage to get her more, not even diapers. I also need medication. There’s none in the hospital or in the clinic. ... and this also harms my fetus. The woman says coming to the hospital for pregnancy check-ups is difficult and she needs to come on foot because “there is no functional transportation to get here” or to return home. Because of the ongoing bombing, I could suffer a miscarriage at any moment ... There is no safety in the hospital, at home or at the school. Nowhere is safe.\n15 Dec 2023 02.52 CET The Israeli military has rounded up hundreds of Palestinians across northern Gaza, separating families and forcing men to strip to their underwear before transporting some to a detention camp where they spent hours or in some cases days subjected to hunger and cold, according to human rights activists, relatives and released detainees. Associated Press reports that Palestinians freed from detention in the northern town of Beit Lahiya, the Jabaliya refugee camp and Gaza City said they were bound, blindfolded and bundled into the back of trucks. Some said they were taken to the camp at an undisclosed location, nearly naked and with little water. Ibrahim Lubbad, a 30-year-old computer engineer arrested in Beit Lahiya on 7 December with a dozen other family members and held overnight, said: We were treated like cattle, they even wrote numbers on our hands. The roundups have laid bare an emerging tactic in Israel’s ground offensive in Gaza, experts say, as the military seeks to solidify control in evacuated areas in the north and collect intelligence about Hamas operations. View image in fullscreen Palestinians search the rubble of destroyed buildings in Beit Lahiya, northern Gaza, last month. Photograph: Mohammed Hajjar/AP In response to questions about alleged mistreatment, the Israeli military said detainees were “treated according to protocol” and given enough food and water. Military spokesman R Adm Daniel Hagari said the men were questioned and then told to dress, and that in cases where that didn’t happen, the military would ensure it did not occur again. Those believed to have ties to Hamas were taken away for further interrogation, and dozens of Hamas members had been arrested, he said. Photos and video showing Palestinian men kneeling in the streets, heads bowed and hands bound behind their backs, have sparked outrage after spreading on social media.\nUpdated at 02.59 CET\n15 Dec 2023 02.19 CET Demonstrations are occurring across the United States calling for a ceasefire in Gaza, as we reported earlier. The Jewish American group IfNotNow has just posted on X that in Boston, protesters shut down the city centre’s biggest intersection for all of peak hour. Tonight hundreds of Jews + allies shut down the biggest intersection in downtown Boston for all of rush hour.\nUntil the U.S. government follows the will of the people and calls for a ceasefire, we have to keep being impossible to ignore.\nIt's life and death. pic.twitter.com/RQzsxa1jXP — IfNotNow🔥🕎 (@IfNotNowOrg) December 15, 2023\nUpdated at 02.21 CET\n15 Dec 2023 01.46 CET A ballistic missile attack launched from a Houthi-controlled area of Yemen towards an international shipping lane in the Red Sea did not cause any damage or injuries, US Central Command (Centcom) says. Following the missile launch, north of the Bab al-Mandab Strait on Thursday midday, “the M/V Maersk Gibraltar was hailed by the Houthis, who threatened further missile attacks”, Reuters quoted Centcom as saying later in the day on X (formerly Twitter). It added: While this incident did not involve US forces, we continue to closely monitor the situation. A senior Houthi official on Tuesday warned cargo ships in the Red Sea to avoid travelling towards Israel and the occupied territories, after the Iran-aligned group claimed an attack on a commercial tanker earlier in the day. In solidarity with Palestinians under attack from Israel in Gaza, the Houthis are using their control of Yemen’s western seaboard to mount attacks on what they regard as shipping linked to Israel. They said last Saturday that they would target all ships heading to Israel, regardless of their nationality, and warned international shipping companies against dealing with Israeli ports.\nUpdated at 01.55 CET\n15 Dec 2023 01.06 CET Palestinian Authority 'will look to ultimately have role' in Gaza, says US official The Palestinian Authority “will look to ultimately have a role in Gaza” and that is something the US is talking about with them, according to a senior US official. The comments came as US officials said the White House’s national security adviser, Jake Sullivan, would meet with the Palestinian president, Mahmoud Abbas, in Ramallah on Friday about the war in Gaza and ensuring that the Hamas attack on Israel on 7 October is never repeated, Reuters reports. Sullivan would discuss “ongoing efforts to revamp and revitalise” the Palestinian Authority and reining in “extremist settler violence” against Palestinians in the occupied West Bank, said one of the officials, who declined to be named. Sullivan said on Thursday that governance of the West Bank and Gaza Strip needed to be connected under a refurbished Palestinian Authority. View image in fullscreen Jake Sullivan: to meet Palestinian president Mahmoud Abbas in Ramallah on Friday. Photograph: Samuel Corum/EPA The official said US-trained Palestinian security forces had performed “incredibly well” in preventing violence instigated by Hamas in the West Bank after the 7 October attack and there were a number of personnel there that could form “some sort of a nucleus” for a future force in the months following Israel’s military campaign. The official said: This is something we’re discussing with the Palestinians and with the Israelis and with regional partners. And it very much remains a work in progress. That is one idea of many. The US president, Joe Biden, remained strongly committed to a two-state solution, but that could not happen as long as Hamas remained the dominant power in Gaza, the official added, also saying: The Palestinian Authority will look to ultimately have a role there, and that is something we are talking about with them.\nUpdated at 01.23 CET\n14 Dec 2023 00.47 CET Peter Beaumont Israel will fight on until “absolute victory against Hamas”, the country’s prime minister, Benjamin Netanyahu, has told a senior official from the Biden administration, as another minister said the war could last “more than several months”. Netanyahu’s comments were made to Jake Sullivan, Joe Biden’s national security adviser, during a visit to Israel hours after its defence minister, Yoav Gallant, told Sullivan that many more months were needed to defeat Hamas in Gaza. A statement from Netanyahu’s office said: I told our American friends our heroic fighters have not fallen in vain. From the deep pain of their falling, we are more determined than ever to continue to fight until Hamas is eliminated – until absolute victory. Gallant earlier told Sullivan, apparently contradicting bullish daily updates from Israel’s military about the progress of its campaign, that the war “will require a period of time – it will last more than several months”. He said Hamas had “built infrastructure under the ground and above the ground and it is not easy to destroy them”. The comments were a clear rebuff to the Biden administration, which has been pressing Israel to wind down its offensive, after the US president warned earlier this week that Israel was losing international support. The full report is here: Israel tells US it needs ‘months’ to defeat Hamas Read more\nUpdated at 00.51 CET\n14 Dec 2023 00.32 CET The Turkish president has said the United States has a “historic responsibility” to ensure a ceasefire between Israel and Hamas, warning of the “negative regional and global consequences” of the conflict. Recep Tayyip Erdoğan spoke on the phone with the US president, Joe Biden, in their first talks since 7 October, when Hamas’s unprecedented attack on southern Israel sparked the war, Agence France-Presse reports. The Turkish presidency said in a statement after the call: President Erdogan stated that the intensification and prolongation of Israeli attacks could have negative regional and global consequences. Withdrawal of the United States’ unconditional support for Israel can guarantee a rapid ceasefire. Erdogan has been one of the Muslim world’s most vocal critics of Israel’s military tactics in Gaza. This is Adam Fulton picking up our live coverage. Keep with us for all the latest developments as they unfold\nUpdated at 00.37 CET\n14 Dec 2023 00.09 CET Summary It is just after 1.00 am in Gaza. Here’s what happened today: Joe Biden said that he wants Israel to stay focused on how to save civilian lives in Gaza . “I want them to be focused on how to save civilian lives, not stop going after Hamas, but to be more careful,” the US president said on Thursday.\nBiden’s national security adviser advised Israel to end its ground campaign in Gaza, and carry out a more targeted offensive in its war in Gaza , the New York Times reported. Jake Sullivan advised Israel to change its war tactics within three weeks or less.\nA spokesperson for the White House said that it wants Israel’s war in Gaza to “end as soon as possible” , but added that the US is not dictating a timeline on when the fighting should end to Israel.\nAll communication and internet services were completely cut off in Gaza, Palestinian telecommunication companies announced on Thursday. The latest update came from the territory’s main telecommunication companies, Paltel and Jawwal.\nThe Israel Defense Forces (IDF) announced on Thursday that soldiers faced discipline after violating the IDF’s code of conduct during an “operational activity” near a mosque in the city of Jenin. The IDF soldiers were seen on video singing Hanukkah songs in a mosque they had raided. Thank you for reading. My colleague in Australia will now be handling updates to this blog.\n14 Dec 2023 23.50 CET Unguided bombs are used in nearly half of all Israeli airstrikes in Gaza, the Washington Post reports. A US intelligence assessment found that Israel has been using “dumb bombs”, also known as unguided bombs, in almost half of all airstrikes fired in Gaza. The use of the unguided munition may explain the staggering civilian death toll in Gaza, where nearly 18,000 Palestinian people have been killed in the territory. According to unnamed officials familiar with the assessment, only 55 to 60% of all airstrikes used in Gaza have been precision guided. Read the full article here [pay wall].", "source_domain": "www.theguardian.com", "text": null, "title": "Biden says he wants Israel to focus on ‘how to save civilian lives’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/14/israel-gaza-war-live-updates-hamas-leader-power-palestine"}