{"authors": [], "date_download": "2024-02-05 15:26:02", "date_modify": "None", "date_publish": "2023-12-15 21:33:53", "description": "IDF identifies hostages killed as Yotam Haim, Alon Shamriz and Samer El-Talalqa, saying they were mistakenly believed to be a threat", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F15%2Fisraeli-military-says-its-troops-shot-and-killed-three-hostages-by-mistake.json", "image_url": "https://i.guim.co.uk/img/media/cb40d855b0af99103c6d71db9fd56e4a9d50af9c/0_0_630_378/master/630.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=da8e07fe86239ef3d87b1e0a54cd0c5c", "language": "en", "localpath": null, "maintext": "The Israeli military has said that its troops shot and killed three hostages being held by Hamas after mistakenly identifying them as a threat during fighting in a battle-torn neighbourhood of Gaza City.\nThe announcement on Friday came amid heavy fighting across the embattled territory that led to an influx of dead and wounded into hospitals in Deir al-Balah, Khan Younis and Rafah.\nSeparately, the Qatar-based television network Al Jazeera said that one of its journalists was killed and and another was injured in a drone strike while reporting in Khan Younis.\nThe army identified the three killed hostages as Yotam Haim and Alon Shamriz, who were taken from Kfar Aza kibbutz during Hamas’s 7 October attack, and Samer El-Talalqa, taken from Nir Am kibbutz.\nThe hostages were killed in the Gaza City area of Shejaiya, where troops have been engaged in fierce fighting with Hamas militants in recent days.\nThe exact circumstances of their deaths were not immediately clear. In a statement late on Friday, the Israel Defense Forces (IDF) said: “During combat in Shejaiya, the IDF mistakenly identified three Israeli hostages as a threat. As a result, the troops fired toward them and they were killed.”\nArmy spokesperson Rear Adm Daniel Hagari said it was believed that the three had either fled their captors or been abandoned. “Perhaps in the last few days, or over the past day – we still don’t know all the details – they reached this area,” he said. He said the army expressed “deep sorrow” and was investigating.\nIsrael’s prime minister, Benjamin Netanyahu, said in a statement: “Together with the entire people of Israel, I bow my head in deep sorrow and mourn the death of three of our dear sons who were kidnapped. My heart goes out to the grieving families in their difficult time.”\nAl Jazeera initially said that video journalist Samer Abu Daqqa and its chief correspondent in Gaza, Wael al-Dahdouh, had been injured by shrapnel when they were reporting at a school that had been hit by an earlier airstrike.\nIn a subsequent statement condemning the Israeli military, Al Jazeera attributed the injuries to a drone strike: “Following Samer’s injury, he was left to bleed to death for over five hours, as Israeli forces prevented ambulances and rescue workers from reaching him, denying the much-needed emergency treatment.”\nDahdouh, who lost several members of his family in Israeli bombings last month, was wounded in the arm and transferred to Nasser hospital in Khan Younis.\nEarlier on Friday, the IDF recovered the bodies of three other hostages in Gaza: Elya Toledano, 28, a French-Israeli civilian, and two soldiers, Nik Beizer and Ron Scherman, both 19.\nThe military said they were identified in a process carried out by medical officials, military rabbis and forensic experts. It did not give further details of the circumstances of their death, or from where in Gaza they were recovered.\nAbout 240 people were taken hostage when Hamas gunmen breached the separation barrier into Israel on 7 October and killed 1,200 people, mostly civilians.\nIsrael’s ensuing offensive in Gaza has killed more than 18,700 people, mostly women and children, according to Palestinian officials.\nThe Israeli government has repeatedly stated that bringing home all of the hostages is one of its chief war aims. But in seven weeks since ground troops pushed into northern Gaza, troops have not rescued any hostages, though they freed one early in the conflict and have found the bodies of several more.\nFamilies of the hostages said this week they were “shocked” by the announcement by the director of Israeli intelligence agency the Mossad that he was refusing to conduct new negotiations to free them, and demanded an explanation from the authorities.\nDuring a week-long truce in late November, Hamas released more than 100 women, children and foreigners it was holding in Gaza in exchange for the release of 240 women and teenagers Israel had imprisoned, many without charge.\nAccording to the Israeli military, more than 130 of the hostages taken to Gaza are still being held. Some have been declared dead in absentia by Israeli authorities.\nThe Palestinian Prisoners’ Association said Israel has detained more than 4,400 Palestinians since 7 October and is holding around half without charge.\nToledano, who turned 28 in captivity, was among an estimated 240 people taken hostage during the Hamas attacks in southern Israel. A resident of Tel Aviv, he was at the Nova music festival along with his friend and fellow French-Israeli Mia Schem, who was released under a truce agreement at the end of November.\nThe two friends had tried to flee by car at the start of the attack on the Nova music festival, but their tyres were shot out. Schem had messaged other friends: “They’re shooting at us, come to help us.”\nSchem, 21, who was training to be a tattoo artist, was later shown in the first Hamas video of a hostage speaking from captivity. She was released on 30 November.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli military says its troops shot and killed three hostages by mistake", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/15/israeli-military-says-its-troops-shot-and-killed-three-hostages-by-mistake"}