{"authors": [], "date_download": "2024-02-05 15:26:03", "date_modify": "None", "date_publish": "2023-12-15 15:49:51", "description": "The Palestinian president is scheduled to meet with U.S. officials to discuss postwar arrangements for Gaza", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fisrael-ap-hamas-gaza-palestinian-b2464861.html.json", "image_url": "https://static.independent.co.uk/2023/12/15/12/Israel_Palestinians_92979.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Palestinian president was set to meet Friday with U.S. officials to discuss postwar arrangements for Gaza that could include reactivating Palestinian security forces driven out by Hamas in its 2007 takeover of the territory.\nAny role for Palestinian security forces in Gaza is bound to elicit strong opposition from Israel, which seeks to maintain an open-ended security presence there. The Palestinian Authority, led by President Mahmoud Abbas, administers parts of the Israeli-occupied West Bank but is deeply unpopular with Palestinians.\nWhile Israel has vowed to keep fighting until it wipes out Gaza's Hamas rulers, the international call for a cease-fire has grown in volume. Israel has drawn international outrage and rare criticism from the U.S. — its main ally — over the killing of civilians.\nMore than 18,700 Palestinians have been killed since Israel declared war on Hamas, according to the Health Ministry in Gaza, which does not differentiate between civilian and combatant deaths. Israel says 116 of its soldiers have died in its ground offensive after Hamas raided southern Israel on Oct. 7, killing about 1,200 people — mostly civilians — and taking about 240 hostages.\nCurrently:\n— Israel's president says now isn’t the time to discuss a two-state solution.\n— Israel’s mass arrest campaign sows fear in northern Gaza.\n— A Liberian-flagged cargo ship is hit and set ablaze by a projectile from rebel-controlled Yemen.\n— EU leaders increasingly back a humanitarian cease-fire in Gaza.\n— Find more of AP’s coverage at https://apnews.com/hub/israel-hamas-war.\nHere’s what’s happening in the war:\nROCKETS AIMED AT CENTRAL ISRAEL, RESCUE SERVICE SAYS; SIRENS BLARE IN JERUSALEM\nJERUSALEM — A rare rocket barrage directed at central Israel sent air raid sirens blaring across Jerusalem.\nIsrael’s rescue service said it had received reports of a hit Friday, but said there were no immediate casualties.\nIt was not immediately clear how many rockets had been fired, but an Associated Press reporter heard numerous launches of Israel’s Iron Dome missile defense system.\nIsraeli media reported that it was the first time in a month and a half that sirens rang in Jerusalem. Since the war began on Oct. 7, rocket barrages have been far more common in the coastal city of Tel Aviv and areas bordering the Gaza Strip.\nAL-JAZEERA SAYS ITS CHIEF CORRESPONDENT IN GAZA HAS BEEN WOUNDED\nRAFAH, Gaza Strip — The Qatar-based television network Al-Jazeera says its chief correspondent in the Gaza Strip, Wael Dahdouh, suffered an arm injury from a drone strike at a school-turned-shelter in the southern city of Khan Younis.\nThe network reported that a cameraman, Samer Abu Daqqa, was also wounded in the drone strike Friday afternoon.\nIn October, Dahdouh’s wife, son, daughter and grandson were killed in an Israeli airstrike.\nThe Committee to Protect Journalists says that since the Israel-Hamas war began on Oct. 7, some 63 journalists and media workers have been killed, making it one of the deadliest conflicts for journalists since CPJ began documenting journalist fatalities in 1992.\nEUROPEAN NATIONS, AUSTRALIA AND CANADA URGED ISRAEL TO STOP WEST BANK VIOLENCE BY SETTLERS\nCOPENHAGEN, Denmark — Twelve European nations joined by Australia, Canada and the European Union have called on Israel “to take immediate and concrete steps to tackle record high settler violence in the occupied West Bank.”\nIn a joint statement released Friday by the Swedish government, the countries expressed “their grave concern about the record number of attacks by extremist settlers against Palestinians in the West Bank.”\nThey said “the rise in extremist settler violence committed against Palestinians is unacceptable” and that “Israel, as the occupying power, must protect the Palestinian civilian population in the West Bank.”\nThe joint statement said that “those responsible for the violence must be brought to justice” and that attacks on Palestinians undermines “security in the West Bank and the region and threatens prospects for a lasting peace.”\nThe European countries are Belgium, Denmark, Finland, France, Ireland, Luxemburg, the Netherlands, Norway, Spain, Sweden, Switzerland, and the United Kingdom.\nHAGUE COURT REJECTS BID TO BAN TRANSFER TO ISRAEL OF F-35 FIGHTER JET PARTS FROM DUTCH WAREHOUSE\nTHE HAGUE, Netherlands — A Dutch court rejected a request Friday by a group of human rights and humanitarian organizations to order a halt to the transfer to Israel of parts for F-35 fighter jets.\nThe organizations went to court Dec. 4 arguing that delivery of parts for F-35 jets makes the Netherlands complicit in possible war crimes being committed by Israel in its war with Hamas. The parts are stored in a warehouse in the Dutch town of Woensdrecht.\nIn a written statement, the court said that the judge who heard the civil case concluded that the Dutch government “weighed the relevant interests” before agreeing to the delivery of parts. It was not immediately clear if the groups that brought the civil case would appeal.\nGovernment lawyer Reimer Veldhuis told the judge hearing the civil case that a ban on transfers from the Netherlands would effectively be meaningless as “the United States would deliver these parts to Israel from another place.”\nA LIBERIAN-FLAGGED CARGO SHIP IS HIT BY A PROJECTILE FROM REBEL-CONTROLLED YEMEN\nDUBAI, United Arab Emirates — A Liberian-flagged cargo ship caught fire Friday in the Red Sea after being hit by a projectile launched from rebel-controlled Yemen, a U.S. defense official and a private intelligence firm said.\nThe attack on the Al Jasrah further escalates a campaign by Yemen’s Iranian-backed Houthi rebels, who have claimed responsibility for a series of missile assaults in recent days in the Red Sea and its strategic Bab el-Mandeb Strait. The attacks come as a response to the Israel-Hamas war and the pounding air-and-ground offensive targeting the Gaza Strip, though linking the ships targeted in the rebel assaults has grown more tenuous — or nonexistent — as the attacks continue.\nThe U.S. official spoke on condition of anonymity to discuss intelligence matters. The Houthis did not immediately claim responsibility for the assault.\nThe Al Jasrah is operated by German-based shipper Hapag Lloyd, which declined to immediately comment about the attack. It wasn’t yet clear if any of the crew on board the vessel had been hurt in the attack, which may have come from either a drone or a missile.\n___\nAssociated Press writer Jon Gambrell contributed.\nA FRENCH ISRAELI HOSTAGE'S BODY IS FOUND IN GAZA, FRANCE SAYS\nPARIS — France’s foreign minister says the body of a French-Israeli citizen taken hostage by Hamas militants has been found in Gaza.\nThe minister, Catherine Colonna, posted on social media her \"immense sadness” at the death of Elia Toledano.\nShe said the Israeli military announced that his body had been found. He was reported to have been taken hostage at a music festival attacked by militants during Hamas' Oct. 7 assault on Israel.", "source_domain": "www.independent.co.uk", "text": null, "title": "Live updates | As fighting rages in Gaza, a US envoy is set to meet with the Palestinian president", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/israel-ap-hamas-gaza-palestinian-b2464861.html"}