{"authors": ["Abigail O'Leary"], "date_download": "2024-02-05 15:15:23", "date_modify": "None", "date_publish": "2024-01-27 06:51:42", "description": "WARNING UPSETTING DETAILS: Sara Khreis told of the final moments she spent with her mother, Hala, 57, as the family fled their home in the al-Rimal neighborhood in Gaza City before she was gunned down in the street", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fgrandmother-fleeing-israeli-bombs-grandson-31980381.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31980382.ece/ALTERNATES/s1200/0_israelmain.jpg", "language": "en", "localpath": null, "maintext": "WARNING UPSETTING DETAILS: Sara Khreis told of the final moments she spent with her mother, Hala, 57, as the family fled their home in the al-Rimal neighborhood in Gaza City before she was gunned down in the street\nA grandmother in Gaza fleeing Israeli bombs with her grandson while both carrying white flags was shot dead in the street.\nSara Khreis told of the final moments she spent with her mother, Hala, 57, as the family fled their home in the al-Rimal neighborhood in Gaza City. However, when Israeli troops rolled in and the family witnessed tanks passing their front door and became trapped in their home by constant shelling, they decided to risk their lives and flee.\nAfter throwing on shoes and leaving with just the clothes on their back, the family - Sara, her son Tayem, four, and mum Hala ran into the street, joining a crowd of others holding above their heads the universal symbol of surrender - a while flag. However within seconds, a shot rang out and Hala slumped to the ground to the horror of her panicking family. Seconds later, a shot rang out and Hala slumped to the ground.\nREAD MORE: Gaza baby delivered by emergency C-section is orphaned before she's even born\nHala's son Mohammed ran to his mother's aid as the family saw the full horror of her gun wound before dragging her body back to the house in an attempt to resuscitate her. In the chaos, Hala's four-year-old grandson went missing.\nThe sickening act was caught on camera in a video published earlier this month on the Middle East Eye. Sara said she felt sick as she watched the clip of her mother's death. Sara spoke to CNN, telling how her kind and caring mother had spent the morning feeding 20 neighbours who had sought shelter in their home, cooking breakfast and taking time to pray for their safety.\nSara, now in Istanbul after joining her Turkish fiancee, said: \"My mother was going to be 58 years old on December 30, and had her grandson with her. So why would you shoot her? What’s between you and her? You made us feel like it’s safe to leave, we had white flags in our hands as instructed. Nobody knows. Nobody knows.\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US .\n\"My mother was all my life; she was my friend and my everything. I didn’t do anything without consulting her or taking her opinion, she was with me in every step. We all had plans, dreams, goals and it all included my mother. They stole our mom from us, all these dreams are now gone. I felt like I was in a nightmare, until now I feel like I am still in denial from the whole thing, I am still waiting for my mom to send a message in the group chat to check on us.\"\nThe incident is said to be one of a number of reported killings of people carrying white flags being shot in cold blood in Gaza. CNN reported they had made attempts to share their findings with the Israel Defense Forces (IDF), who responded by saying “the incident is being examined\" - however it is believed their comment was not referring to Hala's death.\nThe family later buried Hala outside their house, in a small sandy alleyway. They hope to go back to be able to give her a proper burial when the war is over and are calling for an investigation into her killing.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Grandmother fleeing Israeli bombs with grandson carrying white flag shot dead in street", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/grandmother-fleeing-israeli-bombs-grandson-31980381"}