{"authors": ["Eirian Jane Prosser", "James Reynolds"], "date_download": "2024-02-05 15:26:03", "date_modify": "None", "date_publish": "2023-12-15 18:31:21", "description": "Scenes from Tel Aviv showed crowds, many themselves the families of people kidnapped by Hamas, taking to the streets with banners to mourn and call for the safe return of hostages", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12869619%2FIDF-troops-accidentally-kill-three-Israel-hostages-fierce-fighting-Gaza.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/15/22/79023141-0-image-a-19_1702680778809.jpg", "language": "en", "localpath": null, "maintext": "Demonstrators marched in Israel this evening to share their anguish and fury at the accidental killing of three civilian hostages shot dead by the IDF in Gaza.\nScenes from Tel Aviv showed crowds of people, many themselves the families of people kidnapped by Hamas, taking to the streets with banners to mourn and call for the return of Israelis trapped in Gaza.\nProtestors held signs calling for an immediate hostage exchange, showed pictures of loved ones now missing for nearly ten weeks, and saw an Israeli flag coated in red paint and left outside the ministry of defence.\nThe march came as the Israel Defense Forces admitted today they had accidentally killed three civilian hostages in Gaza after mistaking them as a 'threat' during their ongoing ground invasion.\nThe army's chief spokesman, Rear Adm. Daniel Hagari, said Israeli troops found the hostages and erroneously identified them as a threat. He said it was not clear if they had escaped their captors or been abandoned.\nTwo of the victims were initially named - Yotam Haim, 28, who was abducted by Hamas from Kibbutz Kfar Aza, and Samer Fouad Talalka, 22, who was abducted from Kibbutz Nir Am on October 7.\nThe third victim mistakenly killed was later identified as Alon Lulu Shamriz, a 26-year-old computer engineering student born to Iranian parents. The Sha'ar Hanegev Regional Council announced his death, saying he was shot dead by the IDF during fighting earlier today.\nAn Israeli flag is covered in red paint as relatives of hostages held by Palestinian militants demonstrate outside the Israeli ministry of defence in Tel Aviv on December 15, 2023\nPeople use bullhorns as they protest following an announcement by Israel's military that they had mistakenly killed three Israeli hostages, in Tel Aviv, Israel, December 15, 2023\nPeople hold signs as they protest following an announcement by Israel's military that they had mistakenly killed three Israeli hostages, in Tel Aviv, Israel, December 15, 2023\nSamer Fouad Al-Talalka, who was killed by the IDF during fighting near Gaza City today\nYotam Haim, who was killed by the IDF in fighting in the northern Gaza Strip\nAlon Lulu Shamriz, also announced to have been shot dead by Israeli forces in Gaza today\nThe IDF acknowledged the three deaths today, expressing its 'deep remorse over the tragic incident' in a statement and saying it had launched an immediate investigation.\nIDF Spokesman Rear Admiral Daniel Hagari said: 'This is a tragic incident, the IDF bears responsibility. This is an area where the soldiers encountered many terrorists, including suicide bombers.'\nThe deaths occurred in the (northern) Gaza City area of Shijaiyah, where troops have engaged in fierce battles against Hamas in recent days.\nThe Israeli military said it will be 'reviewing the incident immediately' adding that 'immediate lessons' have also been learnt.\nThe force said it's mission remains to 'locate the missing and return all hostages home'.\nYotam's mother Iris Haim has been desperately trying to get son home since he disappeared more than two months ago.\nShe spoke at a press conference held by The Missing Families and Hostages Forum on Tuesday, recalling the last conversation she had with her son.\nThe terrified mother described the moment her son was taken by Hamas terrorists at 10.44am from a safe room he had been hiding in on October 7.\nHe told his mother that terrorists were 'shooting at the house, shooting the door, shooting the safe room and burning the house.'\nTheir conversation began at 6.30am but became more frantic after her son discovered that it wasn't a missle strike taking place, but a terror attack happening in his kibbutz.\nA panicked Iris, said her son who suffers from some mental and medical issues was alone and 'afraid.' She tried to call the police and the army but could not get through.\nYotam's parents lived in a nearby moshav and his father desperately wanted to get his son but was unable to because of Hamas surrounding the area.\n'We couldn't help,' she wept. 'We knew we couldn't help as a mother and a father we were so helpless.'\nProtests have mounted in recent weeks to call for Israel to ensure the safe return of hostages\nRelatives and supporters of hostages held by Palestinian militants demonstrate outside the Israeli ministry of defence in Tel Aviv on December 15, 2023\nIris Haim pictured with her son Yotam Haim who was abducted on October 7 by Hamas. Tonight the IDF announced he was one of the three hostages accidentally killed\nSmoke rises following an Israeli airstrike in the Gaza Strip city of Khan Younis, on December 15\nThe captured Israelis, who were abducted on October 7, were shot at as the during the neighbourhood of Shejaiya in Gaza after members of the IDF mistook them as a 'threat'\nCalling his mother 'mamou' the endearing name, her son began using after a mother-son trip to France, she began to cry as she recalled the last time they would speak before they lost all communication.\n'Mamou I hope I will survive this,' Yotam told his mother. 'I don't know if I will survive, but I love you.... ask for help.... please...please... send someone please ... I don't have air... I cannot breathe.'\nA few weeks ago, while speaking at another forum for those who have loved ones murdered or kidnapped by Hamas. Iris begged for his son to be returned. 'He needs to come back to his family ... to us,' she said.\nSamar was working on October 7 in the in the Kibbutz Nir Am hatchery, where he often worked weekend shifts and needed to be there early in the morning, according to The Times of Israel.\nOn the day of the attacks, a local organiser Wahid Ahoziil said he tried to get hold of Samar, who worked alongside his father, but 'he didn't answer'.\n'He's a great guy,' said Mr Ahoziil said in the aftermath of the attacks. 'He wants to make an honest living.'\nSamar was a member of the Bedouin community in southern Israel. He was taken alongside two other members of the community.\nEarlier today the IDF confirmed it had recovered three more bodies of hostages seized by Hamas during the lethal October 7 attacks.\nThe victims were identified as Elia Toledano, 28, Cpl. Nik Beizer, 19, and Sgt. Ron Sherman, 19.\nToledano, a French-Israeli, was among an estimated 240 people abducted by Hamas terrorists on October 7.\nHe had been attending the Nova music festival alongside his friend and fellow French-Israeli Mia Schem, who was released under a truce agreement at the end of November.\nYotam Haim, 28, (right) pictured with his brother Tuval Haim, 31, (left). Yotam was killed by the IDF after he was mistaken for a terrorist\nYotam Hami, 28, was hiding at his kibbutz in a safe room when he was abducted on October 7\nFrench Foreign Minister Catherine Colonna expressed deep sadness over Toledano's death, confirmed by the IDF and corroborated by medical officials, military rabbis, and the Institute of Forensic Medicine.\n'We share the grief of his family and loved ones. The release of all hostages is our priority,' she wrote on X.\nAccording to the Israeli military, 132 of the hostages taken to Gaza are still being held.\nHamas kidnapped around 250 hostages during its October 7 attack on Israel, which killed 1,139 people, according to Israel.\nIsrael also says 116 of its soldiers have died in its ground offensive.\nIsrael's retaliatory war against the group has killed more than 18,700 people, according to the territory's Hamas-run health ministry.\nThe Israeli government has repeatedly stated that bringing home all of the hostages is one of its chief war aims.\nFighting rages in both the north and south as Israeli forces push through Gaza to uncover suspected Hamas headquarters and bring an end to the group's de facto governance in Gaza after some 15 years.\nTroops are also fighting to secure the safe release of hostages taken back into Gaza on October 7. Many were used to negotiate the release of Palestinian prisoners held in Israeli jails - many without trial - during a week-long ceasefire period last month.\nIn late November, 78 Israeli and dual-national hostages were released as part of a Qatar-mediated deal between Israel and Hamas. Israel in turn released 240 Palestinian prisoners.\nA total of 110 hostages have now been released - including those freed as part of separate deals with the Thai government and as a gesture to Russian president Vladimir Putin.\nMany families of captives have urged their government to do more to ensure their safe release.\nDuring a meeting with the Prime Minister and the War Cabinet last Tuesday, one former hostage, who was separated from her husband three days before her return to Israel, warned against Israel's reported proposals of flooding Hamas' underground tunnels with sea water.\n'He was taken to the tunnels, and you talk about washing the tunnels with seawater. You prioritize politics over the hostages!' she was reported as saying. 'My husband hurt himself every day until he bled because [the situation] was hard for him to bear, and now he is alone, god knows in what conditions.\nThe IDF expressed 'deep remorse over the tragic incident' and have launched an immediate investigation. Pictured: Israeli soldiers gather at a position near the border, December 15\nMore than 18,000 people have died in the Gaza Strip since the conflict began, the Palestinian Health Ministry maintains. Some 40 per cent of the population are children\nThe families of hostages have also clashed with lawmakers over proposals to extend the use of the death penalty in Israel for Hamas affiliates.\nHen Avigdori, whose wife and daughter were among those captured, urged lawmakers during a National Security Committee meeting last month to 'stop talking about killing Arabs and start talking about saving Jews'.\nGil Dickmann, whose cousin is still trapped in Gaza, cried as he begged the committee's leaders to drop the hearing altogether.\nMK Tzvika Fogel, chairman of the Knesset National Security Committee, said anyone trying to delay the legislation was 'representing Hamas' and pushed on with the meeting to prepare the bill, which lacks cross-party support.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Fury on the streets of Tel Aviv over IDF shooting of Israeli hostages: Families of civilians kidnapped by Hamas stage demo after army admitted killing three it mistook for terrorists in Gaza fighting", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12869619/IDF-troops-accidentally-kill-three-Israel-hostages-fierce-fighting-Gaza.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}