{"authors": [], "date_download": "2024-02-05 15:26:05", "date_modify": "None", "date_publish": "2023-12-15 17:20:06", "description": "National security adviser Jake Sullivan heralds a ‘transition to another phase of this war’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fjake-sullivan-israel-hamas-war-b2464836.html.json", "image_url": "https://static.independent.co.uk/2023/12/04/21/GettyImages-1830944803.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States is urging Israel to abandon its heavy bombing of the Gaza Strip in favour of more targeted operations aimed at capturing or killing top Hamas leaders.\nIt comes as the death toll in Gaza approaches 20,000 from weeks of bombardment. About 1,200 people in Israel were killed in the 7 October Hamas attack, according to the Israel Defense Forces.\nWhite House national security adviser Jake Sullivan said there would be a “transition to another phase of this war” that is “focused in more precise ways on targeting the leadership and on intelligence-driven operations”.\nMr Sullivan, who met with Israeli prime minister Benjamin Netanyahu on Thursday, was briefed on “objectives, phasing, and setting conditions for shifts over time from high-intensity clearing operations to lower intensity surgical operations against Hamas remnants” during his meetings in Tel Aviv.\nThe White House said Mr Sullivan “described US efforts in coordination with allies and partners to deter any attempt to expand the conflict regionally, including in the Red Sea, and expressed President Biden’s commitment to restoring calm along the Blue Line [the unofficial frontier between Lebanon and Israel] through a combination of deterrence and diplomacy”.\nThe timing of such a transition is unclear but remains part of “intensive discussion between the United States and Israel,” a top White House aide said.\nMr Sullivan, who left Israel on Friday, also said in a statement that his Israeli counterpart, Tzachi Hanegbi, had informed him that the Israeli government is now allowing the use of the Kerem Shalom border crossing for delivery of aid into Gaza.\n“We welcome this significant step,” he said, adding that President Joe Biden had personally raised the matter with Mr Netanyahu.\nMr Sullivan also said that the US “remains committed to expanding and sustaining the flow of humanitarian assistance into Gaza” and “will continue to work closely with Egypt and other partners” to ensure that aid continues to flow into Gaza through the Rafah border crossing as well.\n“We hope that this new opening will ease congestion and help facilitate the delivery of life-saving assistance to those who need it urgently in Gaza,” he added.\nWith additional reporting by agencies", "source_domain": "www.independent.co.uk", "text": null, "title": "US urges Israel to switch from Gaza bombardment to ‘precise targeting’ of Hamas", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/jake-sullivan-israel-hamas-war-b2464836.html"}