{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:26:08", "date_modify": "None", "date_publish": "2023-12-15 15:11:07", "description": "The loss of US and NATO support for Ukraine could lead to a defeat as soon as the summer, according to bleak western military and intelligence assessments.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12868551%2FU-S-not-sending-aid-leave-Ukraine-certain-fail-facing-possible-defeat-summer-Western-intelligence-agencies-warn.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/15/14/79006155-0-image-m-13_1702651892974.jpg", "language": "en", "localpath": null, "maintext": "The cessation of U.S. military support for Ukraine could have catastrophic consequences for its defense against Russia's invasion force, with the country 'certain to fail,' according to western military and intelligence officials.\nOne senior U.S. military official said Kiev could last only months were US and NATO military support to dry up, with a possible defeat of Ukraine's vaunted military forces by summer, CNN reported.\nThe official described such a defeat as a worst-case scenario, with Ukrainian and Russian forces drawn into a virtual stalemate on Ukrainian territory.\n'There is no guarantee of success with us, but they are certain to fail without us,' said a senior U.S. military official.\nUkrainian forces are 'certain' to fail without continued US military support, a senior U.S. military official said\nThe backdrop for the dire warnings is a stalled U.S. emergency aid package. President Joe Biden has requested $61 billion to address Ukraine's urgent need for longer-range missiles, air defenses, ammunition, and other needs.\nThat request remains tied up on congressional Republican demands for new policy changes meant to gain control of the southern border.\nSenate negotiators are continuing to negotiate toward a possible solution, with varying assessments on how far apart the two sides are. Although the Senate remains in session next week, House Speaker Mike Johnson has already sent his lawmakers home for the holidays.\n'The House will not wait around to receive and debate a rushed product,' he said Thursday night.\nUkrainian President Volodymyr Zelensky flew to Washington this week to plead with lawmakers for continued assistance. But even Senate Republican Ukraine hawks were stressing the need for movement on U.S. border security issues, leaving its fate uncertain.\nRussian forces, pictured patrolling destroyed part of the Ilyich Iron and Steel Works in Ukraine's port city of Mariupol on May 18, 2022, suffered a stunning 315,000 troops killed or wounded since the invasion, according to declassified US intelligence\n'There will be peace when we achieve our goals,' Russian President Vladimir Putin said Thursday\nOn Friday Hungary, whose president Viktor Orban is the most Kremlin-alligned of European leaders, blocked a European Union effort to provide additional aid to Ukraine.\nRussian President Vladimir Putin, meanwhile, remains undeterred in his public goals, despite declassified US intelligence reports stating that Russia has suffered a stunning 315,000 troops killed or wounded since the invasion began less than two years ago, out of a pre-invasion force of 360,000.\n'There will be peace when we achieve our goals,' Putin said during his annual year-end press conference Thursday. 'As for the goals, they are unchanged,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "U.S. not sending more aid would leave Ukraine 'certain to fail' and facing possible defeat by the summer, Western intelligence agencies warn", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12868551/U-S-not-sending-aid-leave-Ukraine-certain-fail-facing-possible-defeat-summer-Western-intelligence-agencies-warn.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}