{"authors": [], "date_download": "2024-02-05 15:26:09", "date_modify": "None", "date_publish": "2023-12-15 21:18:23", "description": "IDF says it found trio on Friday and fired towards them after mistakenly identifying them as a threat", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-hostages-hamas-gaza-war-b2464996.html.json", "image_url": "https://static.independent.co.uk/2023/12/15/19/israel%20hostages%20idf.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Israeli military has admitted to mistakenly killing three Israeli hostages during its ground operation in the Gaza Strip.\nIsraeli troops found the trio on Friday and fired towards them after mistakenly identifying them as a threat, said the army’s chief spokesperson, Rear Admiral Daniel Hagari.\nYotam Haim, Samer Talalka and Alon Shamriz were killed in the Gaza City area of Shijaiyah, where troops have engaged in fierce battles against Hamas militants in recent days.\nYotam Haim was among the three Israeli hostages killed in the Gaza City area of Shijaiyah (AP)\nThe trio’s bodies were taken to the Hatzvi Centre at the Shura Camp, where they were identified. Haim and Shamriz were kidnapped by Hamas from Kibbutz Kfar Aza on 7 October, while Talalka was taken by the militants from Kibbutz Nir Am on the same day.\nRear Admiral Hagari said it was not clear if the hostages had escaped their captors or been abandoned.\nHe said the Israel Defense Forces (IDF) expressed “deep remorse” and sent “heartfelt condolences” to their families.\nHe added the IDF ”immediately” began investigating the incident.\nPeople gather amid the destruction following an early morning Israeli strike in Rafah in the southern Gaza Strip in December (AFP via Getty Images)\nThe army said in a statement released on Friday evening: “The IDF emphasises that this is an active combat zone in which ongoing fighting over the last few days has occurred.\n“Immediate lessons from the event have been learned, which have been passed on to all IDF troops in the field.”\nIt added: “Our national mission is to locate the missing and return all the hostages home.”\nAs of Friday morning, Israel said 132 hostages remained in Gaza, with 20 of those having been killed.\nPhotographs of Israeli hostages being held by Hamas militants are projected on the walls of Jerusalem's Old City in November (Copyright 2023 The Associated Press. All rights reserved.)\nIt comes as a US envoy said the US and Israel were discussing a timetable for scaling back intense combat operations in the war against Hamas, even though they agree the overall fight will take months.\nUS national security adviser Jake Sullivan also met Palestinian President Mahmoud Abbas to discuss the besieged enclave's postwar future, which, according to a senior US official, could include bringing back Palestinian security forces driven from their jobs in Gaza by Hamas in its 2007 takeover.\nThe Qatar-based television network Al Jazeera said on Friday that an Israeli strike killed one of its journalists in Gaza, Palestinian cameraman Samer Abu Daqqa.\nThe strike also wounded the network's chief correspondent in Gaza, Wael Dahdouh. The two were reporting on the grounds of a school in the southern Gaza city of Khan Younis when the strike hit, the network said.\nBefore Mr Abu Daqqa's death, at least 63 journalists have been killed since the conflict erupted between Hamas and Israel on 7 October, according to the media freedom organisation, The Committee to Protect Journalists. They include 56 Palestinians, four Israelis and three Lebanese.\nMr Dahdouh, a veteran of covering Israel-Gaza wars, was wounded by shrapnel in his right arm.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israeli military says it has killed three Israeli hostages during ground operation in Gaza", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-hostages-hamas-gaza-war-b2464996.html"}