{"authors": ["Joseph Contreras"], "date_download": "2024-02-05 15:26:12", "date_modify": "None", "date_publish": "2023-12-15 11:00:26", "description": "More than 150,000 Republicans among 1.3m signatures collected for plan to put constitutional amendment to voters next year", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F15%2Fflorida-abortion-right-constitution-amendment-republican.json", "image_url": "https://i.guim.co.uk/img/media/ee6ad3532ad475dac5cb993f9bae91fa24e65e67/0_365_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9a202c6637c89ccf7cbe42ad76a41fb3", "language": "en", "localpath": null, "maintext": "Pro-choice activists in Florida, where nearly all abortions are banned after the 15th week of pregnancy, want voters to enshrine the right to a termination in the state constitution via a referendum on next year’s election ballot.\nMore than 150,000 registered Republican voters in Florida have now signed a petition calling for a constitutional amendment that would guarantee a woman’s right to an abortion up to the point of a fetus’s viability, which is generally considered to be around the 24th week of pregnancy.\nThe effort is a no-brainer, according to Miami-born Republican Carlos Lacasa.\n“How can my party be so vigorous in its defense of the right to bear arms yet not defend a woman’s right to make decisions about her own healthcare?” says the son and grandson of Cuban immigrants who fled communism under Fidel Castro in the early 1960s. “I believe in small government, and morality cannot be legislated without an overwhelming consensus of the governed – and there is no such consensus on this issue.”\nLacasa says he has always opposed excessive government interference in the private lives of his fellow citizens. A self-described Ronald Reagan Republican who served four terms in the lower house of the Florida state legislature, the 60-year-old attorney took strong exception to the vaccine mandates and mandatory lockdowns that some authorities imposed at the height of the Covid-19 epidemic – an attitude now also extending to abortion.\nIn supporting this effort, Lacasa will break ranks with the state’s rightwing governor, Ron DeSantis, and his allies in the Florida legislature who have sharply limited access to abortions in the state in the last two years, encouraged in part by the supreme court overturning Roe v Wade.\nTo enshrine the right to an abortion in Florida, it requires the collection of verified signatures from nearly 900,000 registered voters statewide by the end of this month. The six groups that have joined forces on behalf of the proposed constitutional amendment say they have already garnered support from more than 1.3 million voters.\n“The vast majority of Floridians don’t support an abortion ban,” says Anna Hochkammer, executive director of the bipartisan Florida Women’s Freedom Coalition. “In the past, we’ve been protected by the explicit right to privacy contained in the state constitution, but we want specific language in the constitution that prohibits government interference with access to abortion.”\nThe issue has become a political minefield for many Republican leaders nationwide.\nWhen Roe was overturned last year, outraged women’s rights groups responded with protests and galvanized support for pro-choice candidates and ballot measures across party lines.\nSince then, seven states have taken steps to protect reproductive rights, from deep-blue Vermont and California to longtime Republican strongholds like Kansas and Kentucky. Democrats regained control of the Virginia general assembly in legislative elections last month by campaigning on the abortion rights issue.\nFlorida has bucked that trend thus far.\nWhen the American Civil Liberties Union (ACLU) and a group of abortion providers filed a lawsuit in 2022 challenging the constitutionality of the recently instituted 15-week ban, DeSantis and the Republican-dominated state legislature doubled down on the issue by approving a six-week prohibition last spring. The lawsuit is currently before the Florida supreme court. If the justices, all of whom were appointed by Republican governors, throw out the litigation, a more draconian six-week ban would instantly take effect.\nThe state’s Republican attorney general, Ashley Moody, has vowed to block the proposed ballot measure by asking the Florida supreme court to invalidate it on the grounds that its two-sentence text is vaguely worded and designed to “hoodwink” voters about the scope of the reproductive freedoms it would grant. Multiple requests from the Guardian for an interview with Moody went unanswered.\nBut abortion rights advocates maintain that Republican leaders are out of step with most Floridians.\nA University of North Florida poll of 716 registered voters in November found that 62% of respondents would support the proposed constitutional amendment while only 29% would reject the measure. Slightly over half of the registered Republican voters surveyed in the poll also signaled their backing of the initiative.\nFor their part, anti-abortion groups say they will defeat the amendment in the new year if it comes to a vote.\nAaron DiPietro, legislative affairs director of the Florida Family Policy Council (FFPC), lambasted the amendment as “very extreme and deceptive as it would enshrine abortion on demand and allow abortions for virtually any reason up to nine months of pregnancy”.\n“It would legally trump almost every commonsense safety law in Florida regulating abortion, [and] we are organized in a way no other state has been to [stop] this amendment,” he said.\nIf the referendum does qualify for the 2024 ballot, its ratification will not be a slam dunk. Florida law requires a supermajority of 60% approval among voters to enact a ballot measure. Some seasoned political analysts expect the outcome would be a closely run affair.\nKevin Wagner, a political science professor at Florida Atlantic University, notes that voter turnout will be a huge factor as the proposed amendment “is likely to draw out some people on either side of the issue who otherwise would not vote”.\n“The Democrats think it will bring out more of their supporters, especially among young people,” he said, adding that he believed it would pass.\nDonald Trump may have acknowledged that message to some degree. During an interview on NBC’s Meet the Press program last September, the former US president condemned the six-week ban on abortion championed by DeSantis as “a terrible mistake” – much to the dismay of the anti-abortion lobby in America’s third most populous state.\nHochkammer warns that any Republican politician who denounces the ballot measure next year would do so at their own peril.\n“Abortion access is a third-rail issue,” she says. “Republicans who insist on going down that road would be smart to rethink that.”", "source_domain": "www.theguardian.com", "text": null, "title": "Florida Republican voters could be key to push for abortion rights referendum", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/15/florida-abortion-right-constitution-amendment-republican"}