{"authors": [], "date_download": "2024-02-05 15:15:24", "date_modify": "None", "date_publish": "2024-01-27 12:43:20", "description": "The crew aboard a Marshall Islands-flagged tanker hit by a missile launched by Yemen’s Houthi rebels has extinguished an hourslong fire onboard the stricken vessel sparked by the strike", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fhouthi-ap-crew-yemen-marshall-islands-b2485917.html.json", "image_url": "https://static.independent.co.uk/2024/01/27/12/CORRECTION_Mideast_Tensions_47060.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe crew aboard a Marshall Islands-flagged tanker hit by a missile launched by Yemen's Houthi rebels extinguished an hourslong fire onboard the stricken vessel Saturday sparked by the strike, authorities said.\nThe attack on the Marlin Luanda further complicated the Red Sea crisis caused by the Iranian-backed rebels' attacks over Israel's war on Hamas in the Gaza Strip. The tanker carried Russian-produced naphtha, a flammable oil, drawing Moscow further into a conflict that so far it had blamed on the U.S.\nEarly Saturday, U.S. forces conducted a strike against a Houthi anti-ship missile that was aimed at the Red Sea and prepared to launch, the U.S. military’s Central Command said. That attack came after the USS Carney, an Arleigh Burke-class destroyer, had to shoot down a Houthi missile targeting it.\nThe Marlin Luanda burned for hours in the Gulf of Aden until being extinguished Saturday, said Trafigura, a Singapore-based trading firm. Its crew of 25 Indian nationals and two Sri Lankans were still trying to battle the blaze sparked by the missile strike, it said. No one was injured by the blast, it added.\n“We are pleased to confirm that all crew on board the Marlin Luanda are safe and the fire in the cargo tank has been fully extinguished,” Trafigura said. “The vessel is now sailing towards a safe harbor.”\nThe Indian navy said its guided missile destroyer INS Visakhapatnam was assisting the Marlin Luanda's crew in fighting the fire. It posted images showing the blaze still raging Saturday, likely fueled by the naphtha on board.\nThe ship, managed by a British firm, is carrying the Russian naphtha bound for Singapore, the company said. It described the flammable oil as being purchased below the price caps set by G7 sanctions placed on Russia over its ongoing war on Ukraine. It wasn't clear what environmental impact the attack had caused.\nHouthi military spokesman Brig. Gen. Yahya Saree claimed the attack on the Marlin Luanda in a prerecorded statement late Friday, describing it as a “British oil ship.” He insisted such attacks would continue.\nSince November, the rebels have repeatedly targeted ships in the Red Sea over Israel’s offensive in Gaza against Hamas. But they have frequently targeted vessels with tenuous or no clear links to Israel, imperiling shipping in a key route for global trade between Asia, the Mideast and Europe.\nSince the airstrike campaign began, the rebels now say they’ll target American and British ships as well. On Wednesday, two American-flagged ships carrying cargo for the U.S. Defense and State departments came under attack by the Houthis, forcing an escorting U.S. Navy warship to shoot some of the projectiles down.\nChina, which relies on the seaborne trade through the area, has called for calm. The U.S. had sought to get China to apply pressure on Iran, as Beijing remains a major buyer of Western-sanctioned Iranian oil.\nBut Russia so far has condemned the U.S. and the United Kingdom for carrying out its strikes targeting the Houthis, while also meeting with the rebel group in Moscow in recent days.\nThe U.S. Navy’s top Mideast commander told the AP on Monday that the Houthi attacks were the worst since the so-called Tanker War of the 1980s. It culminated in a one-day naval battle between Washington and Tehran and also saw the U.S. Navy accidentally shoot down an Iranian passenger jet, killing 290 people in 1988.\nMeanwhile Saturday, authorities reported a separate incident in which a vessel in the Arabian Sea reported seeing people armed with assault rifles and a rocket-propelled grenade off their vessel.\n“The small craft approached within 300 meters (about 985 feet),” the British military's United Kingdom Trade Operations agency said. “The onboard security team fired warning shots and post an exchange of fire, the small craft then retreated.”\nIt said all those onboard were safe. The private security firm Ambrey described the incident as involving a “Somali-style” small boat aided by a larger mothership. As the Houthi attacks have escalated, there's been an increase in suspected Somali pirate activity as well.\n___\nAssociated Press writer Aijaz Hussain in Srinagar, India, contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Crew extinguish fire on tanker hit by Houthi missile off Yemen after US targets rebels in airstrike", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/houthi-ap-crew-yemen-marshall-islands-b2485917.html"}