{"authors": [], "date_download": "2024-02-05 15:26:35", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Human Rights Watch, alongside a group ofUK-based civil society groups working in and on the Occupied Palestinian Territory,have written to the UK Government callingfor an immediate halt to UK arms transfers to the government of Israel. The letter makesclear thatthere is a clear risk that arms and military equipment transferred to Israel might be used tofacilitate or commit serious violations of international law, including attacks that may amount to war crimes. Accordingly, the UK Government should immediately suspend arms transfers while the Israel Defense Forces continue to carry out widespread serious violations including war crimes, with impunity. Failure to do so risks the UK Government breaching its own laws and international obligations and being complicit in grave abuses. Rt Hon Lord David Cameron, Foreign, Commonwealth & Development Office, London SW1A 2AH CC: Secretary of State for Business and Trade Kemi Badenoch, and Minister of State for Development and Africa Andrew Mitchell December 8, 2023 js.2023.12.12.Joint Statement on UK Arms Transfers to Israel Dear Foreign Secretary, We write in the context of the ongoing hostilities in Israel and Palestine, in which many thousands of civilians have been killed and more than 1.9 million people have been displaced from their homes, to call on the UK Government to immediately halt arms transfers to the Government of Israel. There is a clear risk that arms and military equipment transferred to Israel might be used to facilitate or commit serious violations of international law, including attacks that may amount to war crimes. Accordingly, the UK Government should immediately suspend both extant licenses for military equipment and technology and the issuing of new licenses while the Israel Defense Forces continue to carry out widespread serious violations including war crimes, with impunity. Failure to do so risks the Government breaching its own laws and international obligations and being complicit in grave abuses. Under both relevant international and domestic law, the UK is required to prevent the transfer of military equipment and technology, including parts and components, where there is a clear or overriding risk that such equipment and technology might be used to commit or facilitate a serious violation of international humanitarian law or international human rights law. These binding obligations are contained within Articles 6 and 7 of the International Arms Trade Treaty (ATT) as well as criteria one and two of the UK's Strategic Export Licensing Criteria (SELC). Criteria three and four of the SELC also prohibits the granting of a license when there is a clear risk that the items would, overall, undermine peace and security. International law also prohibits the UK from providing weapons with the knowledge that they would significantly contribute to unlawful attacks. Since 2015, the UK has licensed at least Pound 474 million worth of military exports to Israel, including components for combat aircrafts, missiles, tanks, technology, small arms, and ammunition. The UK provides approximately 15 percent of the components in the F-35 stealth bomber aircraft currently being used in Gaza, including the rear fuselage and active interceptor system, ejector seats, aircraft tires, refueling probe, laser targeting system, and the fan propulsion system. Durability testing for the F-35 is also undertaken in the UK. Notably, the UK Government admitted that British supplied components were used in the 2008-2009 hostilities in Gaza. Furthermore, during the 2014 Gaza hostilities, when Lord Cameron was Prime Minister, the Government undertook a review of licensed exports to Israel. In announcing the findings of its review, it warned that it would suspend extant licenses for components which could be part of equipment used by the Israel Defense Forces in Gaza if significant hostilities resumed, as it would not be able to clarify if its export criteria were being met. As a precautionary measure, the government also stated that no new licenses had been issued during the review period (August 4, 2014, to August 12, 2014). On October 7, 2023, Hamas and other Palestinian armed groups from Gaza carried out attacks in which some 1,200 people, the majority of whom were civilians, were killed and about 200 taken hostage. These intentional attacks on civilians and hostage-taking are war crimes and cannot be justified under any circumstances. Since then, Israeli forces have carried out massive airstrikes, including using explosive weapons with wide area effects in densely populated areas of Gaza, as well as an intense ground offensive in Gaza which has caused widespread civilian casualties and what the UN has called unprecedented destruction of civilian infrastructure in Gaza. In eight weeks, according to Gaza's government media office, more than 17,000 Palestinians have been killed, two-thirds of them children and women, and the hostilities and casualties have spread to neighboring countries. Since October 7, Israeli forces have carried out unlawful and apparently unlawful attacks on medical facilities, personnel and transport and a civilian vehicle, and have struck multi-story residential buildings, evacuation convoys, bakeries, water pipes and electricity networks, schools and facilities of the UN Relief and Works Agency for Palestine Refugees (UNRWA) that are sheltering displaced people. According to the UN, more than 52,000 homes have been destroyed and more than 1.9 million people are internally displaced within Gaza. If carried out intentionally or recklessly, attacks directed against the civilian population and civilian objects are war crimes. The Israeli military have also used white phosphorus munitions in Gaza, a densely populated area, which puts civilians at unnecessary risk and is unlawful. Israeli authorities have also imposed a near complete blockade which is a tightening of the unlawful blockade that has been imposed for the last 16 years on the enclave. Other than a trickle of aid, which is a much smaller fraction than was allowed in before October 7 and is totally inadequate to meet the subsequent escalating needs, the Israeli authorities have cut off water, food, fuel, and electricity to Gaza's 2.3 million population. This is a form of collective punishment of the population, which is a war crime. The UN has stated the humanitarian situation is \"intolerable\" and \"beyond dire.\" UNRWA has at times been unable to distribute the trickle of aid that has been allowed in via the Rafah crossing due to lack of fuel, and the fuel that has since been allowed in is well below minimum requirements. The WHO has documented 212 attacks on healthcare in the Gaza Strip from October 7, 2023, to December 5, 2023, and reports that 34 out of 39 hospitals and primary healthcare centers are out of service. Many bakeries in Gaza have closed because of lack of fuel, water, wheat flour and structural damage, and food supplies are dangerously low. The UN has warned of the immediate risk of starvation. Intentionally using starvation as a method of warfare is a war crime. Around 70 percent of the population in Gaza lack access to clean water, which risks dehydration, and public health experts have expressed grave concerns of an imminent infectious disease outbreak in Gaza, including waterborne illnesses like cholera and typhoid. In the context of the current hostilities, serious violations of international law have been committed by all parties to the armed conflict, some of which amount to war crimes. The UK risks being complicit in and facilitating serious violations of international humanitarian law if it fails to halt arms exports to Israel immediately. This risk is further heightened by statements of high-level Israeli officials that have sought to hold Gaza's entire population responsible for the October 7 attacks, appear to disregard the principle of distinction and the protected status of civilians and civilian infrastructure, and risks mass intentional forced displacement of the civilian population in Gaza which if carried out would amount to a war crime. Prime Minister Netanyahu invoked Amalek in a speech about intensifying Israel's operations in Gaza.[1] Defense Minister Yoav Gallant said, \"We are fighting human animals and we are acting accordingly.\" Security Cabinet Member and Agriculture Minister Avi Dichter said, \"We are now rolling out the Gaza Nakba\". President Herzog said, \"It is an entire nation out there that is responsible,\" while one minister remarked that \"there is no reason\" to provide humanitarian aid to the population until Israeli forces \"eliminate\" Hamas. The Israeli army spokesperson Daniel Hagari has boasted that, \"Gaza will eventually turn into a city of tents. There will be no buildings,\" adding \"the emphasis\" is \"on damage and not on accuracy.\" Hostilities between the Israeli military and armed groups in Gaza have occurred in 2008/9, 2012, 2014, 2018, 2021, and 2022. UK-based charities have witnessed, documented, and sought to alleviate the destruction, hardship and impoverishment generated by conflict and blockade. In hostilities prior to 2023, Israeli forces carried out unlawful airstrikes that killed scores of civilians at a time, wiping out entire families, and targeted civilian infrastructure, destroying high-rise buildings in Gaza full of homes and businesses, with no evident military targets in the vicinity -acts that violate the laws of war. Palestinian armed groups have fired rockets indiscriminately at Israeli communities. However, the number of civilian deaths happening now is significantly higher than in recent hostilities. These acts have been carried out by all parties to the conflict with impunity. Pursuant to criteria 2(b) of the SELC, the UK Government must also exercise special caution and vigilance in granting licenses to countries where serious violations have been established by the competent bodies of the UN, and certainly such findings of violations are relevant to the determination of 'risk' under international and domestic law. The UN Independent International Commission of Inquiry on the Occupied Palestinian Territory, including East Jerusalem, and Israel, has made findings of the use of excessive force, violations of rights to freedom of association, expression and opinion, rights to privacy, economic, social, and cultural rights, forcible deportation of individuals and entire communities by Israel. In the context of hostilities in Gaza in 2008 and 2009, the United Nations Fact Finding Mission on the Gaza conflict found Israel carried out collective punishment, disproportionate and indiscriminate attacks resulting in deaths, serious injuries, and extensive destruction of civilian infrastructure, and failed to take feasible precautions to avoid or minimize incidental loss of civilian life, injury to civilians and damage to civilian objects, and failed to hold those responsible to account. In the context of the current hostilities, there is a clear and overriding risk that UK licensed military equipment could be used to commit or facilitate a serious violation of international law, including unlawful attacks that may amount to war crimes. Our organizations demand an immediate suspension of arms transfers to all parties to the current conflict. For the UK government, this requires a halt to the arming of Israel. Failure to do so risks the Government breaching its own laws and being complicit in grave abuses. Signatories: Asad Rehman, Chief Executive, War on Want Katie Fallon, Director of Advocacy, Campaign Against the Arms Trade Sacha Deshmukh, Chief Executive, Amnesty International UK Yasmine Ahmed, UK Director, Human Rights Watch Additional signatories: Paul Parker, Recording Clerk, Quakers in Britain Caroline Qutteneh, Director, Welfare Association Charlotte Marshall, Director, Sabeel-Kairos UK Tayab Ali, Director, International Centre of Justice for Palestinians [1] Prime Minister Netanyahu refers to a verse of the Old Testament where God commands King Saul in the first Book of Samuel to kill every person in Amalek, a rival nation to ancient Israel. \"This is what the Lord Almighty says,\" the prophet Samuel tells Saul. \"'I will punish the Amalekites for what they did to Israel when they waylaid them as they came up from Egypt. Now go, attack the Amalekites, and totally destroy all that belongs to them. Do not spare them; put to death men and women, children and infants, cattle and sheep, camels, and donkeys.\"", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274062866%2Fletter-to-the-uk-government-calling-for-an-immediate-halt-to-uk-arms-transfers-to-the-government-of-israel.json", "image_url": "https://static.midwestradionetwork.com/story_logos/premier/the-uk-news.jpg", "language": "en", "localpath": null, "maintext": "Human Rights Watch, alongside a group of UK-based civil society groups working in and on the Occupied Palestinian Territory, have written to the UK Government calling for an immediate halt to UK arms transfers to the government of Israel. The letter makes clear that there is a clear risk that arms and military equipment transferred to Israel might be used to facilitate or commit serious violations of international law, including attacks that may amount to war crimes.\nAccordingly, the UK Government should immediately suspend arms transfers while the Israel Defense Forces continue to carry out widespread serious violations including war crimes, with impunity. Failure to do so risks the UK Government breaching its own laws and international obligations and being complicit in grave abuses.\nRt Hon Lord David Cameron,\nForeign, Commonwealth & Development Office,\nLondon SW1A 2AH\nCC: Secretary of State for Business and Trade Kemi Badenoch, and Minister of State for Development and Africa Andrew Mitchell\nDecember 8, 2023\nDear Foreign Secretary,\nWe write in the context of the ongoing hostilities in Israel and Palestine, in which many thousands of civilians have been killed and more than 1.9 million people have been displaced from their homes, to call on the UK Government to immediately halt arms transfers to the Government of Israel.\nThere is a clear risk that arms and military equipment transferred to Israel might be used to facilitate or commit serious violations of international law, including attacks that may amount to war crimes. Accordingly, the UK Government should immediately suspend both extant licenses for military equipment and technology and the issuing of new licenses while the Israel Defense Forces continue to carry out widespread serious violations including war crimes, with impunity. Failure to do so risks the Government breaching its own laws and international obligations and being complicit in grave abuses.\nUnder both relevant international and domestic law, the UK is required to prevent the transfer of military equipment and technology, including parts and components, where there is a clear or overriding risk that such equipment and technology might be used to commit or facilitate a serious violation of international humanitarian law or international human rights law. These binding obligations are contained within Articles 6 and 7 of the International Arms Trade Treaty (ATT) as well as criteria one and two of the UK's Strategic Export Licensing Criteria (SELC). Criteria three and four of the SELC also prohibits the granting of a license when there is a clear risk that the items would, overall, undermine peace and security. International law also prohibits the UK from providing weapons with the knowledge that they would significantly contribute to unlawful attacks.\nSince 2015, the UK has licensed at least Pound 474 million worth of military exports to Israel, including components for combat aircrafts, missiles, tanks, technology, small arms, and ammunition. The UK provides approximately 15 percent of the components in the F-35 stealth bomber aircraft currently being used in Gaza, including the rear fuselage and active interceptor system, ejector seats, aircraft tires, refueling probe, laser targeting system, and the fan propulsion system. Durability testing for the F-35 is also undertaken in the UK. Notably, the UK Government admitted that British supplied components were used in the 2008-2009 hostilities in Gaza. Furthermore, during the 2014 Gaza hostilities, when Lord Cameron was Prime Minister, the Government undertook a review of licensed exports to Israel. In announcing the findings of its review, it warned that it would suspend extant licenses for components which could be part of equipment used by the Israel Defense Forces in Gaza if significant hostilities resumed, as it would not be able to clarify if its export criteria were being met. As a precautionary measure, the government also stated that no new licenses had been issued during the review period (August 4, 2014, to August 12, 2014).\nOn October 7, 2023, Hamas and other Palestinian armed groups from Gaza carried out attacks in which some 1,200 people, the majority of whom were civilians, were killed and about 200 taken hostage. These intentional attacks on civilians and hostage-taking are war crimes and cannot be justified under any circumstances. Since then, Israeli forces have carried out massive airstrikes, including using explosive weapons with wide area effects in densely populated areas of Gaza, as well as an intense ground offensive in Gaza which has caused widespread civilian casualties and what the UN has called unprecedented destruction of civilian infrastructure in Gaza.\nIn eight weeks, according to Gaza's government media office, more than 17,000 Palestinians have been killed, two-thirds of them children and women, and the hostilities and casualties have spread to neighboring countries. Since October 7, Israeli forces have carried out unlawful and apparently unlawful attacks on medical facilities, personnel and transport and a civilian vehicle, and have struck multi-story residential buildings, evacuation convoys, bakeries, water pipes and electricity networks, schools and facilities of the UN Relief and Works Agency for Palestine Refugees (UNRWA) that are sheltering displaced people. According to the UN, more than 52,000 homes have been destroyed and more than 1.9 million people are internally displaced within Gaza. If carried out intentionally or recklessly, attacks directed against the civilian population and civilian objects are war crimes. The Israeli military have also used white phosphorus munitions in Gaza, a densely populated area, which puts civilians at unnecessary risk and is unlawful.\nIsraeli authorities have also imposed a near complete blockade which is a tightening of the unlawful blockade that has been imposed for the last 16 years on the enclave. Other than a trickle of aid, which is a much smaller fraction than was allowed in before October 7 and is totally inadequate to meet the subsequent escalating needs, the Israeli authorities have cut off water, food, fuel, and electricity to Gaza's 2.3 million population. This is a form of collective punishment of the population, which is a war crime. The UN has stated the humanitarian situation is \"intolerable\" and \"beyond dire.\"\nUNRWA has at times been unable to distribute the trickle of aid that has been allowed in via the Rafah crossing due to lack of fuel, and the fuel that has since been allowed in is well below minimum requirements. The WHO has documented 212 attacks on healthcare in the Gaza Strip from October 7, 2023, to December 5, 2023, and reports that 34 out of 39 hospitals and primary healthcare centers are out of service. Many bakeries in Gaza have closed because of lack of fuel, water, wheat flour and structural damage, and food supplies are dangerously low. The UN has warned of the immediate risk of starvation. Intentionally using starvation as a method of warfare is a war crime. Around 70 percent of the population in Gaza lack access to clean water, which risks dehydration, and public health experts have expressed grave concerns of an imminent infectious disease outbreak in Gaza, including waterborne illnesses like cholera and typhoid.\nIn the context of the current hostilities, serious violations of international law have been committed by all parties to the armed conflict, some of which amount to war crimes. The UK risks being complicit in and facilitating serious violations of international humanitarian law if it fails to halt arms exports to Israel immediately. This risk is further heightened by statements of high-level Israeli officials that have sought to hold Gaza's entire population responsible for the October 7 attacks, appear to disregard the principle of distinction and the protected status of civilians and civilian infrastructure, and risks mass intentional forced displacement of the civilian population in Gaza which if carried out would amount to a war crime.\nPrime Minister Netanyahu invoked Amalek in a speech about intensifying Israel's operations in Gaza.[1] Defense Minister Yoav Gallant said, \"We are fighting human animals and we are acting accordingly.\" Security Cabinet Member and Agriculture Minister Avi Dichter said, \"We are now rolling out the Gaza Nakba\". President Herzog said, \"It is an entire nation out there that is responsible,\" while one minister remarked that \"there is no reason\" to provide humanitarian aid to the population until Israeli forces \"eliminate\" Hamas. The Israeli army spokesperson Daniel Hagari has boasted that, \"Gaza will eventually turn into a city of tents. There will be no buildings,\" adding \"the emphasis\" is \"on damage and not on accuracy.\"\nHostilities between the Israeli military and armed groups in Gaza have occurred in 2008/9, 2012, 2014, 2018, 2021, and 2022. UK-based charities have witnessed, documented, and sought to alleviate the destruction, hardship and impoverishment generated by conflict and blockade. In hostilities prior to 2023, Israeli forces carried out unlawful airstrikes that killed scores of civilians at a time, wiping out entire families, and targeted civilian infrastructure, destroying high-rise buildings in Gaza full of homes and businesses, with no evident military targets in the vicinity -acts that violate the laws of war. Palestinian armed groups have fired rockets indiscriminately at Israeli communities. However, the number of civilian deaths happening now is significantly higher than in recent hostilities. These acts have been carried out by all parties to the conflict with impunity.\nPursuant to criteria 2(b) of the SELC, the UK Government must also exercise special caution and vigilance in granting licenses to countries where serious violations have been established by the competent bodies of the UN, and certainly such findings of violations are relevant to the determination of 'risk' under international and domestic law. The UN Independent International Commission of Inquiry on the Occupied Palestinian Territory, including East Jerusalem, and Israel, has made findings of the use of excessive force, violations of rights to freedom of association, expression and opinion, rights to privacy, economic, social, and cultural rights, forcible deportation of individuals and entire communities by Israel. In the context of hostilities in Gaza in 2008 and 2009, the United Nations Fact Finding Mission on the Gaza conflict found Israel carried out collective punishment, disproportionate and indiscriminate attacks resulting in deaths, serious injuries, and extensive destruction of civilian infrastructure, and failed to take feasible precautions to avoid or minimize incidental loss of civilian life, injury to civilians and damage to civilian objects, and failed to hold those responsible to account.\nIn the context of the current hostilities, there is a clear and overriding risk that UK licensed military equipment could be used to commit or facilitate a serious violation of international law, including unlawful attacks that may amount to war crimes. Our organizations demand an immediate suspension of arms transfers to all parties to the current conflict. For the UK government, this requires a halt to the arming of Israel. Failure to do so risks the Government breaching its own laws and being complicit in grave abuses.\nSignatories:\nAsad Rehman, Chief Executive, War on Want\nKatie Fallon, Director of Advocacy, Campaign Against the Arms Trade\nSacha Deshmukh, Chief Executive, Amnesty International UK\nYasmine Ahmed, UK Director, Human Rights Watch\nAdditional signatories:\nPaul Parker, Recording Clerk, Quakers in Britain\nCaroline Qutteneh, Director, Welfare Association\nCharlotte Marshall, Director, Sabeel-Kairos UK\nTayab Ali, Director, International Centre of Justice for Palestinians\n[1] Prime Minister Netanyahu refers to a verse of the Old Testament where God commands King Saul in the first Book of Samuel to kill every person in Amalek, a rival nation to ancient Israel. \"This is what the Lord Almighty says,\" the prophet Samuel tells Saul. \"'I will punish the Amalekites for what they did to Israel when they waylaid them as they came up from Egypt. Now go, attack the Amalekites, and totally destroy all that belongs to them. Do not spare them; put to death men and women, children and infants, cattle and sheep, camels, and donkeys.\"\nSource: Human Rights Watch", "source_domain": "www.theuknews.com", "text": null, "title": "Letter to the UK Government Calling for an Immediate Halt to UK Arms Transfers to the Government of Israel", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274062866/letter-to-the-uk-government-calling-for-an-immediate-halt-to-uk-arms-transfers-to-the-government-of-israel"}