{"authors": [], "date_download": "2024-02-05 15:26:37", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Click to expand Image The Galaxy Leader, a ship seized by the Houthi armed group on November 19, 2023, at a port on the Red Sea in Yemen's Hodeidah governorate, November 22, 2023. 2023 AFP via Getty Images (Beirut) - The Houthi armed group that controls part of Yemen has targeted several commercial ships carrying civilian crews in the Red Sea over the last few weeks, Human Rights Watch said today. The attacks included firing missiles or drones at four ships and arbitrarily detaining the crew of a fifth ship. The attacks constitute targeting of civilians and civilian objects, which, if carried out deliberately or recklessly, would be a war crime. The Houthis have stated that they would continue to \"carry out their military operations against the Israeli enemy,\" and have \"implement[ed] the decision to prevent Israeli ships from navigating the Arab and Red Seas in support of the oppressed Palestinian people.\" However, the five ships are not military objects; all five are commercial vessels with civilian crews. The Houthis have not presented any evidence to demonstrate that anything on board of the ships could have constituted military objects. \"The Houthis are claiming that they're carrying out attacks on behalf of Palestinians, when the reality is that they're attacking, arbitrarily detaining, and endangering civilians on ship crews who have zero connection to any known military target,\" said Michael Page, Middle East and North Africa deputy director at Human Rights Watch. \"The Houthis should immediately release the hostages and end their attacks on civilians caught in the crosshairs of their declared war on Israel.\" On November 19, the Houthis, the de facto authorities in Sanaa and much of northern Yemen, seized the Galaxy Leader, a British-owned and Japanese-operated vehicles carrier registered in the Bahamas. Footage that the Houthis posted online show Houthi forces boarding the ship, moving around, and pointing guns at the crew. The Houthis then steered the ship, along with the crew, to al-Salif Port in Hodeidah, which is under their control, on Yemen's western coast. That same day, a Houthi spokesperson, Yahya Saree, posted on X, formerly Twitter, stating that the Houthis would target ships carrying the Israeli flag and ships operated or owned by Israeli companies, regardless of whether the ships contained any military targets. The 25-person crew has still not been released, and the boat remains docked in the port. Hirokazu Matsuno, Japan's chief cabinet secretary, said that the Japanese government was working to secure the release of the ship and its crew, which includes nationals from Bulgaria, the Philippines, Mexico, and Ukraine. Human Rights Watch spoke to sources who said it is unclear whether the crew is being held hostage or is being arbitrarily detained, as the Houthis have not made clear why they continue to hold the men. Taking hostages is prohibited under international humanitarian law, including under Common Article 3 to the 1949 Geneva Conventions, and is a war crime. Hostage-taking is detaining a person while threatening to kill, injure, or continuing to detain the person to compel a third party to do or abstain from any act as a condition for the hostage's release or safety. A Houthi spokesperson, Mohammed Abdulsalam, stated on X that Houthis' seizure of the vessel was \"only the beginning\" of its fighters waging \"battle at sea.\" Though the Houthis have said that the ship is Israeli, the ship is British-owned and Japanese-operated and was bound for India when it was captured. The Houthis have presented no evidence of military targets on board. The parent company of the UK company that owns the ship is owned by an Israeli businessman, but this does not make the ship a legitimate military target. According to several media outlets and the US Defense Department, the Houthis on December 3 attacked two other bulk cargo carriers, Unity Explorer and Number 9, and a container ship, AOM Sophie II, with missiles and drones. Unity Explorer and Number 9 are owned and operated by two different UK-based companies, while Sophie II is owned and operated by a Japanese company. The UK company that owns Unity Explorer may be owned by an Israeli businessman, but it is unclear. Unity Explorer is registered in the Bahamas, while Number 9 and Sophie II are registered in Panama. All three vessels are commercial ships and were carrying civilian crews from several countries. None of the ships were bound for Israel. US Central Command also stated that amid the attacks on the three vessels, the USS Carney, a warship moored in the Red Sea, shot down two drones, one of which was headed toward the Carney, \"although its specific target is not clear.\" Saree claimed that the Houthis had attacked two of the vessels, the Unity Explorer and Number 9, in a statement on December 3. An Israeli military spokesman, Daniel Hagari, has stated that the Unity Explorer and the Number 9 have \"no connection to the state of Israel.\" On December 12, the Houthis struck another ship, the Norwegian-flagged Strinda, with a missile. Geir Belsnes, the CEO of the Norwegian company that owns and operates the Strinda, stated that there were no casualties. The Houthis claimed that the ship was carrying oil to Israel. However, Belsnes said that the ship was carrying palm oil to Italy. Evidence reviewed by Human Rights Watch, including Houthi statements, indicates that the Houthis knew or should have known that the four ships they attacked were commercial vessels carrying civilians and that they were not in any way a military target. Under international humanitarian law, it is forbidden in any circumstance to carry out direct attacks against civilians.Warring parties are obligated to take all feasible precautions to avoid harm to civilians. They must take all necessary action to verify that targets are military objectives. A person who commits serious violations of the laws of war with criminal intent-that is, intentionally or recklessly-may be prosecuted forwar crimes. Individuals may also be held criminally liable for assisting in, facilitating, aiding, or abetting a war crime. On December 9, Saree announced that the Houthis were expanding their plans to attack Israeli ships in the Red Sea to include \"all the ships ... from any nationality\" heading toward Israel, for as long as food and medicine are not allowed into Gaza. The Bab al-Mandeb is a strait between Yemen, Djibouti, and Eritrea that connects the Gulf of Aden to the Red Sea, which borders Israel/Palestine. The strait is a critical shipping route, as it is the only way to reach Eritrea, Jordan, and Sudan by sea. The only other way to reach Israel/Palestine and Egypt from the Arabian or Indian Oceans is to travel around the Cape of Good Hope, a trip that takes significantly longer than moving through the Bab al-Mandeb strait. Several ships havedivertedtheir courses because of the Houthi attacks. According to the International Chamber of Shipping, a global trade association for shipowners and operators, \"[t]he attacks are a flagrant breach of international law and maritime norms.\" The Houthis have also fired several missiles toward the southern Israeli town of Eilat. Thus far, there is no evidence that any of the missiles have struck Israeli targets. The Houthis' attacks on ships, as well as their broader attacks on Israel, come amid hostilities between Israeli forces and Palestinian armed groups. Human Rights Watch has extensively documented the widespread violations by Israeli forces and Palestinian armed groups during the hostilities. On December 9, Israeli National Security Adviser Tzachi Hanegbi stated that \"Israel will act\" if the international community does not respond to the Houthis' attacks in the Red Sea. The United States and the United Kingdom have accused Iran of having been involved in the attacks. The spokesperson for Iran's Foreign Ministry, Nasser Kanaani, has stated that the Houthis, as well as \"resistance groups in the region,\" are not attacking Israel based on orders from Iran. The UN Panel of Experts on Yemen previously found that Iran has \"failed to take the necessary measures to prevent the direct or indirect supply, sale or transfer\" of various ballistic missiles that the Houthis have used to perpetrate unlawful attacks. Since the Houthis took over Yemen's capital, Sanaa, in 2014, they have carried out widespread violations of international humanitarian law and civilian harm, including likely war crimes, indiscriminately attacking civilians and civilian infrastructure, forcibly disappearing civilians, and laying an abusive siege to Taizz city in the southwest of Yemen. The Yemeni government, along with the Saudi and UAE-led coalition, have also perpetrated unlawful attacks on civilians, including likely war crimes. \"The Houthis still have not taken responsibility for the civilian harm that they have caused to those living in Yemen,\" Page said. \"Rather than carrying out new war crimes, they should focus on achieving a durable peace in their country.\"", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274063261%2Fyemen-houthis-attack-civilian-ships.json", "image_url": "https://cdn.bignewsnetwork.com/YmUwOGE5YTYtZTg.jpg", "language": "en", "localpath": null, "maintext": "(Beirut) - The Houthi armed group that controls part of Yemen has targeted several commercial ships carrying civilian crews in the Red Sea over the last few weeks, Human Rights Watch said today. The attacks included firing missiles or drones at four ships and arbitrarily detaining the crew of a fifth ship. The attacks constitute targeting of civilians and civilian objects, which, if carried out deliberately or recklessly, would be a war crime.\nThe Houthis have stated that they would continue to \"carry out their military operations against the Israeli enemy,\" and have \"implement[ed] the decision to prevent Israeli ships from navigating the Arab and Red Seas in support of the oppressed Palestinian people.\" However, the five ships are not military objects; all five are commercial vessels with civilian crews. The Houthis have not presented any evidence to demonstrate that anything on board of the ships could have constituted military objects.\n\"The Houthis are claiming that they're carrying out attacks on behalf of Palestinians, when the reality is that they're attacking, arbitrarily detaining, and endangering civilians on ship crews who have zero connection to any known military target,\" said Michael Page, Middle East and North Africa deputy director at Human Rights Watch. \"The Houthis should immediately release the hostages and end their attacks on civilians caught in the crosshairs of their declared war on Israel.\"\nOn November 19, the Houthis, the de facto authorities in Sanaa and much of northern Yemen, seized the Galaxy Leader, a British-owned and Japanese-operated vehicles carrier registered in the Bahamas. Footage that the Houthis posted online show Houthi forces boarding the ship, moving around, and pointing guns at the crew. The Houthis then steered the ship, along with the crew, to al-Salif Port in Hodeidah, which is under their control, on Yemen's western coast.\nThat same day, a Houthi spokesperson, Yahya Saree, posted on X, formerly Twitter, stating that the Houthis would target ships carrying the Israeli flag and ships operated or owned by Israeli companies, regardless of whether the ships contained any military targets.\nThe 25-person crew has still not been released, and the boat remains docked in the port. Hirokazu Matsuno, Japan's chief cabinet secretary, said that the Japanese government was working to secure the release of the ship and its crew, which includes nationals from Bulgaria, the Philippines, Mexico, and Ukraine.\nHuman Rights Watch spoke to sources who said it is unclear whether the crew is being held hostage or is being arbitrarily detained, as the Houthis have not made clear why they continue to hold the men.\nTaking hostages is prohibited under international humanitarian law, including under Common Article 3 to the 1949 Geneva Conventions, and is a war crime. Hostage-taking is detaining a person while threatening to kill, injure, or continuing to detain the person to compel a third party to do or abstain from any act as a condition for the hostage's release or safety.\nA Houthi spokesperson, Mohammed Abdulsalam, stated on X that Houthis' seizure of the vessel was \"only the beginning\" of its fighters waging \"battle at sea.\"\nThough the Houthis have said that the ship is Israeli, the ship is British-owned and Japanese-operated and was bound for India when it was captured. The Houthis have presented no evidence of military targets on board. The parent company of the UK company that owns the ship is owned by an Israeli businessman, but this does not make the ship a legitimate military target.\nAccording to several media outlets and the US Defense Department, the Houthis on December 3 attacked two other bulk cargo carriers, Unity Explorer and Number 9, and a container ship, AOM Sophie II, with missiles and drones. Unity Explorer and Number 9 are owned and operated by two different UK-based companies, while Sophie II is owned and operated by a Japanese company. The UK company that owns Unity Explorer may be owned by an Israeli businessman, but it is unclear. Unity Explorer is registered in the Bahamas, while Number 9 and Sophie II are registered in Panama. All three vessels are commercial ships and were carrying civilian crews from several countries. None of the ships were bound for Israel.\nUS Central Command also stated that amid the attacks on the three vessels, the USS Carney, a warship moored in the Red Sea, shot down two drones, one of which was headed toward the Carney, \"although its specific target is not clear.\"\nSaree claimed that the Houthis had attacked two of the vessels, the Unity Explorer and Number 9, in a statement on December 3.\nAn Israeli military spokesman, Daniel Hagari, has stated that the Unity Explorer and the Number 9 have \"no connection to the state of Israel.\"\nOn December 12, the Houthis struck another ship, the Norwegian-flagged Strinda, with a missile. Geir Belsnes, the CEO of the Norwegian company that owns and operates the Strinda, stated that there were no casualties. The Houthis claimed that the ship was carrying oil to Israel. However, Belsnes said that the ship was carrying palm oil to Italy.\nEvidence reviewed by Human Rights Watch, including Houthi statements, indicates that the Houthis knew or should have known that the four ships they attacked were commercial vessels carrying civilians and that they were not in any way a military target.\nUnder international humanitarian law, it is forbidden in any circumstance to carry out direct attacks against civilians. Warring parties are obligated to take all feasible precautions to avoid harm to civilians. They must take all necessary action to verify that targets are military objectives. A person who commits serious violations of the laws of war with criminal intent-that is, intentionally or recklessly-may be prosecuted for war crimes. Individuals may also be held criminally liable for assisting in, facilitating, aiding, or abetting a war crime.\nOn December 9, Saree announced that the Houthis were expanding their plans to attack Israeli ships in the Red Sea to include \"all the ships ... from any nationality\" heading toward Israel, for as long as food and medicine are not allowed into Gaza.\nThe Bab al-Mandeb is a strait between Yemen, Djibouti, and Eritrea that connects the Gulf of Aden to the Red Sea, which borders Israel/Palestine. The strait is a critical shipping route, as it is the only way to reach Eritrea, Jordan, and Sudan by sea. The only other way to reach Israel/Palestine and Egypt from the Arabian or Indian Oceans is to travel around the Cape of Good Hope, a trip that takes significantly longer than moving through the Bab al-Mandeb strait. Several ships have diverted their courses because of the Houthi attacks. According to the International Chamber of Shipping, a global trade association for shipowners and operators, \"[t]he attacks are a flagrant breach of international law and maritime norms.\"\nThe Houthis have also fired several missiles toward the southern Israeli town of Eilat. Thus far, there is no evidence that any of the missiles have struck Israeli targets.\nThe Houthis' attacks on ships, as well as their broader attacks on Israel, come amid hostilities between Israeli forces and Palestinian armed groups. Human Rights Watch has extensively documented the widespread violations by Israeli forces and Palestinian armed groups during the hostilities.\nOn December 9, Israeli National Security Adviser Tzachi Hanegbi stated that \"Israel will act\" if the international community does not respond to the Houthis' attacks in the Red Sea.\nThe United States and the United Kingdom have accused Iran of having been involved in the attacks. The spokesperson for Iran's Foreign Ministry, Nasser Kanaani, has stated that the Houthis, as well as \"resistance groups in the region,\" are not attacking Israel based on orders from Iran. The UN Panel of Experts on Yemen previously found that Iran has \"failed to take the necessary measures to prevent the direct or indirect supply, sale or transfer\" of various ballistic missiles that the Houthis have used to perpetrate unlawful attacks.\nSince the Houthis took over Yemen's capital, Sanaa, in 2014, they have carried out widespread violations of international humanitarian law and civilian harm, including likely war crimes, indiscriminately attacking civilians and civilian infrastructure, forcibly disappearing civilians, and laying an abusive siege to Taizz city in the southwest of Yemen.\nThe Yemeni government, along with the Saudi and UAE-led coalition, have also perpetrated unlawful attacks on civilians, including likely war crimes.\n\"The Houthis still have not taken responsibility for the civilian harm that they have caused to those living in Yemen,\" Page said. \"Rather than carrying out new war crimes, they should focus on achieving a durable peace in their country.\"\nSource: Human Rights Watch", "source_domain": "www.britainnews.net", "text": null, "title": "Yemen: Houthis Attack Civilian Ships", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274063261/yemen-houthis-attack-civilian-ships"}