{"authors": [], "date_download": "2024-02-05 15:26:38", "date_modify": "None", "date_publish": "2023-12-15 05:02:09", "description": "From the Israel-Hamas war to Russia’s grinding battles against Ukraine, 2023 has shown the dangers of armed conflicts breaking out into region-wide combat", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisrael-ap-hamas-ukraine-gaza-b2464550.html.json", "image_url": "https://static.independent.co.uk/2023/12/15/05/YE_A_Year_of_War_07067.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA boy, his face coated in fresh blood, screams as rescuers try to pull him out of the rubble of a destroyed building following an Israeli airstrike in Gaza. A bruised, elderly Israeli hostage is taken away by Hamas in a golf cart as a man clutching a machine gun sits behind her, smiling. A 10-year-old girl cries next to the body of her brother as he is buried near Kyiv, Ukraine.\nThis year as in years past, The Associated Press was there up close to document the world’s conflicts and their toll on civilians.\nFrom the Israel-Hamas war to Russia’s grinding battles against Ukraine, 2023 has shown the dangers of armed conflicts breaking out into region-wide combat. But behind their long shadows, the world faces strife in countries stretching both the globe and the alphabet from Afghanistan all the way to Yemen.\nCoups and violence across Africa upended life in nations there. Myanmar in Southeast Asia faces what some experts describe as a slow-burning civil war. Drug-trade-fueled violence continues in Central and South America.\nNuclear-armed India and Pakistan remain suspicious of each other. North Korea's atomic arsenal continues to grow. And Iran now enriches uranium closer than ever to weapons-grade levels.\n“Conflicts have become more complex, deadly and harder to resolve. ... Concerns about the possibility of nuclear war have re-emerged. New potential domains of conflict and weapons of war are creating new ways in which humanity can annihilate itself,\" United Nations Secretary-General Antonio Guterres said in July.\nHere's a look at where some of the world's major wars stand now.\nTHE DEADLIEST-EVER ISRAEL-HAMAS WAR\nThe bloodiest war between Israel and Hamas began Oct. 7, when militants broke through the walls surrounding the seaside enclave of the Gaza Strip. Its fighters killed some 1,200 people in Israel and took more than 200 others hostages, spiriting them back into the territory. The attack, described as the worst one-day mass killing of Jews since the Holocaust, stunned an Israel that had believed its border wall, technologically advanced military and intelligence services broadly protected them from all but harassing militant rocket fire.\nIsrael's embattled Prime Minister Benjamin Netanyahu, already reeling from months of protests over his hard-right government's attempts to overhaul the country's judiciary and corruption allegations, launched a massive campaign of retaliatory airstrikes.\nIsraeli troops also entered the Gaza Strip for the first time in years, moving into Gaza City and fighting intense street-to-street combat. The offensive killed over 18,700 people in the Gaza Strip, home to more than 2 million residents also facing an Israeli siege largely blocking food, fuel, water and medicine shipments.\nMeanwhile, the mass killing of Israelis and Palestinians sparked protests across the world, many sympathetic to the Palestinians after years of deadlock over them obtaining their own state.\nIranian-backed militias, including Lebanon's Hezbollah, fired on Israel. The U.S. sent in two aircraft carriers, troops and other weaponry to the region to try and deter a wider regional war from breaking out. But Israel's repeated stated goal — the destruction of Hamas — guaranteed a long military campaign ahead, raising risks.\nRUSSIA AND UKRAINE REMAIN LOCKED IN COMBAT\nThe fast pace of the Israel-Hamas war overshadowed Russia's war on Ukraine in late 2023. But in the months prior, little had changed on the battlefield for either side.\nUkraine received tanks, weapons and Western training before launching a renewed counteroffensive believed to be aimed at reaching the Sea of Azov and splitting the Russian lines in the country's south. But Ukrainian forces faced dug-in Russian troops, multiple defense lines, minefields and other hazards, making gains either slowly or not at all. And while Western nations remained publicly unified behind Ukraine, polls including the U.S. presidential election next year could affect just how much aid Kyiv will get in the future.\nRussia faced difficulties as well, including a march on Moscow by the leader of the private military firm Wagner, Yevgeny Prigozhin, that represented the greatest challenge yet to President Vladimir Putin's yearslong rule. Prigozhin backed off the march, only to die weeks later in a mysterious, fiery plane crash.\nAFRICAN UNREST\nSudan, a big East African nation that had been teetering since the overthrow of longtime ruler Omar al-Bashir, collapsed into civil war in April. The war pits the country's military against a powerful paramilitary force known as the Rapid Support Forces, long linked to atrocities in Darfur. The fighting saw crossfire set airplanes ablaze at Khartoum's international airport and nations rush to try to evacuate their nationals by land, sea and air. The fighting has killed some 9,000 people so far.\nMeanwhile, a wave of military coups roiling Africa in recent years continued. In Niger, a former French colony that's a key uranium exporter, soldiers toppled the country's democratically elected president in July. A month later, troops similarly staged a coup in Gabon overthrowing its long-term ruling president.\nLATIN AMERICA'S DRUG WARS\nDrug cartel violence raged across portions of Mexico as they fight over territory and supply routes into the United States. But the conflict isn't limited to there. Violence has surged in other Central American nations, like Honduras and even in once-peaceful Costa Rica, now believed to be a major warehousing and transshipment point for drugs heading onto Europe. Colombia meanwhile has reached an all-time high for its production of coca, the leaf from which cocaine is made.\nSTALEMATES AND MILITANCY ELSEWHERE\nIn the Southeast Asian nation of Myanmar, some U.N. experts say a civil war is underway between rebels and the army since a coup overthrew the elected government of Aung San Suu Kyi. Afghanistan, two years after the Taliban topped Kabul's Western-backed government, faces militant attacks from an offshoot of the Islamic State group as girls remain barred from secondary education.\nAnd in Yemen, that country's Iranian-backed Houthi rebels and a Saudi-led coalition battling them have yet to reach a permanent peace deal, which has seen the militants begin to again step up their attacks in recent weeks.", "source_domain": "www.independent.co.uk", "text": null, "title": "A year of war: 2023 sees worst-ever Israel-Hamas combat as Russian attacks on Ukraine grind on", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israel-ap-hamas-ukraine-gaza-b2464550.html"}