{"authors": [], "date_download": "2024-02-05 15:26:40", "date_modify": "None", "date_publish": "2023-12-15 05:19:56", "description": "The White House says funding for Ukraine has run out and it has been increasing pressure on Congress to pass stalled legislation to support the war against Russia", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-white-house-joe-biden-pentagon-b2464559.html.json", "image_url": "https://static.independent.co.uk/2023/12/15/05/United_States_Ukraine_Funding_Explainer_80128.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe White House has been increasingly pressuring Congress to pass stalled legislation to support Ukraine's war against Russia, saying that funding has run out.\nOn Tuesday, however, President Joe Biden touted a new military aid package worth $200 million for Ukraine.\nMoney is dwindling. But the announcement of more weapons being sent to Kyiv just underscores the complexity of the funding. So has the money run out? Or are there still a few billion dollars floating around?\nIt’s complicated.\nStore credit ...\nIn a Nov. 4 letter to Congress, White House budget director Shalanda Young said flatly: “We are out of money to support Ukraine in this fight. This isn’t a next year problem. The time to help a democratic Ukraine fight against Russian aggression is right now.”\nSince then, the U.S. has announced three more aid packages totaling $475 million. That may seem contradictory, but it's due to the complex programs used to send aid to Ukraine.\nThere are two pots of money for weapons and security assistance set up specifically for the war. One is the Presidential Drawdown Authority, or PDA, under which the U.S. provides weapons already in its stockpile. The other is the Ukraine Security Assistance Initiative, which funds long-term weapons contracts.\nMoney for USAI has all been spent. That pot is empty.\nAnd money for the PDA also appeared to be gone. But then the Pentagon determined that it had overstated the value of the weapons it had already sent Ukraine, overcharging the Ukraine weapons account by $6.2 billion. That effectively left Ukraine with a store credit that is slowly being whittled down. It now stands at around $4.4 billion.\nPDA packages continued to be announced every few weeks. But in recognition of the dwindling money, the latest packages have been smaller — about $200 million or less, compared with previous ones that often totaled $400 million to $500 million.\n... but empty shelves\nIn theory, the Pentagon would have enough equipment to offer these smaller packages for months. But there's a caveat: While the credit exists, there may not be enough stock on the Pentagon shelves. So some weapons may be unavailable.\nCongressional funding to buy weapons to replace the ones the U.S. sends to Ukraine is now down to about $1 billion. That dwindling money means the military services are worried they won't be able to buy all the weapons they need to ensure the U.S. military is ready to defend the American homeland.\nFor example, the 155 mm rounds commonly used by Howitzers are one of the most requested artillery munitions by Kyiv. The demand has been so high that the Army has pressed the Scranton Army Ammunition Plant in Pennsylvania, where the shell casings for the rounds are made, to increase production in order to meet war demands and have enough on hand for American military needs.\nOn Thursday, Maj. Gen. Pat Ryder, the Pentagon press secretary, told reporters the U.S. could provide the full $4.4 billion in weapons, but with only a quarter of that amount available for replenishment, it's a tough choice. “We have to start to make decisions about our own readiness,” he said.\nThe political wrangling\nThe U.S. has already sent Ukraine $111 billion in weapons, equipment, humanitarian assistance and other aid since Russian President Vladimir Putin launched his invasion more than 21 months ago. But the latest package is stalled.\nSupport for Ukraine funding has been waning as some lawmakers see the war taking funding from domestic needs. But the broader problem is a political battle over the southern U.S. border.\nPresident Joe Biden is urging Congress to pass a $110 billion aid package for Ukraine, Israel and other national security needs. It includes $61.4 billion for Ukraine, with about half to replenish Pentagon stocks. It also includes about $14 billion for Israel as it fights Hamas and $14 billion for U.S. border security. Other funds would go for security needs in the Asia-Pacific.\nProspects for compromise remain in doubt, even as Zelenskyy warned in a speech at the National Defense University in Washington on Monday that, “If there’s anyone inspired by unresolved issues on Capitol Hill, it’s just Putin and his sick clique.”\nThe jobs argument\nHarkening back to the “all politics is local” idea, the Pentagon and the White House have rolled out maps and statistics to show members of Congress how their own districts and states are reaping benefits from the Ukraine funding.\nCharts detail $10 billion in industry contracts for weapons ranging from air defense systems and missiles to a wide array of drones, ammunition and other equipment. And they break out an additional nearly $16.8 billion in contracts to replenish Pentagon stocks.\nThe maps show contracts benefitting industries and companies in more than 35 different states. And U.S. officials are hoping the local jobs argument will help build support for the funding.\nHow big is the need?\nWinter has set in, so the fighting in Ukraine has leveled off a bit. And along stretches of the battlefront, fighting is somewhat stalemated.\nBut Ukrainian forces have been taking ground back in some key locations, and Zelenskyy and other leaders have said they want to keep pushing forward. Ukraine does not want to give the Russians weeks or months this winter to reset and further solidify their fighting positions — as they did last winter.\nDuring his visit to Washington this week, Zelenskyy said his forces are making progress, and the White House pointed to newly declassified intelligence that shows Ukraine has inflicted heavy losses on Russia in recent fighting around the eastern city of Avdiivka — including 13,000 casualties and over 220 combat vehicles lost. The Ukrainian holdout in the country’s partly occupied east has been the center of some of the fiercest fighting in recent weeks.\nPutin on Thursday, however, said his troops are making gains.\n“Almost all along the line of contact our armed forces, let’s put it modestly, are improving their positions, almost all are in an active stage of action and there is an improvement in the position of our troops all along,” he said.\n____\nAssociated Press writer Tara Copp contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "How the US keeps funding Ukraine's military - even as it says it's out of money", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-white-house-joe-biden-pentagon-b2464559.html"}