{"authors": ["Rob Crilly", "Senior U.S. Political Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:26:44", "date_modify": "None", "date_publish": "2023-12-15 16:31:54", "description": "Mazi Melesa Pilip was born in Ethiopia before serving as a paratrooper in the Israel Defense Forces. She first ran for office in 2021 promising to fight antisemitism.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12868627%2Fidf-paratrooper-replace-george-santos-republican-long-island.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/15/16/79009617-0-image-m-26_1702657883507.jpg", "language": "en", "localpath": null, "maintext": "If you thought Republicans on Long Island would play it safe in seeking a replacement for disgraced fantasist George Santos, think again.\nRather than selecting a white establishment figure they have picked a little-known local lawmaker who comes with a big backstory that they believe could make here a future star.\nMazi Melesa Pilip, 44, was born in Ethiopia before leaving for Israel where she served as a paratrooper in the Israel Defense Forces.\nShe first ran for office in 2021 promising to fight antisemitism.\nThat is the sort of resumé that gets party bosses excited, particularly at a time when the conflict in Israel is threatening to upend political allegiances.\nMazi Melesa Pilip served as a paratrooper in the Israel Defence Forces for two years after turning 18. She was born in Ethiopia and fled with her family to Israel at the age of 12\nNow she is a county legislator on Long Island and is the Republican pick to replace George Santos in the House of Representatives. A special election will be be held in February\n'Pilip is an effective tax fighter who will prioritize public safety, economic recovery, border security and tax relief in Congress,' said Republicans in Queens and Nassau County.\n'She will bring a fresh new perspective to Washington, starkly contrasting her from the candidate for the other major political party.'\nSantos was expelled from New York's third Congressional District amid damning evidence that he faked his life story and defrauded donors.\nThe district went for Joe Biden in the 2020 presidential election but flipped Republican in the mid-terms last year, making it a top Democratic target as the party tries to win back the House of Representatives.\nDemocrats have picked a well-known figure in Former Rep. Tom Suozzi, who gave up the seat to run for governor.\nBut Republicans think they have a potential winner in Pilip.\nShe was born in Ethiopia and has described growing up with no running water in her village.\nThat all changed when her family fled in 1991 at a time of huge political upheaval in the country. Rebels were closing on the capital, where a brutal Marxist government held power.\nIsrael launched a covert military operation to rescue 14,000 Ethiopian Jews, flying them out of the country aboard 35 aircraft in just 36 hours.\nSantos was expelled from New York's third Congressional District amid damning evidence that he faked his life story and defrauded donors\nOne 747 carried more than 1,000 people — a world record.\nPilip and her family were on one of the flights.\n'It was beautiful and full of light,' she told the Jewish website Aish. 'When we landed, soldiers helped us and gave us everything we needed. We started a new life in the most beautiful country in the world.'\nGrowing up in Israel meant national service. And Pilip spent two years as a paratrooper in the Israel Defence Force, which is now doing battle with Hamas in the Palestinian enclave of Gaza.\n'It was a moment of pride because I felt like I was giving back to the country that had given so much to me and my family,' she said.\nShe met her future husband while studying occupational therapy at the University of Haifa. He was an American Ukrainian Jew, which is how she eventually came to be living in Great Neck, New York, with him and their seven children.\nPilip met her husband Adalbert Pilip while a student in Haifa. They now live in Great Neck, New York with their seven children\nShe first ran for office in 2021 after being horrified by growing antisemitism in the U.S.\nTwo years ago, she said she became aware of growing antisemitism and wanted to do something about it. Today, she is a legislator in Nassau County.\nThere is a wrinkle, however. Politico reported that she has registered as a Democrat since 2012, although she has frequently sided with Republican positions.\nHer name was connected with Santos' seat as soon as allegations that he was a fantasist surfaced.\nHis claims included a story that his Ukrainian Jewish maternal grandparents were forced to flee Germany during the Holocaust. Genealogy records suggest they were born in Brazil.\nPilip said: 'What I didn't like was he said his father is Black and his grandparents are Holocaust survivors. My husband's grandmother is a Holocaust survivor. Her family died in Germany. It’s more personal for my husband.'\nIf elected in February's special election, she would become just three Jewish Republicans in the House, and the only one of color.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "The ex-IDF paratrooper who could replace George Santos as the Republican in Long Island: Mother-of-seven Ethiopian refugee who fled to Israel at 12, signed up to fight and then moved to the U.S. and g", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12868627/idf-paratrooper-replace-george-santos-republican-long-island.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}