{"authors": ["Ishita Srivastava", "Ishita Srivastava For Dailymail.Com"], "date_download": "2024-02-05 15:15:24", "date_modify": "None", "date_publish": "2024-01-27 07:22:07", "description": "Yemen's Houthi rebels launched a missile at the USS Carney on Friday but instead set a commercial vessel ablaze. Yemeni armed forces claim that the oil tanker Marlin Luanda was 'British'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13012907%2FYemen-Houthi-rebels-missile-warship-British-commercial.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/27/06/80530329-0-image-a-35_1706338069442.jpg", "language": "en", "localpath": null, "maintext": "Yemen's Houthi rebels have launched a missile at a US warship patrolling the Gulf of Aden, forcing them to shoot it down and instead striking a commercial vessel yesterday.\nThe attack was made on the USS Carney and marked a further escalation in the biggest naval confrontation the US has seen in the Middle East in decades.\nThe rebel's single anti-ship ballistic instead set the commercial vessel ablaze during the attack.\nAccording to the US military's Central Command, their forces conducted a retaliation strike against a Houthi anti-ship missile that was aimed into the Red Sea early Saturday morning local time.\nThe Houthis' Al-Masirah satellite news channel said the strikes happened near the port city of Hodeida but offered no assessment of their damage.\nYemen's Houthi rebels launched a missile at the USS Carney on Friday but instead set a commercial vessel ablaze\nHouthi rebels claim to have struck the Marlin Luanda oil tanker, which they labelled a 'British oil ship' (file picture)\nThis is the first time the Houthis directly targeted a US warship since the rebels began their assaults on shipping in October, an anonymous source told Associated Press.\nHouthi military spokesperson Brigadier general Yahya Saree did not acknowledge the Carney attack identified the commercial vessel as the Marshall Islands-flagged tanker Marlin Luanda.\nThe attack on Marlin Luanda was also confirmed by Central Command.\nThe Carney and other coalition ships responded and were rendering assistance toward the stricken ship. Central Command said no injuries were reported.\nDespite the Carney being directly targeted, Central Command said the Houthis fired 'towards' the Carney. The Carney shot down the anti-ship ballistic missile, the Central Command said.\nBrad Bowman, a senior director at the Foundation for the Defense of Democracies said: 'The're now finally calling a spade a spade, and saying that, yeah, they´re trying to attack our forces, they're trying to kill us.'\nThe Houthis' now direct attacks on U.S. warships are the most aggressive escalation of its campaign in the Red Sea since the Israel-Hamas war broke out.\nUK Maritime Trade Operations, a Royal Navy initiative monitoring maritime traffic in the Middle East, says the incident happened in the Gulf of Aden\nThe Houthis have claimed the Marlin Luanda is 'British', in this statement shared on X, formerly Twitter, despite records showing the boat is flying under a foreign flag\nSare'e, the official spokesperson for the Yemeni armed forces, said it had targeted Marlin Luanda, which it labelled a 'British oil ship', with a 'number of appropriate naval missiles'. It was carrying Russian fuel.\nBut shipping records show the vessel flies under the flag of the Marshall Islands, a group of Pacific islands north-east of Papua New Guinea. MailOnline understands that the ship is also owned by a Bermuda-based firm.\nAuthorities in the area are responding to the incident. Trafigura, the commodities supply firm that chartered the ship, says it is in contact with the crew. Trafigura itself is based in Singapore but has a 'regional hub' in London.\nA spokesperson told MailOnline that fire-fighting equipment was being used to control the blaze, which was caused in one cargo tank on the starboard side of the vessel.\nA Trafigura spokesperson said: 'Earlier on 26 January, the Marlin Luanda, a petroleum products tanker vessel operated on behalf of Trafigura, was struck by a missile as it transited the Red Sea.\n'Firefighting equipment on board is being deployed to suppress and control the fire caused in one cargo tank on the starboard side. The safety of the crew is our foremost priority.\n'We remain in contact with the vessel and are monitoring the situation carefully. Military ships in the region are underway to provide assistance.'\nMailOnline understands the Marlin Luanda is leased by Singapore firm Trafigura from its owners, a group of investors who own the vessel through a company registered in the British Overseas Territory of Bermuda.\nThe attacks were the latest assaults by the rebels in their campaign against ships traveling through the Red Sea and surrounding waters, which has disrupted global trade amid Israel´s war on Hamas in the Gaza Strip.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Yemen Houthi rebels fire a missile at a US warship, escalating worst Mideast sea conflict in decades", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13012907/Yemen-Houthi-rebels-missile-warship-British-commercial.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}