{"authors": ["Nimo Omer"], "date_download": "2024-02-05 15:26:46", "date_modify": "None", "date_publish": "2023-12-14 06:40:59", "description": "In today’s newsletter: Joe Biden is striking an increasingly lonely figure on the global stage and tensions are rising with Benjamin Netanyahu", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F14%2Fthursday-briefing-can-us-support-for-israels-war-against-hamas-survive-indiscriminate-bombing.json", "image_url": "https://i.guim.co.uk/img/media/b1b218e91f2c57d6bf9848ea1922a39cf88ba792/0_374_5712_3427/master/5712.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6657f5dbdfd70dc6cf97082e22f6157b", "language": "en", "localpath": null, "maintext": "Good morning.\nThe US and Israel have long had a special, albeit complicated, relationship. So when Hamas launched its brutal attack on 7 October, the Biden administration immediately offered Israel strong political and military support. Two and a half months into the bloody war in Gaza, the situation has changed significantly. The scale of death and destruction in the strip has meant that global support for Israel has weakened. This week the UN general assembly called for an immediate humanitarian ceasefire in Gaza after a resounding vote in which 153 member states out of 193 supported the resolution.\nThe US was one of only 10 countries that voted against the resolution – even the UK and Germany, who have been supporting Israel throughout the war, abstained, making Biden an increasingly lonely figure on the world stage.\nHowever, reports of rising tensions between Israeli leader, Benjamin Netanyahu, and president Biden have become increasingly common. The pair are said to be at odds over the handling of the conflict, which has left at least 18,000 people dead, with some estimates indicating that up to 70% of the fatalities have been women and children.\nI spoke with the Guardian’s world affairs editor, Julian Borger, about the fracturing relationship between the two states and how it could affect the way Israel prosecutes the war. That’s right after the headlines.\nFive big stories\nIsrael-Gaza war | Heavy winter rains have lashed Gaza, washing out tents and flooding some areas, as the head of the UN’s agency for Palestinian refugees described deteriorating conditions in the coastal strip as a “living hell”. Amid escalating shortages of food, spreading waves of communicable disease and the near collapse of Gaza’s health system, the winter storm turned large areas to mud. US politics | The House voted Wednesday to formally authorise the impeachment inquiry into Joe Biden, even as Republicans have failed to produce evidence showing that the president financially benefited from his family’s business dealings. Economy | Financial markets are betting the Bank of England will be forced to launch a deep round of interest rate cuts in 2024 amid the growing risk of a recession. UK news | A 16-year-old boy accused of killing Brianna Ghey has described freezing as, he claimed, he saw his female co-defendant stab the teenager with his knife in a Warrington park. Education | Under new proposals by the government’s campus free speech tsar, university staff and students can make provocative statements on subjects such as Israel and Gaza as long as they do not break laws on incitement or harassment. Universities and colleges in England that infringed the rights to expression of individuals could face fines under the new complaints process.\nIn depth: ‘Biden and his administration are getting more and more uneasy’\nView image in fullscreen US ambassador alternate representative of the US for special political affairs in the United Nations, Robert A Wood, raises his hand during a UN security council meeting on Gaza, at UN headquarters in New York City on 8 December 2023. Photograph: Charly Triballeau/AFP/Getty Images\nThe UN vote has reinforced the idea that “the US and Israel are fairly isolated” in the face of increasing global calls for a ceasefire, Julian says. As Israel continues its bombardment of Gaza, the human cost of the conflict has become intolerable for most countries, who are demanding the two sides find a route to peace.\n“It’s worth pointing out that the US made a big deal about how isolated Russia was in the general assembly when it came to the Ukraine war – by the same measures it’s an issue in which they are now in a relatively small minority,” Julian says.\nBut US support for Israel is seemingly not unconditional. Though the US has stood alongside Israel in this vote, Biden has also issued his bluntest public critique of Israel’s military strategy, saying that international support is waning because of the “indiscriminate bombing” of Gaza, adding that Netanyahu should change his government, which is dominated by hard figures. The White House has tried to downplay the president’s comments during a press conference to dispel any further speculation about Netanyahu and Biden’s relationship.\nA rift between Netanyahu and Biden\nBiden’s approach to the conflict has been to keep Netanyahu close, in a bid to exert more influence over the way Israel prosecutes the war. The Biden administration believes it has achieved some wins with this policy: “They believe that they helped fend off a pre-emptive strike on Lebanon against Hezbollah, which there was support for in the immediate aftermath [of the attack],” Julian says. However when it comes to minimising civilian casualties and long-term plans for the military campaign, the Biden administration has held little sway over the Israeli government. Civilian deaths remain high and Netanyahu has made clear that he will not allow any kind of Palestinian control over Gaza in future. “Biden and his administration are getting more and more uneasy about their lack of influence,” Julian says.\nConflicting ideas\nView image in fullscreen Joe Biden meets Benjamin Netanyahu in Tel Aviv, 18 October 2023. Photograph: Reuters\nNews that the US has given Israel a deadline of the end of December to finish the conflict has been widely reported in the Israeli press (though a White House aide has denied the existence of any firm deadline). The Israel Defense Forces have said that they are prepared to keep the conflict going until the end of January, Julian says.\nIt is unclear what happens when these deadlines are reached: the IDF has proposed maintaining a significant military presence in the north of the strip, as well as creating a buffer zone inside Gaza – a policy that the US has publicly opposed. “Instead, Washington wants to use this conflict as leverage to get back on to a trajectory towards a two-state solution, which is something that Netanyahu and his cabinet are really against. So they are very much at loggerheads,” Julian says.\nInternal pressure\nBiden has his own problems to think about. His support for Israel’s war in Gaza has caused a significant backlash from certain factions of his own party. With the president facing re-election next year, he is likely evaluating the political cost of maintaining his stance because “support for him on the left of his party has really suffered, particularly among progressives, young people and minorities”, Julian explains.\nMilitary impact\nWhile the relationship between the two countries has become frostier in recent weeks, US officials made it clear that there are no current plans to slow the supply of munitions to Israel.\nUS support for Israel is not guaranteed indefinitely, however: “The last round of munitions was sent through an emergency measure that sidestepped Congress in quite an unusual move. As relations sour between Biden and Netanyahu, I can’t imagine they would do that again,” Julian says. “They can, very easily, put their thumb on the flow of ammunition, which the Israel Defense Forces really depend on, if they want to.”\nThis week Biden warned Israel that “they’re starting to lose” international support. Though fraught conversations are certainly happening in the background, Biden, for the moment, has promised to support Israel’s right to defend itself. He said: “We’re not going to do a damn thing other than protect Israel in the process. Not a single thing.”\nWhat else we’ve been reading\nView image in fullscreen ‘The screen police officer that other actors measure themselves against’ … Andre Braugher in Brooklyn Nine-Nine. Photograph: Album/Alamy\nAndre Braugher (pictured above), who held the antics of Brooklyn Nine-Nine together with his gravitas and charisma, is mourned by many. For decades to come, says Stuart Heritage, “he will be the screen police officer that other actors measure themselves against”. Clare Longrigg, acting head of Newsletters\nIf you know an art lover or want to support the culture sector, then a subscription or a membership to a gallery or museum could be the perfect gift this Christmas. Rupert Jones has helpfully pulled together a comprehensive list of the best deals for a gift that lasts for a whole year. Nimo\nIf your tendency to please others means you are hopeless at setting boundaries, you may need some lessons in saying “no” . Zoe Williams (very much a yes person) talks to the experts on the dangers of resentment and the value of a white lie. Clare\nNels Abbey adeptly explores the controversy surrounding a new Sky comedy drama about historic slavery : “We are interested in how a terrible past affects the present and how everyone affected comes to terms with that, but are we ready to chuckle at the reckoning”, Abbey writes. “The very idea that humour survives even the bleakest events is heading for a stress test.” Nimo\nThe New York Times (£) goes inside the world of the courtroom artists, where Isabelle Brourman brings a satirical flourish to usually-solemn occasions – in this case, the Trump fraud trial. Clare\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nSport\nView image in fullscreen Usman Khawaja displaying human rights messages on his shoes during Australia v Pakistan. Photograph: Paul Kane/Getty Images\nFootball | It was good while it lasted but Newcastle’s European odyssey is over. On a night of wildly oscillating emotions on Tyneside Samuel Chukwueze stepped off the Milan substitutes bench and promptly scored with his first touch to send the Serie A side into the Europa League. Meanwhile, Micah Hamilton sparks Manchester City win at Red Star Belgrade. It was Newcastle 1-2 Milan.\nCricket | Usman Khawaja has pledged to fight a decision by the ICC to bar him from displaying human rights messages on his shoes while representing Australia this summer in support of people in Gaza.\nRugby | Japan has named Eddie Jones as its new head coach, ending weeks of speculation over the Australian’s re-appointment to the job he held from 2012-15. Jones resigned as Australia’s head coach at the end of October after the Wallabies’ worst Rugby World Cup campaign, where the country exited at the pool stage for the first time.\nThe front pages\nView image in fullscreen Photograph: Guardian\nThe Guardian’s headline is “Landmark Cop28 deal agreed to ‘transition away’ from fossil fuels”. The Financial Times is also covering the deal with the headline “‘Historic’ Cop28 deal cites shifting away from fossil fuels for first time”. In the Times its “Facebook is now danger to children, parents told” as the paper reports on what it says is a National Crime Agency warning. On the i’s front page it’s talk of tax with “Tax cuts will keep interest rates high, PM warned”. The paper says the PM has hinted at tax cuts next year.\nThe Telegraph’s headline is “Britain to build next generation fighter jets” reporting on what they describe as a UK-based project. The Mail has “The trans bullies won’t silence me” as the paper reports on what it says is an exclusive with Rachel Maclean, the Conservative party’s deputy chair for women. The Mirror covers the parole decision on Jon Venables with “Justice for my James”, as the paper reports on reaction from the mother of James Bulger.\nAnd the Sun has “Leo in secret date with Lottie Moss”, saying actor Leonardo DiCaprio and the model “partied till the early hours”.\nToday in Focus\nView image in fullscreen Palestinians inspect the damage at the site of Israeli strikes on houses Photograph: Ibraheem Abu Mustafa/Reuters\nIs Israel deliberately trying to make Gaza uninhabitable?\nWith 40% of homes destroyed in the strip, legal experts are raising the question of ‘domicide’ – but what it is it, and is it taking place in Gaza? Hannah Moore hears why legal experts are calling for this to be a crime against humanity.\nCartoon of the day | Ben Jennings\nView image in fullscreen Illustration: Ben Jennings/The Guardian\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nView image in fullscreen The new National Theatre artistic director, Indhu Rubasingham. Photograph: Antonio Olmos/The Observer\nThere was no other candidate who could come close to leading the National Theatre than its next artistic director, Indhu Rubasingham, writes the Guardian’s chief theatre critic, Arifa Akbar. “Rubasingham is too talented and experienced to sacrifice quality for any of the risks she takes – and I do hope she takes a few,” Arifa writes. “She knows how to combine brilliant new writing with crowd-pleasers, and how to stage canonical works with verve.”\nAn inspiring leader at London’s Kiln theatre, Rubasingham is the first woman and first woman of colour in the job. “She is not the first woman who was qualified for the job,” writes Arifa, “yet here she is, making theatre history with a long overdue gender correction.” Rubasingham, who has an MBE for her services to theatre, starts what she has called “the best job in the world“ in spring 2025.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.", "source_domain": "www.theguardian.com", "text": null, "title": "Thursday briefing: Can US support for Israel’s war against Hamas survive ‘indiscriminate bombing’?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/14/thursday-briefing-can-us-support-for-israels-war-against-hamas-survive-indiscriminate-bombing"}