{"authors": [], "date_download": "2024-02-05 15:26:47", "date_modify": "None", "date_publish": "2023-12-14 15:28:27", "description": "Hundreds of protesters angered by what they view as wasteful municipal spending by Kyiv officials have gathered outside the Ukrainian capital's city hall", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmoney-ap-ukraine-kyiv-russia-b2464134.html.json", "image_url": "https://static.independent.co.uk/2023/12/14/15/Russia_Ukraine_War_85882.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nHundreds of protesters angered by what they view as wasteful spending by municipal officials gathered outside Kyiv City Hall on Thursday and demanded that the money should go to Ukraine’s war against Russia instead of local projects.\nThe Money for the AFU (Armed Forces of Ukraine) civic group, which organized the protest, was formed in September by people concerned by what they term “unnecessary” and “poorly timed” spending by the Kyiv City Council.\nThe protesters, who appeared to be mostly in their 20s and 30s, gathered despite multiple air alerts and cold, damp weather. They dispersed in the afternoon when air defense systems burst into action to fend off a missile attack.\nProtestors chanted, “It’s better to buy drones than build a new park” and, “The more money we spend on the army, the faster Ukraine will win this war.”\n“At a time when our friends, parents and acquaintances are dying at the front, we have more pressing matters than rebuilding roads and beautifying parks,” Kateryna Zaderey, one of the protesters, told The Associated Press.\nStreet protests in Ukraine were rare after Russia’s full-scale invasion in February 2022, which brought regular bombardment of the capital. Recently, though, demonstrations have gathered momentum, and Thursday’s protest was the largest so far over municipal spending.\nMunicipal graft was regarded as a deep problem in Kyiv before the war. Corruption allegations have dogged Ukraine as it has received billions of dollars of Western support for its war effort. The issue has also been a hurdle for Ukraine’s ambition to join the European Union, which was holding a summit to discuss providing Ukraine with 50 billion euros ($54 billion) in budget assistance and the country's prospects of EU membership.\nIn June, there was a wave of public outrage after three people died in a missile attack on Kyiv. They had been unable to enter a hospital bomb shelter that turned out to be locked.\nThe incident drew public attention to the state of the city’s bomb shelters and sparked criticism of Kyiv Mayor Vitali Klitschko.\nA subsequent investigation by Kyiv prosecutors found multiple violations in how 1.2 billion hryvnias ($32.5 million) from the city budget for the repair and maintenance of bomb shelters in 2022-2023 was actually spent.\nAmong the surprising ways money was spent on making bomb shelters comfortable were the purchases of 306 leather drums for “psychological relief of children during air raids,” which cost the city almost a million UAH ($27,000), a professional electric fryer stand for 720,000 UAH ($19,500), and 12 vegetable-cutters totaling 1.6 million UAH ($43,300).\nRecent protests have focused on city maintenance and infrastructure projects worth millions of dollars that demonstrators said should have been spent on the Ukrainian military.\nDuring Thursday’s protest, Klitschko told a city council meeting that Kyiv will spend an additional 600 million UAH ($16.2 million) on the needs of the military in addition to the 7 billion UAH ($190 million) that was already spent on the military's needs in 2023.\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Kyiv protesters demand more spending on the Ukraine's war effort and less on local projects", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/money-ap-ukraine-kyiv-russia-b2464134.html"}