{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:26:55", "date_modify": "None", "date_publish": "2023-12-14 12:08:54", "description": "Relatives of the abductees say they are shocked, as reports say David Barnea was stopped from visiting Qatar", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F14%2Fisraeli-ministers-block-mossad-heads-effort-to-restart-gaza-hostage-talks.json", "image_url": "https://i.guim.co.uk/img/media/d841735626b60b08d710090b41c9af266ad05a12/645_1127_4202_2522/master/4202.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bf224f0f9fab74fcdcfca0de314add8f", "language": "en", "localpath": null, "maintext": "Israel’s war cabinet has blocked a planned visit to Qatar by the head of the country’s foreign intelligence service that was aimed at kickstarting negotiations over a new hostage release deal.\nAccording to several reports, David Barnea, the head of Mossad, had wanted to travel to Qatar but was blocked by the Israeli prime minister, Benjamin Netanyahu, and other cabinet ministers.\nThe decision prompted demands from the families of hostages for an explanation, saying that they were “shocked” by it.\nIn a statement they called for an “immediate end to the deadlock in negotiations”, adding they were “at their wits’ end with the indifference and stagnation”. They described the situation as a daily “Russian roulette in which families are informed about the murder of a hostage in captivity”.\nWhile Hamas is still believed to be holding about 138 hostages in Gaza, Israel disclosed earlier this week that 19 of them had been killed. Some were said to have been killed on 7 October and their bodies taken to Gaza, while some had been killed in the coastal strip during their captivity.\nIn one high-profile incident, a 25-year-old hostage, Sahar Baruch, who was kidnapped from the Be’eri kibbutz on 7 October during Hamas’s shock attack across the Gaza border, was killed during a failed hostage rescue mission by the Israel Defense Forces.\nOn Thursday it was disclosed that Joshua Loitu Mollel, a 21-year-old agriculture student from Tanzania, who was kidnapped from the Nahal Oz kibbutz, had been killed in captivity.\nAbout 240 hostages, civilian and military, were seized by Hamas on 7 October. While more than 100 hostages were freed during a week-long truce that ended on 1 December, fears have been growing for those still held as Israel has escalated its ground and air offensive in Gaza, amid intense urban combat in a number of key locations.\nOn Wednesday, families of US hostages in Gaza met the US president, Joe Biden, at the White House. After the two-hour meeting, family members said they believed Biden was making strenuous efforts to secure the release of family members.\nJonathan Dekel-Chen, the father of Sagui Dekel-Chen, 35, who was kidnapped from the Nir Oz kibbutz, said: “We felt before, and we were only reinforced in seeing and believing, that we could have no better friend in Washington or in the White House than President Biden himself and his administration.”\nRelations between hostage families and Netanyahu have, however, been more fraught, with an angry meeting between them and the Israeli war cabinet earlier this month during which the daughter of the hostage Chaim Peri, 79, told the Israeli prime minister that those still being held were “living on borrowed time”.\nWhile informal lines of communication between Hamas and Israel, via the mediators Qatar and Egypt, appear to have been kept open since the ceasefire broke down on 1 December there appears to have been little substantive movement, despite reported claims that Israel had approached Egypt with a view to reopening talks.\nAccording to a report in the Qatari-owned outlet Al-Araby Al-Jadeed, Basem Naim, a member of Hamas’s political bureau reiterated his group’s position that there could be no negotiations as long as fighting was continuing.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli ministers block Mossad head’s effort to restart Gaza hostage talks", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/14/israeli-ministers-block-mossad-heads-effort-to-restart-gaza-hostage-talks"}