{"authors": ["Temujin Doran", "Kyri Evangelou", "Bethan Mckernan"], "date_download": "2024-02-05 15:26:57", "date_modify": "None", "date_publish": "2023-12-14 10:37:40", "description": "Masafer Yatta, the most rural and desolate area in the West Bank, is home to about 1,000 Palestinians. But after weeks of intense settler violence in the aftermath of the Hamas attack on Israel on 7 October, and despite the decades-long fight to remain in their homes, these communities are now being forced off their land. Some have described it as “a new Nakba.”The Guardian’s Bethan McKernan travelled to Masafer Yatta and heard from Palestinian families how armed settlers have begun breaking into their homes at night, beating up adults, destroying and stealing belongings, and terrifying children. These West Bank settlements are illegal under international law.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Fvideo%2F2023%2Fdec%2F14%2Fhow-israeli-settler-violence-is-forcing-palestinians-to-flee-their-homes-video.json", "image_url": "https://i.guim.co.uk/img/media/1b82ea9a6e3587437282158c941664aec9da8871/120_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1beca894791c93919b41dd06b5b3c60a", "language": "en", "localpath": null, "maintext": "Masafer Yatta, the most rural and desolate area in the West Bank, is home to about 1,000 Palestinians. The community are mostly herders who raise goats and sheep, and have steadfastly refused to leave their homes despite the mounting difficulties posed by the Israel Defense Forces (IDF) soldiers on the one hand and radical Israeli settlers on the other.\nBut after weeks of intense settler violence in the aftermath of the Hamas attack on Israel on 7 October – and despite the decades-long fight to remain in their homes – these communities are now being forced off their land. Some have described it as “a new Nakba.”\nThe Guardian’s Bethan McKernan travelled to Masafer Yatta and heard from Palestinian families how armed settlers – some in reservist uniforms, others covering their faces – have begun breaking into their homes at night, beating up adults, destroying and stealing belongings, and terrifying children. These West Bank settlements are illegal under international law.\nClick here for the latest on the Israel-Gaza war", "source_domain": "www.theguardian.com", "text": null, "title": "How Israeli settler violence is forcing Palestinians to flee their homes - video", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/video/2023/dec/14/how-israeli-settler-violence-is-forcing-palestinians-to-flee-their-homes-video"}