{"authors": ["David Averre", "Chris Jewers"], "date_download": "2024-02-05 15:27:00", "date_modify": "None", "date_publish": "2023-12-14 07:44:55", "description": "The despot is answering questions from journalists and viewers during the hours-long marathon, a week after he announced he is running in next year's presidential election.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12862839%2FPutin-holds-annual-press-conference.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/14/07/78950061-0-image-m-17_1702539890573.jpg", "language": "en", "localpath": null, "maintext": "Vladimir Putin labelled the Israel-Hamas conflict a 'catastrophe' and said his main priority is to safeguard 'the very existence of Russia' while 'denazifying' Ukraine as he addressed the nation in a marathon end-of-year press conference.\nThe despot is answering questions from journalists and viewers during the hours-long 'End of the Year with Vladimir Putin' conference in Moscow's Gostiny Dvor forum hall.\nThe conference comes a week after he announced he is running in March's presidential election, which will keep him in the Kremlin until at least 2030.\nOpening the conference with an impassioned speech, the Russian president said: 'The very existence of our country without sovereignty is impossible. It simply will not exist, at least not in the state it is now...\n'That means strengthening our borders, our political system, social sovereignty, economic and technological sphere.'\nSpeaking on the 'special military operation' across the border, Putin said: 'It will come to an end sooner or later. They are receiving aid but our annihilation of their tanks and planes continues.\n'There will be peace when we achieve our goals. Let's return to these goals: they have not changed. I'll remind you of what we talked about then: the denazification of Ukraine, its demilitarisation, its neutral status.'\nTurning his attention to the Israel-Hamas conflict, Putin said no comparisons could be made with the situation in Ukraine and said he was committed to providing humanitarian aid to Gazans.\n'Everything that is happening (in Gaza) is catastrophic. But that is not what is going on in Ukraine. The UN today said the Gaza Strip is the largest child's cemetery in the world. This is objective.\n'First of all we need to provide massive humanitarian support. They've asked us to provide more medical equipment and we will do that without a doubt,' he said, before adding Russia had set up a field hospital near Rafah and was planning a second, in spite of Israeli disapproval.\nRussian President Vladimir Putin gestures as he answers questions during his annual press conference with Russian federal, regional, and foreign media at the Gostiny Dvor forum hall in Moscow, Russia, 14 December 2023\nThe despot is answering questions from journalists and viewers during the hours-long marathon, a week after he announced he is running in May's presidential election\nTop quotes from 'End of Year with Vladimir Putin' ON THE CONFLICT IN UKRAINE 'There will be peace when we achieve our goals. Let's return to these goals: they have not changed. I'll remind you of what we talked about then: the denazification of Ukraine, its demilitarization, its neutral status. 'As for demilitarization, if they don't want to come to an agreement, then we are forced to take other measures, including military ones. Or we will agree on certain terms. By the way we agreed on these in talks in Istanbul. But then these agreements were scrapped. But we agreed on this. There are other possibilities - either reach an agreement or resolve it by force. This is what we will strive for.' ON POSSIBILITY OF SECOND MILITARY DRAFT 'We had a partial mobilization, we called up 300,000 people... The guys are fighting well, really well. Fourteen heroes of Russia. I think 244,000 are in the special military operation zone... After that, we started a campaign to attract people on a voluntary basis to sign contracts with the armed forces. As of yesterday evening, I was informed we now had come up with 486,000. 'The flow of men ready to defend our homeland with arms in hand is not decreasing. Together with volunteers, there should be around half a million people. There is no need for mobilisation as of today.' ON THE ECONOMY 'The most important indicator is economic growth. GDP growth by the end of the year is expected at 3.5% - this is a good indicator. 'Unfortunately, inflation has increased. By the end of the year it is expected at 7.5%, maybe a little more at 8%, but the central bank and government are taking necessary measures.' ON RELATIONS WITH THE WEST 'The unbridled desire to creep towards our borders, taking Ukraine into NATO, all this led to this tragedy. Plus the bloody events in Donbass for eight years - all this led to the tragedy that we are now experiencing. They forced us into these actions... What the United States conceived and organized, Europe stands and silently watches, or plays and sings along with them there. Well how can we build relations with them?' 'When internal changes happen (in the United States), when they start respecting other people, other countries, when they start looking for compromise instead of trying to resolve their issues with sanctions and military intervention, then the fundamental conditions will be in place to restore fully-fledged relations. So far, such conditions are not in place, but we are ready for that.' ON RUSSIAN AID TO GAZA 'When I visited the United Arab Emirates I found out they have set up a field hospital there in Gaza, near the Rafah checkpoint... and we talked about the possibility of Russia setting up a hospital in the same location, at a stadium, but that would of course require approval from both Egypt and Israel. I have spoken to the Egyptian president, he support this idea. I have spoken to Prime Minister Netanyahu, they have discussed this between various agencies, and the Israeli side does not support this, they believe setting up a Russian hospital in Gaza would be unsafe, but this does not mean we will cease those efforts.' ON RELATIONS WITH CHINA 'We know and I will simply repeat this, I must repeat this, the level of our ties with China is at an all-time high.' Advertisement\nAddressing a question on mobilisation of more troops to fight in Ukraine, Putin said: 'I know it's a sensitive matter. We had some mobilisation, we called up around 300,000. They were called recruits - but they've been doing an excellent job...\n'We started a broad campaign to encourage volunteers to sign contracts with the armed forces. It's going to be around 500,000 people by the end of the year.\n'We have 1,500 men signing up every day - why do we need another round of mobilisation?' Putin asked rhetorically.\nMoving onto a question about the West's support of Ukraine, Putin became visibly irritated.\n'Speaking of normalising relations... they (the West) have always been pushing us back.\n'We've been trying our best to build normal relations with Ukraine... we've always been saying Russians and Ukrainians are one people and what we're seeing now is a tragedy, a war between brothers. The entire south-east of Ukraine has always been pro-Russia,' Putin declared.\n'(The West) would not allow us to build normal relations with Ukraine,' he continued.\n'We will not forget it, their aspiration to creep up to our borders and take Ukraine into NATO. They forced our hand.'\n'You see some people, like [Hungarian PM] Orban - he is protecting his national interest. There are not people like that anymore. [Europe] is simply listening to America.\n'We believe America is an important country for the world. But their imperial policies are hurting them.'\nThe Russian president then scoffed at Ukraine's meagre attempts to push Moscow's forces back, telling a military journalist: 'The enemy forces have declared their counter-offensive but they have failed everywhere.\nPutin was later addressed by a military journalist and veteran who claimed to have fought with a private military company (PMC).\nBoth of whom complained combat veterans were not receiving their payments and benefits, with some injured fighters being sent back to the frontlines.\nPutin refused to accept negative commentary, retorting: 'I think things are improving, tell me I'm right!\n'Regarding wounded servicemen being sent back to their stations. Perhaps the situation has changed, you may have obsolete data,' he said, arguing the defence ministry had ensured that wounded servicemen were being operated on and rehabilitated in hospitals not on the frontline.\nTurning to the combat veteran, Putin reminded him that Russian law technically does not allow private military companies - only to repeatedly refer to them moments later.\n'First of all, we do not have private military companies, as is written in our law. But any contracts signed with these so-called 'private' groups, it's hard to track down.\n'Without a doubt, their rights must be reinstated. They are eligible to receive all their social benefits and allowances and all other forms of support granted to those involved in the operation,' he said.\nSpeaking on Russian-Chinese ties, Putin lauded the cooperation between him and his Chinese counterpart Xi Jinping, and declared the two countries were making friends for mutual benefit, not making friends against 'third countries'.\nHe told a representative of China's Xinhua news agency that relations were at an unprecedented high, bilateral trade was increasing significantly and that the two countries were 'actively implementing' their plans together, before railing against Western nations which Putin said should have no involvement in affairs in Asia.\nThen, Putin accepted a question from a journalist from the New York Times, telling the reporter that 'he is democratic' and that everyone can speak.\nThe journalist asked why Wall Street Journal reporter Evan Gershkovich had been kept in detention in Russia's Lefortovo prison, and whether Russia and the US could agree upon his release along with other US citizens back to Washington.\nPutin replied: 'With respect to returning them home, why have they committed offences on Russian soil?' referencing charges of espionage widely seen as trumped up.\n'It's not that we are declining to send them home - we need to come to mutually acceptable terms. We have contact with our American partners and dialogue is proceeding but it is not simple. I will not delve into details but I think - I hope - we are speaking the same language. I hope we'll find a mutually acceptable solution, but the Americans must make an acceptable offer to us.'\nVladimir Putin is holding his first marathon end-of-year press conference since ordering the invasion of Ukraine\nRussian President Vladimir Putin attends his annual end-of-year press conference\nRussian President Vladimir Putin (C) answers questions during his annual press conference with Russian federal, regional, and foreign media at the Gostiny Dvor forum hall in Moscow, Russia, 14 December 2023\nPutin's conference covers a wide range of topics from conflict in Ukraine and Gaza to the economy, Russian-Chinese relations, the freeze in Russia-Western ties and domestic issues\nRussian President Vladimir Putin gestures as he answers questions during his annual press conference\nThe conference with Putin today contains elements of the Direct Line show - a carefully choreographed call-in televised show that Putin has held annually since 2001.\nBut the event was cancelled last year amid a struggling operation in Ukraine that saw Kyiv take back swathes of its territory from Russia in the east and south.\nUkraine's strong resistance and support from its allies surprised observers around the world and in Moscow, where many had expected to conquer Kyiv in a few days.\nBut almost two years into his offensive, Putin may be sensing that his fortunes are reviving, and that the balance may be tilting in Russia's favour.\nUkraine's latest counteroffensive failed to pierce heavily entrenched Russian lines, and support from its allies is fraying. Neither side has managed to make significant battlefield gains recently, a situation that suits Putin for now.\nMeanwhile, Russia has been able to sure-up support from its own allies.\nWhile Ukraine's European and North American allies have strongly condemned Russia and imposed sanctions, others - such as China - have backed Moscow.\nOther powerful nations, such as India, have avoided criticising Russia over its actions in Ukraine.\nDuring a visit to Washington this week, Ukrainian President Volodymyr Zelensky failed to overcome Republican opposition in Congress to approving a new $60 billion aid package.\nAnd the Russian economy has withstood Western sanctions that aimed to isolate Russia - though the economy's long-term resilience remains uncertain.\nMoscow is still able to sustain its war effort through oil sales, which Putin discussed during a trip this month to the UAE and Saudi Arabia where he was received with full honours.\nIn any case, Putin's election campaign, which he launched last week, is unlikely to be forced to address the real economic and human costs of the offensive.\nPutin has heavily limited his interaction with the foreign media since the fighting began in Ukraine but international journalists were invited this year.\nDuring Thursday's event, he is expected to address domestic issues and international politics, and to repeat his customary rhetoric distorting Ukraine's past.\nRussian callers have already sent over 1.5 million requests, and Russian state-run news agencies reported that most call-in questions relate to the conflict in Ukraine, housing and public services.\nPutin will also lay out his ambitions for the March 17 election that will allow him to extend his decades-long grip on power into the 2030s.\nThere is little doubt surrounding the result, as most of the opposition is in exile or behind bars. Putin's most high-profile rival, Alexei Navalny, is currently serving a 19-year prison sentence on political charges.\nAnd the Kremlin has intensified its crackdown on dissent since the assault on Ukraine. Thousands of people have been detained and imprisoned for protests, and many thousands more have fled the country in fear of being called up to fight.\nVladimir Putin will today hold his first marathon end-of-year press conference since ordering the invasion of Ukraine , with the cocky Russian president (seen speaking on Tuesday) feeling the tide turning in his favour nearly two years into the gruelling conflict\nTwo years into his offensive, Putin may be sensing that his fortunes are reviving in Ukraine, and that the balance may be tilting in Russia's favour. Pictured: Ukrainian soldiers drive a tank in a position near to the town of Bakhmut, Donetsk region, on December 13, 2023\nRussia has still been wounded by the conflict, however, with Moscow's armies suffering heavy losses and the economy creaking under the pressure of sanctions.\nAccording to US intelligence, Putin has lost nearly 90 per cent of his pre-invasion army, with 315,000 personnel either killed or injured since war began.\nA declassified US intelligence report assessed that Moscow's losses in personnel and armoured vehicles to Ukraine's military have set back Russia's military modernisation by 18 years, a source familiar with the intelligence said on Tuesday.\nRussia has also lost almost two-thirds of its tank force, or 2,200 out of its 3,500 pre-invasion stock, the congressional source said.\nWhile it is widely known that Putin's forces have been subject to huge losses in Ukraine, the assessment sheds new light on the extent of those setbacks.\nMany is Russia assumed its much larger army would sweep to victory in Ukraine in days, overthrow the government in Kyiv and install a pupped administration.\nInstead, after reaching the edged of Kyiv in the first month of the war, Russian forces were pushed back east and suffered setback after setback.\nNow, they find themselves in a gruelling war being fought across a front line that stretches hundreds of miles against a determined Ukraine that has exposed weaknesses in the Russian army once believed to be one of the world's strongest.\nAnalysts say the situation currently suits Russia, however, with Moscow's armies controlling around 20 percent of Ukrainian territory.\nRussia is expected to be able to replenish its forces with new conscripts, and manufacture weapons faster than the West can provide them to Ukraine.\nBut Putin's press conference also comes after it was revealed his country's economy has taken a hit since the beginning of the conflict.\nThe war has raised domestic prices, and is forcing Moscow to devote a third of its budget on defence, British newspaper the Financial Times reported on Thursday, citing a draft text from the US Treasury department.\nRussia's economy would have expanded by over 5 percent if Putin had not launched the war in Ukraine, the newspaper reported quoting Rachel Lyngaas, the chief sanctions economist at the department.\nLyngaas added that the country was underperforming other energy exporters, including the United States.\nPeople carrying bags walk past a damaged apartment building in the Ukrainian capital of Kyiv after a Russian missile strike on December 13\nThe US Department of the Treasury did not respond to a request for a comment from Reuters news agency.\nMoscow was spending more than $100 billion, or almost a third of its total expenditures on defense in 2023, according to the FT report.\nThe backbone of Russia's economy - oil and gas revenue - took a hit this year, although there had been a slight recovery in recent months as oil prices firmed.\nAdditionally, Western sanctions on Russia's oil trade have not had as great an impact as initially predicted.\nAs Putin is speaking on Thursday, EU leaders will be working to agree a massive aid package and begin membership talks for Ukraine.\nHowever, Hungarian Prime Minister Viktor Orban has threatened to veto the move.\nKyiv is desperately seeking to improve the narrative after Zelensky failed in Washington to win over Republican lawmakers.\nBut Orban - Russia's closest ally in the European Union - stands in the way of Ukraine's hopes for 50 billion euros in financial aid and progress towards its goal of one day joining the bloc.\nCritics have accused Orban of holding Kyiv's survival hostage in a bid to force Brussels to release billions of euros of EU funds frozen over a rule of law dispute.\nIn what some saw as a last-minute concession the European Commission, the EU's executive, agreed on Wednesday to unblock 10 billion euros of that cash.\nBut 21 billion euros still remain out of Orban's grasp and it was far from clear that the gesture would avert a damaging dispute at the summit.\nMembers of the pro-Ukrainian Russian ethnic Siberian Battalion practice at a military training close to Kyiv, Ukraine, Wednesday, December 13\nThe right-wing veteran warned opening accession talks with Ukraine would be a 'terrible mistake' and that he would not budge.\nZelensky countered that Orban had 'no reason' to block Kyiv from moving towards EU membership and said his country could not beat Russia without more support.\nIt comes after Russia fired a fresh wave of missiles at Kyiv on Wednesday, wounding dozens of people in its most damaging attack on the capital in months.\nAnother strike early on Thursday wounded another 11 in the southern Odesa region, emergency services said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Putin says Israel's campaign against Hamas is a 'catastrophe' while vowing his goals to 'denazify and demilitarize' Ukraine have not changed during annual press conference", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12862839/Putin-holds-annual-press-conference.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}