{"authors": [], "date_download": "2024-02-05 15:27:01", "date_modify": "None", "date_publish": "2023-12-14 19:32:10", "description": "Israeli military says soldiers have been removed from duties after incident in West Bank city", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F14%2Fidf-censures-its-soldiers-filmed-mocking-call-to-prayer-in-jenin-mosque.json", "image_url": "https://i.guim.co.uk/img/media/e1d18d588fd32e5c679dd4e612992ad2ffab52a0/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=703b3020b6e8ccccb5fcfb2e080d8e3f", "language": "en", "localpath": null, "maintext": "The Israel Defense Forces (IDF) have condemned the behaviour of several of their soldiers who were filmed singing and mocking the Islamic call to prayer over the loudspeaker of a mosque in the city of Jenin.\nThe incident came during three days of raids in the occupied West Bank, during which Israeli troops have killed 12 Palestinians, including one youth shot dead at a hospital, according to Palestinian officials and international health charities.\nFootage posted to social media shows the IDF soldiers inside the mosque as one of them recites a Jewish prayer in the style of the Islamic call to prayer from the pulpit.\nIn another clip, a song associated with the Jewish festival of Hanukkah is heard sung in Hebrew through a loudspeaker in the minaret.\nThe call of Shama Israel from the town of Jenine pic.twitter.com/dsUGcBdzvL — The Jewish Voice (@JewishVoice) December 14, 2023\nAnother clip shows one of the soldiers sitting on the floor of the deserted mosque and speaking into a microphone used to deliver the Islamic call to prayer. “In the name of God, the merciful. Here is the spokesperson of the IDF,” he says.\nThe Palestinian foreign ministry condemned what it said was a mockery of the religious sanctum.\nWhen asked about the events, the Israeli army told reporters that the soldiers had immediately been removed from operational activity.\n“The behaviour of the soldiers in the videos is serious and stands in complete opposition to the values of the IDF. The soldiers will be disciplined accordingly,” the military said.\nThe military says it has been stepping up operations against Palestinian militant groups in the West Bank. At least 275 Palestinians have been killed there over the past two months since the 7 October Hamas attack from Gaza into southern Israel that killed 1,200 people, according to Israeli tallies.\nSoldiers shot dead an unarmed 17-year-old inside the Khalil Suleiman hospital compound just outside Jenin’s built-up refugee camp, according to the medical charity Doctors Without Borders (MSF).\nThe Israeli military did not respond to a request for comment about the shooting.\nMahmoud Al-Saadi, the director of the Palestinian Red Crescent in the northern West Bank city, said Israel was not allowing ambulances to enter the camp to transport seriously ill patients.\n“The army did not allow us to enter,” he said, adding that soldiers were stationed outside the hospital.\nWitnesses in Jenin described gunmen exchanging fire with the soldiers and detonating homemade explosive devices. Army bulldozers damaged streets and water pipes, residents said.\nA military statement said soldiers dismantled bomb laboratories, underground tunnel shafts and explosive devices during searches in a counter-terrorism operation that began on Tuesday.", "source_domain": "www.theguardian.com", "text": null, "title": "IDF censures its soldiers filmed mocking call to prayer in Jenin mosque", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/14/idf-censures-its-soldiers-filmed-mocking-call-to-prayer-in-jenin-mosque"}