{"authors": ["Jason Burke", "Quique Kierszenbaum"], "date_download": "2024-02-05 15:15:26", "date_modify": "None", "date_publish": "2024-01-27 10:00:35", "description": "War has led to a crisis in relations in Lod – the town that both Arab and Jewish residents call home", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F27%2Fit-can-explode-at-any-second-fear-at-the-israeli-market-town-split-between-two-communities.json", "image_url": "https://i.guim.co.uk/img/media/4104904f162124ead4d644e43c5f6e22af7e20d4/0_1_5440_3263/master/5440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=03d323fffe9d123c34f8d1003e19bab9", "language": "en", "localpath": null, "maintext": "From a distance the market looks like a scene of communal harmony. Jewish and Arab Israelis inspect the piles of pomegranates, oranges, pears and carrots. Israeli flags flap in the winter breeze from the balconies of shabby apartment blocks. A hundred metres away, a synagogue, mosque and Greek Orthodox church share a car park.\nThe reality is very different. The tension in Lod, a town of 80,000 in the centre of Israel, is palpable. Other than at prayer time, the mosque bolts its metal gates shut. So too do the synagogue and the church. Everybody in the town, which is home to both Jewish and Arab Israelis, is very aware of what might happen if the growing anger, fear and grief among both communities prompted by events of the last four months get out of hand.\n“It can explode at any second,” said Mohammed Abu Ashraf, a 71-year-old resident, as he walked between the fruit stalls.\nOn 7 October Hamas, the militant Islamist group, launched an attack into Israel from Gaza that killed 1,200 people, mostly civilians. The Israeli offensive that followed has killed more than 26,000, mostly women and children, according to Palestinian health authorities.\nThe war has led to a crisis in relations between Israel’s minority Arab population, who often identify as Palestinian citizens of Israel, and the Jewish majority. Lod has been considered a flashpoint since May 2021 as the site of some of the worst violence between the communities for decades. Two died – an Arab and a Jewish resident – amid riots and protests involving local Arab youths and Jewish extremists from outside the town, as well as some from within.\nView image in fullscreen A banner inscribed ‘The municipality of Lod salutes the security forces’, ‘Together we will win’, and ‘The people of Israel live’ hangs at the Lod municipality building. Photograph: Quique Kierszenbaum/the Observer\nSince the 7 October attacks, a series of prominent Arab Israelis have been arrested in what community leaders described as a new climate of fear. A well-known singer was held by police after posting “There is no victor but Allah” alongside a Palestinian flag on Facebook, and political leaders were held after planning an anti-war protest.\nMany Israeli Arabs reported being fired from jobs or shunned at universities. A poll in November found 10% of Arab Israelis had personal experience of harassment. This month, a university student in the mixed city of Haifa was arrested for posting a Palestinian flag alongside an image of armed Israeli students.\nYet a poll in December found that two-thirds of Arab citizens of Israel feel part of the state. More than half agree with a statement by Mansour Abbas, a member of parliament, that the Hamas attack does not reflect Arab society and Islamic values, while 86.5% support helping with civilian volunteering efforts during the war.\nLod, known as al-Lydd in Arabic, has particular reasons for unease rooted in its own troubled history. During the wars surrounding Israel’s foundation in 1948, the town was forcibly depopulated by the Israel Defense Forces. Hundreds of civilians died and it then became home to poor Jewish immigrants who fled violence in the Arab world.\nThese early scars have never healed, and in any time of tension, there is fear on Lod’s scruffy streets.\n“People are afraid to leave their homes at night. We are afraid of the police and of the criminals,” said Fida al-Shehade, a social activist who has struggled for years to build ties between divided communities.\nShehade said that there had been several waves of Arab Israelis moving back into Lod in recent decades, filling homes left by Jewish residents who moved away as levels of violent crime and poverty rose. Many have links with Gaza. Shehade, like others, has lost numerous relatives during the Israeli offensive there. Any memorial services are held discreetly, and there are no announcements in the mosque for fear of attracting the wrong kind of attention from authorities.\nView image in fullscreen A burned-out vehicle after violent confrontations in Lod between Israeli Arab demonstrators and police, May 2021. Photograph: Ronen Zvulun/Reuters\n“It is very hard. It is as if they don’t understand that there is Hamas and then there are civilians, or that we have family in Gaza who are not Hamas,” said Shehade, 40. “Every other war in Gaza we have protested. But now we don’t even try to get permission.”\nIn the first weeks after 7 October, police checkpoints blocked roads in Lod, and a new and heavily armed civil defence force, which included no Arabs from the city, drilled with assault rifles in a park until residents complained, Shehade said.\nOn the new municipality building a banner now proclaims “The municipality of Lod salutes the security forces”, “Together we will win” and “The people of Israel live”.\nAt the offices of Lodaim, an NGO that describes its mission as ­strengthening “education, welfare, [religious] study and reinforcing the Jewish presence in the city of Lod”, director Noam Dreyfus also has an explanation for why there has been no repeat of the 2021 violence in Lod, despite the conflict.\n“I think they got scared of what happened on 7 October … and the reaction. I want to believe they don’t support the 7 October attacks and are scared of a possible reaction. Those attacks happened because we trusted the Arabs, we trusted the peace and we stopped believing in ourselves.”\nLodaim is part of an activist ­religious revivalist movement known as Garin Torani, which follows a ­religious nationalist ideology on the far right of Israeli politics and is linked to the country’s Jewish settler movement. Thousands of members or supporters have moved into Lod in recent years.\nDreyfus said the movement’s social activities benefit all communities, providing much-needed services, but many say their presence is a key factor in current tensions. Many of the new religious Jewish residents now live in poorer Arab neighbourhoods, where they have built schools and synagogues.\nHe rejected accusations from Arab residents that the Garin Torani want to force them out but said that the work of the movement was more important than ever after the 7 October attacks.\n“The state of Israel needs a strong Jewish community in mixed communities in urban areas … Reality has shown that in areas where only Arabs live the rule of law is not strong,” Dreyfus told the Observer.\nAnalysts in Israel say Garin Torani and other similar religious nationalist movements have been empowered under the current coalition government in Israel, led by the prime minister, Benjamin Netanyahu, that includes far-right ministers such as Itamar Ben-Gvir.\nIn the market, Mousa al-Abra, a 49-year-old train safety officer, said that the Arab population of Israel, and Lod, was caught between a rock and a hard place. “If we say we support Gaza, then people in Israel say we are Hamas. But if we say we don’t, then our own community rejects us,” he said.\nFor Shehade, one of the greatest problems is the lack of attention focused on Israeli Arabs.\n“We are not in the West Bank, we are not in Gaza, we are here. It is worse in the West Bank or Gaza but everyone needs to understand that there needs to be a solution for Palestinians here too,” she told the Observer.\n“Then we see what is happening in Gaza and we are thankful even for just what we have here.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘It can explode at any second’: fear at the Israeli market town split between two communities", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/27/it-can-explode-at-any-second-fear-at-the-israeli-market-town-split-between-two-communities"}