{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:27:02", "date_modify": "None", "date_publish": "2023-12-14 22:42:00", "description": "Defence minister addresses US national security adviser as Biden administration presses for end to war", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F14%2Fisrael-tells-us-it-needs-months-to-defeat-hamas.json", "image_url": "https://i.guim.co.uk/img/media/9c4ccad7881045e9dfb17fc83159f1648b42dc1c/0_53_1600_960/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cef6aadf1ec7bd2873e13f8b721f49f6", "language": "en", "localpath": null, "maintext": "Israel will fight on until “absolute victory against Hamas”, the country’s prime minister Benjamin Netanyahu has told a senior official from the Biden administration, as another minister said the war could last “more than several months”.\nNetanyahu’s comments were made to Jake Sullivan, Joe Biden’s national security adviser, during a visit to Israel hours after its defence minister, Yoav Gallant, told Sullivan that many more months were needed to defeat Hamas in Gaza.\nA statement from Netanyahu’s office said: “I told our American friends – our heroic fighters have not fallen in vain. From the deep pain of their falling, we are more determined than ever to continue to fight until Hamas is eliminated – until absolute victory.”\nGallant earlier told Sullivan, apparently contradicting bullish daily updates from Israel’s military about the progress of its campaign, that the war “will require a period of time – it will last more than several months”. He said Hamas had “built infrastructure under the ground and above the ground and it is not easy to destroy them”.\nNetanyahu met Sullivan and two other senior US officials along with other members of his war cabinet at the headquarters of Israel’s defence ministry, the Kirya, in Tel Aviv.\nThe comments were also a clear rebuff to the Biden administration, which has been pressing Israel to wind down its offensive, after the US president warned earlier this week that Israel was losing international support.\nBefore his trip, Sullivan had told a Wall Street Journal event that he would discuss a timetable to end the war and urge Israeli leaders “to move to a different phase from the kind of high-intensity operations that we see today”.\nAfter his meeting with Gallant, Sullivan declined to give details of the talks, but described the conversation as constructive and said there was a “wide degree of convergence” on strategic objectives and steps needed.\nSpeaking to Israel’s Channel 12 TV station, Sullivan said the Gaza Strip should be brought under a “revamped and revitalised” Palestinian Authority.\nSullivan is set to meet Palestinian Authority leader Mahmoud Abbas in Ramallah on Friday. A US officials said the two would discuss “ongoing efforts to revamp and revitalise” the Palestinian Authority and reining in “extremist settler violence” against Palestinians in the occupied West Bank\n“The Palestinian Authority will look to ultimately have a role [in Gaza], and that is something we are talking about with them,” the official said.\nNetanyahu has said there is “disagreement” with Washington over how Gaza would be governed after the war and suggested Israel would retain “overall security responsibility” for the territory.\nA poll of Israelis, published on the day of Sullivan’s visit, revealed widespread dissatisfaction with Netanyahu’s handling of US-Israel relations during the war. About 43% disapproved of Netanyahu’s treatment of Biden with 36% supporting, according to a Maariv/Jerusalem Post poll conducted this week.\nInternational alarm is growing at the scale of the death toll in Israel’s war against Hamas in Gaza, which has already claimed more than 18,000 lives, and the humanitarian catastrophe engulfing the coastal strip where 85% of the population have been displaced by the conflict.\nBiden, whose government has provided Israel with billions of dollars in military aid, delivered his sharpest rebuke of the war earlier this week when he said Israel’s “indiscriminate bombing” of Gaza was eroding international support.\nHe returned to the theme on Thursday, telling reporters: “I want them to be focused on how to save civilian lives, not stop going after Hamas but be more careful.”\nThe US has been pressing for a reduction in airstrikes as well as a major increase in humanitarian aid into Gaza. It has also pressed Netanyahu to explain his vision for how the war will end and how Gaza will be governed.\nWhite House spokesperson John Kirby said that Washington was “not dictating terms” to Israel but that Sullivan had asked “hard questions” about the course of the offensive, while still backing the country.\nThe meeting came as the UN said on Thursday that hunger and desperation were driving people to seize humanitarian aid being delivered to Gaza, warning of a “breakdown of civil order”.\n“Everywhere you go people are desperate, hungry and are terrified,” said Philippe Lazzarini, the head of the UN agency for Palestinian refugees, UNRWA, at a press conference in Geneva.\n“We are teetering on the edge of a possible implosion. We might reach our limit. Why? Because there is more and more a breakdown of civil order.”\nLazzarini, who has just returned from Gaza, said he saw people stopping aid trucks to take food and immediately eat it – something he described as “completely new” in the Palestinian territory.\nBut he said he hadn’t heard of any UN or UNRWA trucks being hijacked by Hamas as claimed by Israel.\nAs Sullivan began his visit, CNN’s Clarissa Ward became the first foreign journalist to reach Gaza and report independently from the country’s south, apparently accessing the strip from Egypt, which had been blocking journalists from crossing into Gaza.\nIsrael has allowed journalists to enter Gaza only when embedded with the Israel Defense Forces. Egypt had, until now, acceded in Israel’s exclusion of foreign media.\nDespite the bellicose rhetoric from Netanyahu and his ministers, however, pressure is mounting rapidly on Israel.\nWith many of the 1.8 million displaced people living in makeshift shelters in Gaza’s south amid shortages of food and medicines, and rapidly spreading disease, Washington and other capitals have been increasing pressure on Israel to wrap up major fighting by the end of December.\nSullivan’s meetings in Israel follow the disclosure that the IDF distributed flyers in Gaza offering substantial rewards for information on the whereabouts of Hamas’s top leaders – including a $400,000 (£310,000) price on the head of Hamas’s political leader, Yahya Sinwar, and $100,000 for the capture of its military leader, Mohammed Deif.\nThe war, now in its third month, began after the Palestinian group’s 7 October attacks on Israel that killed about 1,200 people, mostly civilians.\nIn response, Israel vowed to destroy Hamas and launched a relentless bombardment and ground invasion that has left swathes of Gaza in ruins.\nThis week, the UN general assembly overwhelmingly supported a non-binding resolution for a ceasefire, which Washington voted against.\nUnderlining the scale of the humanitarian issue facing Gaza, Lazzarini said on Wednesday that Palestinians were “facing the darkest chapter of their history”.\nHe said they were “now crammed into less than one-third” of the territory, and suggested there could be an exodus to Egypt, “especially when the border is so close”.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel tells US it needs ‘months’ to defeat Hamas", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/14/israel-tells-us-it-needs-months-to-defeat-hamas"}