{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:27:05", "date_modify": "None", "date_publish": "2023-12-13 11:23:15", "description": "A US warship shot down a suspected Houthi drone flying in its direction in the Red Sea (file image).", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12858971%2FUS-warship-shoots-Houthi-drone-flying-direction-two-missiles-narrowly-missed-commercial-tanker-loaded-jet-fuel-heading-Suez-Canal-latest-Red-Sea-flare-up.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/13/11/78857369-0-US_military_Central_Command_said_an_anti_ship_cruise_missile_lau-a-43_1702466069172.jpg", "language": "en", "localpath": null, "maintext": "A US warship shot down a suspected Houthi drone flying in its direction after two missiles fired by the rebels narrowly missed a commercial tanker loaded with jet fuel in the Red Sea in the latest flareup in the region.\nThe Marshall Islands-flagged tanker Ardmore Encounter was travelling north towards the Suez Canal in the Red Sea when it was targeted by two missiles fired from territory held by Yemen's Houthi rebels.\nDuring the same incident, an American warship shot down a suspected Houthi drone flying in its direction, a US official, who spoke on condition of anonymity to discuss intelligence matters, said. No one was hurt in the attack, the official said.\nThe assault on the tanker Ardmore Encounter further escalates a campaign by the Iranian-backed rebels targeting ships close to the Bab el-Mandeb Strait, and also widens the international impact of the Israel-Hamas war raging in the Gaza Strip.\nIt marks the first time Houthi rebels have targeted an energy shipment heading to the Suez Canal. It comes after a speedboat with armed men aboard approached two vessels transiting off the coast of Yemen's Red Sea port of Hodeidah today.\nDuring the same incident, an American warship shot down a suspected Houthi drone flying in its direction, a US official, who spoke on condition of anonymity to discuss intelligence matters, said. No one was hurt in the attack, the official said. Pictured: US Destroyer USS Mason in 2021\nThe Marshall Islands-flagged tanker Ardmore Encounter (file image) was travelling north towards the Suez Canal in the Red Sea when it was targeted by two missiles fired from territory held by Yemen's Houthi rebels\nMeanwhile, the Marshall Islands-flagged tanker was traveling north toward the Suez Canal in the Red Sea, satellite tracking data analyzed by The Associated Press showed.\nThe vessel was on its way from Mangalore, India, and had an armed security crew aboard it, according to data transmitted by the ship.\nThose guards apparently opened fire to drive off skiffs loaded with men trying to board the vessel, the private intelligence firm Ambrey said.\nArdmore Shipping Corp., which owns and operates the ship, issued a statement to the AP acknowledging the attack.\n'No one boarded the vessel and all crew members are safe and accounted for,' the statement said. 'The vessel remains fully operational with no loss of cargo or damage on board.'\nIt added: 'Ardmore is in close contact with the relevant authorities and military assistance is now in the area providing support as required.'\nThe ship was carrying a load of jet fuel from Shell MRPL Aviation Fuels & Services Ltd., a joint operation of the oil giant and India's national oil company. The fuel was heading to either Rotterdam in the Netherlands or Gavle, Sweden, Ardmore Shipping said. Shell declined to comment.\nArdmore Shipping traded slightly up early Wednesday on the New York Stock Exchange to $13.64 a share.\nThe Houthis did not immediately acknowledge the attack.\nThe British military´s United Kingdom Maritime Trade Operations, which provides warnings to sailors in the Middle East, earlier reported a separate incident off the coast of Oman. It said a vessel had been followed by smaller boats carrying machine guns and men in gray uniforms before escaping unharmed.\nOn Monday night, a missile also fired by Yemen´s Houthi rebels slammed into a Norwegian-flagged tanker in the Red Sea off the coast of Yemen near the Bab el-Mandeb Strait.\nThe Houthis have carried out a series of attacks on vessels in the Red Sea and launched drones and missiles targeting Israel. In recent days, they have threatened to attack any vessel they believe is either going to or coming from Israel. There was no immediate link found between the Ardmore Encounter and Israel.\nAnalysts suggest the Houthis hope to shore up waning popular support after years of civil war in Yemen between the rebels and Saudi-backed forces.\nUS military Central Command said the anti-tank cruise missile, launched from a Houthi-controlled area of Yemen, hit the Strinda (file image) last night\nFrance and the United States have stopped short of saying their ships were targeted in rebel attacks, but have said Houthi drones targeting their ships and were shot down in self-defense. Washington so far has declined to directly respond to the attacks, as has Israel, whose military continues to insist the ships do not have links to their country.\nGlobal shipping has increasingly been targeted as the Israel-Hamas war threatens to become a wider regional conflict - even during a brief pause in fighting during which Hamas exchanged hostages for Palestinian prisoners held by Israel. The collapse of the truce and the resumption of a punishing Israeli ground offensive and airstrikes on Gaza have raised the risk of more sea attacks.\nThe Bab el-Mandeb Strait is only 29 kilometers (18 miles) wide at its narrowest point, limiting traffic to two channels for inbound and outbound shipments, according to the U.S. Energy Information Administration. Nearly 10% of all oil traded at sea passes through it. An estimated $1 trillion in goods pass through the strait annually.\nIn November, Houthis seized a vehicle transport ship linked to Israel in the Red Sea off Yemen. The rebels still hold the vessel near the port city of Hodeida. Separately, a container ship owned by an Israeli billionaire came under attack by a suspected Iranian drone in the Indian Ocean.\nA separate, tentative cease-fire between the Houthis and a Saudi-led coalition fighting on behalf of Yemen´s exiled government has held for months despite that country´s long war. That´s raised concerns that any wider conflict in the sea - or a potential reprisal strike from Western forces - could reignite those tensions in the Arab world´s poorest nation.\nIn 2016, the U.S. launched Tomahawk cruise missiles that destroyed three coastal radar sites in Houthi-controlled territory to retaliate for missiles being fired at U.S. Navy ships at the time.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US warship shoots down Houthi drone flying in its direction after two missiles narrowly missed commercial tanker loaded with jet fuel heading towards the Suez Canal in latest Red Sea flare up", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12858971/US-warship-shoots-Houthi-drone-flying-direction-two-missiles-narrowly-missed-commercial-tanker-loaded-jet-fuel-heading-Suez-Canal-latest-Red-Sea-flare-up.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}