{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:27:06", "date_modify": "None", "date_publish": "2023-12-13 16:00:15", "description": "Senior officer from Golani Brigade dies after failed attempt to rescue injured troops in Shejaiya area", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F13%2Fgaza-israel-soldiers-killed-hamas-ambush.json", "image_url": "https://i.guim.co.uk/img/media/f2c8dd3e1481579394582165a134ab93d0e94ab2/0_185_3853_2312/master/3853.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea1e720c9ca8267df58f333081579d62", "language": "en", "localpath": null, "maintext": "Two senior Israeli commanders and seven other soldiers have been killed by Hamas in a complex ambush in the Gaza City suburb of Shejaiya, an area that has seen intense urban fighting in recent days.\nThe latest Israeli combat deaths came amid fears of a rapidly escalating humanitarian crisis in Gaza as heavy winter rains lashed the region and after reports by aid agencies of dwindling food stocks for the vast number of Palestinians who have been displaced to southern Gaza.\nLt Col Tomer Greenberg, a commander in the Golani Brigade, who had fought against Hamas during its attack on the southern Israel border communities on 7 October, was killed during a failed attempt to rescue four injured soldiers.\nIn one of the most lethal incidents for Israeli soldiers to date in the two-month-old war in Gaza, Greenberg and several of his senior officers were killed in fighting involving improvised explosive devices while they were fired on from buildings.\nAmong the dead, announced by the Israel Defense Forces (IDF) on Wednesday, were another colonel, three majors and several members of a combat rescue force.\nA notice in Hebrew posted by the Golani Brigade described the ambush which occurred near Shejaiya’s market. “While carrying out searches to clear buildings in the heart of the Shejaiya casbah, considered a crowded area overflowing with terror targets, there was a large explosion in one of the building and several soldiers from the 13th battalion were wounded,” it said.\nAccording to accounts of the battle, the soldiers were approaching a building when they first came under fire from an upper storey, initiating a firefight in which they were struck by grenades and an explosive charge, severely injuring four who were cut off from the rest of the soldiers.\nAs soldiers went to help the first group amid fears they may be dragged into a tunnel, a second blast hit them. A third group tried to approach to evacuate the wounded and was also hit by an explosion.\nThe ambush came despite daily claims by the IDF that it is close to having operational control of key Hamas strongholds in the north of Gaza.\nGreenberg had risen to public prominence after the 7 October attack, describing in an interview how he had rescued two infant twins whose parents had been killed by Hamas in Kfar Aza.\nReferring to the soldiers who were killed on Tuesday, the Israeli minister Benny Gantz said Israel was paying “a heavy, painful, and difficult price”.\nThe ambush came amid unconfirmed media reports that Israel had started to pump seawater into some of Hamas’s tunnel system. Asked about the claims, made in the Wall Street Journal, the US president, Joe Biden, declined to directly answer, referring only to assertions that there were no hostages in the areas targeted.\n“With regard to the flooding … I’m not at lib… well. There are assertions being made that … there are no hostages in any of these tunnels. But I don’t know that for a fact,” Biden said.\nView image in fullscreen Palestinians take shelter in tents in Deir al-Balah, Gaza. Aid agencies have warned of an escalating humanitarian crisis with the arrival of heavy winter rains and cold weather.\nPhotograph: Anadolu/Getty Images\nAmid growing pressure for a ceasefire, the UN general assembly on Tuesday night passed by a large majority a resolution calling for an immediate humanitarian ceasefire in the Gaza Strip. One hundred and fifty-three countries voted in favour of the ceasefire, 10 countries voted against and 23 abstained or were absent.\nOn Tuesday Israel and the US had their sharpest public disagreement yet over the conduct and future of the war as the two allies became increasingly isolated by global calls for a ceasefire.\nThe dispute emerged while Israeli forces carried out strikes across Gaza, crushing Palestinians in homes. Biden said he had told the Israeli prime minister, Benjamin Netanyahu, that Israel was losing international support because of its “indiscriminate bombing” and that Netanyahu should change his government, which is dominated by hard-right parties.\nThe UN general assembly resolution calling for a humanitarian ceasefire is largely symbolic but serves as an important barometer of world opinion. None of the major powers joined Israel and the US in their opposition to the ceasefire.\nJake Sullivan, the White House national security adviser, will head to Israel this week to discuss with Netanyahu a timetable for the war and what happens if Hamas is defeated. The defence secretary, Lloyd Austin, will travel to Israel next week for a visit that the Pentagon said was intended to show US support for Israel but also to press the need to avoid more civilian casualties in Gaza.\nThe war ignited by Hamas’s 7 October attack in Israel has already brought unprecedented death and destruction to the impoverished coastal territory, with much of northern Gaza obliterated, more than 18,000 Palestinians killed, according to Gaza authorities, and more than 80% of the population of 2.3 million pushed from their homes.\nThe US has urged Israel to do more to reduce civilian casualties since it launched its ground invasion of southern Gaza at the beginning of the month. But the toll has continued to mount at seemingly the same dizzying rate.\nThe healthcare system and humanitarian aid operations have collapsed in large parts of Gaza amid Israel’s blockade of the territory and intense airstrikes and fighting, and aid workers have warned of starvation and the spread of disease among displaced people in overcrowded shelters and tent camps.", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza: Israeli commanders among nine soldiers killed in Hamas ambush", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/13/gaza-israel-soldiers-killed-hamas-ambush"}