{"authors": [], "date_download": "2024-02-05 15:27:07", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Within the span of just four forlorn years, Hong Kong went from its highest-ever voter turnout to its lowest ever in local district elections. In 2019, 71.2 per", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274061531%2Fhong-kong-people-lament-chinese-control.json", "image_url": "https://cdn.bignewsnetwork.com/ani1702307394.jpg", "language": "en", "localpath": null, "maintext": "Hong Kong, December 11 (ANI): Within the span of just four forlorn years, Hong Kong went from its highest-ever voter turnout to its lowest ever in local district elections. In 2019, 71.2 per cent of the population turned out - mostly to vote for pro-democracy candidates and thereby slamming government arguments that only a \"noisy minority\" was protesting - whereas the participation rate plummeted to 27.54 per cent in elections held on 10 December 2023.\nThe results speak for themselves. As Carmen Lau, an exiled former Hong Kong district councilor commented, \"The decline of the turnout rate exactly mirrors the deterioration of Hong Kong's democracy.\" Voter turnout has typically bounced between 30 per cent and 45 per cent over the past 40 years, but for public involvement to shrink by a factor of more than 2.5 in just four years is simply unprecedented.\nThis year, the Chinese Communist Party (CCP)-controlled government slashed democratic representation to just 20 per cent, and even then candidates were pre-vetted to ensure they were \"patriots\". Furthermore, opposition was barred, constituencies were redrawn and most councillors were chosen by the city's leader or government- appointed committees.\nAs Nathan Ruser of the Australian Strategic Policy Institute pointed out, \"Over 1.2 million Hong Kongers marched on the street against Beijing's rule multiple times during the 2019 mass protests. [That is] more Hong Kongers than who voted in this 'patriots-only' election. Even in a 'quiet' Hong Kong, Beijing's imposed dictatorship is immensely unpopular.\"Turnout on 10 December was 1.19 million voters. Remember too that civil servants were \"urged\" to vote by the likes of Chief Secretary Eric Chan, which amounted to 170,000 likely participants for starters. Voters received a \"thank you\" card from the government, leading many to fear they would be forced to show these to employers to prove that they did in fact vote.\nAfter going from a vibrant and relatively free society, to essentially a police state where any dissent against the Hong Kong or Chinese government is harshly punished, the populace now has few ways to express itself. Refusing to vote is one of them.\nAnother method is to use extreme sarcasm to parrot empty government promises or slogans. For example, the government described the election as \"very successful\".\nCynical Hong Kongers concurred online with comments such as: \"Yeah, the most successful election in the universe!\" They pointed out that the success stemmed from the fact that this election held the record for the lowest participation rate ever.\nIronically, the electronic computer system experienced a glitch on election day, causing voting hours to be extended by 1.5 hours till midnight. Despite the extra time, people showed little desire to vote for the 20 per cent of seats actually being contested. The other 80 per cent were all selected by the authorities or government-appointed committees.\nIn such a one-sided system, one wonders what difference there is from elections in China's or North Korea's single-party states.\nThis was the first district council election held under a severely overhauled system that stacked the deck completely in the government's favor. The system was drastically changed in May after the 2019 election gave the pro-democracy faction a landslide, but ultimately meaningless, victory. It was rendered meaningless because China implemented the National Security Law on 30 June 2020 that suppressed free speech and turned pro-democracy figures and activists into wanted criminals or exiles overseas.\nJustice David Lok, Chairman of the Electoral Affairs Commission, said it was inappropriate to compare this year's participation rate with that of 2019. He said the composition, voter base and voting system were all different. True enough, but that is because the government singlehandedly changed all these things to create an absurd, closed-circle electoral system.\nThe police were on high alert on election day, with 10,000 officers on the streets. They arrested several over alleged calls encouraging people to cast invalid ballots. Three members of the League of Social Democrats were also arrested ahead of a planned protest outside a polling station.\nAnother person, 77-year-old Koo Sze-yiu, was arrested on 8 December for having the intent to protest. He was charged with \"attempting to do or making any preparation to do an act or acts with seditious intention\". It is stunning how Hong Kong has developed into a dystopian form of the Minority Report, where people can be summarily arrested before committing a supposed crime. If the police discern the faintest hint of dissent, it jumps into action before anything is actually done.\nSimilarly, the protestor Chu Kai-lun was arrested for carrying two laser pointers in his backpack during the 2019 protests. For this \"serious\" offence he was sentenced to five months in prison in November 2023. This illustrates the prescient powers that the police have attained under the National Security Law, where convictions are almost certain because the government appoints the judge and no jury is present.\nIndeed, Hong Kong is a textbook example of how an authoritarian regime can weaponize laws and the courts to suppress a society.\nConsider Agnes Chow, for example, a pro-democracy figure prominent in the 2019 protests. Recently, she decided to stay in Canada and jump the bail imposed on her by the Hong Kong police. She had been arrested in August 2020 under the National Security Law, accused of colluding with foreign forces to endanger national security.\nIn order to get her passport back so she could travel to Toronto for university, she was required to write a letter of repentance, as well as travel to mainland China with a police escort to attend exhibitions and write a letter praising China's great achievements.\nSuch repellent methods are straight out of the playbook of the Mao Zedong era, and they typify the toxic system that now pervades Hong Kong. Such practices are inconsistent with anything in Hong Kong common law, demonstrating how CCP thinking has pervaded the former British colony as sycophants seek to make Beijing proud. These are precisely the type of fearmongering tactics used in mainland China to pressurize individuals and to exercise leverage over their liberty.\nIt is clear that politics are above the rule of law in today's Hong Kong. The government can do whatever it wants, make up any rules it wants, pressurize individuals and coerce people into mute submission. Ironically, Agnes Chow had never been charged with national security crimes or even appeared in court in the past three years since her arrest. Yet her treatment by the police shows just how badly they have overstepped and transgressed the law, even taking suspects to China where the force has no jurisdiction.\nForeign companies are watching such cases too. The \"one country, two systems\" formula is truly dead, and protections that overseas businesses expected from Hong Kong's common law have been steadily eroded. There are no longer independent courts or legal certainty, and arbitrariness is now common in law enforcement. This charade with Chow, who now suffers from anxiety and depression, illustrates how such a fate could befall anyone who runs afoul of the government.\nHong Kong Chief Executive John Lee criticized Chow for jumping bail. But here again, the government demonstrated its vindictiveness. Chow had not been convicted of any crime, and the government likes to remind everyone how it does not comment on individual legal cases. Except when they involve the National Security Law! In such cases, it then points acrimonious fingers even before cases have appeared in court. So much for innocence before being proven guilty!John Lee is often a target of mockery from resentful Hong Kongers. Kurt Campbell, the US nominee for Deputy Secretary for State, recently revealed that Lee had not been invited to November's APEC forum in San Francisco. Campbell said, \"We made clear to both Hong Kong and China authorities that he would not be welcome. We never intended for him to participate.\"Yet Lee claimed he had been invited, that this was an \"indisputable fact\", even though he is under US sanctions. Of course, when Chinese figures talk about \"indisputable\" facts, this usually means that they are extremely dubious. Cartoons lampooning Lee, showing him with a Pinocchio nose, were soon doing the rounds on the internet.\nHong Kong protestors had five demands in 2019: that a proposed extradition law be withdrawn; that there be an independent investigation of police behavior; that the protests stop being characterized as riots; that any charges against arrested protesters be dropped; and that promised universal suffrage be implemented. Only the first one was achieved, and it is quite the reverse for the other four demands. The police have zealously gone after targets, deliberately creating a climate of fear that penetrates every aspect of society.\nHong Kong basically has a national security constitution now, where absolutely everything is subjugated to this draconian law. As somebody pointed out: \"In Hong Kong you can be arrested for releasing balloons, publishing a children's book, flying a flag, chanting a slogan, singing a song, assembling in public, booing a national anthem, running for election, performing a song, holding flowers or speaking out of turn.\" In other words, one can be arrested for just about anything depending on how the police wish to construe it.\nIn one chilling example, 23-year-old student Yuen Ching-ting was arrested on 8 March 2023 for publishing online posts on Facebook and Instagram. Only two of the 22 \"secessionist\" posts had been published whilst she was in Hong Kong, as she had been studying in Japan. She was arrested when she returned to renew her identity card, and was later sentenced to two months in prison. This case illustrated how the Hong Kong authorities apply their law worldwide.\nThe National Security Law has a presumption against bail, leaving defendants languishing in jail for months or years while awaiting trial. The law vaguely defines \"secession, subversion, terrorism and collusion with foreign elements,\" meaning they are whatever the government wants them to be. It also leads to the current ludicrous position where defense lawyers cannot adequately defend their clients in court since they do not know exactly what crimes are supposed to have been committed.\nThe National Security Law also has further prohibitions against \"aiding, abetting and incitement\" of the aforementioned crimes. Such ambiguity makes it impossible to know what is and is not considered a crime. Yet this is precisely what the government wants, forcing people into mute silence out of fear of saying the wrong thing.\nUp till late November 2023, a total of 285 individuals had been arrested under this law. At least 35 per cent of these were allegedly endangering national security through online comments or other speech. Then, in July, the government issued arrest warrants for eight self-exiled activists, offering a bounty of HKD1 million on each of their heads. Chief Executive John Lee said they would be \"pursued for life\" and would spend their days in fear. Hong Kong's leader denounced the eight as \"rats in the street\".\nA Committee to Safeguard National Security, comprising the Chief Executive and various officials, operates directly under the aegis of the Central Government in China. This committee works in total secrecy and cannot be subjected to judicial review. The special police unit responsible for national security can conduct secret surveillance and does not require search warrants (even against defense lawyers, for instance). With such powers, there is little difference between Chinese secret police or the Gestapo. Furthermore, the Hong Kong Office for Safeguarding National Security is staffed by secretive mainland officials as it conducts \"oversight and guidance\" of local authorities. In \"complex or serious\" cases, suspects can even be transferred to China for trial.\nLast week, international ratings agency Moody's downgraded Hong Kong's credit outlook from stable to negative. The government responded angrily, accusing it of \"unfounded comments\" and claiming that \"the implementation of the [national security law] has put an end to the chaotic situation and serious violence\". The law may have reduced chaos, but it has also stifled the souls and aspirations of Hong Kongers. Hong Kong's economy is dropping in tandem with China's. As the Hang Seng Index faltered below 16,000 points, cynics sarcastically noted that \"Hong Kong is no longer in chaos, and the stock market is performing very well. We still have 15,000 points to fall, so don't worry!\"As the recent election demonstrated, many, if not most, in Hong Kong are frustrated, alarmed and despondent. A survey conducted in March 2022 suggested that 24 per cent were definitely emigrating, while a further 21 per cent were planning to leave later on. More than a third blamed diminishing personal freedoms, and another 16 per cent blamed fears for their family's future. The population declined 0.4 per cent in 2020, 0.9 per cent in 2021 and another 0.9 per cent in 2022 amidst an emigration exodus. Many quoted the imposition of \"national security education\" in schools as a key factor in their desire to leave. (ANI)", "source_domain": "www.britainnews.net", "text": null, "title": "Hong Kong people lament Chinese control", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274061531/hong-kong-people-lament-chinese-control"}