{"authors": [], "date_download": "2024-02-05 15:27:18", "date_modify": "None", "date_publish": "2023-12-13 06:49:19", "description": "Environmental experts caution pumping seawater into underground tunnels could result in long-lasting consequences for groundwater in Gaza Strip", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-hamas-tunnels-seawater-gaza-b2463093.html.json", "image_url": "https://static.independent.co.uk/2023/12/06/13/SEI182728486.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael has begun pumping seawater into subterranean Hamas tunnels in a bid to flush out the militants, according to a report.\nThe Wall Street Journal, citing US officials briefed on the Israeli military’s operations, reported that the move to flood the tunnels with water from the Mediterranean Sea has already begun.\nEarlier, it was reported that this move by the Israeli military was “under consideration”. Israel Defense Forces (IDF) had reportedly set up five large water pumps near the Shati refugee camp in northern Gaza. These pumps have the capacity to inundate the tunnels in a matter of weeks, as they can pump thousands of cubic metres of water per hour into the passages.\nLast week, IDF Chief of Staff Lt Gen Herzi Halevi said flooding the tunnels was “a good idea, but I won’t comment on its specifics”.\nHe said: “We are seeing a lot of underground infrastructure in Gaza, we knew there would be a lot. Part of the goal is to destroy this infrastructure.\n“We have various ways (to deal with the tunnels), I won’t talk about specifics, but they include explosives to destroy, and other means to prevent Hamas operatives from using the tunnels to harm our soldiers.”\n“Therefore, any means which give us an advantage over the enemy that [uses the tunnels], deprives it of this asset, is a means that we are evaluating using.”\nReuters reported that Israel’s military were looking into the reports. An Israeli Defence Ministry spokesperson declined to comment.\nIsrael has pledged to dismantle Hamas following the deadly 7 October attacks during which the Palestinian militants breached the border from Gaza and entered the southern part of the country and killed 1,200 people. Hundreds of hostages were taken. In response, Israel launched massive air strikes and ground assaults in Gaza, which have so far killed more than 18,000 Palestinians.\nUS president Joe Biden on Tuesday refrained from directly addressing reports of Israel pumping seawater into Hamas’s tunnel complex in Gaza at a press conference in Washington. He only commented on the absence of hostages in the targeted areas.\nMr Biden said: “With regard to the flooding of the tunnels. I’m not at lib-, well. There (are) assertions being made that ... there’s no hostages in any of these tunnels. But I don’t know that for a fact.”\nHe added: “I do know that, though, every civilian death is an absolute tragedy, and Israel has stated its intent, as I said, to match its words ... with actions.”\nEarlier, Israel had not disclosed when it intended to pump seawater into tunnels, but footage had emerged of water filling the tunnels though it was not independently verified. Officials in the US privately expressed concern about the plan, according to an earlier WSJ report.\nIsrael’s Foreign Ministry claimed that at least 1,370 tunnels have been built since 2007. They are often between 10 and 20m beneath the ground and up to two metres in height.\nEnvironmental experts have cautioned that the move to pump seawater into a network of underground tunnels could result in long-lasting consequences for groundwater in the Gaza Strip.\n“The negative impact on groundwater quality would last for several generations, depending on the amount that infiltrates into the subsurface,” Prof Eilon Adar of the Zuckerberg Institute for Water Research at Ben-Gurion University of the Negev, in southern Israel was quoted as saying by the Times of Israel.\nGazans are facing a severe shortage of water.\nAdditional reporting with agencies", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel military begins pumping seawater into Hamas tunnels, report says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-hamas-tunnels-seawater-gaza-b2463093.html"}