{"authors": ["Aliki Kraterou"], "date_download": "2024-02-05 15:27:22", "date_modify": "None", "date_publish": "2023-12-13 07:28:36", "description": "ISRAEL has reportedly started pumping seawater into Hamas's sprawling network of tunnels in Gaza in a bid to flush out terrorists.The IDF is said to h", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25034506%2Fisrael-begins-pumping-seawater-flood-hamas-underground-tunnels%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/2023-israel-says-hamas-militants-861541765-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "ISRAEL has reportedly started pumping seawater into Hamas's sprawling network of tunnels in Gaza in a bid to flush out terrorists.\nThe IDF is said to have installed at least five pumps close to the Al-Shati refugee camp in the besieged enclave, aiming to use them to destroy the underground labyrinth.\n7 The tactic aims to destroy the tunnels and drive the terrorists out Credit: AP\n7 Israel is said to have installed five pumps in Gaza\n7 US officials claim the operation in the tunnels has already started Credit: Instagram /@ariel_oseran\n7 Previously Israel was said to be considering flooding the tunnels Credit: Instagram /@ariel_oseran\n7 The tunnels are said to be heavily laden with booby traps Credit: TWITTER, ALFAIOMI\nThe pumps would pour in thousands of cubic metres of water per hour from the Mediterranean Sea, which would drive out or drown Hamas terrorists.\nUS officials have now revealed the operation has begun and will supposedly take weeks according to the Wall Street Journal.\nThe underground network that stretches some 500km is used by the terror group as a hiding spot and to transport people and goods as well as store rocks and ammunition.\nBut it is also believed that hostages are being kept inside the booby-trapped tunnels.\nThe outlet reported last week that Israel was considering the tactic which IDF chief Herzi Halevi branded as \"a good idea but I won’t comment on its specifics.\"\nHe added: \"We are seeing a lot of underground infrastructure in Gaza, we knew there would be a lot. Part of the goal is to destroy this infrastructure.\n\"We have various ways [to deal with the tunnels]. I won’t talk about specifics, but they include explosives to destroy, and other means to prevent Hamas operatives from using the tunnels to harm our soldiers.\"\nIt comes as footage of an IDF soldier shooting two Hamas terrorists at point-blank range has emerged.\nHeadcam footage shared by the Israeli Defense Forces claims to show the intense scenes at the terror lair apartment in Gaza City.\nSharing the action-packed video, IDF spokesperson Rear Admiral Daniel Hagari tweeted: \"As part of the battles in Sajaiya, a reservist from the Yalam unit of the Combat Engineering Corps encountered two terrorists at point blank range.\n\"After eliminating the first terrorist and being injured by throwing grenades at him, the fighter acted calmly, conducted a firefight while striving for contact and eliminated another terrorist who was staying in the building.\"\nMeanwhile, fighting continues in Gaza with the IDF announcing the death of eight more soldiers including a lieutenant colonel who has commanded a Golani infantry regiment.\nThe bodies of two hostages were recovered from Gaza last night - Eden Zacharia, 27, who was kidnapped from the Supernova festival on October 7 and 36-year-old IDF Warrant Officer Ziv Dado.\nZacharia was leaving the desert rave with her boyfriend and friends when terrorists began shooting at their car, later taking her hostage, The Times of Israel reported.\nAnd Dado, a logistics supervisor in the Golani Brigade’s 51st Battalion, was killed during the October 7 bloodbath.\n7 Eden Zacharia was declared dead after being kept hostage by Hamas", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israel 'begins pumping seawater to flood Hamas underground tunnels and flush out terrorists' as battles rage in Gaza", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25034506/israel-begins-pumping-seawater-flood-hamas-underground-tunnels/"}