{"authors": [], "date_download": "2024-02-05 15:15:27", "date_modify": "None", "date_publish": "2024-01-27 00:59:41", "description": "Plaintiffs in an unprecedented courtroom hearing are asking a judge to restrain the Biden administration’s support for Israel’s campaign in Gaza", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fbiden-genocide-lawsuit-court-hearing-b2485780.html.json", "image_url": "https://static.independent.co.uk/2024/01/27/00/2024-01-27T002033Z_2018466735_RC2ZP5A6VVVL_RTRMADP_3_ISRAEL-PALESTINIANS-CALIFORNIA-LAWSUIT.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nDr Omar Al-Najjar called into a federal courtroom in Oakland, California from an administrative building at a hospital in Rafah, the only room where he could get an internet connection.\nSitting on the floor in his scrubs, the doctor testified by video, explaining how his family in Gaza was repeatedly violently displaced under Israeli bombardments, enduring random bursts of gunfire and rockets.\nAt the hospital in Rafah, thousands of patients arriving daily lack adequate care, he said on Friday. There is severe dehydration and hunger. Patients with chronic diseases don’t have the medication they need.\nHis dreams and plans “are lost,” he said. “I have nothing left but my grief … They weakened us for years and continued to unleash bullets and missiles on our lifeless bodies.”\nDr Al-Najjar was the first among several Palestinians testifying in an unprecedented case against President Joe Biden, who is being sued by a group of American Palestinians and aid groups accusing him of failing to prevent genocide in Gaza under obligations to international and federal law.\nThey are asking a judge for an injunction that would halt any additional military aid or diplomatic support to Israel in its ongoing siege of Gaza, where more than 25,000 Palestinians, including more than 10,000 children, have been killed within the last 126 days, according to Gaza’s health ministry.\nThe judge is expected to issue a decision in the coming days.\nThe case is “monumental” in that it marks the first time Palestinians have testified in federal court to the impact of US support for Israel’s campaign, according to Defence for Children International - Palestine advocacy officer Miranda Cleland, whose organisation is the lead plaintiff in the case.\n“So many of these atrocities are broadcast live on social media, and everyday people around the world can see for themselves what is happening,” she told The Independent. “Courts move slower than the people, of course, and the people have made it clear to Biden and his administration that most Americans do not support this.”\nHours before the hearing, a ruling from the International Court of Justice at The Hague urged Israel to prevent acts of genocide and to allow aid into the beleaguered strip, marking an initial step in a case brought by South Africa that laid out its accusations of Palestinian genocide, and heightened pressure against Israel by world powers to end its retaliatory devastation.\nWhite House National Security Council spokesperson John Kirby told reporters at the White House on Friday that “it’s hard to see” the Biden administration changing its approach to its support for Israel following the World Court’s ruling.\n“This is obviously just a provisional order by the court. We’ll have to watch how the process plays out. But it’s difficult to see that it alone is going to change the approach,” Mr Kirby said. “The president believes the approach we have been taking has been getting results and we’re going to keep at that.”\nPalestinians arrive in Rafah after fleeing an Israeli ground and air offensive in the nearby city of Khan Younis on 26 January. (AP)\nThe federal lawsuit against Mr Biden, Defense Secretary Lloyd Austin and Secretary of State Antony Blinken was filed in November by the Center for Constitutional Rights on behalf of Dr Al-Najjar with aid groups Defence for Children International – Palestine and Al-Haq, as well as plaintiffs with families in Gaza, all of whom have lost loved ones from Israel’s attacks or are among the tens of thousands who have been violently displaced.\n“I’ve never seen anything like this. We would never have imagined something like this,” said plaintiff Ahmed Abofoul, who was born and raised in Gaza and works as a legal researcher for Palestinian civil rights group Al-Haq.\n“We heard stories about the Nakba … I never imagined we would live it and witness it ourselves,” he told the court on Friday. “The Gaza that we know no longer exists. Everything has been destroyed. … Every place I have memories with has been destroyed.”\nHis neighbourhood and the walls where families wrote messages over the years, the churches where he celebrated friends’ weddings, and the city archives preserving Gaza’s history have all been destroyed, he said.\nIsraeli forces have killed several members of the family of Leila El-Haddad, a mother of four in Maryland who writes about Gaza’s culinary heritage.\n“I felt it was my duty as an American whose taxes and government have been directly responsible for the deaths of my family… to do what I can to put an end to this genocide,” she told the court on Friday.\nNews of the devastation, attempts to contact her remaining family in Gaza, and her pleas to end the violence have “consumed every aspect of my life,” she said.\n“I spend my days just… it all revolves around this,” she said.\nMohammed Monadel Herzallah of Fairfield, California, has lost at least seven members of his family, one of whom was a four-year-old girl.\n“I feel horrible. I feel dehumanised … and the world is numb about it,” he said in his testimony.\n“I’m asking this court to raise the voice of our people in Gaza, hold people who are responsible and who have the authority and duty to hold them responsible, the ability to stop this madness, to stop this genocide,” he said.\nSmoke billows after an Israeli strike in Rafah in southern Gaza on 26 January. (AFP via Getty Images)\nUS District Judge Jeffrey S White, in laying out the facts of the case before him on Friday, described Israel’s “brutal” campaign that has killed “tens of thousands of Palestinian civilians,” displaced more than 2 million people, destroyed “critical civilian infrastructure”, levelled hospitals, schools, and “safe havens”, while people are “living in fear” without food, medical care, clean water or sufficient aid.\nThe United States has “provided substantial support to Israel” and continued to “reinforce” its support for Israel in the wake of Hamas attacks that killed more than 1,200 people on October 7, he said.\nBut the questions before the judge involve the limitations of the court’s reach, and whether the courts are constitutionally restricted against “political questions” of White House foreign policy.\nThe plaintiffs, however, argue that the case has nothing to do with political questions, but whether the courts can intervene if US officials have violated international and federal law.\n“Here the United States is choosing to avoid its binding legal obligations,” according to Center for Constitutional Rights attorney Katherine Gallagher.\nThe court must have legal discretion to act against genocide, under both the terms of the Genocide Convention and US law adhering to it, she told the court on Friday.\nJean Lin, an attorney for the US Department of Justice, argued the court has no jurisdiction whatsoever.\n“We submit that the court has no jurisdiction … even though we concede Genocide Convention is the law of the land,” she told the judge. “But … that elevated status does not mean that it may be enforced by the courts.”\nJudge White asked what mechanisms, then, would anyone have to ensure the government adhered to international law.\nMs Lin argued that governments could be held accountable through the United Nations and “political accountability” through elected members of Congress, but she conceded that the plaintiffs in this case wouldn’t be able to join the proceedings at The Hague, for example.\nPlaintiffs’ attorneys also noted that the US wields veto power at the United Nations Security Council, effectively being able to void any charges against it.\nDr Barry Trachtenberg, a Jewish history professor and genocide scholar at Wake Forest University in North Carolina, explained to the court how US and world governments, in the wake of the Holocaust, “now have a framework” under international law to combat genocide.\n“As we’ve seen in nearly every genocidal effort since, the legal actions always seem to come afterwards, they come late … and then there’s an attempt to bring justice against the victims,” he said. “What makes this situation so unique is we’re watching the genocide unfold as we speak. … The reason why I’m weighing in is we’re seeing it happen before our eyes.”\nHistory shows us “there are moments of intervention,” he added, “and it’s only afterwards that we have to have this reckoning.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Palestinians testify in federal court against Biden’s ‘complicity’ in genocide", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-genocide-lawsuit-court-hearing-b2485780.html"}