{"authors": [], "date_download": "2024-02-05 15:27:25", "date_modify": "None", "date_publish": "2023-12-13 07:00:00", "description": "Last week I used my column to highlight the very real fears that the USA and the European Union might not meet their respective financial commitments to Ukraine and the possible effect that this might have on the outcome of the war with Russia.", "filename": "https%3A%2F%2Fwww.edinburghnews.scotsman.com%2Fnews%2Fopinion%2Fcolumnists%2Fwest-must-not-abandon-ukraine-in-its-hour-of-need-steve-cardownie-4442715.json", "image_url": "https://www.edinburghnews.scotsman.com/webimg/b25lY21zOmNlYTc3NDkyLWI0OTgtNDYzMi05MDI5LTdlZDMzMzIzNzBkNjozYjM0YmQ0Mi1mNDlkLTQzYjEtODYzZi00MDQxOGJjYmU0MTI=.jpg?width=570&auto=webp&quality=75&crop=3:2,smart", "language": "en", "localpath": null, "maintext": "Ukraine’s First Lady Olena Zelenska says her country is in ‘mortal danger’\nMuch needed weaponry and equipment might not be provided as internal political wrangling has delayed the setting of budgets required to fund the aid that Ukraine so desperately needs.\nWith the world’s gaze now firmly set on Gaza, Russia’s despotic president, Vladimir Putin, might be forgiven for thinking that his Christmas has come early as his hoped for “war fatigue” looks like it might be setting in across the West.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nSign up to our daily newsletter Sign up Thank you for signing up! Did you know with a Digital Subscription to Edinburgh News, you can get unlimited access to the website including our premium content, as well as benefiting from fewer ads, loyalty rewards and much more. Learn More Sorry, there seem to be some issues. Please try again later. Submitting...\nUkraine president, Volodymyr Zelensky, has admitted that his country’s counter-offensive “did not achieve the desired results” and his wife, Olena, told the BBC that her country is in “mortal danger.”\nAs the war extends into another winter, the Russian forces have taken the opportunity to dig in and have refortified their defences, planting miles of landmines, constructing huge trenches and replenishing its supply of drones.\nThere is no doubt that the war is entering a crucial phase and the reluctance of the West to supply Ukraine with the weapons and equipment it sorely needs could prove to be decisive. President Zelensky is aware that support for his country’s war effort looks as though it might be on the wane and that the very same politicians who championed Ukraine’s cause when the Russian invasion got underway are now distancing themselves from the calls for continued funding at the level needed to boost Ukraine’s chances of achieving a satisfactory outcome.\nPutin and his appeasers are salivating over recent developments in the West knowing that if Russia emerges victorious, Nato will be kneecapped as a result of the failure to ensure that Putin should not be allowed to profit from his naked, illegal, aggressive action in invading Ukraine.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nHowever, all is not lost and there is still substantial support for Ukraine in the West, despite the efforts of some right-wing politicians and lawmakers to disrupt the pipeline of weapons and equipment. Speaking on Monday, US Defense Secretary, Lloyd Austin, said: “Despite his crimes and despite his isolation, Putin still believes that he can outlast Ukraine and that he can outlast America, but he is wrong… America’s commitments must be honoured.”\nAs President Zelensky does the rounds in the USA meeting up with President Joe Biden and House of Representatives Speaker, Mike Johnson, as he renews his calls for continued assistance, Ukrainians will be holding their breath as they await the outcome of the budgetary hold ups. Such is the nature of politics, and it has long been anticipated that this stage might be reached and the West’s resolve would be put to the test. Putin knows that the decisions made in the USA and the European Union will go a long way to determining the outcome of the war – but there is still a realistic chance that his ambitions will not be realised and that funding will soon be resumed.", "source_domain": "www.edinburghnews.scotsman.com", "text": null, "title": "West must not abandon Ukraine in its hour of need - Steve Cardownie", "title_page": null, "title_rss": null, "url": "https://www.edinburghnews.scotsman.com/news/opinion/columnists/west-must-not-abandon-ukraine-in-its-hour-of-need-steve-cardownie-4442715"}