{"authors": ["Stephen M. Lepore", "Stephen M. Lepore For Dailymail.Com"], "date_download": "2024-02-05 15:27:28", "date_modify": "None", "date_publish": "2023-12-13 23:59:15", "description": "The plot was discovered on September 1, several weeks before the shock attack on Israel that killed over 1,200 people and has launched a new wave of tensions and war in the Middle East.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12861503%2FBoy-13-arrested-charged-planning-mass-shooting-Temple-Israel-synagogue-Ohio.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/13/23/78937487-0-image-a-8_1702511941447.jpg", "language": "en", "localpath": null, "maintext": "A 13-year-old boy has been arrested and charged with planning a mass shooting at an Ohio synagogue.\nThe plot was discovered on September 1, several weeks before the shock Hamas attack on Israel that killed over 1,200 people and has launched a new wave of tensions amid war in the Middle East.\nThe child, who has not been identified, allegedly put together a 'detailed plan' to complete the mass shooting at Temple Israel in Canton, police said.\nPlans were tipped off to law enforcement after they were discovered on the online chatting service Discord.\nThe Stark County Sheriff's Office immediately investigated and alerted several individuals and agencies within the school system.\nA 13-year-old boy has been arrested and charged with planning a mass shooting at a synagogue in Ohio\nRabbi David Komerofsky of Temple Israel has declined to speak about the case because the incident involves a child.\nThe unnamed minor has been charged with inducing panic and disorderly conduct.\nThe boy's trial is set for December 20 in Stark County Family Court.\nWhile the plot was discovered over a month before the attacks in Israel, it's announcement comes amid a rise antisemitic hate across America.\nIn November, the Anti-Defamation League announced that antisemitism has increased by a staggering 388 percent since Hamas' October 7 assault.\nThe ADL Center on Extremism said preliminary data showed 312 reported U.S. anti-Semitic incidents from Oct. 7 to Oct. 23, including harassment, vandalism and assault.\nIn the same period of 2022, ADL recorded 64 U.S. anti-Semitic incidents, of which four were linked to Israel.\nAntisemitism was already rising in the U.S. before the war. Nearly 3,700 anti-Semitic incidents were recorded in 2022, more than in any year since ADL began tracking the issue in 1979.\nThe plot was discovered on September 1, several weeks before the attack on Israel that killed over 1,200 people and has launched a new wave of tensions and war in the Middle East\nThe child, who has not been identified, allegedly put together a 'detailed plan' to complete the mass shooting at Temple Israel in Canton, police said\nRabbi David Komerofsky of Temple Israel has declined to speak about the case because the incident involves a child\nJonathan Greenblatt, who is also the director of the advocacy group, told The Sunday Show that his group has seen attacks on everyday businesses that are run by Jewish people, in addition to attacks on individuals and places of worship.\n'I'm not talking about stores producing IDF [Israel Defense Forces] T-shirts; I'm talking about a coffee shop on Long Island, an ice cream parlor in the Bay Area, a restaurant in Chicago,' he said.\n'Antisemitism has been intensifying and increasing. We've seen it normalized, and from the far-right and from the hard left,' Greenblatt added.\nGreenblatt also raised the issue of the spate of anti-Semitic incidents that have taken place on campuses of Ivy-league colleges including Harvard and Cornell.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Boy, 13, is arrested and charged with planning a mass shooting at Temple Israel synagogue in Ohio - as police were tipped off after posts on Discord", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12861503/Boy-13-arrested-charged-planning-mass-shooting-Temple-Israel-synagogue-Ohio.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}