{"authors": ["Kamal Sultan", "Kamal Sultan For Mailonline"], "date_download": "2024-02-05 15:27:30", "date_modify": "None", "date_publish": "2023-12-13 05:50:05", "description": "Several of the servicemen were killed by an explosive device, while the remaining soldiers were gunned down by Hamas fighters after being cut off from the rest of their troop, according to Israeli media.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12858091%2Fisraeli-soldiers-killed-gaza-idf-hamas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/13/05/78754787-0-BEIT_LAHIA_More_than_16_200_Palestinians_and_at_least_1_200_Isra-a-29_1702446565349.jpg", "language": "en", "localpath": null, "maintext": "Ten Israeli soldiers, including a high-ranking official, were killed while fighting Hamas forces in the Gaza strip yesterday.\nLieutenant Colonel Tomer Grinberg, 35, Major Roei Meldasi, 23, Major Moshe Avram Bar-On, 23, Sergeant Achia Daskal, 19, Captain Liel Hayo, 22, Major Ben Shelly, 26, Major Rom Hecht, 20, Sergeant Oriya Yaakov, 19, Eran Aloni, 19, and Itzhak Ben Basat, 24, died amid battles in Gaza City's Shajaiya neighbourhood.\nSeveral of the servicemen were killed by an explosive device, while the remaining soldiers were gunned down by Hamas fighters after being cut off from the rest of their troop, according to Israeli media.\nIt marks the worst loss of life in a single day for the Israeli Defense Forces since they launched their operation in response to Hamas' ruthless October 7 attacks.\nAt least 115 Israeli soldiers have died since ground operations began in Gaza in late October.\nBut 18,412 Palestinians have been killed during the Israeli attacks since the war began, according to the Gaza Health Ministry.\nLieutenant Colonel Tomer Grinberg, 35, (left) and Captain Liel Hayo, 22 (right) were among those killed in the northern Gaza strip on Tuesday\nMajor Moshe Avram Bar-On, 23, (left) and Major Roei Meldas, 23, (right) were killed in battle\nStaff Sergeant Oriya Yaakov, 19, and Sergeant Achia Daskal, 19, died in the fight against Hamas forces\nMajor Ben Shelly, 26 and Major Rom Hecht, 20, died in the incident in the Shahja'iya neighborhood\nFive of the Israeli soldiers killed in battle in the northern Gaza strip were in the Golani Brigade, including Lieutenant Colonel Grinberg who was the commander of the 13th Battalion.\nMajor Meldasi, a company commander in the 13th Battalion, Major Bar-On a company commander in the 51st Battalion, Sergeant Daskal a fighter in the 51st Battalion and Captain Hayo a platoon commander in the 51st Battalion were also killed.\nMajor Shelly and Major Rom Hecht of the Special Rescue Tactical Unit died in the same battle in the Shahja'iya neighborhood.\nThe IDF also announced that Sergeant Yaakov a fighter in Battalion 614, the School of Combat Engineering lost his life in the northern Gaza strip.\nHamas fighters opened fire at the Golani forces in the area on Tuesday before the Israeli soldiers approached the source of the shooting.\nA explosive device was then detonated and several soldiers were wounded by the explosion and contact was lost.\nOther Israeli forces attempted to rescue the servicemen with the help of the air force and artillery but a second bomb was detonated. A third force attempted to locate the disconnected soldiers who were hurt in the battle.\nIt comes as Israeli media revealed 13 IDF casualties were caused by friendly fire.\nAnother six died following accidents related to 'weaponry, machinery, trampling' with one death caused by firing irregularities.\nSoldiers killed by friendly fire were mistakenly identified during airstrikes or died during tank shelling and gunfire, according to Times of Israel.\nOne soldier reportedly died in gunfire that was not intended to strike them and another two died in accidental misfires.\nThe Israeli military has announced that 10 soldiers including a high-ranking official have been killed while fighting Hamas forces in the Gaza strip\nThe servicemen were killed in a battle in the northern Gaza strip and another three seriously wounded as the war between Israel and Hamas rages on for the 67th day\nIsraeli forces pose in a car as they get prepared before entering the Gaza Strip for an attack in Nahal Oz, Israel on December 12, 2023\n18,412 Palestinians have been killed during the Israeli attacks since the war began, according to the Gaza Health Ministry\nAt least 115 Israeli soldiers have died since ground operations began in Gaza in late October\nWhile two soldiers lost their lives in incidents after armored vehicles ran over troops, and two more were killed by shrapnel.\nThe Israeli military has begun pumping seawater into Hamas's network of tunnels across the Gaza Strip, according to a report, as it aims to flush the terrorists out of their underground lair.\nIsrael is said to have installed at least five pumps about a mile from the Al-Shati refugee camp in the north of the coastal enclave that could move thousands of cubic meters of water per hour, flooding 300 miles of tunnels.\nUS officials have now revealed that the operation has begun, with the Biden administration being told that it will take weeks, according to a report in the Wall Street Journal.\nAsked about the report, the Israeli Defense Force's chief of staff Lt Gen Herzi Halevi appeared to to confirm the news, telling a press conference that employing water pumps to make tunnels inoperable would be a 'good idea'.\nBut it comes amid fears that Hamas is harboring Israeli hostages in the labyrinth of passages and that the tactic could prove fatal for those trapped inside, with families continuing to pressure the government to bring them home before it is too late.\nThe IDF announced on Tuesday that it had recovered the bodies of two Israelis taken hostage on October 7 - 27-year-old Eden Zacharia who had been taken from the Nova Festival and army Warrant Officer Ziv Dado, 36.\nArmy spokesman Daniel Hagari said 135 hostages remain in Gaza, as their families tirelessly campaign for them to be brought home immediately.\nImages released recently by the IDF last week appear to show scores of Israeli soldiers setting up a series of black pipes on the sandy beaches of Gaza, apparently to pump water from the Mediterranean.\nVideo shared by Israeli media also appears to show IDF soldiers working on the pipes while underground.\n'We are seeing a lot of underground infrastructure in Gaza, we knew there would be a lot. Part of the goal is to destroy this infrastructure,' Lt Gen Halevi said on Tuesday.\n'We have various ways [to deal with the tunnels]. I won't talk about specifics, but they include explosives to destroy, and other means to prevent Hamas operatives from using the tunnels to harm our soldiers.'\nFive of the Israeli soldiers killed in battle in the northern Gaza strip were in the Golani Brigade, including Lieutenant Colonel Grinberg who was the commander of the 13th Battalion\nMajor Shelly and Major Rom Hecht of the Special Rescue Tactical Unit (669) died in the same battle in the Shahja'iya neighborhood\nAt least 115 Israeli soldiers have died since its ground offensive in the Gaza strip began in late October\nAt least 20 of them were caused by accidents with 13 caused by friendly fire or internal fire from its own troops\nAs Israel pushes further into the depths of Hamas's stronghold in Gaza, Israel Defense Forces troops battled terrorists above ground while the air force bombed more targets in the devastated Gaza Strip.\nBut more than two months into the war sparked by the Palestinian group's unprecedented October 7 attack, Israel's staunchest ally warned it risked losing backing over the terrible humanitarian toll in Gaza, which the United Nations likened to 'hell on earth'.\nPresident Joe Biden said Israel had 'most of the world supporting it' after the October 7 attack, which according to Israeli officials killed around 1,200 people, mostly civilians, and took 240 hostages.\nBut in his most blunt remarks since the war began, Biden said Israel was starting to lose that support 'by the indiscriminate bombing that takes place'.\nIsrael's retaliatory military campaign in Gaza to destroy Hamas has left dead 18,412 people, mostly women and children, according to the Hamas-run health ministry.\nIsraeli Prime Minister Benjamin Netanyahu must also 'change' his stance on a two-state solution for the Palestinians, Biden added.\nNetanyahu said there was 'disagreement' with Biden over how a post-conflict Gaza would be governed, reflecting a rare rift after weeks in which the US leader has strongly backed Israel.\nBiden's comments came before the UN General Assembly overwhelmingly backed a non-binding resolution on Tuesday demanding an immediate humanitarian ceasefire in Gaza, a call that has so far paralyzed the Security Council.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Ten Israeli soldiers aged 19 to 35, including a high-ranking battalion commander, are killed and three injured in worst loss of life for the IDF in a single incident since Gaza war broke out", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12858091/israeli-soldiers-killed-gaza-idf-hamas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}