{"authors": [], "date_download": "2024-02-05 15:27:33", "date_modify": "None", "date_publish": "2023-12-12 08:16:01", "description": "Israel and the United States are increasingly isolated as they face global calls for a cease-fire in Gaza, including a non-binding vote expected to pass at the United Nations later on Tuesday", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-hamas-israel-palestinians-b2462484.html.json", "image_url": "https://static.independent.co.uk/2023/12/12/08/APTOPIX_Israel_Palestinians_66263.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael and the United States were increasingly isolated as they faced global calls for a cease-fire in Gaza, including a non-binding vote expected to pass at the United Nations later on Tuesday. Israel has pressed ahead with an offensive against Gaza's Hamas rulers that it says could go on for weeks or months.\nThe war ignited by Hamas' Oct. 7 attack into southern Israel has already brought unprecedented death and destruction to the impoverished coastal enclave, with more than 18,000 Palestinians killed, mostly women and minors, and over 80% of the population of 2.3 million having fled their homes.\nMuch of northern Gaza has been obliterated, and hundreds of thousands have fled to ever-shrinking so-called safe zones in the south. The health care system and humanitarian aid operations have collapsed in large parts of Gaza, and aid workers have warned of starvation and the spread of disease among displaced people in overcrowded shelters and tent camps.\nStrikes overnight and into Tuesday in southern Gaza — in an area where civilians have been told to seek shelter — killed at least 23 people, according to an Associated Press reporter at a nearby hospital.\nIn northern Gaza, the aid group Doctors Without Borders said a surgeon in the Al-Awda hospital was wounded Monday by a shot from outside the facility, which it says has been under “total siege” by Israeli forces for a week. There was no immediate comment from the military.\nIn a briefing with The Associated Press on Monday, Israeli Defense Minister Yoav Gallant refused to commit to a firm timeline, but signaled that the current phase of heavy ground fighting and airstrikes could stretch on for weeks and that further military activity could continue for months.\nHe said the next phase would be lower-intensity fighting against “pockets of resistance” and would require Israeli troops to maintain their freedom of operation. Prime Minister Benjamin Netanyahu has said Israel will maintain security control over Gaza indefinitely.\nThe U.N. secretary-general and Arab states have rallied much of the international community behind calls for an immediate cease-fire. But the U.S. vetoed those efforts at the U.N. Security Council last week as it rushed tank munitions to Israel to allow it to maintain the offensive.\nA non-binding vote on a similar resolution at the General Assembly scheduled for Tuesday would be largely symbolic.\nCRUSHING HAMAS SEEN AS ‘TALL ORDER’\nIsrael and its main ally, the U.S., argue that any cease-fire that leaves Hamas in power, even over a small part of the devastated territory, would mean victory for the militant group, which has governed Gaza since 2007 and has pledged to destroy Israel.\nBut many experts consider Israel's aims to be unrealistic, pointing to Hamas' deep base of support in both Gaza and the occupied West Bank, where it is seen by many Palestinians as resisting Israel's decades-old military rule.\n“Destroying Hamas, even its military capability — Israeli leaders’ chief war aim — will be a tall order without decimating what remains of Gaza,” said the Crisis Group, an international think tank, in a report over the weekend that also called for an immediate cease-fire.\nGallant said Israel has already inflicted heavy damage on Hamas, killing half the group's battalion commanders and destroying many tunnels, command centers and other facilities.\nThe Israeli military said Tuesday that its aircraft targeted rocket launching posts throughout Gaza and that ground troops has found 250 rockets, mortar shells and rocket-propelled grenade launchers in a raid.\nIsraeli officials have said some 7,000 Hamas militants — roughly one-quarter of the group’s estimated fighting force — have been killed and that 500 militants have been detained in Gaza the past month, claims that could not be verified. At least 104 Israeli soldiers have been killed in the Gaza ground offensive, the army says.\nGallant said that in northern Gaza, Hamas has been reduced to “islands of resistance,” while in the south, where Israel expanded ground operations earlier this month, “they are still organized militarily.”\nHamas says it still has thousands of reserve fighters — another unverified claim — and on Monday it fired a barrage of rockets that wounded one person and damaged cars and buildings in a Tel Aviv suburb. The attack set off sirens in the city, where Gallant's office and the military headquarters are located.\nCIVILIAN PLIGHT WORSENS\nIsrael launched the campaign after Hamas broke through its defenses and militants streamed into the south on Oct. 7, killing some 1,200 people and seizing about 240 others. More than 100 hostages, mostly women and children, were freed during a cease-fire last month in exchange for Israel's release of 240 Palestinian prisoners.\nTwo months of airstrikes, coupled with a fierce ground invasion, have resulted in the deaths of over 18,000 Palestinians, according to health officials in the Hamas-run territory. They do not give a breakdown of civilians and combatants but say roughly two-thirds of the dead are women and minors.\nThe actual toll is likely higher, as thousands are missing and feared dead under the rubble, and efforts to maintain the count have been hindered by the collapse of the health sector in the north.\nIsrael blames civilian casualties on Hamas, saying it positions fighters, tunnels and rocket launchers in dense urban areas, using civilians as human shields.\nWith Israel allowing little aid into Gaza and the U.N. largely unable to distribute it amid the fighting, Palestinians face severe shortages of food, water and other basic goods.\nIsrael has urged people to flee to what it says are safe areas in the south, and fighting in and around the southern city of Khan Younis — Gaza's second largest — has pushed tens of thousands toward the city of Rafah and other areas along the border with Egypt.\nBut Israel has also continued to strike what it says are militant targets in so-called safe zones. Most of the 23 dead brought into the Rafah hospital overnight were from three families, hospital records show.\n___\nMagdy reported from Cairo. Associated Press writer Tia Goldenberg in Tel Aviv, Israel contributed.\n___\nFull AP coverage at https://apnews.com/hub/israel-hamas-war", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel and the US face growing isolation over Gaza as offensive grinds on with no end in sight", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-hamas-israel-palestinians-b2462484.html"}