{"authors": ["Jon Michael Raasch", "Jon Michael Raasch For Dailymail.Com"], "date_download": "2024-02-05 15:15:27", "date_modify": "None", "date_publish": "2024-01-27 15:09:04", "description": "U.S. senators are split on whether the Biden administration's military actions firing rounds of missiles into Yemen targeting Houthi militants can be defined as a war.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13011223%2Fus-missile-strikes-yemen-houthis-rebels-declaration-war.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/26/19/80517619-0-image-a-30_1706296312582.jpg", "language": "en", "localpath": null, "maintext": "U.S. senators are split on whether the Biden administration's military actions firing rounds of missiles into Yemen targeting Houthi militants can be defined as a war.\nOver the past week, American and British military forces have launched multiple rounds of airstrikes into Yemen in response to Houthi attacks on civilian and military vessels traveling through the Red Sea.\nBut the U.S. Constitution requires congressional approval for a full-out war, muddying the waters on how to define the ongoing conflict in the Middle East.\nThe U.S. is 'probably not' at war 'at this stage' Missouri Sen. Josh Hawley told DailyMail.com.\n'If there's a military objective here, I'd love to hear what it is. But so far, we've heard nothing,' he added. 'I can't tell what Joe Biden's position is or what his policy is, I have no idea.'\n'If the goal is just to deter any further aggression, well, that clearly hasn't worked,' the Republican continued. 'Now, [Biden] says the goal is to degrade their military capability and keep the sea lanes open.'\n'We ought to be going to our Gulf partners and European allies and saying, 'you guys need to keep the sea lanes open.''\nHouthi rebels in Yemen have gathered for rallies and parades since the conflict began\nSen. Richard Blumenthal said that the U.S. is not at war with Houthis in Yemen\nOne of his Republican colleagues, however, believes the U.S. is currently at war.\n'Yea I would say that it's escalated to war between us and Yemen,' Sen. Tommy Tuberville told DailyMail.com.\n'You'd got to call it some type of war. It's not a conflict, it is a survival contest for our ships going up and down the Red Sea,' Tuberville continued.\nOther senators did not characterize the ongoing conflict as an all-out war.\n'We're defending our interests,' Sen. Alex Padilla said.\nThough, the Californian added, he is looking forward to being briefed on Biden's rationale for taking unilateral action.\n'Our strikes on the Houthis to defend vessels, our own and other commercial ships, are self defense within the President's constitutional prerogative,' Sen. Richard Blumenthal told DailyMail.com.\n'I don't see a need for a declaration of war under Congress' constitutional authority.'\nCalling the conflict a war is 'semantics,' Pennsylvania Sen. John Fetterman said, adding that he fully supports the strikes.\n'Blow them up,' he told DailyMail.com. 'They cannot be allowed to attack our assets.'\nAnother Democrat, New Jersey Sen. Cory Booker, expressed hesitation over Biden's decision to bomb the Middle Eastern country.\n'I've expressed concern under Obama, under Trump and under Biden about the role of Congress when it comes to the strikes we've seen over the 10 years that I've been here,' he said.\n'I have concerns about congressional authority, and Congress' role, as we are continuing to often justify strikes, using authorizations for military force from long time ago,' he told DailyMail.com.\n'That said, Iran and their proxies in that region have been doing things that have undermined the international order and peace and security, and are a real threat of that has to be addressed,' Booker said.\nSen. Joni Ernst of Iowa, a combat veteran, clearly stated the U.S. is not at war.\nU.S. Naval forces have shot down numerous anti-ship ballistic missiles since November\nThe Houthi rebels fired a missile at the USS Carney in the Gulf of Aden on Friday\nRepublican Sen. Tommy Tuberville, however, did say that the U.S. is at war in the Middle East\n'It's all defensive thus far,' she told DailyMail.com. 'So now we have to keep an eye on Iran. They are the ones that are backing the Houthis and they need to stop striking at our American troops and out bases. Its got to stop.'\nBut when asked what the endpoint of the military engagement will be she admitted: 'I don't know.'\nThe Houthis have continuously targeted ships in the area since November, saying they were avenging Israel's war in Gaza against Hamas. However, the rebels have frequently targeted ships with unclear links to Israel, in turn jeopardizing a crucial global trade route.\nOn Friday, Houthi rebels fired an anti-ship ballistic missile at the USS Carney, a U.S. naval destroyer in the Gulf of Aden that has been in the area since November, according to U.S. Central Command.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Is the U.S. at WAR in the Middle East? Senators are split on whether repeated missile strikes targeting Houthis rebels in Yemen can be labeled a 'conflict' or declaration of war", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13011223/us-missile-strikes-yemen-houthis-rebels-declaration-war.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}