{"authors": [], "date_download": "2024-02-05 15:27:42", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukraine is in ?mortal danger? without billions more dollars from Washington, Elena Zelenskaya told the BBC\r\n\r\n\r\nUkraine “will die”", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274060054%2Fzelenskys-wife-pleads-for-more-us-cash.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1702145626.jpg", "language": "en", "localpath": null, "maintext": "Ukraine is in ?mortal danger? without billions more dollars from Washington, Elena Zelenskaya told the BBC\nUkraine \"will die\" without continued US military aid, President Vladimir Zelensky's wife, Elena Zelenskaya, has told the BBC. Zelenskaya's plea came a day after US Republicans shot down a bill that would have given Kiev more than $60 billion worth of arms, ammunition, and training.\nIn an interview taped on Thursday, Zelenskaya told the British broadcaster that she sees \"signs that the passionate willingness to help [Ukraine] may fade.\"\nOne day earlier, Republicans in the US Senate blocked a $110 billion spending bill that would have allocated $61 billion in military aid to Ukraine, as well as more than $10 billion to Israel and $13.6 billion to secure the US' southern border. Republicans argue that the border funding does not go far enough, and want the bill to include substantial changes to immigration law.\nWith Congress deadlocked and public support for President Joe Biden's Ukraine policy faltering, Zelenskaya implored the West to keep the weapons flowing.\n\"We really need the help. In simple words, we cannot get tired of this situation, because if we do, we die,\" she said. \"And if the world gets tired, they will simply let us die.\"\nThe US has allocated a total of $113 billion in Ukraine-related funding since Russia's military operation began in February 2022. This figure includes almost $45 billion in military aid to Kiev, as well as humanitarian and economic aid, and funding for various US government agencies.\nThis unprecedented outlay has failed to swing the conflict in Ukraine's favor, with Kiev's much vaunted summer counteroffensive ending in a near-total failure to recapture any territory from Russian forces, as well as the loss of over 125,000 troops and 16,000 heavy weapons, according to the latest figures from the Russian Defense Ministry.\nNevertheless, Biden's State Department has denied rumors that it may push Ukraine toward a peace deal with Russia, and Biden himself has pledged to keep bankrolling the Ukrainian military. The president stated this week that he would be open to meeting some of the GOP's immigration demands, before warning that a defeated Ukraine would lead to a Russian attack on NATO and \"American troops fighting Russian troops.\"\nRussian ambassador Anatoly Antonov condemned Biden's words as \"provocative rhetoric unacceptable for a responsible nuclear power.\"\nHowever, Biden's words appear to mark his administration's latest tactic in trying to convince Republicans to back the aid bill. Former Fox News host Tucker Carlson claimed on Thursday that Defense Secretary Lloyd Austin told Republican lawmakers that \"we'll send your uncles, cousins and sons to fight Russia\" if they continue to block funding for Kiev.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Zelensky's wife pleads for more US cash", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274060054/zelenskys-wife-pleads-for-more-us-cash"}