{"authors": ["Juliana Cruz Lima"], "date_download": "2024-02-05 15:27:43", "date_modify": "None", "date_publish": "2023-12-12 22:59:03", "description": "THIS is the dramatic moment an IDF assassin appears to kill a Hamas terrorist at point-blank range as another threw a grenade at him.Headcam footage s", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25032994%2Fmoment-idf-assassin-hamas-shoots-terrorist-point-blank%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/newspress-collage-lccr7gg19-1702421855620.jpg?1702421880&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "THIS is the dramatic moment an IDF assassin appears to kill a Hamas terrorist at point-blank range as another threw a grenade at him.\nHeadcam footage shared by the Israeli Defense Forces claims to show the intense scenes at the terror lair apartment in Gaza City.\n4 An Israeli soldier exchanges fire with Hamas terrorists in a video shared by the IDF Credit: Twitter\n4 The dramatic scenes reportedly took place at an apartment in Gaza City Credit: Twitter\n4 This is the moment where the IDF trooper is claimed to have 'killed' a Hamas terrorist 'at point-blank range' Credit: Twitter\nOnly 11 seconds into the clip, shots are exchanged as the Israeli soldier makes his way into the flat, located in the neighbourhood of Sajaiya.\nThe trooper, a reservist from the Yalam unit of the Combat Engineering Corps, comes across two apparent terrorists who can't be seen properly as smoke takes over the apartment.\nSharing the action-packed video, IDF spokesperson Rear Admiral Daniel Hagari tweeted: \"As part of the battles in Sajaiya, a reservist from the Yalam unit of the Combat Engineering Corps encountered two terrorists at point blank range.\n\"After eliminating the first terrorist and being injured by throwing grenades at him, the fighter acted calmly, conducted a firefight while striving for contact and eliminated another terrorist who was staying in the building.\"\nIt comes as the body of a Hamas hostage who was killed in captivity has been recovered from Gaza, according to the IDF.\nEden Zacharia, 28, was kidnapped from the Supernova music festival by the terror group on the horror October 7 bloodbath.\nShe was leaving the desert rave with her boyfriend and friends when terrorists began shooting at their car, later taking her hostage, The Times of Israel reported.\n“She said they were on their way home,” her mother said.\nAmid that frantic phone call, Eden received a call from her dad.\nWhen she returned to the line with her mother, she was shouting, “They’re shooting us, they’re really close!”\nThe 28-year-old's death was reportedly confirmed today as IDF troops retrieved her body from Gaza.\nIsrael has also dispatched one of its most powerful warships to the Red Sea as gun-toting rebels are turning the area into a warzone.\nThe Israeli Navy's Sa’ar 6-class corvette has been declared operational and are set to join UK, French and US vessels already deployed.\nOne of four corvettes in the Israeli iron fleet - named Ahi Magen - joined operational activities in the port of Eilat, the only Israeli port on the Red Sea.\nEach nearly 2,000-ton missile ship is outfitted with 20 systems, 18 of which are Israeli-made and staffed with around 80 sailors, The Times of Israel reported.\nIDF spokesman Rear Adm. Daniel Hagari confirmed that the corvettes attacked for the first time since they became operational.\nYemen's Iran-backed Houthi rebels have unleashed chaos in the Red Sea by blasting ships and patrolling waters on speedboats ready to hijack.\nThe Houthis control Yemen and its west coast along the Red Sea - and Iran is understood to actively arm the group.\nThey vowed to target all ships owned by Israel or flying the country's flag in the Red Sea in the wake of Hamas' horror October 7 massacre.\nThe group declared themselves part of the \"axis of resistance\" of Iran's allies and proxies and have rallied behind the Palestinians since Hamas attacked Israel.", "source_domain": "www.thesun.co.uk", "text": null, "title": "Moment IDF assassin storms outnumbered Hamas lair & shoots 'terrorist at point-blank range' mid grenade fire", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25032994/moment-idf-assassin-hamas-shoots-terrorist-point-blank/"}