{"authors": ["Emily Goodin", "Senior U.S. Political Reporter"], "date_download": "2024-02-05 15:27:45", "date_modify": "None", "date_publish": "2023-12-12 08:16:12", "description": "Zelensky will plea with Congress for a weapons package to continue his fight against Russia as nearly half of Americans say the U.S. has already spent too much on the war-torn nation.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12851509%2Fzelensky-meets-biden-ukraine-aid-package.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/11/21/78836595-0-image-a-6_1702330338860.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian President Volodymyr Zelensky will make a last-minute plea to Congress on Tuesday for a weapons package to continue his fight against Russia as nearly half of Americans say the U.S. has already spent too much on the war-torn nation.\nHis in-person visit, the third since the war began, will be his most crucial and is a sign of how dire the White House believes the situation: both to get Zelensky his funding and how critical that money is to hold off Russian forces.\nBut a Financial Times-Michigan Ross poll found that 48% of voters said the U.S. was spending 'too much' on sending financial and military aid to Ukraine. And a Pew Poll found only 31% of Americans say the same but - when broke down further - 48% of Republicans said there was too much spending on Kyiv.\nPresident Joe Biden has asked Congress for $61.4 billion for Ukraine as part of a $110 billion package that also includes money for Israel and other national security priorities.\nThe money is caught up a debate over U.S. immigration policy and border security with no sign of a deal in sight. And Congress is scheduled to leave town at the end of this week for the rest of the year.\nMany Republican lawmakers, particularly in the House, argue that enough American money has been spent on Ukraine and it's better off being spent at home. Those GOP lawmakers are trying to tie border security to the funding package for Kyiv and Israel.\nThe U.S. has already provided Ukraine $111 billion for its fight since Russian President Vladimir Putin invaded the country in February 2022.\nBut the Biden administration has warned that a failure to renew military assistance to Ukraine could tip the nearly two-year-old war in Russia's favor, creating national security threats for the West.\n'This cannot wait,' Biden said in an impassioned, televised address at the White House on Wednesday.\n'Frankly, I think it's stunning that we've gotten to this point in the first place, where Republicans in Congress are willing to give Putin the greatest gift he could hope for.'\nZelensky said he would tell Biden and lawmakers about the achievements he can see Ukraine winning in the next year.\n'I'm confident that freedom can be stronger than any of its enemies,' he said.\nZelensky will begin his day on Capitol Hill, attending an all-senators meeting after a joint invitation from Senate Democratic Leader Chuck Schumer and Senate Republican Leader Mitch McConnell. He'll then meet with House Speaker Mike Johnson.\nThen he heads to the White House for an Oval Office meeting with Biden and a joint press conference with the president.\n'This is exactly the right time to have President Zelensky in town to have these discussions because of what's going on in Ukraine, the increased activity we're seeing by the Russian armed forces as winter approaches, but also what's going on Capitol Hill,' National Security Council spokesman John Kirby said on Monday.\nUnited States President Joe Biden and President Volodymyr Zelenskyy of Ukraine at a September Oval Office meeting\nBiden's budget director Shalanda Young said on Dec. 4 that the US would run out of resources to assist Ukraine by the end of the calendar year.\nBy mid-November, the U.S. Defense Department had used 97% of $62.3 billion in supplemental funding and the State Department had used all of the $4.7 billion in military assistance funding for Ukraine it had been allocated, she noted.\nThe U.S. has supplied roughly half of the military aid to Ukraine and it's unlikely any other country could make up the difference. Additionally the U.S. has sent American weapon systems, which need U.S. ammunition.\nThe Biden administration is going all out to get Zelensky's war funded.\nSecretary of State Antony Blinken, appearing on the Sunday political talk shows, warned that the clock is ticking.\n'This is a time to really step up because if we don't, we know what happens. Putin will be able to move forward with impunity and we know he won't stop in Ukraine,' Blinken said.\nBut Republicans appeared to be standing firm ahead of Zelensky's meetings with them. The right-wing, led by 2024 presidential candidate Donald Trump, has dramatically soured against Ukraine's cause.\n'What's in America's best interest is to accept Ukraine is going to have to cede some territory to the Russians and we need to bring the war to a close,' Senator JD Vance, a close Trump ally, said Sunday.\n'If Congress needs to delay votes on the security supplemental to reach an agreement on border security, so be it. Risks from an unsecured border are simply too great,' wrote Republican Senator Deb Fischer of Nebraska on X.\nZelensky's wife is also making a plea to Europe as Hungry threats to veto a vote in the European Union to approve $50 billion in aid for Ukraine.\n'We really need the help,' Olena Zelenska told the BBC over the weekend. 'In simple words, we cannot get tired of this situation, because if we do, we die.'\nShe added: 'It hurts us greatly to see the signs that the passionate willingness to help may fade.'\nAs President Zelensky headed to Washington DC on Monday the Russian military hit Kyiv with its most intense salvo of ballistic missiles in months.\nAll eight missiles aimed at the city of 3.3 million people were shot down, the Ukrainian military said.\nIn his first public appearance in America on Monday, Zelensky warned that failure to help his country defeat Russia is fulfilling Vladimir Putin's 'dreams' of wrecking democracy in Europe.\n'Let me be frank with you, friends — if there's anyone inspired by unresolved issues on Capitol Hill, it's just Putin and his sick clique,' Zelensky told the National Defense University. 'They see their dreams come true when they see delays.'\n'When the free world hesitates, that's when dictatorships celebrate.'\n'Let me be frank with you, friends — if there's anyone inspired by unresolved issues on Capitol Hill, it's just Putin and his sick clique,' Ukrainian President Volodymyr Zelensky said\nPresident Zelensky will attend an all-senators meeting after a joint invitation from Senate Democratic Leader Chuck Schumer (left) and Senate Republican Leader Mitch McConnell (center). He'll then meet with House Speaker Mike Johnson (right)\nRussian President Putin appeared in a video circulated online Sunday where he said Ukraine will only grow weaker as Russia grows stronger and sipped champagne\nZelensky said politicians should not 'betray the soldier' as he pointed to the drying up U.S. being cheered by Putin.\n'You can count on Ukraine and we hope just as much to be able to count on you,' Zelensky said. 'Putin must lose.'\nHis warning came ahead of his meeting with Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs of Staff General Charles Brown at the National Defense University.\nHe wore his trademark army style green sweatshirt, emblazoned with the words 'I'm Ukrainian,' and flew into Washington after a round of diplomacy this weekend in Argentina.\nPutin, meanwhile, appeared in a video circulated online Sunday where he said Ukraine will only grow weaker as Russia grows stronger.\n'When you don't have your own foundations, you don't have your own ideology, you don't have your own industry, you don't have your own money,' he said, holding a glass of champagne in his hand. 'You don't have anything that's your own. Then you don't have a future, but we have a future.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Zelensky's last-ditch plea to save $44B US aid package: Ukrainian president prepares to meet Biden and speak to Congress as Republicans and more Americans grow more skeptical about giving more money t", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12851509/zelensky-meets-biden-ukraine-aid-package.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}