{"authors": ["Reged Ahmad", "Richard Luscombe", "Martin Belam", "Sammy Gecsoyler"], "date_download": "2024-02-05 15:27:51", "date_modify": "None", "date_publish": "2023-12-12 01:21:24", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F11%2Fisrael-gaza-war-live-updates-hamas-hostages-warning-palestine-idf-un-emergency-meeting.json", "image_url": "https://i.guim.co.uk/img/media/5cae7b510b470d0100a34da42402a32464859553/0_168_3280_1968/master/3280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5cfe1e2c1de5c07a5d0ea6fb7a7ccb6c", "language": "en", "localpath": null, "maintext": "From 11 Dec 2023 18.10 CET White House 'concerned' by reports Israel military is using white phosphorus The White House says it is “concerned” over new reports that Israel used US-supplied white phosphorus in a bombing attack in Lebanon that injured civilians and burned down houses. John Kirby, strategic communications coordinator for the National Security Council, has just been briefing reporters aboard Air Force One, and was asked about the allegations. Israel has previously denied it uses white phosphorus, which critics say put civilians at risk of serious and long-term injury, and is banned from use in civilian areas. On at least three occasions, 10, 11 and 16 October, Israel launched attacks in southern Lebanon, with Human Rights Watch posting links to video of “155mm white phosphorus artillery projectiles being used, apparently as smokescreens, marking or signaling”. Kirby said the Biden administration would be raising the new report with Israel’s government: We’ve seen the reports, we’re certainly concerned about that. We’ll be asking questions and trying to learn a little bit more. It’s important to remind that white phosphorus does have a legitimate military utility in terms of illumination and reducing smoke to conceal movements. And obviously any time that we provide items like white phosphorus to another military, it is with full expectation that it’ll be used for legitimate purposes and in keeping with the law of armed conflict.\nUpdated at 19.35 CET\n12 Dec 2023 02.21 CET Summary It’s after 3:21am in Gaza and Tel Aviv and this blog is now closing. But first, here’s a summary of the key moments today. Israel’s defense minister Yoav Gallan on Monday said the next phase of the war in Gaza would be lower-intensity fighting against “pockets of resistance” and would require Israeli troops to maintain their freedom of operation, according to the Associated Press. “That’s a sign the next phase has begun,” he said. He’s pushed back against international calls to wrap up the country’s military offensive in the Gaza Strip, saying the current phase of the operation against the Hamas militant group will “take time.” In a briefing with the Associated Press, Gallant refused to commit to any firm deadlines, but he signaled that the current phase, characterised by heavy ground fighting backed up by air power, could stretch on for weeks and that further military activity could continue for months.\nThe White House said it is “concerned” over reports that Israel’s military is using white phosphorus bombs against target in Lebanon. At a morning briefing, John Kirby , strategic communications coordinator for the national security council, said use of the highly incendiary substance could legally be used for a smokescreen to conceal military operations, but that the US would seek clarification from Israel about how stocks were being used.\nIsrael’s defense minister Yoav Gallant gave a fleeting and noncommittal answer when asked at his Monday briefing about reports the country was using white phosphorus in military attacks. The Israeli Defense Forces operate “according to international law”, he said.\nGallant also said Israel had “no intention” of staying permanently in Gaza after the completion of its military campaign to eliminate Hamas. The country was open to discuss alternatives about who will control the territory as long as it is not a group hostile to Israel, he said, and would consider an agreement with Hezbollah in Lebanon if security guarantees were received.\nIsrael will open the Kerem Shalom crossing into Gaza on Tuesday in an attempt to speed the security screening of humanitarian aid. A spokesperson for Cogat, the Israeli government department responsible for coordinating activities in the territories, said all aid will still enter via the Rafah crossing in Egypt, but the move to increase screening capacity will double the amount getting in.\nEuropean leaders Leo Varadkar of Ireland, Pedro Sanchez of Spain, Robert Abela of Malta and Alexander De Croo of Belgium, wrote to EU president Charles Michel calling for a discussion about a Gaza ceasefire at the union summit on 14 and 15 December. US network CNN said the letter expressed “alarm” over the deteriorating humanitarian situation in Gaza and questions Israel’s military campaign and its effect on the civilian population.\nThe Hamas-run Gaza health ministry updated casualties since the start of the Israel-Hamas war on 7 October, stating that 18,205 Palestinians have been killed, and 49,645 injured. The reported death toll has risen by more than 500 in the two days from Saturday, when it stood at 17,700, the ministry said.\nQatar has spoken with Israel to gauge interest in talks about a possible new pause in the fighting in Gaza, according to a journalist for Axios. The report directly contradicts the position of diplomats at the annual Doha Forum conference in Qatar, who have said they are not expecting any reopening of Gaza ceasefire talks for some weeks.\nAt least 52 people were arrested in Washington DC on Monday at a protest calling for the US to push for a permanent ceasefire between Israel and Hamas. Activists representing the US Campaign for Palestinian Rights, Jewish Voice for Peace and other groups briefly protested in a Senate office building before police ended the demonstration and took dozens into custody.\nItaly, France and Germany called on the European Union to impose ad hoc sanctions against Hamas and its supporters. “We express our full support for the … proposal to create an ad hoc sanctions regime against Hamas and its supporters,” they said in a letter to the EU’s foreign policy chief, Josep Borrell.\nFrance is also considering imposing national sanctions on those involved in illegal Israeli settlements in the occupied West Bank, the French foreign minister, Catherine Colonna , has said.\nFighting continued on the ground in the Gaza Strip, accompanied by repeated aerial bombardments from Israel. Rockets have also been fired into Israel from Gaza, and from anti-Israeli forces in Lebanon. Some of the heaviest close-quarters fighting in more than two months of conflict took place over the weekend, as the Israel Defense Forces tried to consolidate control of urban centres in northern Gaza and pursued Hamas leaders in the heart of the biggest city in the south, Khan Younis.\nHarvard University’s governing board faced mounting pressure on Monday to publicly declare support for, or oust the university president, according to a report by Reuters. It follows remarks she made last week at a congressional hearing on antisemitism.\nIsrael told the UN that it “must do better” at delivering aid to people in Gaza. The country said it was willing to double the number of inspections, but that “aid keeps waiting at the entrance of Rafah”. Since 7 October Israel has essentially blockaded Gaza, including at times cutting off telecommunications. The Rafah crossing with Egypt is the only entrance or exit to Gaza that has been open with any regularity, and Israel insists on inspecting all cargo being sent into the territory\n12 Dec 2023 02.08 CET Read our piece on how the Palestinian Keffiyeh has become a global symbol, by Niloufar Haidari: Last month, three college students in Burlington, Vermont, were walking home after Thanksgiving – their second in the US, after applying to study abroad from their homes in the West Bank in 2021. According to police, the trio – Hisham Awartani, Kinnan Abdalhamid and Tahseen Ahmed – were allegedly approached by Jason J Eaton, who, without saying a word, began firing rounds from a pistol at them. Eaton did not know the students; all he could see was that two of them were wearing the keffiyeh, the black and white scarf that has been indelibly linked with Palestinian struggle for over half a century. See below for the rest of Niloufar’s piece: From Yasser Arafat to Madonna: how the Palestinian keffiyeh became a global symbol Read more\n12 Dec 2023 01.53 CET Aid agencies say hunger is worsening among Palestinians in the besieged Gaza Strip. The UN World Food Programme has said half of the population is starving. “Hunger stalks everyone,” UNRWA, the UN body responsible for Palestinian refugees, said on X. “Too many people haven't eaten now for two, three days in the #GazaStrip”@UNRWA colleagues are doing everything they can with what little they have - but food, water and fuel are being systematically used as weapons of war in📍#Gaza\nHunger stalks everyone. https://t.co/PU3WcVuxOP — UNRWA (@UNRWA) December 11, 2023 It is as the United Nations General Assembly is preparing to vote on Tuesday on an immediate humanitarian ceasefire in the two-month-old conflict between Israel and Hamas. The 193-member General Assembly is likely to pass a draft resolution, Reuters reports, that mirrors the language of one that was blocked by the United States in the 15-member Security Council last week.\n11 Dec 2023 00.52 CET Our Gaza diary, part 33, details moments in the life of Ziad, a 35-year-old Palestinian living in Gaza: 2am My exhausted brain refuses to stop thinking about all the bad scenarios that I, my loved ones, and all Gazans face if this nightmare does not end soon. I got brief and temporary access to the internet, and I unintentionally saw videos and photos of horrible things Gazans are going through. They made me realise that death could be a merciful fate. Awake and terrified, I knew it was going to be another long night. Read the rest of his experience of the war here: Gaza diary part 33: ‘These days I am afraid of checking my phone’ Read more\n11 Dec 2023 00.34 CET It’s 1:33am in Gaza and Tel Aviv. Reged Ahmad here picking up the blog from Richard Luscombe. Israel’s defense minister on Monday pushed back against international calls to wrap up the country’s military offensive in the Gaza Strip, saying the current phase of the operation against the Hamas militant group will “take time.” Yoav Gallant is a member of Israel’s three-man war cabinet. In a briefing with the Associated Press, Gallant refused to commit to any firm deadlines, but he signaled that the current phase, characterised by heavy ground fighting backed up by air power, could stretch on for weeks and that further military activity could continue for months. “We are going to defend ourselves. I am fighting for Israel’s future,” he said. Gallant said the next phase would be lower-intensity fighting against “pockets of resistance” and would require Israeli troops to maintain their freedom of operation. “That’s a sign the next phase has begun,” he said.\n11 Dec 2023 00.02 CET Summary It’s 1am on Tuesday in Tel Aviv, Jerusalem and Gaza City. Here’s are the main developments in the Israel-Gaza war: The White House said it is “concerned” over reports that Israel’s military is using white phosphorus bombs against target in Lebanon. At a morning briefing, John Kirby , strategic communications coordinator for the National Security Council, said use of the highly incendiary substance could legally be used for a smokescreen to conceal military operations, but that the US would seek clarification from Israel about how stocks were being used.\nIsrael’s defense minister Yoav Gallant gave a fleeting and noncommittal answer when asked at his Monday briefing about reports the country was using white phosphorus in military attacks. The Israeli Defense Forces operate “according to international law”, he said.\nGallant also said Israel had “no intention” of staying permanently in Gaza after the completion of its military campaign to eliminate Hamas. The country was open to discuss alternatives about who will control the territory as long as it is not a group hostile to Israel, he said, and would consider an agreement with Hezbollah in Lebanon if security guarantees were received.\nIsrael will open the Kerem Shalom crossing into Gaza on Tuesday in an attempt to speed the security screening of humanitarian aid. A spokesperson for Cogat, the Israeli government department responsible for coordinating activities in the territories, said all aid will still enter via the Rafah crossing in Egypt, but the move to increase screening capacity will double the amount getting in.\nEuropean leaders Leo Varadkar of Ireland, Pedro Sanchez of Spain, Robert Abela of Malta and Alexander De Croo of Belgium, wrote to EU president Charles Michel calling for a discussion about a Gaza ceasefire at the union summit on 14 and 15 December. US network CNN said the letter expressed “alarm” over the deteriorating humanitarian situation in Gaza and questions Israel’s military campaign and its effect on the civilian population.\nThe Gaza health ministry updated casualties since the start of the Israel-Hamas war on 7 October, stating that 18,205 Palestinians have been killed, and 49,645 injured. The reported death toll has risen by more than 500 in the two days from Saturday, when it stood at 17,700, the ministry said.\nQatar has spoken with Israel to gauge interest in talks about a possible new pause in the fighting in Gaza, according to a journalist for Axios. The report directly contradicts the position of diplomats at the annual Doha Forum conference in Qatar, who have said they are not expecting any reopening of Gaza ceasefire talks for some weeks.\nAt least 52 people were arrested in Washington DC on Monday at a protest calling for the US to push for a permanent ceasefire between Israel and Hamas. Activists representing the US Campaign for Palestinian Rights, Jewish Voice for Peace and other groups briefly protested in a Senate office building before police ended the demonstration and took dozens into custody.\nItaly, France and Germany called on the European Union to impose ad hoc sanctions against Hamas and its supporters. “We express our full support for the … proposal to create an ad hoc sanctions regime against Hamas and its supporters,” they said in a letter to the EU’s foreign policy chief, Josep Borrell.\nFrance is also considering imposing national sanctions on those involved in illegal Israeli settlements in the occupied West Bank, the French foreign minister, Catherine Colonna , has said.\nFighting continued on the ground in the Gaza Strip, accompanied by repeated aerial bombardments from Israel. Rockets have also been fired into Israel from Gaza, and from anti-Israeli forces in Lebanon. Some of the heaviest close-quarters fighting in more than two months of conflict took place over the weekend, as the Israel Defense Forces tried to consolidate control of urban centres in northern Gaza and pursued Hamas leaders in the heart of the biggest city in the south, Khan Younis.\nUN security council ambassadors arrived in Egypt to visit the Rafah border crossing. An Egyptian foreign ministry official told the envoys during a briefing: “There is no justification to turning a blind eye to the pain and suffering inflicted on the Palestinian people in Gaza.”\nIsrael told the UN that it “must do better” at delivering aid to people in Gaza. The country said it was willing to double the number of inspections, but that “aid keeps waiting at the entrance of Rafah”. Since 7 October Israel has essentially blockaded Gaza, including at times cutting off telecommunications. The Rafah crossing with Egypt is the only entrance or exit to Gaza that has been open with any regularity, and Israel insists on inspecting all cargo being sent into the territory.\nIsrael’s military said 104 members of its forces have been killed in Gaza since the ground operation began. In addition the IDF said 582 soldiers were injured inside the Gaza Strip. It gives its total casualties since 7 October as 433 soldiers killed, and 1,645 wounded.\nThe mayor of the south Lebanon village of Taybeh, Hussein Mansour, and a family member died when a missile fired by Israel’s military struck his home a few kilometers from the Israel border, a relative and Lebanon’s national news agency told Reuters. The shell did not explode, the relative said, but struck Mansour directly.\nA French frigate that shot down two drones in the Red Sea on Sunday was acting in self-defence after coming under attack from the unmanned aerial vehicles, France’s foreign ministry in Paris said on Monday.\nSweden demanded the immediate release of an EU diplomat who has been held in an Iranian jail for more than 600 days and is facing trial on charges of spying for Israel.\nMore than 200 people blocked entry to the ruling Conservative party’s headquarters in London before delivering an open letter to 10 Downing Street that calls on UK prime minister Rishi Sunak to back a permanent ceasefire in Gaza.\n11 Dec 2023 23.37 CET EU leaders call for ceasefire discussion at summit Four European leaders, Leo Varadkar of Ireland, Pedro Sanchez of Spain, Robert Abela of Malta and Alexander De Croo of Belgium, have written to EU president Charles Michel calling for a discussion about a Gaza ceasefire at the upcoming union summit, CNN reports. According to the US network, the letter expresses the “alarm” over the deteriorating humanitarian situation in Gaza. The four have been among the most vocal of Europe’s leaders in questioning Israel’s military campaign and its effect on the civilian population. “Given the gravity of the situation and the potential of an escalation in the West Bank and regionally, it is imperative for us to hold a serious debate on the war during the upcoming European Council that will take place on December 14 and 15,” the leaders wrote to Michel.\nUpdated at 23.43 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Italy, France and Germany called on the EU to impose ad hoc sanctions against Hamas and its supporters - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/11/israel-gaza-war-live-updates-hamas-hostages-warning-palestine-idf-un-emergency-meeting"}