{"authors": ["Harriet Sherwood"], "date_download": "2024-02-05 15:27:55", "date_modify": "None", "date_publish": "2023-12-12 05:00:55", "description": "Journalists stopped from entering via Israel and Egypt have to rely mostly on Palestinian insiders and social media", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F12%2Fhugely-frustrating-international-media-seek-to-overcome-gaza-ban.json", "image_url": "https://i.guim.co.uk/img/media/88fb3b8de22fa31b738a39cd1f9359aa90bb50ed/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9ad42544a45c344a7d6271576ba98d3", "language": "en", "localpath": null, "maintext": "International journalists covering the Israel-Hamas war are increasingly frustrated by the ban on entering Gaza, leaving them unable to provide comprehensive on-the-ground coverage of the impact of the conflict inside the territory.\nThe Erez crossing from Israel into Gaza, controlled by the Israeli military, has been closed since 7 October when Hamas attacked the buildings and infrastructure, and killed or kidnapped a number of soldiers manning the border.\nThe Rafah crossing, from Egypt into Gaza at the southern end of the territory, which is controlled by the Egyptian military, has also been closed to journalists since the beginning of the war.\nThe Foreign Press Association (FPA), an independent Israeli organisation that represents members of the international media, has taken the first steps in a “legal procedure” for access into Gaza for international journalists after an initial request to the Israel Defense Forces (IDF) and the Israeli government press office was ignored.\nThe international media has been relying on Palestinian journalists and media workers in Gaza, contact with Palestinian civilians, aid agency staff and medical workers, as well as social media reports, which need painstaking verification. Since the start of the war, at least 63 journalists and media workers in Gaza have been killed, according to the Committee to Protect Journalists.\nSome international journalists have embedded with the IDF inside Gaza since 7 October. However, the IDF has forbidden contact with Palestinians on the ground and has insisted that reports be submitted for review before publication or broadcast.\nThe risk of death or injury means that many international media organisations would be reluctant to send staff into Gaza while fighting was continuing even if access was possible.\n“The FPA is aware of the unique security challenges posed by the current war. Nonetheless, Israel has always enabled access to Gaza during and after previous rounds of fighting. It also is legally obligated, under a previous supreme court ruling,” the FPA said in a statement.\n“The FPA expects the Israeli government and the IDF to stand true to their commitments to allow freedom of reporting for journalists and allow access beyond the limited number of controlled embedment opportunities the army has offered.”\nThe Israeli government press office, which has issued media credentials to about 2,800 international journalists since 7 October, said the Erez crossing had been “fully operational” up until the Hamas attack.\n“Since then nobody has crossed it – not Palestinian workers, not diplomats, not NGOs and not journalists. The only active land crossing for people into Gaza is Rafah, which is under exclusive Egyptian control,” said Ron Paz, head of the foreign press department.\nAny decision about allowing journalists access was a “matter of policy which is beyond my realm at the government press office,” he added.\nJeremy Bowen, the BBC’s international editor who has covered the Israeli-Palestinian conflict for decades, said: “Not being on the scene makes reporting much harder. In war reporting, nothing beats using your own eyes and ears.”\nPalestinian journalists in Gaza have also found it frustrating “because movement is very difficult and dangerous”.\nBowen said he would “probably go into Gaza” if access was permitted. “But it would be with a sense of trepidation.”\nHe added: “I doubt Israel will let journalists in until some time after a ceasefire. Both sides want to control the media battlefield, but Israel is in a better position to do so because they control access to Gaza – and the Hamas leadership is under attack and in hiding.\n“What has really changed things is the proliferation of videos people post online. Closing down a story completely is impossible these days.”\nSecunder Kermani, foreign correspondent for Channel 4 News, who has been covering the war since its start, said: “It’s hugely frustrating not to be able to document first-hand the awful scenes in Gaza. Of course there are many Palestinian journalists doing crucial and dangerous work, either producing powerful reports themselves or providing us with material.\n“Everything in this war is so contested, being able to access Gaza independently would allow us to delve more deeply into the many competing claims and counter-claims, as well to get a better understanding of the internal dynamics within Gaza right now.\n“The ramifications of this war will be felt for many years and in many places across the world. It’s essential international journalists are able to scrutinise it.”\nAnother senior international journalist who asked not to be named said the difficulties of information-gathering were getting worse “because the phone networks were now down most of the time”.\nBut, the journalist added, “the idea that if the borders opened, everyone would charge in – I’m not sure that’s true, given the issues of safety”.\nIn other conflicts, it was possible to retreat from the frontline but in Gaza nowhere was safe. Reporting this war was “one of the biggest journalistic challenges any of us has faced”.\nJamie Wilson, head of international news at the Guardian, said: “This is a difficult issue for media organisations. We want to provide comprehensive reporting on the ground, but the situation in Gaza is extremely dangerous.\n“Nevertheless, this is a decision that news organisations should be weighing up for themselves, rather than having the Israeli government denying access to international journalists.”\nIn the 2008-9 war in Gaza, which lasted three weeks, Israel denied access to the territory to international journalists until a ceasefire was declared. In later conflicts in 2012 and 2014, media workers were allowed entry via the Erez crossing.\nIsraeli journalists have been banned from entering Gaza since Hamas won elections in 2006.", "source_domain": "www.theguardian.com", "text": null, "title": "‘Hugely frustrating’: international media seek to overcome Gaza ban", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/12/hugely-frustrating-international-media-seek-to-overcome-gaza-ban"}