{"authors": ["Sky Uk Limited"], "date_download": "2024-02-05 15:27:56", "date_modify": "None", "date_publish": "2023-12-12 07:58:00", "description": "Ms Gonoi complained to her superiors at the time of the incident but left the army when no action was taken. Japan's defence ministry later apologised after her case attracted worldwide attention.", "filename": "https%3A%2F%2Fnews.sky.com%2Fstory%2Frina-gonoi-three-ex-japanese-soldiers-found-guilty-of-sexually-assaulting-colleague-who-spoke-about-her-ordeal-on-youtube-13028506.json", "image_url": "https://e3.365dm.com/23/12/1600x900/skynews-rina-gonoi_6390588.jpg?20231212090733", "language": "en", "localpath": null, "maintext": "Three former Japanese soldiers have been found guilty of sexually assaulting a female colleague who gained international attention after she spoke about her ordeal in a YouTube video.\nRina Gonoi, who said she was subjected to persistent harassment after joining the Self-Defense Forces in 2020, alleged the three men pinned her to the ground, pulled her legs apart and pressed their crotches against her in simulation of a sex act in 2021.\nShe complained to her superiors at the time of the incident but later decided to leave the army when no action was taken.\nMs Gonoi, now 24, then went public with her accusations in a YouTube video in 2022, a rare move in a conservative society where speaking out against sexual violence has remained largely taboo.\nBe the first to get Breaking News Install the Sky News app for free\nThe video went viral and she collected more than 100,000 signatures for a petition calling on Japan's defence ministry to investigate her case.\nThe defence ministry later issued a public apology and announced that five men connected to the incident had been dismissed and four others punished.\nThe ministry also began a widespread survey of harassment in the military and military-linked entities that found more than 1,400 complaints.\nMs Gonoi's fight for justice attracted international recognition, with Time Magazine naming her on its list of 100 emerging world leaders and the BBC including her among its 100 most influential women globally.\nThe defendants seemed to show little expression as the judge read out his verdicts on Tuesday, giving them each a suspended sentence of two years.\nAdvertisement\nMs Gonoi told reporters outside the district court in Fukushima: \"I think it was good for Japan's society that the court handed down a guilty verdict and accepted the claims that I've made from the very beginning.\"\nPausing mid-sentence to regain her composure, she added: \"(The verdict) shows that it's not OK to do things for a laugh, that such acts are an actual crime.\"\nRead more world news:\nFootball club president arrested after punching referee\nWoman 'leaves Texas for treatment' after court blocks abortion\n'Madman' Milei sworn in as Argentina's president\nDespite the support she received from around the world, Ms Gonoi was targeted with online abuse by some in Japan.\nChelsea Szendi Schieder, a professor of Japanese history at Tokyo's Aoyama Gakuin University, said: \"The hurdles are incredibly high in Japan to be able to come out publicly and that has to do with...the kind of backlash a woman gets when she speaks out about these issues.\n\"It is a really important verdict that I hope has a lot of organisations within Japan re-evaluating their internal systems.\"\nMs Gonoi has also lodged a civil case against her former peers and the government, seeking damages for the alleged assault and the subsequent inaction despite her complaints.\nThe cases come at an awkward time for Japan, which is trying to recruit more women soldiers into its forces and build up its military to deter an increasingly assertive China and nuclear-armed North Korea.", "source_domain": "news.sky.com", "text": null, "title": "Rina Gonoi: Three ex-Japanese soldiers found guilty of sexually assaulting colleague who spoke about her ordeal on YouTube", "title_page": null, "title_rss": null, "url": "https://news.sky.com/story/rina-gonoi-three-ex-japanese-soldiers-found-guilty-of-sexually-assaulting-colleague-who-spoke-about-her-ordeal-on-youtube-13028506"}