{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:27:57", "date_modify": "None", "date_publish": "2023-12-12 15:37:32", "description": "Fears raised as WHO says ambulance staff detained at gunpoint, stripped and beaten by Israeli troops", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F12%2Finjured-palestinians-face-potentially-fatal-delays-in-treatment-say-aid-agencies.json", "image_url": "https://i.guim.co.uk/img/media/570e4185b096fdcf6078fa27126750b1acd07abe/0_118_4305_2584/master/4305.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7e0fd95f55c2eb5abdcfbe8386c0d512", "language": "en", "localpath": null, "maintext": "Palestinians who have been injured during the war in Gaza are facing potentially fatal delays both in getting treatment within the coastal strip as well as in being evacuated abroad, caused by Israeli bureaucracy and military checkpoints, the UN and aid organisations say.\nThe delays come amid a claim by the World Health Organization (WHO) that Palestinian ambulance staff involved in a recent high-risk evacuation were detained at gunpoint, stripped and beaten by Israeli soldiers.\nFighting continued in Gaza on Tuesday, with Israeli forces battling Hamas militants and launching airstrikes across the territory. At least 23 people were killed in a strike on Rafah on the Egyptian border, including seven children and six women, and the Hamas-run health ministry updated its death toll in Gaza to 18,412.\nWith estimates that 50,000 Palestinians have suffered injuries in the two months of Israeli military operations launched after Hamas’s attack on Israel on 7 October, an Israeli NGO – Physicians for Human Rights Israel – said on Tuesday that only 400 Palestinians had been evacuated abroad, despite a number of countries being willing to receive the wounded.\nAdditionally the WHO has blamed the Israel Defense Forces (IDF) for lengthy delays at checkpoints in allowing wounded people to pass. It cited the case of a patient who died in an emergency convoy en route to a Gaza City hospital, during repeated and lengthy Israeli checks in which a health worker was detained and beaten.\nTedros Adhanom Ghebreyesus, the head of the WHO, said at the weekend that the UN health agency and its partners had managed to deliver essential trauma and surgical supplies to the Al-Ahli hospital and to transfer 19 critical patients.\nOn Tuesday, he provided further details about the high-risk mission, saying on X that the WHO was “deeply concerned about prolonged checks and detention of health workers that put lives of already fragile patients at risk”.\n“Due to the hold-up, one patient died en route, given the grave nature of their wounds and the delay in accessing treatment,” he said.\nA statement further described the incidents.\n“On the way north, the UN convoy was inspected at the Wadi Gaza checkpoint, and ambulance crew members had to leave the vehicles for identification. Two Palestinian Red Crescent [PRCS] staff were detained for over an hour, further delaying the mission.\n“WHO staff saw one of them being made to kneel at gunpoint and then taken out of sight, where he was reportedly harassed, beaten, stripped and searched.\n“As the mission entered Gaza City, the aid truck carrying the medical supplies and one of the ambulances were hit by bullets.\n“On the way back towards southern Gaza, with the patients from Al-Ahli hospital onboard, the convoy was again stopped at the Wadi Gaza checkpoint, where PRCS staff and most of the patients had to leave the ambulances for security checks.\n“Critical patients remaining in the ambulances were searched by armed soldiers.\n“One of the same two PRCS staff temporarily detained earlier on the way in was taken for interrogation a second time. The mission made numerous attempts to coordinate his release, but eventually – after more than two and a half hours – had to make the difficult decision to leave the highly dangerous area and proceed, for the safety and wellbeing of the patients and humanitarian workers.”\nWith only 11 of Gaza’s 36 hospitals even partially operating, and shortages of crucial medicines including antibiotics to treat post-operative infections, the coastal strip’s collapsing healthcare system has been struggling to deal with the sheer numbers of wounded.\nGaza’s health ministry has accused Israel of dragging its feet over approval for emergency health evacuations out of Gaza through the Rafah border crossing.\nUnder a byzantine system of approval for emergency medical evacuation, a list prepared by the health ministry must first be sent to the Egyptian authorities, who then pass the list to the International Committee to the Red Cross, who then forward it to Israel for security screening. Once Israel approves the names, the list is sent back to Gaza via the same route.\n“Even before 7 October and start of war, the [southern] Rafah border crossing was not fully controlled by the Palestinians,” said Aseel Aburass, of the NGO Physicians for Human Rights Israel, which has written to the IDF and Israeli attorney general about the situation.\n“Any person who wants to pass the border needs Israeli permission and there is a complex mechanism for approval which means it can take one to three days for people who need evacuating in hours.\n“Until yesterday 430 people have been evacuated out of the 49,600 people who have been injured despite the fact a number of countries including Egypt Qatar and Turkey have said they would take injured Palestinians.”", "source_domain": "www.theguardian.com", "text": null, "title": "Injured Palestinians face potentially fatal delays in treatment, say aid agencies", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/12/injured-palestinians-face-potentially-fatal-delays-in-treatment-say-aid-agencies"}