{"authors": ["Léonie Chao-Fong", "Richard Luscombe", "Amy Sedghi", "Oliver Holmes", "Sammy Gecsoyler", "Reged Ahmad"], "date_download": "2024-02-05 15:15:29", "date_modify": "None", "date_publish": "2024-01-27 00:28:54", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F26%2Fmiddle-east-crisis-live-updates-icj-genocide-case-ruling-israel-hamas-gaza-hostage-talks-cia.json", "image_url": "https://i.guim.co.uk/img/media/6468bfe6e211742e36bffd39e0740e942f83e6d0/0_275_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=184a167699d3d7c202d0e93c47b91289", "language": "en", "localpath": null, "maintext": "From 26 Jan 2024 22.12 CET UN chief 'trusts Israel will comply' with ICJ ruling The UN secretary general, António Guterres, has said he hopes Israel will comply with the international court of justice’s ruling in the case against Israel. In a statement from Stéphane Dujarric, the UN chief’s spokesperson, Guterres noted that decisions of the ICJ are binding and that he “trusts that all parties will duly comply with the Order from the Court.” In a separate statement, the UN chief said he was “horrified” by the “serious” allegations implicating several staff members at the UN agency for Palestinian refugees (UNRWA) in the Hamas attacks on Israel on 7 October. Guterres has asked UNRWA commissioner general, Philippe Lazzarini, to investigate the allegations and to ensure that any employee shown to have participated or abetted in the attacks be “terminated immediately and referred for potential criminal prosecution. “\n26 Jan 2024 23.45 CET Nasser hospital in Khan Younis in southern Gaza has experienced a complete power outage, according to reports. The hospital, one of only two in the southern half of Gaza that can still treat critically ill patients, is completely without power, Al Jazeera is reporting.\n26 Jan 2024 23.24 CET Gaza no longer has a healthcare system, warns MSF Vital medical services at Gaza’s largest functioning health facility have collapsed amid ongoing intense fighting and bombing in Khan Younis in southern Gaza, leaving people with no options to go for treatment, Médecins Sans Frontières (MSF) has warned. Most of the staff at Nasser hospital, along with thousands of displaced people sheltering in the hospital, fled in the days leading up to the evacuation order by Israel Defense Forces (IDF), MSF said in a statement today. It said the hospital’s surgical capacity is “almost nonexistent” while the “handful” of medical staff who remain must contend with “very low supplies that are insufficient to handle mass casualty events”. Between 300 and 350 patients remain at Nasser hospital, it said, noting that they were unable to evacuate because “it is too dangerous and there are no ambulances”. It said at least one patient had died on Wednesday because there was no orthopaedic surgeon available. Meanwhile, the European Gaza hospital, the second biggest facility in southern Gaza, is “unreachable” for medical staff and people because its neighbouring areas are under evacuation order, it said. Guillemette Thomas, MSF medical coordinator in Palestine, said: People’s lives are at risk because of the lack of medical care. With Nasser and European Gaza Hospital almost inaccessible, there is no longer a healthcare system in Gaza.\nUpdated at 23.37 CET\n26 Jan 2024 23.05 CET Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or else risk harming business relations with Beijing, according to a report. An Iranian official briefed on the talks between Beijing and Tehran told Reuters: Basically, China says: ‘If our interests are harmed in any way, it will impact our business with Tehran. So tell the Houthis to show restraint’. The Chinese officials did not make any specific comments or threats about how Beijing’s trading relationship with Iran could be affected if its interests were damaged by Houthi attacks, Iranian sources told the news agency. The Houthi attacks, which the group say are in support of Palestinians in Gaza, have raised the cost of shipping and insurance by disrupting a key trade route between Asia and Europe used widely by ships from China. Beijing had made it clear it would be disappointed with Tehran if any vessels linked to China were hit, or if its interests were affected in any way, the sources said. But while China was important to Iran, Tehran also had proxies in Gaza, Lebanon, Syria and Iraq, besides the Houthis in Yemen, and its regional alliances and priorities played a major role in its decision making, one of the Iranian sources said.\n26 Jan 2024 22.52 CET IDF says 'intensive' battles continue in Khan Younis The Israel Defense Forces (IDF) has said “intensive battles” continued to rage in the heart of the city of Khan Younis in southern Gaza, as it said dozens of Hamas targets were destroyed. In an update this morning, the IDF said it had discovered about 200 tunnel shafts in Khan Younis and more than 130 Hamas military infrastructures. Among the targets hit by Israeli fighter jets on Friday morning were “terror targets” that included operational centres, weapons storage facilities, observation posts, and meeting points used by Hamas militants, it said. Residents of Khan Younis reported gun battles raging overnight, with Israeli forces blowing up buildings and houses in the western part of the city. The Palestinian Red Crescent Society reported on Thursday that Israeli units had bombed and shelled the area around the al-Amal hospital in Khan Younis, and that rescue workers could no longer reach it. Most of the Gaza Strip’s 2.3m population have been forced to squeeze into Khan Younis and its nearby towns, after being driven out of northern Gaza earlier in Israel’s military campaign.\n26 Jan 2024 22.33 CET Patrick Wintour In seeking a provisional order from the international court of justice restraining Israel from committing potentially genocidal acts in Gaza, South Africa put not just Israel’s treatment of Palestinians in the dock but also the whole post-second world war rules-based order, including the authority of the ICJ itself. Never has there been such a high-profile case brought in the middle of such a bloody conflict, and rarely have so many staked so much on the outcome. In the words of the Irish barrister Blinne Ní Ghrálaigh, who set out part of South’s Africa case to the court, “the imminent risk of death, harm and destruction that Palestinians in Gaza face today, and that they risk every day during the pendency of these proceedings, on any view justifies – indeed compels – the indication of provisional measures. Some might say that the very reputation of international law – its ability and willingness to bind and to protect all peoples equally – hangs in the balance. Extraordinarily, the court did not shirk from what it regarded as its responsibilities. It did not order a full ceasefire but it granted protective orders, including an end to the killing of Palestinians in Gaza, that went further than many international law experts were predicting. The ruling is devastating for Israel and awkward for politicians such as the US secretary of state, Antony Blinken, who said the case was meritless, and the UK foreign secretary, David Cameron, who urged South Africa not to bandy around words such as genocide. The highest court in the world, the apex of the United Nations, has found there is a plausible risk that Palestinians’ right to be protected from a genocide are under threat from Israel’s actions. The irony of this is self-evident. The concepts of “crimes against humanity” and “genocide” were created by a Jewish law professor, Raphael Lemkin. For Israel, a nation in part born in 1948 from the horrors of the Holocaust and centuries of persecution, this could be a moment for reflection. Its whole national identity is intertwined with the Holocaust, just as South’s Africa’s is indivisible from apartheid. Read the full analysis here: ICJ’s Gaza decision shores up rules-based order and puts west to test View image in fullscreen Palestinian protesters outside the international court of justice in The Hague react after judges order Israel to ensure acts of genocide are not committed in Gaza. Photograph: Piroschka van de Wouw/Reuters ICJ’s Gaza decision shores up rules-based order and puts west to test Read more\n26 Jan 2024 22.23 CET The US is working to facilitate another deal on the release of hostages held in Gaza, but there are no “imminent developments” on an agreement, the White House has said. The White House’s national security spokesperson, John Kirby, speaking amid a flurry of diplomatic efforts to reach a deal on the release of hostages, said: We’re hopeful about the progress, but I do not expect … any imminent developments.\nUpdated at 23.56 CET\n26 Jan 2024 22.12 CET UN chief 'trusts Israel will comply' with ICJ ruling The UN secretary general, António Guterres, has said he hopes Israel will comply with the international court of justice’s ruling in the case against Israel. In a statement from Stéphane Dujarric, the UN chief’s spokesperson, Guterres noted that decisions of the ICJ are binding and that he “trusts that all parties will duly comply with the Order from the Court.” In a separate statement, the UN chief said he was “horrified” by the “serious” allegations implicating several staff members at the UN agency for Palestinian refugees (UNRWA) in the Hamas attacks on Israel on 7 October. Guterres has asked UNRWA commissioner general, Philippe Lazzarini, to investigate the allegations and to ensure that any employee shown to have participated or abetted in the attacks be “terminated immediately and referred for potential criminal prosecution. “\n26 Jan 2024 22.04 CET Argentina’s new president, Javier Milei, has announced plans to visit Israel as he signalled support for its ongoing conflict with Hamas in Gaza. Milei, in a speech during a Holocaust remembrance event in Buenos Aires, said he would travel to Israel “in the coming weeks”, one of his first overseas trips since he took office last month. He said: In the coming weeks I will be traveling to the Holy Land in what will constitute a new chapter in the brotherhood between our two nations. Argentina would “not remain silent in the face of Hamas terror”, he said, as he condemned the “atrocious and unforgivable” attacks by Hamas on Israel on 7 October. Eleven Argentines are among the civilian hostages held by Hamas, he said. Argentina’s Jewish community is one of the largest in Latin America and before taking office in December, Milei said he intended to convert to Judaism. View image in fullscreen President of Argentina, Javier Milei participates in a commemorative event for the International Day in Memory of the Victims of the Holocaust at the Shoa Museum in Buenos Aires, Argentina Photograph: Leonardo Kremenchuzky/EPA\n26 Jan 2024 21.46 CET UK must respect ICJ ruling and immediately stop arms sales to Israel, says Oxfam Oxfam has welcomed the international court of justice’s ruling in South Africa’s case against Israel, describing it as a “crucial step” towards “recognising the ongoing atrocities” in Gaza. In a statement, Oxfam urged the UK government to “respect the court ruling, and cease its complicity in the crisis, starting by immediately stopping arms sales to Israel given the risk of them being used to commit war crimes and calling for an immediate and permanent ceasefire.” “Anything less will be a stain on the UK’s reputation as an upholder of international law,” it said. The statement continues: Palestinians should not have to endure another day of this suffering. We urge the UK and all countries to do all in their power to ensure those responsible for violations on both sides are held accountable, to secure the release of all hostages and detainees, and to end Israel’s decades-long occupation of Palestinian territory.\n26 Jan 2024 21.34 CET Joe Biden spoke on Friday with his Egyptian and Qatari counterparts ahead of a trip to Europe by CIA director William Burns to seek a deal to secure the release of more hostages held by Hamas in Gaza, the Associated Press reports. National security council spokesperson John Kirby told a White House press briefing that Biden spoke with Egyptian President Abdel Fattah el-Sissi and Qatar’s ruling emir, Sheikh Tamim Bin Hamad Al-Thani. He added that while talks have been constructive, “we should not expect any imminent developments,” adding: We continue to do everything we can to facilitate another hostage deal, just as we did in November. CIA Director Burns is slated to soon meet in Europe with David Barnea, the head of Israel’s Mossad intelligence agency, Qatari prime minister Mohammed bin Abdulrahman Al Thani, and Egyptian intelligence chief Abbas Kamel, according to three people familiar with the matter who insisted on anonymity to discuss the sensitive talks. The meeting will focus on the release of hostages in exchange for a pause in hostilities. The Biden administration’s hope is that an agreement could lead to an extended ceasefire that could eventually bring an end to the conflict, according to a US. official. The CIA and the White House national security council declined to comment on the meeting. Burns’ trip comes after a visit to the Mideast by White House senior envoy Brett McGurk this week focused on winning the release of the remaining hostages in Gaza. McGurk has also been laying the groundwork for another trip to the region by the US secretary of state Antony Blinken, who next week could make his fifth trip to the Middle East since the start of the Israel-Hamas war in October.\n26 Jan 2024 21.21 CET Vessel on fire after Houthi missile attack in Gulf of Aden, says firm The Singapore-based commodities company Trafigura has confirmed one of its vessels is on fire in the Gulf of Aden following a missile strike by Iran-backed Houthi rebels in Yemen. In a statement Friday reported by Bloomberg News, the company said the Marlin Luanda was carrying a consignment of flammable petroleum naptha fuel used in the production of gasoline and plastics. It added military help was on the way: Firefighting equipment on board is being deployed to suppress and control the fire caused in one cargo tank on the starboard side. We remain in contact with the vessel and are monitoring the situation carefully. Military ships in the region are underway to provide assistance.\nUpdated at 22.00 CET\n26 Jan 2024 20.59 CET Britain’s opposition Labour party is urging Israel to comply fully with the orders of the International Court of Justice’s ruling on the war in Gaza. The shadow foreign secretary, David Lammy, called for an “end to extremist rhetoric” and Israel’s adherence to the “urgent provisional measures” set out in the interim decision, the UK Press Association reported. View image in fullscreen David Lammy. Photograph: Maja Smiejkowska/PA The International Court of Justice (ICJ) stopped short of ordering a ceasefire in Gaza but demanded Israel attempted to try to contain death and damage in its military offensive. Lammy said: The interim ruling under the Genocide Convention on the situation in Gaza is a profoundly serious moment. Labour has been clear throughout the conflict that international law must be upheld, that the independence of international courts must be respected, and that all sides must be accountable for their actions. The ICJ’s interim ruling… sets out urgent provisional measures that must be followed. Israel must now comply with the orders in this ruling in full. The ICJ’s measures align closely with Labour’s longstanding calls for the protection of civilians, urgent humanitarian relief in Gaza and an end to extremist rhetoric. We will press for these orders to be implemented, alongside an immediate humanitarian truce and a sustainable ceasefire. David Cameron, the UK foreign secretary, was concluding a visit to the Middle East on Friday, having pushed the Israeli government on a two-state solution to the Middle East crisis and called for urgent humanitarian pauses in Israel’s military operations.\n26 Jan 2024 20.41 CET Houthis claim attack on 'British oil tanker' Yemen’s Houthi militants say their naval forces carried out an operation targeting a vessel they identified as “the British oil tanker Marlin Luanda” in the Gulf of Aden on Friday, Reuters is reporting. They used “a number of appropriate naval missiles, the strike was direct,” the Houthi military spokesperson Yahya Sarea said in a statement. According to the website marinetraffic.com, Marlin Luanda is an oil tanker registered in the Marshall Islands, and is currently on a voyage between the Greek port of Lakonikos and Singapore. The vessel has no known connection to Britain. British maritime security firm Ambrey earlier reported that a fire broke out on a merchant vessel travelling through the Gulf of Aden after it was hit with a “missile”. The crew was reported safe, Ambrey added. UKMTO WARNING 021/JAN/2024 UPDATE 001https://t.co/zHGNgQp1UB#MaritimeSecurity #MarSec pic.twitter.com/yjn7AMws1T — United Kingdom Maritime Trade Operations (UKMTO) (@UK_MTO) January 26, 2024 The United Kingdom Maritime Trade Operations said it had received a report of an incident 60 nautical miles south east of Yemen’s Aden, in which a vessel was on fire and “requiring assistance”. It was not immediately clear if it was referring to the same episode. Separately, a US Navy warship shot down a missile fired towards it from Yemen on Friday, AFP reports. “Iranian-backed Houthi militants fired one anti-ship ballistic missile from Houthi-controlled areas of Yemen toward [the] Arleigh-Burke class destroyer USS Carney in the Gulf of Aden,” the US Central Command said in a statement. “The missile was successfully shot down by USS Carney. There were no injuries or damage reported.”", "source_domain": "www.theguardian.com", "text": null, "title": "Medical services at Gaza’s largest functioning health facility collapse amid intense fighting in Khan Younis, warns MSF - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/26/middle-east-crisis-live-updates-icj-genocide-case-ruling-israel-hamas-gaza-hostage-talks-cia"}