{"authors": [], "date_download": "2024-02-05 15:28:01", "date_modify": "None", "date_publish": "2023-12-12 15:11:08", "description": "Rina Gonoi expresses relief over verdict, saying ‘it’s not OK to do things for a laugh ... such acts are an actual crime’", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fasia%2Fjapan%2Fjapan-ex-soldier-guilty-sexual-assault-b2462507.html.json", "image_url": "https://static.independent.co.uk/2023/12/12/09/2023-12-12T081008Z_142240510_RC2KV4ARHF1G_RTRMADP_3_JAPAN-MILITARY-SEXUAL-ASSAULT.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA Japanese court has found three ex-soldiers guilty of sexually assaulting a female colleague, a landmark ruling marking victory in a case that had caused a public outcry.\nThe 2021 sexual assault case of Rina Gonoi, 24, forced her to leave the army after her complaints against the attackers were dismissed. She went public with her accusations with a YouTube video in 2022, drawing international headlines.\nThe three former soldiers, aged between 29 and 31 – Shutaro Shibuya, Akito Sekine, and Yusuke Kimezawa – appeared in the district court in Fukushima for the final hearing but seemed to show little expression as the judge handed out the guilty verdict.\nThe judge sentenced each of the former Japanese army soldiers to two years in prison but suspended the sentences for four years, meaning they won’t actually serve time in jail.\n“I think it was good for Japan’s society that the court handed down a guilty verdict and accepted the claims that I’ve made from the very beginning,” Ms Gonoi told reporters outside the Fukushima court.\n“[The verdict] shows that it’s not OK to do things for a laugh, that such acts are an actual crime,” she said, pausing mid-sentence to retain her composure.\nThe defendants denied that their acts amounted to sexual assault.\nMs Gonoi said in her complaint that she had been a target of sexual misconduct since she joined the Self-Defense Forces in 2020 and was first assigned to a Fukushima unit.\nHer male superiors repeatedly asked about her breast size, hugged her, and made inappropriate physical contact, such as trying judo techniques on her, Ms Gonoi had said.\nIn August 2021, her three male colleagues pinned Ms Gonoi to a bed and spread her legs open, forcibly pressing their crotches against her as other male colleagues watched and laughed.\nShe reported the sexual assault case to her superiors but she said her complaints were dismissed and she was asked to produce witnesses.\nSubsequently, the three men were referred to the prosecutor after the Ground Self-Defense Force (GSDF) police unit raised the issue of indecent assault. However, the case was dismissed due to insufficient evidence and Ms Gonoi eventually decided to quit the military.\nShe then released a YouTube video in 2022 that went viral and sparked a petition that collected 100,000 signatures, calling on the defence ministry to investigate her case.\nIt was a rare move in a conservative society where speaking out against sexual violence has remained largely taboo and many such incidents go unreported.\nThe defence ministry later issued an apology to her and launched a rare investigation. It announced that five men connected to the incident had been dismissed and four others punished.\nA wider inquiry on harassment in the military and military-linked entities found more than 1400 other complaints of harassment across the ministry, reported Reuters.\nWhile her battle gained her international recognition it also made her a victim of a barrage of online threats and abuse.\nMs Gonoi said she has been attacked on social media for coming forward and also received death threats but said she did so because she wanted to prevent similar problems for other women service members.\nShe was on the list of 100 emerging women leaders of Time magazine following the incident, while the BBC included her among its 100 most influential women globally.\nMs Gonoi has separately filed a damage suit against the three defendants, two other perpetrators and the government, saying she felt their earlier apologies were insincere. She is seeking 5.5m yen (£30,140) from the perpetrators and 2m yen from the government, saying it failed to prevent the assaults, properly investigate, or respond appropriately.\nThis marks the first significant judgment on sexual assault in Japan since June, when the nation overhauled its sex crime laws. The revisions involved redefining rape and elevating the age of consent.\nThe definition of rape was broadened to include “non-consensual sexual intercourse” from “forcible sexual intercourse”. The legal age of consent was raised to 16 from 13.", "source_domain": "www.independent.co.uk", "text": null, "title": "Three former soldiers found guilty in landmark Japan sexual assault case", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/asia/japan/japan-ex-soldier-guilty-sexual-assault-b2462507.html"}