{"authors": ["Mary Ann Sieghart", "Mary Ann Sieghart S", "More This Author"], "date_download": "2024-02-05 15:28:07", "date_modify": "None", "date_publish": "2023-12-12 08:00:00", "description": "Female Israeli soldiers had warned for months that Hamas was planning something. They weren’t taken seriously.", "filename": "https%3A%2F%2Fwww.newstatesman.com%2Fideas%2F2023%2F12%2Fisrael-gaza-war-when-men-dont-listen-women.json", "image_url": "https://dl6pgk4f88hky.cloudfront.net/2023/12/11/RTSOVN12-800x418.jpg?1707143287", "language": "en", "localpath": null, "maintext": "Devastation in Kibbutz Beeri after the Hamas attack on 7 October. Photo by Ilan Rosenberg\nA few months before 3,000 Hamas fighters blasted across the Israeli border, pillaged kibbutzim and raped and murdered their way through the Supernova festival, killing 1,200 people and taking more than 200 hostages, a veteran military intelligence officer on the southern border with Gaza warned that Hamas was planning exactly such an attack.\nThe officer was a woman. Her colonel, as the New York Times reported, dismissed her concerns as “imaginary”.\nAnd for several weeks before the assault on 7 October, according to Haaretz, dozens of the female soldiers in the Israel Defense Forces (IDF) tasked with monitoring the Gaza border were also warning their superiors that Hamas fighters were rehearsing an attack involving drones and paragliders, targeting tanks and border posts, and breaching the fence. Again, they were brushed off. Male commanders told them they didn’t understand what they were seeing. One high-ranking Israeli officer who visited Nahal Oz base said: “I don’t want to hear another word about this nonsense. If you nudge me again about this, you will stand trial.”\nMen not listening to women, questioning their expertise, dismissing their views, trying to silence them: it all sounds familiar. What if the authority gap led to the Middle East crisis?\nThis gap measures the difference between how seriously we take men and how seriously we take women. We are still more reluctant to listen to women and to be influenced by their views, however expert they are. As a result, what a woman says tends to carry less weight than the same thing said by a man.\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. Sign up directly at saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. Sign up directly at morningcall.substack.com Events and Offers Stay up to date with NS events, subscription offers & updates. The Green Transition Weekly analysis of the shift to a new economy from the New Statesman's Spotlight on Policy team. Your email address Job title Job title\nAdministration / Office\nArts and Culture\nBoard Member\nBusiness / Corporate Services\nClient / Customer Services\nCommunications\nConstruction, Works, Engineering\nEducation, Curriculum and Teaching\nEnvironment, Conservation and NRM\nFacility / Grounds Management and Maintenance\nFinance Management\nHealth - Medical and Nursing Management\nHR, Training and Organisational Development\nInformation and Communications Technology\nInformation Services, Statistics, Records, Archives\nInfrastructure Management - Transport, Utilities\nLegal Officers and Practitioners\nLibrarians and Library Management\nManagement\nMarketing\nOH&S, Risk Management\nOperations Management\nPlanning, Policy, Strategy\nPrinting, Design, Publishing, Web\nProjects, Programs and Advisors\nProperty, Assets and Fleet Management\nPublic Relations and Media\nPurchasing and Procurement\nQuality Management\nScience and Technical Research and Development\nSecurity and Law Enforcement\nService Delivery\nSport and Recreation\nTravel, Accommodation, Tourism\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\nWomen see this when they make a point at a meeting, and no one takes any notice until it is repeated by a man ten minutes later, when suddenly it becomes a gem of insight to be admired by everyone round the table. Women often blame themselves when this happens: perhaps they weren’t confident or articulate or eloquent enough? No, they were just too female.\nA clever experiment has proved how powerful this phenomenon is. In 1995 researchers at Northern Illinois University assembled a mixed-gender group, ostensibly to decide a child custody case. They deliberately chose this subject because it is quite female-stereotyped, so you would expect women to be knowledgeable about it. They gave the group a lot of information about the family concerned, but they then gave a few individual members a piece of information that the rest of the group didn’t have. When that information was introduced into the discussion by a man, it was six times as likely to be used in the group’s deliberations as when it was introduced by a woman. That’s how much harder it is for a woman to be heard and for her views to be accepted and acted upon.\nThe authority gap is an annoyance for women and holds them back in their careers. But in the case of Israel, the repercussions may have been deadly. Had these male commanders taken seriously the intelligence they were given by women, the Hamas attack might have been forestalled and Israel wouldn’t have laid waste to Gaza in response. The Middle East might not be at war today.\nIt’s not as if the women concerned didn’t fight to have their voices heard. The military intelligence officer, working for Unit 8200, Israel’s signal intelligence agency, wrote three documents in the months before the attack. In these, she detailed the preparations that Hamas was undertaking and pointed out the striking similarities to a Hamas battle plan, code-named Jericho Wall, that the intelligence services had got hold of a year before the attack. That plan was enacted almost to the letter on 7 October.\nThis officer was an expert in Hamas battle techniques. On 6 July, according to leaked emails reported by Israel’s Channel 12, she told her commanders about two platoons of Hamas fighters conducting a military exercise, including practising shooting down a helicopter and fighter jet. She said they seemed to be planning a massive bombardment with mortars, rockets and missiles, neutralising communications with drones, and breaking the fence. They were practising crossing the border into Israel, raiding a kibbutz, attacking a military academy, and killing all the cadets. She told her commanders that Hamas had ended the drill with the words, “We have completed the murder of all the residents of the kibbutz.”\nAccording to Haaretz‘s account: “A senior intelligence officer wrote to her in response, praising her work but adding: ‘It sounds imaginary to me.’ ” She pushed back in another email, writing, “I utterly refute that the scenario is imaginary. It is a plan designed to start a war. It’s not just a raid on a village.”\nShe reminded her colleagues of the 1973 Yom Kippur war, in which the Syrian and Egyptian armies made a surprise attack on Israel. That intelligence failure is seared in Israeli memory. “We already underwent a similar experience 50 years ago on the southern front in connection with a scenario that seemed imaginary, and history may repeat itself if we are not careful,” the analyst wrote.\nIf she had been listened to, history perhaps wouldn’t have repeated itself. But she wasn’t a lone woman trying to challenge the groupthink of her mainly male superiors. Her warnings were backed up by the observations of dozens of IDF “spotters” – also female – who watch the border. They confirmed that Hamas forces were building up to what looked like a serious attack. Many spotters were killed by Hamas when the assault they had warned of took place.\nAs one spotter put it to Haaretz, “They abandoned our friends to die because nobody wanted to listen to us. It’s beneath their dignity to listen to a sergeant – who for two years has been staring at the same screen and knows every stone, every grain of sand – tell them something contrary to what the senior intelligence officers are telling them. Who am I, some little woman, before a man with the rank of major or lieutenant-colonel, for whom everybody stands at attention when he enters the room?”\nThe IDF spotters and their commanders are exclusively female. “There’s no doubt that if men had been sitting at those screens, things would look different,” said one of them.\nThe intelligence the spotters were passing on was detailed and chilling. “In my sector, they built a precise model of a Merkava IV tank and trained on it all the time,” a spotter from the Gaza division said. “They trained on how to hit a tank with an RPG, where exactly to hit it, and then, in front of our eyes, they trained on how to capture the tank crew.”\n“In the past couple of months, they began to put up drones every day, sometimes twice a day, that came really close to the border,” said another spotter. “A month and a half before the war, we saw that in one of Hamas’s training camps, they had built an exact replica of an armed observation post, just like the ones we have. They started to train there with drones, to hit the observation post.”\nThis spotter and her colleagues passed the information on according to protocol, but even went beyond that: “We yelled at our commanders that they have to take us more seriously, that something bad is happening here. We understood that the behaviour in the field was very strange, that they were basically training for an attack against us.”\nHer immediate commanders also tried to pass this information up the chain. However, these commanders were female too, so they “are just as helpless as we are before the senior commanders – and certainly before the division and regional command”, as another spotter put it. “Nobody really pays any attention to us.”\nA month before the attack, a senior officer from the Gaza division came to a base along the Gaza border, so one of the spotters decided to approach him with her concerns. “I told him there was going to be a war and we’re simply not ready,” she said. “That what’s happening with Hamas along the border fence is not normal. That they’re mocking the IDF, that our hands are tied and we’re not even [firing] warning shots.”\nThe officer asked for her name, looked at her menacingly, and rebuked her for not following protocol. “He said to me, ‘I’ve been in the sector since 2010. I was a commander here, an intelligence officer, I know Gaza inside out, and I’m telling you that everything’s fine.’ ”\nYet another spotter said: “I cannot describe the frustration, the sense of abandonment by the senior commanders. We issued warnings, we told our commanders, but we’re considered the bottom of the division’s food chain.”\nThese young women had always suffered from sexism in the Israeli army. A parent of a spotter told Haaretz last year that he had tried to protest about the way they were treated: “I have never encountered such treatment of women soldiers, which comes from the high ranks of the military and trickles down from there, like drops of poison.” He was complaining about the brutal conditions in which they were expected to work, often hungry and deprived of sleep.\nBut I doubt he expected them to die. Yet at the Nahal Oz base Hamas killed 20 unarmed female spotters on 7 October and six were abducted. Just two women escaped. One, Maya Desiatnik, is livid about their warnings being dismissed. “It’s infuriating. We saw what was happening, we told them about it, and we were the ones who were murdered,” she told Kan, the Israeli public broadcaster. The authority gap turned out to be deadly.\nAll the way up the chain of command, women were dismissed by more senior men. Both the Israeli government and the upper ranks of its military are overwhelmingly male. An army with a more equal distribution of women in the higher ranks might have listened to the warnings in time. Meanwhile, Benjamin Netanyahu’s war cabinet contains no women and just six of his forty ministers are female.\nResearch shows that countries with more women in power are less likely to go to war or to have a civil war. And when women are included in peace processes, they tend to be more successful and last longer. So just think how different the world could be now if women shared power and authority equally with men. Ultimately, the authority gap is much more than an irritation: it can be a matter of life and death.\n[See also: What it means to be Jewish now]", "source_domain": "www.newstatesman.com", "text": null, "title": "When men don’t listen to women", "title_page": null, "title_rss": null, "url": "https://www.newstatesman.com/ideas/2023/12/israel-gaza-war-when-men-dont-listen-women"}