{"authors": ["Emily Goodin", "Senior U.S. Political Reporter", "Nikki Schwab"], "date_download": "2024-02-05 15:28:08", "date_modify": "None", "date_publish": "2023-12-12 23:22:31", "description": "Ukrainian President Volodymyr Zelensky hit back at the 'insane' suggestion that Ukraine should give Russian President Vladimir Putin some territory to end the war.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12857049%2FZelensky-hits-INSANE-suggestion-Putin-territory-end-war.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/12/23/78889971-0-image-a-10_1702423213471.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian President Volodymyr Zelensky hit back at the 'insane' suggestion from a reporter Tuesday that Ukraine should give Russian President Vladimir Putin some occupied territory to end the war.\nZelensky, standing side-by-side at a White House press conference with President Joe Biden, also insisted that he was confident that Republicans would relent and approve a bill giving the war-torn nation an additional $61.4billion in military aid.\nThe Ukrainian president was asked about the stalled counter-offensive against Russia and if he'd cede territory to end the nearly two-year long assault.\n'That's insane, to be honest,' Zelensky said through an English interpreter.\n'That's part of Ukrainian society. We are talking about human beings. They are being tortured, they are being raped and they are being killed,' he said. 'That's not a matter of territory. That's a matter of life, of families, of children, of their histories.'\nUkrainian President Volodymyr Zelensky hit back at the 'insane' suggestion from a reporter Tuesday that Ukraine should give Russian President Vladimir Putin some occupied territory to end the war\nA local resident reacts to her flat being shelled in the Russian-controlled Donetsk region of Ukraine. Zelensky argued that giving up territory to the Russians is 'insane' because it would be losing part of 'Ukrainian society'\n'I don't know whose idea it is, but I have a question to these people, if they are ready to give up their children to terrorists. I think no,' Zelensky then offered.\nZelensky also said that 'extreme' Republicans would be 'judged harshly' by history for trying to make military aid to Ukraine conditional on there also being plan for more security at the border with Mexico.\nBiden said 'holding Ukraine funding hostage' was not the way to get a deal on security for the southern American border and he took the opportunity to slam Republicans' extreme agenda.\n'Holding Ukraine funding hostage in an attempt to force through an extreme Republican partisan agenda on the border is not how it works. We need real solutions,' he said.\n'This is stunning that we've gotten to this point. I will not walk away from Ukraine and neither will the American people,' he noted.\nBiden added: 'Putin is banking on the United States failing to deliver for Ukraine. History will judge harshly those who turned their back on freedom's cause. Putin will keep going.'\nThe two men wrapped up their afternoon of meetings at the White House with a joint press conference.\nVolodymr Zelensky and Joe Biden take questions at the White House\nU.S. President Joe Biden speaks during a joint press conference with Ukraine's President Volodymyr Zelenskiy at the White House in Washington, U.S., December 12, 2023\nRussian President Vladimir Putin is photographed Tuesday at the Novo-Ogaryovo state residence, outside Moscow, as Ukrainian President Volodymyr Zelensky visited Washington\nEarlier Tuesday, Biden told Zelensky not to give up hope as he hosted the Ukrainian president at the White House on Tuesday as part of a pressure campaign to get Republicans in Congress to approve the funds needed for Kyiv to fight off Russian forces.\n'I don't want you giving up hope,' Biden said to him in the Oval Office. 'We're going to stay at your side.'\nZelensky flew into Washington to advocate for an $61.4 billion that is being held up by Republicans on Capitol Hill who want to attach provisions tied to U.S. southern border security.\n'People need to be confident that freedom will be secure and strong enough to win,' he said to Biden in the Oval.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky during a meeting in the Oval Office of the White House\nAnd Biden warned Congress will give Russian President Vladimir Putin the 'greatest Christmas gift' ever if they don't approve more funding for Ukraine.\n'Congress needs to pass a supplemental funding for Ukraine before they break for holiday recess before they give Putin the greatest Christmas gift they could possibly give him,' Biden said.\nThe Ukrainian president spent the morning at the Capitol lobbying lawmakers but it may all be for not: Senate Republican Leader Mitch McConnell told his senators the talks are going no where.\nMcConnell, at a private Senate luncheon that took place shortly before Biden's meeting with Zelensky, said the talks will be punted to January, Punchbowl DC reported.\nThe move would be a blow to Biden's administration and his Zelensky's war effort.\nBiden repeated his concern that Putin would increase his offensive if Congress didn't act. And he warned Putin was planning to bombard Ukraine's electrical grid this winter.\n'Putin plans to bombard Ukraine's electric grid and with rockets plunging families in the darkness in the coldest part of the year and doing great damage. We can't and won't let him succeed,' Biden said.\nZelensky said his country was working to become less dependent on outside aid.\n'Ukraine is greatly becoming less dependent on aid and we are moving to right direction and I want to discuss with the president how to strengthen it, especially enhancing our air defense and ability to destroy Russia's logistics,' he said.\nZelensky's in-person visit to Washington, the third since the war began, is his most crucial and is a sign of how dire the White House believes the situation: both to get Zelensky his funding and how critical that money is to hold off Russian forces.\nBiden has asked Congress for $61.4 billion for Ukraine as part of a $110 billion package that also includes money for Israel and other national security priorities.\nThe money is caught up a debate over U.S. immigration policy and border security with no sign of a deal in sight. And Congress is scheduled to leave town at the end of this week for the rest of the year.\nMany Republican lawmakers, particularly in the House, argue that enough American money has been spent on Ukraine and it's better off being spent at home. Those GOP lawmakers are trying to tie border security to the funding package for Kyiv and Israel.\nThe U.S. has already provided Ukraine $111 billion for its fight since Russian President Vladimir Putin invaded the country in February 2022.\nSenate Republican Leader Mitch McConnell - seen with President Zelensky and Senate Majority Leader Chuck Schumer in the Capitol - told his senators the talks are going no where\nUkrainian President Volodymyr Zelensky arrives at the White House\nBut the Biden administration has warned that a failure to renew military assistance to Ukraine could tip the nearly two-year-old war in Russia's favor, creating national security threats for the West.\nZelensky began his day on Capitol Hill, attending an all-senators meeting after a joint invitation from Senate Democratic Leader Chuck Schumer and Senate Republican Leader Mitch McConnell. He then met with House Speaker Mike Johnson.\nBiden's budget director Shalanda Young said on Dec. 4 that the US would run out of resources to assist Ukraine by the end of the calendar year.\nBy mid-November, the U.S. Defense Department had used 97% of $62.3 billion in supplemental funding and the State Department had used all of the $4.7 billion in military assistance funding for Ukraine it had been allocated, she noted.\nThe U.S. has supplied roughly half of the military aid to Ukraine and it's unlikely any other country could make up the difference. Additionally the U.S. has sent American weapon systems, which need U.S. ammunition.\nThe Biden administration is going all out to get Zelensky's war funded.\nSecretary of State Antony Blinken, appearing on the Sunday political talk shows, warned that the clock is ticking.\n'This is a time to really step up because if we don't, we know what happens. Putin will be able to move forward with impunity and we know he won't stop in Ukraine,' Blinken said.\nJohnson left his meeting with Zelensky seemingly unswayed on the urgent need for aid, insisting no U.S. dollars would pass over without adequate U.S. border provisions.\n'I reiterated to him that we stand with him and against Putin's brutal invasion,' the speaker said of their conversation.\nBut he added: 'I have asked the White House since the day that I was handed the gavel as speaker, and for clarity, we need a clear articulation of the strategy to allow Ukraine to win.'\nJohnson then went on to blame Democrats for not being open enough to the border provisions Republicans demand in exchange for foreign aid.\n'It is not the House's issue right now, the issue is with the White House and the Senate, and I implore them to do their job,' the speaker said.\nSchumer said he had called Johnson and asked him to keep the House in session. But Johnson said he would not do that without a clear path forward.\n'I don't know what else to do. I'm not going to have everybody sit here through Christmas twiddling their thumbs,' he said.\n'We're willing to work. The House members will work. We've shown that over and over and over, but we're not getting any cooperation from the White House and the Senate Democrats at all,' Johnson told radio host Hugh Hewitt this morning.\nZelensky, meanwhile, pleaded for 'life and death' aid to continue his country's fight against Russia.\n'The fight we're in is a fight for freedom,' he repeatedly said in the meetings, according to lawmakers.\nHe also told senators his citizens would resort to 'guerilla war' if needed and support dries up.\n'The president did mention at some point in time guerrilla warfare, if he doesn't get the kind of support – if it degraded [to] that point,' Wisconsin Sen. Ron Johnson told a group of reporters after the meeting.\n'I mean, Putin would be facing a long term guerrilla war in whatever parts of Ukraine you'd occupy that can't be particularly attractive for him,' he said.\nPresident Zelensky with House Speaker Mike Johnson\nUkrainian President Volodymyr Zelensky (center) walks with Senate Minority Leader Mitch McConnell (right) and Senate Majority Leader Chuck Schumer (left)\nBiden indicated a willingness to reach an accommodation with Republicans on border funding, but Republicans say the administration won't bend on their push for policy wins. The Biden administration says stocks that the US is able to supply to Ukraine are running low.\n'The day we get those policy changes. We'll get a big vote in the Senate and I think enough in the House,' Republican Sen. Lindsey Graham predicted.\nAs for the Ukrainians, 'they'll keep fighting forever, but they need not only the money and the aid we're going to give them. They need more weapons, longer range weapons,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Zelensky hits back at 'INSANE' suggestion he should give Putin occupied territory to end the war and insists he is confident Republicans will approve $61 billion in aid", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12857049/Zelensky-hits-INSANE-suggestion-Putin-territory-end-war.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}