{"authors": ["David Averre"], "date_download": "2024-02-05 15:28:14", "date_modify": "None", "date_publish": "2023-12-12 09:39:18", "description": "Desolate Islam Harb can be seen clutching the body of his baby son Omar to his chest and gently kissing his forehead. Meanwhile, the corpses of his two daughters lie on the ground before him.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12853821%2Fgaza-father-cradles-toddler-twin-girl-dead-israel-airstrike.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/12/09/78857833-0-image-m-30_1702373909310.jpg", "language": "en", "localpath": null, "maintext": "Heart-rending images of a Palestinian man mourning the deaths of his three young children have put into stark perspective the devastation wrought by Israel's Defence Forces in the war-torn Gaza Strip.\nDesolate Islam Harb can be seen clutching the body of his baby son Omar to his chest and gently kissing his forehead.\nMeanwhile, his eyes are transfixed on the ground below where the corpses of his two young daughters, Joid and Maria, lie still.\nTo hide their fatal injuries, their bodies are wrapped head to toe in white linens - save for their lifeless faces, with eyes pressed shut and mouths gaping as if still gasping for air.\nHarb looks quiet and solemn, as if unable to fully compute what has happened. But a third image shows his relatives sobbing as they grieve over the tiny bodies.\nThe dark images, taken in Abu Yossef Al-Najar hospital in Rafah in south Gaza, show but a glimpse of the havoc and death brought by Israeli bombs.\nMore than 18,000 Palestinians - mostly women and minors - are believed to have been killed in the past two months of war.\nIt is this death and destruction that sees Israel and the United States becoming increasingly isolated in the face of near-global calls for a peace deal in Gaza.\nA non-binding vote in favour of a ceasefire is expected to pass at the United Nations later today, even as Israel presses ahead with its offensive against Hamas that leaders say could stretch well into the New Year.\nPalestinian man Islam Harb reacts next to the bodies of his twin girls Joid and Maria and his son Omar, who were killed in an Israeli strike amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas at Abu Yossef Al-Najar hospital, in Rafah in the southern Gaza Strip\nIslam Harb holds the corpse of his baby son to his chest as he looks down at the faces of his dead daughters\nPalestinian man Islam Harb and his relatives react next to the bodies of his children\nThe grandmother of Palestinian baby Idres Al-Dbari, who was born during the war and killed in an Israeli strike in the ongoing conflict between Israel and the Palestinian Islamist group Hamas, reacts at Abu Yousef al-Najjar hospital in Rafah in the southern Gaza Strip December 12, 2023\nAn Israel Defense Forces (IDF) artillery unit, using a self-propelled artillery howitzer, fires towards Gaza near the border on December 11, 2023 in Southern Israel\nA picture taken from southern Israel near the border with the Gaza Strip on December 12, 2023, shows smoke billowing during Israeli bombardment of the Palestinian territory\nThe grandfather of Sidal Abu Jamea, a Palestinian girl from Khan Yunis, carries her wrapped body after she died overnight while sleeping in a tent from a shrapnel fragment that hit her in the head\nA Palestinian mourns relatives killed in the Israeli bombardment of the Gaza Strip at a morgue in Rafah on Tuesday, Dec. 12, 2023\nA view of debris in the aftermath of Israeli strikes on houses, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip, December 12, 2023\nPeople search building rubble for items to salvage following an early morning Israeli strike in Rafah\nPalestinians pick through rubble to find survivors and any items of value that may be salvageable\nPalestinian man Islam Harb reacts next to the bodies of his twin girls Joid and Maria\nIsraeli Defence Minister Gallant yesterday refused to commit to a firm timeline, but signalled that the current phase of heavy ground fighting and airstrikes could stretch on for weeks and that further military activity could continue for months.\nHe said the next phase would be lower-intensity fighting against 'pockets of resistance' and would require Israeli troops to maintain their freedom of operation.\nPrime Minister Benjamin Netanyahu has said Israel will maintain security control over Gaza indefinitely.\nIn light of the soaring death tolls, the UN secretary-general and Arab states have rallied much of the international community behind calls for an immediate cease-fire.\nBut the US vetoed those efforts at the UN Security Council last week as it rushed tank munitions to Israel to allow it to maintain the offensive.\nThe resolution put forth on Friday was backed by almost all other Security Council members and dozens of other nations - the final vote in the 15-member council was 13-1, with the US the only veto, and the UK abstaining.\nToday's non-binding vote on a similar resolution at the General Assembly would be largely symbolic of the international community's condemnation of ongoing bombing of Gaza.\nMuch of the northern part of the Strip has been obliterated, and hundreds of thousands have fled to ever-shrinking so-called safe zones in the south.\nThe health care system and humanitarian aid operations have collapsed in large parts of Gaza, and aid workers have warned of starvation and the spread of disease among displaced people in overcrowded shelters and tent camps.\nStrikes overnight and into Tuesday in southern Gaza - in an area where civilians have been told to seek shelter - killed at least 23 people, according to an AP reporter stationed at a nearby hospital.\nIn northern Gaza, the aid group Doctors Without Borders said a surgeon in the Al-Awda hospital was wounded Monday by a shot from outside the facility, which it says has been under 'total siege' by Israeli forces for a week. There was no immediate comment from the military.\nUS Deputy Ambassador to the UN Robert Wood raises his hand during a United Nations Security Council meeting on a resolution calling for a ceasefire in Gaza at UN headquarters in New York on December 8\nPeople mourn by the body of a member of the Harb family killed following Israeli bombardment\nA youth mourns by the bodies of relatives killed following Israeli bombardment at al-Najjar hospital in Rafah\nPalestinians inspect the damage at the site of Israeli strikes on houses, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip, December 12, 2023\nIsraeli Defence Minister Yoav Gallant said the attacks on Gaza could go on for weeks or months\nSoldiers from an artillery unit light a hanukkiah made out of artillery charge containers on the fifth night of Hanukkah near the Gaza border on December 11, 2023\nPalestinians inspect the damage at the site of Israeli strikes on houses\nThe sun rises above Rafah in the southern Gaza Strip on December 12, 2023\nIsrael and its main ally, the US, argue that any cease-fire that leaves Hamas in power, even over a small part of the devastated territory, would mean victory for the militant group, which has governed Gaza since 2007 and has pledged to destroy Israel.\nBut many experts consider Israel's aims to be unrealistic, pointing to Hamas' deep base of support in both Gaza and the occupied West Bank, where it is seen by many Palestinians as resisting Israel's decades-old military rule.\n'Destroying Hamas, even its military capability - Israeli leaders' chief war aim - will be a tall order without decimating what remains of Gaza,' said the Crisis Group, an international think tank, in a report over the weekend that also called for an immediate cease-fire.\nGallant said Israel has already inflicted heavy damage on Hamas, killing half the group's battalion commanders and destroying many tunnels, command centers and other facilities.\nThe Israeli military said Tuesday that its aircraft targeted rocket launching posts throughout Gaza and that ground troops has found 250 rockets, mortar shells and rocket-propelled grenade launchers in a raid.\nIsraeli officials have said some 7,000 Hamas militants - roughly one-quarter of the group's estimated fighting force - have been killed and that 500 militants have been detained in Gaza the past month, claims that could not be verified.\nAt least 104 Israeli soldiers have been killed in the Gaza ground offensive, the army says.\nGallant said that in northern Gaza, Hamas has been reduced to 'islands of resistance,' while in the south, where Israel expanded ground operations earlier this month, 'they are still organized militarily.'\nHamas says it still has thousands of reserve fighters - another unverified claim - and on Monday it fired a barrage of rockets that wounded one person and damaged cars and buildings in a Tel Aviv suburb.\nThe attack set off sirens in the city, where Gallant's office and the military headquarters are located.\nIsrael launched the campaign after Hamas gunmen streamed across the border on October 7, killing some 1,200 people and seizing about 240 others.\nMore than 100 hostages, mostly women and children, were freed during a cease-fire last month in exchange for Israel's release of 240 Palestinian prisoners.\nTwo months of airstrikes, coupled with a fierce ground invasion, have resulted in the deaths of over 18,000 Palestinians, according to health officials in the Hamas-run territory.\nThe actual toll is likely higher, as thousands are missing and feared dead under the rubble, and efforts to maintain the count have been hindered by the collapse of the health sector in the north.\nIsrael blames civilian casualties on Hamas, saying it positions fighters, tunnels and rocket launchers in dense urban areas, using civilians as human shields.\nWith Israel allowing little aid into Gaza and the UN largely unable to distribute it amid the fighting, Palestinians face severe shortages of food, water and other basic goods.\nIsrael has urged people to flee to what it says are safe areas in the south, and fighting in and around the southern city of Khan Younis - Gaza's second largest - has pushed tens of thousands toward the city of Rafah and other areas along the border with Egypt.\nBut Israel has also continued to strike what it says are militant targets in so-called safe zones.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Heartbroken father cradles his toddler son as the bodies of his twin girls lie before him after they were killed in Israeli strike - as UN votes on ceasefire resolution", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12853821/gaza-father-cradles-toddler-twin-girl-dead-israel-airstrike.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}