{"authors": [], "date_download": "2024-02-05 15:28:15", "date_modify": "None", "date_publish": "2023-12-12 00:04:46", "description": "Volodymyr Zelenskiy visits Washington, saying delays to future military aid are ‘dreams come true’ for Vladimir Putin; Russian opposition leader Alexei Navalny missing", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F12%2Frussia-ukraine-war-at-a-glance-what-we-know-on-day-657.json", "image_url": "https://i.guim.co.uk/img/media/f95963903fb112e74fe027735e6d1e0b70b39033/0_0_1042_625/master/1042.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ba4ae17946fb915cd89a2decfba1978b", "language": "en", "localpath": null, "maintext": "Ukraine’s president, Volodymyr Zelenskiy, has flown to Washington, DC, in an attempt to rescue a critical $61bn military aid package, while separately the UK hinted that it may increase the value of the arms, ammunition and training that it donates to Kyiv.\nZelenskiy is due to meet the US president, Joe Biden, on Tuesday, as well as US senators and the Republican House speaker, Mike Johnson, at a time when Congress is holding up future American financial support for Kyiv’s war effort.\nShortly after arriving in the US capital, Zelenskiy said Ukraine was counting on the US, and that delays to future rounds of military aid were “dreams come true” for the Russian president, Vladimir Putin. “Putin must lose,” Zelenskiy said in a speech at the National Defense University. “You can count on Ukraine, and we hope just as much to be able to count on you.”\nDefence secretary Lloyd Austin, who introduced the Ukrainian president, said America’s commitment to Ukraine was unshakeable and supporting the war was critical to ensuring the security of the US and its allies.\nThe International Monetary Fund’s executive board (IMF) on Monday approved a $900m disbursement for Ukraine from its $15.6bn loan program, hours before IMF chief Kristalina Georgieva met Zelenskiy.\nAlexei Navalny, the jailed Russian opposition leader, has not been heard from for nearly a week and his lawyers have been unable to contact him, his supporters have said. On Monday, Navalny’s supporters said he again failed to appear by videoconference for a court hearing, with prison officials blaming a power outage. Later that day, Navalny’s lawyers were told he was no longer listed as a prisoner at IK-6, the penal colony where he has been incarcerated in the Vladimir region near Moscow.\nA decision to start talks on Ukraine’s EU accession is on a knife-edge after Hungary said it would not bow to mounting pressure to give the green light. Viktor Orbán’s threat to veto the launch of negotiations is being taken seriously, with Ukraine’s foreign minister warning of “devastating consequences” for his country if the talks are blocked.\nRussia will hold its presidential election in four annexed regions of Ukraine, Interfax news agency quoted the country’s central election commission as saying.\nRussian forces have unleashed a major offensive on Avdiivka, with 610 artillery shellings reported near the eastern Ukrainian town over the past day, according to the Ukrainian military.", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war at a glance: what we know on day 657", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/12/russia-ukraine-war-at-a-glance-what-we-know-on-day-657"}