{"authors": ["Haroon Siddique"], "date_download": "2024-02-05 15:15:31", "date_modify": "None", "date_publish": "2024-01-26 07:48:50", "description": "Judges in The Hague to decide on whether to order Israel to end its military campaign against Hamas", "filename": "https%3A%2F%2Fwww.theguardian.com%2Flaw%2F2024%2Fjan%2F26%2Ficj-to-rule-on-south-africas-case-alleging-israeli-genocide-in-gaza.json", "image_url": "https://i.guim.co.uk/img/media/f909ae1b703065391f4ff069146870006fe1342e/0_187_5600_3360/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5fd3633dee6eb20d71d3dd54d7085c4", "language": "en", "localpath": null, "maintext": "The international court of justice in The Hague is set to give a preliminary ruling on Friday in South Africa’s case alleging genocide by Israel in Gaza, as the world watches to see whether the judges will order a ceasefire.\nAt a two-day hearing this month, South Africa asked the court to issue provisional measures requiring Israel to immediately end its military campaign in Gaza, which began after the 7 October attacks by Hamas.\nAbout 1,200 Israelis, mainly citizens, were killed in the 7 October attacks, with 240 taken hostage, an estimated 129 of whom are still being held captive. The death toll from the assault on Gaza stands at almost 26,000 – mostly women and children – with a further 7,000 buried under rubble presumed dead. About 85% of the Palestinian territory’s 2.3 million people have been displaced.\nThe court’s rulings are final and cannot be appealed against, but it has no enforcement powers and Israel’s prime minister, Benjamin Netanyahu, has already said “no one will stop us, not the Hague”. However, an adverse ruling could lead to sanctions and would put more pressure on Israel’s allies and military backers – including the US, which previously described the case as “meritless” – to rein it in.\nOn Thursday, the Israeli government spokesperson, Eylon Levy, voiced confidence about the outcome. “We expect the ICJ to throw out these spurious and specious charges,” he told reporters.\nSouth Africa’s foreign minister, Naledi Pandor, is flying to The Hague to be present for the decision, suggesting confidence on the part of the claimant, too.\nThe 1948 genocide convention, enacted after the mass murder of Jews in the Nazi Holocaust, defines it as “acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group”. For provisional measures to be enacted, it is not necessary to prove conduct amounting to genocide but that at least some of the alleged acts are capable of falling within the convention.\nIn court, the South African lawyer Adila Hassim alleged that genocidal acts committed by Israel included the mass killing of Palestinians, causing serious mental and bodily harm to Palestinians, deliberately inflicting conditions of life calculated to bring about the physical destruction of Gaza in whole or in part, and Israel’s military assault on Gaza’s healthcare system.\nShe told the court: “Nothing will stop this suffering, except an order from this court. Without an indication of provisional measures, the atrocities will continue; with the Israel Defense Forces indicating that they intend pursuing this course of action for at least a year.”\nAs well as an immediate ceasefire, South Africa also asked the court to order measures prohibiting the deprivation of access to adequate food and water, humanitarian assistance and medical supplies and assistance.\nIsrael has rejected calls for a ceasefire, insisting that it will not stop until its goal of destroying Hamas, which it says is the only way to ensure its citizens’ safety, is accomplished.\nTal Becker, the Israeli foreign ministry’s legal adviser, told the court: “It is in response to the slaughter of 7 October – which Hamas openly vows to repeat – and to the ongoing attacks against it from Gaza, that Israel has the inherent right to take all legitimate measures to defend its citizens and secure the release of the hostages. This right is … not in doubt.”\nThe president of the court, the American judge Joan Donoghue, will read out the decision at 1pm local time (1200 GMT).\nUnlike the international criminal court, which is also investigating alleged war crimes by Hamas and Israel, the ICJ tries only states, not individuals.", "source_domain": "www.theguardian.com", "text": null, "title": "ICJ to give interim ruling in Gaza genocide case against Israel", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/law/2024/jan/26/icj-to-rule-on-south-africas-case-alleging-israeli-genocide-in-gaza"}