{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:28:17", "date_modify": "None", "date_publish": "2023-12-11 18:08:18", "description": "WHO chief says Gaza’s health system is ‘on its knees and collapsing’ amid intensifying ground offensive", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F11%2Fisrael-hamas-war-idf-khan-younis-gaza-hostages-threats.json", "image_url": "https://i.guim.co.uk/img/media/33a4158db8b9e5392f67e93e7687fcb0f4a2ed94/0_287_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0c11e5af6708bf746b29e38b8b74e84d", "language": "en", "localpath": null, "maintext": "Israel has rejected suggestions it is trying to force Palestinians out of Gaza as Arab leaders and aid officials warn its intensifying ground offensive could leave civilians with few other options.\nSome of the heaviest close-quarters fighting in more than two months of conflict took place over the weekend, as the Israel Defense Forces tried to consolidate control of urban centres in northern Gaza and pursued Hamas leaders in the heart of the biggest city in the south, Khan Younis.\nThe Israeli prime minister, Benjamin Netanyahu, claimed dozens of Hamas fighters had surrendered, calling it the beginning of the end for the militant group that has controlled Gaza since 2007. Hamas called the claim “false and baseless”.\nMeanwhile, the group issued fresh demands for Palestinian prisoners in Israeli jails to be released and threatened the lives of the hostages it holds if they were not.\nIsrael believes Hamas is still holding about 137 hostages, while there are thought to be 7,000 Palestinians in Israeli prisons, many detained without charge. Family members of the hostages protested at the Knesset on Monday after being refused admission to a meeting the foreign affairs and defence committee held with Netanyahu, where they sought to keep pressure on the prime minister to keep the lives of hostages central to his decisions.\nQatari officials, who helped broker a humanitarian pause last month to allow the exchange of hostages for Palestinians prisoners, said there were few immediate prospects of a repeat of such a deal. The Qatari prime minister, Sheikh Mohammed bin Abdulrahman Al Thani, said Israel’s relentless bombardment was “narrowing the window” for a potential agreement.\nThe spread of the ground offensive to the south of Gaza, accompanied by heavy bombing, has created an untenable situation for the population, humanitarian organisations have said. The death toll so far is estimated at more than 18,200 and more than 1.8 million people, or about 80% of the population, have been forced from their homes since the conflict broke out on 7 October. It was triggered by an attack by Hamas gunmen who broke through the Gaza border and went on a rampage through Israel villages, killing about 1,200 people, mostly civilians.\nIsrael has said 104 members of its forces have been killed in Gaza since the ground operation began on 27 October, and 582 soldiers have been injured.\nThe UN Relief and Works Agency (UNRWA) said 1.3 million of the displaced people in Gaza were sheltering in 154 of its facilities, which were heavily overcrowded. Aid officials have warned that cholera and pneumonia are an increasing threat among the dense camps of improvised tents along Gaza’s southern border with Egypt, as sanitation breaks down and nighttime temperatures dip.\nThe head of the World Health Organization, Tedros Adhanom Ghebreyesus, said: “Gaza’s health system is on its knees and collapsing.”\nIn face of the catastrophic humanitarian situation, Jordan’s foreign minister, Ayman Safadi, accused Israel over the weekend of “a systematic effort to empty Gaza of its people”.\nThe head of UNRWA, Philippe Lazzarini, has said that “the developments we are witnessing point to attempts to move Palestinians into Egypt”. He wrote in the Los Angeles Times: “If this path continues, Gaza will not be a land for Palestinians any more.”\nEylon Levy, an Israeli government spokesman, rejected suggestions Israel intended to empty Gaza of Palestinians as “outrageous and false accusations”, arguing that the aim was only to persuade Palestinians to leave the principal combat areas.\nThe UN and other agencies, however, have said the impact of the offensive has been to make the whole of Gaza uninhabitable and to cripple the humanitarian effort.\nView image in fullscreen Smoke rises after Israeli strikes in Khan Younis. Photograph: Ibraheem Abu Mustafa/Reuters\nThe Biden administration faced severe criticism from Arab allies and human rights organisations over the weekend for its sole vote at the UN security council against a ceasefire resolution, blocking it with the US veto.\nThe UN secretary general, António Guterres, said the security council’s “authority and credibility were severely undermined” by the failure of the resolution.\nThe matter will pass to the UN general assembly, in a debate on Tuesday on a similar resolution, most likely to be followed by a vote. A resolution passed by the assembly has no binding authority in international law, but it is expected to underline the increasing isolation of Israel and the US in their efforts to fend off a ceasefire.\nThe US secretary of state, Antony Blinken, on Sunday restated the US’s argument against a ceasefire. “With Hamas still alive, still intact and … with the stated intent of repeating 7 October again and again and again, that would simply perpetuate the problem,” he told ABC News.\nBlinken said Israeli forces should ensure “military operations are designed around civilian protection”, but admitted they had fallen short. “I think the intent is there. But the results are not always manifesting themselves,” he said.\nThe Biden administration has faced intensified scrutiny after it revealed it had bypassed Congress to supply tank shells, and was reported not to be carrying out continual assessments of whether Israel was committing possible war crimes.\nThe Washington Post cited unnamed officials as admitting the US was not following guidelines Biden established in February for all arms transfers to foreign governments to be subjected to continual examination of the recipient’s record on the Geneva conventions and other global norms for conducting warfare.\nView image in fullscreen The UN’s António Guterres speaking in Qatar. Photograph: Reuters\nIt was widely reported in the Israeli press on Monday that the US has been trying to persuade Israel to wrap up its Gaza offensive by the end of this month, while the IDF had asked for more time, until the end of January, to achieve the stated war aims, to destroy Hamas as a military and political force and secure the release of the hostages.\nBlinken said the issue of the duration of the war had been raised in US-Israeli discussions, but told CNN: “These are decisions for Israel to make.”\nIsrael’s national security adviser, Tzachi Hanegbi, said there was no deadline for Israel to achieve the twin goals of dismantling Hamas and rescuing the remaining hostages. “The evaluation that this can’t be measured in weeks is correct, and I’m not sure it can be measured in months,” he told Channel 12.\nNetanyahu criticised countries including France and Germany that have called for a ceasefire: “You cannot on the one hand support the elimination of Hamas, and on the other pressure us to end the war, which would prevent the elimination of Hamas.”\nItaly, France and Germany called on the EU to impose sanctions on Hamas and its supporters in a joint letter to the EU’s foreign policy chief, Josep Borrell, on Monday. The French foreign minister, Catherine Colonna, said France was also considering imposing sanctions on Israeli settlers in the occupied West Bank.\n“We will work on proposing sanctions on extremist settlers in the West Bank,” Borrell told reporters in Brussels on Monday.\nIn Israel’s north, violence escalated at the border with Lebanon on Sunday as Hezbollah launched explosive drones and missiles at Israeli positions and Israeli airstrikes rocked several towns and villages in south Lebanon. The IDF said on Monday it had carried out air strikes on southern Lebanon in response to missile launches aimed at communities in the northern Galilee area.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel rejects claims it is trying to force Palestinians out of Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/11/israel-hamas-war-idf-khan-younis-gaza-hostages-threats"}