{"authors": ["Amelia Horgan"], "date_download": "2024-02-05 15:28:22", "date_modify": "None", "date_publish": "2023-12-11 14:36:30", "description": "Politicians won’t listen – so a growing protest movement is working to end Britain’s contribution to the destruction, says author Amelia Horgan", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F11%2Fuk-factories-weapons-idf-gaza-protest-movement.json", "image_url": "https://i.guim.co.uk/img/media/d80704eadfe3aed433b9478343fd37e3d6fab996/0_115_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=4d0f7047c3add497fea99c8d70d14414", "language": "en", "localpath": null, "maintext": "Last Thursday morning, a thousand people across Britain made their way to a series of arms factories – in Bournemouth, Brighton, Lancashire and Glasgow – and blockaded them so that nothing could go in or out. They were protesting under the banner of a new network called Workers for a Free Palestine, which has responded to a call from Palestinian trade unions to stop arming Israel – and by extension stop the bombardment and invasion of Gaza by the Israel Defense Forces.\nThese actions have two goals. First, to immediately halt the flow of military goods and components in the Israeli military’s supply chain. But second, to reveal Britain’s contribution to Israel’s assault on Gaza. Many Britons are still unaware of the fact that weapons that are used to murder Palestinians are manufactured in anonymous, nondescript sites in towns and cities across the country.\nThe Israeli war machine is driven by two preconditions: political support and military assistance, including aid and imports. These are what enable Israel’s current attack on Gaza. Millions have already protested across the world, with massive popular support for a ceasefire, and beyond that, for an end to occupation and long overdue justice for Palestinians. They have called on their leaders to apply pressure on Israel to halt its attack.\nThese actions have had an effect. In a recent speech to local government officials obtained by the Israeli newspaper Hayom, Benjamin Netanyahu remarked, “There are huge demonstrations in western capitals. We need to apply counter-pressure … There have been disagreements with the best of our friends.”\nBut Netanyahu also noted that what he most needed from those allies was “munitions, munitions, munitions”. It is for this reason that actions like those initiated by Workers for a Free Palestine are so important. The sites that it targeted last week belong to companies that produce an advanced fighter jet known to be used by the Israeli military.\nWhat exactly is Britain’s contribution? Arms exports are secretive, making it difficult to assess their scale. Where public information about these export licences exists, it is often vague – the value and number of arms sold to Israel are hidden through scores of “open licences” that allow the unlimited export of particular goods. What we do know is that since 2008, Britain has also licensed at least £560m worth of arms exports to Israel in the more transparent standard “closed licences”.\n00:01:03 Protesters shut down UK arms factories producing Israeli fighter jet parts – video\nSome parts of the British military supply chain are more traceable. The US producer Lockheed Martin describes its F-35 fighter jet as “the most lethal, survivable and connected fighter jet in the world”. Israel has bought dozens since 2016, and struck a deal this year for an additional 25 jets financed by the annual $3.8bn (£3bn) it receives in US military aid. These planes are used to conduct aerial bombardments, including the present assault on Gaza.\nWhile Lockheed Martin is the lead contractor for the F-35, the jet is built through an international coalition, with 15% of the value of all F-35s made in Britain. According to Lockheed Martin, “the fingerprints of British ingenuity can be found on dozens of the aircraft’s key components”. Ingenious British hands look extremely bloody.\nThe four sites and companies that Workers for a Free Palestine targeted last Thursday help to produce the F-35 fighter jets. For example, BAE Systems at Samlesbury Aerodrome makes the rear fuselage for every F-35. This year, it delivered its 1000th rear fuselage for the F-35 programme. In Brighton, a subsidiary of L3Harris produces the release system that allows the jet to drop its lethal bombs.\nCombat aircraft such as the F-35 need warehouses full of spare parts, especially during a war. Almost any of the 79 companies that hold open licences to export F-35 components from the UK may be supplying spare parts to keep the jets flying over Gaza.\nThe Dutch government, for instance, operates a warehouse holding US-owned F-35 parts which have been exported to Israel for use in its ongoing bombardment.\nBritain’s role in supplying the Israeli military in recent weeks is secretive, but at least 30 RAF flights have taken off from British army bases on Cyprus, including military transport aircraft. Beyond supplying critical components from the British arms industry, the British military is playing a fundamental role in facilitating arms shipments by other countries and flying its own surveillance drones over Gaza.\nA new movement of solidarity in the UK and across the world is targeting the weapons industry. At Workers for a Free Palestine’s first action there were 100 people involved, at the second, 400; last week, there were 1,000. When politicians refuse to listen, taking action by organising in local communities and workplaces to stand in solidarity with Palestinians under attack is one of the few political avenues available to people in Britain.\nAmelia Horgan is a writer from London. She is the author of Lost in Work and attended the Workers for a Free Palestine action on 7 December", "source_domain": "www.theguardian.com", "text": null, "title": "UK factories help build the jets used by the Israeli military. They should be stopped", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/11/uk-factories-weapons-idf-gaza-protest-movement"}