{"authors": ["Emily Goodin", "Senior U.S. Political Reporter"], "date_download": "2024-02-05 15:28:23", "date_modify": "None", "date_publish": "2023-12-11 20:55:49", "description": "President Volodymyr Zelensky warned Americans that failure to help his country defeat Russia is fulfilling Vladimir Putin's 'dreams' of wrecking democracy in Europe.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12851761%2FZelensky-Congress-helping-Putin-aid-stalled.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/11/20/78836647-0-_Let_me_be_frank_with_you_friends_if_there_s_anyone_inspired_by_-a-10_1702328082772.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian President Volodymyr Zelensky on Monday warned Americans that failure to help his country defeat Russia is fulfilling Vladimir Putin's 'dreams' of wrecking democracy in Europe.\n'Let me be frank with you, friends — if there's anyone inspired by unresolved issues on Capitol Hill, it's just Putin and his sick clique,' Zelensky told the National Defense University. 'They see their dreams come true when they see delays.'\n'When the free world hesitates, that's when dictatorships celebrate.'\nHis harsh words came as lawmakers aid for his country is caught up a debate over U.S. immigration policy and border security with no sign of a deal in sight and Putin was spotted sipping champagne in Moscow and celebrating waning Western support for Kyiv as he declared that Ukraine had 'no future.'\n'Let me be frank with you, friends — if there's anyone inspired by unresolved issues on Capitol Hill, it's just Putin and his sick clique,' Ukrainian President Volodymyr Zelensky said\nZelensky said politicians should not 'betray the soldier' as he pointed to the drying up U.S. being cheered by Putin.\n'You can count on Ukraine and we hope just as much to be able to count on you,' Zelensky said. 'Putin must lose.'\nHis warning came ahead of his meeting with Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs of Staff General Charles Brown at the National Defense University.\nZelensky is in Washington as part of a critical push for aid for his war-torn country.\nRepublican senators last week blocked $106 billion in emergency aid primarily for Ukraine and Israel after conservatives balked at the exclusion of immigration reforms they had demanded as part of the package.\nAbout $60 billion of that aid would go to Ukraine, adding to the $111 billion it has already received from the US. Many Republican lawmakers, particularly in the House, argue that enough American money has been spent on Ukraine and it's better off being spent at home.\nBut the administration has warned that a failure to renew military assistance to Ukraine could tip the nearly two-year-old war in Russia's favor, creating national security threats for the West.\n'This cannot wait,' Biden said in an impassioned, televised address at the White House on Wednesday.\n'Frankly, I think it's stunning that we've gotten to this point in the first place, where Republicans in Congress are willing to give Putin the greatest gift he could hope for.'\nZelensky said he would tell Biden and lawmakers about the achievements he can see Ukraine winning in the next year.\n'I'm confident that freedom can be stronger than any of its enemies,' he said.\nHe wore his trademark army style green sweatshirt, emblazoned with the words 'I'm Ukrainian,' and flew into Washington after a round of diplomacy this weekend in Argentina.\nPutin, meanwhile, appeared in a video circulated online Sunday where he said Ukraine will only grow weaker as Russia grows stronger.\n'When you don't have your own foundations, you don't have your own ideology, you don't have your own industry, you don't have your own money,' he said, holding a glass of champagne in his hand. 'You don't have anything that's your own. Then you don't have a future, but we have a future.'\nRussian President Putin appeared in a video circulated online Sunday where he said Ukraine will only grow weaker as Russia grows stronger and sipped champagne\nUkrainian President Volodymyr Zelensky and International Monetary Fund (IMF) Director Kristalina Georgieva pose for photos at the IMF prior to their meeting\nZelensky will also meet the heads of the International Monetary Fund and World Bank as he seeks to shore up his embattled nation's economy.\nOn Tuesday, Zelensky will begin his day on Capitol Hill, attending an all-senators meeting after a joint invitation from Senate Democratic Leader Chuck Schumer and Senate Republican Leader Mitch McConnell. He'll then meet with House Speaker Mike Johnson.\nThen he heads to the White House for an Oval Office meeting with Biden and a joint press conference with the president.\n'This is exactly the right time to have President Zelensky in town to have these discussions because of what's going on in Ukraine, the increased activity we're seeing by the Russian armed forces as winter approaches, but also what's going on Capitol Hill,' National Security Council spokesman John Kirby said on Monday.\nBiden's budget director Shalanda Young said on Dec. 4 that the US would run out of resources to assist Ukraine by the end of the calendar year.\nBy mid-November, the U.S. Defense Department had used 97% of $62.3 billion in supplemental funding and the State Department had used all of the $4.7 billion in military assistance funding for Ukraine it had been allocated, she noted.\nThe U.S. has supplied roughly half of the military aid to Ukraine and it's unlikely any other country could make up the difference. Additionally the U.S. has sent American weapon systems, which need U.S. ammunition.\nThe Republican right-wing, led by 2024 presidential candidate Donald Trump, has dramatically soured against Ukraine's cause.\n'What's in America's best interest is to accept Ukraine is going to have to cede some territory to the Russians and we need to bring the war to a close,' Senator JD Vance, a close Trump ally, said Sunday.\nHe dismissed as 'preposterous' White House warnings that allowing Russia to win in Ukraine would put other eastern European countries, including NATO members, at risk.\nZelensky's wife is also making a plea to Europe as Hungry threats to veto a vote in the European Union to approve $50 billion in aid for Ukraine.\n'We really need the help,' Olena Zelenska told the BBC over the weekend. 'In simple words, we cannot get tired of this situation, because if we do, we die.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Zelensky says Congress is helping Putin by stalling on sending more U.S. aid: Ukrainian president says stopping money would be 'fulfilling Kremlin dreams' as he prepares to ask Biden and Republicans f", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12851761/Zelensky-Congress-helping-Putin-aid-stalled.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}