{"authors": [], "date_download": "2024-02-05 15:28:31", "date_modify": "None", "date_publish": "2023-12-11 03:27:15", "description": "Economist Javier Milei sworn in as Argentina’s president and immediately moves to prepare public for drastic public spending cuts", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fargentina-javier-milei-economy-b2461738.html.json", "image_url": "https://static.independent.co.uk/2023/12/10/17/APTOPIX_Argentina_Milei_Inauguration_41665.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIt wasn't the most uplifting of inaugural addresses. Rather, Argentina's newly empowered president Javier Milei presented figures to lay bare the scope of the nation's economic “emergency,” and sought to prepare the public for a shock adjustment with drastic public spending cuts.\n“We don’t have alternatives and we don’t have time. We don’t have margin for sterile discussions. Our country demands action, and immediate action. The political class left the country at the brink of its biggest crisis in history,” he said in his inaugural address to thousands of supporters in the capital, Buenos Aires. “We don’t desire the hard decisions that will be need to be made in coming weeks, but lamentably they didn't leave us any option.”\nSouth America's second largest economy is suffering 143 per cent annual inflation, the currency has plunged and four in 10 Argentines are impoverished. The nation has a yawning fiscal deficit, a trade deficit of $43bn, plus a daunting $45bn debt to the International Monetary Fund, with $10.6bn due to the multilateral and private creditors by April. “There’s no money,” is Mr Milei’s common refrain. He repeated it Sunday to explain why a gradualist approach to the situation, which would require financing, was not an option.\nBut he promised the adjustment would almost entirely affect the state rather than the private sector, and that it represented the first step toward regaining prosperity.\n“We know that in the short term the situation will worsen, but soon we will see the fruits of our effort, having created the base for solid and sustainable growth,” he said.\nMr Milei, 53, rose to fame on television with profanity-laden tirades against what he called the political caste. He parlayed his popularity into a congressional seat and then, just as swiftly, into a presidential run. The overwhelming victory of the self-declared “anarcho-capitalist” in the August primaries sent shock waves through the political landscape and upended the race.\nArgentines disillusioned with the economic status quo proved receptive to an outsider's outlandish ideas to remedy their woes and transform the nation. He won the election's 19 November second round decisively – and sent packing the Peronist political force that dominated Argentina for decades. Still, he is likely to encounter fierce opposition from the Peronist movement’s lawmakers and the unions it controls, whose members have said they refuse to lose wages.\nEarlier on Sunday, Mr Milei was sworn in inside the National Congress building, and outgoing President Alberto Fernández placed the presidential sash upon him. Some of the assembled lawmakers chanted “Liberty!”\nAfterward, he broke tradition by delivering his inaugural address not to assembled lawmakers but to his supporters gathered outside – with his back turned to the legislature. He blamed the outgoing government for putting Argentina on the path toward hyperinflation while the economy stagnated, saying the political class “has ruined our lives.”\n“In the last 12 years, GDP per capita fell 15 per cent in a context in which we accumulated 5,000 per cent inflation. As such, for more than a decade we have lived in stagflation. This is the last rough patch before starting the reconstruction of Argentina,” he said. “It won’t be easy; 100 years of failure aren’t undone in a day. But it begins in a day, and today is that day.”\nGiven the general bleakness of Mr Milei’s message, the crowd listened attentively and cheered only occasionally. Many waved Argentine flags and, to a lesser extent, the yellow Gadsden flag that is often associated with the US libertarian right and which Mr Milei and his supporters have adopted.\n“Economically, we are just like every Argentine, trying to make it to the end of the month,” said Wenceslao Aguirre, one of Mr Milei’s supporters. “It’s been a very complicated situation. We hope this will change once and for all.”\nAs Mr Milei takes office, the nation wonders which version of him will govern: the chainsaw-wielding, anti-establishment crusader from the campaign trail, or the more moderate president-elect who emerged in recent weeks.\nAs a candidate, Mr Milei pledged to purge the political establishment of corruption, eliminate the Central Bank he has accused of printing money and fueling inflation, and replace the rapidly depreciating peso with the US dollar.\nBut after winning, he tapped Luis Caputo, a former Central Bank president, to be his economy minister and one of Caputo’s allies to helm the bank, appearing to have put his much-touted plans for dollarization on hold.\nMr Milei had cast himself as a willing warrior against the creep of global socialism, much like former US president Donald Trump, whom he openly admires. But when Mr Milei traveled to the US last week, he didn't visit Mar-a-Lago; rather, he took lunch with another former US leader, Bill Clinton.\nHe also dispatched a diplomat with a long history of work in climate negotiations to the ongoing COP28 conference in Dubai, Argentine newspaper La Nacion reported, despite having insistently rejected humanity's involvement in global warming. And he backtracked on plans to scrap the nation's health ministry.\nAnd during his inaugural address, he directed some comments to the political class, saying that he has no intention to “persecute anyone or settle old vendettas,” and that any politician or union leader who wants to support his project will be “received with open arms.”\nHis moderation may stem from pragmatism, given the scope of the immense challenge before him, his political inexperience and need to sew up alliances with other parties to implement his agenda in Congress, where his party is a distant third in number of seats held.\nHe chose Patricia Bullrich, a longtime politician and first-round adversary from the coalition with the second most seats, to be his security minister, as well as her running mate, Luis Petri, as his defense minister.\nStill, there are signs that Mr Milei has not given up his radical plans to dismantle the state. Already he has said he will eliminate multiple ministries, including those of culture, environment, women, and science and technology. He wants to meld the ministries of social development, labor and education together under a single ministry of human capital.\nFollowing his inaugural address, Mr Milei traveled in a convertible to the presidential palace. Later on Sunday he is scheduled to swear in his ministers and meet with foreign dignitaries.\nProminent far-right figures will be among them: Hungarian Prime Minister Viktor Orbán; the head of Spain's Vox party, Santiago Abascal; former Brazilian President Jair Bolsonaro and Bolsonaro-allied lawmakers, including his son.\nMr Milei reportedly sent a letter inviting Brazil's current president, Luiz Inácio Lula da Silva, after calling the leftist “obviously” corrupt last month during a televised interview and asserting that, if he became president, the two would not meet.\nLula dispatched his foreign minister to attend Mr Milei's inauguration.\nAlso joining was Ukrainian President Volodymyr Zelenskyy, who is making his first visit to Latin America as Kyiv continues to court support among developing nations for its 21-month-old fight against Russia’s invading forces. Mr Zelenskyy and Mr Milei shared a close exchange just before the inaugural address.", "source_domain": "www.independent.co.uk", "text": null, "title": "Javier Milei prepares Argentina for shock adjustments in inaugural speech: ‘We don’t have time’", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/argentina-javier-milei-economy-b2461738.html"}