{"authors": ["Kenneth Roth"], "date_download": "2024-02-05 15:15:32", "date_modify": "None", "date_publish": "2024-01-26 17:46:11", "description": "Will Israel’s allies urge Israel to comply with the court’s ruling? It would do enormous damage to the ‘rules-based order’ if they make an exception for Israel", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F26%2Ficj-ruling-israel-western-backers.json", "image_url": "https://i.guim.co.uk/img/media/845a8e33e16abfeeb004499338eebe3d93b8c646/0_0_8000_4802/master/8000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=271d5a46e95d3f2ee93e646addc0eca1", "language": "en", "localpath": null, "maintext": "The international court of justice’s (ICJ) ruling in South Africa’s genocide case was a powerful repudiation of Israel’s denialism. By an overwhelming majority, the court found a “plausible” case that provisional measures were needed to avoid “irreparable prejudice” from further Israeli acts in Gaza that could jeopardize Palestinian rights under the genocide convention.\nThe public posture of various Israeli officials was, in essence: how dare anyone accuse us of genocide. After all, they pointed out, Israel was founded after the Holocaust to protect the Jewish people from genocide, Hamas attacked Israel on 7 October, and many of Hamas’s statements seem genocidal in intent.\nYet none of that is a defense to the charge of genocide. Regardless of Israel’s history, regardless of its claim of self-defense, the means chosen to fight Hamas can still be genocidal. The court found enough merit in that claim to recognize that Palestinian civilians need the court’s protection.\nThe court’s ruling was also a repudiation of Israel’s western backers. The Biden administration had called the suit “meritless”. The British government said it was “nonsense”. By a vote of 15 to 2, the ICJ judges found otherwise.\nOn the need to allow humanitarian aid to a starving population in Gaza and to prevent and punish the incitement of genocide, even the respected Israeli judge, Aharon Barak, joined the majority, making the vote 16 to 1 – a powerful repudiation of those who try to chalk up challenges to Israel’s conduct in Gaza as an unfair double standard or antisemitism.\nIn compelling detail, the court recounted the extraordinary suffering of Palestinian civilians in Gaza as they are bombed and besieged by Israeli forces. Transcending the contrasting visions presented by the Israeli and South African lawyers, the court relied on statements by UN officials to describe the appalling deaths, injuries, displacement, starvation, deprivation of healthcare and trauma. The suffering could get a whole lot worse, the court noted, if it did not intervene.\nThe court’s brief ruling did not delve too far into the factual disputes, but it implicitly rejected key elements of the Israeli defense. The Israeli lawyers had emphasized that Hamas uses human shields and fights from populated areas, but the court implicitly found those facts insufficient to justify the massive loss of civilian life caused by such practices as dropping huge 2,000lb bombs in heavily populated areas.\nThe Israeli lawyers had stressed that Israel is allowing humanitarian aid into Gaza, but UN officials were unequivocal in describing how the drips and drabs of aid allowed, and the bureaucratic obstacles mounted to its delivery, had left the civilian population on the brink of catastrophe.\nThe lawyers noted that in many instances Israeli forces have acted to protect Palestinian civilian life, but genocide can be committed against only part of a population. The Israeli government may have been causing just enough devastation to force Palestinians out of Gaza, as several ministers have suggested.\nOne of the most powerful parts of the South African case had been its citation of the statements of senior Israeli officials to show genocidal intent. The Israel government had tried to explain those statements away by suggesting they were made in the heat of the moment and were contradicted by formal secret orders from the Israeli cabinet that it had delivered to the court.\nThe court’s ruling shows that even governments with powerful friends can be held to account\nThe court was unpersuaded, citing the statement of Defense Minister Yoav Gallant – a central figure in the chain of command – that he had “released all restraints” and that Israel was fighting “human animals”. The court also cited President Issac Herzog’s statement: “It is an entire nation out there that is responsible. It is not true this rhetoric about civilians not being aware, not involved.”\nThe current proceedings were not about the ultimate merits of the case. It could take years to determine whether Israel has committed genocide in Gaza. But the provisional measures ordered by the court could make an enormous difference in curbing the death and suffering of Palestinian civilians now.\nThe key will be enforcement. The ICJ ruling is “binding”, as the court stressed, but the ICJ has no military or police force at its disposal. For coercive measures, it would need a resolution of the UN security council, which requires contending with the US government’s veto, so often deployed to protect Israel.\nBut the political pressure to comply with the ruling will be enormous. Having trusted the court to send its lawyers to The Hague to present its case, Israel would look horrible to reject the court just because it lost. In calling the underlying genocide charges “outrageous” – a finding that, as mentioned, the court did not yet address – the Israeli prime minister, Benjamin Netanyahu, notably did not say he would refuse to comply with the court’s provisional measures. Let’s hope he will.\nSome were disappointed that the ICJ did not order a ceasefire, a step that was unlikely because the court addresses only disputes between states, so Hamas was not a party. A ceasefire imposed on only one side to an ongoing armed conflict is not plausible.\nThe court did order Israel to “take all measures within its power” to halt acts that contribute to genocide, to allow sufficient humanitarian aid into Gaza to end the suffering among Palestinian civilians, and to prevent and punish the public statements of incitement made by senior Israeli officials. Israel must report back to the court in a month on the steps it has taken.\nYet there is a lot of wiggle room in those orders. That’s where Israel’s supporters come in. Will they move past their earlier skepticism toward the case and now urge Israel to comply? Western governments backed the ICJ in similar rulings against Myanmar, Russia and Syria. It would do enormous damage to the “rules-based order” that Western governments claim to uphold if they were to make an exception for Israel.\nJoe Biden holds the most powerful leverage. The US government provides $3.8bn in annual military aid to Israel and is its principal arms supplier. That support should stop if the Israeli government ignores the court’s ruling. The US president should no longer put his fear of domestic political consequences, or his personal identification with Israel, before the lives of so many Palestinian civilians.\nOther pressure for compliance could come from the international criminal court. Unlike the ICJ, which resolves disputes between states, the ICC prosecutes individuals for such crimes as genocide, war crimes and crimes against humanity. Better behavior now is no defense for crimes already committed, but if Israel were to ignore the ICJ ruling, that would be an added spur for the ICC prosecutor, Karim Khan, to act.\nMuch is still unresolved, but today is a win for the rule of law. South Africa, a nation of the global south, was able to transcend power politics by invoking the world’s leading judicial institution. The court’s ruling shows that even governments with powerful friends can be held to account. That provides hope for the profoundly suffering Palestinian civilians of Gaza. It is also a small but important step toward a more lawful, rights-respecting world.", "source_domain": "www.theguardian.com", "text": null, "title": "The ICJ ruling is a repudiation of Israel and its western backers", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/26/icj-ruling-israel-western-backers"}