{"authors": [], "date_download": "2024-02-05 15:28:34", "date_modify": "None", "date_publish": "2023-12-11 10:58:00", "description": "/PRNewswire/ -- Lucinity, a cutting-edge provider of advanced financial crime prevention solutions, has entered into an agreement with Trustly, the innovative...", "filename": "https%3A%2F%2Fwww.prnewswire.co.uk%2Fnews-releases%2Flucinity-joins-forces-with-trustly-to-elevate-financial-crime-prevention-302011288.html.json", "image_url": "https://mma.prnewswire.com/media/2208676/4442134/Lucinity_Logo.jpg?p=facebook", "language": "en", "localpath": null, "maintext": "REYKJAVIK, Iceland, Dec. 11, 2023 /PRNewswire/ -- Lucinity, a cutting-edge provider of advanced financial crime prevention solutions, has entered into an agreement with Trustly, the innovative online payment solutions company. This collaboration marks a significant milestone in the financial technology landscape as Trustly integrates Lucinity's state-of-the-art technology to enhance the resilience and effectiveness of its financial crime prevention operations.\nLucinity's sophisticated AI-driven solutions, known for their capability to detect and mitigate financial crimes, will empower Trustly to bolster its defense mechanisms against evolving threats in the financial industry. By leveraging Lucinity's expertise, Trustly aims to fortify its commitment to maintaining the highest standards of security and compliance.\n\"We are excited to join forces with Trustly to further strengthen the defenses against financial crime. Lucinity's technology is designed to adapt to the ever-changing landscape of illicit activities, providing Trustly with a robust shield to safeguard its operations,\" said Gudmundur Kristjansson, Founder and CEO of Lucinity.\nTrustly, known for its innovative and secure payment solutions, recognizes the paramount importance of staying ahead in the battle against financial crime. The collaboration with Lucinity aligns with Trustly's dedication to providing a secure and seamless experience for its users.\nLucinity and Trustly's joint commitment to excellence and innovation in the financial technology sector is clearly demonstrated through their collaboration. As both companies continue to evolve, this joint effort is poised to set new benchmarks in the fight against financial crime.\nAbout Lucinity:\nLucinity is a leader in AI software for financial crime compliance. Lucinity's platform, renowned for its user-friendliness, employs advanced AI to provide fast, clear insights, enhancing efficiency and decision-making. Trusted by top-tier banks and FinTechs, Lucinity aids in ensuring compliance, operational excellence, and risk reduction.\nLogo - https://mma.prnewswire.com/media/2208676/4442134/Lucinity_Logo.jpg", "source_domain": "www.prnewswire.co.uk", "text": null, "title": "Lucinity Joins Forces with Trustly to Elevate Financial Crime Prevention", "title_page": null, "title_rss": null, "url": "https://www.prnewswire.co.uk/news-releases/lucinity-joins-forces-with-trustly-to-elevate-financial-crime-prevention-302011288.html"}