{"authors": [], "date_download": "2024-02-05 15:28:37", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Potential recruits would often rather bribe their way out of the country than join a military ?rife with incompetence,? the newspaper reported", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274059142%2Fukrainians-refusing-to-fight-for-corrupt-government-wapo.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1702059256.jpg", "language": "en", "localpath": null, "maintext": "Potential recruits would often rather bribe their way out of the country than join a military ?rife with incompetence,? the newspaper reported\nDraft-age Ukrainians are unwilling to fight for President Vladimir Zelensky's \"corrupt government\" and avoid conscription through bribery, forgery and perilous attempts to flee to neighboring countries, the Washington Post reported on Friday.\nWithin days of Russian troops entering Ukraine, Zelensky ordered the country's borders sealed for men aged 18-60, stationing extra guards along the frontiers to stop potential soldiers from leaving. Now, with Zelensky's former aide claiming last week that Ukraine has lost as many as 300,000 soldiers, fresh men are in short supply.\n\"Honestly, we need more soldiers. The professional military personnel are running out,\" an assault team leader with Ukraine's 68th Brigade told the American newspaper.\nKiev has repeatedly expanded its conscription efforts, taking in older men and those previously deemed unfit to fight, while reports suggest that teenagers could soon be pressed into service. Ukrainian authorities have already dropped a rule exempting men under 28 with no previous military experience from the draft, yet several civilians in this category told the Washington Post that they have no intention of showing up.\nA 20-year-old man said that he was \"not eager to risk his life in the military, given stories he has heard from friends in the ranks about insufficient training and endemic corruption, such as paying bribes to officers to receive vacation leave,\" the Post reported, noting that \"many are less than eager to fight for a military and national government that is viewed as rife with corruption and incompetence.\"\nFaced with battlefield conditions often described as a \"meat grinder,\" as many as 650,000 conscription-aged men have left Ukraine, the BBC recently reported, while \"hundreds of thousands\" more are evading service within the country, Deputy Defense Minister Natalya Kalmykova stated in October.\nThose fleeing stow away in cars, bribe border guards, or take their chances trekking through forests and crossing rivers to enter neighboring Romania, the Post reported. Guides reportedly offer safe passage through the wilderness for $1,200 and up, while \"the going rate for bribing a guard on the Moldovan border is $300.\" Those staying in Ukraine often bribe military officials for papers marking them as exempt from service.\n\"Even if you're missing a leg, they'll say you can still fly drones,\" one deserter told the newspaper, explaining that he fled to Romania because \"ordinary Ukrainians are fighting and dying while members of parliament and other elites cruise around in Mercedes and other fancy cars,\" in the Post's words. Others didn't make it, including a 46-year-old man who froze to death last month.\nThe manpower shortage has crippled Ukraine's ability to retake land from Russian forces. Speaking to the BBC last week, a Ukrainian soldier said that his men had been promised several brigades to launch an operation into the Russian-held eastern bank of the Dnieper River near Kherson. Instead, he said that he received a handful of individual companies of young conscripts.\n\"We need people, but trained people, not the green ones we have there now,\" he told the British broadcaster. \"There are guys who had spent just three weeks in training, and only managed to shoot a few times,\" he continued, adding that \"some of our marines can't even swim.\"\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Ukrainians refusing to fight for corrupt government WaPo", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274059142/ukrainians-refusing-to-fight-for-corrupt-government-wapo"}