{"authors": ["Neha Dhillon"], "date_download": "2024-02-05 15:28:38", "date_modify": "None", "date_publish": "2023-12-11 13:41:10", "description": "ISRAEL has deployed a battalion of their best, strongest and most professional female fighters to carry out a \"special activity\" in Gaza.29-year-old M", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25013873%2Fisrael-toughest-female-battalion-hamas%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/mixed-gender-infantry-battalion-bardelas-863838862.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "ISRAEL has deployed a battalion of their best, strongest and most professional female fighters to carry out a \"special activity\" in Gaza.\n29-year-old Major Shira, the commander of this elite all-female team, described their actions in the Gaza Strip as \"another glass ceiling shattered\".\n7 Israel's female soldiers have already been working on the frontline Credit: Polaris\n7 The IDF says around 18 per cent of its soldiers are women Credit: Polaris\n7 Female soldiers carry out security checks and detail suspects in Gaza Credit: Polaris\n7 Israeli female soldiers manning a checkpoint in Gaza Credit: Polaris\nShe told Israeli media that she received instructions from the commander of the mixed battalion dubbed the Cheetah Battalion to create an all-women team.\nAlthough Major Shira was unable to reveal much information about their activity, she said that their specialist team was helping with the continuation of fighting and military intelligence.\nShe said: \"We are fighters alongside men and in cooperation with special units.\n\"This is a high point, another glass ceiling that has been shattered.\"\nMajor Shira added that this is an exciting point in time for her, and her team, both as commanders in the IDF and as women.\nShe said: \"We have been through hundreds of violent smuggling, and shooting is not a foreign thing to us, and still, entering Gaza is different.\n\"What's more, we have a responsibility. A petition to return all female fighters home. I am very proud of them, they simply give their souls.\"\nCaptain Panina, 26, was a former police officer who has also been given a significant role, as part of this task force.\nMuch like Major Shira, she believes that the successes of their battalion is paving the way for future female fighters in the IDF.\nShe said: \"When the fighting started, we did things that had never been seen before in the battalion.\n\"We arrived from the Egyptian sector to Gaza, which is an area of ​​more than 200 km.\n\"It's crazy. A large force of the battalion arrived at Holit to help, evacuate the wounded and fight.\n\"At the beginning we captured a line of defense in the envelope, this has not happened before.\"\nCaptain Panina added: \"This is one of the most frightening, exciting and significant events. In the end when you enter it is a battlefield.\n\"You see, hear and smell everything. October 7 was a turning point, everything we have experienced since then is complex.\n\"The feelings are mixed, there is no one in the country who has not lost someone or been injured.\"\nShe went on to speak about the \"crazy motivation\" female combatants are currently experiencing, and suggested that the war has changed her societies attitudes to female fighters.\nCaptain Panina said: \"It seems that the discussions and controversies that have been heard on the subject until today are similar to the facts on the ground.\n\"The reactions are exciting and moving, there is a lot of interest.\"\nWhile Major Shira said: \"There were always raised eyebrows, and now a little less.\n\"We see that the attitude is changing, we pass through the settlements and see the citizens' perspective.\n\"We receive a lot of feedback about the professionalism, and our truth is that it feels natural, especially in the field.\n\"We breathe the mission and the operationality.\"\nAlthough women were allowed to join the IDF as combat soldiers in 1948, following the end of the War of Independence, women were banned from holding such positions.\nThis stance lasted until the late 1990s when women were permitted to join infantry units and the artillery corps.\nIn the early to mid 200s, more positions were opened to them - such as the military police, combat engineering corps, and other units - although they still faced a lot of resistance.\nNow, attitudes have been changing as Israel turn its attention to the annihilation of Hamas.\nThis is especially the case after one all-female defence squad were able to liberate a kibbutz early in the fighting against Hamas.\nAs Lt-Col Ben-Yehuda and her 12-women squad zoned in on a Hamas base in the southern Israel kibbutz of Sufa while 50 heavily-armed terrorists charged towards them.\nAt the time it was reported that the commander came face-to-face with a male terrorist and shot him at close range.\nShe instead directed her attack fire at the terrorists who were out in the open and scattered around the base.\nIt took 14 hours for them to secure the base.\nLt-Col Ben-Yehuda said the result was proof there \"are no more doubts about female combat soldiers\".\nShe praised her soldiers' \"significant contributions\" to winning the battle and killing about 100 terrorists, as well as saving the lives of the wounded by carrying out helicopter evacuations while under fire.\nShe said: \"The training and performance [of the female combat units] on the battlefield have erased any doubts [about their ability].\n\"They fought bravely, saved lives, and emerged as heroes.\"\nIt comes as Hamas claims 18,000 Palestinians have been killed in Gaza since the outbreak of the war.\nThe terror group alleges 70% of this number is accounted for by women and children.\nHamas' figures have not been independently verified, and doubt has been cast on them by Israel and the US.\nBut the humanitarian crisis in the strip does continue to worsen.\nThe IDF's bombardment and ground invasion has also reduced much of the region to rubble.\nIsraeli forces have been warning civilians to leave, but Hamas are feared to be using innocent Gazans as human shields.\nTens of thousands more Palestinians are feared to still be lying under the debris.\nMost of Gaza's 2.3 million people are now homeless, trapped in a coastal enclave with no shelter, no food, and no water.\nUN officials have warned that without a ceasefire, Gaza risks becoming a slaughterhouse.\nBut the ceasefire motion was last week vetoed by the US.\nIsrael is attempting to destroy the terrorist group after they butchered some 1,200 Israelis - including brutalising women and children - and took dozens of hostages on October 7.\n7 Israeli troops often work in mixed battalions - but there are some all-female units Credit: Polaris\n7 Israeli troops detain another suspect in Gaza Credit: Polaris", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israel deploys world's toughest all-female ‘Cheetah Battalion’ on secret op in heart of Gaza to hunt for Hamas’s leaders", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25013873/israel-toughest-female-battalion-hamas/"}