{"authors": [], "date_download": "2024-02-05 15:28:42", "date_modify": "None", "date_publish": "2023-12-11 16:05:37", "description": "Myanmar’s military government has confirmed it's been holding talks, brokered by China, with representatives of an alliance of ethnic minority armed groups against which it is engaged in fierce combat in the country’s northeast", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fchina-ap-myanmar-beijing-bangkok-b2462160.html.json", "image_url": "https://static.independent.co.uk/2023/12/11/16/Myanmar_Conflict_80476.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nMyanmar’s military government confirmed Monday that it has been holding talks, brokered by China, with representatives of an alliance of ethnic minority armed groups against which it is engaged in fierce combat in the country’s northeast.\nFighting has been raging in northern part of Shan state since the Arakan Army, the Myanmar National Democratic Alliance Army and the Ta’ang National Liberation Army, calling themselves the Three Brotherhood Alliance, launched a coordinated offensive on Oct. 27. Their attacks have posed the greatest battlefield challenge to Myanmar’s military rulers since the army seized power from the elected government of Aung San Suu Kyi in February 2021.\nMuch of the fighting is along Myanmar’s border with China, blocking cross-border trade and raising concern in Beijing. It also threatens further political destabilization of Myanmar, a strategic ally of China that is already tangled in civil war in many parts of the country.\nThe alliance’s offensive sparked renewed fighting nationwide on the part of both the pro-democracy Peoples Defense Force and their allies among other ethnic minority armed groups, spreading the military’s forces thin.\nChina is Myanmar’s biggest trading partner and maintains good relations with the ruling generals. The groups in the alliance also have good relations with China and have vowed to protect foreign investments, such as Chinese-backed projects in territory they control.\nMaj. Gen. Zaw Min Tun, the military government’s spokesperson said in a statement phoned in to state television MRTV that the dialogue between representatives of the military government’s National Solidarity and Peacemaking Negotiation Committee and those of the Three Brotherhood Alliance had been held in order to reach a political solution to the current armed conflict.\nHe said the meetings were held with the help of China and another meeting would take place soon but gave no details.\n“I would like to say that based on the progress of these discussions, there will be further discussions around the end of this month,” Zaw Min Tun said.\nEarlier, Chinese Foreign Ministry spokesperson Mao Ning said at a news conference in Beijing that China welcomes the “positive results” of peace talks between all parties and will continue to support them.\n“We believe that the de-escalation of the situation in northern Myanmar conforms to all parties’ interests and will help maintain peace and stability of the China-Myanmar border,” Mao said.\nThe Associated Press received no immediate response to requests for comment from representatives of the Three Brotherhood Alliance.\nThe alliance has claimed widespread victories, including the seizure of more than 200 military posts and four border crossing points controlling crucial trade with China. It says hundreds of government soldiers have been killed in action.\nChina called for a cease-fire soon after the fighting escalated near its border, saying the warring parties should try and resolve their differences through dialogue.\nOne of the three groups in the alliance, the Myanmar National Democratic Alliance Army, is a military organization of the Kokang minority that is trying to oust a rival Kokang group backed by the military government from its seat of power in a key border city.\nIt has said that one of its goals is to rid the region of major organized criminal enterprises including cyberscam operations controlled by Chinese investors in collusion with local Myanmar warlords.\nBeijing is embarrassed by the large-scale criminality and has vowed to eradicate it. Tens of thousands of people involved have been repatriated to China in recent weeks. Many had been tricked into the illegal work and then held against their will.", "source_domain": "www.independent.co.uk", "text": null, "title": "Myanmar's military government says China brokered peace talks to de-escalate fighting in northeast", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/china-ap-myanmar-beijing-bangkok-b2462160.html"}