{"authors": [], "date_download": "2024-02-05 15:28:46", "date_modify": "None", "date_publish": "2023-12-11 13:02:45", "description": "Britain's Ministry of Defense is transferring two minehunting ships to Ukraine as part of a package of long-term support to bolster security in the Black Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-norway-russia-b2462013.html.json", "image_url": "https://static.independent.co.uk/2023/12/11/13/Britain_Norway_Ukraine_89745.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nBritain is transferring two minehunting ships to Ukraine as part of a package of long-term support to bolster security in the Black Sea, the Ministry of Defense said Monday.\nTransfer of the two Sandown class vessels, which are designed to help clear mines from coastal waters, comes as Britain and Norway announce plans for a new maritime coalition to increase support for Ukraine in the war with Russia.\nThe coalition will work with the Ukrainian navy to expand its forces in the Black Sea, develop a Ukrainian Marine Corps and enhance the use of river patrol craft to defend inland and coastal waterways, British authorities said.\n“These minehunters will deliver vital capability to Ukraine, which will help save lives at sea and open up vital export routes, which have been severely limited since (Russian President Vladimir) Putin launched his illegal full-scale invasion,’’ Defense Secretary Grant Shapps said in a statement.\nBritain first announced a deal to sell the two mine-hunting ships to Ukraine in June 2021, before Russia’s full-scale invasion of Ukraine. Ukrainian soldiers began training on the ships last year in Scotland.", "source_domain": "www.independent.co.uk", "text": null, "title": "UK sends 2 minehunters to Ukraine as Britain and Norway seek to bolster Kyiv's navy in the Black Sea", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-norway-russia-b2462013.html"}