{"authors": ["Isabelle Stanley", "Isabelle Stanley For Dailymail.Com"], "date_download": "2024-02-05 15:28:48", "date_modify": "None", "date_publish": "2023-12-10 13:42:05", "description": "Sgt Hay was such a good shot that she quickly earned the nickname 'sniper', saying it came from the fact 'I could find things really fast, similar to how a sniper does target detection.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12832539%2FWhen-close-friend-told-shed-never-make-Army-got-mad-shes-female-active-duty-sniper-American-history-really-appreciate-motivation.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/14/78647169-0-image-m-22_1701873940636.jpg", "language": "en", "localpath": null, "maintext": "Becoming the first ever female active-duty sniper was written in the stars for Maciel Hay - who grew up firing guns on her family's ranch.\nSgt Hay said shooting came naturally to her, and she practiced with rifles and hand guns on her family's properties in Rocklin, California and Medford, Oregon.\nShe was such a good shot that she quickly earned the nickname 'sniper' as a child, saying it came from the fact 'I could find things really fast, similar to how a sniper does target detection.'\nBut it wasn't always easy - and when a close friend told her there was no chance she could make it in the Army - she took it as a challenge.\nShe made it through basic training, qualifying as an expert with the M4 assault rifle, and graduated from airborne school as a cavalry scout with 1st Squadron, 91st Cavalry Regiment (1-91 CAV), 173rd Airborne Brigade.\nSgt Hay is the first ever active-duty female sniper\nShe graduated sniper school at Fort Moore, Georgia on November 3, 2023\nShe told the Defense Visual Information Distribution Service (DVIDS): 'A close friend of mine told me I’d never make it in the Army, and there’s no way I could become a sniper.\n'Needless to say, that person is no longer part of my life. But now that I look back at it, I really do appreciate the motivation.'\nShe decided to become a sniper when she was at Sierra College, near her hometown of Rocklin.\nShe started off with basic training, but her sharpshooter skills caught the attention of army leadership.\nTo qualify as an expert - like Sgt Hay had - snipers have to hit over 36 of 40 targets with their M4 assault rifle.\nSgt Hay said: 'Even though I only shot sharpshooter at first, then eventually expert later on in basic training, my drill sergeant encouraged me to pursue the goal of sniper school.'\nSniper school has a rigorous selection process - and candidates are usually experienced infantrymen who have demonstrated exceptional marksmanship skills.\nThey have to meet specific physical and mental requirements, as the demanding nature of sniper operations requires a high level of fitness, discipline and concentration.\nShe is now off on active service to Anchorage, Alaska\nHay grew up shooting on her family's ranch before joining the army while at college\nCandidates are tested on their marksmanship, as well as the art of stalking and concealment, observation and intelligence gathering, survival skills and land navigation.\nSgt Hay said: 'The rapid target engagement and intelligence reporting were two of the toughest areas for me.\n'I also struggled with the very last test where we had to engage long distance targets while sitting on our rucksacks. That position threw off my balance.'\nHer platoon Sgt, 1st Class Antwon Jones, 1-91 CAV, was amazed by her progress, he said: 'Sgt. Hay is just an incredible non-commissioned officer that comes to work every day with the intention of making not only her team better, but also the entire organization.'\nWhen she completed the training, she was received certification as U.S. Army Snipers and became the first ever active duty female sniper.\nPrior to Hay, only a female National Guardsman from Montana had completed the course but she didn't continue as a sniper in active-duty.\nHer family traveled from California to visit her at Fort Moore, Georgia, for the graduation.\nHer unit is the U.S. Army's contingency response force in Europe - providing rapidly deployable forces to the United States European, African and Central Command areas of responsibility\nHer graduation was the first time her family had seen her in uniform after Covid travel restrictions\nIt was the first time they were able to see her in uniform, Hay said: 'Due to COVID travel restrictions, they weren’t able to make it to my basic training or advanced individual training a few years ago.\n'Then, I went straight to Germany to join my unit. So it was really nice to see them and I’m grateful for their support.'\nNow she is qualified, she is off to Anchorage, Alaska, with the 1st Squadron (Airborne), 40th Cavalry Regiment.\nHer next goal is to become a jumpmaster - the expert paratroopers in an airborne unit who train and teach - and said people keep telling her to take the ranger training.\nShe said: 'It's great to hear stories about paratroopers doing great things.\n'But especially when it’s a female defying the odds and proving women are just as capable to do anything when they have the motivation and drive to win.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "When a close friend told her she'd never make it in the Army she got mad - now she's the first female active-duty sniper in American history: 'I really do appreciate the motivation'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12832539/When-close-friend-told-shed-never-make-Army-got-mad-shes-female-active-duty-sniper-American-history-really-appreciate-motivation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}