{"authors": ["Elena Salvoni"], "date_download": "2024-02-05 15:28:49", "date_modify": "None", "date_publish": "2023-12-10 18:33:10", "description": "The Israeli Prime Minister urged Hamas fighters to give themselves up as Israel's Defence Forces said they are closing in on their number one target - Hamas leader in Gaza Yahya Sinwar.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12847679%2FNetanyahu-Hamas-terrorists-surrender-IDF-Gaza.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/10/19/78794589-0-image-a-27_1702234939221.jpg", "language": "en", "localpath": null, "maintext": "​Benjamin Netanyahu has called on Hamas to 'surrender now' and warned that 'it is the beginning of the end' for the terror group - as Israel's relentless military offensive in Gaza continues to rumble on.\nThe Israeli Prime Minister's bullish warning to the jihadist organisation behind the October 7 attacks came as Israel's Defence Forces say they are closing in on top Hamas leader Yahya Sinwar, the number one target dubbed 'Gaza's Bin Laden'.\nReports suggest Sinwar is in hiding at an address in northwest Khan Younis, a southern city being encircled by IDF troops. In a televised statement this evening, Netanyahu declared: 'The war is still ongoing but it is the beginning of the end of Hamas. I say to the Hamas terrorists: It's over. Don't die for Sinwar. Surrender now.'\nHeavy fighting has raged in and around Khan Younis, with the IDF warning civilians to flee the centre. Israel has pressed ahead with its offensive after the US blocked the latest international efforts to halt fighting and rushed more munitions to its ally.\nThe Palestinian death toll has risen to around 18,000, according to the Hamas-run health ministry, and the humanitarian situation is becoming increasingly dire as thousands seek shelter in a shrinking area in the south of the besieged enclave.\nMeanwhile, hopes for a new ceasefire are fading as mediator Qatar said today that there is a 'narrowing' window to secure a truce, while vowing that it would continue to put pressure on both sides to halt the violence.\nA military truck packed with stripped and blindfolded Palestinians who Israel has called 'terror suspects', without providing evidence\nIsraeli Prime Minister Benjamin Netanyahu has called on Hamas terrorists to 'surrender now'\nSmoke rises as Israeli artillery units and howitzers stationed in the military zone launch attacks near the Gaza border in Nahal Oz, Israel on December 10, 2023\nYahya Sinwar, who has been dubbed Gaza's Bin Laden, is reportedly in hiding at an address in Khan Younis - a southern city being encircled by IDF troops\nFlames and smoke rise from Al Niusairat refugee camp following Israeli air strikes in the southern Gaza Strip, 10 December 2023\nSmoke rises from city of Khan Younis after Israeli strikes on Sunday, December 10, 2023\nIsrael's air and ground war has killed thousands of Palestinians since the sickening October 7 attack by Hamas and other militants killed 1,200 people and dragged around 240 back to Gaza as hostages.\nOver 100 women and children being held by Hamas were released during a weeklong cease-fire late last month, but now concerns are mounting that any chance of a fresh truce is slipping away.\nHamas has warned that no hostages would leave Gaza alive unless its demands for prisoner releases are met, with the last temporary truce seeing three Palestinian prisoners released from Israeli jails for every one hostage handed back.\n'Neither the fascist enemy and its arrogant leadership... nor its supporters... can take their prisoners alive without an exchange and negotiation and meeting the demands of the resistance,' Hamas spokesman Abu Obeida said in a televised broadcast.\nHitting out at Israeli claims that Hamas is on the brink of extinction, the terror group tonight boasted of success in their fight with Israel, brushing over its significant losses.\nIzzat al-Rishq, a senior member of the Hamas political bureau, said history would 'remember Gaza as the clearest of victories' for the Palestinian group.\n'The end of the occupation has begun in Gaza,' Rishq insisted, despite sharing no evidence of this and there being no sign that Israel is letting up in its onslaught.\nHamas earlier said Israel had launched a series of 'very violent raids' targeting Khan Younis and the road linking it to Rafah, near the border with Egypt.\nCivilians had been warned by the IDF to evacuate south to the two cities while fighting was focused in the north of Gaza, but now large swathes of the south previously labelled 'safe zones' are being targeted.\nThe UN estimates 1.9 million of Gaza's 2.4 million people have been displaced - roughly half of them children - many forced south and running out of safe places to go.\nWith hundreds of thousands crammed into a tiny area of land, the World Health Organization has tonight said the territory's health system is collapsing after more than two months of war.\nAs aid groups warn the territory is on the brink of being overwhelmed by disease and starvation, the head of the United Nations decried a divided and 'paralysed' Security Council for failing to agree on a ceasefire.\n'Gaza's health system is on its knees and collapsing,' said World Health Organization chief Tedros Adhanom Ghebreyesus, with only 14 of 36 hospitals functioning at any capacity.\nPalestinian detainees sit in a truck as Israeli soldiers stand guard and smoke rises in the background\nDozens of captives are reported to have been paraded through Palestine Square in Gaza City this week, with shoes and sandals strewn across the street in one image\nIsraeli soldiers operate with in the Shejaiya district of Gaza City on December 8, 2023\nWHO's executive board on Sunday adopted a resolution calling for immediate, unimpeded aid deliveries.\nDespite the worsening humanitarian situation, rising death toll and pressure from key ally the US to reduce civilian casualties, Israel has vowed to 'press harder' in Gaza as it says Hamas appears close to 'disintegrating'.\nIt said that more and more Hamas fighters are giving themselves up as ground operations are ramping up across the Gaza Strip.\nNetanyahu said tonight: 'In the past few days, dozens of Hamas terrorists have surrendered to our forces.'\nThe Israeli military has, however, not released proof that Hamas terrorists are surrendering, and Hamas has rejected such claims.\nThe IDF continued its onslaught against Hamas on Sunday as dozens more terror suspects were pictured bound, stripped and lined up on their knees.\nFootage shared by Israeli media shows Israel Defence Forces (IDF) troops rounding up scores of men and transporting them on the back of trucks.\nIDF spokesman Rear Admiral Daniel Hagari said tonight that leaked footage and photos showing troops detaining Palestinian men in northern Gaza was not distributed by the IDF Spokesperson's Unit.\nEXCLUSIVE READ MORE: Elderly Israeli hostage says Hamas terrorists removed her oxygen machine during 'unbearable' time being held in Gaza tunnels Advertisement\nHe added that while 'dozens' of the detained men are Hamas fighters, many others are uninvolved civilians.\nThe detained men are believed to have surrendered in the Jabalia refugee camp and other areas around northern Gaza.\nOne clip shared to social media shows Palestinian men lined up against a wall.\nOne man then steps forward to give his assault rifle to the Israeli troops with his hands in the air, while others behind him hold their up their identification cards.\nAs bombs continued to rain down on Gaza last night, IDF chief Herzi Halevi declared his forces must 'press harder' to dismantle Hamas's terror network.\n'Every day, we're seeing more and more terrorists killed, more and more terrorists wounded, and in recent days we're seeing terrorists surrendering - this is a sign their network's falling apart, a sign we need to press harder,' Halevi said at a ceremony at the Western Wall in Jerusalem's Old City.\nIsraeli military spokesman Daniel Hagari said Israeli troops have detained and interrogated hundreds of people in Gaza suspected of militant links.\nHagari told reporters: 'Jabalia and Shejaiya are 'centres of gravity'... for terrorists, and we are fighting them.\nSmoke rises above the southern city of Khan Younis after Israeli strikes on Sunday, December 10, 2023\nAn Israeli flag is pictured flying above gathered IDF troops in the Shejaiya district of Gaza City\n'They are hiding underground and come out and we fight them. Whoever is left in those areas, they come out from tunnel shafts, and some from buildings, and we investigate who is linked to Hamas, and who isn't. We arrest them all and interrogate them.'\nMeanwhile on Friday, Israel's Defense Minister Yoav Gallant told IDF soldiers that he 'sees the signs indicating a breakdown is beginning inside Gaza'.\nIt comes after Israel vowed to continue its 'just war to eliminate Hamas', as Prime Minister Benjamin Netanyahu thanked the United States for blocking a United Nations ceasefire bid.\nThe US, a key ally of Israel, was the only member to veto the UN Security Council resolution demanding an immediate humanitarian ceasefire, while the UK abstained in the vote, despite widespread international support.\nAn Israeli soldier stands by a truck with Palestinian detainees in, who Israel says are 'Hamas suspects'\nLast week Israeli military spokesman Daniel Hagari said Israeli troops have detained and interrogated hundreds of people in Gaza suspected of militant links\nIsraeli warplanes struck parts of the Gaza Strip in relentless bombardment on Saturday, hitting some of the dwindling bits of land that Israel had described as safe zones when telling Palestinians in the south to evacuate.\nResidents 'are being told to move like human pinballs - ricocheting between ever-smaller slivers of the south, without any of the basics for survival,' UN Secretary-General Antonio Guterres told the council before the UNSC vote.\nIsrael holds the Hamas militants responsible for civilian casualties, accusing them of using civilians as human shields, and says it has made considerable efforts with evacuation orders to get civilians out of harm's way.\nIsrael says Hamas operates from within hospitals and has released footage supporting the claim, and it has also targeted in the past ambulances it says were used by Hamas. Hamas has denied this.\nIsraeli soldiers operate with an APC at the Shejaiya district of Gaza city amid the ongoing conflict between Israel and Hamas in the Gaza Strip December 8, 2023\nA picture taken from southern Israel near the border with the Gaza Strip shows smoke rising during an Israeli strike on the Palestinian territory on December 10, 2023\nAlmost one month ago, Israel's Defence Minister Yoav Gallant said Hamas had 'lost control' of Gaza.\nHamas triggered the conflict with the deadliest-ever attack on Israel on October 7 in which it killed around 1,200 people, according to Israeli figures, and dragged around 240 hostages back to Gaza, 138 of whom remain captive, according to Israeli figures.\nIsrael has responded with a relentless military offensive that has reduced much of Gaza to rubble and killed at least 17,997 people, mostly women and children, according to the Hamas-run health ministry.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Netanyahu says 'it is the beginning of the end' for Hamas as dozens of terrorists give themselves up - and tells the rest 'surrender NOW': Footage shows more stripped suspects paraded by IDF - as forc", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12847679/Netanyahu-Hamas-terrorists-surrender-IDF-Gaza.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}