{"authors": ["Peter Beaumont", "Kaamil Ahmed"], "date_download": "2024-02-05 15:28:52", "date_modify": "None", "date_publish": "2023-12-10 05:00:40", "description": "The Israeli military has launched a relentless bombardment of the city, which it claims is the Hamas command centre", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F10%2Fi-keep-asking-myself-how-will-i-die-gaza-residents-in-fear-as-battle-for-khan-younis-escalates.json", "image_url": "https://i.guim.co.uk/img/media/cdde71951f7631a55ff7a3dea1a6fa681607de8c/0_125_3744_2246/master/3744.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=68e4fbbc0a7c3b92cb1e59f4e51c0d7c", "language": "en", "localpath": null, "maintext": "For Almaza Owda, in Gaza’s besieged second city of Khan Younis, thoughts have turned to how she might die.\nOn Thursday night, four days into the Israel Defense Forces (IDF) assault on the southern city, Owda – who is living in a tent in the grounds of a UN school turned shelter – described her feelings.\n“I keep asking myself how will I die?” Owda posted on social media. “Is it possible that shrapnel will hit me in the head and I die straight away? Maybe it penetrates the tent while I am sleeping and enters my body and I die from the bleeding. What might happen? There are a thousand scenarios in my head right now.\n“The bombardment is very, very violent and intense nearby. The clashes never stop. [We’re] cold, hungry, scared, stressed, tired. They bombarded around us with tank shells and all the shrapnel fell on us.”\nIn the days since the ceasefire for hostages deal broke down on 1 December and the IDF entered the third phase of its offensive against Hamas, the war has swept over Khan Younis and its surrounding towns. It began on Monday as an entire Israeli division launched its assault from the east and north, surrounding and then entering the city.\nWhile tens of thousands have been displaced further south towards Rafah – some for the second and third time in the war – those trapped inside Khan Younis have described desperate conditions in a city that was once home to 400,000.\nWith a number of neighbourhoods already reduced to rubble by the Israeli military’s bombing even before the IDF launched the latest phase of its ground offensive, and with little fuel available, some residents have taken to using donkey carts to traverse the ruins.\nCut off from outside aid, people in UN-run shelters in Khan Younis are fighting over food, said Nawraz Abu Libdeh, a shelter resident who has been displaced six times. “The hunger war has started,” he said. “This is the worst of all wars.”\nView image in fullscreen A still from a video released by the Israeli military reportedly showing bodycam footage of its soldiers going into a damaged building in Khan Younis last week. Photograph: Israel Defense Forces/Reuters\nThe violence of the assault has been grimly familiar to those who have fled the north as the Israeli military has unleashed “belts of fire” – intense barrages of high explosives used against urban areas – before following up with tanks, infantry and special forces.\nVideo released by the military showed commandos and troops moving through the city amid sounds of gunfire, taking positions behind an earthen berm, while others inside a home fired out through a window.\nThe importance of Khan Younis to Israel has been laboured in statements delivered in the past week by the IDF’s most senior commanders and politicians, including prime minister Benjamin Netanyahu.\nBordered to the east by countryside scattered with small villages that climbs gently up to the Gaza fence and the Israeli kibbutzim beyond, Khan Younis and its satellite towns – places such as Bani Suheila and Abasan al-Kabira – are spread out over a far wider urban footprint than Gaza City. To the west is the sea and another area of rural periphery where civilians have been urged by the IDF to flee.\nA socially conservative city, Khan Younis – even before the wars that have engulfed Gaza since 2008 – was long regarded as a stronghold of political support for Hamas.\nAnd after weeks of insisting that Hamas’s main command centre was in Gaza City, located under the Dar al-Shifa hospital, Khan Younis – with its refugee camp that was the childhood home of Hamas’s top leader in Gaza, Yahya Sinwar, and the group’s military chief, Mohammed Deif – is now being portrayed as Hamas’s key centre and where its leadership are hiding.\nIsraeli officials describe a similar network of Hamas tunnels in Khan Younis as in the north, some stretching as far as Rafah in the far south that borders Egypt – claims that appear to have been verified by some released hostages who were taken into “a spider’s web” of tunnels extending for miles in the area. It is in Khan Younis, too, where it is suggested that many of the remaining 138 hostages captured by Hamas on 7 October during the bloody rampage through southern Israel are being kept.\nAnd while Israel’s military made much last week of how its tanks had advanced as far as Sinwar’s house, it is an essentially meaningless claim, with Sinwar hiding elsewhere.\nEchoing earlier unfounded rumours that Sinwar had been cornered in a bunker at the beginning of the war, Netanyahu claimed the Hamas leader was in their sights. “Now they are surrounding Sinwar’s house,” said Netanyahu. “So his house is not his fortress, and he can escape, but it’s only a matter of time before we get him.”\nOther Israeli officials, however, have offered a more realistic assessment.\nSinwar is “not above the ground. He is underground”, said military spokesman R Adm Daniel Hagari a few days into the fighting. “Our job is to find Sinwar and kill him.”\nAnd while it remains largely unspoken, few in Israel will be unaware that these promises have been made before, and that in the course of its multiple conflicts in Gaza during the past 15 years, Israel has struggled to find and kill Hamas’s most senior leaders, including elusive military chief Deif.\nWhile Israel has succeeded in the past in assassinating senior Hamas figures, most significantly Sheikh Ahmed Yassin Abdel Aziz al-Rantisi, two founders of Hamas, both killings were in 2004, suggesting the precautions that those at the very top of the militant Islamist group have taken to remain out of harm’s way – even in the midst of intense conflict.\nIndeed, it is not even clear that the leadership figures most sought by Israel are in Khan Younis. And as the columnist Amos Harel suggested in a weekend piece for Haaretz – holding up the evidence of Hamas’s survival, even when senior leaders such as Yassin and Rantisi were assassinated – it is not clear what impact the killing of Sinwar or Deif would have on the group.\nInstead, an analysis of Hamas by the Washington-based thinktank the Institute for the Study of War suggests its military organisation is specifically designed to survive the loss of key leadership figures.\n“Hamas’ leaders structured the al-Qassam Brigades to survive Israeli military action by building a resilient military organisation with doctrinally correct unit echelons and command hierarchies to facilitate recovery in the face of the loss of leaders or the destruction of elements of units,” wrote analyst Brian Carter in a new paper. “Commanders prepare their subordinates throughout the chain of command to absorb command duties in the event that a commander is killed or incapacitated. Targeted killings alone will thus not permanently degrade or destroy Hamas.\n“Hamas very likely retains a deep bench of experienced military commanders, most of whom will be prepared to rebuild the organisation and train new tactical-level leaders.”\nThe nature of the fighting in dense urban environments such as Khan Younis and also in the northern areas of Shuja’iya and Jabaliya, has been emphasised by the steady reporting of Israeli combat dead in the last week as IDF troops have had to shift to house-to-house military tactics against the four Hamas battalions said to be inside the city.\nOn the Palestinian side, heavy losses have continued, with the main Nasser hospital receiving the bodies of 62 people and another 99 wounded in the past 24 hours alone.\nIn a new departure in the fighting, Israeli officials reported that in Khan Younis they had seen female Hamas combatants for the first time, including women operating as lookouts – a claim that could not be verified.\nWhile the IDF advanced rapidly in the initial assault on the city, quickly reaching parts of the centre, the momentum has slowed.\nAccording to reports at the weekend, despite the public insistence by some US officials that there is no timeline for Israel to finish the conflict, behind the scenes real disagreements around the timetable for a cessation of the main hostilities exist.\nWhile Israeli officials believe they need until the end of January to conclude large-scale combat operations, the US is pushing for an end to heavy fighting by the end of December.\n“We have not given a firm deadline to Israel – not really our role,” deputy national security adviser Jon Finer told a security forum a day before the US veto of new ceasefire calls in the UN security council on Friday. “That said, we do have influence, even if we don’t have ultimate control over what happens on the ground in Gaza.”\nWhat that influence is pushing towards was made clear by an Israeli official. “The American message is that they would like to see us finish the fighting sooner, with less harm to Palestinian civilians and more humanitarian assistance for Gaza. We would also like this to happen, but the enemy does not always agree,” a senior Israeli official told the Axios website, adding that while Israeli forces “have made significant progress” in Gaza’s north, that Israeli operations around Khan Younis “have just started”.\nWhat that means for those still in the city is weeks more of conflict. “It was a night of heavy gunfire and shelling,” said Taha Abdel-Rahman, a Khan Younis resident on Saturday morning. “As every night.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘I keep asking myself how will I die?’ Gaza residents in fear as battle for Khan Younis escalates", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/10/i-keep-asking-myself-how-will-i-die-gaza-residents-in-fear-as-battle-for-khan-younis-escalates"}