{"authors": ["Hallie Grossman", "Multiple Contributors", "John Keim", "Stephen Holder", "Kevin Seifert", "Paul Gutierrez", "Associate Press", "Marcel Louis-Jacques", "Nick Wagoner", "Adam Teicher"], "date_download": "2024-02-05 15:15:33", "date_modify": "None", "date_publish": "2024-01-26 12:30:00", "description": "For practically a decade, a shadow of should-haves has stalked the lineman. But his impact in Baltimore has been clear in a 9.5-sack season.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fnfl%2Fstory%2F_%2Fid%2F39387786%2F2024-nfl-playoffs-jadeveon-clowney-baltimore-ravens-kansas-city-chiefs-afc-championship.json", "image_url": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0125%2Fr1282412_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "Open Extended Reactions\nTHE TALK AROUND Rock Hill, South Carolina, was that when Jadeveon Clowney started peewee football, he looked like a man among boys. The locals would cast sidelong glances his mother's way, and when Josenna would insist he wasn't full-grown, that he was just the right age for peewee and she had the birth certificate to prove it, they'd concede, but not without indignation. \"Fine,\" they'd say. \"But don't let him hit my kid.\"\nAnd there he was, some 15 years later in the summer of 2014, once again making everyone else look out of their league. The ink was barely dry on Clowney's rookie contract with Houston, and he was already doing unspeakable things to Denver's offensive line all week long in preseason scrimmage.\n\"Most guys, they'd take about three or four steps to get to you, to that point of contact,\" says Duane Brown, the Texans' Pro Bowl left tackle at the time. \"And he was leaping off the ball and getting there in two.\" Brown had lined up against Clowney enough that preseason to relish the break these joint practices in Colorado afforded him. So he watched with commiseration when the Broncos' own Pro Bowl left tackle, Ryan Clady, flailed and whiffed and let Clowney make Peyton Manning's life downright miserable for the run of intersquad practices that week in August.\nClowney caught whiffs of Denver's exasperation -- you need to block 90! -- and the fodder tasted like fuel. \"Oh, god, yes,\" Clowney thought to himself. \"This is going to be fun.\"\nWhen Brown pulled up the film and dissected all the ways the Broncos could do nothing to stop Clowney, he took his new teammate off to the side in the locker room shortly after.\n\"I've played against everybody,\" said Brown, who was six years and two All-Pro seasons into the league. \"The stuff you're doing ... it's unreal.\"\nClowney's chest puffed up a little. He thanked Brown for the kudos, then went home, aglow. Later that day he called Josenna, the first person to bear witness to Clowney looking superhuman amid mortals.\n\"Hey, Mom, I'm going to be in this league for a long time,\" he said. \"It's not hard. It's easy.\"\nJadeveon Clowney is thriving this season in Baltimore, where he emerged as a critical piece of the NFL’s stoutest defense. Photo by Todd Olszewski/Getty Images\nIT WAS NOT easy.\nTen days before the Ravens will meet, then pound, the Texans 34-10 in the AFC divisional round, Clowney is tucked into a gray leather armchair in a quiet nook of Baltimore's practice facility. Though it's a perfectly normal-sized armchair, he's entirely too big for it, like a giant stuffed into dollhouse furniture, and his knees practically knock into his chin. He's 6-foot-5 and has always loomed even larger than that. For a spell, he seemed larger than life.\n\"I just want people to see that guy,\" he says, basking in the warm glow of that outstanding week in 2014 and the glory he had assumed it foretold. \"That guy from camp, who nobody ever really got to see because that guy got hurt 14 to 17 plays into the opening game of his career.\" Clowney tore his right meniscus two quarters into his rookie season, three months later underwent microfracture surgery -- often a career death knell for explosiveness, Clowney's calling card -- then was plagued by an ailing knee for years.\nHe's 30 now, still young for civilians but positively grizzled in NFL years, and when he says it out loud -- I'm 30 years old -- his eyes grow wide, like he can't quite fathom the passage of time. It has been 10 years since he entered the league, and in that time he has been deemed: the second coming of Lawrence Taylor; a letdown; the phenom he was supposed to be; a bust; a resurgent player; a recalcitrant player; a player, who -- this season, and here, with the Ravens -- is enjoying the renaissance of his career.\nHe has been everything to everybody -- fans, teams, himself -- but through it all, Brown says he has always remained Jadeveon Clowney. An idea, a presence, a force.\nThis year, of course: He's thriving in Baltimore, where he emerged as a critical part of the NFL's stoutest defense. Clowney is Pro Football Focus' 14th-best edge defender this season, the second-highest mark of his career, and earned an 80.8 pass-rush grade, his best -- period.\nBut most years too. This isn't Clowney's redemption tour, is Brown's point. It's his validation tour.\n\"Everyone has always been aware of where he is on the field,\" he says. \"One hundred percent. The consensus can be, 'All right, No. 1 pick, you're supposed to have this amount of stats and these accolades. Pro Bowls. All-Pros.' But players that play against him and coaches that prepare for him know exactly what he brings to the table.\"\nWe've waited with bated breath, year after year, in Houston and Seattle and Tennessee, in Cleveland and now in Baltimore, for The Real Jadeveon Clowney Experience to arrive.\nBut, perhaps, it was here all along.\nMAYBE IT STARTED when he played at South Pointe High and chased a guy down from about 80 yards -- his high school coach, Bobby Carroll, swears that's exactly how long the rundown was -- and tackled him short of the end zone, at the 4-yard line. Says Carroll: \"When Nick Saban watched that play, he said, 'Hey, where is this guy? I gotta meet him.'\"\nIt could've been the hit -- nay, The Hit -- his sophomore season at the University of South Carolina, when he bulldozed a Michigan running back in the Outback Bowl and the impact was so seismic that the runner's helmet flew off and up, as if some cosmic force had yanked it skyward. \"I had Justin Tuck, Osi Umenyiora, Michael Strahan,\" says Mike Waufle, who spent 20 years overseeing defensive lines in the NFL. \"I had Darrell Russell. I had Chris Long, and Robert Quinn, Kyle Williams, and Aaron Donald. You see a play like that, and you say, 'This guy is a game-changer.'\"\nOr perhaps it was just his aura. Johnathan Joseph, a teammate from his Houston days, remembers watching one-on-one blocking drills during Clowney's rookie preseason, and seeing his fellow Texans try to slide to the back of the line when they did the math and realized they'd be taking on Clowney. \"You don't really see that in the NFL,\" he says. \"We're all professionals. We're all supposed to be tough. But he was striking fear in guys from the first time he took the field.\"\nClowney's potential was on full display during the 2013 Outback Bowl, when he helped South Carolina beat Michigan with a massive hit on running back Vincent Smith. Al Messerschmidt/Getty Images\nNo matter its origin story, there has long been this notion that Clowney was preordained not just to play in the NFL, but to dominate it.\nConnor Shaw, his college quarterback, thought as much. He once marveled, \"If there was anyone ready to go in the NFL from high school, it was that dude.\"\nSo, too, did Bobby DePaul, who spent 25 years in the league, in front offices and on the sidelines and now offers radio analysis for the Ravens: \"You're talking about Michael Strahan level,\" he says, of Clowney's predraft expectations. \"I mean, Lawrence Taylor, you know?\"\nAnd Waufle: \"I've always believed this. Jadeveon Clowney should've been a Reggie White type of player.\"\nFor practically a decade now, a long shadow of should-haves has stalked Clowney. He entered the league looking for all the world like he should make quarterbacks go to sleep with visions of his dreadlocks. The explosion and the twitchiness and the sheer violence to his game. These gifts were unteachable and he had them in abundance, so people who approach the business of football with the same seriousness as they would state secrets turned giddy with possibility. He should be Lawrence Taylor. Michael Strahan. Reggie White.\nHe has not been. But two things can be true: Clowney has been very, very good; excellent, even, at times. He also hasn't lived up to his billing.\nHe has had 9.5 sacks twice in his career, including this season in Baltimore, plus two other nine-sack seasons sandwiched in between -- but he has yet to break the double-digit sack barrier.\nHe has unfathomable burst -- but if he doesn't beat his man immediately via the havoc that explosion creates, he is not skilled enough to counter with a refined arsenal of pass-rush moves.\nHe shreds second-tier offensive linemen -- but can (and often does) falter when he lines up against the league's best tackles. And if that describes most pass-rushers in the league, well, we're still left with the sour tang of disappointment because wasn't Clowney supposed to be the exception to that rule? Someone who could conquer anyone?\nWasn't he supposed to be the hero?\nWe've spent so long waiting to watch that story unfold that we missed the story he was actually telling us.\nON A WRETCHED day in January, in a game that mattered not at all -- the Ravens had, by then, procured the AFC's No. 1 seed, and by extension, a playoff bye and home-field advantage -- Clowney lined up outside, his breath making small clouds in the frosty Baltimore air, with no one but Steelers tackle Broderick Jones between him and quarterback Mason Rudolph. Clowney shot, cannon-like, out of his stance, tangled ever so briefly with Jones before overpowering him and brushing him aside, then threw wide his arms and wrapped Rudolph in what could be charitably described as a bear hug.\nBehold Jadeveon Clowney, the paragon: the speed to power, those long, bear-hugging arms, the dazzling violence. (This time, not unlike his Outback Bowl spectacular, the cosmic forces yanked on the ball, which hurtled straight for the clouds.)\nBehold Jadeveon Clowney, the enigma. Because if this play showcases all the ways in which his consequence on the field can be immediate, obvious, undeniable -- much of his career has been a study in misconstrued, borderline behind-the-scenes impact.\n\"He plays the game violently,\" Ravens defensive line coach Anthony Weaver said earlier this season. \"Sometimes that doesn't always show up on the stat sheet, but it doesn't mean he's not being impactful.\"\nClowney sacked Rudolph that day, a $750,000 bow -- thanks to contract incentives -- on his 9.5-sack season. That's a respectable haul -- and exactly right for the Jadeveon Clowney brand. He came thisclose to a double-digit sack season once more. He has hardly cracked the top 20 in sacks in a season (once, in 2017, when he tied for 19th), let alone the top 10, never mind altogether leading the NFL. But here is his not-at-all-shameful secret: Neither sacks, nor box scores, have ever really told the full Jadeveon Clowney story.\nHe is disruptive in ways that matter even when he does not get to the quarterback. This season, among edge defenders he ranks fifth in pass rush win rate -- how often a pass-rusher beats his block within 2.5 seconds -- bested only by a murderer's row: Micah Parsons and Myles Garrett; Will Anderson Jr. and T.J. Watt. That's impressive, but it's also not all that new. He ranked No. 4 in 2021, No. 7 in 2019 and No. 6 in 2018. And here's why that's vital: pass-rush wins are defensive gold. A pass play with zero pass rush wins has 0.09 expected points added and averages 6.7 yards this season. A pass play with at least one pass rush win? Those numbers plummet to -0.11 and 4.9, respectively.\n(Double-teams don't help all that much either. Parsons is in his own universe; Garrett, a separate galaxy. But Clowney is still double-teamed a lot -- on 25% of his pass rushes -- and gobbling up wins.)\nAnd still, we need to be convinced, then reconvinced, then re-reconvinced, that Clowney is actually quite good at football. Maybe we've missed it because he's quite good in ways we didn't expect -- or can't fully grasp.\nClowney, pressuring Houston's C.J. Stroud earlier this season, has proved to be a key disruptor for Baltimore this season, with 9.5 sacks. Mandatory Credit: Mitch Stringer-USA TODAY Sports\nSo he has been a consistently prodigious run defender? A collective shrug. \"I think a lot of folks were like, 'Well, we drafted you to rush the passer -- I don't really care that you set a pretty good edge in the run game,'\" says Eric Eager, the vice president of research and development for SumerSports, which advises NFL teams on roster-building. \"'I can get some fourth-rounder out of UTEP to do that.'\"\nSo he has been a dynamic jack-of-all-trades, mostly rushing (and winning) from the inside? But that's not how traditional pass-rushers get the job done. \"He's always been used as this guy who's been moved around like a chess piece, a queen on the chessboard,\" says Brandon Thorn, the offensive and defensive line guru behind the Trench Warfare newsletter. \"He's going to blitz from the A-gap, the B-gap, the C-gap. And he's just going to win with initial quickness and get penetration and slash.\"\nSo a lot of what Clowney does is not captured in its full breadth by numbers, even if he throws an entire offensive play off-kilter? We can't see it -- in writing, at least -- so we don't necessarily believe it. \"He can penetrate the backfield quickly, force the running back to go into a teammate for a tackle for loss, or go in the totally opposite direction than the play was intended to go,\" Thorn explains. \"And we just don't track anything like altering the path of the running back, you know?\"\nClowney, for his part, concurs. \"I'll be knocking the offense off their timing, or scheme, or whatever they have for their play,\" he says. \"And I've been doing that my whole career. I just don't get credit for it.\"\nAll of which has left Clowney, this player who has been fawned over and pored over and picked over since the time he first touched a football, in the unlikeliest of positions: one of the league's most misunderstood, misjudged stars.\nHALFWAY THROUGH BALTIMORE'S postseason bye week, good vibes abound in the team locker room. Nelson Agholor is singing a slew of early aughts hits with gusto (Linkin Park; NSYNC). Lamar Jackson rolls in riding something called a Modobag -- a motorized carry-on suitcase, apparently. And just around the corner, holding court at his locker amid a sea of Baltimore Sun newspapers trumpeting these Ravens as \"the AFC'S BEST,\" Clowney sounds more than a little wistful about all this good play (his and the team's) and good cheer (his and the team's).\n\"It's, like, man,\" he says. \"I should have probably been here all along.\"\nHere, in Baltimore, he's doing what he's done for a long time in this league: disrupt and bring pressure and create wins at pass rush and more than occasionally notch sacks. It's just that, for years, he managed all that in unconventional, sometimes quiet ways. This year's nifty plot twist is that for the first time (and a decade into his career), he's now doing it like -- gasp -- the traditional pass-rusher he was billed to be. He's rushing and winning the pass rush outside the corner -- after years of owning the inside. Under outside linebacker coach Chuck Smith, Clowney has perfected an honest-to-goodness pass-rush move -- after a career creating havoc from brute force and explosion, but precious little refinement. (\"The cross chop has given him welcome-to-the-NFL moments left and right,\" Thorn says.)\nIn other words, Clowney isn't enjoying a renaissance in Baltimore. He's enjoying a reinvention.\nAt practice one day during the bye, Clowney stands on the sideline next to Smith, the man who had so much to do with all that reinventing. He's loose, swaying to music that blares from a nearby speaker (I'm comin' out; I want the world to know), and it's jarring, just then, to reconcile this person with who Clowney says he was just a few short years ago.\nWeary, a touch defensive. His NFL career has gone a lot of different ways, but almost never as planned, and that left Clowney fielding questions. About his character. (\"When I got to Seattle, I had to answer questions about what kind of person I was. Do I have an attitude?\") About his desire to work. (\"I made All-Pro, but that was me at 75%,\" he says, by way of self-defense. For years he played hurt, he explains, his knee never having fully recovered, then swelling to the size of a melon day in and day out. Along the way, he battled injuries: ankle, Lisfranc, elbow, back, hip, core and left meniscus, while undergoing a slew of surgeries. And still, he muscled together award-worthy campaigns, he points out, so you do the work-ethic math.)\nSo he never amounted to Lawrence Taylor 2.0. That's just fine, he figures. And if there are people out there who want to asterisk his career because he was supposed to be Lawrence Taylor 2.0, that's all right too.\n\"I just sit back and laugh at 'em, because I'm the only Jadeveon Clowney,\" he says. \"I ain't trying to be like nobody else. I'm just trying to be me. And I'm different.\"", "source_domain": "www.espn.co.uk", "text": null, "title": "AFC title game is validation for Ravens' Jadeveon Clowney", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/nfl/story/_/id/39387786/2024-nfl-playoffs-jadeveon-clowney-baltimore-ravens-kansas-city-chiefs-afc-championship"}