{"authors": [], "date_download": "2024-02-05 15:28:54", "date_modify": "None", "date_publish": "2023-12-10 02:58:52", "description": "The Philippines and its treaty ally, the United States, have separately condemned a high-seas assault by the Chinese coast guard and suspected militia ships that repeatedly blasted water cannons to block three Philippine fisheries vessels from a disputed shoal in the South China Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fchinese-ap-philippines-scarborough-shoal-manila-b2461482.html.json", "image_url": "https://static.independent.co.uk/2023/12/10/03/Philippines_South_China_Sea_36568.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Philippines and its treaty ally, the United States, separately condemned a high-seas assault Saturday by the Chinese coast guard together with suspected militia ships that repeatedly blasted water cannons to block three Philippine fisheries vessels from a disputed shoal in the South China Sea.\nThe noontime assault by Chinese ships off the Scarborough Shoal, one of the most aggressive this year, caused “significant damage” to the communication and navigation equipment of one of the three Bureau of Fisheries and Aquatic Resources ships, Filipino officials said.\nThey said without elaborating that suspected militia vessels accompanying Chinese coast guard ships used a long-range acoustic device that could impair hearing, causing “severe temporary discomfort and incapacitation to some Filipino crew.\"\nIt's the latest flare-up of the long-seething territorial disputes in the South China Sea, a flashpoint in Asia that has put the U.S. and China on a collision course. China claims virtually the entire strategic waterway, but the Philippines, Vietnam, Malaysia, Brunei and Taiwan have also pressed their separate claims.\nTerritorial standoffs between China and the Philippines over a number of disputed offshore areas, including the Scarborough and the Second Thomas shoals, have been particularly heated this year. The U.S. has warned that it’s obligated to defend the Philippines, its longtime treaty ally, if Filipino forces, aircraft or ships come under an armed attack, including in the South China Sea.\nChina has warned the U.S. to stay away from what it calls a purely Asian dispute. It has deployed ships and aircraft to closely shadow U.S. Navy ships and aircraft, which periodically undertake freedom of navigation and overflight patrols in one of the world’s most hotly disputed seas.\nA Philippine government task force that deals with the long-seething territorial disputes said Saturday it “vehemently condemns the illegal and aggressive actions carried out by the Chinese coast guard and Chinese maritime militia against the civilian Bureau of Fisheries and Aquatic Resources vessels.\"\n“We demand that the Chinese government take immediate action to halt these aggressive activities and uphold the principles of international law and desist from actions that would infringe on Philippine sovereignty and endanger the lives and livelihood of Filipino fishermen,” it said.\nU.S. Ambassador to Manila MaryKay Carlson condemned China’s “aggressive, illegal actions.\"\n“This (Chinese) behavior violates international law and endangers lives and livelihood,” Carlson said in a post on X, formerly Twitter. “We stand with our Philippine friends, partners, allies in support of a free and open Indo-Pacific.”\nThe Chinese coast guard said in a single sentence announcement on its website that it “implemented control measures in line with the law” Saturday against three BFAR vessels that “intruded into waters adjacent to Huangyan Island,” the Chinese name for the Shoal.\nSeparately, the coast guard said it had “implemented controls in accordance with laws and regulations” on Sunday against two Philippine coast guard vessels, including one official ship and one supply ship that were attempting to transport construction materials to the Second Thomas Shoal.\nChina has long sought to blockade the submerged reef, where a small contingent of Filipino marines has stood guard for years aboard a long-marooned but still actively commissioned warship, the BRP Sierra Madre.\nThe statement gave no details about the measures taken, but said the Philippines action “seriously infringed on China’s sovereignty.”\nPhilippine fisheries bureau's ships had sailed to the Scarborough Shoal to provide humanitarian aid, mainly free fuel and Christmas grocery packs, to poor Filipino fishermen aboard nearly 30 boats in the rich but far-flung fishing area, Philippine officials said.\nThey said the swarm of Chinese coast guard and accompanying ships took dangerously aggressive actions, including the use of water cannons at least eight times, as the Philippine government ships approached about 2.6 kilometers to 3.5 kilometers (1.6 to 2 miles) from Scarborough Shoal.\nThey added that the Chinese coast guard installed a floating barrier at an entrance to the vast fishing lagoon of Scarborough Shoal and deployed personnel aboard small motor boats to drive away Filipino fishermen waiting for the distribution of fuel and food supplies at sea.\n\"To prevent the distribution of humanitarian support is not only illegal but also inhumane,” the Philippine government task force said.\nIn past faceoffs in the high seas off disputed shoals, the Chinese coast guard has used a military-grade laser that caused Filipino crewmen temporary blindness, and resorted to dangerous blocking and shadowing maneuvers, including one that caused minor collisions.\nPhilippine President Ferdinand Marcos Jr. has allowed a larger U.S. military presence in local military bases under a 2014 defense pact partly to strengthen territorial defense amid China’s increasingly aggressive actions in the disputed waters. China has strongly opposed and expressed alarm over increasing deployments of U.S. forces, warning that it would threaten regional peace and stability.\nThe Philippines has also launched joint sea and air patrols separately with the U.S. and Australia, and plans to expand this to a multilateral patrol, possibly including Japan and other like-minded nations to deter aggression in the South China Sea, National Security Adviser Eduardo Ano told reporters last week.", "source_domain": "www.independent.co.uk", "text": null, "title": "US and Philippines condemn the Chinese coast guard's water cannon blasts on fisheries vessels", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/chinese-ap-philippines-scarborough-shoal-manila-b2461482.html"}