{"authors": ["Adam Fulton", "Maya Yang", "Vivian Ho", "Clea Skopeliti", "Rebecca Ratcliffe"], "date_download": "2024-02-05 15:28:55", "date_modify": "None", "date_publish": "2023-12-10 03:40:48", "description": "US uses emergency declaration to provide $106.5m worth of rounds for immediate delivery to Israel, Pentagon says", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F09%2Fisrael-gaza-war-live-us-criticised-for-veto-on-un-resolution-calling-for-ceasefire-with-hamas.json", "image_url": "https://i.guim.co.uk/img/media/c99fe9a08d2342136a2b001b3607ea545ee2935b/231_0_5469_3282/master/5469.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=66a7f280d0716cc4bd5d59d1525b6c60", "language": "en", "localpath": null, "maintext": "10 Dec 2023 04.30 CET Closing summary It’s turned 5.30am in Gaza City and Tel Aviv and we’ll shut this blog shortly – our live coverage will resume later today. Here’s a rundown on the latest developments. And you can see all our Israel-Gaza war coverage here. Thanks for reading. Israel ordered residents out of the centre of Gaza’s main southern city, Khan Younis, as it pounded the length of the territory . Israel’s Arabic-language spokesperson posted a map on X (formerly Twitter) on Saturday highlighting six numbered blocks of Khan Younis that residents were told to evacuate “urgently”. They included parts of the city centre that had not been subject to such orders before. Israel issued similar warnings before storming eastern parts of the city and residents said they feared new evacuation orders heralded a further assault.\nThe Israeli military says five of its soldiers have died in the war. The Israel Defense Forces (IDF) named the five in a post on X and said four of them died in battle in southern Gaza and one succumbed to his wounds after fighting on 7 October.\nA United Nations peacekeeping position in southern Lebanon was hit without causing casualties, the UN force said, adding it was seeking to verify the source of the fire. Lebanon’s national news agency reported that an “Israeli Merkava tank” targeted the UN interim force in Lebanon (Unifil) position near the border across from Metula in northern Israel on Saturday. An Israeli army spokeswoman said it : “did not aim at Unifil, we did not hit a Unifil position.”\nThe Biden administration has used an emergency authority to sell about 14,000 tank shells to Israel without congressional review. The state department on Friday used an Arms Export Control Act emergency declaration for the tank rounds, worth $106.5m, for immediate delivery to Israel, the Pentagon said in a statement.\nThe UN agency for Palestinian refugees (UNRWA) said it had only been able to distribute aid in a very small part of southern Gaza “because of the intensity of the fighting and the bombardment since the humanitarian pause stopped”. Its deputy executive director, Carl Skau, said earlier: “About half the population in Gaza are starving … The humanitarian operation is collapsing. With the chaos with this active fighting it’s not possible to do the work that is needed.\nIsraeli prime minister Benjamin Netanyahu applauded the US for vetoing a UN security council resolution which called for a humanitarian ceasefire in Gaza, where more than 17,700 Palestinians have been killed by Israeli forces. In an address on Saturday, Netanyahu said: “I greatly appreciate the correct stance that the US has taken in the UN security council. Other countries need to understand that.”\nIsraeli fighter jets “completed an attack on Lebanese territory during which targets of the terrorist organisation Hezbollah was attacked”, the Israeli Defense Forces’ spokesperson tweeted on Saturday. Daniel Hagari added: “Among the targets that were attacked, a number of military positions from which launches were made into the territory of the country, military sites where the organisation’s terrorists operated and other terrorist infrastructures.”\nThe Gulf Cooperation Council is holding Israel legally responsible for killing thousands of Palestinians in Gaza. The GCC countries said on Saturday that they had renewed their condemnation of the Israeli aggression on the Gaza strip and were holding Israel legally responsible for ongoing attacks that resulted in the deaths of thousands of civilians in Gaza.\nIsraeli forces shot and killed a 17-year-old Palestinian boy in the West Bank town of Azzun, in Qalqilya, on Saturday, according to the Palestinian health ministry. The boy has been identified as Mahmoud Abu Haniya by the Palestinian news agency Wafa. Local reports say Haniya was caught up in gunfire by an Israeli military unit and was fatally shot in the back.\nScotland’s first minister has criticised the UK government for its abstention in the United Arab Emirates-led UN security council resolution that called for an humanitarian ceasefire on Friday. Humza Yousaf said in a tweet on Saturday: “How can you choose to be complicit in the killing of thousands of children? Shame on the UK Government & Keir Starmer’s Labour Party who refuse to back a #CeasefireNow.”\nThe Palestinian foreign ministry has reported that more than 130 Palestinian families have been forcibly displaced from Bedouin communities by Israeli forces and extremist Israeli settlers in the West Bank since 7 October. At least 260 Palestinians had been killed in the West Bank by such settlers since then, Palestinian health minister Mai al-Kaila said.\nUpdated at 04.37 CET\n10 Dec 2023 04.11 CET The UN agency for Palestinian refugees (UNRWA) says 133 of its staff have been killed in Israeli bombardments during the war. The agency posted on X: Our staff in #Gaza take their children to work so they know they are safe, or can die together. 133 colleagues have been confirmed killed in bombardments, most with their families. The situation of civilians in #Gaza is untenable, we are reaching a point of no return. Our staff in #Gaza take their children to work so they know they are safe, or can die together.\n133 @UNRWA colleagues have been confirmed killed in bombardments, most with their families.\nThe situation of civilians in #Gaza is untenable, we are reaching a point of no return. pic.twitter.com/IIu5nAcSrB — UNRWA (@UNRWA) December 9, 2023\nUpdated at 04.11 CET\n10 Dec 2023 03.46 CET Israel orders new evacuations in Khan Younis Israel has ordered residents out of the centre of Gaza’s main southern city, Khan Younis, as it pounds the length of the territory, Reuters reports. Israel’s Arabic-language spokesperson posted a map on X (formerly Twitter) on Saturday highlighting six numbered blocks of Khan Younis that residents were told to evacuate “urgently”. They included parts of the city centre that had not been subject to such orders before. Israel issued similar warnings before storming eastern parts of the city and residents said they feared new evacuation orders heralded a further assault. View image in fullscreen Smoke rises after an Israeli airstrike in Khan Younis, southern Gaza, on Saturday. Photograph: Ibraheem Abu Mustafa/Reuters Zainab Khalil, a 57-year-old who has been displaced with 30 of her relatives and friends in Khan Younis near Jalal Street, where troops told people to leave, said: It might be a matter of time before they act against our area too. We have been hearing bombing all night. We don’t sleep at night, we stay awake, we try to put the children to sleep and we stay up fearing the place would be bombed and we’ll have to run carrying the children out. During the day begins another tragedy, and that is: how to feed the children? In central Gaza, Israeli tank shelling resumed on Bureij and Maghazi refugee camps, local residents said. Seven Palestinians were killed in an Israeli airstrike in Bureij, according to Palestinian health officials. Israeli forces could not immediately be reached for comment.\nUpdated at 04.50 CET\n10 Dec 2023 03.29 CET Nine out of 10 Palestinian families in some areas of Gaza are spending “a full day and night without any food at all”, the UN World Food Program has posted on X. Its deputy executive director, Carl Skau, said earlier: About half the population in Gaza are starving … The humanitarian operation is collapsing. With the chaos with this active fighting it’s not possible to do the work that is needed. Skau posted on X about his visit to Gaza, saying there was “chaos, desperation, families living on the streets as storms close in”. WFP has reached over 1 million people, but the situation is untenable. We need to get our supplies in & a humanitarian ceasefire.\nUpdated at 03.54 CET\n10 Dec 2023 02.54 CET Five Israeli troops killed in war, IDF says The Israeli military says five of its soldiers have died in the Israel-Gaza war. The Israel Defense Forces (IDF) named the five in a post on X (formerly Twitter) and said four of them died in battle in southern Gaza and one succumbed to his wounds after fighting on 7 October, when Hamas attacked southern Israel. It said four were aged in their 20s and one was 19. The post said: The IDF expresses its deepest condolences to the families and will continue to stand by them. Today, we announce the death of 5 IDF soldiers:\n🕯️MSG (Res.) Liav Atiya, a 25-year-old combat soldier in the 6623 Battalion, fell in battle in southern Gaza.\n🕯️MSG (Res.) Omri Ben Shachar, a 25-year-old combat soldier in the 6623 Battalion, fell in battle in southern Gaza.… pic.twitter.com/T74gp00f0e — Israel Defense Forces (@IDF) December 10, 2023\nUpdated at 02.55 CET\n10 Dec 2023 02.17 CET A North Korean senior official has criticised the US for blocking the United Nations resolution calling for an immediate humanitarian ceasefire in the Israel-Gaza war, claiming the veto showed Washington’s “double standards”, North Korean state media KCNA said. The US vetoed the resolution at the UN security council on Friday. The resolution failed to pass after the US vetoed the proposal and the UK abstained. Reuters reports that Kim Son Gyong, North Korea’s vice-foreign minister for international organisations, said via KCNA: The United States’ abuse of its veto power to protect an ally that massacred tens of thousands of civilians is not only a manifestation of illegal and unreasonable double standards, but also the height of inhumane evil. Kim said the US was contradicting itself by condoning continued fighting in Gaza while condemning North Korea’s recent satellite launch that caused no harm to any other country.\n10 Dec 2023 01.33 CET A United Nations peacekeeping position in southern Lebanon was hit on Saturday without causing casualties, the UN force said, adding it was seeking to verify the source of the fire. Lebanon’s national news agency reported that an “Israeli Merkava tank” targeted the UN interim force in Lebanon (Unifil) position near the border across from Metula in northern Israel, Agence France-Presse reports. An Israeli army spokeswoman said: “We did not aim at Unifil, we did not hit a Unifil position.” Unifil spokesman Andrea Tenenti said the force was “verifying” the source of the fire and that the incident caused “no casualties” but damaged a watchtower at the base. Since the Israel-Hamas war began on 7 October, the frontier between Lebanon and Israel has seen intensifying exchanges of fire, mainly between the Israeli army and Shia Muslim movement Hezbollah, raising fears of a broader conflagration. More than 120 people have been killed on the Lebanese side since October, mostly Hezbollah fighters but also including more than a dozen civilians, according to an AFP tally. This is Adam Fulton picking up our live coverage – stay with us for all the latest developments as they unfold\nUpdated at 01.43 CET\n10 Dec 2023 01.00 CET Summary Here is where the day stands: The Biden administration has used an emergency authority to sell around 14,000 tank shells to Israel without congressional review. The state department on Friday used an Arms Export Control Act emergency declaration for the tank rounds worth $106.5m for immediate delivery to Israel, the Pentagon said in a statement, Reuters reports.\nThe Gulf Cooperation Council is holding Israel legally responsible for killing thousands of Palestinians in Gaza. In a statement released on Saturday, the GCC countries said that they have renewed their condemnation of the Israeli aggression on the Gaza strip, holding Israel legally responsible for the ongoing attacks that have targeted innocent civilians and resulted in the deaths of thousands of civilians in Gaza.\nIsrael’s prime minister Benjamin Netanyahu has applauded the US for vetoing a UN security council resolution, which called for a humanitarian ceasefire in Gaza where more than 17,700 Palestinians have been killed by Israeli forces. In an address on Saturday, Netanyahu said: “I greatly appreciate the correct stance that the US has taken in the UN security council. Other countries need to understand that.”\nScotland’s first minister Humza Yousaf has criticized the UK government for its abstention in the United Arab Emirates-led UN security council resolution that called for an humanitarian ceasefire on Friday. In a tweet on Saturday, Yousaf said: “How can you choose to be complicit in the killing of thousands of children? Shame on the UK Government & Keir Starmer’s Labour Party who refuse to back a #CeasefireNow.”\nIsraeli fighter jets “completed an attack on Lebanese territory during which targets of the terrorist organization Hezbollah was attacked ”, Daniel Hagari, the spokesperson for the Israeli Defense Forces, tweeted on Saturday. He added: “Among the targets that were attacked, a number of military positions from which launches were made into the territory of the country, military sites where the organization’s terrorists operated and other terrorist infrastructures.”\nIsraeli forces shot and killed a 17-year-old Palestinian boy in the West Bank town of Azzun, in Qalqilya, on Saturday, according to the Palestinian health ministry. The boy has been identified as Mahmoud Abu Haniya by the Palestinian news agency WAFA. Local reports say that Haniya was caught up in gunfire by an Israeli military unit and was fatally shot in the back.\nUNRWA said that it has only been able to distribute aid in a very small part of southern Gaza. “ Because of the intensity of the fighting and the bombardment since the humanitarian pause stopped, we have only been able to distribute food in a very small part of southern Gaza, in Rafah. There are many, many people who are not in Rafah and whom we have not been able to access for the last few days,” the UNRWA spokesperson Tamara Alrifai told the BBC.\nThe Palestinian foreign ministry has reported that more than 130 Palestinian families have been forcibly displaced from Bedouin communities by Israeli forces and extremist Israeli settlers in the West Bank since 7 October. Since 7 October, said Palestinian health minister Mai al-Kaila, at least 260 Palestinians have been killed in the West Bank by extremist Israeli settlers.\n9 Dec 2023 00.44 CET Here are some images coming through the newswires of pro-Palestine protests from around the world this weekend, in which tens of thousands of demonstrators demanded a ceasefire in Gaza, where Israeli forces have killed more than 17,700 Palestinians, including more than 7,100 children, in the last two months: View image in fullscreen Protesters show their hands painted red, symbolizing the blood of Palestinians killed in Israeli attacks, during a demonstration near the Eiffel Tower in Paris, France, on 10 December 2023. Photograph: Anadolu/Getty Images View image in fullscreen People shout slogans and carry placards and flags to protest against the Israeli war in Palestine, which has resulted in the mass killings of people in Gaza, in Mumbai, India, on 9 December 2023. Photograph: Indranil Aditya/NurPhoto/Shutterstock View image in fullscreen Demonstrators gather on the banks of the Rhone in Lyon, France, in solidarity with Gaza, during the festival of lights on 9 December 2023. Photograph: Konrad K/SIPA/Shutterstock View image in fullscreen Demonstrators gather in London in solidarity with Gaza, at a protest organised by Stop the War, the Palestine Solidarity Campaign UK and Friends of al-Aqsa, among many others, on 9 December 2023. Photograph: Guy Bell/Shutterstock View image in fullscreen People hold banners and placards during a protest for climate justice and a ceasefire in Gaza, during the United Nations climate change conference Cop28, in Dubai, United Arab Emirates, on 9 December 2023. Photograph: Amr Alfiky/Reuters View image in fullscreen Protesters march in the street to denounce the Biden administration’s support of Israel, which has killed thousands of Palestinian civilians so far in its war against Hamas in Gaza, on 8 December 2023, in Los Angeles, California. Photograph: David McNew/Getty Images\nUpdated at 00.55 CET\n9 Dec 2023 00.27 CET Biden administration to sell 14,000 tank shells to Israel without congressional review The Joe Biden administration has used an emergency authority to sell around 14,000 tank shells to Israel without congressional review. Reuters reports: The state department on Friday used an Arms Export Control Act emergency declaration for the tank rounds worth $106.5m for immediate delivery to Israel, the Pentagon said in a statement. The shells are part of a bigger sale that was first reported by Reuters on Friday that the Biden administration is asking the US Congress to approve. The larger package is worth more than $500m and includes 45,000 shells for Israel’s Merkava tanks, regularly deployed in its offensive in Gaza, which has killed thousands of civilians. As the war intensified, how and where exactly the American weapons are used in the conflict has come under more scrutiny, even though US officials say there are no plans to put conditions on military aid to Israel or to consider withholding some of it. Rights advocates expressed concern over the sale, saying it doesn’t align with Washington’s effort to press Israel to minimize civilian casualties. A state department official said on Saturday that Washington continues to be clear with the Israeli government that it must comply with international humanitarian law and take every feasible step to avoid harm to civilians. For the full story, click here: Biden administration uses emergency authority to sell tank shells to Israel Read more\nUpdated at 03.03 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli military says five of its soldiers killed in war - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/09/israel-gaza-war-live-us-criticised-for-veto-on-un-resolution-calling-for-ceasefire-with-hamas"}