{"authors": ["James Gordon", "James Gordon For Dailymail.Com"], "date_download": "2024-02-05 15:28:56", "date_modify": "None", "date_publish": "2023-12-10 23:18:03", "description": "President Joe Biden has invited Ukraine's leader Volodymyr Zelensky to the White House on Tuesday. The Biden administration is piling on the pressure on Congress to provide billions more in aid to Kyiv,", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12848167%2FUkraine-Zelensky-visit-Biden-DC-Congress-aid.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/10/23/78800387-0-image-m-28_1702250265380.jpg", "language": "en", "localpath": null, "maintext": "Joe Biden has invited Volodymyr Zelensky to the White House on Tuesday after the administration warned it will run out of money for Ukraine aid in weeks unless feuding US lawmakers act.\nThe two leaders 'will discuss Ukraine's urgent needs' as it fights off a Russian invasion, and 'the vital importance of the United States' continued support at this critical moment,' White House Press Secretary Karine Jean-Pierre said Sunday.\nThe Ukrainian presidency said the meeting will focus on key issues such as 'further defense cooperation between Ukraine and the United States, particularly through joint projects on the production of weapons and air defense systems, as well as the coordination of efforts between our countries in the coming year.'\nRepublican senators last week blocked $106 billion in emergency aid primarily for Ukraine and Israel after conservatives balked at the exclusion of immigration reforms they had demanded as part of the package.\nAbout $60billion of that aid would go to Ukraine, adding to the $111billion it has already received from the US.\nPresident Joe Biden has invited Ukraine's leader Volodymyr Zelensky to the White House on Tuesday amid a push for Congress to approve more aid. The pair are pictured in September in DC\nThe Biden administration is piling on the pressure on Congress to provide billions more in aid to Kyiv in its war with Russia. Pictured, President Joe Biden and his wife First Lady Jill Biden welcomed Zelensky and his wife First Lady of Ukraine Olena Zelenska to the White House\nWhite House Press Secretary Karine Jean-Pierre announced the visit in a statement on Sunday\nThe conservative opposition was a setback for Biden, who had urged lawmakers to approve the funds, warning Russian President Vladimir Putin would not stop with victory in Ukraine and could even attack a NATO nation.\n'This cannot wait,' Biden said in an impassioned, televised address at the White House on Wednesday.\n'Frankly, I think it's stunning that we've gotten to this point in the first place, where Republicans in Congress are willing to give Putin the greatest gift he could hope for.'\nThe White House said Tuesday's meeting will come at a vital moment, 'as Russia ramps up its missile and drone strikes against Ukraine.'\nAt the start of December, Putin signed a decree to boost Russian forces by 15 percent to support his invasion of Ukraine, increasing the army by some 170,000 people.\nUkrainian military soldiers fire from the MT-12 or 2A29 gun 'Rapira' is a Soviet smoothbore 100-mm anti-tank gun last weekin Avdiivka, Ukraine. Both Ukraine and Russia have recently claimed gains in the Avdiivka, where Russia is continuing a long-running campaign to capture the city, located in the Ukraine's eastern Donetsk Region\nLocal residents stand near their apartment building and cars damaged during a Russian missile strike in Kharkiv, Ukraine, on Friday\nMoscow has recently given signs about a possible peace deal, although one involving a shrunken, neutral Ukraine that would be impossible to swallow for Zelensky.\nIn a flurry of diplomatic activity after the White House announced Zelensky's visit, an aide for Mike Johnson said the new Republican speaker for the House of Representatives -- who has been trying to tie Ukraine aid to funding for US border security -- will also meet with the Ukrainian leader on Tuesday.\nAnd a Senate official said Democratic majority leader Chuck Schumer and Republican leader Mitch McConnell likewise invited Zelensky to speak at an all-Senators meeting Tuesday morning -- one week after several Republicans angrily walked out of a classified Ukraine briefing that he had been due to address via video.\nShalanda Young, head of the White House Office of Management and Budget reiterated that fear on CBS's Face the Nation on Sunday, warning that 'our national security is also influenced' by Ukraine's fate.\nBiden has asked Congress for a $110bn package of wartime funding for Ukraine and Israel, along with other national security priorities. Zelensky walks down the White House colonnade to the Oval Office alongside Biden last September\nSome in Congress remain skeptical that any increase in aid to Ukraine will make any difference in the war effort. Biden and Zelensky are seen in the Oval Office of the White House in the fall\n'What happens if Putin marches through Ukraine, what's next? NATO countries, our sons and daughters, are at risk of being a part of a larger conflict,' she said.\nBut Republicans remained skeptical, with Senator JD Vance, a close ally of former US president Donald Trump, dismissing the idea of Putin putting NATO countries in the region at risk 'preposterous.'\nHe told CNN on Sunday that he opposes a 'blank check' for Ukraine.\n'You need to articulate what the ambition is. What is $61 billion going to accomplish that $100 billion hasn't?' Vance said.\n'What's in America's best interest is to accept Ukraine is going to have to cede some territory to the Russians and we need to bring the war to a close.'\nDemocrat Chris Murphy said the money would make a difference because Russia is struggling to fund its war effort.\n'It can change the outcome of this war,' Murphy said. 'Because at the very same time that we are making a renewed commitment to Ukraine, Russia's ability to continue to fight this war is in jeopardy.'\nThe US State Department announced a stopgap $175 million tranche of new aid for Ukraine on Wednesday, including prized HIMARS rockets, shells, missiles and ammunition.\nThe funding row underscores signs that Western support for Ukraine is fraying just as Kyiv's counteroffensive falters and Putin's forces push for new gains.\nUkraine's offensive has employed billions of dollars' worth of Western weapons -- but the front lines have barely shifted in more than a year and Russian attacks along the front have intensified.\nThe White House said Biden's meeting will come at a vital moment, 'as Russia ramps up its missile and drone strikes against Ukraine.'\nAt the start of December, Russian President Vladimir Putin signed a decree to boost Russian forces by 15 percent, increasing the army by some 170,000 people\nAt the start of December, Putin signed a decree to boost Russian forces by 15 percent, increasing the army by some 170,000 people.\nMoscow has recently given signs about a possible peace deal, although one involving a shrunken, neutral Ukraine that would be impossible to swallow for Zelensky.\nUS Secretary of State Antony Blinken insisted on Sunday that 'Ukraine has done an extraordinary job' defending itself.\n'The choice is very clear,' he said on ABC. 'If we do this and help Ukraine sustain the achievements that it's made, help ensure that Russia continues to suffer a strategic failure in in Ukraine. That's one route to go.\n'The other route to go is to do something that the only people who are rooting for it are in Moscow, and maybe in Tehran and Beijing, which is not to provide this assistance,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Zelensky set to visit Biden and Congress this week as Ukraine continues to push for more war aid on top of the $111billion it has already received", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12848167/Ukraine-Zelensky-visit-Biden-DC-Congress-aid.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}