{"authors": ["Summer Goodkind"], "date_download": "2024-02-05 15:28:58", "date_modify": "None", "date_publish": "2023-12-10 15:51:37", "description": "Footage shared by Israeli media appears to show Israel Defence Forces (IDF) troops rounding up scores of men and transporting them on the back of trucks.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12847307%2FFootage-shows-dozens-Hamas-suspects-stripped-blindfolded-paraded-underwear-IDF-soldiers.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/10/15/78790691-0-image-a-56_1702222391406.jpg", "language": "en", "localpath": null, "maintext": "Israel continued its onslaught against Hamas on Sunday as dozens more terror suspects were pictured bound, stripped and lined up on their knees.\nFootage shared by Israeli media shows Israel Defence Forces (IDF) troops rounding up scores of men and transporting them on the back of trucks.\nThe men are believed to have surrendered in the Jabalia refugee camp and other areas around northern Gaza, with Israeli outlet Walla saying they were stripped 'to rule out the possibility that they were carrying weapons'.\nOne clip shared to social media shows Palestinian men lined up against a wall.\nOne man then steps forward to give his assault rifle to the Israeli troops with his hands in the air, while others behind him hold their up their identification cards.\nThe men are believed to have surrendered in the Jabalia refugee camp and other areas around northern Gaza\n'Slowly, slowly,' an IDF soldier tells the man holding the gun as he walks barefoot over rubble next to an Israeli tank.\nOther images appear to show suspects sitting in the middle of the street - stripped, restrained, blindfolded and surrounded by IDF troops.\nHamas alleged that all the men were unarmed, innocent civilians, however Israel has said it will interrogate all those who surrender to troops with potential links to Hamas.\nAmong those detained in recent days are Hamas operatives that have provided intelligence to Israel's military, the IDF says.\n'We are seeing every day more and more terror operatives killed, more and more terror operatives wounded, and in recent days we're seeing terrorists surrendering — a sign of the disintegration of the system, a sign that we need to push harder,' IDF Chief of Staff Lt. Gen. Herzi Halevi said on Saturday.\nLast week Israeli military spokesman Daniel Hagari said Israeli troops have detained and interrogated hundreds of people in Gaza suspected of militant links.\nHagari told reporters: 'Jabalia and Shejaiya are 'centres of gravity'... for terrorists, and we are fighting them.\nScores of stripped 'terror suspects' line up with the hands tied behind their back\nOther images appear to show suspects sitting in the middle of the street - stripped, restrained, blindfolded and surrounded by IDF troops\nFootage shared by Israeli media appears to show Israel Defence Forces (IDF) troops rounding up scores of men and transporting them on the back of trucks\n'They are hiding underground and come out and we fight them. Whoever is left in those areas, they come out from tunnel shafts, and some from buildings, and we investigate who is linked to Hamas, and who isn't. We arrest them all and interrogate them.'\nMeanwhile on Friday, Israel's Defense Minister Yoav Gallant told IDF soldiers that he 'sees the signs indicating a breakdown is beginning inside Gaza'.\nIsraeli forces have encircled major urban centres as they seek to destroy Hamas over its unprecedented attack on October 7, when terrorists broke through Gaza's militarised border to kill around 1,200 people and seize hostages, 138 of whom remain captive, according to Israeli figures.\nSince Israel began bombarding the small enclave in response, more than 17,170 Palestinians have been killed and 46,000 wounded, according to the Gaza health ministry.\nIt comes after Israel vowed to continue its 'just war to eliminate Hamas', as Prime Minister Benjamin Netanyahu thanked the United States for blocking a United Nations ceasefire bid.\nThe US, a key ally of Israel, was the only member to veto the UN Security Council resolution demanding an immediate humanitarian ceasefire, while the UK abstained in the vote, despite widespread international support.\nAn Israeli soldier stands by a truck with Palestinian detainees in, thought to be 'Hamas suspects'\nTruck packed with stripped Palestinian 'terror suspects'\nLast week Israeli military spokesman Daniel Hagari said Israeli troops have detained and interrogated hundreds of people in Gaza suspected of militant links\nIsraeli warplanes struck parts of the Gaza Strip in relentless bombardment on Saturday, hitting some of the dwindling bits of land that Israel had described as safe zones when telling Palestinians in the south to evacuate.\nResidents 'are being told to move like human pinballs - ricocheting between ever-smaller slivers of the south, without any of the basics for survival,' UN Secretary-General Antonio Guterres told the council before the UNSC vote.\nIsrael holds the Hamas militants responsible for civilian casualties, accusing them of using civilians as human shields, and says it has made considerable efforts with evacuation orders to get civilians out of harm's way.\nIsrael says Hamas operates from within hospitals and has released footage supporting the claim, and it has also targeted in the past ambulances it says were used by Hamas. Hamas has denied this.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Footage shows dozens of Hamas suspects stripped and blindfolded being paraded around in their underwear by IDF soldiers", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12847307/Footage-shows-dozens-Hamas-suspects-stripped-blindfolded-paraded-underwear-IDF-soldiers.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}