{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:28:59", "date_modify": "None", "date_publish": "2023-12-10 17:58:21", "description": "Administration reportedly not carrying out continual assessments on whether war crimes being committed in Gaza", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F10%2Fbiden-under-scrutiny-bypassing-congress-supply-tank-shells-israel-gaza.json", "image_url": "https://i.guim.co.uk/img/media/b6874dce5d5347c4bcef31b05edce998480e8c01/0_39_8304_4982/master/8304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=608107698f31458b933b227583737428", "language": "en", "localpath": null, "maintext": "The Biden administration’s support for Israel’s war in Gaza has come under intensified scrutiny after it revealed it had bypassed Congress to supply tank shells, and was reported not to be carrying out continual assessments of whether Israel was committing possible war crimes.\nIsraeli tanks were reported to have reached the centre of Khan Younis on Sunday, after battling through stiff resistance in the southern city which is overcrowded by civilians who have fled fighting in the north. Israeli airstrikes pounded the city blocks west of the frontline.\nHeavy fighting was also reported in the Jabaliya refugee camp and the Shejaiya area of Gaza City, in northern Gaza, where the Israel Defense Forces (IDF) have said they were dealing with remaining pockets of resistance, but residents described some of the most intense combat of the war.\nA spokesperson for Hamas’s armed wing, the al-Qassam Brigades, claimed that it had partially or full destroyed 180 Israel tanks, armoured personnel carriers and bulldozers in battles.\nThe death toll in Gaza is nearing 18,000 Palestinians, with 49,500 injured since the start of the war on 7 October, according to the Gaza health ministry, which said the toll no longer includes new casualties in the north where hospitals have all closed down, or those buried under the rubble. The ministry is run by Hamas, which has been a cause of scepticism over its data, but a study in the medical journal, the Lancet, found no evidence it had inflated mortality reporting.\nOne of the abuses Israel has been accused of in its military campaign has been stripping male detainees to their underwear and allowing the release of pictures and video of the near-naked captives. The Israeli newspaper Haaretz quoted senior security officials on Sunday as saying only 10% to 15% of the men pictured were Hamas operatives or identified with the organisation. The IDF has said those not found to be Hamas operatives were released.\nThe heavy death toll in Gaza has increased the pressure on Washington, as Israel’s chief armourer and defender on the world stage. The US found itself isolated at the UN on Friday when it was the only vote in the security council against an immediate ceasefire.\nThe new details on the lengths the administration has gone to arm Israel in its Gaza campaign are likely to draw fresh criticism from US allies in the region and also progressive voters on whose votes Biden could depend to win reelection next year.\nOn Sunday, the Israeli prime minister, Benjamin Netanyahu, thanked Biden for the security council veto and the arms supplies.\n“An additional shipment of important ammunition for continuing the war will arrive today; in effect, it is already here,” Netanyahu said at the start of a cabinet meeting.\nView image in fullscreen Israeli soldiers stand by a truck with shirtless Palestinian detainees. Photograph: Yossi Zeliger/Reuters\nOn Saturday the US Defense Security Cooperation Agency published a declaration saying that the secretary of state, Antony Blinken, had invoked emergency powers to supply nearly 14,000 tank rounds to Israel, waiving the requirement to consult Congress under the Arms Export Control Act.\nThe Washington Post cited unnamed officials as admitting that in Israel’s case, the US was not following guidelines that Biden himself had established in February requiring all arms transfers to foreign governments be subject to rigorous and continual examination of the recipient’s record on the Geneva conventions and other global norms for conducting warfare.\nA memorandum on arms transfer policy said no weapons supplies should be authorised if the US assesses “that it is more likely than not” that they would be used to commit, facilitate or aggravate the risks of war crimes or crimes against humanity, “including attacks intentionally directed against civilian objects”.\nAdministration officials were quoted by the Washington Post as admitting that the US had not been conducting “real-time assessments of Israel’s adherence to the laws of war”, because of lack of access to intelligence being used by the IDF to plan operations, or information about the intentions of IDF commanders.\nThe report cited intelligence data supplied to Congress by the administration saying that Israel had dropped more than 22,000 US-supplied bombs on Gaza in the first month and a half of the war. In that same period, the US had supplied Israel with at least 15,000 bombs, including 2,000lb (900kg) bunker busters, as well as 50,000 155mm artillery shells.\nBlinken insisted on Sunday that the export control constraints were being followed.\n“When it comes to the weapons that we transfer, the rules that go along with them, those rules apply to Israel as they do to any other country, including the way they’re used and the need, the imperative of respecting international humanitarian law,” the secretary of state told ABC News.\n“A small portion of what has been requested is going through on an emergency basis, that is moving quickly so that Israel can have what it needs in hand. But virtually everything else is going through the regular order, through Congress. It’s very important that Congress’s voice be heard in this.”\nThere has been a heavy civilian death toll from the Israel offensive on Gaza, triggered by the 7 October Hamas attack on southern Israel. An Israeli analysis suggested civilians constituted 61% of the dead from airstrikes earlier in the campaign. Several international human rights organisations have warned that the US could be complicit in potential war crimes in Gaza by its diplomatic cover for Israel as well as its arms supplies.\nAccording to a report on Israel’s Channel 13, Netanyahu told Biden in a phonecall over the weekend that the operation in Khan Younis would take between three and four weeks to complete. Blinken confirmed to CNN that the administration had held discussions with Israel on the duration of the war, but added: “These are decisions for Israel to make.”\nMultiple accounts in the Israeli media have said that Israel can rely on continued US support but that Washington was insisting the campaign should be completed by the end of the year. Israel’s national security adviser, Tzachi Hanegbi, insisted there was no deadline for Israel to achieve the twin goals of dismantling Hamas and rescuing the remaining hostages.\n“The evaluation that this can’t be measured in weeks is correct, and I’m not sure it can be measured in months,” Hanegbi told Channel 12.\nUS officials have claimed the administration’s close relationship with Israel has helped restrain IDF actions on the northern border and prevented the opening of a second front and the start of a regional war. However, the level of violence escalated on Sunday as Hezbollah launched explosive drones and heavy missiles at Israeli positions and Israeli jets carried out airstrikes on towns and villages in south Lebanon.\nIn a statement sent to Reuters, a senior Hezbollah politician, Hassan Fadlallah, described the Israeli airstrikes as a “new escalation” drawing new types of Hezbollah response which were different “in the nature of the weapons or the targeted sites”.", "source_domain": "www.theguardian.com", "text": null, "title": "Biden under scrutiny after bypassing Congress to supply tank shells to Israel", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/10/biden-under-scrutiny-bypassing-congress-supply-tank-shells-israel-gaza"}