{"authors": [], "date_download": "2024-02-05 15:29:00", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Israel Minister of Defense Yoav Gallant met with the visiting British Secretary of State for Defense Grant Shapps on Thursday night at the Ministry of Defense", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274058597%2Ffirst-visit-of-british-defense-secretary-to-israel-in-27-years.json", "image_url": "https://cdn.bignewsnetwork.com/ani1702028309.jpg", "language": "en", "localpath": null, "maintext": "Tel Aviv [Israel], December 8 (ANI/TPS): Israel's Minister of Defense Yoav Gallant met with the visiting British Secretary of State for Defense Grant Shapps on Thursday night at the Ministry of Defense Headquarters in Tel Aviv. Shapps took part in the lighting of the first candle for the first night of Chanukah with Minister Gallant.\nThis marked the first visit by a British Defense Secretary to Israel in 27 years.\n\"This is the first day of Chanukah - the holiday that symbolizes the victory of the Maccabees against their enemies,\" Gallant said. \"They didn't have a State - we have a State to protect us, and we are prepared to defend ourselves.\"\"Two months ago, the war was launched when we were brutally attacked by Hamas,\" he added, \"and now we are fighting. We are determined to win, and we will prevail - I am sure of it.\"\"We [Israel and Britain] share common values and common goals, and unfortunately also common threats, and we appreciate very much your visit and your position.\"The ministers held a one-on-one discussion, followed by a bilateral security briefing with professional delegations.\nMinister Gallant was joined by the IDF Chief of the General Staff Lt. Gen. Herzi Halevi in briefing the Secretary, the British Chief of Defense Forces, Admiral Sir Tony Radakin and their delegation. They discussed developments and the IDF's precise operations in Gaza. They also discussed the growing tensions on Israel's northern border and growing regional threats posed by Iranian proxies. (ANI/TPS)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "First visit of British Defense Secretary to Israel in 27 years", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274058597/first-visit-of-british-defense-secretary-to-israel-in-27-years"}