{"authors": [], "date_download": "2024-02-05 15:29:01", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "A search and rescue operation has been initiated after a Guyana Defense Forces helicopter went missing close to the Venezuelan border Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274057743%2Fguyanese-military-helicopter-missing-near-venezuelan-border.json", "image_url": "https://cdn.bignewsnetwork.com/ZmQ4NDRhYTMtODQ.jpg", "language": "en", "localpath": null, "maintext": "The Defense Forces personnel aboard the lost chopper had been sent to inspect the area amid rising tensions with Caracas\nA military helicopter with five senior Guyanese officers and two soldiers onboard vanished in stormy weather on Wednesday near Guyana's contested border with Venezuela.\nRescue operations had to be called off due to adverse weather conditions, according to Guyana Defense Forces (GDF) Chief of Staff Brigadier Oman Khan. The helicopter sent out an emergency signal shortly after refueling. The signal may have been triggered by the crew and may suggest a crash landing, he added.\nThe suspected crash happened as border tensions between Guyana and Venezuela are on the rise.\nThe territory, which Guyana refers to as Essequibo, has been disputed by the two countries since the 19th century.\nIn 1899, the US stepped in to arbitrate the dispute, and, invoking the Monroe Doctrine, assigned the territory to British Guyana, at the time a colony.\nVenezuela never accepted the decision as legitimate, and the dispute was referred to the International Court of Justice (ICJ) in 2018.\nAfter a referendum on Sunday about incorporating the territory as a new state in Venezuela, President Nicolas Maduro has unveiled a new map with the area, dubbed Guyana Essequiba, now shown as part of the country.\nGuyanese President Irfaan Ali replied that Maduro was displaying \"blatant disregard\" for the ICJ, which forbade Caracas from disturbing the status quo in the region.\nThe dispute is further exacerbated by the recently discovered oil reserves in the waters off the coast of the Atlantic, which both countries claim.\nMaduro warned that foreign companies exploiting resources in the region without permission from Caracas have three months to \"comply with the law.\"\nCaracas has since mobilized troops and sent them to the Guyanese border in preparation for claiming the 160,000 square-km territory.", "source_domain": "www.britainnews.net", "text": null, "title": "Guyanese military helicopter missing near Venezuelan border", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274057743/guyanese-military-helicopter-missing-near-venezuelan-border"}