{"authors": ["Dean Murray"], "date_download": "2024-02-05 15:15:34", "date_modify": "None", "date_publish": "2024-01-26 12:24:34", "description": "The Department of Defense has been accused of being unprepared to deal with the threat of UFOs, deemed a threat to national security.", "filename": "https%3A%2F%2Fmetro.co.uk%2F2024%2F01%2F26%2Fus-officially-unable-defend-alien-invasion-20177819%2F.json", "image_url": "https://metro.co.uk/wp-content/uploads/2024/01/GettyImages-472927638_1706272183.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "language": "en", "localpath": null, "maintext": "Earth is unprepared for an alien invasion (Picture: Getty)\nYou know how it goes in Hollywood. Aliens invade, everyone panics, the US saves the world.\nWell, you can forget Independence Day-style heroics – the US would not be able to defend itself (or anyone else) against aliens, according to a damning official government report.\nThe US Department of Defense (DoD) has released a statement regarding a previously classified report examining the effectiveness of the nation to respond to the threat of unidentified anomalous phenomena (UAP), formerly UFOs.\nInterest in UAP is at an all-time high among the lawmakers, the media and the public following US whistleblower Charles Grusch’s claims that the US has recovered both spacecraft and alien bodies.\nHis comments helped prompt an official congressional hearing into the issue, during which Mr Grusch and two other former military personnel shared their experiences of UAP.\nIn July 2022, the Pentagon also set up the All-domain Anomaly Resolution Office (AARO), to handle reports of UAP.\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nHowever, the Office of Inspector General (OIG), has questioned the abilities of the nation to organise and defend itself in a summary of the classified report, ‘Evaluation of the DoD’s Actions Regarding Unidentified Anomalous Phenomena’, first issued in August.\nThe statement says the OIG ‘found that the DoD’s lack of a comprehensive, coordinated approach to address UAP may pose a threat to military forces and national security’.\nIt added: ‘The DoD OIG found that the DoD does not have a comprehensive, coordinated approach to address UAP.\nThe US has released a number of videos revealing UAP (Picture: AARO/SWNS)\n‘For instance, the DoD OIG determined that the DoD has no overarching UAP policy and, as a result, it lacks assurance that national security and flight safety threats to the United States from UAP have been identified and mitigated.’\nInspector General Robert P Storch said: ‘Given the significant public interest in how the DoD is addressing UAPs, we are releasing this unclassified summary to be as transparent as possible with the American people about our oversight work on this important issue.’\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nTo address the issues identified in the report, the DoD OIG say they have made 11 recommendations to the Under Secretary of Defense for Intelligence and Security, in coordination with the Director of the All-domain Anomaly Resolution Office, the Secretaries of the Army, Navy, and Air Force, and the Chairman of the Joint Chiefs of Staff.\nThey said: ‘For example, the DoD OIG recommended that the DoD issue a policy to integrate roles, responsibilities, requirements, and coordination procedures regarding UAP into existing intelligence, counterintelligence, and force protection policies and procedures.’\nThat sounds a lot more complicated, and frankly less comforting, than ‘Don’t worry, Will Smith is on the case’.\nMORE : A Welsh mountain sparked one of the UK’s wildest UFO conspiracies – but what really happened?\nMORE : MoD expert gives surprising verdict on ‘Jellyfish UFO’ hovering over Iraq\nMORE : Whistleblower says US is hiding UFO the ‘size of a football field’", "source_domain": "metro.co.uk", "text": null, "title": "The US is officially unable to defend itself against an alien invasion", "title_page": null, "title_rss": null, "url": "https://metro.co.uk/2024/01/26/us-officially-unable-defend-alien-invasion-20177819/"}