{"authors": ["Rebecca Ratcliffe", "Léonie Chao-Fong", "Richard Luscombe", "Tom Ambrose", "Kevin Rawlinson", "Jamie Grierson", "Reged Ahmad"], "date_download": "2024-02-05 15:29:03", "date_modify": "None", "date_publish": "2023-12-09 02:19:46", "description": "This blog is closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F08%2Fisrael-hamas-war-live-updates-gaza-palestine-idf-civilians-blinken.json", "image_url": "https://i.guim.co.uk/img/media/93075c7b079d113616d90691ca85a622745c7f35/0_367_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c824abfd86e41b8b896caef33589be61", "language": "en", "localpath": null, "maintext": "From 8 Dec 2023 23.52 CET US risks 'complicity in war crimes' by giving Israel weapons and 'diplomatic cover', says Human Rights Watch The US risks “complicity in war crimes” by continuing to provide Israel with weapons and “diplomatic cover” as it commits “atrocities” in Gaza, Human Rights Watch (HRW) has said. The HRW UN director, Louis Charbonneau, posted a statement after the US vetoed a security council resolution demanding an immediate ceasefire in the Palestinian territory. The veto by the US prevented the council from making some of the call Washington itself has been demanding, including compliance with international humanitarian law, protection of civilians and releasing all civilians held hostage, he wrote. The statement continues: By continuing to provide Israel with weapons and diplomatic cover as it commits atrocities, including collectively punishing the Palestinian civilian population in Gaza, the US risks complicity in war crimes. 🚨 US just vetoed another #Gaza ceasefire resolution in the UN Security Council. Drafted by UAE with nearly 100 co-sponsors.\n13 votes in favor, 1 against (US) and 1 abstention (UK).@hrw reaction follows in a short thread 🧵 pic.twitter.com/EstVHyRcBN — louis charbonneau (@loucharbon) December 8, 2023 .@hrw: By continuing to provide Israel with weapons and diplomatic cover as it commits atrocities, including collectively punishing the Palestinian civilian population in Gaza, the US risks complicity in war crimes. pic.twitter.com/YpbggNjd3y — louis charbonneau (@loucharbon) December 8, 2023\nUpdated at 00.01 CET\n9 Dec 2023 02.41 CET More than a dozen member states of the World Health Organization submitted a draft resolution on Friday that urged Israel to respect its obligations under international law to protect humanitarian workers in Gaza. The text of the draft resolution is due to be examined on Sunday during a special session of the WHO’s Executive Board convened to discuss “the health situation in the occupied Palestinian territory”. It was proposed by Algeria, Bolivia, China, Egypt, Indonesia, Iraq, Jordan, Lebanon, Malaysia, Morocco, Pakistan, Qatar, Saudi Arabia, Tunisia, Turkey, United Arab Emirates and Yemen. Palestinian representatives have WHO observer status, and were also signatories to the proposal. The member states expressed their “grave concern about the catastrophic humanitarian situation in the occupied Palestinian territory, including east Jerusalem, especially the military operations in the Gaza Strip”. They called for Israel to “respect and protect” medical and humanitarian workers exclusively involved in carrying out medical duties, as well as hospitals and other medical facilities. Separately, WHO spokesman Christian Lindmeier told reporters on Friday that Gaza’s health system was on its knees and could not afford to lose another ambulance or a single hospital bed. “The situation is getting more and more horrible by the day... beyond belief, literally,” he said. The United Nations’ humanitarian agency OCHA said late on Thursday that only 14 of the 36 hospitals in the Gaza Strip were functioning in any capacity.\n9 Dec 2023 01.56 CET Salvoes of rockets were launched early on Friday at the US embassy in Baghdad’s heavily fortified Green Zone, AFP has reported, the latest in a flurry of such attacks amid the Israel-Hamas war. “A multi-rocket attack was launched at US and Coalition forces in the vicinity of Union III and the Baghdad embassy complex” without causing any reported casualties or damage, a US official said. There was no immediate claim of responsibility. The United States “strongly” condemned the attacks and called on Iraq to bring the perpetrators to justice, the State Department said in a statement. “The many Iran-aligned militias that operate freely in Iraq threaten the security and stability of Iraq, our personnel, and our partners in the region,” spokesman Matthew Miller said in the statement. Since mid-October there have been dozens of rocket or drone strikes by pro-Iran groups against US or coalition forces in Iraq, as well as in Syria. But Friday’s rocket attack was the first against the US embassy in Baghdad since the Israel-Hamas war began on October 7, raising regional tensions and fears of a wider conflict.\n9 Dec 2023 01.25 CET Three Hezbollah fighters and a Syrian were killed on Friday in an Israeli drone strike on their car in the south of Syria, according to a report by AFP. “A Syrian and three Lebanese Hezbollah fighters from the surveillance and missile-launching unit were killed in the Israeli drone strike on their rented car” in Madinat al-Baath town in the province of Quneitra, close to the Israeli-annexed Golan Heights, the Syrian Observatory for Human Rights head Rami Abdel Rahman told AFP. Later on Friday Hezbollah said that three of its fighters had been killed, without giving any further details.\nIsrael has undertaken hundreds of air strikes in its neighbour Syria since the start of the country’s civil war in 2011, targeting the positions of the Syrian army and groups affiliated with Iran, such as Hezbollah. Those missions have intensified since the start of Israel’s war against Hamas in the Gaza Strip on October 7, which was triggered by the Islamist group’s unprecedented attack on Israeli soil. Israel rarely comments on its operations in Syria, but says it wants to prevent Iran, its sworn enemy, from establishing itself on Israel’s doorstep.\n8 Dec 2023 00.40 CET The Israeli military believes it needs another three to four weeks to complete its military offensive in Khan Younis in southern Gaza, according to a report. Citing a senior Israeli official, Israel’s Walla news reports that the Israel Defense Forces (IDF) believes it needs a similar amount of time after that to wrap up the first stage of the war in Gaza, according to the Times of Israel. The report says that the US has not given Israel a hard deadline, but that Washington has said that time is running out, it said. According to the report, the Biden administration would be happy for the IDF to complete intensive operations by the end of the month, but Israel believes it needs until the end of January, it said. The official was quoted as saying: The American message is that they would like to see us finish the fighting sooner, with less harm to Palestinian civilians and more humanitarian assistance for Gaza. We would also like this to happen, but the enemy does not always agree.\nUpdated at 00.51 CET\n8 Dec 2023 00.25 CET The US state department has denied it prevented the Palestinian foreign minister, Riyad Malki, from speaking to reporters during a visit to Washington DC. Malki, at a joint press conference by the Arab and Turkish diplomats in the US capital, was asked by a reporter about an interview with Palestinian Authority (PA) prime minister, Mohammad Shtayyeh. As we reported earlier, Shtayyeh told Bloomberg that he hoped Hamas could serve as a junior partner in governing Gaza after the war. During the press conference in Washington, Saudi foreign minister, Prince Faisal bin Farhan quickly intervened, AP reported. View image in fullscreen Saudi Arabia’s Foreign Minister Prince Faisal bin Farhan during a press conference with Palestine’s Foreign Minister Riad Al-Malki. Photograph: Justin Lane/EPA The Saudi minister told journalists that the US government had imposed visa “restrictions on his excellency that do not allow him to respond to media questions”. He added that he believed the ban was a “historical” practice and that violating it would bring legal repercussions. In a statement afterwards, the US state department said: “We have imposed no restrictions that prohibit individuals from speaking to the press.”\nUpdated at 00.34 CET\n8 Dec 2023 00.14 CET Tributes continue to pour in for the prominent Palestinian poet Refaat Alareer, who friends said was killed in an Israeli airstrike. Alareer, 44, was one of the leaders of a young generation of writers in Gaza who chose to write in English to tell their stories in the Palestinian territory. He taught world literature and creative writing at the Islamic University of Gaza and edited two short story collections, Gaza Unsilenced and Gaza Writes Back: Short Stories from Young Writers in Gaza, Palestine. Alareer, who fiercely denounced Israel and its policies towards the Palestinians, helped found We Are Not Numbers, which connected young Palestinian writers with mentors to tell stories that go beyond the numbers in the news. View image in fullscreen Refaat Alareer on a speaking tour in the US in 2014. Photograph: Tony Heriza/AFSC\nUpdated at 00.18 CET\n8 Dec 2023 00.01 CET The Israeli military said two of its soldiers were seriously wounded in a failed attempt to free Israeli hostages held in Gaza. In a statement, the Israel Defense Forces (IDF) said it killed numerous militants in the overnight operation, but was unable to rescue any hostages. As we reported earlier, the armed wing of Hamas said an Israeli soldier who was being held hostage was killed in a clash between the militants and an Israeli special forces unit that was conducting a rescue operation. They identified the captive soldier as 25-year-old Sa’ar Baruch. Israel’s military had no comment on the claim.\n8 Dec 2023 23.52 CET US risks 'complicity in war crimes' by giving Israel weapons and 'diplomatic cover', says Human Rights Watch The US risks “complicity in war crimes” by continuing to provide Israel with weapons and “diplomatic cover” as it commits “atrocities” in Gaza, Human Rights Watch (HRW) has said. The HRW UN director, Louis Charbonneau, posted a statement after the US vetoed a security council resolution demanding an immediate ceasefire in the Palestinian territory. The veto by the US prevented the council from making some of the call Washington itself has been demanding, including compliance with international humanitarian law, protection of civilians and releasing all civilians held hostage, he wrote. The statement continues: By continuing to provide Israel with weapons and diplomatic cover as it commits atrocities, including collectively punishing the Palestinian civilian population in Gaza, the US risks complicity in war crimes. 🚨 US just vetoed another #Gaza ceasefire resolution in the UN Security Council. Drafted by UAE with nearly 100 co-sponsors.\n13 votes in favor, 1 against (US) and 1 abstention (UK).@hrw reaction follows in a short thread 🧵 pic.twitter.com/EstVHyRcBN — louis charbonneau (@loucharbon) December 8, 2023 .@hrw: By continuing to provide Israel with weapons and diplomatic cover as it commits atrocities, including collectively punishing the Palestinian civilian population in Gaza, the US risks complicity in war crimes. pic.twitter.com/YpbggNjd3y — louis charbonneau (@loucharbon) December 8, 2023\nUpdated at 00.01 CET\n8 Dec 2023 23.32 CET Israel thanks US for vetoing ceasefire resolution Israel’s ambassador to the UN, Gilad Erdan, has thanked the US and Joe Biden for vetoing a draft security council resolution that demanded an immediate humanitarian ceasefire in Gaza. Posting to social media, Erdan praised the US president for “standing firmly by our side” and for showing “leadership and values”, adding: On this Hanukkah holiday, a little of the light dispelled a lot of the darkness. I thank the United States and President Biden for standing firmly by our side, today and showing their leadership and values. On this Hanukkah holiday, a little of the light dispelled a lot of the darkness.\nIt is shocking that while Hamas is firing rockets at Israel from… — Ambassador Gilad Erdan גלעד ארדן (@giladerdan1) December 8, 2023\n8 Dec 2023 23.26 CET The UK ambassador to the UN, Barbara Woodward, has explained the decision to abstain from the UN resolution demanding an immediate humanitarian ceasefire in Gaza. Britain backs “further and longer pauses” to get aid to Palestinians and to allow the release of Israeli hostages, Woodward said. But she argued to the council that “we cannot vote in favour of a resolution which does not condemn the atrocities Hamas committed against innocent Israeli civilians” on 7 October, adding: Calling for a ceasefire ignores the fact that Hamas has committed acts of terror and is still holding civilians hostage.", "source_domain": "www.theguardian.com", "text": null, "title": "US risks ‘complicity in war crimes’, says Human Rights Watch - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/08/israel-hamas-war-live-updates-gaza-palestine-idf-civilians-blinken"}