{"authors": ["Julian Borger", "Emma Graham-Harrison"], "date_download": "2024-02-05 15:29:05", "date_modify": "None", "date_publish": "2023-12-09 19:15:27", "description": "Shadow foreign secretary David Lammy slams Israeli ‘death and destruction’ and urges UK travel ban on violent settlers", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fpolitics%2F2023%2Fdec%2F09%2Flabour-steps-up-criticism-of-intolerable-killings-in-gaza.json", "image_url": "https://i.guim.co.uk/img/media/44a3e4f6bedd8a0d8e24916f3c0995472a7e1979/0_146_4546_2728/master/4546.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=923157ce2b7ae79fe7ffc075d1847340", "language": "en", "localpath": null, "maintext": "The Labour party today delivers its strongest criticism of Israel over its attacks on Palestinians, describing the death and destruction in Gaza over the past two months as “intolerable” and attacking two far-right Israeli cabinet ministers for “totally unacceptable” support of illegal settlements in the West Bank.\nIn a sharp change of tone, David Lammy, the shadow foreign secretary, with the full backing of party leader Keir Starmer, attacks the Israeli authorities for “turning a blind eye” to violence by settlers in the West Bank, which has “forcibly displaced” more than 1,000 Palestinians from their homes since the attacks on Israel by Hamas on 7 October.\nHe criticises far-right ministers for pumping huge sums into the budget for settlements, which threaten any hope of a political solution, while “defunding the Palestinian Authority and promoting dangerous and extreme rhetoric about Palestinians”.\nLabour has been split over whether or not to call for a ceasefire. By echoing US calls for action against extremist settlers, Lammy can lay claim to be taking a stronger stance on protecting Palestinians without moving beyond the US and UK government position on whether Israel should stop its war on Hamas in Gaza.\nWriting in the Observer, Lammy demands that Rishi Sunak’s government impose immediate travel bans on those responsible for settler violence, and says a Labour government will not tolerate Palestinians being forced out of their homes.\nLabour’s call follows US plans announced last week to impose travel bans on extremist Jewish settlers implicated in attacks on Palestinians in the West Bank, a rare punitive move against Israel from Washington.\n“The people of Gaza, like the people of the West Bank, must know that a Labour government, with the international community, will not tolerate their expulsion,” writes Lammy.\n“Israel must clearly affirm that Palestinians displaced since 7 October will be able to return to their homes. This must be at the core of our efforts.”\nLammy wrote of visiting a Bedouin community in the West Bank, who had been driven from their village Wadi as-Seeq by “an armed group of illegal settlers”.\nThe Guardian visited the village and met the community two weeks after the 7 October attacks on Israel, reporting on the latest in a series of expulsions which Israeli activists described as “the most successful land-grab strategy since 1967”. Since then, attacks and forced displacement have only gathered pace.\nThe comments came as the death toll in Gaza rose towards 18,000 and the humanitarian crisis deepened. A top UN official warned that “people are starving”, and constraints on getting aid into Gaza were so extreme, and conditions so bad, that its relief operation was “no longer tenable”.\n“With law and order breaking down, any meaningful humanitarian operation is impossible,” Carl Skau, deputy executive director of the World Food Programme, said after visiting Gaza on Friday. He said in some areas, nine out of 10 families were going for entire days without eating.\n“Nothing quite prepared me for the fear, the chaos, and the despair we encountered. Confusion at warehouses, distribution points with thousands of desperate hungry people, supermarkets with bare shelves.”\nAs global concern about the threat to Gaza’s civilian population sharpened, the US vetoed a United Nations resolution calling for an immediate ceasefire on Friday. The UK abstained, saying it would have supported the motion had it contained explicit criticism of Hamas.\nWhile not saying it would have backed the UN resolution, a Labour spokesperson said: “If we were in government we would be doing all we can to negotiate a text that the whole council could support based on a cessation of hostilities, to alleviate the suffering of Palestinian civilians, secure the release of all remaining hostages, and using that as a stepping stone to an enduring end to this conflict. The world needs a UN that can speak with a collective voice, not be hamstrung by division.”\nAs Israeli forces fought to consolidate their control of northern Gaza on Saturday , and expanded their campaign in the south, the Israeli newspaper Haaretz published an analysis showing that the aerial bombing campaign is the most indiscriminate in terms of civilian casualties in Gaza in recent years.\nIn the first three weeks of the current operation, Swords of Iron, the civilian proportion of total deaths shot up to 61%, in what Haaretz described as “unprecedented killing”. The ratio is also significantly higher than the civilian toll in all the conflicts around the world during the 20th century, in which civilians accounted for around half the dead.\n“The broad conclusion is that extensive killing of civilians not only contributes nothing to Israel’s security, but that it also contains the foundations for further undermining it,” Haaretz concluded. “The Gazans who will emerge from the ruins of their homes and the loss of their families will seek revenge that no security arrangements will be able to withstand.”\nThe study confirms an investigation 10 days ago by two other Israeli news sites, +972 Magazine and Local Call, which found that Israel was deliberately targeting residential blocks to cause mass civilian casualties in the hope Gazans would turn on their Hamas rulers. The figures will make uneasy reading for the Biden administration. Since the start of war, the US has been seeking to persuade Israeli forces to be more discriminating in choosing targets, and has repeatedly claimed that the Israel Defense Forces (IDF) are “receptive” to American advice, despite the consistently high civilian death toll.\nThe US national security spokesperson, John Kirby, repeated that claim while briefing reporters on Air Force One on Friday, but he added: “We certainly all recognise more can be done to try to reduce civilian casualties, and we’re going to keep working with our Israeli counterparts to that end.”\nHuman Rights Watch said the US risked “complicity in war crimes” by continuing to provide Israel with weapons and diplomatic support. Paul O’Brien, the executive director of Amnesty International USA, said: “With this veto, the US government is shamefully turning its back on immense civilian suffering, staggering death toll, and unprecedented humanitarian catastrophe in Gaza.”\nBy Saturday the death toll from the war was more than 17,700, health authorities under the Hamas-run government said, with thousands more believed to be buried under the rubble. The UN said nearly 13,000 of the dead were women and children.\nIsrael says 93 Israeli soldiers have died in the military operation launched after Hamas’s attack killed 1,200 people, mostly civilians, with more than 200 taken hostage.", "source_domain": "www.theguardian.com", "text": null, "title": "Labour steps up criticism of ‘intolerable’ killings in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/politics/2023/dec/09/labour-steps-up-criticism-of-intolerable-killings-in-gaza"}