{"authors": [], "date_download": "2024-02-05 15:29:06", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "British Defence Secretary Grant Shapps is set to visit Israel and the occupied West Bank this week to expedite humanitarian aid to Gaza, aiming to discuss direc", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274057384%2Fuk-defence-minister-to-visit-israel-west-bank-to-push-humanitarian-aid-in-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/ani1701942720.jpg", "language": "en", "localpath": null, "maintext": "Gaza Border [Israel], December 7 (ANI): British Defence Secretary Grant Shapps is set to visit Israel and the occupied West Bank this week to expedite humanitarian aid to Gaza, aiming to discuss direct aid delivery by sea during talks with Israeli and Palestinian leaders, CNN reported on Thursday.\nShapps emphasised the search for the quickest and most direct routes, including options by land, sea, and air. Additionally, four Royal Air Force flights carrying over 74 metric tons of aid for Palestinians have landed in Egypt. Shapps will also address progress on recovering hostages, including Britons taken by Hamas in the October 7 attack.\nThe Rafah border crossing between Egypt and Gaza is scheduled to open for foreign nationals and dual citizens to exit the strip, including 63 US citizens and individuals from Romania, the UK, Ukraine, and Kazakhstan, along with 13 United Nations personnel intending to enter Gaza. Rafah, not controlled by Israel, has been crucial for aid entry and people escaping since Israel's conflict with Hamas in October.\nSeveral UN agencies warn of a dire situation in Gaza, with Israel approving a \"minimal\" increase in fuel permitted to prevent a \"humanitarian collapse.\"The World Health Organisation notes Gaza's health system is near collapse, and the World Food Programme warns of a humanitarian system breakdown, stating, \"Everyone in Gaza is hungry.\" The Israeli military advances in the south, surrounding the home of Hamas' leader, seen as a \"symbolic victory.\"Meanwhile, Israeli Prime Minister Benjamin Netanyahu on Wednesday evening released a statement clarifying two points. One dealt with Yahya Sinwar, the leader of Hamas, now that the IDF (Israel Defense Forces) has surrounded the area in southern Gaza where he was believed to be located.\n\"Last night I said that our forces could go anywhere in the Gaza Strip,\" said Netanyahu. \"They are currently surrounding Sinwar's house. His home is not his castle, and he can flee, but it is only a matter of time until we find him.\"In other words, Sinwar can run, but he cannot hide.His second statement concerned getting the Red Cross to visit the Israeli hostages held in Gaza.\n\"To this end,\" he said, \"I spoke with the President of the Red Cross again today and I told her to turn to Qatar since it has been proven that they have leverage over Hamas, and demand Red Cross visits with our hostages and, of course, the provision of medicines for them.\" (ANI)", "source_domain": "www.britainnews.net", "text": null, "title": "UK Defence Minister to visit Israel, West Bank to push humanitarian aid in Gaza", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274057384/uk-defence-minister-to-visit-israel-west-bank-to-push-humanitarian-aid-in-gaza"}