{"authors": ["Beau Dure"], "date_download": "2024-02-05 15:29:08", "date_modify": "None", "date_publish": "2023-12-09 23:30:04", "description": "Minute-by-minute report: The Columbus Crew saw off Los Angeles FC to capture this year’s MLS Cup title. Beau Dure was watching", "filename": "https%3A%2F%2Fwww.theguardian.com%2Ffootball%2Flive%2F2023%2Fdec%2F09%2Fcolumbus-crew-v-los-angeles-fc-mls-cup-final-2023-live.json", "image_url": "https://i.guim.co.uk/img/media/1c4417f0154d7b646dca409c6bfa6cebc19591e9/0_140_4229_2538/master/4229.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=8b3957c4993335ece9c96367a1b2b542", "language": "en", "localpath": null, "maintext": "9 Dec 2023 00.23 CET First up in postgame interviews is … Aidan Morris? The young American concedes immediately that he can’t find the words to describe the moment. Old-school Crew fans might choose the word “massive,” a cheeky reference to the fact that they are not residents of the largest city in the USA. (Apologies to supporters of both New York teams, who have combined to win one-third as many MLS Cups as the team from central Ohio.) MLS commissioner Don Garber steps up to give out the awards and ignore the boos from fans who have certainly not forgotten that he was quite willing to let the team walk off to Austin. Garber saw the league through near-extinction in 2001 and has built it into a league big enough to sign Beckham and Messi, but it’s nice that there’s still space at the top for Nagbe and the Nordecke, the Crew’s ever-loyal supporters group. And with that, we’ll sign off. Congratulations again to the Crew and everyone for whom this moment seemed a long way off a few years ago.\nUpdated at 00.23 CET\n9 Dec 2023 00.15 CET A tale of two halves in a way, with a 2-0 halftime score accurately reflecting the one-way traffic. LAFC wound up equaling Columbus for shots on goal (5 each) as the defending champions turned up the intensity in the second half. We can argue the merits of the MLS playoff system all day – personally, I’d like to see a Cup competition that runs concurrently to the season while the actual “playoffs” consist of a single game between the conference winners – but the Crew are worthy champions. Again.\n9 Dec 2023 00.09 CET Columbus Crew win their third MLS Cup Small market? So what? From building the first stadium for an MLS team to winning three league championships, the Crew and their loyal fans have a lot to be proud of. None moreso than this game, with their young goalkeeper and poised veterans holding off a talent-rich defending champion to win the final.\n9 Dec 2023 00.07 CET 90 mins +7: Columbus break away, and Ramirez takes the ball to the corner to do battle with oncoming defenders. He wins a corner kick and exhorts the crowd, which responds with a roar.\n9 Dec 2023 00.06 CET 90 mins +6: Gressel botches a defensive assignment on Bouanga, and the Golden Boot winner races down the left. But the Columbus defense holds tight and clears.\n9 Dec 2023 00.05 CET 90 mins +4: Pointless fouls all around now, and this one gives Columbus some breathing room. Molino may have hit the ground a little easily, but Palencia was close enough to justify the call.\n9 Dec 2023 00.04 CET 90 mins +2: Columbus counter, and Ramirez is free! Off he goes! And … he’s pulled down! Or is he? No, Parillo may have fouled him, but if so, it was outside the area. Columbus fans aren’t happy with that decision, especially after Morris gets yellow for a foul at the other end. But the Crew defend the set piece, and we play on.\n9 Dec 2023 00.02 CET 90 mins: We’ll have at least seven minutes of stoppage time, and Rossi will not participate in them. Molino has replaced him.\n9 Dec 2023 00.01 CET 89 mins: Oh, Chiellini should surely see yellow now. Schulte makes a comfortable save on a poorly struck header, but the Italian veteran crashes into the recently injured keeper. Villarreal has a whistle and a word. Chiellini has a few words in response, and Villarreal gives a gesture that effectively says, “I don’t care about your resume, my friend – get out of here now.”\n9 Dec 2023 23.58 CET 88 mins: A beautiful run down the left, a cross to Rossi, and … he shanks it badly with his left foot.\n9 Dec 2023 23.57 CET 86 mins: So with 40% of their field players replaced in the last three minutes, how will the Crew respond? The immediate answer: Rossi gets fouled. LAFC subs: Ilie is out, somewhat surprisingly. So is Palacios, winner of the last yellow card. Palencia and Gonzalez are the inbound players.\nUpdated at 23.59 CET\n9 Dec 2023 23.56 CET 85 mins: Yellow to Palacios for any number of fouls at the same time on Cucho. Another pair of Columbus subs – Julian Gressel and Christian Hernandez replace Cucho and Farsi. Zawadszki and Cheberko were the subs in the last exchange.\n9 Dec 2023 23.55 CET 83 mins: Vela hits the ground, Villarreal takes no action, LAFC maintain control, cross, knocked away, and now we get some subs – the goal-scorer Yeboah and the captain Nagbe will leave\n9 Dec 2023 23.52 CET 80 mins: Everything happening quickly now. Yeboah is down in the LAFC penalty area, and we have some question of whether Kevin Stott will weigh in from his VAR spot, but no, that would be nothing. Chiellini, in fact, is rather aggravated that Yeboah has remained down, and he shares that opinion with Villarreal.\n9 Dec 2023 23.50 CET 79 mins: Columbus players finally remember they have a potent attacker in Cucho, and they play it forward to him, only to see a shot go miles wide. The Crew do earn a corner, though. And to cite Eurythmics, here comes the rain again.\n9 Dec 2023 23.49 CET 77 mins: Krastev replaces the invisible Acosta for LAFC while Schulte hops around to try to convince medical personnel that he’s OK to stay in. The young keeper confidently strides forward, hears the roar from the crowd, and waves his arms to get even more noise. Game on, and the 22-year-old keeper who won the MLS Next Pro championship last year with Columbus’ reserves is here for it.\n9 Dec 2023 23.47 CET Goooooalll! Columbus 2-1 LAFC (Bouanga 74) I’ll erase my “chance for LAFC” comment because the attackers won back the ball and worked it quickly to Bouanga, who forces a good save from Schulte. But the ball remains in play, and Bouanga finishes from an acute angle past a scrambling Schulte, who is down and being treated. It appears he made the initial save with a bit of his hand but a lot of his face.\n9 Dec 2023 23.42 CET 71 mins: Rossi falls in the LAFC penalty area. Villarreal waves play on. What does Kevin Stott think as he sits in front of all the cameras available for VAR? LAFC go the other way, and Bouanga takes the ball all the way to the line, then crosses through Schulte’s legs. Somehow, the LAFC attacker three yards from the goal doesn’t extend a foot.\n9 Dec 2023 23.40 CET 69 mins: Bouanga splits two defenders … almost. Moreira wins it back, and Bouanga applies a Ronda Rousey-style armbar to try to regain possession. The Golden Boot winner’s frustration is evident.\n9 Dec 2023 23.39 CET 67 mins: We’ve hit the “We’re going to foul you so you can’t counterattack” phase of the game. Ugh. Ilie fouls Nagbe and gets yellow, and that is surely persistent infringement because there’s no explanation other than the fact that LAFC have played as if there’s a target on the Columbus captain’s legs. That’s no way to treat your elders.\n9 Dec 2023 23.35 CET 64 mins: Are LAFC working their way back into this game? Columbus no longer look as comfortable. They’ve also shifted into counterattacking mode, and they may well put the game away in an instant.\n9 Dec 2023 23.33 CET 62 mins: Free kick to LAFC from dead center about 35 yards out. It’s chipped into the penalty area and flicked over to Bouanga, but the Golden Boot winner’s swing at the ball sends it well off target.\n9 Dec 2023 23.32 CET 59 mins: Foul by Tillman, and is this worth a second yellow? The replay shows that his foot is in front of Diego Rossi, and he gets a slight touch on the ball, so no, surely not. Villarreal has had a great game. That will be it for Tillman, regardless. The German-born player who has declared his desire to represent the USA will make way for Mateusz Bogusz.\n9 Dec 2023 23.29 CET 57 mins: CHANCE FOR LAFC! They go direct, and Camacho makes a mess of a header at the top of his own area. The ball goes to the onrushing Carlos Vela, whose shot is right at Schulte. The French center back has been the weak link in the Columbus lineup thus far.\n9 Dec 2023 23.26 CET 55 mins: CHANCE FOR LAFC! Or maybe not. Crepeau makes an easy save and tries to match his counterpart’s long distribution, sending it quickly up the field. It’s collected by LAFC and played forward, but a brilliant tackle cuts out the danger – which, as it turns out, didn’t really exist, because the flag went up (correctly) for offside as play continued.\n9 Dec 2023 23.24 CET 53 mins: Another yellow to LAFC, and this is on Tillman for a foul on Nagbe. The commentators believe that’s persistent infringement. I’m not sure about that.\n9 Dec 2023 23.22 CET 49 mins: BIG CHANCE for Columbus and some controversy! Columbus go on the counterattack, and Carlos Vela is late sliding into a tackle on Cucho. While the Crew attacker rolls around in “pain,” Armando Villarreal expertly plays advantage, and Palacios ends up having to send the ball out very close to his own goal. Villarreal returns to the scene to give Vela a yellow card. The Crew may argue for a red, but frankly, Cucho may have hurt his own case by rolling around so unrealistically. Whatever contact was made – and it certainly was – Cucho embellished, and it’s difficult for a ref to reach for the red when that’s obviously the case.\n9 Dec 2023 23.18 CET 47 mins: CHANCES for Columbus! Cucho stings Crepeau’s hands with a well-struck shot from the top of the penalty area. The Crew keep possession and send a through ball on the right, and it’s some desperate defending to send the cross away from the net.\n9 Dec 2023 23.11 CET Some halftime stats from the MLS site .. Possession: 68.2% Columbus Shots: 8-4 Columbus (2-1 in shots on goal) Total passes: 341-159 Columbus Passing accuracy: 88%-74.2% Columbus Corners: 5-1 Columbus, with the lone LAFC corner at the end of the half Coaches with the experience and the roster depth to turn this around: 1-0 LAFC Holiday candy eaten: Too much, by me\n9 Dec 2023 23.02 CET Halftime: Columbus 2-0 LAFC So LAFC wraps up the half on a positive note. A small one. They were completely outplayed in the first 44 minutes, and the score is a fair one, even if the penalty was a little fortunate.\n9 Dec 2023 23.00 CET 45 +3 mins: CHANCE FOR LAFC! Columbus defender Rudy Camacho very nearly put a cross into his own net. It’s a corner – the first for LAFC.", "source_domain": "www.theguardian.com", "text": null, "title": "Columbus Crew 2-1 Los Angeles FC: MLS Cup final 2023 - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/football/live/2023/dec/09/columbus-crew-v-los-angeles-fc-mls-cup-final-2023-live"}