{"authors": ["Jon Brady"], "date_download": "2024-02-05 15:29:11", "date_modify": "None", "date_publish": "2023-12-09 22:09:34", "description": "The Met Police shared an image of the woman - wearing a beanie hat and a Palestinian keffiyeh scarf - on X, formerly Twitter, following Saturday's protests after she was seen with the sign.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12845923%2FMet-police-appeal-information-woman-seen-London-holding-spot-difference-sign-comparing-pictures-IDFs-actions-Gaza-Nazi-Holocaust-footage-shows-protesters-chanting-victory-intifada.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/09/22/78777063-0-image-m-13_1702161221110.jpg", "language": "en", "localpath": null, "maintext": "Police are hunting for a pro-Palestine protester who waved a sign on Saturday comparing the IDF's rounding up of Palestinians in their underwear to the execution of Jewish people by the Nazis during the Second World War.\nThe Met Police shared an image of the woman - wearing a beanie hat and a Palestinian keffiyeh scarf - on X, formerly Twitter, following Saturday's protests.\nImages of the sign were shared by others on social media: it shows a photograph, taken during the Second World War, of German police preparing to execute Jewish men and boys in Poland.\nAlongside it, the placard features a photograph of Israel Defense Forces soldiers with dozens of Palestinian men who had been stripped to their underwear - and the caption: 'Spot the difference?' The other side read: 'Stop killing children.'\nElsewhere, video was shared of a protester with a microphone and amplifier calling for 'victory to the intifada' during the protest; 'intifada' is an Arabic word referring to a rebellion, uprising or resistance movement.\nThe Metropolitan Police has asked for the public's help in identifying a woman carrying a sign comparing the IDF's treatment of Palestinians to Holocaust victims\nThe sign compared a scene of Nazis preparing to execute Jewish men and boys to the IDF's capture and stripping of Palestinians\nVictory to the intifada, apparently. This the Communist bloc pic.twitter.com/ULA07Hcno6 — Yonatan יונתן #AdoptIHRA (@__jacker__) December 9, 2023\nImages of Palestinian captives stripped to their underwear by the IDF were shared earlier this week; it was not clear whether they were civilians or Hamas fighters\nOne sign pictured at the march made a reference to the 'final solution' - a term used by the Nazis to refer to the genocide of Jews\nAnother person held a sign with pictures of devastation in Gaza accompanied by the caption: Israel's Gaza Holocaust\nPhotographer Stuart Mitchell shared a video of an exchange he had with the woman holding the sign on the social network.\nHe asked: 'Are they Holocaust victims in your poster? Is that appropriate?' She appears to acknowledge his questions but does not respond further.\nHe also attempted to bring the sign to the attention of police officers monitoring the rally. The Met says the officers did not stop to engage with him because they were following the woman holding the sign.\nIn a series of tweets, the force said: 'We are appealing for the public's help to identify the woman below as part of an investigation into a placard carried at the protest earlier today. We would also appeal to the woman to come forward.'\nIt later added: 'The officers didn’t stop because as the video was being filmed, they were already following the person holding the placard while waiting for other officers to reach them. That was their focus.\n'The density of the crowd meant that they ultimately lost sight of her prior to other officers arriving. We are now appealing for the public’s help to identify her, or for her to come forward.\nThe photograph on the right was shared by Israeli media and shows IDF troops rounding up a number of Palestinian men who had been stripped to their underwear.\nWhen asked about the images, IDF spokesman Rear Admiral Daniel Hagari seemed to confirm that the men had been taken prisoner but did not clarify whether those pictured were members of Hamas or civilians.\nHe suggested that the men had been stripped to make sure they were not carrying weapons; they were believed to have surrendered in the Jabalia refugee camp and other areas around northern Gaza.\nThe origin of the image on the left has never been fully ascertained, but is believed to show naked Jewish men and boys being rounded up by German police following the invasion of Poland in 1939.\nOne example was been captioned: 'Photograph of the abuse of Jews before execution, Sniatyn, Poland (now Ukraine), 11/05/1943'. An investigation carried out by the Guardian in 2004 was unable to confirm the story behind the picture but it forms part of several collections of Holocaust historical material around the world.\nElsewhere, a man was heard encouraging people to chant 'victory to the intifada' as he marched through central London with a microphone and amplifier.\n'We can't stop until Palestine is free...we can only stop when imperialism has been crushed and the imperialists defeated under the boot of the people.\n'That is the only way we will win and we can never stop until that day.'\nHe added: 'That's why we say: From London, to Gaza.' Others responded: 'Victory to the intifada.'\n'Intifada' is an Arabic word that in this context refers to the uprising of the Palestinian people against Israeli occupation.\nPolice detain a person during the pro-Palestine march in central London on Saturday. The Met says it has made 13 arrests, mostly related to offensive signs\nOfficers encircle a person as they are detained at the corner of Whitehall and Horse Guards Parade in central London on Saturday\nPolice detain a protester as a man wearing an orange 'observer' vest looks on in Whitehall\nThere are two recognised Palestinian intifadas: the first, six-year resistance between 1987 and 1993, and a second intifada from 2000 to 2005. Some commentators have referred to events following the October 7 attacks as the 'third intifada'.\nIt has also been used in a wider context to refer to a number of civil uprisings throughout the Middle East.\nIt came as Scotland Yard continues to search for others waving allegedly offensive signs during today's pro-Palestine march in the capital - as well as earlier marches since Hamas' murderous incursion into Israel on October 7 that killed 1,200 people.\nEnquiries are ongoing into a 'Final Solution' placard that also Israel to the Nazis as thousands of people descended on the capital on Saturday to call for an immediate ceasefire between Israel and Hamas, a proscribed terror group in the UK.\nThe Metropolitan Police says it has made 13 arrests - largely for the carrying of offensive signs - on Saturday as images circulating online showed signs referring to Israel's sustained attacks on the Gaza Strip as 'genocide'.\nOne of the signs made a reference to the 'final solution' - a term used by the Nazis to refer to the genocide of Jews.\nA spokesperson for the Met told MailOnline the force was 'not aware of any arrests in relation to this specific placard but officers are aware of the image and are actively investigating'.\nAnother sign featured pictures of Gaza with the caption: 'Israel's Gaza Holocaust', while a third added: 'One Holocaust does not justify another'.\nSaturday's protests, attended by thousands, came a week after smaller demonstrations were held in boroughs across the capital, away from the centre of London.\nThe march began at Bank Junction at midday on Saturday; the Metropolitan Police later said the area around Whitehall was 'largely clear' after the protest\nPeople of all ages marched through the streets of London on Saturday afternoon\nA woman joins the march in solidarity with Palestinians in London on Saturday\nA protester holds a bundle made to look like the wrapped corpse of a child during protests in London\nIn a statement posted on X, formerly Twitter, the Met said the protest had largely dispersed.\nIt added: 'There have been 13 arrests so far, mostly for offensive placards but some for other offences including possession of drugs and obstruction.'\nREAD MORE: Amazing moment man takes down Palestine flag flying in Tower Hamlets - only to be attacked by passing driver before they battle each other with LADDERS Advertisement\nThe Met has deployed a specialist CCTV team, known as Voyager, to monitor the pro-Palestine protests and identify alleged lawbreakers.\nIt has shared appeals on social media asking for help in identifying some protesters over alleged offensive placards.\nOther arrests on Saturday included a woman who was wanted for an offence said to have taken place during a protest on October 28.\nThe march began at Bank Junction at midday on Saturday and is set finish in Westminster later this afternoon, following a route that takes it past St Paul's Cathedral and Somerset House.\nOn X, the force said its Public Order crime team are investigating a series of signs for possible offences.\nProtesters are calling for an immediate ceasefire in Gaza after the US vetoed a UN resolution last night, as the body warned a humanitarian catastrophe is unfolding in the region.\nWith the war now in its third month, the Palestinian death toll in Gaza has surpassed 17,700, with the majority of victims being women and children, according to the Hamas-run Health Ministry.\nIt comes as new analysis has found that the civilian proportion of total deaths rose to 61 percent in the first three weeks of Israel's 'Swords of Iron' operation.\nProtesters speaking to the PA news agency said that the Government should demand a ceasefire.\nLebanese-American Nadim Hussami, 44, said: 'They should ask for an immediate ceasefire and not veto or abstain from UN Security Council resolutions.'\nA man marches with a sign reading 'freedom for Palestine' - with a cat on his back - in central London on Saturday\nProtesters march through central London towards Parliament Square to demand a ceasefire - as St Paul's Cathedral looms above them\nThe protest wrapped up late on Saturday afternoon after following a route that took it past St Paul's Cathedral and Somerset House\nPolice officers speak with pro-Palestine protesters during Saturday's march\nThousands of Israelis and Palestinians have died since the militant group Hamas launched an attack on Israel, prompting several similar protests across the country\nPeople on the march held signs with the words 'Free Palestine' and 'End the siege'\nSome protesters chanted: 'One, two, three, four, occupation no more, five, six, seven, eight, Israel is a terrorist state'\nJocelyn Cruywagen, from South Africa, added: 'We were oppressed by white people, as black South Africans we had to fight for our freedoms, we are still not entirely free.\n'It takes so much time. The words of Mandela are, if the Palestinians are not free, we cannot be free, the world can not be be free.'\nShe said that the Government must call for a 'permanent ceasefire', adding: 'They should ask for the land to be restored to the Palestinians. The wall needs to come down.'\nLondoner Kelly Hunter, 60, said she felt 'helpless' watching the news.\nShe said: 'I have come on every single one, I am a Londoner. I feel helpless, I can't sleep at night.\n'I am watching this genocide. I will do everything I can in my power to march against it.'\nPreviously, the Metropolitan Police had tweeted that a man had been arrested on suspicion of a racially aggravated public order offence. It is not thought that this is the same person pictured with the 'final solution' sign.\n'As the march formed up, officers identified a man with a placard making comparisons between Israel and Nazi Germany,' the force said.\n'He has been arrested on suspicion of a racially aggravated public order offence.'\nA short while later, police said a second protester had been arrested for holding an 'offensive' placard.\nThe Met issued a dispersal order under Section 35 of the Antisocial Behaviour, Crime and Policing Act which covers Westminster, Soho and Mayfair.\nA spokesperson said: 'Anyone in the area who is directed by an officer to leave and fails to do so can be arrested.\n'Orders under Section 60 and Section 60AA of the Criminal Justice and Public Order Act are also in place in the same area until the same time.\n'They provide officers with additional search powers to prevent violence/disorder and the power to direct the removal of face coverings.'\nThe march began at Bank Junction at midday on Saturday and is set finish in Westminster later this afternoon\nOne sign read: '10,000 children' and others urged for the 'genocide' to cease\nPeople on the march held signs which bore the words 'Gaza Stop the Massacre'\nPro-Palestinian activists and supporters take part in a minute of silence\nOne sign read: Imperialism, Settler-colonialism, Racism, Apartheid, Ethnic cleansing and Land theft as an acronym of Israel\nHundreds of officers are policing the march, including officers from as far as Manchester who have been brought in for additional support\nNEWCASTLE: Protesters carried a giant Palestinian flag as they marched along the city's waterfront on Saturday\nProtesters in Manchester clashed with police - one waving a sign that read: 'Genocide is not a form of defence'\nProtesters staged an occupation of Glasgow Central Station on Saturday in one of a number of rallies to take place across the country\nProtesters in Glasgow waved Palestinian flags as they chanted slogans (left). Some even sat down on the station concourse as the protest unfolded (right)\nPeople on the march held signs which bore the words 'Free Palestine' and 'End the siege', while some protesters chanted: 'One, two, three, four, occupation no more, five, six, seven, eight, Israel is a terrorist state.'\nThey also chanted the controversial slogan: 'From the river to the sea, Palestine will be free' and 'From London to Gaza, Globalise the intifadas'.\nREAD MORE: Gripping moment Israeli soldiers battle Hamas gunmen in Gaza school - then find tunnel leading to nearby mosque Advertisement\nAn exclusion zone is in place prohibiting any protesters from assembling around the Israeli embassy.\nA post on the Palestine Solidarity Campaign (PSC) website reads: 'Join us in the streets of London for our National March for Palestine on Saturday December 9 to call for a full ceasefire and an end to the war on Gaza.'\nProtests were held elsewhere in the UK today as part of the the ongoing 'days of action' movement organised by groups including the PSC, Stop the War Coalition and Friends of Al-Aqsa, a pro-Palestinian organisation.\nIn Newcastle, hundreds marched along the city's waterfront beneath its bridges before assembling at Gateshead's Baltic Centre for Contemporary Art.\nProtesters could be seen arguing with police in Manchester city centre; one woman waved a placard reading 'genocide is not a form of defence'.\nIn Glasgow, protesters occupied the city's Central Station concourse and chanted 'ceasefire now' as they sat on the terminal floor.\nSharing video of the crowd inside the railway station, the Glasgow chapter of the Stop the War Coalition tweeted: 'Glasgow Central Station occupied...“Ceasefire now!”'\nThousands of protesters have been seen in the capital in previous weekends. The largest counter-protest, on Armistice Day, saw gangs of far-right thugs clash with police around the Cenotaph and more than 100 people arrested.\nAt least 17,487 Palestinians have been killed since October 7, according to Gaza Health Ministry figures, while 1,200 people were killed in the Hamas incursion into Israel, according to Israeli tallies.\nIsraeli's military has stepped up its ground offensive in the south of the Gaza Strip in recent days after decimating much of the north of the occupied territory in its mission to 'exterminate' Hamas.\nEarlier, the Met Police said that protesters must stick to the agreed route, under Section 12 of the Public Order Act.\n'Further conditions are in place that mean speeches must end by 4pm and the assembly at the end of the protest must end by 5pm,' it said.\nHundreds of officers policed the march, including officers from as far as Manchester who have been brought in for additional support.\nAs the demo reached Parliament, dozens of police officers surrounded the statue to Winston Churchill.\nSpeeches were given by a number of speakers, including former Labour leader Jeremy Corbyn and former shadow Chancellor John McDonnell. A minute of silence was also held.\nHundreds of pro-Palestinian demonstrators gather to march to Parliament Square, demanding ceasefire, showing solidarity with Palestinians\nSigns called for an immediate ceasefire, to 'free Palestine' and 'end apartheid'\nAt least 17,487 Palestinians have been killed since October 7, according to Gaza Health Ministry figures, while 1,200 people were killed in the Hamas incursion into Israel, according to Israeli tallies\nAs the demo reached Parliament, dozens of police officers surrounded the statue to Winston Churchill - as speeches supporting Palestine were voiced\nPro-Palestinian placards are pictured during a National March for Palestine in central London on Saturday\nAn exclusion zone is in place prohibiting any protesters from assembling around the Israeli embassy\nOne woman at the march held a sign which referred to Israel as 'Israeliars'\nThousands are thought to be in attendance at the march this afternoon\nMarchers in London held signs reading 'Free Palestine' and 'Stop the genocide'\nThousands of protesters walked through Trafalgar Square on Saturday\nThousands of protestors and counter-protesters have been seen in the capital in previous weekends\nA grey day in London didn't dampen the spirits of thousands of people in the capital\nProtesters in Trafalgar Square during a pro-Palestine march, organised by the Palestine Solidarity Campaign, in central London\nPeople were seen holding balloons which were later released during the protest\nPro-Palestinian protesters march from Bank of England to Parliament Square as flags are flown in solidarity\nOne demonstrator denied that any of the signs or behaviour of protestors had been offensive, saying: 'There's been nothing offensive today. I don't accept there has been anything offensive'.\nA booklet which previously heaped praise on terror organisation Hamas and branded them a 'resistant movement' was on sale without its pages on Hamas for the first time since the protests began.\nIt previously said it showed 'unconditional' support for Hamas, said it won 'wide popularity' among Palestinians and went on to say: 'We consider Hamas to be a resistance.'\nThe new version sees the pages that had praised Hamas removed.\nIt comes after the UK chose to abstain on a United Nations Security Council resolution demanding an immediate humanitarian ceasefire in Gaza - a motion that was vetoed by the US.\nEarlier this week, pro-Palestine protesters were filmed chanting 'from the river to the sea' while disrupting an exclusive Chanel fashion show in Manchester that police had banned local people from watching from their balconies.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Met police appeal for information after woman is seen at Pro Palestine march in London holding 'spot the difference' sign comparing pictures of IDF's actions in Gaza to Nazi Holocaust - as footage sho", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12845923/Met-police-appeal-information-woman-seen-London-holding-spot-difference-sign-comparing-pictures-IDFs-actions-Gaza-Nazi-Holocaust-footage-shows-protesters-chanting-victory-intifada.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}