{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:29:12", "date_modify": "None", "date_publish": "2023-12-09 18:15:24", "description": "Civilian proportion of deaths is higher than the average in all world conflicts in second half of 20th century, data suggests", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F09%2Fcivilian-toll-israeli-airstrikes-gaza-unprecedented-killing-study.json", "image_url": "https://i.guim.co.uk/img/media/ada063a95aea9eb7b546e91fdae8cfd3186b13c3/0_36_5187_3113/master/5187.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e21b13d8a920954b373f78e7661c9c7d", "language": "en", "localpath": null, "maintext": "The aerial bombing campaign by Israel in Gaza is the most indiscriminate in terms of civilian casualties in recent years, a study published by an Israeli newspaper has found.\nThe analysis in Haaretz came as Israeli forces fought to consolidate their control of northern Gaza on Saturday, bombing the Shejaiya district of Gaza City, while also conducting airstrikes on Rafah, a town on the southern border with Egypt where the Israeli army has told people in Gaza to take shelter.\nThe full death toll from the past 24 hours was unclear but the main hospital in central Gaza, at Deir al-Balah, reported it received 71 bodies, and 62 bodies were taken to Nasser hospital in the main southern city of Khan Younis, according to the Hamas-run health ministry.\n00:01:03 Israeli strike on Gaza's southern city of Khan Younis kills six people – video\nHaaretz published an analysis by Yagil Levy, a sociology professor at the Open University of Israel, which found that in three earlier campaigns in Gaza, in the period from 2012-22, the ratio of civilian deaths to the total of those killed in airstrikes hovered at about 40%. That ratio declined to 33% in a bombing campaign earlier this year, called Operation Shield and Arrow.\nIn the first three weeks of the current operation, Swords of Iron, the civilian proportion of total deaths rose to 61%, in what Levy described as “unprecedented killing” for Israeli forces in Gaza. The ratio is significantly higher than the average civilian toll in all the conflicts around the world from the second world war to the 1990s, in which civilians accounted for about half the dead, according to Levy.\n“The broad conclusion is that extensive killing of civilians not only contributes nothing to Israel’s security, but that it also contains the foundations for further undermining it,” Levy concluded. “The Gazans who will emerge from the ruins of their homes and the loss of their families will seek revenge that no security arrangements will be able to withstand.”\nThe study confirms an investigation 10 days ago by the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call, which found Israel was deliberately targeting residential blocks to cause mass civilian casualties in the hope people would turn on their Hamas rulers. The figures will make uneasy reading for the Biden administration, which is facing global criticism and isolation for vetoing a UN security council vote for a ceasefire on Friday.\nSince the start of the war, triggered by the deadly 7 October attack on Israel by Hamas, the US has been seeking to persuade Israeli forces to be more discriminating in choosing targets, and has repeatedly claimed the Israel Defense Forces (IDF) are “receptive” to US advice, despite the consistently high civilian death toll.\nThe US national security spokesperson, John Kirby, repeated that claim while briefing reporters on Air Force One on Friday, but added: “We certainly all recognise more can be done to try to reduce civilian casualties, and we’re going to keep working with our Israeli counterparts to that end.”\nKirby was speaking as the Biden administration faced allegations of abetting war crimes for vetoing the security council resolution.\nHuman Rights Watch said the US risked “complicity in war crimes” by continuing to provide Israel with weapons and diplomatic support. Paul O’Brien, the executive director of Amnesty International USA, said: “With this veto, the US government is shamefully turning its back on immense civilian suffering, a staggering death toll, and unprecedented humanitarian catastrophe in Gaza.”\nThe Saudi foreign minister, Faisal bin Farhan Al Saud, met the US secretary of state, Antony Blinken, in Washington on Friday night to maintain pressure for “urgent steps” to establish a ceasefire so humanitarian aid could be delivered.\nIn the face of global criticism, US officials stressed the role the US has played in pushing for humanitarian deliveries to Gaza through the Rafah crossing point. Kirby said a US military transport plane had landed in Egypt on Friday carrying nearly 26,000kg (57,000lbs) of food, water, and medicine bound for Gaza.\n“We’re certainly mindful of the suffering of the people of Gaza, and we’re doing everything we can to not just get stuff in there but to lead an actual international effort to get stuff in there,” he said.\nKirby said fewer than 100 trucks had crossed through the Rafah gate on Friday, about half the daily volume that entered Gaza during a week-long humanitarian ceasefire at the end of last month.\n“Obviously that’s not at the level that we want it to be at,” he said, noting that Israel was preparing to open an additional inspection facility at Kerem Shalom on the Israel-Gaza border, which is expected to ease the most significant bottleneck, inspection capacity.\nHowever, the UN and other aid agencies say that even when trucks enter the Gaza Strip at Rafah, the ground offensive in southern Gaza and the general lack of security is preventing the supplies from being distributed, at a time of a high and rising threat of starvation and disease.\nThe IDF said it had failed in a hostage rescue attempt on Friday. The chief spokesperson, R Adm Daniel Hagari, said: “The forces raided a Hamas site and eliminated terrorists who had taken part in the abduction and captivity of hostages.”\nHe said two Israeli soldiers had been seriously wounded in the mission, and no hostages had been rescued. He did not confirm Hamas claims that one hostage, 25-year-old Sahar Baruch, had been killed in the rescue attempt, but his home kibbutz at Be’eri announced Baruch had died.", "source_domain": "www.theguardian.com", "text": null, "title": "Civilians make up 61% of Gaza deaths from airstrikes, Israeli study finds", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/09/civilian-toll-israeli-airstrikes-gaza-unprecedented-killing-study"}