{"authors": ["Reged Ahmad", "Léonie Chao-Fong", "Richard Luscombe", "Rachel Hall", "Geneva Abdul"], "date_download": "2024-02-05 15:29:14", "date_modify": "None", "date_publish": "2023-12-08 03:08:06", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F07%2Fisrael-hamas-war-live-updates-hamas-leader-hiding-underground-idf-says-gaza-aid-system-collapse-news-palestine.json", "image_url": "https://i.guim.co.uk/img/media/32529e133087c8adce8364b1b621f7d5319ed592/0_558_8368_5021/master/8368.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=f630efa95b05b215d2dbba68913abd2d", "language": "en", "localpath": null, "maintext": "It’s just past 5am in Gaza and Tel Aviv and this blog is now closing. But first, here is a summary of the events so far:\nThe US secretary of state, Antony Blinken, has said there is a “gap” between Israel’s “intent to protect civilians” in Gaza and what has been happening on the ground. Blinken, speaking at a news conference in Washington after a meeting with the UK’s foreign secretary, David Cameron, said: “It remains imperative that Israel put a premium on civilian protection.”\nReuters is reporting that Israel has agreed, at the request of the US, to open the Kerem Shalom border crossing for only the screening and inspection of the humanitarian aid delivered into Gaza via the Rafah crossing, a senior US official said on Thursday. But there has been no time frame given for when the crossing might open.\nThe United Arab Emirates has asked for the UN security council to vote tomorrow on a draft resolution that demands an immediate humanitarian ceasefire in Gaza, according to diplomats. The renewed push for a ceasefire, reported by Reuters, was made after the UN secretary general, António Guterres, took the rare step of invoking article 99 of the UN charter on Wednesday to notify the security council that the crisis in Gaza represented a threat to world peace.\nThe UN aid chief, Martin Griffiths, has said there is no longer a functioning humanitarian operation in southern Gaza, saying instead that the aid that is reaching civilians in the territory is “erratic”, “undependable” and “not sustainable”. Speaking at a press briefing in Geneva on Thursday, Griffiths said the pace of the military assault in southern Gaza “is a repeat” of the assault in northern Gaza, and warned that there was nowhere safe for civilians in the southern part of the besieged territory.\nIsrael’s military has continued its heavy bombardment amid intense fighting in Gaza as its war with Hamas hit the two-month mark. The Israel Defense Forces (IDF) said they had struck about 250 targets in Gaza over a 24-hour period, ending on Thursday morning. At the northern end of the Gaza Strip, there was heavy fighting in the Jabaliya refugee camp.\nAt least 350 Palestinians have been killed in Gaza in the course of 24 hours, the territory’s Hamas-run health ministry said in its latest update on Thursday. The cumulative total is 17,177 Palestinian deaths and 46,000 injured since the war began on 7 October, according to the ministry’s tally. About 20 people were killed in airstrikes that hit two homes in the residential part of Rafah in southern Gaza, according to witnesses. Rafah, a town on the southern border with Egypt, is where the IDF has told people to relocate to avoid areas likely to be bombed.\nIsraeli forces have given contradictory recommendations to Gaza civilians on where to seek refuge and humanitarian relief. Those who have fled to an IDF-declared “humanitarian zone” at al-Mawasi in the south-west corner of the Gaza Strip have depicted a desperate scene with no shelter and barely any food. The IDF, meanwhile, has not ruled out bombing the area.\nJoe Biden spoke with Benjamin Netanyahu in a call on Thursday in which the US president “stressed that much more assistance was urgently required” across Gaza, the White House said. Biden “emphasised the critical need to protect civilians and to separate the civilian population from Hamas including through corridors that allow people to move safely from defined areas of hostilities” during his call with the Israeli prime minister, a readout of the call said.\nThe White House has said Israel and Hamas are not close to another deal on a new humanitarian pause. Discussions are happening “literally every day” on a possible new agreement, the White House’s national security council spokesperson John Kirby told reporters on Thursday. The Pentagon said the US military has resumed its flights of surveillance drones over Gaza to aid the search for hostages taken by Hamas.", "source_domain": "www.theguardian.com", "text": null, "title": "UAE asks for UN security council to vote on draft resolution demanding humanitarian ceasefire in Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/07/israel-hamas-war-live-updates-hamas-leader-hiding-underground-idf-says-gaza-aid-system-collapse-news-palestine"}