{"authors": ["Rebecca Husselbee"], "date_download": "2024-02-05 15:15:35", "date_modify": "None", "date_publish": "2024-01-26 09:50:24", "description": "THE UK Government has warned of a one in four chance that Putin could launch an attack on a British ally within the next two years.In an official risk", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25514704%2Fuk-putin-attack-brit-ally-nato-ww3%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/newspress-collage-d2sib4ocq-1706261922219.jpg?1706262015&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "THE UK Government has warned of a one in four chance that Putin could launch an attack on a British ally within the next two years.\nIn an official risk forecast, ministers revealed that the UK would be forced to trigger a military response to any new acts of aggression from the Kremlin.\n6 A risk forecast by the UK Government has warned of a one in four chance of a Russian attack on a British ally Credit: Alamy\n6 It comes as British General Sir Patrick Sanders stressed that the UK may need to consider conscripting ordinary Brits to bolster its dwindling army Credit: AFP\nThe shock stats come just days after British General Sir Patrick Sanders stressed the need to \"mobilise the nation\" sparking fears that WW3 could be on the horizon.\nWith the British Army being reduced to its smallest size for centuries, Gen Sir Patrick believes there should be a \"shift\" in the mindset of the public who should be willing to defend the UK against foreign adversaries.\nWith mounting fears of a call-up for ordinary Brits, Experts in the Cabinet Office have drawn up a National Risk Register to assess the biggest threats to the UK in the next two years.\nIt calculated that the likelihood of Russia, described throughout as an \"adversary state with a large, advanced military\", attacking a non-Nato ally was higher than 25 percent.\nCountries such as Sweden, which has now applied to join Nato, have a security pact with the UK meaning Britain would defend their ally if they came under attack from Russia.\nThe deal was signed by former prime minister Boris Johnson who said it could mean troops on the ground depending on the \"request from the other part\".\nThe risk register also warned of a Russian attack on a Nato ally which would trigger the alliance's defense clause.\nBritish troops would support European allies on the ground as the US military would also join forces.\nOfficials confirmed that to \"contain and deter further aggression, military, diplomatic, and economic capabilities will be needed.\"\nExperts predicted that in a worst-case scenario, the \"hostile state are not ejected and the crisis continues.\"\nNot only could further Russian attacks spark a draft for UK civilians, but experts also warned that an all-out war would see \"disruption to supply chains\" affecting fuel prices and the economy for \"several years\".\nThe UK economy has already been hit hard by Vlad's invasion of Ukraine in February 2022.\nDowning Street was forced to deny any suggestion of a conscription with a spokesman insisting that \"hypothetical scenarios, talking about conflict, are not helpful.\"\nFLYING VISIT\nYesterday Putin made a surprise visit to the heart of Europe in a chilling taunt to the West.\nThe dictator, 71, visited Kaliningrad, a western Russian enclave stuffed full of nuclear-capable missiles and wedged between EU countries Poland and Lithuania.\nRussia's most westerly territory of Kaliningrad is used as a headquarters for Russia's Baltic fleet and some of its most powerful armaments including hypersonic missiles.\nOn his visit, Brazen Vlad warned that countries bordering the enclave are not prepared for \"what will follow\" after tearing down Soviet war memorials.\nHe said: \"This is stunning ignorance and lack of understanding of where they live, what they are doing and what will follow.\"\nIt comes just days after a Nato chief warned Brits could face conscription as the threat of all-out war with Russia loomed.\nChief of Nato's military committee Dutch Admiral Rob Bauer called on the West to \"prepare for an era of war\", adding that Nato \"needs a warfighting transformation\".\nDuring a crunch summit between Nato defence chiefs in Brussels, Bauer said: \"We need to be readier across the whole spectrum.\n\"You have to have a system in place to find more people if it comes to war, whether it does or not. Then you talk mobilisation, reservists or conscription.\n\"We have to realise it’s not a given that we are in peace. And that’s why we [Nato forces] are preparing for a conflict with Russia.\"\nGen Sir Patrick made his plea to ordinary Britons at the International Armoured Vehicles Conference in Twickenham.\nHe said: \"Our friends in Eastern and Northern Europe, who feel the proximity of the Russian threat more acutely, are already acting prudently, laying the foundations for national mobilisation.\n\"We will not be immune and as the pre-war generation we must similarly prepare - and that is a whole-of-nation undertaking.\n\"Ukraine brutally illustrates that regular armies start wars; citizen armies win them.\n\"Our predecessors failed to perceive the implications of the so-called July Crisis in 1914 and stumbled into the most ghastly of wars. We cannot afford to make the same mistake today.\"\nThe introduction of conscription were it to happen, would be the first time in over 60 years that Brits would be required to fight.\nMandatory military service was introduced during the First World War after the government passed the Military Service Act in 1916.\n6 Putin made a surprise to the Immanuel Kant Baltic Federal University in the city of Kaliningrad in a chilling taunt to the West Credit: Reuters\n6 Military Committee Chief Rob Bauer said the West should be better prepared for a war with Russia Credit: Getty\n6 Chief of the General Staff, Sir Patrick Sanders, said Britain faces its “1937 moment” and must be prepared to act rapidly to prevent the spread of war Credit: PA", "source_domain": "www.thesun.co.uk", "text": null, "title": "UK reveals chilling likelihood Putin will launch ATTACK on Brit ally while Nato chief warns West 'must be ready' for WW3", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25514704/uk-putin-attack-brit-ally-nato-ww3/"}