{"authors": [], "date_download": "2024-02-05 15:29:16", "date_modify": "None", "date_publish": "2023-12-08 01:56:28", "description": "It’s called “Article 99.”", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fantonio-guterres-ap-security-council-gaza-israeli-b2460569.html.json", "image_url": "https://static.independent.co.uk/2023/12/08/01/COP28_Climate_Summit_77180.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIt's called “Article 99.” And it hasn't been used for decades. Until this week.\nWith an intensifying Israeli offensive and escalating civilian casualties, U.N. Secretary-General Antonio Guterres invoked a rarely exercised power this week to warn the Security Council of an impending “humanitarian catastrophe” in Gaza. He urged members to demand an immediate humanitarian cease-fire.\nGuterres invoked Article 99 of the U.N. Charter — last used over half a century ago — which says the secretary-general may inform the council of matters he believes threaten international peace and security.\nHere, Edith M. Lederer, longtime chief U.N. correspondent for The Associated Press, breaks down what this could mean.\nWHAT IS ARTICLE 99 AND WHY IS GUTERRES INVOKING IT?\nIt's a provision of the United Nations Charter, the U.N. constitution. It states that the secretary-general — the U.N.'s top diplomat — may bring to the attention of the Security Council “any matter which, in his opinion, may threaten the maintenance of international peace and security.”\nThis gives an important additional power to the secretary general, since the real power at the U.N. is held by its 193 member nations and especially the 15 countries that serve on the Security Council.\nArticle 99 is extremely rarely used. The last time it was invoked was during fighting in 1971 that led to the creation of Bangladesh and its separation from Pakistan.\nGuterres invoked Article 99 because he sees the situation in Gaza at risk of a “complete collapse” of the territory's humanitarian system and civil order. It was something he felt needed to be done.\nHOW LIKELY IS THIS TO HAVE AN EFFECT, GIVEN THE U.S. VETO POWER?\nArab and Islamic nations followed up on Guterres's letter immediately.\nThe United Arab Emirates, the Arab representative on the Security Council, circulated a short resolution to Security Council members late Wednesday calling for an immediate humanitarian ceasefire. They plan to put that resolution to a vote at a Security Council meeting on Friday morning.\nThe United States, which is Israel’s closest ally and has veto power on resolutions, has not supported a cease-fire. On Tuesday, U.S. Deputy Ambassador Robert Wood said that the role of the Security Council in the Israel-Gaza war is not to get in the way of important diplomacy that’s taking place. And he said the Security Council resolution at this time \"would not be useful.\"\nThis could signal a likely veto, but the U.S. has not said either way.\nIN THAT CASE, WHY INVOKE IT?\nBecause Guterres believes that the humanitarian system and the humanitarian operations in Gaza are collapsing.\nHe also warns in his letter that in the current situation, “amid constant bombardment by the Israeli Defense Forces and without shelter or essentials to survive, I expect public order to completely break down soon due to the desperate conditions, rendering even limited humanitarian assistance impossible.”\nGuterres said the situation could get even worse, pointing to possible epidemics and the mass displacement of Palestinians into neighboring countries. He sees a looming disaster.\nPrevious secretaries-general have brought threats that they saw to international peace and security to the Security Council without mentioning Article 99. This includes Congo in 1960, the U.S. hostage crisis in Iran that began in November 1979, the Iran-Iraq war in 1980 and more recently Myanmar in 2017.\nWe don't know why they didn't invoke Article 99, and several of the previous secretaries-general are now dead. Guterres has been very outspoken on both the Hamas attacks on Israel and the very high death toll of Palestinian civilians in Gaza.", "source_domain": "www.independent.co.uk", "text": null, "title": "The UN secretary-general invoked 'Article 99' to push for a Gaza ceasefire. What exactly is it?", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/antonio-guterres-ap-security-council-gaza-israeli-b2460569.html"}