{"authors": [], "date_download": "2024-02-05 15:29:17", "date_modify": "None", "date_publish": "2023-12-08 04:41:12", "description": "In some of the strongest criticism of Israel’s conduct in its war with Hamas, Antony Blinken says Israel must put a ‘premium on civilian protection’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F08%2Fus-israel-hamas-war-gaza-civilian-protection-anthony-blinken.json", "image_url": "https://i.guim.co.uk/img/media/7a6fcd95922382ff42e0703f034e797a47e5f8de/0_384_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=01ac0582e09b0fbaf40bb97ca718c205", "language": "en", "localpath": null, "maintext": "The US has issued some of its strongest criticism of Israel’s conduct in the war against Hamas, as growing pressure to speed up the delivery of humanitarian supplies into Gaza has resulted in the government of Benjamin Netanyahu saying that another crossing would be opened into the territory.\nUS secretary of state Antony Blinken said there was a gap between the Israeli government’s declared intentions to protect civilians and the mounting casualties seen on the ground.\n“As we stand here almost a week into this campaign into the south … it remains imperative that Israel put a premium on civilian protection,” Blinken said at a press conference after a meeting with British foreign secretary David Cameron in Washington.\n“And there does remain a gap between ... the intent to protect civilians and the actual results that we’re seeing on the ground,” Blinken said.\nMore than 17,000 people have been killed in Gaza, according to the Hamas-run health ministry, since 7 October when Israel began bombarding the territory in response to a cross-border rampage by Hamas militants who control the enclave.\nIsrael says it intends to wipe out Hamas but is doing everything possible to get civilians out of harm’s way, including warnings about military operations.\nIn a phone call with Netanyahu on Thursday, US president Joe Biden “emphasised the critical need to protect civilians and to separate the civilian population from Hamas”, the White House said in a statement.\nDespite the warnings, hundreds more Palestinians were killed on Thursday according to the Hamas health ministry, and Israel pressed on with its offensive in and around Gaza’s main cities.\nEarly Friday, the health ministry reported another 40 dead in strikes near Gaza City, and “dozens” more in Jabalia and Khan Yunis.\nIsrael’s military has continued its heavy bombardment amid intense fighting in Gaza as its war with Hamas hit the two-month mark and the resulting humanitarian crisis threatened a breakdown of public order.\nView image in fullscreen Antony Blinken holds a press conference with UK foreign secretary David Cameron. Photograph: Jim Lo Scalzo/EPA\nThe Israel Defense Forces (IDF) said they had struck about 250 targets in Gaza over a 24-hour period, ending on Thursday morning.\nAbout 1.87 million people in Gaza – more than 80% of the population of 2.3 million – have fled their homes in the past two months, according to the UN. Many families have been displaced multiple times, and are living in tents and overcrowded makeshift shelters.\nThe mass civilian casualties in the conflict have sparked global concern, heightened by dire shortages caused by an Israeli siege that has seen only limited access for food, water, fuel and medicines in Gaza.\n00:01:45 Palestinians suffer cold with lack of shelter and barely any food in Gaza 'safe zone' – video\nOn Thursday, Israel agreed at the request of the United States to open the Kerem Shalom border crossing in southern Gaza for the screening and inspection of trucks and their cargo, for the first time since the outbreak of the war.\nIf that were to happen, UN aid chief Martin Griffith said it would represent a major boost for humanitarian operations. “It would be the first miracle we’ve seen for some weeks, but would also be a huge boost to the logistical process and logistical base of a humanitarian operation,” he said.\nEgypt, along with the United Nations, has been lobbying Israel to speed up an inspection process, which requires the vehicles to drive to Egypt’s border with Israel before looping back to Rafah. The number of trucks crossing daily has dropped to fewer than 100, from nearly 200 during the short-lived truce, according to the United Nations.\nCol Elad Goren, from Israel’s Cogat military liaison to the Palestinians, did not give a date for the opening of the crossing, and said the crossing point would be used to increase the capacity to inspect aid trucks, but not to allow aid into Gaza directly.\nThe White House said that Biden called for more assistance for civilians in Gaza in his call with Netanyahu on Thursday.\nThe US president added that “much more assistance was urgently required across the board”.\nOn Friday, the UN Security Council will meet to vote on urging an immediate ceasefire.\nReuters and Agence France-Presse contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "US highlights ‘gap’ in Israel’s commitment to protect civilians in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/08/us-israel-hamas-war-gaza-civilian-protection-anthony-blinken"}