{"authors": ["Source"], "date_download": "2024-02-05 15:29:18", "date_modify": "None", "date_publish": "2023-12-08 00:47:48", "description": "Those who have fled to ‘humanitarian zone’ in south-west Gaza bemoan total lack of shelter and barely any food", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Fvideo%2F2023%2Fdec%2F08%2Fpalestinians-suffer-cold-with-lack-of-shelter-and-barely-any-food-in-gaza-safe-zone-video.json", "image_url": "https://i.guim.co.uk/img/media/1e71004c86571d9451ce8563a697c9fc623665d9/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=64fc0738968f190748c6d0445f4b0b4a", "language": "en", "localpath": null, "maintext": "Many Palestinian civilians have fled to al-Mawasi, in Gaza's south-west to be greeted by few to no services, food or water and freezing temperatures.\nThe Israeli Defense Forces (IDF) declared al-Mawasi, a Bedouin settlement on sand dunes, a \"safe zone\" but has not ruled out bombing the area, claiming that rockets were fired from there, most recently on Wednesday.\nThe IDF has been inconsistent in recommending al-Mawasi as a safe space in their recent maps and instructions that show Gaza divided into 623 numbered districts, with orange arrows showing how civilians should move from one district to another to avoid planned IDF military operations.\nTo the east, in Khan Younis, fighting has intensified and an Israeli airstrike is said to have hit a residential block on Thursday with dozens of people believed to be trapped underneath the rubble. There was no immediate confirmation on the number of casualties", "source_domain": "www.theguardian.com", "text": null, "title": "Palestinians suffer cold with lack of shelter and barely any food in Gaza 'safe zone' - video", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/video/2023/dec/08/palestinians-suffer-cold-with-lack-of-shelter-and-barely-any-food-in-gaza-safe-zone-video"}