{"authors": ["Jason Wilson"], "date_download": "2024-02-05 15:29:19", "date_modify": "None", "date_publish": "2023-12-08 12:00:49", "description": "Analysis of BlueLeaks trove also shows police received training on domestic ‘Muslim extremists’ from pro-Israel groups", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F08%2Fus-police-agencies-idf-files-blueleaks.json", "image_url": "https://i.guim.co.uk/img/media/c0c97440ee3556d149b48f2dc45bcf7110f8f2e8/0_63_1849_1110/master/1849.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3379d42fbcfaa1aae1a704670489a831", "language": "en", "localpath": null, "maintext": "Hacked police files show US law enforcement agencies for decades received analysis of incidents in the Israel-Palestine conflict directly from the Israeli Defense Forces and Israeli thinktanks, training on domestic “Muslim extremists” from pro-Israel non-profits, and surveilled social media accounts of pro-Palestine activists in the US.\nThe Guardian’s analysis of documents from the BlueLeaks trove of internal law enforcement documents found no indication that this was balanced by information from other Middle Eastern sources or US Muslim community groups. Nor is there any indication that pro-Israel activists were subject to any specific scrutiny.\nAt a time of polarized reactions to the Israel-Hamas war in Gaza, the analysis raises questions about the scope of police intelligence-gathering in the US and the influence of Israel and its supporters on those efforts, and how this has shaped the treatment of activists and social movements, especially those who are pro-Palestinian.\nMike German, a fellow at the Brennan Center for Justice, former FBI undercover agent and author of Disrupt, Discredit, and Divide: How the New FBI Damages Democracy, said the use of such documents and receipt of such training was damaging the practice of good law enforcement.\n“It’s frustrating that we’ve developed this national law enforcement intelligence-sharing network that basically takes disinformation straight from the rightwing social media fever swamps and puts it out under the imprimatur of law enforcement intelligence, so it becomes an amplifier of disinformation rather than a corrective to that disinformation,” German said.\nThe BlueLeaks trove was obtained and released by self-described hacktivists in June 2020. It contains material from more than 200 law enforcement agencies, including intelligence material disseminated by federally sponsored umbrella bodies such as fusion centers and high-intensity drug-trafficking area (Hidta) programs.\nOne body whose internal archives were exposed in the hack, LA Clear, is tasked with providing “analytical and case support” in narcotics investigations in southern California, according to its website. It was established as a joint project between the Los Angeles County Police Chiefs Association, the California department of justice, and the Los Angeles county sheriff’s department in 1992.\nDespite its ostensible mission to combat drug trafficking, the LA Clear archive of training materials (labeled “lacleartraining”) included in the BlueLeaks trove has several analyses of previous episodes of widespread conflict in Gaza and the West Bank that are sourced directly from the IDF and closely aligned Israeli thinktanks.\nOne of the documents is a reproduction of a PowerPoint-style presentation dated 11 April 2011, badged with the insignia and name of the Strategic Division of the IDF, and entitled “Escalation in the Gaza Strip”.\nThe presentation is marked “for official use only”, a US government designation for documents which are not for public release.\nThe document asserts that “there has recently been a sharp increase in terrorist attacks emanating from the Gaza Strip intentionally directed at Israeli civilians in southern Israel”. The presentation offers evidence including Israeli counts of rocket attacks from Hamas, the Sha’ar HaNegev school bus attack and the killing of a family in “the Jewish community of Itamar” on 11 March 2011. (Later in 2011, two cousins from the nearby Palestinian village of Awarta were convicted of the murders and sentenced to multiple consecutive life sentences.)\nThe document does not present the long history of conflict between residents of Itamar, which the international community considers an illegal West Bank settlement, and neighboring villages. In 2010, a Human Rights Watch report singled out Itamar’s settlers with allegations of land theft, raids on Palestinian villages and extrajudicial killings.\nElsewhere in LA Clear’s training materials is another PowerPoint-style presentation authored by the Dado Center, a military studies department of the IDF. The presentation offers a retrospective analysis of “Operation Cast Lead”, the IDF’s name for the 22-day military assault on the Gaza Strip that commenced on 27 December 2008.\nThat document is labeled “FOUO”, an abbreviation of “for official use only” and appears to be a cursory visual aid for a spoken presentation. It points to “unique geo-strategic conditions (Gaza encircled by Egypt and Israel)”; “unique operational conditions (air supremacy, intelligence superiority)”; and “unique adversary (multiple identities, limited capabilities)”.\nThe presentation, which only includes the IDF’s perspective, also highlights challenges including “legitimacy (external & internal, strategic narrative)” and “media coverage (a controlled information environment)”.\nAmnesty International alleged in a 2009 report that during Operation Cast Lead, the IDF targeted civilians, carried out “indiscriminate attacks that failed to distinguish between legitimate military targets and civilian objects”, and used munitions containing white phosphorus, the use of which against civilians is a violation of international law, according to the World Health Organization.\nAnother document in the trove is a longer 2011 report assessing “terrorism from the Gaza Strip since Operation Cast Lead” produced by the Meir Amit Intelligence and Terrorism Information Center (ITIC). The ITIC is an Israeli research group whose founding director and current director were previously IDF intelligence officers. The thinktank reportedly maintains an office at the Israeli defense ministry.\nNone of these documents mention narcotics trafficking or criminal activity in the US. LA Clear’s archive and the BlueLeaks trove do not appear to contain any alternative accounts of the Israel-Palestine conflict.\nThe Guardian contacted LA Clear for comment through the body’s website but received no response.\nElsewhere in the BlueLeaks trove, there is ample evidence of a close relationship between law enforcement agencies and US-based pro-Israel organizations.\nThe archive shows how close the relationship is between a range of law enforcement agencies and the pro-Israel civil rights non-profit the Anti-Defamation League (ADL).\nView image in fullscreen An official watches security cameras at the Southern Nevada Counter Terrorism Center in Las Vegas, Nevada, on 23 May 2017. Photograph: John Locher/AP\nEmails preserved in BlueLeaks show various agencies promoting ADL training sessions for law enforcement officers, including a January 2013 session on “screening of persons by observational techniques” and a seminar at the Southern Nevada Counter Terrorism Center on the “evolving nature of Islamic extremists”.\nADL staff are shown as registered attendees at events run by fusion centers, offering bios that advise the organization that “we facilitate workshops for law enforcement on extremism, hate crime and (in Washington DC and Israel) counter-terrorism”.\nThe ADL, whose website banner heading at the time of reporting read “We stand with Israel”, is one of very few community organizations who train or are consulted by law enforcement officers. They are frequently cited throughout BlueLeaks as an authority on extremism and terrorism.\nThe Guardian contacted the ADL for comment but received no response.\nThere is no evidence in BlueLeaks that Muslim community groups such as the Council for American-Islamic Relations (Cair) are consulted on issues involving Muslims; Cair is barely mentioned outside a series of four newsletters from the Omaha Terrorism Early Warning Group describing it as “unindicted co-conspirators in the Holy Land terror funding trial”.\nIn 2007, Cair was named alongside other organizations as an unindicted co-conspirator in an FBI indictment concerning a land trust it alleged was funding Hamas. In 2010, a federal judge found that the agency had violated the organization’s rights, though there was evidence connecting the groups to the trust. A 2013 Office of the Inspector General report found “significant issues with the way the FBI implemented and managed its Cair policy and guidance” in connection with the case.\nThere are indications that this emphasis shaped investigations: in at least two instances, the National Criminal Intelligence Resource Center archived social media feeds of Palestinian American pro-Palestine activists. The feeds indicated no apparent wrongdoing.\nThe Guardian previously reported revelations from the trove including that Google was passing user data directly to law enforcement authorities; that law enforcement officials baselessly linked “antifa” activists to arson attacks; that officials were characterizing the Proud Boys as an extremist group in private long before the events of 6 January 2021; and the private firms profiting from police militarization.\nOn the scope of the latest revelations, German said: “At a time where there’s much more public sensitivity to foreign influence in domestic affairs, having a foreign country’s security services aligned with the beat cop on the streets of American neighborhoods is concerning.”", "source_domain": "www.theguardian.com", "text": null, "title": "US police agencies took intelligence directly from IDF, leaked files show", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/08/us-police-agencies-idf-files-blueleaks"}