{"authors": [], "date_download": "2024-02-05 15:29:21", "date_modify": "None", "date_publish": "2023-12-08 10:58:01", "description": "U.S. and Iraqi officials say a rocket attack at the sprawling U.S. Embassy in Baghdad has caused minor damage but no casualties", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-iran-us-embassy-syria-baghdad-b2460766.html.json", "image_url": "https://static.independent.co.uk/2023/12/08/11/Iraq_US_68559.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA rocket attack on the sprawling U.S. Embassy in Baghdad caused minor damage but no casualties Friday morning, U.S. and Iraqi officials said.\nThe attack is the first on the embassy located in the heavily fortified Green Zone of Iraq's capital to be confirmed since the beginning of the Israel-Hamas war. The Green Zone houses Iraqi government buildings and embassies on the west bank of the Tigris River.\nIran-backed militias in Iraq have claimed responsibility for dozens of attacks that targeted bases housing U.S. troops in Iraq and Syria since Israel declared war on Hamas two months ago. The U.S. military says 78 attacks have been carried out against U.S. facilities over the past weeks, of which 37 were in Iraq and 41 in Syria.\nAn Iraqi security official said 14 Katyusha rockets were fired Friday, of which some struck near one of the U.S. Embassy’s gates while others fell in the river. The official said the rocket attack caused material damage but no casualties.\nA U.S. military official said a multi-rocket attack was launched at American and coalition forces in the vicinity of the embassy complex and the Union III base, which houses offices of the U.S.-led coalition. The official added that no casualties and no damage to infrastructure were reported.\nAn embassy spokesperson said the U.S. Embassy was attacked by two salvos of rockets at approximately 4:15 a.m. (0215 GMT).\n“Assessments are ongoing, but there are no reported casualties on the embassy compound,” the official said, adding that no specific group had claimed responsibility for firing the rockets as of Friday morning but early indications pointed to Iran-aligned militias.\n“We again call on the government of Iraq, as we have done on many occasions, to do all in its power to protect diplomatic and Coalition partner personnel and facilities,” the official said. “We reiterate that we reserve the right to self-defense and to protect our personnel anywhere in the world.”\nThe three officials spoke on condition of anonymity in line with regulations.\nIraqi Prime Minister Mohammed Shia al-Sudani said in a statement that “targeting diplomatic missions is something that cannot be justified.\" He called the attack an “insult to Iraq, its stability and security,” and promised to “pursue the perpetratrors of the attack ...and bring them to justice.”\nSudani came to power with the support of a coalition of Iran-backed parties. But he also wants continued good relations with the U.S. and has backed the ongoing presence of American troops in his country.\nWhile no group claimed responsibility for the embassy attack, the Islamic Resistance in Iraq, an umbrella group of Iran-backed militias, issued statements claiming separate attacks Friday on the al-Asad airbase in western Iraq, which is used by U.S. forces, and on a base located at the Conoco gas field in eastern Syria.\nThere are roughly 2,500 U.S. troops in Iraq and around 900 others in eastern Syria, on missions against the Islamic State group. In both countries, Iran has militias loyal to Tehran.\nIn response to attacks against American troops, the U.S. has retaliated with airstrikes three times in Syria since Oct. 17, targeting weapons depots and other facilities linked directly to Iran’s Revolutionary Guard Corps and the militias. The U.S. also struck multiple sites in Iraq late last month after a militia group for the first time fired short-range ballistic missiles at U.S. forces at al Asad air base.\n_____\nAssociated Press writers Abby Sewell and Bassem Mroue contributed to this report from Beirut.", "source_domain": "www.independent.co.uk", "text": null, "title": "A rocket attack targets the US Embassy in Baghdad, causing minor damage but no casualties", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-iran-us-embassy-syria-baghdad-b2460766.html"}