{"authors": [], "date_download": "2024-02-05 15:29:23", "date_modify": "None", "date_publish": "2023-12-08 05:09:41", "description": "Taiwan's Defense Ministry says a Chinese military surveillance balloon has been spotted in the Taiwan Strait, along with a large-scale dispatch of military aircraft and ships", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Ftaiwan-strait-ap-chinese-taipei-china-b2460607.html.json", "image_url": "https://static.independent.co.uk/2023/12/08/05/Taiwan_China_Balloon_50965.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nTaiwan’s Defense Ministry says a Chinese military surveillance balloon was spotted in the Taiwan Strait, as well as a large-scale dispatch of military aircraft and ships.\nThe ministry said the balloon passed southwest of the northern port city of Keelung on Thursday night, then continued east before disappearing, possibly into the Pacific Ocean.\nTaiwan has threatened to shoot down such balloons, but the ministry did not say what, if any, action was taken. It said the balloon was monitored flying at an altitude of approximately 6,400 meters (21,000 feet).\nIt also said 26 Chinese military aircraft were detected, along with 10 Chinese navy ships, in the 24 hours before 6 a.m. Friday. Of the aircraft, 15 had crossed the median line that is an unofficial divider between the sides, but which Beijing refuses to recognize. Some also entered Taiwan's air defense identification zone outside the island's airspace.\nTaiwan’s military monitored the situation with combat aircraft, navy vessels and land-based missile systems, the ministry said.\nSuch incursions occur regularly as a means of advertising China’s threat to use force to annex the self-governing island republic it considers its own territory, wear down Taiwan’s military capabilities, and impact morale among the armed forces and the public, who remain largely ambivalent to China’s actions.\nThe Chinese missions have also prompted Taiwan to up its purchases of aircraft from the United States, its chief ally, and revitalize its own defense industry, including producing submarines.\nBeijing strongly protests all contacts between the island and the U.S., but its aggressive diplomacy has helped build strong bipartisan support for Taipei on Capitol Hill.\nU.S. President Joe Biden vowed sharper rules to track, monitor and potentially shoot down unknown aerial objects after three weeks of high-stakes drama sparked by the discovery of a suspected Chinese spy balloon transiting much of the country early in the year.", "source_domain": "www.independent.co.uk", "text": null, "title": "A Chinese military surveillance balloon is spotted in Taiwan Strait, island's Defense Ministry says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/taiwan-strait-ap-chinese-taipei-china-b2460607.html"}