{"authors": ["Andy Jehring", "Andy Jehring In Tel Aviv"], "date_download": "2024-02-05 15:29:26", "date_modify": "None", "date_publish": "2023-12-08 22:03:52", "description": "Israel is facing growing resistance from Hamas as the fighting rages from house to house and 'tunnel shaft to shaft' through Gaza City.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12843617%2FIsrael-growing-resistance-Hamas-fighting-Gaza-City.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/08/22/78754787-0-image-a-45_1702072993475.jpg", "language": "en", "localpath": null, "maintext": "Israel is facing growing resistance from Hamas as the fighting rages from house to house and 'tunnel shaft to shaft' through Gaza City.\nThe Israel Defence Forces pounded the length of the strip today as it stepped up its strikes, hitting more than 450 targets.\nRefugees who fled the north at the start of the conflict have now been left with no place to go as operations were launched in the south.\nAid agencies warned society in Gaza was 'on the verge of a full-blown collapse' ahead of a UN Security Council vote on a ceasefire today.\nDespite the impending vote, Israel ploughed ahead with the most strikes it has carried out since the truce collapsed last week.\nBEIT LAHIA: Israeli forces resumed military strikes on Gaza after a week-long truce\nBEIT LAHIA: The Israel Defence Forces pounded the length of the strip today\nAid agencies warned society in Gaza was 'on the verge of a full-blown collapse' ahead of a UN Security Council vote on a ceasefire today (pictured)\nIsraeli commander Brigadier General Dan Goldfuss said his forces were fighting house to house and 'shaft to shaft' in Khan Younis.\nREAD MORE - Outrage after Australia abstains from United Nations vote calling for ceasefire between Israel and Hamas Advertisement\nThe southern town has seen some of the most severe fighting, with reports that its main hospital is overrun with the dead and wounded.\nPatients were left sprawled across the blood-smeared tiled floor of the Nasser medical centre today.\nIt comes as the Red Cross was criticised for allegedly telling the family of an Israeli hostage to 'think about the Palestinian side'.\nRoni and Simons Steinbrecher – whose daughter Doron, 30, is held by Hamas – have been trying to get vital medication to her through the charity. But they claim representatives called them in for a meeting where they reprimanded them.\nMs Steinbrecher claims they told her: 'Think about the Palestinian side. It's hard for the Palestinians, they're being bombed.'\nThe Hamas-run health ministry in Gaza claimed that another 350 were killed on Thursday, bringing the total death toll to 17,478.\nIsrael's military said 94 Israeli soldiers had been killed in Gaza since its ground invasion began.\nBEIT LAHIA: More than 16,200 Palestinians and at least 1,200 Israelis have been killed, according to the Palestinian Health Ministry and the Israel Defense Forces\nU.S. Secretary of State Antony Blinken urged Israel to protect Gaza's civilians\nPhilippe Lazzarini, commissioner-general of the UNRWAsaid 'stop the carnage'\nPeople demonstrate to express solidarity with Palestinians in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas. Pictured on December 8\nUS Secretary of State Antony Blinken – who met Arab leaders today – urged Israel to protect Gaza's civilians. He said there remained a 'gap' between 'the intent to protect civilians and the results we're seeing on the ground'.\nToday's UN Security Council voted on a demand for a humanitarian ceasefire failed to pass after the US vetoed it.\nThe US representative blasted the resolution as 'imbalanced' and 'divorced from reality'.\nREAD MORE - UN passes resolution demanding an immediate ceasefire in Gaza - as Israel launches 'unprecedented' air assault against Hamas Advertisement\nThe UK abstained from the vote, while the remaining 13 other members of the council voted for it.\nThe UN agency for Palestinian refugees (UNRWA) said: 'We are reaching a point of no return in Gaza where the blatant disregard for international humanitarian law scars our collective conscience'.\nPhilippe Lazzarini, commissioner-general of the UNRWA, said: 'States must find the political will to end this tragedy. Failing to act now and stop the carnage will forever stain our credibility as representatives of the international community, and fuel endless cycles of violence that will eventually engulf us all.'\nThe agency says 133 of its workers have been killed since October 7 with 1.9million people displaced.\nBut US deputy ambassador Robert Wood stood by Israel as he indicated his country would veto the UN Security Council 'ceasefire' resolution.\nHe said America did not believe that an immediate ceasefire would lead to 'durable peace, in which both Israelis and Palestinians can live in peace and security' because Hamas would remain in charge.\nA halt to military action would only 'plant the seeds for the next war' he said, 'because Hamas has no desire to see a durable peace, to see a two-state solution'.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel faces growing resistance from Hamas as the fighting rages from house to house and 'tunnel shaft to shaft' throughout Gaza City", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12843617/Israel-growing-resistance-Hamas-fighting-Gaza-City.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}