{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:29:29", "date_modify": "None", "date_publish": "2023-12-08 21:47:08", "description": "US vetoes resolution despite pleas from secretary general and Arab allies, saying ceasefire ‘would only plant the seeds of the next war’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F08%2Fus-to-oppose-arab-backed-resolution-calling-for-urgent-gaza-ceasefire.json", "image_url": "https://i.guim.co.uk/img/media/90e5fd2b6631b7b94d0a416151b9415c2f5aba38/0_0_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=39f440374c375933c2f7fb4e750ab705", "language": "en", "localpath": null, "maintext": "The US has defied appeals from its Arab allies and the UN secretary general to back an immediate humanitarian ceasefire in Gaza, telling the security council that to do so would merely plant the seeds of the next war.\nThe US vetoed a United Nations resolution calling for a ceasefire late on Friday, despite a dramatic warning from António Guterres that civil order was breaking down and the risk of a mass exodus into Egypt growing, with as yet unclear consequences for the rest of the region. The vote in the 15-member council was 13-1 with the UK abstaining.\nRobert Wood, who represented the US at the security council, said the US would not give up on its aim of removing Hamas, explaining America wanted “to break the cycle of unceasing violence so that history does not keep repeating itself”. He said a ceasefire now “would only plant the seeds for the next war because Hamas has no desire to see a durable peace. Our goal should not be to stop the war for today but to stop the war for ever”.\nThe US veto came late on one of the more dramatic days at the security council in recent years.\nHamas condemned the veto, describing it as “unethical and inhumane.”\n“The US obstruction of the ceasefire resolution is a direct participation with the occupation in killing our people and committing more massacres and ethnic cleansing,” said Ezzat El-Reshiq, a member of the group’s political bureau.\nPalestinian prime minister Mohammed Shtayyeh said it was “a disgrace and another blank cheque given to the occupying state to massacre, destroy and displace”.\nAfter the vote, United Arab Emirates deputy ambassador Mohamed Abushahab warned that the Security Council is growing isolated and “appears untethered” from its mandate to ensure international peace and security.\n“What is the message we are sending Palestinians if we cannot unite behind a call to halt the relentless bombardment of Gaza?” Abushahab asked. “Indeed, what is the message we are sending civilians across the world who may find themselves in similar situations?”\nHuman Rights Watch said the US risked “complicity in war crimes” by continuing to provide Israel with weapons and diplomatic cover as it commits “atrocities, including collectively punishing the Palestinian civilian population in Gaza”. Medecins Sans Frontiers said the security council’s inaction made it “complicit in the ongoing slaughter”.\nWashington will be hoping that its decision to side with Israel will not damage long-term relations with Arab leaders who, although sympathetic to the Palestinian cause, have little time for the methods or politics of Hamas. The damage to its relations with the UN relief agencies may be longer lasting.\nThe US for its part is furious that Guterres raised the crisis in such a dramatic fashion, and feel he has played into the hands of Russia and China by damaging US standing with the so-called global south.\nBut with the UN claiming its relief operation was grinding to a halt and its staff being killed, Guterres chose earlier this week to take the extremely rare step of invoking article 99 of the UN charter, which permits him to bring a threat to world security to the attention of the security council.\nReminding the security council that more than 130 UN staff had been killed, he said: “The eyes of the world – and the eyes of history – are watching. It is time to act.”\nHe said if the fighting continued “we anticipate it will result in a complete breakdown of public order and increased pressure for mass displacements into Egypt. I fear the consequences could be devastating for the security of the entire region. We have already seen the spillovers in the occupied West Bank, Lebanon, Syria, Iraq and Yemen”. Guterres’ spokesperson, Stephane Dujarric, said he “remains determined to push for a humanitarian ceasefire”.\nJordan’s foreign minister, Ayman Safadi, had also warned failing to adopt the resolution “will be an endorsement of Israel’s killing of innocent civilians, starving a whole population, war crimes. Humanitarian system collapsing. The agencies screaming out for help.”\nIn a passionate intervention, the Palestinian ambassador to the UN, Riyad Mansour, said Israel’s aim was not security, but to end for ever any prospect of Palestinian independence and self-respect.\nWithout naming the US president, Joe Biden, he accused America of being taken for a ride by Israel’s promise to behave with restraint. He said: “You can keep calling on Israel to protect civilians, to uphold the laws of war, to allow humanitarian aid in. It will keep toying with you, fooling you, forcing you to discuss the number of trucks while people still cannot get food, water, medicine. It will keep telling you if people only heeded its calls to head south they would have been saved while bombing them in the south.\n“It will explain to you that all of Gaza is a military target, that everyone in Gaza can be killed since they are either terrorists or human shields. Enough is enough. They are playing games with you and they’re taking you for a ride. And you will need to wake up and see reality as it is. If two months of dehumanisation and lies and massacres are not enough to make you understand the Israelis’ plan, what will?”\nFrench ambassador Nicolas De Rivière, who supported the resolution, pleaded “for a new, immediate and lasting humanitarian truce that should lead to a sustainable ceasefire.” Japan, a close US ally, also supported the call for a ceasefire.\nRussia’s deputy UN ambassador Dmitry Polyansky accused the US of issuing “a death sentence to thousands, if not tens of thousands more civilians in Palestine and Israel, including women and children”.\nGilad Erdan, the Israeli ambassador to the UN, urged the world not to get sucked into the “death script” of Hamas and said the casualty figures being produced by Hamas were a libel.\nHe said: “Regional stability and the security of both Israelis and Gazans can only be achieved once Hamas is eliminated, not one minute before. So the true path to ensure peace is only through supporting Israel’s mission, and absolutely not to call for a ceasefire.\n“If this council wants to see a ceasefire, start by demanding it from Hamas, the party that broke the past two.”\nIn the only concession to Palestinian concerns, the US said it was still pressing Israel to open new aid inspection points, construct clearer deconfliction zones and increase the supply of fuel – promises that Israel’s critics say have been made repeatedly and not met.\nArab and Islamic states had been steadily building diplomatic momentum to table a ceasefire resolution, a move that gained greater urgency once the previous truce broke down on 1 December and Israel restarted its offensive in the south of Gaza. The motion also called for the “immediate and unconditional” release of all hostages and “ensuring humanitarian access”.\nThe Arab states had hoped they could put enough moral and diplomatic pressure on the US to back a ceasefire, and when it seemed as if the US was not relenting, the security council vote was delayed to give Arab foreign ministers time to lobby the US secretary of state, Antony Blinken, personally in Washington.\nBefore the vote, Blinken admitted there was a “gap” between the protections intended to be provided to Gaza’s civilians and the reality in many UN shelters. He said: “There is a gap between what I stated in Israel regarding the protection of civilians and what we are witnessing on the ground now.”\nAntony Blinken says 'gap' between Israel's intent to protect civilians and 'actual results' – video\nHe listed a series of measures that Israel could take to do more to protect civilians, some of which were raised by Biden in a call on Thursday with Benjamin Netanyahu, the Israeli prime minister.\nThe UN has also welcomed plans by Israel to allow inspections of humanitarian convoys at an extra border crossing, Kerem Shalom, a measure that could increase the flow of aid.\nEmotions are running high and many in the Arab world have been outraged by pictures shown on Israeli TV of Palestinian civilians stripped of their clothes and being interrogated by the Israel Defense Forces. The Palestinian ambassador to the UK, Husam Zomlot, said: “Israeli media did not show the mass murder of Palestinian children and innocent civilians, or the mass destruction of Gaza. But Israeli media has no qualms about showing these savage images of Israeli occupation forces detaining and stripping civilians taken from a UN shelter in Gaza today.”\nDavid Cameron, the UK foreign secretary, on a visit to the US said Britain opposed a ceasefire at this point. “If you stop now with Hamas in charge of even part of Gaza there can never be a two-state solution,” he said.\nAsked if he believed Netanyahu believed in a two-state solution, he said: “You will have to ask him that.”", "source_domain": "www.theguardian.com", "text": null, "title": "US defies appeals to back UN resolution for urgent Gaza ceasefire", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/08/us-to-oppose-arab-backed-resolution-calling-for-urgent-gaza-ceasefire"}