{"authors": ["Wilfred Chan"], "date_download": "2024-02-05 15:29:29", "date_modify": "None", "date_publish": "2023-12-08 16:55:00", "description": "Michael Solomonov’s Israel-inspired restaurant empire has come under scrutiny by pro-Palestinian protesters, who accuse him of complicity in attacks on Gaza", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F08%2Fmichael-solomonov-philadelphia-restaurant-israel-antisemitic-protest.json", "image_url": "https://i.guim.co.uk/img/media/402c47355df5fd3be67b8a936197ed5edb1c804b/0_101_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=50b0fbd2368718942b508dbad90ae448", "language": "en", "localpath": null, "maintext": "The 21-second clip went viral almost as soon as it was posted early on Sunday evening. It showed hundreds of protesters, some with Palestinian flags, united in a rhyming chant: “Goldie, Goldie, you can’t hide, we charge you with genocide!”\nThey were protesting outside Goldie, a vegan falafel restaurant owned by Michael Solomonov, the Israel-born celebrity chef best known for Zahav, an Israeli-themed restaurant widely considered one of the United States’ finest eateries. It was one brief stop along a march traversing Philadelphia that lasted about three hours.\nMany of the protesters hadn’t even returned home from the march when the condemnations began to pour in. The Pennsylvania governor, Josh Shapiro, a Democrat, posted on X: “Tonight in Philly, we saw a blatant act of antisemitism – not a peaceful protest. A restaurant was targeted and mobbed because its owner is Jewish and Israeli. This hate and bigotry is reminiscent of a dark time in history.”\nEven the White House piled on: it was “antisemitic and completely unjustifiable to target restaurants that serve Israeli food over disagreements with Israeli policy”, said the deputy press secretary, Andrew Bates. Douglas Emhoff, husband of Vice-President Kamala Harris, wrote on X that he had spoken with Solomonov and “told him @POTUS, @VP, and the entire Biden-Harris Administration will continue to have his back”.\nIt was the apex of a saga that has resulted in at least three workers fired from Solomonov’s restaurants over, as they see it, their pro-Palestine activism coming into conflict with their bosses’ views and policies, and at least one other worker who has resigned in protest – thrusting the renowned Israeli eateries into the thick of bitter US disagreements over the Israel-Hamas war.\nThe street protest against Goldie has sparked heated debate. As the war on Gaza rages on, with over 17,000 people killed in Gaza since 7 October – 70% of them women and children, according to Gaza’s health ministry – are Israel-linked businesses in the US implicated? Was Solomonov, a chef who has credited Palestinian influences in his cooking, an appropriate target?\nInterviews with protesters and current and former employees at Solomonov’s restaurants paint a more complex version of events than what the video clip may have suggested. They reject the notion that Goldie was singled out because of the owners’ ethnicity, arguing that their objections stem from management using the restaurants to fundraise for Israel after 7 October in spite of worker concerns. Activists also say their protest shines a necessary spotlight on the political commitments of one of the highest-profile restaurateurs in the United States.\nTensions at work\nThere were political tensions simmering at Solomonov’s restaurants before Sunday’s march. The Guardian spoke to three Goldie workers who say they were fired due to their pro-Palestine advocacy: two who wore Palestinian flag pins in violation of a newly announced dress code that forbade non-Goldie branded adornments, and another who tweeted in support of Sunday’s street protest.\n00:00:29 Protesters chant outside Jewish restaurant in Philadelphia – video\nTheir discomfort at work began following a fundraiser in October, during which Solomonov and his business partner Steve Cook announced they would donate all of the restaurant group’s profits from one day, over $100,000, to United Hatzalah, an Israeli medical non-profit that has supplied the Israel Defense Forces with protective and medical gear during the current war against Hamas.\nAnd in early November, Solomonov’s Zahav hosted a private fundraiser by a prominent political action committee dedicated to supporting political candidates “who reflect Jewish values”. Attendees at the event, which has not been previously reported, included the Michigan governor, Gretchen Whitmer; and dozens of other pro-Israel officials and lobbyists, according to a current Zahav employee, who spoke on condition of anonymity. The employee said that in recent weeks, Solomonov had also booked and paid for multiple, lavish private dinners at Zahav for IDF members preparing to deploy to fight for Israel.\n“The amount of material support that we’ve lended to pro-Israel causes and Israeli military personnel has been really discomforting,” the Zahav worker told the Guardian.\nIn an email to workers on Wednesday, Solomonov and Cook apologized for not communicating about their political stances with staff more directly. The pair had sought to “avoid discussing politics at work … to make everyone as comfortable as possible in the restaurant,” the owners wrote. “But perhaps we created a void that had the opposite effect. For that, we are sorry.”\nThe fraught politics of food\nThe protest and its fallout have produced the biggest controversy ever faced by Solomonov, one of America’s most prominent Israeli cultural figures and someone who for years has cast himself as a culinary bridge between Israel, Palestine, and the United States.\nSolomonov’s brother, a soldier in the Israel Defense Forces, was killed in 2003 by Hezbollah snipers; Solomonov wrote in his first cookbook, Zahav, that the tragedy made him briefly consider joining Israel’s army. Instead, he decided to channel his emotion into food, something he found allowed him to “expose people to a side of Israel that had nothing to do with politics”. That led him and Cook, an investment banker-turned-restaurateur, to found Zahav in 2008, followed by other prominent Israeli-themed eateries: Dizengoff, Goldie, K’Far, and Laser Wolf, under a restaurant group called CookNSolo. In 2017, Israel’s ministry of tourism named him a culinary ambassador.\nThe restaurants have never been completely free from controversy. Debates over the origins and ownership of Middle Eastern food have raged for years; many culinary experts have argued that Palestinian contributions to Mediterranean cuisine have been used by Israeli chefs without sufficient respect or acknowledgement. Yet while Solomonov and Cook have always branded their food as Israeli, their menus and cookbooks cite Palestinian influences on many dishes. For years, Solomonov also spoke of his friendship with the Palestinian writer and cookbook author Reem Kassis – though the two are no longer speaking, according to the New York Times.\nBut the conflicts aren’t just over cultural appropriation. They’re about “the way Israel as a state has weaponized food against the Palestinian people”, says the Palestinian American chef Reem Assil, who owns Reem’s, a Arab street food joint in San Francisco. “Even before these last 60 days, Israel has restricted what Gazans can access in terms of food and water. They target bakeries, they target farms, they target markets. They uproot our olive trees, they make it illegal for us to forge our own ingredients, like za’atar.” The UN warned last month that Israel’s military operations in Gaza had put residents there at “immediate” risk of starvation.\n“And against this backdrop, Israel has promoted an idea of Israel as this culinary melting pot, while clearly the story of the indigenous [Palestinian] population is left out of that story,” and chefs like Solomonov have benefited from that, Assil says. After the Gaza war began in October, Assil and other Palestinian American chefs launched a pledge called Hospitality for Humanity, which calls on the food industry to “divest from products, events, and trips that promote Israel until it dismantles its apartheid system and military occupation”.\nView image in fullscreen Customers outside Goldie on Monday, the day after the protest. Photograph: Matt Rourke/AP\nA controversial fundraiser\nSince the 7 October attacks, Solomonov has publicly sought to caveat his support for Israel. “I personally believe in the right of Palestinians to have their own state, and the right for self-determination, and I don’t deny those things,” he said at an event last month in New Jersey, according to the Philadelphia Inquirer. “And I believe the Israeli government oftentimes does things that I would not do at all … and it can be quite damaging.”\nBut internally, Solomonov and Cook were using their restaurants to steer resources toward Israel.\nOn 10 October, Solomonov and Cook announced a fundraiser that would donate all the profits across CookNSolo restaurants on 12 October to United Hatzalah. “It is not associated with any military,” the restaurant group assured staff in a Slack message – something that simply wasn’t true, workers soon realized with alarm.\nGoldie staff were caught off guard because they considered the restaurant a politically progressive institution. The vegan falafel restaurant proudly displayed an LGBTQ flag and Black Lives Matter flag on its wall. Many of the workers were young and identified as queer. There was a casual dress code: Noah Wood, a 25-year-old who uses they/them pronouns, said they did shifts at Goldie while wearing hats with slogans supporting indigenous rights.\nThe night before CookNSolo’s fundraiser, Goldie’s store manager at the time, 24-year-old Sophie Hamilton, says she discovered public videos by United Hatzalah about how the non-profit supplied protective gear to IDF soldiers. She rushed off an email to Goldie’s general manager, Emma Richards, saying she felt “deeply betrayed and misled”. “I feel like I’ve been left with no choice but to refuse to come to work tomorrow unless [CookNSolo] commits to also raising donations for a Palestinian humanitarian organization, of course with no connection to any military.”\nBut Hamilton’s suggestion was ignored, and Richards simply told her someone would cover her shift the next day.\nWhen Hamilton returned to work, she decided to keep working but while wearing a small Palestinian flag pin. “There’s just a point where you can’t leave your humanity at the door,” she said. No customers complained, but two weeks later, management announced a new rule: staff were not to wear stickers, pins, or patches that were not Goldie-branded.\nWood, the other server, started wearing a Palestinian flag pin in open defiance of the new rule. Another worker, June, 24, wore a green shirt, black pants, and a red bandana – a reference to the colors of Palestinian flag.\nOn 15 November, the restaurant asked Hamilton to send Wood home for violating the dress code. Hamilton refused, and the next day they were both fired, Hamilton for “poor performance for failing to enforce the uniform policy”. Wood was not given any official reason, they say.\nIn the Wednesday email to staff, the owners wrote: “We recognize that people have different views on the war between Israel and Hamas, and we respect your rights to your own views. Many of our guests have passionate feelings about the current conflict and, knowing that not all of you feel the same way, our approach is to simply avoid discussing politics at work.”\nThey did not provide details on the firings beyond writing: “It is also important for you to hear directly from us that we have never terminated employees based on their support for Palestine.”\nIn the email, the owners also acknowledged discontent over the United Hatzalah fundraiser. “We chose the organization because of its humanitarian mission, which is to provide emergency medical response and supplies to anyone who needs it – Jew or Muslim, Arab or Israeli,” they wrote. “We were unaware that the organization’s efforts shifted during the war, to include providing the army with ambulances and medical supplies. But to be clear, based on our communications with officials of the organization, all of the money we raised has been used for medical treatment.”\nView image in fullscreen Solomonov appears on Late Night with Seth Meyers in February. Photograph: NBC/Lloyd Bishop/Getty Images\nThe owners added: “We think it’s important to say that our support of Israel is not unqualified. We have plenty of criticisms, particularly in the way that the government has stymied the prospects for Palestinian statehood in recent years.”\nIn a statement shared with the Guardian, United Hatzalah’s senior vice-president for international operations, Michael Brown, said that the nonprofit and the IDF “often train together, especially when conducting mass casualty training drills, or search and rescue training drills in order to hone our skills and help the IDF sharpen theirs, as well as to allow for an easier flow of collaborative life saving efforts should the need ever arise in the field, similar to what happened during October 7th.”\nThe restaurant group declined to respond to a detailed list of questions by the Guardian about the fired workers, but a spokeswoman said in a statement: “CookNSolo exists to create community through food. We are committed to fostering an open, safe, and supportive workplace for all of our employees who have varying backgrounds and political views. Like many hospitality companies, we have standard policies for our employees, which we consistently enforce.” Solomonov declined, through a representative, a direct request for an interview.\nJustin Sadowsky, an attorney at the Council on American-Islamic Relations, a civil rights non-profit, says the firings of Goldie workers are the first time he’s heard of restaurant workers allegedly fired for supporting Palestine since 7 October. “We’ve seen it in hospitals, we’ve seen it at large corporations, we’ve seen it in law firms, but it’s sort of spilling into everywhere,” he said. The organization says it’s received a “staggering” 2,171 requests for help and reports of bias in the 57 days since the Israel-Hamas war began, equalling nearly half of the total complaints it handled in all of 2022.\nCall for a boycott\nMeanwhile, CookNSolo’s fundraiser for United Hatzalah had caught the attention of local activists in a group called the Philadelphia Free Palestine Coalition. The activists weren’t in touch with the restaurant workers, but drew the same conclusion: by funneling restaurant proceeds toward a group associated with the IDF, CookNSolo was complicit in Israel’s war crimes.\nIn mid-October, the activists called for a boycott. Natalie Abulhawa, a Palestinian American organizer at the Free Palestine Coalition, helped write an Instagram post for the boycott that named three of Solomonov’s restaurants – Goldie, Zahav, and Laser Wolf – as well as a number of other Middle Eastern restaurants in the city. “Restaurants and businesses claiming to sell ‘Israeli’ food, fruits, vegetables, and products are part of an ongoing colonial campaign of stealing, appropriating, and profiting off of Palestinian food and culture as a means of erasing Palestinian existence,” the call read.\nThe boycott made waves in the food world, and Solomonov addressed it at a closed-door event in November at a New Jersey Jewish Community Center. Speaking to the crowd of several hundred, he called the boycott misguided, adding that it wasn’t affecting his sales, according to the Inquirer. While acknowledging that “part of Israeli food is Palestinian influenced”, he argued that any suggestion that Israeli food was stolen from Palestinians was akin to saying Israelis “don’t have a right to be there”. Solomonov added that his restaurants credited Palestinian influences on their menus and claimed Zahav imported more Palestinian wines than any other Philadelphia eatery.\nBut privately, Solomonov and Cook were using their restaurants to platform Israel’s war effort. On 1 November, Zahav hosted a fundraiser by a major political action committee called Democratic Jewish Outreach Pennsylvania, whose guests included Whitmer and as many as 80 other pro-Israel officials and lobbyists, according to the unnamed Zahav employee. “It was an explicitly pro-Israel reception and speeches made were about that support,” the employee said.\nThe employee said that Whitmer, who delivered a keynote, opened with the Jewish expression of solidarity “Am Yisrael Chai”, or “the people of Israel live”, and called for providing material support to Israel, and that Solomonov, who was in the audience, was afterward “emphatically talking and thanking all of the attendees”.\nIn the following weeks, the employee became even more disturbed as Solomonov hosted and paid for at least two private dinners at Zahav for small groups of Israelis, including soldiers who were preparing to fly home to fight the Gaza war. Solomonov explained with “a level of reverence” that the restaurant would cover the bill because of the diners’ roles in the Israeli military, the employee says.\nThese events, in addition to the firings of Goldie staff, have made many of Zahav’s staff deeply uncomfortable. “Most of the employees here are not particularly interested in the support of Israel,” the employee said, but the workers fear retaliation if they speak out. CookNSolo declined to comment on the events at Zahav.\nA clip goes viral\nPennsylvania’s Jewish and Muslim communities have been on edge since the Israel-Hamas war began. On Monday, a Jewish daycare in Philadelphia reported that vandals had spray-painted “Free Palestine” and other graffiti on its windows. On Tuesday, a pair of students sued the University of Pennsylvania, claiming it had become an “incubation lab for virulent anti-Jewish hatred”. Last week, a South Philadelphia mosque reported that it had been vandalized by anti-Muslim graffiti. And last month, a man was arrested for pointing a gun and yelling racial slurs against a group of pro-Palestine demonstrators at the state’s capitol.\nThe Goldie protest also followed a growing number of incidents that have entangled Middle Eastern food businesses. Palestinian restaurants such as New York City’s Ayat have reported being flooded with negative reviews since the war began; last month, an ex-Obama aide was charged with a hate crime for harassing a halal food street vendor.\nAt Goldie, the atmosphere had become “very, very tense” after Hamilton and Wood’s firings, said June.\nView image in fullscreen People pray during a pro-Palestinian event in Philadelphia’s Rittenhouse Square. Photograph: Elizabeth Robertson/AP\nBut Goldie’s attempts to head off pro-Palestinian activism were futile.\nOn 3 December, the Free Palestine Coalition led hundreds of protesters in an evening of marches around Philadelphia to renew calls for a ceasefire. Starting from Rittenhouse Square in Philly’s Center City neighborhood, the march took a wrong turn, which brought it past Goldie, says Abulhawa. The encounter with the falafel restaurant wasn’t planned, she says, “but we ran with it”.\nJune, who is Jewish, was one of the employees working inside Goldie that night, and said the protest – which lasted just a few minutes – was completely peaceful: “There was nothing violent, no hint of antisemitism.” The store was devoid of guests when the marchers arrived, though one customer came in partway through to pickup an online order and displayed no reaction. June even thought about going outside to join the protest, but thought better of it and instead quietly chanted along to the slogans from inside the store.\nSomeone placed two small stickers on Goldie’s door and window. One read, “Free Palestine,” and another contained a statistic about the number of children Israel had killed in Gaza (Abulhawa says that whoever placed the stickers were not asked to do so by protest organizers). One protester briefly posed in front of the door with a Palestine flag. Then the protest shuffled on.\nA few minutes later, a user named Jordan Van Glish posted a 21-second clip of the protest to X, where it quickly went viral. Comments flooded in: “Once again proving that this is about hating Jews,” one user wrote. Stop Antisemitism, a prominent pro-Israel group, posted that it was a “failure” that no anti-riot police were dispatched and no protesters were arrested.\nBut Philadelphia’s police force told the Guardian that officers observing the march “did not see, hear, or record any threats to persons inside or outside Goldie”, and the department received “no 911 calls or complaints” during the event.\nSome marchers have acknowledged how the clip, taken out of context, could have been misinterpreted. “I’d say in hindsight, maybe [the organizers] should have spent another minute explaining why we were stopping there,” says Joe Piette, a photographer who joined the protest. “It would have been better to explain some of the details of the owner of that restaurant. Our mistake was not explaining it on the spot.”\nJune felt that frustration when they got home that night and saw the clip gaining traction. “So I felt like I should give the context that was missing from that tweet,” they said. June published a post explaining that the restaurant group had raised money for Israel-linked causes and punished pro-Palestine employees. “If you don’t want to be directly funding genocide, you should probably stay away from Goldie” and other CookNSolo restaurants, they wrote.\nOn Monday, June got a phone call while on the bus to work: they were fired as well. The manager gave no explanation, but June didn’t need to ask why. “Honestly, I didn’t really feel that bad or surprised,” they said. “I had no pride in this job.”\nHigh-profile officials have continued to argue that the protesters were motivated by antisemitism. Governor Shapiro doubled down on his tweet after visiting Goldie and meeting with Solomonov on Wednesday. “A mob protested a restaurant simply because it’s owned by a Jewish person,” the governor claimed. “That is the kind of antisemitic tropes that we saw in 1930s Germany, and it’s the kind of thing we should not tolerate.” In a statement to the Guardian, his office reiterated: “This was not a peaceful protest”.\nTwo days after the march, Tess Rauscher, a 25-year-old barista at the CookNSolo-owned Israeli cafe K’Far, resigned, citing the company’s fundraiser and firing of Goldie workers, according to the Philadelphia Inquirer. “It was these actions, not the identity of the owner, that changed the nature of my job,” she said.", "source_domain": "www.theguardian.com", "text": null, "title": "A protest against a top Israel-born chef was called antisemitic. Staff tell a different story", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/08/michael-solomonov-philadelphia-restaurant-israel-antisemitic-protest"}