{"authors": [], "date_download": "2024-02-05 15:29:31", "date_modify": "None", "date_publish": "2023-12-08 10:27:53", "description": "South Korea’s defense minister has vowed massive retaliatory missile strikes on “the heart and head” of North Korea in the event of provocation, as the rivals escalate their rhetoric over their respective spy satellite launches in recent days", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fnorth-korea-ap-south-korea-seoul-japan-b2460750.html.json", "image_url": "https://static.independent.co.uk/2023/12/08/10/South_Korea_Koreas_Tensions_79063.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nSouth Korea’s defense minister on Friday vowed massive retaliatory missile strikes on “the heart and head” of North Korea in the event of provocation, as the rivals escalate their rhetoric over their respective spy satellite launches in recent days.\nThe South Korean warning — unusually fiery rhetoric by Seoul directed at Pyongyang — came as the top security advisers from South Korea, the U.S. and Japan gathered in Seoul for talks to discuss North Korea's evolving nuclear threats and other issues.\nDuring a visit to the army’s missile strategic command, South Korean Defense Minister Shin Wonsik ordered command officers to maintain a readiness to fire precision-guided and powerful missiles at any time, according to his ministry.\nShin said the main role of the command is “lethally striking the heart and head of the enemy, though the types of its provocations can vary,” a ministry statement said.\nAnimosities between the two Koreas deepened after North Korea launched its first military reconnaissance satellite into space on Nov. 21 in violation of U.N. bans. South Korea, the U.S. and Japan strongly condemned the launch, viewing it as an attempt by the North to improve its missile technology as well as establish a space-surveillance system.\nSouth Korea announced plans to resume front-line aerial surveillance in response. North Korea quickly retaliated by restoring border guard posts, according to Seoul officials. Both steps would breach a 2018 inter-Korean deal on easing front-line military tensions.\nLast week, when South Korea also launched its first military spy satellite from California’s Vandenberg Space Force Base, North Korea slammed the U.S. for alleged double standards and warned of a possible grave danger to global peace.\nIn a statement Friday, Jo Chol Su, a senior North Korean Foreign Ministry official, said the North would make all available efforts to protect its national interests in the face of threats by hostile forces.\nThe national security advisers from South Korea, the U.S. and Japan are to hold their first trilateral meeting in six months in Seoul on Saturday.\nAhead of the three-way meeting, South Korean national security adviser Cho Tae-yong and his Japanese counterpart, Takeo Akiba, met bilaterally on Friday and reaffirmed a need to strengthen their cooperation with the U.S. to cope with with provocations by North Korea. Cho and U.S. national security adviser Jake Sullivan also met and affirmed that Seoul and Washington remain open to diplomacy with North Korea, according to South Korea's presidential office.\nEarlier Friday, South Korea's Unification Ministry accused North Korea of property rights infringements by unilaterally using South Korean-owned equipment at a now-shuttered joint factory park in the North. The ministry also accused North Korea of dismantling the remains of a South Korean-built liaison office at the park that the North blew up during a previous period of tensions in 2020.", "source_domain": "www.independent.co.uk", "text": null, "title": "South Korea's defense chief vows retaliatory strikes on 'heart and head' of North Korea if provoked", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/north-korea-ap-south-korea-seoul-japan-b2460750.html"}