{"authors": ["Charlie Bradley"], "date_download": "2024-02-05 15:15:37", "date_modify": "None", "date_publish": "2024-01-26 16:44:00", "description": "Moscow accused Ukraine of downing the aircraft, which reportedly had 65 Ukrainian PoWs at the time.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1860241%2Fputin-us-missiles-ukraine-plane-shot-down-pows-france.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5183643.jpg", "language": "en", "localpath": null, "maintext": "Vladimir Putin has claimed the downing of a plane containing Ukrainian prisoners of war was done with missiles from \"the US or France.\"\nMoscow accused Ukraine of downing the aircraft, which reportedly had 65 Ukrainian PoWs at the time.\nThe Ilyushin Il-76 plane crashed in Russia's Belgorod region, an area close to the Ukrainian border which has experienced multiple missile strikes in recent months.\nUkraine has not confirmed or denied whether it shot down the plane.\nBut Kyiv has challenged Moscow's version of what happened, including details of who was on the plane.\nPutin said it is \"not yet clear\" where the missile is from but an investigation will be carried out, bringing a verdict in \"two or three days.\"\nVideo of the crash on social media from the Belgorod border region of Russia showed a plane falling from the sky in a snowy, rural area, and a huge ball of fire erupting where it apparently hit the ground.\nThroughout the 700-day war, Russia and Ukraine have traded conflicting accusations, and establishing the facts has often been difficult, both because of the constraints of a war zone and because each side tightly controls information.\nREAD MORE: Russia 'faked deaths of 65 prisoners in propaganda stunt plane crash'", "source_domain": "www.express.co.uk", "text": null, "title": "Putin says US or French missiles were used to shoot down Ukrainian POW plane", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1860241/putin-us-missiles-ukraine-plane-shot-down-pows-france"}