{"authors": ["Kamal Sultan", "Kamal Sultan For Dailymail.Com"], "date_download": "2024-02-05 15:29:34", "date_modify": "None", "date_publish": "2023-12-08 16:55:10", "description": "The US embassy in Baghdad has been bombarded with 60mm mortar rounds in an attack believed to have been carried out by Iran-aligned militias.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12842089%2FUS-embassy-Baghdad-bombarded-fiery-mortar-rounds-attack-Iran-militia.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/08/15/78741657-0-image-a-14_1702050916162.jpg", "language": "en", "localpath": null, "maintext": "The US embassy in Baghdad has been bombarded with 60mm mortar rounds in an attack believed to have been carried out by Iran-aligned militias.\nMissiles were fired at the diplomatic hub in Iraq in the early hours of Friday morning and they set off the emergency sirens.\nStaff and residents in the local area were told to 'take cover and await further instruction' as the sound of explosions rung out.\nAround seven mortar rounds landed within the embassy compound. The US military said there were no casualties or major infrastructure damage but the attack reportedly damaged the headquarters of an Iraqi security agency.\nThe incident marked the first time the US embassy has ever been fired on and comes after dozens of attacks on military bases housing US forces in Iraq and Syria since mid-October.\nThe US embassy in Baghdad has been bombarded with 60mm mortar rounds in an attack believed to have been carried out by Iran-aligned militias\nMissiles were fired at the diplomatic hub in Iraq in the early hours of Friday morning and they set off the emergency sirens\n🚨| 🇮🇶🇺🇸 US Embassy in Baghdad, Iraq, has been targeted by a barrage of rockets. pic.twitter.com/b5TMuEMtN7 — Arya - آریا 🇮🇷 (@AryJeay) December 8, 2023\nExplosions were heard near the embassy in the Iraq capital at 4am on Friday sending people ducking for cover.\nThe emergency sirens were activated and a warning message was played to those nearby.\n'Duck and cover. Step away from the windows. Take cover and await further instruction,' it repeatedly said.\nNo group has claimed responsibility for the attack but it is believed to have been carried out by Iran-aligned militias which have targeted US interests in Syria and Iraq over Washington's backing for Israel in its Gaza war.\nA senior official in Lebanon's Hezbollah movement said on Friday attacks by Iran-aligned groups across the Middle East aim to apply pressure for a halt to Israel's offensive in the Gaza Strip. He did not refer specifically to Friday's attack.\nDozens of attacks against US forces in Iraq and Syria have been claimed by a group of Iran-aligned Shi'ite Muslim militias operating under the banner of the Islamic Resistance in Iraq.\nThe US has responded with a series of strikes that have killed at least 15 militants in Iraq and up to seven in Syria.\nThe attacks pose a challenge for Iraqi Prime Minister Mohammed Shia al-Sudani, who has pledged to protect foreign missions and capitalize on fragile stability to focus on the economy and court foreign investment, including from the United States.\nStaff and residents in the local area were told to 'take cover and await further instruction' as the sound of explosions rung out\nThe incident marked the first time the US embassy has ever been fired on and comes after dozens of attacks on military bases housing US forces in Iraq and Syria since mid-October\nSudani directed security agencies to pursue the perpetrators, describing them as 'unruly, lawless groups that do not in any way represent the will of the Iraqi people,' a statement from his office said.\nHe also said that undermining Iraq's stability, reputation and targeting places Iraq has committed to protect were acts of terrorism.\nThe prime minister added that targeting diplomatic compounds is 'unjustified' and is an insult to Iraq and its stability.\nThe US embassy spokesman called on the Iraqi government to do all in its power to protect diplomatic and coalition personnel and facilities.\n'We reiterate that we reserve the right to self-defense and to protect our personnel anywhere in the world,' he said.\nAside from its diplomatic staff in Iraq, the United States has about 2,500 troops in the country on a mission it says aims to advise and assist local forces trying to prevent a resurgence of Islamic State, which in 2014 seized large swathes of both countries before being defeated.\nIran-aligned Houthis have been firing at Israel and ships in the Red Sea in a campaign they say aims to support the Palestinians. US warships have shot down several of their projectiles.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US embassy in Baghdad is bombarded with 60mm mortar rounds by Iran-aligned militias marking the first time it's EVER been fired upon as explosions rock city in the early hours of the morning", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12842089/US-embassy-Baghdad-bombarded-fiery-mortar-rounds-attack-Iran-militia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}