{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:29:35", "date_modify": "None", "date_publish": "2023-12-08 23:54:59", "description": "Israeli media claimed images show Hamas fighters but several civilians have been identified including a journalist", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F08%2Ffootage-idf-israel-military-parading-palestinian-men-around-in-underwear.json", "image_url": "https://i.guim.co.uk/img/media/a1e5fb4c23b9cc4d878db47608d91f89e4c8a3f7/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cf154eab0cf3bd002da801db8ae3542d", "language": "en", "localpath": null, "maintext": "The International Committee of the Red Cross has said it is concerned by images of semi-naked Palestinian men being paraded by the Israeli military in Gaza, adding that all of those detained must be treated in keeping with international humanitarian law.\n“We strongly emphasise the importance of treating all those detained with humanity and dignity, in accordance with international humanitarian law,” Jessica Moussan, a spokesperson for the ICRC, said in a statement.\nThe video and photographs, which were shared on social media on Thursday evening, showed dozens of men, some bound and blindfolded, stripped to their underwear in several public locations.\nWhile Israeli media initially suggested that the images, apparently filmed by at least one Israeli soldier, showed the surrender of Hamas fighters, several of the men pictured were identified as civilians, including a journalist.\nHani Almadhoun, who works at a US charity which raises funds for the UN’s Palestine relief agency, UNRWA, said he recognised his brother, Mahmoud, a shopkeeper, in one video.\n“I recognised him immediately … and recognised the area as the same area they had been sheltering.”\nAlmadhoun, who lives in Virginia, said his sister identified his 27-year-old nephew Abood packed in with a bunch of men in the back of a military truck. Almadhoun’s father and 13-year-old nephew, Omar, were also detained.\nAll four were later released, said Hani, who added that none of them had links to militant groups.\nAl-Araby Al-Jadeed (the New Arab) said its correspondent Diaa al-Kahlout was among them. In a statement, the news organisation said Kahlout had been rounded up along with his brothers, relatives and other civilians at the market street in Beit Lahiya, northern Gaza, and then “were forced to strip off their clothes and searched and humiliated before they were taken to an unknown location”.\nThe Committee to Protect Journalists called for his release as Husam Zomlot, head of the Palestinian Mission in London, said on X the images evoked “some of humanity’s darkest passages of history”.\nHanan Ashrawi, a Palestinian politician, said on X the incident was a “blatant attempt at the humiliation & degradation of Palestinian men … stripped & displayed like war trophies”.\nThe images and video show the men kneeling in the street or in a sandy location and were said to have been taken in several different places in Gaza. They emerged on Thursday evening not long after reports in Israeli media describing the surrender of dozens of members of Hamas around the northern Gaza town of Jabaliya.\nThere have also been conflicting reports about where the images were filmed. An Israeli government spokesperson claimed it was in the vicinity of Jabaliya and Shuja’iya, Hamas strongholds where there has been heavy street fighting since Israel resumed its ground offensive last week, while Palestinians – including a Hamas spokesperson – said the images were from Beit Lahiya, claiming the men had been rounded up at two UN schools being used as shelters, pointing to an identifying shop sign in one picture.\nIn one widely shared picture, dozens of men wearing only their underwear can be seen kneeling, many of them blindfolded, near a sandy berm with their hands apparently tied behind their backs while a group of Israeli soldiers stand over them.\nIt is not clear how and why the images came to be leaked. While the source of the images was not made explicit, one video – showing rows of men kneeling in a street, also stripped – appears to have been recorded by an Israeli soldier walking alongside the prisoners.\nIn another piece of footage, stripped men can be seen being transported in a military vehicle.\nWhile the Israel Defense Forces – which were contacted by the Guardian about the source of the pictures and if they were officially distributed – have yet to comment, a spokesperson appeared to suggest that the Israeli military was arresting and interrogating all men it came across in areas where there was fighting.\nAn Israeli government spokesperson, Eylon Levy, insisted the men had been apprehended in areas he described as Hamas strongholds.\n“We are talking about individuals who are apprehended in Jabaliya and Shuja’iya […] Hamas strongholds and centres of gravity,” he told a briefing.\n“We are talking about military-age men who were discovered in areas that civilians were supposed to have evacuated weeks ago.”\nDespite Israel’s warnings for civilians to evacuate, they are under no obligation to leave and tens of thousands of Palestinians still remain in combat areas, including Gaza’s north.\nThe Israeli military has been telling civilians to leave areas where it plans to operate after launching its campaign to eliminate Hamas in Gaza in response to the group’s murderous terror attacks in Israel on 7 October.\n“[Hamas] are hiding underground and come out and we fight them,” said R Adm Daniel Hagari in response to a question at a press conference. “Whoever is left in those areas, they come out from tunnel shafts, and some from buildings, and we investigate who is linked to Hamas, and who isn’t. We arrest them all and interrogate them.”\nUnder international humanitarian law, combatants in armed forces captured in uniform are entitled to protection under the third Geneva convention, which requires that PoWs be treated humanely and with respect for their honour in all circumstances. They are protected against any act of violence, as well as against intimidation, insults and “exposure to public curiosity”.\nWhile it is not clear that Hamas members would be covered by the convention, the apparent presence of civilians among those being paraded raises questions about their treatment.\nThe images came as further details were disclosed on how Israel is planning to prosecute detained Hamas members accused of involvement in the 7 October massacre in Israel.\nThe attorney general, Gali Baharav-Miara, and state attorney Amit Aisman issued a joint statement suggesting that special legal mechanisms would be required to prosecute those involved.\nDescribing 7 October as “an incident that was extraordinary and unprecedented in scope”, they said: “The law enforcement establishment needs to address the challenges of the complex investigation into the criminal acts of terrorism, as well as the complex legal issues that stem from those acts.”\nAmong possibilities that have been apparently discussed is a special tribunal, while some politicians have called for the imposition of the death penalty.", "source_domain": "www.theguardian.com", "text": null, "title": "Footage shows IDF parading scores of Palestinian men around in underwear", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/08/footage-idf-israel-military-parading-palestinian-men-around-in-underwear"}