{"authors": ["Espn Staff", "Heather Dinich", "Tom Vanhaaren", "Adam Rittenberg", "Chris Low", "Harry Lyles Jr.", "Kalan Hooks", "Dave Wilson"], "date_download": "2024-02-05 15:29:36", "date_modify": "None", "date_publish": "2023-12-08 12:00:00", "description": "Breaking down 2023's bowl season and everything we're looking forward to watching.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fcollege-football%2Fstory%2F_%2Fid%2F39055498%2Fbowl-season-best-games-players-storylines-watch-2023.json", "image_url": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F1207%2Fr1263394_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "Open Extended Reactions\nNow that we're the past the chaos of the weekend and the College Football Playoff being set between No. 1 Michigan, No. 2 Washington, No. 3 Texas and No. 4 Alabama, we look ahead to what the rest of the postseason is going to bring us, and there is no shortage of high-profile and exciting games.\nWe break down the games and players we are most excited to watch once bowl season gets underway on Saturday, Dec. 16.\nJump to: CFP | New Year's Six | The best of bowl season\nWho has something to prove | Under-the-radar players\nWhat are you excited to see in the playoff?\nBlake Baumgartner: We've been here before with Texas and Washington. By the time the Allstate Sugar Bowl kicks off on New Year's Day night, 368 days will have passed since the first year of the Kalen DeBoer era in Seattle concluded with a 27-20 victory over Steve Sarkisian and Texas in the Valero Alamo Bowl. A track meet is likely to ensue in New Orleans with Michael Penix Jr. (FBS-leading 4,218 passing yards with 33 touchdowns) and Quinn Ewers (3,161 passing yards with 21 touchdowns) calling the shots for two of the most explosive offenses in the country, with Texas ninth (475.9 YPG) and Washington not too far behind at 12th (469.1 YPG). How much does last December's meeting in San Antonio play into preparation for this year's? I'm unsure, but it undoubtedly adds intrigue and should provide a fun watch with the Huskies (1991) and Longhorns (2005) looking to end long national championship droughts.\nMark Schlabach: What font will the asterisk next to Michigan's national title be if the Wolverines finally get it done? Arial? Comic Sans MS? Times New Roman? There will be a lot of college football fans across the country rooting for Alabama -- as difficult as that might be for some -- to beat the Wolverines in a CFP semifinal at the Rose Bowl Game presented by Prudential. The same goes for the winner in the other CFP semifinal at the Allstate Sugar Bowl, either Texas or Washington, if the Wolverines win their first CFP game under coach Jim Harbaugh on New Year's Day. Florida State's unprecedented snub in the CFP might have stolen headlines on Selection Day, but Michigan's sign-stealing scandal isn't going to be swept under the rug for many fans.\nChris Low: It wasn't too long ago that Jalen Milroe was standing on the sideline and watching Tyler Buchner (yes, the same Tyler Buchner who just transferred to play lacrosse at Notre Dame) and Ty Simpson combine to complete 10 passes in an ugly win over South Florida. Now, here he is in the College Football Playoff three months later as one of the hottest players in the sport, trying to lead Alabama to its seventh national championship under Nick Saban. Milroe wasn't on anybody's radar back in September as a player who could be a catalyst for his team taking home the top prize. He's like an explosive running back with great acceleration who's gained increasing confidence to stand in the pocket, and he's stepped up in the pocket when necessary to deliver big-time throws. Oh yeah, he's pretty good at improvising, too. See his flip pass against Georgia in the SEC championship game. Michigan's defense is stout and especially adept at bullying teams. It should make for good theater seeing Milroe go up against an elite defense for the second straight game after engineering Alabama's 27-24 win over Georgia to win the SEC title.\nPaolo Uggetti: Can the Pac-12 go out with a bang? It was a banner year for the conference in more ways than one. Elite quarterbacks ruled the season and, at one point, the conference had nine ranked teams in the AP Top 25. It took an undefeated Washington team to give the Pac-12 its first playoff team since 2016. Now, the Huskies will be carrying the conference into a matchup with Texas. A win and they'll be the first to make it to a national title game since Oregon did in 2015. This season, the Huskies have shown they know how to simply keep winning in any situation. Can they keep it going?\nAdam Rittenberg: Whether Michigan can take the step from bullying the Big Ten to winning on the national stage. This was a problem under Jim Harbaugh's coach at Michigan, Bo Schembechler, and has been a problem during Harbaugh's tenure as well. Harbaugh is 1-6 in bowls at Michigan, including losses in each of the past two CFP semifinals. The Wolverines don't have an obvious weakness, although their offense didn't impress against Iowa in the Big Ten championship game. They will need their best effort to take down Nick Saban and Alabama at the Rose Bowl. If they fall short, how will we look at this era at Michigan? I can't wait to see what happens.\nWhich New Year's Six bowl game are you most looking forward to?\nBaumgartner: Oregon and Liberty have made the lives of opposing defenses miserable all season long and that should set the stage for a very entertaining Vrbo Fiesta Bowl. Both teams feature dynamite quarterbacks, Bo Nix (Oregon) and Kaidon Salter (Liberty), who lead the second-and-third-best offenses, respectively, in the country -- Oregon at 526.6 YPG and Liberty at 514.9 YPG. We know Jamey Chadwell and the Flames will be excited to be there with Salter (3,814 total yards and 43 total touchdowns) leading the way for the first Conference USA team to reach the New Year's Six. Can the Ducks put another three-point loss to Washington in the rear-view mirror and allow Nix (4,145 passing yards with 40 TDs) to conclude his collegiate career in proper fashion?\nSchlabach: I thought there were better potential matchups available -- Georgia vs. Oregon in the Chick-fil-A Peach Bowl or Ohio State vs. Florida State in the Capital One Orange Bowl -- than what we'll actually watch. That being said, the Orange Bowl will be interesting, if not entertaining, to see how the Seminoles look on offense and who shows up for the Bulldogs. Is Georgia quarterback Carson Beck coming back or entering the NFL draft? Will star tight end Brock Bowers and receiver Ladd McConkey, two of the most competitive guys on the team, play one more game? Their motivation level might take a hit after the Bulldogs were left out of the CFP with a 12-1 record. The two-time defending national champions insist they'll be ready to play, but it's impossible to really know. If Florida State knocks off Georgia, the Seminoles will undoubtedly claim a national title. They can order their T-shirts from the same vendor that printed the UCF ones in 2017.\nHale: The best bowl games often come from two programs with diametrically opposed styles, and that's exactly what makes the Peach Bowl so intriguing. Ole Miss is all offense, all the time under coach Lane Kiffin. Penn State's defense was among the most dominant in the country in 2023 (even if its offense was unaware of the forward pass at times). Drew Allar, Quinshon Judkins, Kaytron Allen and others provide ample star power, and both fan bases should show up in full force in Atlanta. Plus, the game's on a Saturday, so the Chick-fil-A at Mercedes Benz Stadium will be open. Spicy chicken sandwiches all around!\nRittenberg: Ohio State's transfers and opt-outs change the outlook for the Buckeyes in the Goodyear Cotton Bowl Classic, but I'm still interested to see how coach Ryan Day and his players respond from their latest setback against Michigan. They take on a Missouri team that seemingly will be much more motivated at AT&T Stadium after a surprising 10-2 season. The Tigers' backfield of Brady Cook and Cody Schrader is must-see, and will provide a real challenge for a Buckeyes' defense that couldn't get off the field against Michigan. Missouri's defense is solid, too, and goes against a Buckeyes' offense now featuring Devin Brown at quarterback and most likely new faces around the field. Ohio State has handled these consolation bowls better than expected, winning the Rose Bowl after both the 2018 and 2021 seasons. Day certainly is incentivized to regain some goodwill after another Michigan failure. Missouri coach Eliah Drinkwitz joked on ESPN that he would be getting intel on the Buckeyes from former Michigan staff member Connor Stalions. It should be an interesting night at Jerry World.\nplay 0:32 Missouri coach makes Connor Stalions joke to end interview Missouri head coach Eliah Drinkwitz jokes that he's getting a call from alleged Michigan signal-stealer Connor Stalions ahead of the Tigers' matchup vs. Ohio State.\nWhich under-the-radar bowl is a must watch?\nBaumgartner: James Madison's fight for bowl eligibility amid its two-year transition from FCS to FBS was one of the season's captivating storylines as it got off to a 10-0 start and \"College GameDay\" came to town ahead of its game with Appalachian State. With coach Curt Cignetti now at Indiana and quarterback Jordan McCloud (3,413 passing yards with 32 lTDs; 311 rushing yards and eight rushing TDs) intending to play despite entering the transfer portal, the Dukes' matchup with Air Force in the Lockheed Martin Armed Forces Bowl on Dec. 23 reeks a little of uncertainty. But something will have to give with the Falcons' rush offense (275.8 YPG; second in the FBS) going up against a Dukes' rush defense that has allowed just 61.5 yards per game, which led the entire country. James Madison has won at a high level and has done so frequently -- five 11-win seasons since 2016 -- and is aiming to finish with 12 victories for the second time in the past two seasons.\nSchlabach: The Las Vegas Bowl features what might be the best coaching job of the season by Northwestern's David Braun and one of the best of the past decade in Utah's Kyle Whittingham. After winning 11 of their first 12 bowl games under Whittingham, the Utes have fallen in four straight. Braun worked a miracle after taking over for longtime coach Pat Fitzgerald in July following a hazing investigation, then guiding the Wildcats to a 7-5 record.\nLow: If you're looking for a pairing of two coaches who've done serious work this year and the past couple of years, the Guaranteed Rate Bowl matchup between Kansas and UNLV should be one to watch. Lance Leipold has worked wonders at Kansas, which was 8-4 and 5-4 in the Big 12. Let's put that into perspective. The last time the Jayhawks had a winning overall record was 2008, and it was only the third time in the past 30 years that Kansas finished with a winning record in conference play. Barry Odom wasn't to be outdone in his first season at UNLV. The Rebels won nine games and made it to the Mountain West Conference championship game. Before Odom's arrival, UNLV had suffered through nine straight losing seasons.\nUggetti: The Alamo Bowl seems to always deliver an entertaining matchup and this year's game sets up for an offensive explosion with Oklahoma and Arizona suiting up in San Antonio. Despite the Sooners losing quarterback Dillon Gabriel to the transfer portal, the opportunity is there for freshman five-star prospect Jackson Arnold to show why he's the guy for the job next season. On the other sideline, Noah Fifita has done just that this season. The freshman stepped in following an injury to Jayden de Laura and immediately became one of the best quarterbacks in the conference, throwing for 2,515 yards and 23 touchdowns while leading the Wildcats to a 9-3 record. Between Fifita's rise and the potential emergence of Arnold, this will be a fun watch.\nHale: Florida State's frustration at being snubbed by the committee might be echoed by another soon-to-be ACC team, SMU. The Mustangs got the opposite treatment of FSU though. While the Seminoles were left out based on a \"best team\" qualification, Liberty grabbed the Group of 5's New Year's Six bid from the Mustangs based on its undefeated record. Was the committee talking out both sides of its mouth? Of course! But the upshot is SMU still gets an interesting matchup in the Fenway Bowl against its soon-to-be conference mate, Boston College. Both offenses can put up points, and who doesn't love going to (checks notes) Boston in (checks notes again) December?\nKyle Bonagura: How about a little love for New Mexico State? The Aggies won 10 games for the first time in over 60 years as coach Jerry Kill, in Year 2, has somehow breathed life into a program that managed just eight combined wins in the four seasons before his arrival. Their first appearance in the Isleta New Mexico Bowl comes against a Fresno State team that, despite some tough losses down the stretch, has traditionally been one of the best Group of 5 programs. A win against the Bulldogs, who will be without their coach, Jeff Tedford, as he deals with a health issue, would tie NMSU's school record for wins.\nRittenberg: The fact that none of you picked the Pop-Tarts Bowl is absurd and disappointing. Even if the matchup wasn't interesting, we're talking about Pop-Tarts here. The winner gets to EAT the Pop-Tart mascot! The matchup is pretty good, too, as NC State aims for the elusive 10th win against Kansas State, in a Top 25 matchup. Wolfpack quarterback Brennan Armstrong will cap an up-and-down season, while Kansas State should counter with Avery Johnson, its quarterback of the future. NC State hasn't won 10 games since 2002, when Philip Rivers was its quarterback. Kansas State aims for consecutive seasons of nine or more wins for the first time since 2011 and 2012. But Pop-Tarts, guys. Enough said.\nWhat player, team or coach has the most to prove in a bowl?\nBaumgartner: J.J. McCarthy and Michigan have had a year to stew over what happened last season against TCU in the CFP. McCarthy threw two pick-sixes in the 51-45 loss to the Horned Frogs, but has since has had a solid junior season in Ann Arbor, throwing for 2,630 yards and 19 touchdowns for the three-time reigning Big Ten champions. But the standard at Michigan is higher than conference titles. The collective reaction to the drawing of Alabama in the Rose Bowl during the Wolverines' watch party on Sunday was telling. They know they've got their work cut out for them with Nick Saban and company. But it provides the Wolverines a tremendous chance and opportunity to finally put those demons away for good if they can knock off the Tide and take a step they couldn't a year ago and find themselves 60 minutes away from their first undisputed national championship since 1948. -- Baumgartner", "source_domain": "www.espn.co.uk", "text": null, "title": "The games and players we're most excited to watch this bowl season", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/college-football/story/_/id/39055498/bowl-season-best-games-players-storylines-watch-2023"}