{"authors": [], "date_download": "2024-02-05 15:29:37", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "All the conflict in Gaza is achieving is civilian misery, and the US can stop it at any time\r\n\r\n\r\nAfter a seven-day lull in the war between Isr", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274056132%2Fisrael-cant-defeat-hamas-in-battle-so-whats-next.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1701850435.jpg", "language": "en", "localpath": null, "maintext": "All the conflict in Gaza is achieving is civilian misery, and the US can stop it at any time\nAfter a seven-day lull in the war between Israel and the Palestinian armed groups in Gaza, the resumption of hostilities has been given another green light from Washington. Having failed to lead its Israeli allies towards military victory, the US is permitting a dangerous escalation and rejects a peaceful solution that will prevent further civilian suffering.\nJust minutes after the departure of US Secretary of State, Antony Blinken, from Palestine/Israel, the war in Gaza resumed, with a large aerial onslaught on Palestinian civilian infrastructure resulting in the deaths of nearly 200 civilians. The White House spokesperson John Kirby announced continued support for Israel's \"right and responsibility to go after Hamas,\" but to what end is unclear. As the likes of former Israeli Prime Minister Ehud Barak admits that Hamas is far from falling apart, it begs the question: what really is the point of this war?\nFollowing six weeks of war that resulted in likely over 20,000 Palestinian deaths, the Israeli military has failed to produce any evidence that it has made a significant dent on the military capabilities of Hamas and the other Palestinian armed groups in the besieged coastal enclave. While Israel forced its way into the major hospitals in northern Gaza, claiming that Hamas was using the sites as bases and command-and-control centers, the evidence produced by the Israel Defense Forces (IDF) does not support these allegations. The US government backed the idea that a command node had existed at the Shifa Hospital, and when the Israeli forces entered the hospital compound they presented weapons they claimed to have found there, as well as an empty tunnel. Any such images released to the public are curated and edited by the Israeli army, but if independently verified, they could serve as evidence of militant presence - still, not proof of a control center or node. Little of note was discovered in other hospitals, and American claims of having solid intel that confirms Israeli claims is dubious, considering previous public statements such as US President Joe Biden's words about having seen \"confirmed pictures of terrorists beheading children\" which the White House later had to walk back.\nAt the start of this war, Israeli Prime Minister Benjamin Netanyahu announced that his government was going to \"crush Hamas,\" a goal that the US government backed publicly. Yet, Hamas has managed to not only inflict the largest blow against Israel in its history, but has also defended Gaza on the ground with countless documented cases of success against Israeli forces. The whole world is now talking about the formation of a Palestinian State, an idea that had been all but abandoned in favor of unconditional normalization agreements between Arab States and Israel, prior to the war. In addition to this, one of the predictable outcomes of the Israeli war on Gaza, has been a tremendous uptick in support for Hamas throughout the occupied territories. In the Middle East and throughout the Muslim World, Hamas militants have become heroes and are widely viewed as a valiant national resistance.\nThe Saudi-Israeli normalization deal, which the Biden administration's Middle East policy revolved around, is dead in the water at this time as Riyadh moves closer to Tehran. According to Israeli polling data, Benjamin Netanyahu is only trusted by 4% of Israelis, while the most trusted national figure was recorded to be Israeli military spokesperson Daniel Hagari. Hagari, despite being trusted by Israelis, was turned into the \"there is a list guy\" and an online meme, after presenting a video in which he claimed a regular Arabic calendar named \"terrorists\". That video, in which he referred to the list, was supposed to show evidence of Hamas keeping hostages at the Rantisi Children's Hospital.\nAt least 10 countries have either withdrawn ambassadors from, or suspended ties with, Israel. All this as the largest pro-Palestinian protests to have ever taken place in the West continue to occur in capital cities like London and Washington DC. This, combined with a considerable drop in Joe Biden's approval rating, all spell disaster for the US-supported war in Gaza.\nThe White House claims that it is putting certain restrictions on the Israeli army as it plans to invade the south of Gaza, but in the same breath offers unconditional support for Israel's actions. At no point has the US government taken any responsibility for what has happened since October 7, there has been no apology for their lies, no change in strategy and no acknowledgement in the role that Washington has played in creating the situation on the ground in Gaza that facilitated the Hamas attack.\nThe real question now is: Where do we go from here? Israel aimlessly fights in Gaza and continues to kill thousands of Palestinian civilians, there is no sign of a Hamas defeat on the horizon and the humanitarian situation, which is described as \"the worst ever\" by UN Relief Chief Martin Griffiths, is further deteriorating. While these elements are all to be taken seriously, there is also the specter of a regional war erupting in the event that the Israeli attack escalates against Gaza. Lebanese Hezbollah is currently engaged in frequent battles along the Lebanese border and has been expanding the scope of its attacks on Israeli military targets.\nThe prisoner exchanges which took place between Israel and Hamas proved that the Palestinian group was capable of being engaged diplomatically. The exchange also worked to expose to the world that Israel was also holding women and children captive without any charges. Israeli civilian captives who were released, the majority of whom were filmed smiling, shaking the hands of and thanking Hamas fighters upon their releases, have been blocked from speaking to the media about their experiences directly. On the other hand, Palestinian women and children recounted abuse, torture and humiliation that they had suffered at the hands of their Israeli jailers. This represented another public-relations debacle for the Israeli government, who came off looking more guilty than Hamas.\nThe US government is in the driver's seat of the war. It has the power to end the conflict at any time but continues to prolong this disaster. During the seven-day pause in hostilities, nothing shifted in Israel's favor to make its victory possible. There can be no military solution to the war in Gaza, the US must recognise that this conflict will never end until the Palestinian people are granted justice and freedom. For 75 years the governments of the collective West have ignored the suffering of the Palestinian people, they have never been objective peace-brokers. Violence begets violence and hate begets hate, it is not possible to simply murder the Palestinians into submission. Even if Hamas were to be defeated, there will be more groups that emerge to take revenge for their fallen and fight for statehood in the future. If the international community comes together, this cycle can be broken, but it is going to take courage.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Israel cant defeat Hamas in battle, so what's next", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274056132/israel-cant-defeat-hamas-in-battle-so-whats-next"}