{"authors": ["Reporter"], "date_download": "2024-02-05 15:29:39", "date_modify": "None", "date_publish": "2023-12-08 10:46:19", "description": "The human rights group's investigation accuses Israel of using US-made guidance weapons in two illegal strikes on homes filled with Palestinian families.", "filename": "https%3A%2F%2Fwww.huffingtonpost.co.uk%2Fentry%2Famnesty-report-says-israel-used-us-weapons-to-kill-dozens-of-gaza-civilians_uk_6572f2e4e4b08a047529ea8b.json", "image_url": "https://img.huffingtonpost.com/asset/6572495427000037009c3274.jpeg?cache=IgMKpG9FDP&ops=1200_630", "language": "en", "localpath": null, "maintext": "LOADING ERROR LOADING\nA damning new Amnesty International investigation says that Israel used US-made weapons in at least two airstrikes that killed dozens of Palestinian civilians in Gaza ― one of the first major reports directly linking US munitions to Israel’s mass killing of civilians over the region’s past two months of violence.\nIn the report released Tuesday, the human rights group said it found that Israeli forces used Joint Direct Attack Munitions (JDAMs), a bomb-guiding system, in two illegal strikes on homes full of families, killing 43 civilians: 19 children, 14 women and 10 men. Both attacks were in the central Gaza neighbourhood of Deir al-Balah.\nAdvertisement\nAccording to Amnesty International, there was no evidence that there were “any military objectives at the sites” or that any of the people in the buildings were “legitimate military targets.” This has led the group to accuse Israel of using US weapons to carry out direct or indiscriminate attacks on Palestinian civilians, which would be an international humanitarian violation, which Amnesty said should be investigated as war crimes.\n“Two families have been decimated in these strikes, further proof that the Israeli military is responsible for unlawfully killing and injuring civilians in its bombardment of Gaza,” Amnesty Secretary General Agnés Callamard said in a statement Tuesday.\nA spokesperson for the Israel Defense Forces told CNN that Amnesty’s report is “flawed, biased and premature.” Israeli authorities previously had friction with Amnesty when the organisation released a report accusing the government of engaging in apartheid against Palestinians.\n“Two families have been decimated in these strikes, further proof that the Israeli military is responsible for unlawfully killing and injuring civilians in its bombardment of Gaza.” - Agnés Callamard, secretary general of Amnesty International\nAdvertisement\nThe US government has served as a powerful financial and diplomatic ally to Israel, with many American leaders vocalising unconditional support for the nation ― particularly after October 7, when Hamas militants launched an assault on Israel that resulted in about 1,200 deaths and the taking of hundreds of hostages.\nIt is widely understood that Israel’s military uses US weaponry for both offensive and defensive purposes. But Amnesty’s report is one of the first investigations that directly connect an American munition to an attack on Gaza that resulted in mass civilian deaths.\nThe munition central to Amnesty’s report, the JDAM, is a “guidance tail kit that converts existing unguided free-fall bombs into accurate, adverse weather ‘smart’ munitions,” according to the US Air Force’s website.\nAt its most accurate, the JDAM system attached to a bomb will guide it to within 16 feet of the target “when GPS data is available,” the Air Force description said, or within about 100 feet soon after a high-quality siting from the aircraft.\nAdvertisement\nThe first JDAM strike in Amnesty’s report occurred on October 10 and killed 21 members of the al-Najjar family and three neighbours. Suleiman Salman al-Najjar, who survived the attack, told the group that his wife and four children were among those killed. The Boeing-made JDAM that hit the al-Najjar family home likely weighed 2,000 pounds, according to the group’s weapons experts and a “remote sensing analyst.”\n“I was shocked. I rushed home and saw a scene of utter destruction. I could not believe my eyes. Everybody was under the rubble. The house was completely pulverized. The bodies were reduced to shreds,” al-Najjar told Amnesty International.\n“Only the body of my son Nadim (20) was recovered whole. My baby girl, Safa (17 months), we only found her hand,” he continued. “Now, me and my two surviving sons live in a tent by the ruins of our home. Our lives have been destroyed in a moment. Our family has been destroyed. Something that was unthinkable is now our reality.”\nRelatives of dead Palestinians mourn at the Al-Aqsa Martyrs Hospital as the Israeli attacks continue in December in Deir Al-Balah, in the Gaza Strip. A report by Amnesty International says Israel used U.S. weapons to kill dozens of civilians in this neighborhood. Ashraf Amra/Anadolu via Getty Images\nThe second strike occurred on October 22, when Israeli forces bombed three houses belonging to the Abu Mu’eileq family. The attack killed 18 members of the family, including 12 children and six women, as well as a neighbour, according to the report. Amnesty estimates that the JDAM-guided bomb that killed much of the Mu’eileq family weighed at least 1,000 pounds.\nAdvertisement\n“We are three brothers married to three sisters, living among ourselves focused on our families and work and far from politics,” survivor Bakir Abu Mu’eileq told Amnesty. “We are doctors and scientists, and our focus is living a good life and building a good future for our children.”\n“We cannot understand why our homes were bombed. We have never had any problem previously. It is the same for our neighbors,” he said. “There is nobody armed or political here. Our lives, our families, were destroyed completely, obliterated. Why?”\nAmnesty said it found metal fragments of the JDAMs in the rubble of the destroyed homes and included photos of the fragments and rubble in its report.\n“The fact that US-made munitions are being used by Israeli military in unlawful attacks with deadly consequences for civilians should be an urgent wake-up call to the Biden administration. The US-made weapons facilitated the mass killings of extended families,” Callamard said in a statement.\n“To knowingly assist in violations is contrary to the obligation to ensure respect for international humanitarian law,” she said. “A state that continues to supply arms being used to commit violations may share responsibility for these violations.”\nAdvertisement\nA spokesperson for the State Department told HuffPost that the agency is reviewing Amnesty’s report and takes seriously any allegations of civilian harm. The department also reiterated that it has communicated with Israeli leaders its concerns about civilian protection and that Israeli forces must adhere to the laws of armed conflict.\nIn its report, Amnesty International implored the US government to follow its own policies, which include guidance to prevent arms transfers that risk aiding in civilian harm and in the violation of international humanitarian law. Last month, the White House requested to lift restrictions on Israel’s access to a stockpile of US weapons that the Pentagon placed in Israel for use in regional conflicts.", "source_domain": "www.huffingtonpost.co.uk", "text": null, "title": "Report Says Israel Used US Weapons To Kill Gaza Families", "title_page": null, "title_rss": null, "url": "https://www.huffingtonpost.co.uk/entry/amnesty-report-says-israel-used-us-weapons-to-kill-dozens-of-gaza-civilians_uk_6572f2e4e4b08a047529ea8b"}