{"authors": [], "date_download": "2024-02-05 15:29:44", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Click to expand Image Flag of Bahrain in Sakhir, March 2, 2023. 2023 Jakub Porzycki/NurPhoto via AP Photo (Beirut) - A Bahraini court has sentenced 13 people to prison after an unfair mass trial marred with due process violations and torture allegations, Human Rights Watch and the Bahrain Institute for Rights and Democracy (BIRD) said today. The convictions are part of an ongoing wave of Bahraini authorities' violations of free expression, assembly, and due process. The appellate court is scheduled to hear an appeal on December 10, 2023, during which it should credibly investigate the defendants' allegations of torture, which the lower court did not properly investigate. \"The court, confronted with allegations of torture, did not investigate them, and instead relied on testimony by security forces, some of whom are alleged to have committed the abuses,\" said Sayed Ahmed al-Wadaei, advocacy director at BIRD. \"The appellate court should properly investigate torture claims prior to the December 10 trial.\" In the mass trial of 65 defendants, Bahrain's First Criminal Court found 13 defendants guilty on September 26, on charges of using force against prison guards and vandalism of prison property, following a peaceful demonstration organized by inmates in Jau prison in April 2021. The other 52 defendants were acquitted. In addition to significant due process violations, including the denial of prisoners' rights to attend their own hearing, the court did not properly investigate the defendants' claims of torture and excessive use of force by prison guards. The April 2021 demonstrations were in response to the April 6 death of an inmate, Abbas Malallah, jailed for his participation in the 2011 pro-democracy protests, with his death most likely due to medical negligence. According to an investigation by Americans for Democracy and Human Rights in Bahrain (ADHRB), prison authorities had denied Malallah adequate health care and delayed providing him medical attention after he became unconscious in his cell the night of his death. In response, some inmates in the three buildings of Jau Prison refused to return to their cells, demanding accountability for Malallah's death and access to adequate health care and regular communication with their families. Prison authorities then confined all of the prisoners in the three buildings who were not taking part in the sit-in protest in the corridor to their cells for over 10 days. On April 17, prison officers, along with special riot police forces, entered the three buildings and used excessive force against protesting inmates. The security forces also forced entry into a locked cell with prisoners who had not been involved in the protest, and used sound grenades and pepper spray against them, based on accounts by prisoners to the Public Prosecution Office. A spokesperson for the UN High Commissioner for Human Rights, Marta Hurtado, said that special police forces used \"unnecessary and disproportionate force\" to break apart a \"peaceful sit-in,\" and that Bahraini authorities should investigate the excessive use of force. BIRD and Human Rights Watch analyzed over 3,000 pages of court documents to assess the defendants' torture allegations. Hasan Ali al-Shwaikh, one of the 13 people convicted, said in a hand-written account submitted to the court that, \"Inmates in my [locked] cell told the police to stop beating the inmates because they were demanding their rights. At the time, we were surprised that the riot police came and opened the door of our cell and threw five sound grenades inside the cell, and then they entered, and pepper sprayed us.\" Saeed Abdel Imam Helal, an inmate assaulted by prison guards, described the beatings in an interview with the Public Prosecution Office on April 25, 2023. Based on the transcripts from the interview, he said, \"police came [into the cell] and beat me with batons above my left eye and I fell on the ground and lost consciousness. When I woke up at the prison clinic ... they informed me that I had a broken bone above my left eye.\" Sayed Alawi al-Wadaei said in a hand-written testimony submitted to the court on July 25, 2023: \"[prison guards] severely beat us with sticks and dragged us outside [the cell] ... they insulted us and our religion, spitting in our faces and one of them put his shoe in my mouth.\" The majority of prisoners charged in the trial detailed abuses during an April 17 transfer to another prison building, known as Building 15. In the court documents, several testified that an officer repeatedly used metal objects, including a pepper spray canister and a wheel wrench, to beat them. One prisoner, Yousif Ahmed Abdullah, said that one officer hit him on the head 16 times, resulting in severe head injuries that the authorities failed to treat. Medical reports submitted to the court by physicians from the Public Prosecution Office were consistent with Abdullah's account of his injuries. Prisoners were then held incommunicado for 19 days in Building 15, and were further abused, including the denial of medical treatment, according to court testimonies. In 2021, Bahrain's Special Investigation Unit (SIU) and the Interior Ministry Ombudsman initiated separate investigations into the incidents surrounding the protest and the response by the prison authorities. The SIU investigation has never been released, and authorities have provided no details regarding where the investigation stands. The Ombudsman's investigation was carried out immediately after the events of April 17, 2021, and was released on April 22, stating that the allegations were false. The UN Committee Against Torture has also held that both the Ombudsman and the SIU are \"not effective given that complaints ultimately pass through the Ministry of the Interior.\" The Ministry of Interior is itself implicated in the torture and abuse of prisoners, Human Rights Watch and BIRD have found. Both bodies failed to carry out prompt, impartial, and effective investigations into the allegations of torture and ill-treatment in accordance with the Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, which Bahrain is a state party to. The trial was marred by due process violations. During the first two hearings and on the day of the verdict, none of the 62 inmates held at Jau Prison were brought to court, violating the defendants' right to attend their own hearings. The other three inmates, who were no longer held at Jau Prison, were able to attend. In its final judgment, the court relied solely on 2021 interviews by the Public Prosecution Office and denied defense lawyers' request to cross examine the officers who allegedly abused the inmates. The court stated in its final verdict that \"given that the court had formed its conviction based on the case papers and the corroborative evidence, it deemed that hearing witness statements was unnecessary.\" Human Rights Watch and BIRD have reported extensively on violations of due process rights in Bahrain, including sham trials where defendants were sentenced to death. These trials were plagued with due process violations and based solely or primarily on confessions obtained through torture or ill-treatment. International and Bahraini law guarantees defendants' right to a fair trial, including to legal representation at all stages of the proceedings and to call and cross-examine witnesses. The United States and the United Kingdom in particular have increased their diplomatic and economic support to Bahrain in recent years, despite Bahrain's widespread violations of human rights, and have contributed to whitewashing these violations through statements that have applauded Bahrain on their human rights record. \"Through their increased support for Bahrain, the United States, United Kingdom, and other states are giving Bahrain's autocratic government the green light to continue its rampant violations of free assembly and due process,\" said Niku Jafarnia, Bahrain and Yemen researcher at Human Rights Watch. \"These countries should use their diplomatic standing to ensure that Bahraini authorities respect due process rights and end their abusive treatment of prisoners.\"", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274056039%2Fbahrain-13-people-convicted-in-unfair-mass-trial.json", "image_url": "https://cdn.bignewsnetwork.com/ODljMjVlMWItYjJ.jpg", "language": "en", "localpath": null, "maintext": "(Beirut) - A Bahrain i court has sentenced 13 people to prison after an unfair mass trial marred with due process violations and torture allegations, Human Rights Watch and the Bahrain Institute for Rights and Democracy (BIRD) said today.\nThe convictions are part of an ongoing wave of Bahraini authorities' violations of free expression, assembly, and due process. The appellate court is scheduled to hear an appeal on December 10, 2023, during which it should credibly investigate the defendants' allegations of torture, which the lower court did not properly investigate.\n\"The court, confronted with allegations of torture, did not investigate them, and instead relied on testimony by security forces, some of whom are alleged to have committed the abuses,\" said Sayed Ahmed al-Wadaei, advocacy director at BIRD. \"The appellate court should properly investigate torture claims prior to the December 10 trial.\"\nIn the mass trial of 65 defendants, Bahrain's First Criminal Court found 13 defendants guilty on September 26, on charges of using force against prison guards and vandalism of prison property, following a peaceful demonstration organized by inmates in Jau prison in April 2021. The other 52 defendants were acquitted. In addition to significant due process violations, including the denial of prisoners' rights to attend their own hearing, the court did not properly investigate the defendants' claims of torture and excessive use of force by prison guards.\nThe April 2021 demonstrations were in response to the April 6 death of an inmate, Abbas Malallah, jailed for his participation in the 2011 pro-democracy protests , with his death most likely due to medical negligence. According to an investigation by Americans for Democracy and Human Rights in Bahrain (ADHRB), prison authorities had denied Malallah adequate health care and delayed providing him medical attention after he became unconscious in his cell the night of his death. In response, some inmates in the three buildings of Jau Prison refused to return to their cells, demanding accountability for Malallah's death and access to adequate health care and regular communication with their families.\nPrison authorities then confined all of the prisoners in the three buildings who were not taking part in the sit-in protest in the corridor to their cells for over 10 days.\nOn April 17, prison officers, along with special riot police forces, entered the three buildings and used excessive force against protesting inmates. The security forces also forced entry into a locked cell with prisoners who had not been involved in the protest, and used sound grenades and pepper spray against them, based on accounts by prisoners to the Public Prosecution Office. A spokesperson for the UN High Commissioner for Human Rights, Marta Hurtado, said that special police forces used \"unnecessary and disproportionate force\" to break apart a \"peaceful sit-in,\" and that Bahraini authorities should investigate the excessive use of force.\nBIRD and Human Rights Watch analyzed over 3,000 pages of court documents to assess the defendants' torture allegations.\nHasan Ali al-Shwaikh, one of the 13 people convicted, said in a hand-written account submitted to the court that, \"Inmates in my [locked] cell told the police to stop beating the inmates because they were demanding their rights. At the time, we were surprised that the riot police came and opened the door of our cell and threw five sound grenades inside the cell, and then they entered, and pepper sprayed us.\"\nSaeed Abdel Imam Helal, an inmate assaulted by prison guards, described the beatings in an interview with the Public Prosecution Office on April 25, 2023. Based on the transcripts from the interview, he said, \"police came [into the cell] and beat me with batons above my left eye and I fell on the ground and lost consciousness. When I woke up at the prison clinic ... they informed me that I had a broken bone above my left eye.\"\nSayed Alawi al-Wadaei said in a hand-written testimony submitted to the court on July 25, 2023: \"[prison guards] severely beat us with sticks and dragged us outside [the cell] ... they insulted us and our religion, spitting in our faces and one of them put his shoe in my mouth.\"\nThe majority of prisoners charged in the trial detailed abuses during an April 17 transfer to another prison building, known as Building 15. In the court documents, several testified that an officer repeatedly used metal objects, including a pepper spray canister and a wheel wrench, to beat them. One prisoner, Yousif Ahmed Abdullah, said that one officer hit him on the head 16 times, resulting in severe head injuries that the authorities failed to treat. Medical reports submitted to the court by physicians from the Public Prosecution Office were consistent with Abdullah's account of his injuries.\nPrisoners were then held incommunicado for 19 days in Building 15, and were further abused, including the denial of medical treatment, according to court testimonies.\nIn 2021, Bahrain's Special Investigation Unit (SIU) and the Interior Ministry Ombudsman initiated separate investigations into the incidents surrounding the protest and the response by the prison authorities. The SIU investigation has never been released, and authorities have provided no details regarding where the investigation stands. The Ombudsman's investigation was carried out immediately after the events of April 17, 2021, and was released on April 22, stating that the allegations were false.\nThe UN Committee Against Torture has also held that both the Ombudsman and the SIU are \"not effective given that complaints ultimately pass through the Ministry of the Interior.\" The Ministry of Interior is itself implicated in the torture and abuse of prisoners, Human Rights Watch and BIRD have found.\nBoth bodies failed to carry out prompt, impartial, and effective investigations into the allegations of torture and ill-treatment in accordance with the Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, which Bahrain is a state party to.\nThe trial was marred by due process violations. During the first two hearings and on the day of the verdict, none of the 62 inmates held at Jau Prison were brought to court, violating the defendants' right to attend their own hearings. The other three inmates, who were no longer held at Jau Prison, were able to attend. In its final judgment, the court relied solely on 2021 interviews by the Public Prosecution Office and denied defense lawyers' request to cross examine the officers who allegedly abused the inmates.\nThe court stated in its final verdict that \"given that the court had formed its conviction based on the case papers and the corroborative evidence, it deemed that hearing witness statements was unnecessary.\"\nHuman Rights Watch and BIRD have reported extensively on violations of due process rights in Bahrain, including sham trials where defendants were sentenced to death. These trials were plagued with due process violations and based solely or primarily on confessions obtained through torture or ill-treatment.\nInternational and Bahraini law guarantees defendants' right to a fair trial, including to legal representation at all stages of the proceedings and to call and cross-examine witnesses. The United States and the United Kingdom in particular have increased their diplomatic and economic support to Bahrain in recent years, despite Bahrain's widespread violations of human rights, and have contributed to whitewashing these violations through statements that have applauded Bahrain on their human rights record.\n\"Through their increased support for Bahrain, the United States, United Kingdom, and other states are giving Bahrain's autocratic government the green light to continue its rampant violations of free assembly and due process,\" said Niku Jafarnia, Bahrain and Yemen researcher at Human Rights Watch. \"These countries should use their diplomatic standing to ensure that Bahraini authorities respect due process rights and end their abusive treatment of prisoners.\"\nSource: Human Rights Watch", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Bahrain: 13 People Convicted in Unfair Mass Trial", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274056039/bahrain-13-people-convicted-in-unfair-mass-trial"}