{"authors": ["Shannon Mcguigan"], "date_download": "2024-02-05 15:15:37", "date_modify": "None", "date_publish": "2024-01-26 17:47:46", "description": "Valdo Calocane, 32, fatally stabbed three people in Nottingham, A judge told Calocane that he would likely spend the rest of his life detained at Ashworth High Secure Hospital.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13010925%2FValdo-Calocane-know-Nottingham-attacks.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/26/16/80447117-0-Valdo_Calocane_fatally_stabbed_19_year_old_students_Barnaby_Webb-a-65_1706288334766.jpg", "language": "en", "localpath": null, "maintext": "Valdo Calocane, 32, fatally stabbed 19-year-old students Barnaby Webber and Grace O'Malley-Kumar before killing his third victim, Ian Coates - a 65-year-old school caretaker four months from retirement - and stealing his white van.\nHe has pleaded guilty to three counts of manslaughter by diminished responsibility and three more of attempted murder.\nOn January 25 Mr Justice Turner told Calocane that he would likely spend the rest of his life detained at Ashworth High Secure Hospital.\nHere is everything you need to know about the Nottingham attacks killer so far.\nValdo Calocane fatally stabbed 19-year-old students Barnaby Webber and Grace O'Malley-Kumar at 4am on June 13 before killing school caretaker Ian Coates\nMr Coates was a grandfather and a much-loved caretaker at a local school. Grace, 19, was a talented sportswoman who had played hockey for England and his third victim. Barnaby Webber, from Taunton in Somerset, was a keen cricketer and 'an extraordinary 'ordinary' person', his family said\nMr Justice Turner told Calocane that he would be detained in Ashworth High Secure Hospital 'very probably for the rest of your life'\nWhere is Valdo Calocane from?\nValdo Calocane, who also calls himself Adam Mendes, was born on September 4 1991 in Guinea-Bissau.\nAt the age of three, his family made the move to the Portuguese island of Madeira.\nFive years later - when he was eight-years-old - they moved again to Portugal's capital, Lisbon.\nIn 2007. they eventually migrated to the UK when Calocane was 16-years-old.\nWhat brought Calocane to Nottingham?\nAfter working as a cleaner and a labourer, Calocane decided to pursue a degree at the University of Nottingham in mechanical engineering.\nIn June 2022, at the age of 30, he obtained his mechanical engineering degree.\nHe had previously opted not to undertake A-levels, because he believed he would not be able to get the grades required, the court heard.\nHe was residing in a student flat in Derwent Way, however he was later evicted because he assaulted one of his flatmates, the court was told.\nHe also did a brief stint at a distribution centre located near East Midlands airport - Arvato Supply Chain Solutions.\nSix months prior to the killings, he had been residing in a house share in Burford Road in Nottingham.\nYour browser does not support iframes.\nCalocane's mental health problems first began in 2019 according to the defence (Pictured: A sketch of Calocane appearing in court for his sentencing)\nWhen did Calocane's mental health issues start?\nAccording to defense barrister Peter Joyce KC, Calocane's metal health illness first began in 2019.\nHis brother, Elias, shared with police that he had first noticed his sibling's mental health issues, whilst he was undertaking his mechanical engineering degree.\nCalocane was under the belief that he was being monitored by MI6 and by housemates.\nHe also believed that his family was in jeopardy.\nThe defendant was prescribed anti-psychotic medication but would eventually stop taking it.\nProsecution allege this contributed to the deterioration of his mental health.\nIn May 2021, his family became increasingly concerned about Calocane's mental state.\nElias said his brother had been hearing voices stating that his relatives would die.\nOn May 31 2021, Calocane ventured to the MI5 headquarters to try and prevent them from 'controlling' him.\n'That's not a concoction by him,' Mr Joyce said.\n'There is a photograph taken by their systems at Thames House, saying 'please arrest me' - effectively 'stop controlling me'.'\nWere mental health services aware of Calocane?\nNottinghamshire Police stated that they had 'previously engaged' with the defendant on several instances between 2020 and 2022.\nThey said that these occasions happened 'mostly while supporting' their 'colleagues in the NHS'.\nOn May 23, 2023, Calocane went to A&E as he believed he was suffering from a heart attack.\nThe court heard that when he returned home, he attempted to gain entry into another flat in his building by knocking the door down.\nFollowing this he was arrested for criminal damage.\nWhilst he was in custody psychiatric services also carried out an assessment on him.\nThey came to the conclusion that while Calocane was psychotic he was a low risk to others.\nPsychiatric services said Calocane reccomended that he be sent for a referral with a crisis team.\nAn hour after he was released without charged, he broke down another door in his building.\nThe second time he was arrested for criminal damage, he was re-evaluted and detained under the Mental Health Act.\nNottinghamshire Police said they had engaged with Calocane on multiple occasions when supporting their colleagues in the NHS (pictured: Calacone pictured in the dock on November 28, 2023)\nOn May 25, 2020 was placed under the care of psychiatric services at Highbury Hospital.\nHe was given anti-psychotic medication, which he was instructed to continue taking for up to nine months after he was discharged on June 17, 2020.\nThe court was told a month after he was placed into Highbury Hospital once again after knocking down a door into another flat in his building.\nAfter this incident he was managed in the community and his medication dose was upped.\nDuring a home visit in August 2021, Calocane confessed to medics that he was no longer taking his anti-psychotic medication.\nFollowing this, he dodged contact with the community mental health team.\nDue to this, police became increasingly involved, obtaining a warrant to enter his home and detain him under the Mental Health Act.\nPolice enacted the warrant on September 3 2021 and whilst journeying to Highbury Hospital, Calocane assaulted a police officer.\nHe went back to his flat after being released from inpatient services.\nHowever he was readmitted following 'an altercation with a flatmate' in January 2022, according to the prosecution.\nAfter two assessments, he was once again admitted to the hospital on January 27 2022.\nHe was later discharged on February 24 2022 into the care of a community team.\nColocane was charged with assault after previously by beating of an emergency worker, after his altercation with a police officer in September.\nCalocane had been re-admitted into Highbury Hospital multiple times (Pictured: Calocane being arrested taken away for questioning by two officers)\nHe had stopped taking his anti-psychotic medication - a factor which led to the deterioration of his mental state according to the prosecution (Pictured; Calocane - highlighted bottom right - is seen arriving at Nottingham Railway station a few hours before the attacks on June 13 2023)\nMore than twelve months after the assault, Colocane was required to stand at Magistrates Court on September 22, 2022 - however he did not appear.\nA warrant was later issued for his arrest, one that was still outstanding when the Nottingham attacks took place.\nRob Griffin, Nottinghamshire Police Assistant Chief Constable, said: 'I have personally reviewed this matter and we should have done more to arrest him.\n'However, because of the circumstance prevailing, at the time of the alleged assault, in my opinion it is highly unlikely that he would have received a custodial sentence.\n'Of course, an arrest might have triggered a route back into mental health services, but as we have seen from his previous encounters with those services, it seems unlikely that he would have engaged in this process.'\nDoes Calocane have any other convictions?\nAs well as the assault of his housemate and a police officer, Calocane also attacked two of his former co-workers.\nOn May 5, only four days into his job at Arvato Supply Chain solutions and only six weeks before the Nottingham attacks - Calocane assaulted two of his colleagues.\nThe prosecution did not confirm the severity of the attacks or whether the police had been notified.\nProsecution told the court that Calocane had no previous convictions when the Nottingham attacks happened.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Valdo Calocane: Everything we know about the Nottingham attacks killer so far", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13010925/Valdo-Calocane-know-Nottingham-attacks.html?ns_mchannel=rssns_campaign=1490ito=1490"}