{"authors": ["Rachael Bunyan"], "date_download": "2024-02-05 15:29:46", "date_modify": "None", "date_publish": "2023-12-07 08:32:42", "description": "US Senate Republicans have given Vladimir Putin 'the greatest gift he could hope for' by blocking a £50billion package of wartime funding for Ukraine, President Joe Biden said.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12836251%2FUS-Republicans-Putin-greatest-gift-hope-BLOCK-50billion-Ukraine-aid-package-devastating-blow-Zelensky.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/07/08/78680243-0-image-m-24_1701937935215.jpg", "language": "en", "localpath": null, "maintext": "US Senate Republicans have given Vladimir Putin 'the greatest gift he could hope for' by blocking a £50billion package of wartime funding for Ukraine, President Joe Biden said.\nBiden had pleaded with Republicans yesterday for a fresh infusion of military aid for Ukraine, warning that a victory for Russia over Ukraine would leave Moscow in a position to attack NATO allies and could draw US troops into a war.\nBut hours later, Senate Republicans defiantly voted to block the £50.3billion ($61bn) of funding for Ukraine from advancing, in a devastating blow to Volodymyr Zelensky. That was part of a wider £87billion package ($110bn) of wartime funding for Israel as well as other national security priorities.\nBiden lashed out at Republicans for the move, saying they are 'willing to literally kneecap Ukraine on the battlefield' and give Putin 'the greatest gift he could hope for'.\n'They're willing to literally kneecap Ukraine on the battlefield and damage our national security in the process,' a furious Biden said earlier. He had warned that without the desperately needed aid funding, Ukraine's military could be overrun.\n'If Putin takes Ukraine, he won't stop there,' Biden said earlier. Putin will attack a NATO ally, he predicted, and then 'we'll have something that we don't seen and that we don't have today: American troops fighting Russian troops,' Biden added.\nAnd within hours of the vote, a smug Kremlin said Russia hopes the US Congress will block future aid to Ukraine. Moscow also accused Biden of playing the Russian threat card in order to secure money.\nKremlin spokesman Dmitry Peskov said Biden wanted to 'continue burning taxpayers' money in the furnace of war'.\nPresident of Ukraine Volodymyr Zelensky and U.S. President Joe Biden walk to the Oval Office of the White House on September 21\nA tank T-64 drives by in Novoselivka Persha after driving out of Avdiivka, Ukraine on December 4\nUS Senate Republicans have given Vladimir Putin 'the greatest gift he could hope for' by blocking a £50billion package of wartime funding for Ukraine in a devastating blow to Volodymyr Zelensky\nPeskov accused the White House of demonising Russia and said that, if Washington were to stop backing Kyiv, all other Western countries would also turn away from it.\n'We can't let Putin win,' Biden said earlier, which also prompted an angry reaction from Moscow.\nRussia's RIA news agency quoted the Russian ambassador to the United States, Anatoly Antonov, as saying that Biden's comments on a potential U.S.-Russia conflict were 'provocative rhetoric unacceptable for a responsible nuclear power'.\nBiden did signal that he is open to working on the border policy changes Republican politicians want to see first.\nHe stressed that he is willing to 'make significant compromises on the border' if that is what it takes to get the package through the US Congress.\n'This cannot wait,' he said, adding that 'Republicans in Congress are willing to give Putin the greatest gift he could hope for'.\nRepublicans have argued the record numbers of migrants crossing the southern border pose a security threat because border authorities cannot adequately screen them.\nThey also say they cannot justify to their constituents sending billions of dollars to other countries while failing to address the border at home.\nIndeed, the continued delivery of US military and government aid to Ukraine is losing favour with a hard-right wing of Republican lawmakers and with some Americans amid Kyiv's much-anticipated stalling counteroffensive ahead of another winter.\nNearly half of the US public thinks the country is spending too much on aid to Ukraine, according to polling from The Associated Press-NORC Centre for Public Affairs Research\nUkrainian soldiers have been unable to make significant gains against Russian troops who are entrenched in captured territory during their counteroffensive and casualties on both sides - already in the hundreds of thousands - continue to mount.\nAnd with the prospect of a decisive military victory for Ukrainian troops quickly falling out of reach amid the grinding counteroffensive, the likelihood of another bloody summer next year remains dauntingly high.\nThe White House warned this week that the U.S. is running out of time and money to help Ukraine repel Russia's invasion.\nHowever, despite Biden's pleas and warnings about a global conflict involving NATO, Senate Republicans blocked his legislation that would have provided £50billion to Ukraine.\nUkrainian servicemen attend anti-sabotage drills, amid Russia's attack on Ukraine, in Chernihiv region, Ukraine, on December 5\nUkrainian servicemen of the 42nd Mechanised Brigade dig trenches during a field military exercise in the Donetsk region on 6 December\nUkrainian soldiers fire targets as Russia and Ukraine war continues in the direction of Avdiivka of Donetsk Oblast, Ukraine on December 1\nUkraine's counteroffensive has progressed at a much slower pace than anticipated when Western nations sent tanks and missiles to Ukraine, with Ukrainian troops struggling to dislodge Russian soldiers who are entrenched in captured. And this has meant Russia still controls nearly a fifth of Ukraine.\nUkrainian soldiers still fight on, determined to protect their land. But the situation is dire, with both suffering heavy losses with an estimated 100,000 casualties on each side.\nAnd since the counteroffensive began, Ukraine has advanced a mere ten miles. It lost 20 per cent of its battlefield weapons in the first two weeks of the operation.\nThis stalling counteroffensive - coupled with the fact that the world's attention is now on the Israel-Hamas war in the Middle East - has meant some have questioned whether Zelensky should consider signing a peace treaty with Putin.\nBut White House national security adviser Jake Sullivan said the US was sticking to its long-held position not to pressure Ukraine into negotiations with Russia.\n'That's going to have to be up to them. We're just going to keep fighting day in and day out to try to secure this money,' Sullivan said.\n'We're going to keep making the case that it would be a historic mistake for the United States to walk away from Ukraine at this moment and we believe that argument will ultimately penetrate and prevail,' he said.\nHe said Biden is prepared to have 'reasonable, responsible discussions to produce a bipartisan outcome on border policy and border sources.'\nLast month, military experts told MailOnline that despite there being a stalemate on the ground, Zelensky cannot sign a peace deal - in the short-term at least.\nCharlie Herbert, a former British Army major general who served in Afghanistan, said doing so would just freeze the 'murderous aspirations' of Putin rather than stopping them altogether.\n'As President Zelensky rightly fears, signing an agreement now only risks freezing the murderous aspirations of Putin, rather than curtailing them altogether,' Herbert said.\nBen Hodges, former Commander of US forces in Europe, agrees that there can be no peace deal now, explaining that Zelensky knows Putin 'cannot be trusted in any negotiation' and how Russia is 'playing a long game.'\nHodges told MailOnline: 'Zelensky has no desire to settle for anything with Putin.\n'He knows that Russia can't be trusted in any negotiation and that the Kremlin is playing the long game - hoping that the US and other Western nations will pressure Ukraine to consider a peace treaty.'\nAnd in Washington, there is wavering support to provide Ukraine with more aid - and the money is quickly running out.\nBy mid-November, the US Defense Department had used 97% of $62.3 billion (£49billion) in supplemental funding it had received and the State Department had used all of the $4.7 billion (£3.7billion) in military assistance funding it had been allocated, U.S. budget director Shalanda Young said this week.\nA U.S. official said Washington has less than $1 billion in 'replenishment authority.' This means that if Congress does not provide new funds to buy replacement equipment, the U.S., Ukraine and arms makers may have to take other steps to backfill stocks.\nBorder security with Mexico is a major issue weighing on the negotiations about Ukraine and Israel funding.\nHouse and Senate Republicans are backing renewed construction of a border wall, former President Donald Trump's signature goal, while deeming large numbers of migrants ineligible for asylum and reviving a controversial policy under which asylum seekers are told to remain in Mexico while their immigration case is heard.\nBiden said he was willing to make 'significant' compromises on the border issue but said Republicans will not get everything they want. He did not provide details.\n'This has to be a negotiation,' he said.\nBiden, who had discussed Ukraine in a virtual summit with G7 leaders earlier on Wednesday, said US allies are prepared to continue supporting Ukraine in its 22-month war to repel Russian invaders.\n'Extreme Republicans are playing chicken with our national security, holding Ukraine's funding hostage to an extreme partisan border policy,' said Biden.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US Republicans 'give Putin the greatest gift he could hope for' and BLOCK £50billion Ukraine aid package in devastating blow to Zelensky", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12836251/US-Republicans-Putin-greatest-gift-hope-BLOCK-50billion-Ukraine-aid-package-devastating-blow-Zelensky.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}