{"authors": ["Harriet Sherwood"], "date_download": "2024-02-05 15:29:47", "date_modify": "None", "date_publish": "2023-12-07 17:02:44", "description": "Twenty people killed in airstrikes that hit two homes in Rafah, a town to which IDF told Palestinians to flee", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F07%2Fisrael-pounds-250-gaza-targets-in-a-day-as-un-chief-warns-order-may-break-down.json", "image_url": "https://i.guim.co.uk/img/media/f4efde10a6db83bf67117dee22dc9ebc9adf8497/0_248_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c97c3be5c7d75b1932dfb630edf3d87a", "language": "en", "localpath": null, "maintext": "Israel’s military has continued its heavy bombardment amid intense fighting in Gaza as its war with Hamas hit the two-month mark and the resulting humanitarian crisis threatened a breakdown of public order.\nThe Israel Defense Forces (IDF) said they had struck about 250 targets in Gaza over a 24-hour period, ending on Thursday morning.\nIn a residential part of Rafah, a town on the southern border with Egypt where the IDF has told people to relocate to avoid areas likely to be bombed, about 20 people were killed in airstrikes that hit two homes. Women and children were among the dead, according to witnesses.\n“We live in fear every moment, for our children, ourselves, our families,” said Dalia Abu Samhadaneh, who is living in Rafah with her family after fleeing Khan Younis. “We live with the anxiety of expulsion.”\nShe is among 1.87 million people – more than 80% of the population of 2.3 million – who have fled their homes in the past two months, according to the UN. Many families have been displaced multiple times, and are living in tents and overcrowded makeshift shelters.\nMore than 17,000 people have been killed in Gaza, most of them women and children, and more than 46,000 wounded, according to the health ministry in the Hamas-run territory. Many more are trapped under rubble.\nAbout 350 Palestinians had been killed and 1,900 injured in the past 24 hours, the health ministry said on Thursday.\nAt the northern end of the Gaza Strip, there was heavy fighting in the Jabaliya refugee camp. The IDF said its troops raided a militant compound, killing “a number” of fighters and uncovering a network of tunnels. Al Jazeera said one of its journalists had lost 22 members of his family in a strike in Jabaliya.\nAccording to the IDF, 12 rockets were launched from the Mawasi zone on the Gaza coast on Wednesday. Israel has told Palestinians in Khan Younis to head to the area, out of the way of heavy bombardment and fighting on the ground. Israel accused Hamas of “using the civilians as a human shield”.\nIn a telephone call to the Israeli prime minister, Benjamin Netanyahu, Joe Biden on Thursday called again for more assistance to civilians in Gaza, the White House said.\nBiden “emphasised the critical need to protect civilians and to separate the civilian population from Hamas including through corridors that allow people to move safely from defined areas of hostilities”, the White House said.\nThe US president added that “much more assistance was urgently required across the board”.\nAs the UN secretary general, António Guterres, warned that public order was likely to “completely break down soon due to the desperate conditions” in Gaza, aid agencies said that deliveries of essential supplies had almost completely dried up since the ceasefire ended last Friday.\nOxfam said people were reduced to fighting over basic necessities such as food, water and fuel. Marta Valdés García, Oxfam’s humanitarian director, said: “The systemic, militarised chaos has overwhelmed the international humanitarian system … Israel’s so-called safe zones within Gaza are a mirage: unprotected, not agreed or trusted, not provisioned, and not accessible.\n“We fear that masses of terrified people will be forced beyond Gaza itself under the guise of ‘safety’. This would force the humanitarian system into an impossible choice between helping civilians and being complicit in their forced deportation.”\nDr Christos Christou, the international president of the medical charity Médecins Sans Frontières (MSF), said Gaza faced a catastrophe extending far beyond a humanitarian crisis.\nHe said: “It is a chaotic situation, and I’m extremely worried that very soon people will be in a mode of just trying to survive, which will come with very severe consequences.” He added that people were being “squeezed in a very small area. My teams on the ground keep saying to me that it is unbearable.”\nIsrael said it would open the Kerem Shalom crossing to Gaza to inspect humanitarian aid trucks for the first time since the outbreak of the war.\nThe UN aid chief, Martin Griffiths, said there were “promising signs” that the crossing, which carried more than 60% of the truckloads going into Gaza before the war, could be opened soon. “It would be the first miracle we’ve seen for some weeks, but would also be a huge boost to the logistical process and logistical base of a humanitarian operation,” he said.\nThe west has been pressing for the crossing to be reopened for more than a month to allow more aid into the Gaza Strip, but has met Israeli resistance.\nCol Elad Goren, from Israel’s Cogat military liaison to the Palestinians, did not give a date for the opening of the crossing, and said the crossing point would be used to increase the capacity to inspect aid trucks, but not to allow aid into Gaza directly.\n00:01:03 Protesters shut down UK arms factories producing Israeli fighter jet parts – video\nMeanwhile, four arms factories in the UK producing Israeli fighter jets were shut down by hundreds of trade unionists protesting under the banner “Workers for a Free Palestine”.\nEaton Mission Systems in Bournemouth, BAE Systems at Samlesbury Aerodrome in Lancashire, the L3Harris factory in Brighton and Hove and BAE Govan in Glasgow produce parts for the F-35 stealth combat aircraft currently being used by Israel to bombard Gaza.\nThe protesters included health workers, teachers, hospitality workers, academics and artists. They called for an end to arms sales to Israel and for the UK government to support a permanent ceasefire.\nThe protests were organised in coordination with workers in France, Denmark and the Netherlands, who also blockaded arms factories on Thursday.\nWorkers for a Free Palestine said: “Shutting down four factories across the UK today, along with several simultaneous blockades in Europe, are critical acts of solidarity, refusing to conduct business as usual in the face of Israel’s relentless bombardment of Gaza and ongoing genocide.\n“As the British government refuses to call for a ceasefire and directly supports Israel’s military attack, a rapidly growing movement of workers are clearly saying, ‘Not in our name.’”\nIn Lebanon, the government on Thursday said it would refer to the UN security council reports by Reuters and Agence France-Presse that showed that Israeli military fire had killed a Reuters journalist, Issam Abdallah, and wounded six others in south Lebanon on 13 October.\nThe Reuters investigation found that an Israeli tank crew killed Abdallah by firing two shells in quick succession from Israel while the group was filming cross-border shelling from a distance. An Israeli government spokesperson said he was not aware of the findings but denied that Israeli forces targeted non-combatants.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel pounds ‘250 Gaza targets in a day’ as UN chief warns order may break down", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/07/israel-pounds-250-gaza-targets-in-a-day-as-un-chief-warns-order-may-break-down"}