{"authors": [], "date_download": "2024-02-05 15:29:48", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Pentagon - U.S. forces killed five Iran-backed militants as they prepared to launch a drone attack in Iraq, as the number of attacks on U.S. forces in I", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274054711%2Fred-sea-attacks-raise-tensions-as-us-kills-5-in-iraq.json", "image_url": "https://cdn.bignewsnetwork.com/voa1701734709.jpg", "language": "en", "localpath": null, "maintext": "Pentagon - U.S. forces killed five Iran-backed militants as they prepared to launch a drone attack in Iraq, as the number of attacks on U.S. forces in Iraq and Syria rose to 76 since mid-October.\nPentagon Deputy Press Secretary Sabrina Singh told reporters Monday that U.S. forces saw the militants Sunday as they were beginning to launch an attack drone and fired a precision munition from a U.S. drone to take them out.\n\"We felt that ... it was going to be a threat to U.S. forces, and because we have the inherent right to self-defense we took action,\" she said.\nIranian-backed proxies launched two multi-rocket attacks against U.S. forces in eastern Syria over the weekend; one targeting Rumalyn Landing Zone and another targeting forces in Shadaddi. The attacks resulted in no casualties or damage to infrastructure.\n'Iran, we believe, is the ultimate party responsible' for attacks on ships transiting near Red Sea, national security adviser Jake Sullivan said Monday.\n'This is an issue for the entire world,' he added.\nThe latest violence in Iraq and Syria comes as Iranian-backed Houthi insurgents in Yemen hit three commercial ships in the Red Sea with missiles Sunday, in what could be a further escalation in a string of maritime attacks in the Middle East linked to the nearly two-month-old Israel-Hamas war.\n\"Houthi forces attacked multiple commercial vessels in the Red Sea,\" the Defense Department told VOA. \"The USS Carney lended aid in some circumstances and shot down Houthi drones that were headed in its general direction.\"\nAccording to U.S. Central Command, after the first ballistic missile hit the waters near M/V Unity Explorer, the USS Carney, a guided missile destroyer, responded and took out a drone heading in the direction of the two ships.\nLess than an hour later, M/V Unity Explorer was hit by a Houthi missile, causing minor damage. While the USS Carney was responding to the ship's distress call, Houthis fired another drone at the ships that was shot down by the Carney crew.\nA few hours later, missiles launched from Yemen hit two more commercial ships, the M/V Number 9 and the M/V Sophie II, damaging both vessels. While responding to the Sophie II's distress call, USS Carney shot down another drone heading in its direction.\nSingh said the Pentagon assessed the Carney was not the target of any of the attacks, but when pressed by VOA, she acknowledged that this was an initial assessment and the Pentagon had not ruled out the possibility that the Carney might have been a drone target.\n\"It came close enough that the commander of the ship felt that it was a threat and needed to engage and shoot down that drone,\" she said.\nSingh added that the attacks were \"very concerning\" but would not say how or whether the U.S. would respond. In 2016, the U.S. launched Tomahawk cruise missiles that destroyed three coastal radar sites in Houthi-controlled territory to retaliate for missiles being fired at U.S. Navy ships.\nA Houthi military spokesperson, Brigadier General Yahya Saree, claimed responsibility for the attacks, saying the rebels hit one vessel with a missile and another with a drone while in the Bab el-Mandeb Strait that links the Red Sea to the Gulf of Aden.\n'The Yemeni armed forces continue to prevent Israeli ships from navigating the Red Sea [and Gulf of Aden] until the Israeli aggression against our steadfast brothers in the Gaza Strip stops,' Saree said. 'The Yemeni armed forces renew their warning to all Israeli ships or those associated with Israelis that they will become a legitimate target if they violate what is stated in this statement.'\nSaree also identified the first vessel hit as the Unity Explorer, which is owned by a British firm that includes Dan David Ungar, who lives in Israel, as one of its officers. The Houthi spokesperson said the second hit was a Panamanian-flagged container ship called Number 9, which is linked to Bernhard Schulte Shipmanagement.\nIsraeli media have identified Ungar as being the son of Israeli shipping billionaire Abraham \"Rami\" Ungar.\nFor more than a month, Iranian-backed militias have conducted drone and rocket attacks against the 2,500 American troops based in Iraq and the 900 troops in Syria.", "source_domain": "www.theuknews.com", "text": null, "title": "Red Sea Attacks Raise Tensions as US Kills 5 in Iraq", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274054711/red-sea-attacks-raise-tensions-as-us-kills-5-in-iraq"}