{"authors": [], "date_download": "2024-02-05 15:29:53", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Washington reportedly wanted a single focused advance sooner, but Kiev disagreed\r\n\r\n\r\nUS and British officers helped plan the Ukrainian spring-", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274055294%2Fukraine-ignored-us-counter-offensive-strategy-wapo.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1701785663.jpg", "language": "en", "localpath": null, "maintext": "Washington reportedly wanted a single focused advance sooner, but Kiev disagreed\nUS and British officers helped plan the Ukrainian spring-summer campaign and provided all the asked-for vehicles, but Kiev decided to divide its forces in three directions, according to a Washington Post feature published on Monday.\nOver a dozen Post employees interviewed \"more than 30 senior officials\" from Ukraine, the US and the EU, only a handful identified by name. The outlet's conclusion was that \"a counteroffensive born in optimism has failed to deliver its expected punch, generating friction and second-guessing between Washington and Kiev.\"\nA series of eight tabletop wargames at the US base in Wiesbaden, Germany reportedly developed a \"viable, detailed campaign plan\" for the attack. The Pentagon wanted the offensive to start mid-April and focus on cutting the \"land bridge\" to Crimea by driving to Melitopol.\nGeneral Mark Milley, chairman of the Joint Chiefs of Staff at the time, advised the Ukrainians to also send sabotage groups into the Russian rear, saying there \"should be no Russian who goes to sleep without wondering if they're going to get their throat slit in the middle of the night,\" according to one official.\nThe NATO-armed 47th Brigade, so new that 70% of its members had no combat experience, was to lead the way.\nWashington and Kiev \"sharply disagreed at times over strategy, tactics, and timing,\" according to the Post. Instead of a focused assault towards Melitopol, the Ukrainian leadership insisted on attacking in the direction of Berdyansk and Bakhmut/Artyomovsk as well.\nKiev initially demanded over 1,000 armored vehicles, which US Secretary of Defense Lloyd Austin deemed \"near-impossible.\" Eventually, they received 1,500. However, some vehicles were criticized as \"unfit for combat,\" with issues like missing tracks and inadequate maintenance blamed on Ukrainian troops.\nThe US secured a supply of 155mm artillery shells from South Korea, since it could not produce enough by itself. Requests for F-16 fighter jets were denied due to cost concerns and their vulnerability to Russian air defenses.\nThe US also trained and equipped nine Ukrainian brigades in NATO methods of warfare. Simulations based on Ukrainian and Western intelligence projected Ukrainian brigades reaching the Sea of Azov in 60-90 days with up to 30-40% casualties.\n\"The plan that they executed was entirely feasible with the force that they had, on the timeline that we planned out,\" a senior US military official told the Post. \"They got everything they were promised, on time,\" a senior US official said.\nThe attack scheduled for mid-April finally \"lurched into motion\" in early June. Ukrainian troops immediately got bogged down in minefields and mauled by Russian artillery.\n\"Incinerated Western military hardware - American Bradleys, German Leopard tanks, mine-sweeping vehicles - littered the battlefield. The numbers of dead and wounded sapped morale,\" the Post noted. After just four days, General Valery Zaluzhny \"tossed aside\" American doctrine and planning, switching to smaller-scale infantry assaults.\nThe June 15 meeting at the NATO HQ in Brussels was \"heavy with an air of frustration,\" per the Post. Ukrainian Defense Minister Aleksey Reznikov - who would be fired in September - informed Austin that over 50% of the US-supplied mine-clearing equipment was already destroyed.\nWestern reliance on armored maneuver and a breakthrough \"didn't work,\" a senior Ukrainian defense official said. Another had disdain for the wargaming approach to planning the operation, pointing to the lack of accounting for drones and other technology.\n\"All these methods ... you can throw them away,\" he said. \"Because it doesn't work like that now.\"\nThe 47th expected to take the village of Robotino within two days. It had not done so until August 28, and has since been pulled from that section of the frontline and rushed to shore up the crumbling defenses of Avdeevka, to the east.\n\"At almost every point along the front, expectations and results have diverged,\" the Post noted, describing the morale in Ukraine as \"waning\" and its cause as \"precarious.\" One British official said that Kiev's goal of reclaiming its 1991 borders would \"take years and a lot of blood,\" assuming it's possible at all.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Ukraine ignored US 'counter-offensive' strategy WaPo", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274055294/ukraine-ignored-us-counter-offensive-strategy-wapo"}