{"authors": ["Reged Ahmad", "Léonie Chao-Fong", "Martin Belam", "Richard Luscombe", "Jamie Grierson", "Helen Livingstone"], "date_download": "2024-02-05 15:29:55", "date_modify": "None", "date_publish": "2023-12-07 02:01:17", "description": "This blog is now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F06%2Fisrael-hamas-war-live-updates-palestinians-killed-gaza-strike-as-israeli-military-idf-fighting-khan-younis-news.json", "image_url": "https://i.guim.co.uk/img/media/b29158e8877c13ab8ec80276f08b2200a20939a3/867_479_5445_3267/master/5445.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=7d8821c7c27499171f938b1fbb423fa5", "language": "en", "localpath": null, "maintext": "From 6 Dec 2023 22.34 CET Hamas Gaza leader Yahya Sinwar 'hiding underground', says Israeli army The Israel Defense Forces (IDF) has said Hamas’s Gaza chief Yahya Sinwar, whose house they say they have surrounded, is hiding underground. Earlier today, Benjamin Netanyahu announced that troops “are encircling Sinwar’s house,” adding that “he can escape, but it’s only a matter of time before we get him.” Sinwar, a founding member of Hamas, grew up in a refugee camp of Khan Younis. Asked whether Netanyahu’s statement meant Israeli troops were closing in on the Sinwar home, IDF spokesperson Daniel Hagari said: “The house of Sinwar is the area of Khan Younis.” “Sinwar is not above ground; he is underground,” Hagari said, adding: I don’t want to elaborate where and how and what we know in terms of intelligence. This is not the place to talk about such things in the media. Our job is to find Sinwar and kill him.\n7 Dec 2023 02.58 CET Premature babies that were evacuated from Gaza are now being treated at a hospital in Egypt. Some of those images have been released. View image in fullscreen Medics treat premature Palestinian babies who were evacuated from Gaza at the New Administrative Capital (NAC) Hospital in the east of Cairo. Photograph: Amr Abdallah Dalsh/Reuters View image in fullscreen A premature Palestinian baby sleeping in an incubator in Egypt after being evacuated from Gaza. Photograph: Amr Abdallah Dalsh/Reuters\n7 Dec 2023 02.05 CET The United States has discussed with Israel its timeline for military operations in Gaza and “how this falls into a longer-term strategy for addressing this issue that goes beyond just military means,” White House national security adviser Jake Sullivan has told Reuters in a telephone interview. We have talked to them about timetables. I don’t want to share that because Israel has already kind of telegraphed precisely the location of its ground operation and I don’t want to be the one telegraphing timetables… I will just say that we’ve talked through with them what they’re thinking in terms of the duration and how this falls into a longer-term strategy for addressing this issue that goes beyond just military means\n7 Dec 2023 01.47 CET In their daily update, the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) says there has been intense fighting between Israeli forces and Palestinian armed groups. Here is some of their latest updates: Heavy Israeli bombardments from air, land, and sea across Gaza have continued on 5 and 6 December, alongside intense fighting between Israeli forces and Palestinian armed groups, in particular in the eastern parts of Gaza city, Jabalia refugee camp, and areas east of Khan Younis. Rocket firing by Palestinian armed groups to Israel continued. OCHA has added that an area of Khan Younis city has been marked for immediate evacuation: On 6 December, an additional area in Khan Younis city encompassing about one square kilometre was designated by the Israeli military for immediate evacuation. Along with similar designations in previous days, about 25 per cent of the city area, where about 178,000 original residents (73 per cent of the population) and an estimated 170,000 IDPs [internally displaced persons] received have evacuations orders. The Israeli military instructed residents to move to two areas in Rafah and to Al Fakhouri in eastern Khan Younis governorate.\n7 Dec 2023 01.10 CET British Defence Secretary Grant Shapps will use a trip to Israel and the occupied Palestinian territories to push for humanitarian aid to be delivered faster, including by sea directly into Gaza, his office said on Thursday. He will discuss with leaders there options to provide civilians in Gaza with more aid, how the UK can support the Palestinian Authority, the recovery of hostages, as well as efforts to prevent further escalation in the Middle East, Reuters reports. “We are working to find the best way to get aid and support to those in desperate need in the quickest and most direct route. That includes options by land, sea and air,” Shapps said. Earlier this week Shapps said Britain was considering sending military support vessel RFA Lyme Bay to provide medical and humanitarian aid in the Middle East. Shapps is due to meet the Interior Minister of the Palestinian Authority, Gen Ziad Hab Al-Reeh, to discuss the need for measures to improve security for Palestinians in the West Bank, his office said, while in Tel Aviv he will meet Israeli Defence Minister Yoav Gallant “to address the current security situation and Israel’s next steps”. Shapps will also visit kibbutz Kfar Aza in southern Israel which was attacked by Hamas on 7 October.\n6 Dec 2023 00.58 CET The president of Harvard University on Wednesday faced criticism and calls for her resignation over comments at a Capitol Hill hearing on campus antisemitism, Agence-France Presse is reports. The deadly conflict between Israel and Hamas militants has ignited tensions on many American college campuses, with protests flaring. At Harvard, donors have specifically called for President Claudine Gay to offer more explicit support for Israel, and condemnation of student groups who have voiced support for the Palestinian people. On Tuesday, Gay testified before the House Education Committee at a hearing dedicated to holding campus leaders accountable for antisemitic incidents. Republican lawmaker Elise Stefanik likened student calls for a new intifada – an Arabic word for uprising that harks back to the first Palestinian revolt against Israel in 1987 – to inciting “genocide against the Jewish people in Israel and globally.” When Stefanik asked Gay if such calls would violate Harvard’s code of conduct, the Harvard president said: “We embrace a commitment to free expression even of views that are objectionable, offensive, hateful. “When speech crosses into conduct that violates our policies, including policies against bullying, harassment or intimidation, we take action.” Stefanik called on Gay to immediately resign, while Republican Senator Ted Cruz called the comment “disgraceful.” On Wednesday, Gay issued a brief statement clarifying her testimony. “There are some who have confused a right to free expression with the idea that Harvard will condone calls for violence against Jewish students,” she said in a statement on social media. Let me be clear: Calls for violence or genocide against the Jewish community, or any religious or ethnic group are vile, they have no place at Harvard, and those who threaten our Jewish students will be held to account.”\n6 Dec 2023 00.30 CET Reged Ahmad here, picking up the blog from Leonie Chao-Fong. Here are some of the latest images coming out of Gaza and Israel: View image in fullscreen This satellite image shows crowds of people, tents and shelters at Khan Younis college in the southern Gaza Strip on 3 December. The Israeli army has battled with Palestinian militants as it encircled the main southern city of Khan Yunis. Photograph: Satellite image ©2023 Maxar Technologies/AFP/Getty Images View image in fullscreen Posters of hostages kidnapped by Hamas during the attack of 7 October are displayed on the streets of Tel Aviv. The faces of civilians and the message \"Bring them home now\". Photograph: Jose Hernandez/Shutterstock View image in fullscreen Smoke rises from Gaza after an IDF bombardment on 6 December as seen near the Gaza border in Southern Israel. Photograph: Alexi J Rosenfeld/Getty Images\n6 Dec 2023 23.38 CET Israel says UN chief 'reached a new moral low' after invoking Article 99 Israel’s ambassador to the UN, Gilad Erdan, has said António Guterres “reached a new moral low” after the UN secretary general invoked a rarely used clause to urge the body’s security council members to “avert a humanitarian catastrophe” in the besieged Palestinian territory. Posting to social media, Erdan said the UN chief had decided to activate “this rare clause only when it allows him to put pressure on Israel.” He described the move as “more proof of the Secretary-General’s moral distortion and his bias against Israel” and said Guterres’ call for a ceasefire was “actually a call to keep Hamas’ reign of terror in Gaza”. He added: I again call on the secretary-general to resign immediately - the UN needs a secretary-general who supports the war on terror, not a secretary-general who acts according to the script written by Hamas. Today, the Secretary-General has reached a new moral low. He writes that he is activating, for the first time, Article 99 of the UN Charter in relation to the Israel-Hamas war, an article that can only be invoked in a situation where international peace and security are… pic.twitter.com/rQm18aT1vq — Ambassador Gilad Erdan גלעד ארדן (@giladerdan1) December 6, 2023", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli forces and Hamas fighting house-to-house battles in Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/06/israel-hamas-war-live-updates-palestinians-killed-gaza-strike-as-israeli-military-idf-fighting-khan-younis-news"}