{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:14:33", "date_modify": "None", "date_publish": "2024-01-30 15:01:38", "description": "Hawks in Congress including Sen. Lindsey Graham are calling on Biden to 'hit them hard,' after the White House identified Iran-backed proxies in carrying out the drone attack.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13023551%2FBiden-facing-growing-calls-hit-Iran-directly-response-drone-strike-killed-three-troops-Republicans-slams-Joes-appeasement-Tehran-Democrats-urge-not-drag-U-S-Middle-East-war.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/30/14/80603143-0-image-a-9_1706626251880.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden confirmed he has decided how to respond to the recent Iran-backed drone strike that killed three U.S. troops in Jordan but said he does not want the US dragged into a wider war in the Middle East.\nBiden said he holds Iran responsible for providing the weapons to the militia behind the attack as he faces a monumental decision on how to hit back.\nSome Republicans have called for him to strike directly inside Iran and have accused him of appeasing the Islamic Republic, while Democrats have urged restraint to prevent escalation.\nThe White House is considering launching strikes on multiple Iranian military assets in the Persian Gulf and Biden has been presented with various options by military chiefs.\nThe retaliation could take place in the coming days as tensions in the Middle East continue to spiral.\nPresident Joe Biden has revealed he has decided how to respond to the drone strike that killed three U.S. troops in Jordan and reiterated that he doesn't want the US dragged into wider war\nBiden says he holds Iran responsible for providing the weapons to the militia behind the attack as he faces a monumental decision on how to hit back\nSpeaking at the White House, Biden was asked how he knew Iran was responsible for the fatal drone attack on U.S. troops in Jordan last week.\nHe responded: 'I do hold them responsible in the sense they are supplying the weapons to the people who did it.'\nWhen asked if he held Tehran directly responsible, he said: 'We will have those discussions.'\nPressed about concerns raised by his own administration about the risks of escalation, the president replied: 'We'll see.'\nWhen asked if he has made a decision how the U.S. will respond, he said: 'Yes.'\nHe added: 'I don't think we need a wider war in the Middle East, that's not what I'm looking for.'\nAboard Air Force Once, national security spokesman John Kirby provided only a sketch of what was under consideration. 'It's very possible that what you'll see is is a tiered approach here – not just a single action but potentially multiple actions.'\nHe also said Biden had met with relatives of families of the three fallen troops, gauging their views on whether he should travel to Dover Air Force Base Friday for the dignified transfer ceremony.\n'All of them supported his presence there, and so president will be going to the dignified transfer,' Kirby said.\nAsked by DailyMail.com whether the U.S. had determined who was behind the attack, Kirby responded, 'We're still we're still working our way through that.' Pressed on how Biden could have decided on a response if that is the case, Kirby responded: 'I don't have anything more to add on that.'\nBiden's comments came a day after meeting his security team in the Situation Room at the White House.\nAs the nation continues to mourn the loss of three U.S. troops in the drone strike in Jordan, Biden is facing calls from Republicans to strike inside Iranian territory.\nThe White House spent Monday providing assurances that the U.S. would respond to the drone attack at a time of its choosing.\nThe nation's top diplomat Antony Blinken emphasized the precariousness of the moment.\n'This is an incredibly volatile time in the Middle East,' Blinken said during a press conference with NATO secretary-general Jens Stoltenberg.\n'I would argue that we've not seen a situation as dangerous as the one we're facing now across the region since at least 1973, and arguably even before that.'\nBlinken, speaking on Monday, added: 'We will respond decisively to any aggression, and we will hold responsible the people who attacked our troops. That response could be multileveled, come in stages and be sustained over time.'\nThe White House put out an image of President Biden meeting with his security team, including Defense Secretary Lloyd Austin, on Monday as the administration prepares to respond to an attack on a U.S. base in Jordan\nAmong the hawks making public calls to strike Iran, who the U.S. assesses was behind the attack, is South Carolina GOP Sen. Lindsey Graham.\n'I am calling on the Biden Administration to strike targets of significance inside Iran, not only as reprisal for the killing of our forces, but as deterrence against future aggression,' he said in a statement.\n'The only thing the Iranian regime understands is force. Until they pay a price with their infrastructure and their personnel, the attacks on U.S. troops will continue,' he added. 'Hit Iran now. Hit them hard.'\n'It is long past time for this regime to pay a heavy price,' Graham wrote.\nArkansas Republican Sen. Tom Cotton has called for 'devastating military retaliation against Iran’s terrorist forces, both in Iran and across the Middle East.'\nThat view is counterbalanced by Democrats including Sen. Tim Kaine (D-Va.), who warned Tuesday that 'we shouldn’t stumble or slide our way into another war in the Middle East.'\nThe White House and the Pentagon have identified the likely perpetrators, and have fingered support by Iran's Revolutionary Guard Corps, despite Tehran's denials of directing the attack.\n'We know this is an IRGC backed militia, it has the footprints of Kata'ib Hezbollah but not making a final assessment on that,' said Pentagon spokeswoman Sabrina Singh Monday, identifying an Iraqi Shiite militia backed by Tehran.\nThe president again warned that the U.S. would hold those responsible 'to account.' He met with members of his security team including Austin, who has been working at home for weeks after being hospitalized\nFrom left to right: Spc. Kennedy Sanders, Sgt. William Jerome Rivers and Spc. Breonna Alexsondria Moffett. The three U.S. Army Reserve soldiers from Georgia were killed by a drone strike on Sunday\nBiden spent Monday behind closed doors, meeting with his security team, including back-to-work Secretary of Defense Lloyd Austin.\nPotential U.S. targets are already starting to emerge.\nThe New York Times reported the U.S. was looking at drone-making factories and their suppliers overseas who are also arming the Houthis in Yemen who have been firing off attacks on shipping targets and Hezbollah forces in Lebanon.\nThe Wall Street Journal has floated options including a strike inside Iran, hitting proxy groups abroad, and still more financial pressure.\nThe president is also weighing strikes on Iranian naval assets in the Persian Gulf, which could be deemed less escalatory than attacks inside Iranian territory.\nThe preparations for a possible counter strike were ongoing on a day when the Pentagon announced the three U.S. casualties following the one-way drone attack at a U.S. base in Jordan. They were Sgt. William Jerome Rivers, 46, of Carrollton, Georgia; Spc. Kennedy Ladon Sanders, 24, of Waycross, Georgia; and Spc. Breonna Alexsondria Moffett, 23, of Savannah, Georgia.\nAnother tough statement came from House Armed Services Committee Chairman Rep. Mike Rogers (R-Ala.). 'It's long past time for President Biden to finally hold the terrorist Iranian regime and their extremist proxies accountable for the attacks they've carried out,' he said.\nPresident Joe Biden speaks to members of the media before boarding Marine One on the South Lawn of the White House in Washington, Tuesday, Jan. 30, 2024,\nU.S. President Joe Biden speaks to the media before he departs the White House for Florida, in Washington, U.S., January 30, 2024\nSaid GOP Sen. Roger Wicker of Mississippi: 'We must respond to these repeated attacks by Iran and its proxies by striking directly against Iranian targets and its leadership. ... The Biden administration’s responses thus far have only invited more attacks.'\nAny president would get pressure to respond, and those calls are amplified in an election year. Biden is also getting advice from Donald Trump's former UN ambassador and primary rival Nikki Haley – who continues to rip an election between 'two 80 year olds.'\n'The very first strike you punch back and punch back hard,' she told CNBC.\n'You go after wherever those missiles are, the production, wherever it is in Iraq and Syria. You go after the leaders making the decisions. It's not after Iran the country, it's after the people making these decisions.'\n'You have to be strategic. It's not starting war, it's actually preventing war,' said Haley.\nPresident Joe Biden boards Marine One on the South Lawn of the White House in Washington, Tuesday, Jan. 30, 2024\nEven after 160 attacks on U.S. forces, the White House is seeking to avoid escalation. White House national security spokesman John Kirby warned Monday that 'we'll respond in a very consequential way.' Then, he added: 'But we don't seek a war with Iran. We're not looking for a wider conflict in the Middle East.'\nUnderlining one of the tensions, National Security Advisor Jake Sullivan was set to meet at the White House Tuesday with families of hostages held inside Gaza since the Oct. 7 Hamas attack. That comes amid talks over a potential two months pause in Israel's strikes against Hamas and the release of 100 hostages.\nThere are dovish impulses inside the MAGA wing of the Republican Party that counterbalance pressure to strike hard.\n'A prospective war with Iran combined simultaneously while Texas, with the backing of 25 states, is at a stand off with the federal government at the border is unprecedented and dangerous,' wrote Georgia GOP Rep. Marjorie Taylor Greene, a Donald Trump ally. She posted an image of a Trojan horse and blasted a spike in illegal immigration.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden says he has DECIDED how U.S. will retaliate against Iran-backed drone strike that killed three U.S. troops in Jordan", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13023551/Biden-facing-growing-calls-hit-Iran-directly-response-drone-strike-killed-three-troops-Republicans-slams-Joes-appeasement-Tehran-Democrats-urge-not-drag-U-S-Middle-East-war.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}