{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:15:39", "date_modify": "None", "date_publish": "2024-01-26 16:59:54", "description": "President Joe Biden told Israel's Prime Minister Benjamin Netanyahu he won't back a year-long war in Gaza, according to a report, which comes as he faces domestic pressure over the war.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13010693%2FBiden-tells-Bibi-wont-wait-YEAR-Gaza-war-end-President-tells-Israeli-counterpart-scale-offensive-Hamas-offensive-stop-conflict-November-election.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/26/16/80507545-0-image-a-9_1706288008249.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden has privately told Israel's Prime Minister Benjamin Netanyahu that he won't support Israel's war in Gaza lasting a year, according to a new report.\nBiden is concerned both about the growing death toll in Gaza and about the impact the war is having on younger U.S. voters in the run-up to the 2024 elections, Axios reported.\nHe 'is not in it for a year of war,' Biden told Netanyahu privately, according to the report, which follows a series of public and private cautions by the U.S. for the Israel Defense Forces to take steps to mitigate civilian casualties during its operations in Gaza.\nThe report comes days after Biden was repeatedly interrupted by protesters during a high-profile political speech in Virginia this week, where he sought to hammer rival Donald Trump over abortion rights, an issue that Democrats are hoping to ride to victory despite a series of grim polls for Biden in the presidential race.\nPresident Joe Biden has told Israeli Prime Minister Benjamin Netanayu he won't back a year-long war in Gaza. He was interrupted repeatedly at a political speech this week by Pro-Palestinian protesters\nThe U.S. is urging Israel to pivot to lower-intensity fighting amid its continued ground assaults, which according to health authorities in Gaza have led to the deaths of 25,000 people.\nBiden's advisors have begun sharing their political concerns. One expressed concern about losing young voters, many of whom have rallied to the Palestinian cause amid Israel's war on Hamas, which followed the October 7 terror attacks inside its own territory.\nWhite House Press Secretary Karine Jean-Pierre was questioned repeatedly this week about the protests and about whether Biden is taking steps to meet with pro-Palestinian critics.\nOn the diplomatic front, CIA Director William Burns was set to meet with the head of Israel's Mossad, David Barnea, and Qatari Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani in Europe this weekend in hopes of hammering out a sequenced release of hostages held by Hamas along with a two month stop to the fighting.\nIsraeli Prime Minister Benjamin Netanyahu has vowed Israel will continue its war on Hamas in Gaza until its goals are completed\nHealth authorities in Gaza say the death toll has hit 25,000\nThe U.S. took the rare step Thursday of condemning at attack on a UN facility in Khan Younis that was housing an estimated 30,000 refugees.\nState Department spokesman Vedant Patel in a statement that 'We deplore today's attack on the UN's Khan Younis training centre.'\n'Civilians must be protected, and the protected nature of UN facilities must be respected, and humanitarian workers must be protected so that they can continue providing civilians with the life-saving humanitarian assistance that they need,'he added. Israel denied that its forces struck the center.\nBiden embraced Netanyahu after October 7 and has kept up the flow of U.S. military assistance while the White House has backed Israel's right to defend itself even amid calls for a cease fire.\n'Prime Minister Benjamin Netanyahu appreciates President Biden’s support and made it clear in his conversation with him that Israel is determined to continue the war until all its goals are completed,' his office said in response to reports about the call, the Times of Israel reported.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden tells Bibi he won't wait another YEAR for the Gaza war to end: President tells Israeli counterpart to scale-down offensive Hamas offensive to stop conflict before November election", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13010693/Biden-tells-Bibi-wont-wait-YEAR-Gaza-war-end-President-tells-Israeli-counterpart-scale-offensive-Hamas-offensive-stop-conflict-November-election.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}