{"authors": ["Julian Borger", "Ruth Michaelson"], "date_download": "2024-02-05 15:30:02", "date_modify": "None", "date_publish": "2023-12-07 18:34:47", "description": "Those who have fled to ‘humanitarian zone’ in south-west Gaza bemoan total lack of shelter and barely any food", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F07%2Fidf-israel-gaza-refuge-zones-cruel-mirage-say-aid-agencies.json", "image_url": "https://i.guim.co.uk/img/media/374aee8c121d1191447280b09d28c2f6d50d3bb2/0_288_8640_5184/master/8640.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eb37aeb1c42392069623d913017c4eb5", "language": "en", "localpath": null, "maintext": "Instructions from Israeli forces telling Gaza civilians where to seek refuge and humanitarian relief have given contradictory recommendations, while aid agencies and Palestinians who have heeded them describe the offer of safety as a cruel “mirage” amid an intensifying military campaign.\nThose who have fled to a “humanitarian zone” declared by the Israeli Defense Forces (IDF) at al-Mawasi, a Bedouin settlement on sand dunes in the south-west corner of the Gaza Strip, have depicted a desperate scene with no shelter and barely any food. The IDF, meanwhile, has not ruled out bombing the area, claiming that rockets were fired from there, most recently on Wednesday.\nAl-Mawasi was first touted as a safe zone a few days after the bombardment of Gaza began in response to the 7 October Hamas attack on Israel in which 1,200 were killed.\nHowever, the IDF has been inconsistent in recommending al-Mawasi as a safe space.\nMaps and instructions distributed recently to the 2.3 million Palestinians trapped in Gaza show the territory divided into 623 numbered districts, with orange arrows showing how civilians should move from one district to another to avoid planned IDF military operations.\nThe arrows have changed direction as circumstances have changed in the past few days, but none of them specifically pointed towards al-Mawasi, nor was the 14 sq km coastal area mentioned in the accompanying text.\nAl-Mawasi was however shown in a presentation by the IDF to the international press on Thursday. It appeared as a grey area on a map of southern Gaza, labelled as a “humanitarian zone”.\nAsked to give details, Col Elad Goren, the head of the civil department of the IDF’s Coordination of Government Activities in the Territories (Cogat) branch, confirmed the army was recommending it as a haven for Gazans fleeing the war. He also suggested that Israeli forces were putting themselves in danger by allowing the zone to exist, the implication being that it could be used by Hamas to launch attacks.\nGoren said: “There are risks, but still we understand that the population needs a solution, so we want to encourage the population to go to this humanitarian zone where assistance will be delivered.”\nGazans who have heeded that advice have described al-Mawasi as dangerously overcrowded and desolate. “To be honest, it’s horrible,” said one man who had fled Jarara, north of Khan Younis, a week ago.\n“We believed that al-Mawasi was a safe place, as this is what the Israeli forces told us,” the man said in a recorded voice message, in which the buzz of overhead drones was clearly audible.\nThe women and girls in his family found a room in a shelter that they were sharing with other families, while the men slept outside in the cold.\n“Of course, we barely find food, or anything to eat and drink,” the man said. He added that there was a weekly aid delivery, but it was not nearly sufficient for the crowds that had gathered at al-Mawasi.\n“This food in a normal situation wouldn’t be enough for an average family of seven to eight people, but now in this place where we live, there are almost 60 or 70 people, so we struggle. I have to give some part of my food to my son and my wife.”\nPictures of al-Mawasi published by Sky News showed flimsy improvised shelters erected over an expanse of sand strewn with rubbish.\n“It is not possible to concentrate large numbers of civilians in such tiny slivers of land without exacerbating an already dire humanitarian catastrophe,” Alexandra Saieh, the head of humanitarian policy at Save the Children International, warned. “People are in overcrowded shelters in makeshift tents. There is no access to clean water, there are crumbling sanitation facilities. We’ve heard of children starving in the so-called ‘safe zone’ of al-Mawasi.”\nThe UN Relief and Works Agency (UNRWA) said in a statement: “The UN is not involved in this and has underlined repeatedly that unilaterally declared ‘safe zones’ are not safe at all. Nowhere in Gaza is safe.”\nThe IDF itself refuses to rule out bombing or other military operations in al-Mawasi, alleging that 12 rockets were launched from the al-Mawasi area on Wednesday.\n“I wouldn’t use the words ‘safe place’ or ‘safe haven’ because Hamas fired a rocket from al-Mawasi,” an IDF officer said. “Hamas is using this place for human shields, for its own needs.”\nThis officer recommended instead that Gazans follow the official map and evacuation instructions, regularly distributed by leaflets, phone texts and social media messages. He said: “Those are changed in accordance to the situation assessment.”\nThe map accompanying these instructions dividing Gaza into 623 blocks is taken from an Israeli blueprint from the 1970s, Haaretz reported, and was part of a short-lived plan to rebuild the Gaza Strip under Israeli occupation.\nThe instructions list the names and grid numbers of the districts to be evacuated and those where Gazans are supposed to seek shelter. “Dear residents of Gaza, obeying evacuation instructions is the safest way to preserve your safety, your lives, and the lives of your families,” the IDF text says.\n00:01:40 Collapse in humanitarian relief after Israeli forces advance on southern Gaza – video report\nThe UN and aid agencies have said that such instructions only add to the peril Gazans face, as movement anywhere is dangerous amid intense urban combat, especially as humanitarian deliveries have completely broken down, creating conditions described by the UN’s top aid official as “apocalyptic”.\n“Israel’s safe zones within Gaza are a mirage,” Bushra Khalidi, Oxfam’s head of policy for the occupied Palestinian territories, said. “They’re unprotected, they’re not provisioned and they’re inaccessible.”\nMatthew Miller, the state department spokesperson, said this week that the US was “working with UNRWA to try to identify sites where civilians can go to be safe from harm”.\nUNRWA responded in a statement on Thursday: “UNRWA does not have any plans to provide assistance in a ‘safe zone’ but is looking for options for more shelters within the city – not new camps – as its own shelters are overcrowded now.\n“As with all its premises, it will share the coordinates with the parties to the conflict, both Israeli authorities and de facto authorities … Some 80 UNRWA premises were already hit during the fighting – some directly.”", "source_domain": "www.theguardian.com", "text": null, "title": "IDF instructions on Gaza refuge zones cruel ‘mirage’, say aid agencies", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/07/idf-israel-gaza-refuge-zones-cruel-mirage-say-aid-agencies"}