{"authors": [], "date_download": "2024-02-05 15:30:03", "date_modify": "None", "date_publish": "2023-12-07 21:12:19", "description": "Armed rebels have seized a town in eastern Congo after violently clashing with the army, which has taken on an expanded role as peacekeeping forces withdraw from the mineral-rich, conflict-stricken region", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-congo-rwanda-felix-tshisekedi-north-kivu-b2460460.html.json", "image_url": "https://static.independent.co.uk/2023/12/07/13/UN_Peacekeeping_66774.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nArmed rebels seized a town in eastern Congo on Thursday after violently clashing with the army, which has taken on an expanded role as peacekeeping forces withdraw from the mineral-rich, conflict-stricken region.\nMilitary officials and residents of Mushaki told The Associated Press that M23 militants had penetrated the town and occupied key military outposts, leading many to flee.\n“The fighting is still going on,” Sabimana Alexis, a resident, told AP. “The inhabitants are moving en masse.”\nM23 is a large and powerful rebel group that operates near Congo’s border with Rwanda, a mineral-rich region where armed groups have long waged campaigns of violence and been accused of mass killings. The group allegedly has support from neighboring Rwanda, though the country denies ties.\nMushaki is a pivotal transport hub that paves the way to larger cities in east Congo’s Kivu region. It has traded hands between rebels and the army throughout the conflict and as recently as February.\nThe latest round of fighting comes as the 100 million-person nation prepares for an election later this month and President Felix Tshisekedi asks voters for another term. The election won't be held in areas wracked by violence and displacement — one of many issues observers questioning the country's ability to hold fair and free elections have raised.\nM23, largely comprised of Congolese ethnic Tutsis, was dormant for nearly a decade before resurfacing in 2021. It has since often clashed with government forces and United Nations peacekeepers, who are slated to gradually withdraw from Congo at the government’s request.\nOlivier Mungwiko, a spokesperson for a civil society group focused on youth engagement in the nearby city of Sake, said soldiers and the volunteer-led self-defense groups who fight alongside them clashed until 10 a.m.\nResidents heard bombs falling from planes in nearby villages, Mungwiko said.\nLt. Col. Njike Kaiko Guillaume confirmed that the army had used its air forces to attack rebels before they were able to infiltrate Mushaki.\n“We are in the process of containing them in the hills,” he said. “Strategies being put in place are designed to prevent collateral damage to our population.”\nM23’s offensive comes during ongoing fighting that has caused further displacement since a cease-fire broke down in November 2022. Peace efforts appear to have stalled. The new round of fighting also comes amid questions about the region’s long-term stability as Congolese leaders in Kinshasa push regional and international peacekeeping forces to withdraw. A regional force of officers from East African countries began leaving Goma — the capital of North Kivu — on Sunday.\nAs fighting has intensified this week, the head of the United Nations’ peacekeeping mission amplified concerns and pledged to stand by the army. Bintou Keita said peacekeepers will do the “utmost to ensure the protection of civilians.”\n___ Associated Press writer Sam Metz contributed from Rabat, Morocco.", "source_domain": "www.independent.co.uk", "text": null, "title": "Rebels in Congo take key outpost in the east as peacekeepers withdraw and fighting intensifies", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-congo-rwanda-felix-tshisekedi-north-kivu-b2460460.html"}