{"authors": ["Sophie Mann", "Sophie Mann For Dailymail.Com"], "date_download": "2024-02-05 15:30:06", "date_modify": "None", "date_publish": "2023-12-07 06:47:33", "description": "The US armed forces have ordered the grounding of all V-22 Ospreys following a fatal crash near Japan last week.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12835995%2FOsprey-Navy-Pentagon-Japan-crash.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/07/06/78678299-0-image-a-29_1701931326655.jpg", "language": "en", "localpath": null, "maintext": "The United States military has ordered its entire fleet of V-22 Ospreys grounded one week after eight airmen died aboard a CV-22 that crashed off the coast of Japan.\nOn Wednesday evening, Air Force Special Operations Command said that Lt. Gen. Tony Bauernfeind, the group's commander, had directed an 'operational standdown' of the Air Force's CV-22 fleet.\nThe grounding was put into place to 'mitigate risk while the investigation continues.\nOut an 'an abundance of caution,' Naval Air Systems Command said it will also ground the Navy and Marine Corps' V-22s.\nA statement from the Navy said that the preliminary investigation into the crash 'indicates a potential materiel failure caused the mishap, but the underlying cause of the failure is unknown at this time.'\nThe aircraft was conducting a 'routine training mission' when it crashed. Though the fatal incident remains under investigation, the aircraft have a history of mechanical issues and has been involved in a number of fatal accidents in the last several decades.\nA V-22 Osprey with eight airmen aboard crashed off a Japanese island last week, killing everyone aboard. The crash is under investigation by the Pentagon\nAccording to CNN, in August, three US Marines were killed in an MV-22 Osprey during an exercise in Australia.\nThe bodies of six of the eight airmen aboard the doomed Osprey have been recovered following last week's crash. Three of them have been identified.\nStaff Sgt. Jake Galliher, 24, was identified as the first airmen in the crash. Earlier this week, Maj. Luke Unrath, 34, and Tech Sgt. Zachary Lavoy, 33, were identified as two more of the men aboard the Osprey.\nIn an earlier statement, Bauernfeind said the 'honorable service of these eight airmen to this great nation will never be forgotten.'\n'In times like these, where service to our nation is not just a personal commitment but also a legacy woven into the fabric of our families, the depth of sorrow is immeasurable.'\nThe AFSOC said Wednesday that after the personnel recovery operations, the team will 'turn its efforts toward salvaging the remaining aircraft debris.'\nFollowing the tragic crash, the government of Japan's Okinawa Prefecture requested that all Ospreys on or near the island be grounded - though the Pentagon denied having received an official request.\n'Right now, the Ospreys are still operating in Japan,' Pentagon press secretary Sabrina Singh said last week. 'I’m not tracking an official request received here at the department.'\nJapanese coast guard helicopter and patrol vessel conduct search and rescue operation in the waters where a U.S. military Osprey aircraft crashed into off the coast of Yakushima Island, Kagoshima prefecture, southern Japan Thursday, Nov. 30, 2023\nThe aircraft have a history of mechanical and operational issues and have been involved in several fatal crashes pre-dating last week's\nVersions of the V-22 Osprey are used across the armed forces, including by the Marines, the Air Force, the Navy, and Japan's Ground Self Defense Force, which uses a Japanese model of the aircraft.\nAccording to Boeing's description of the V-22, 't can take off, land and hover like a helicopter. Once airborne, it can convert to a turboprop airplane capable of high-speed, high-altitude flight.'\n'This combination results in global reach capabilities that allow the V-22 to fill an operational niche unlike any other aircraft.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "U.S. Navy orders grounding of all Osprey aircraft after 8 died in crash off Japan", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12835995/Osprey-Navy-Pentagon-Japan-crash.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}