{"authors": [], "date_download": "2024-02-05 15:30:07", "date_modify": "None", "date_publish": "2023-12-07 03:08:00", "description": "U.N. Secretary-General Antonio Guterres has used a rarely exercised power to warn the Security Council of an impending “humanitarian catastrophe” in Gaza and urged its members to demand an immediate cease-fire", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fantonio-guterres-ap-security-council-israel-gilad-erdan-b2459860.html.json", "image_url": "https://static.independent.co.uk/2023/12/07/03/Israel_Palestinians_44025.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nU.N. Secretary-General Antonio Guterres used a rarely exercised power to warn the Security Council on Wednesday of an impending “humanitarian catastrophe” in Gaza and urged its members to demand an immediate humanitarian cease-fire.\nHis letter to the council's 15 members said Gaza's humanitarian system was at risk of collapse after two months of war that has created “appalling human suffering, physical destruction and collective trauma,” and he demanded civilians be spared greater harm.\nGuterres invoked Article 99 of the U.N. Charter, which says the secretary-general may inform the council of matters he believes threaten international peace and security. “The international community has a responsibility to use all its influence to prevent further escalation and end this crisis,\" he said.\nU.N. spokesman Stephane Dujarric said he expects the secretary-general to address the Security Council on Gaza this week and to press for a humanitarian cease-fire.\nA short draft resolution circulated to council members late Wednesday by the United Arab Emirates, the Arab representative on the council, would act on Guterres’ letter under Article 99. It demands “an immediate humanitarian cease-fire” and expresses “grave concern over the catastrophic situation in the Gaza Strip and the suffering of the Palestinian civilian population.”\nEarlier Wednesday, the 22-nation Arab Group at the U.N. strongly backed a cease-fire.\nRiyad Mansour, the Palestinian U.N. ambassador, said it is essential that the U.N.’s most powerful body demand a halt to the conflict.\nBut the United States, Israel’s closest ally, has veto power in the Security Council and has not supported a cease-fire.\nOn Tuesday, U.S. deputy ambassador Robert Wood told reporters that the role of the Security Council in the Israeli-Gaza war “is not to get in the way of this important diplomacy going on on the ground … because we have seen some results, although not as great results as we want to see.”\nA Security Council resolution at this time, he said, “would not be useful.”\nMansour said a ministerial delegation from Arab nations and the 57-member Organization of Islamic Cooperation will be in Washington on Thursday to meet U.S. officials and press for an immediate cease-fire.\nIsrael’s U.N. Ambassador Gilad Erdan said the secretary-general invoked Article 99 to pressure Israel, accusing the U.N. chief of “a new moral low” and “bias against Israel.”\n“The secretary-general’s call for a ceasefire is actually a call to keep Hamas’ reign of terror in Gaza,” Erdan said in a statement. “Instead of the secretary-general explicitly pointing to Hamas’ responsibility for the situation and calling on the terrorist leaders to turn themselves in and return the hostages, thus ending the war, the secretary-general chooses to continue playing into Hamas’ hands.”\nIn his letter, Guterres denounced “the abhorrent acts of terror” and brutal killing of more than 1,200 people in Israel by Hamas militants on Oct. 7 and the abduction of some 250 people in the attack that started the war. He urged the immediate release of more than 130 still held captive.\nBut Guterres noted the worsening state of Gaza under Israel’s ongoing military action, which it says is aimed at obliterating Hamas. More than 16,200 people have been killed, and some 80% of Gaza's 2.3 million people have been forcibly displaced into increasingly smaller areas.\n“Amid constant bombardment by the Israel Defense Forces, and without shelter or the essentials to survive, I expect public order to completely break down soon due to the desperate conditions, rendering even limited humanitarian assistance impossible,” Guterres warned.\nA total collapse of the humanitarian system in Gaza, he said, would have “potentially irreversible implications for Palestinians as a whole and for peace and security in the region.”\nDujarric, the U.N. spokesman, told reporters earlier that invoking Article 99 was “a very dramatic constitutional move by the secretary-general.\" The only previous mention of Article 99 was in a December 1971 report by then Secretary-General U Thant to the council expressing his conviction that the situation in East Pakistan, now Bangladesh, and the Indian subcontinent threatened international peace and security, Dujarric said.\n“One doesn’t invoke this article lightly,” Dujarric said. “I think given the situation on the ground and the risk of complete collapse, not only of our humanitarian operations but of civil order, it’s something that he felt needed to be done now.”", "source_domain": "www.independent.co.uk", "text": null, "title": "UN chief uses rare power to warn Security Council of impending 'humanitarian catastrophe' in Gaza", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/antonio-guterres-ap-security-council-israel-gilad-erdan-b2459860.html"}