{"authors": ["Joe Hutchison", "Joe Hutchison For Dailymail.Com"], "date_download": "2024-02-05 15:30:08", "date_modify": "None", "date_publish": "2023-12-07 17:33:57", "description": "Central Command said that last month they managed to kill three ISIS operatives, and detain 14 others while in Iraq as their work in the Middle East to eradicate ISIS continues.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12837997%2FUS-ISIS-Iraq-Syria-jihad-cells.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/07/16/77832697-0-image-a-18_1701968186186.jpg", "language": "en", "localpath": null, "maintext": "The United States Central Command has revealed it killed kill four ISIS terrorists and detained 33 extremists in Iraq and Syria in November.\nCentral Command said that last month they managed to kill three ISIS operatives, and detain 14 others while in Iraq.\nIn neighboring Syria, US forces managed to take out one other extremist and detained 19 others.\nIn a statement, they said these targeted efforts had been to disrupt operations by two terror cells in the region.\nOne cell was reportedly responsible for planning attacks on prisons in Syria in an attempt to free radical prisoners held there.\nSince the Gaza war erupted with a deadly Hamas attack on Israel on October 7, US forces deployed in Iraq and Syria have been attacked at least 66 times\nGeneral Michael Erik Kurilla said: 'Even in the midst of complex challenges within the region, CENTCOM remains steadfast to the region and the enduring defeat of ISIS.'\nIn October, CENTCOM said they had conducted 387 operations against the Islamic State Group in Iraq and Syria.\nThat figure was already much higher than what American forces did in all of 2022 to wipe out the extremist group.\nIn 2022, US troops and partner forces killed at least 686 suspected ISIS fighters, 220 of those in Iraq and a further 466 in Syria.\nWhile fewer ISIS fighters have been killed this year in Iraq and Syria, U.S. troops and partner forces have captured more suspected ISIS operatives than in 2022.\nWith these latest figures from CENTCOM, the total number of operatives detained is now 516 for the year, compared to 374 last year.\nThe US launched counterstrikes on Iranian proxies in Syria last month, following a wave of missile and drone attacks on US troops in the region.\nSince the Gaza war erupted with a deadly Hamas attack on Israel on October 7, US forces deployed in Iraq and Syria have been attacked at least 66 times.\nThe US Air Force used F-15E fighter jets and targeted the Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin.\nThe Iran-backed militant groups claimed responsibility for the attacks and said they were in response to US support for Israel in its war against Hamas in Gaza.\nAmerica strikes back: US warplanes conducted airstrikes against Iranian proxy forces in Syria in retaliation for attacks against US troops in Middle East\nUS strikes on Sunday targeted an Iranian Revolutionary Guard training facility in North Abu Kamal, and a militia safe house in Mayadin\nThe airstrike against Iranian assets in Syria was the latest such US counterstrike to degrade and deter Iran's proxy forces.\nIn a statement, US Defense Secretary Lloyd Austin said: The President has no higher priority than the safety of US personnel, and he directed today's action to make clear that the United States will defend itself, its personnel, and its interests.'\nWhile prior strikes have hit unoccupied facilities, including weapons storage depots, the US believes up to seven people.\nThe US followed up this attack with another targeted attack last month on Iraq, killing eight pro-Iran fighters.\nThe twin strikes, which followed similar bombardment of Iran-backed forces on Tuesday, drew condemnation from the Iraqi government, which said it had not been consulted about the military action on its soil.\nHashed al-Shaabi soldiers carry the coffins of fighters killed in the US strikes in Iraq last month\nThe Iran-backed Hezbollah Brigades, which form part of the Hashed al-Shaabi force within Iraq's armed forces, said the strikes killed eight of its fighters\nThe US military 'conducted discrete, precision strikes against two facilities in Iraq', Central Command said.\n'The strikes were in direct response to the attacks against US and coalition forces by Iran and Iran-backed groups,' CENTCOM added.\nThe Iran-backed Hezbollah Brigades, which form part of the Hashed al-Shaabi force within Iraq's armed forces, said the strikes killed eight of its fighters.\nHours earlier, a warplane struck the vehicle of Iran-backed fighters after they had fired a short-range ballistic missile at US and allied personnel, the Pentagon said.\nIt was the first time the United States has announced a strike on Iran-backed forces in Iraq since they launched a flurry of attacks against US targets in response to Washington's support for Israel in its war in the Gaza Strip to destroy Hamas.\nIt comes after continued unrest in the middle east, as the war in Gaza continues to worsen the dire humanitarian conditions in the area.\nSmoke rises following an Israeli airstrike on Gaza as the IDF continues its offensive in southern Gaza\nDistribution of food, water and medicine have been prevented outside a sliver of southern Gaza, and new military evacuation orders are squeezing people into ever-smaller areas.\nThe United Nations said 1.87 million people - more than 80 per cent of Gaza's population - have been driven from their homes since the start of the Israel-Hamas war, triggered by the deadly October 7 Hamas assault on southern Israel.\nAround 1,200 people have died on the Israeli side, mainly civilians killed during Hamas' October 7 attack.\nThe Health Ministry in Hamas-run Gaza said the death toll in the territory has surpassed 16,200, with more than 42,000 wounded.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US reveals it's wiped out four ISIS terrorists and detained THIRTY-THREE during 40 missions in Iraq and Syria last month: Captured commandos include terror cell plotting to spring MORE jihadists from", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12837997/US-ISIS-Iraq-Syria-jihad-cells.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}