{"authors": [], "date_download": "2024-02-05 15:30:09", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The West is reportedly disappointed with Kiev?s failed counteroffensive and doubts its ability to score a victory against Russia\r\n\r\n\r\nBritish d", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274055686%2Fuk-preparing-to-push-ukraine-toward-peace-talks-media.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1701807229.jpg", "language": "en", "localpath": null, "maintext": "The West is reportedly disappointed with Kiev's failed counteroffensive and doubts its ability to score a victory against Russia\nBritish diplomats may soon start to put pressure on Ukraine to hold peace negotiations with Russia, Politico's Jack Blanchard has claimed, citing \"chatter\" in diplomatic circles. Media reports suggest that the West has grown concerned at Kiev's ability to score a battlefield victory.\nSpeaking on Monday on the latest episode of the 'Politics at Jack and Sam's' podcast, Blanchard noted that \"Ukraine's big counteroffensive was not anything like the success people hoped, and that is raising big questions about Ukraine's ability to win this war in any meaningful military way.\"\nIn light of this, Blanchard claimed that there are rumors going around British \"diplomatic circles\" about \"putting pressure on Kiev to sit down and negotiate.\"\nWhile the journalist did not provide any further details on these rumors, his comments come on the heels of a Washington Post article claiming that Ukraine ignored a counteroffensive strategy devised by American and British officers that recommended a focused attack on a single sector of frontline in April, and that it chose to delay the operation until June, and to spread its forces along multiple axes.\n\"Nothing went as planned,\" the Post stated, adding that Ukraine's insistence on following its own tactics and timeline generated \"friction and second-guessing between Washington and Kiev.\"\nAccording to the latest figures from the Russian Defense Ministry, Ukraine has lost 125,000 service personnel and 16,000 pieces of heavy equipment in the six months since its counteroffensive began.\nBlanchard is not the first journalist to claim that Kiev's patrons are ready to push for peace. Last month, German tabloid Bild alleged that the US and Germany are rationing their weapons deliveries to Ukraine in a bid to nudge Ukrainian President Vladimir Zelensky into talks with Russia, without explicitly asking him.\nThe US State Department dismissed Bild's report, with spokesman James O'Brien stating that the decision of when to sue for peace \"is a matter for Ukraine to decide.\"\nSpeaking at the Halifax Security Forum in Canada several days before that report was published, Aleksey Danilov, the secretary of Ukraine's National Security and Defense Council, said that \"Ukraine is concerned by the fact that discussions among certain partners have intensified regarding the need for negotiations...with the Russians.\"\nDanilov insisted, like Zelensky repeatedly has since the start of the conflict, that \"Ukraine and the Ukrainian people will fight to the end. We are sure of our victory.\"\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "UK preparing to push Ukraine toward peace talks media", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274055686/uk-preparing-to-push-ukraine-toward-peace-talks-media"}