{"authors": ["Nick Pisa", "Nick Pisa In Southern Israel"], "date_download": "2024-02-05 15:30:10", "date_modify": "None", "date_publish": "2023-12-07 10:31:55", "description": "MailOnline has been given exclusive access to an Israeli artillery unit pounding the Gaza Strip as Israel confirmed it had its 'fiercest day of fighting yet.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12836551%2FIts-apocalyptic-Hamas-dug-tunnels-civilians-Inside-Israeli-artillery-unit-hitting-Gaza-Strip-IDF-close-terror-leaders-home.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/07/10/78684579-0-image-a-32_1701945054934.jpg", "language": "en", "localpath": null, "maintext": "MailOnline has been given exclusive access to an Israeli artillery unit pounding the Gaza Strip as Israel confirmed it had its 'fiercest day of fighting yet.'\nIsraeli Defence Forces were engaged in tough hand to hand combat on the ground Gaza with support from the powerful 155mm Howitzers of the Artillery Corps.\nAs officials revealed that 250 air strikes had been carried out on various targets across the strip in a bid to root out Hamas leaders in hiding MailOnline was taken to a secret location just three miles from Gaza.\nWearing ear plugs for protection we were shown around the dozen or so units that have been dug into makeshift bunkers in fields in southern Israel with IDF officials forbidding the exact location from being revealed.\nUnder grey skies, the booming artillery unit – motto 'Sophistication and Might' - fired shell after shell at regular intervals with their targets being radioed in with pinpoint accuracy from Gaza by troops on the ground.\nIn dramatic pictures taken by photographer Roland Hoskins a shell leaving the muzzle could quite clearly be seen flying through the air\nIsraeli Defence Forces were engaged in tough hand to hand combat on the ground Gaza with support from the powerful 155mm Howitzers of the Artillery Corps\nChicago born Major Shraga (left), deputy brigade commander in the Jerusalem Battalion, (pictured with MailOnline's Nick Pisa) who had just come out of Gaza City described the area as 'apocalyptic'\nChicago born Major Shraga described the scenes in Gaza City as 'apocalyptic'\nUnder grey skies, the booming artillery unit – motto 'Sophistication and Might' - fired shell after shell at regular intervals with their targets being radioed in with pinpoint accuracy from Gaza by troops on the ground\nIn dramatic pictures taken by photographer Roland Hoskins a shell leaving the muzzle could quite clearly be seen flying through the air.\nThe recoil jolted the Howitzer back several feet and there was a shout of 'fire in the hole' in Hebrew before the artillery gun was fired enveloping the unit in white smoke.\nBlack Hawk helicopters crisscrossed the sky at various intervals bringing fresh supplies and an impending thunderstorm looming on the horizon gave the area a surreal feel.\nThe fire was being aimed at targets in Gaza City and Jabaliya with the aim to knock out terrorists but also rocket batteries that have been firing missiles into Israel in recent days.\nIt takes just a few seconds for the deadly M109 Doher to reach its target and it weighs 28 tons and has a crew of six.\nWith a maximum range of 18 miles the Howitzers are easily able to strike northern Gaza and it's thought at some point they will move further south to target Khan Younis.\nChicago born Major Shraga, deputy brigade commander in the Jerusalem Battalion, who had just come out of Gaza City described the area as 'apocalyptic'.\nHe said: 'Right now we are manoeuvring in Gaza city and there is a battle taking place right now in Jabaliya.\n'What you are seeing here is our artillery support that is backing up our manoeuvre down there.\n'I was in there for three weeks and I can tell you Gaza is a dangerous bloody war zone right now. War is harsh, it's not pleasant, it's apocalyptic.\n'To be honest it's quite upsetting to see but the responsibility for that is Hamas. They planned the battlefield by digging tunnels underneath the civilian population.\n'I got the call, and I jumped straight on the first pane from Chigaco back to Israel as I'm a reservist.'\nUnder grey skies, the booming artillery unit – motto 'Sophistication and Might' - fired shell after shell at regular intervals with their targets being radioed in with pinpoint accuracy from Gaza by troops on the ground\nIsrael are using Israeli M109 Howitzers and firing shells onto Gaza positions\nWearing ear plugs for protection we were shown around the dozen or so units that have been dug into makeshift bunkers in fields in southern Israel with IDF officials forbidding the exact location from being revealed\nMailOnline has been given exclusive access to an Israeli artillery unit pounding the Gaza Strip as Israel confirmed it had its 'fiercest day of fighting yet.\nIsraeli soldiers sit near where they are firing at the Gaza Strip\nPalestinians and civil defense teams carry out search and rescue operations after Israeli army carried out attacks on al-Shabura refugee camp during the night in Rafah, Gaza on 7 December\nPalestinians mourn relatives killed in the Israeli bombardment on Rafah, Gaza Strip, on 7 November\nMajor Shraga added:' We all have other days job in normal time but when we get the call to defend our country and our people there's no hesitation.\n'The key objectives here are bringing home every single one of our hostages and making sure that Hamas has no military ability.\n'We will continue to do that despite the cost, despite the harshness until we get the job done.'\nBesides Americans, the unit also has reservists from the UK, France and Mexico, who all responded to the call from HQ on October 7 to return and fight.\nMajor Shraga added:' The way the manoeuvre works is that the guys on the ground are being supported by the artillery units here and a shell from here will reach Gaza in twenty seconds.\n'We are here for the moment, but we are awaiting orders to move south, if needed and can pack up and be on our way very quickly.\nBlack Hawk helicopters crisscrossed the sky at various intervals bringing fresh supplies and an impending thunderstorm looming on the horizon gave the area a surreal feel\nUnder grey skies, the booming artillery unit – motto 'Sophistication and Might' - fired shell after shell at regular intervals with their targets being radioed in with pinpoint accuracy from Gaza by troops on the ground\n'Morale is very high and to tell you the truth everyone is deeply motivated not out of hate of Palestinians but a deep feeling that we have no choice.\n'This war was brought upon us by Hamas who brought Hell into our communities and neighbourhoods, and we are staying strong for our families as well.\n'We all want to get home but until we get all the hostages back and dismantle Hamas then we won't be going home.\n'We are united in this, and we will only go home when it's safe to get home.'\nMeanwhile the IDF has revealed that it has seen a massive turnout in female conscripts drafting to units following the oubreak of war.\nIt comes after the Mail revealed last week the dramatic story of the all female tank unit from the Carcala Brigade who had killed 100 terrorist in a legendary battle in southern Israel without suffering one casualty on October 7.\nFigures from the IDF showed that the Artillery Corps had seen a 132 per cent draft and the Air Force 101 per cent with a source saying it was 'more than they had initially planned for'.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Inside the Israeli artillery unit hitting the Gaza Strip", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12836551/Its-apocalyptic-Hamas-dug-tunnels-civilians-Inside-Israeli-artillery-unit-hitting-Gaza-Strip-IDF-close-terror-leaders-home.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}