{"authors": ["Oliver Harvey"], "date_download": "2024-02-05 15:30:12", "date_modify": "None", "date_publish": "2023-12-06 21:35:00", "description": "HIDING for his life, Yoni Saadon watched in horror as a Hamas mob man-handled a woman “with the face of an angel”.The Israeli had crept under the", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24971348%2Fisraeli-women-raped-october-hamas-attack%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/APTOPIX_Israel_Palestinians_32634-0f7a3jpg-JS863384677-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "HIDING for his life, Yoni Saadon watched in horror as a Hamas mob man-handled a woman “with the face of an angel”.\nThe Israeli had crept under the stage at the Supernova desert rave when it was attacked by armed-to-the-teeth terrorists.\n5 Israeli soldiers look at photos of people killed and taken captive by Hamas militants during their attack on the Supernova desert rave on October 7 Credit: AP\n5 Footage shows an armed Palestinian militant walking around the music festival Credit: AFP\n5 Members of the security forces continue to search for identification after the attack - while harrowing testimony has revealed the extent of atrocities on that day Credit: Getty\nAfter an hour, the 39-year-old dad of four peeked out: “I saw this beautiful woman with the face of an angel and eight or ten of the fighters beating and raping her.\n“She was screaming, ‘Stop it — I’m going to die anyway from what you are doing, just kill me!’\n“When they finished they were laughing and the last one shot her in the head.\n“I kept thinking it could have been one of my daughters.”\nYoni’s harrowing testimony to the Sunday Times of rape as a weapon of terror is far from unique.\nYet the welter of vivid evidence reported by respected media outlets — and Hamas’s own sick videos — have not swayed many who would normally be natural allies of raped and mutilated women.\nShamefully, there has been no widespread crescendo of outrage from feminist groups, #MeToo activists, human rights campaigners and social justice warriors.\nThere were no circular letters signed by famous luvvies. And no special hashtag for the defiled women of Israel.\nIt appeared that sympathy for the Palestinian cause meant some could find no place in their hearts for raped and butchered Israeli women.\nIt led Israeli tech boss Danielle Ofek to launch a campaign on Twitter/X with the hashtag #MeTooUnlessUrAJew — its aim to gather a million signatures to acknowledge that every woman’s life is equally precious.\nDespite the deafening silence, multiple heart-wrenching accounts of the rape and mutilation of women have emerged since the massacre.\nThis week the BBC told how Israeli police had shown journalists the video testimony of another Supernova survivor.\nIt’s an extremely shocking and graphic account of barbarity.\nThe woman, known as Witness S, first told how Hamas passed a female partygoer from one attacker to another.\nThen she said: “She was alive. She was bleeding from her back. They sliced her breast and threw it on the street. They were playing with it.”\nWitness S then told how the victim was passed to another man in uniform, who shot her in the head while he was raping her.\nThe BBC also quoted a survivor from the festival saying in a statement: “Some women were raped before they were dead, some raped while injured, and some were already dead when the terrorists raped their lifeless bodies.\n“I desperately wanted to help, but there was nothing I could do.”\nAnd a morgue worker said: “There is evidence of mass rape so brutal that they broke their victims’ pelvis — women, grandmothers, children.”\nPhotographs from massacre sites show dead women naked from the waist down, or with their underwear ripped to one side, their legs splayed and with signs of trauma to their genitals and legs.\nIsraeli police commander Shelly Harush, leading the investigation into the rapes, said: “It’s clear now that sexual crimes were part of the planning, and the purpose was to terrify and humiliate people.”\nIsrael’s Women’s Empowerment Minister May Golan said the “very, very few” victims of rape or sexual assault who survived the attacks were having psychiatric treatment.\nShe added: “The majority were brutally murdered. They aren’t able to talk — not with me, and not to anyone from the government or from the media.”\nMost social media users would have seen the highly distressing images of a handcuffed woman taken hostage, with cuts to her arms and her trousers bloodstained.\nYet the silence from many has left Israeli women feeling ignored by the global feminist movement.\nThe United Nations organisation UN Women — which calls itself “the global champion for gender equality” — had nothing initially to say after the mass rapes on October 7.\nDespite publishing a report on women in the region a few days after the outrage, it remained silent.\n‘Unverified accusation’\nNearly two months after the rape and murder spree — and following intense lobbying by Israeli women’s groups — UN Women finally acknowledged the sexual attacks.\nIt released a statement saying the organisation was “alarmed by the numerous accounts of gender-based atrocities and sexual violence” during the October attacks.\n5 One woman was wedged between two fanatics as they carried her away on a motorbike Credit: AP\n5 Noa Argamani, 25, was snatched from a music festival as she begged for her life Credit: Supplied\nBut Israeli Foreign Minister Eli Cohen slammed the statement as “weak and late”.\nIn Canada an open letter has been gathering signatures among politicos, but rather than decry the Hamas killings and sexual attacks, it denied that women were raped.\nIt criticised opposition New Democratic Party leader Jagmeet Singh for having “repeated the unverified accusation that Palestinians were guilty of sexual violence.”\nAstonishingly, it was signed by Samantha Pearson, director of the University of Alberta’s Sexual Assault Centre.\nThe Jewish Federation of Edmonton wrote: “Shouldn’t a sexual assault centre believe all victims, and not just the non-Jewish ones?”\nPearson was fired from her role.\nIn Britain, Guardian newspaper posterboy Owen Jones — who was at a screening of Hamas atrocities put together by the Israeli Government — said there was no “conclusive evidence” of rape in the images he witnessed.\nHe added: “If there was rape and sexual violence committed, we don’t see that on camera.”\nThe Israel Defense Forces said only footage that “preserved the dignity” of those killed was used out of respect to their families.\nIt was left to fellow Guardian columnist Gaby Hinsliff to point out last week that after reports of the rape of Yazidi and Ukrainian women she couldn’t remember “too many sceptics demanding to see video proof”.\nJones later tweeted: “All allegations of rape and sexual assault must be investigated, including those alleged against Hamas during 7th October atrocity”.\nOn Tuesday Israeli Prime Minister Benjamin Netanyahu told a Press conference: “I say to the women’s rights organisations, to the human rights organisations, you’ve heard of the rape of Israeli women, horrible atrocities, sexual mutilation — where the hell are you?”\nLast week UN secretary general António Guterres finally said that the “numerous accounts of sexual violence during the abhorrent acts of terror by Hamas” should be “vigorously investigated”.\nIsraeli author Hen Mazzig tweeted: “So, it took the top man in the humanitarian world almost TWO MONTHS to believe women and say that there are “reports” of rape that should be investigated?\n“No, sir, it must be condemned, NOW, with your full chest.”", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israeli women were raped and mutilated at gunpoint as they begged to be killed - could Hamas animals sink any lower?", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24971348/israeli-women-raped-october-hamas-attack/"}