{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:30:13", "date_modify": "None", "date_publish": "2023-12-06 16:33:24", "description": "Israel claimed the cache contained hundreds of RPG missiles and launchers of various types, dozens of anti-tank missiles, grenades and UAVs.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12833009%2FIsrael-finds-one-largest-weapons-caches-discovered-Gaza-near-school-hospital.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/16/78649557-0-image-a-61_1701879306359.jpg", "language": "en", "localpath": null, "maintext": "Israel's military today claimed it had found a major arms depot 'in the heart of a civilian population' in Gaza, and said it had seized or destroyed missiles, grenades, drones and other weapons.\n'One of the largest weapons depots in the Gaza Strip was found near a clinic and school' in the north of the Palestinian territory, a statement said.\n'The depot contained hundreds of RPG missiles and launchers of various types, dozens of anti-tank missiles, dozens of explosive devices, long-range missiles aimed at central Israel, dozens of grenades and UAVs,' it continued.\n'Some were destroyed on-site and some were sent for further investigation.'\nImages shared by the IDF showed Israeli soldiers carrying large rockets and packing up shells at the location. Drone equipment can also be seen in the images.\nA statement shared with the images claimed: 'Near a clinic and a school: hundreds of missiles and launchers, long-range rockets, drones and explosive charges ready for use - one of the largest stockpiles of weapons found in the Gaza Strip.'\nImages shared by the IDF claimed to show one of the largest stockpiles of ammo and weapons found in Gaza, retrieved from an area near a school and a hospital\nIsraeli forces were seen moving missiles after discovering what they say was a Hamas cache\nIn its statement on Wednesday, the army called the discovery of the weapons depot 'additional proof of Hamas' cynical use of the residents of the Gaza Strip as human shields'.\nThe International Criminal Court defines the use of human shields - a war crime - as 'utilising the presence of a civilian or other protected person to render certain points, areas or military forces immune from military operations'.\nDuring past conflicts, Amnesty International has documented 'Palestinian armed groups [storing] munitions in and fired indiscriminate rockets from residential areas, which is in violation of international humanitarian law.'\nIsrael has likewise cited what it says as numerous examples of Hamas using human shields as a tactic in the last war in 2014.\nIsrael and the US have suspected for several years that Hamas has placed parts of an elaborate maze of tunnels under civilian infrastructure including Al Shifa hospital, the enclave's largest, in Gaza City.\nThe IDF has also cited this after causing civilian casualties as Palestinians flee to schools and hospitals afforded special protections under the rules of war.\nUsing a hospital as a military base is a war crime. Once used as a military facility, a hospital may lose its the protection afforded to it.\nHospitals thus cannot be attacked directly or prevented from performing their medical functions, according to the International Committee of the Red Cross.\nThere are some grey areas; the discovery of a small weapons cache or the staffing of armed guards may not be enough for a school or a hospital to lose its protections, depending on context.\n'Medical establishments and units enjoy protection because of their function of providing care for the wounded and sick,' the Red Cross clarifies.\n'When they are used to interfere directly or indirectly in military operations, and thereby cause harm to the enemy, the rationale for their specific protection is removed.\n'This would be the case for example if a hospital is used as a base from which to launch an attack; as an observation post to transmit information of military value; as a weapons depot; as a center for liaison with fighting troops; or as a shelter for able-bodied combatants.'\nIsrael must also take precautions not to involve civilians in the fighting, for instance by giving adequate notice to evacuate targeted areas and making sure evacuation is possible.\nResidents and civil defense teams conduct a search and rescue operation at the Nuseirat refugee camp in Deir al-Balah, Gaza on December 6, 2023\nSmoke rises from the Jabalia Camp as residents and civil defense teams conduct search and rescue operations in the rubble of the buildings in Jabalia, Gaza on December 6, 2023\nPalestinians flee the Israeli ground offensive in Khan Yunis, Gaza, Wednesday, December 6\nIsrael has turned its attention to the south of the enclave, having swept through Gaza City\nThe latest toll from the Hamas government's media office said 16,248 people have been killed in Gaza since the start of Israel's campaign, most of them women and children, and mostly due to the sustained bombardment of the Strip.\nLast month, at least 50 people were killed in an Israeli airstrike on a school in Gaza, the Palestinian health ministry said.\nShocking video appeared to show the aftermath of the attack on al-Fakhura, a United Nations-run school which had been converted into a shelter for displaced Palestinians.\nThe health ministry had reported earlier in November that 15 people had also been killed in a strike at the same school.\nUNRWA said four of its schools in the Gaza Strip housing people displaced by the war had been damaged by bombings.\nAt the start of November, Hamas claimed scores of Palestinians had been killed and injured after an Israeli missile strike hit an ambulance convoy.\nBodies were seen strewn across a street in between damaged ambulances. Desperate civilians were seen dragging limp bodies away, some of which left a trail of blood behind.\nIsrael admitted to the attack, saying the vehicle was being used by Hamas.\nAmnesty has also referred to 'damning evidence of war crimes' as Israeli airstrikes 'wiped out entire families' in Gaza.\nAgnès Callamard, Amnesty International’s Secretary General, said as early as October 20: ' In their stated intent to use all means to destroy Hamas, Israeli forces have shown a shocking disregard for civilian lives.\n'They have pulverized street after street of residential buildings killing civilians on a mass scale and destroying essential infrastructure, while new restrictions mean Gaza is fast running out of water, medicine, fuel and electricity.\n'Testimonies from eyewitness and survivors highlighted, again and again, how Israeli attacks decimated Palestinian families, causing such destruction that surviving relatives have little but rubble to remember their loved ones by.'\nAmnesty later found what it said was evidence of Israel's 'unlawful use of white phosphorous in southern Lebanon'.\n'One attack on the town of Dhayra on 16 October must be investigated as a war crime because it was an indiscriminate attack that injured at least nine civilians and damaged civilian objects, and was therefore unlawful, said the organization, a statement read.\nIsraeli soldiers operate a drone near the Israeli-Gaza border, southern Israel, December 6\nAn Israeli military helicopter flies near the border, as seen from southern Israel, December 6\nHaving levelled much of Gaza City in the north, Israel has turned its attention to the south of the besieged enclave since the resumption of hostilities this week.\nIsraeli forces battled with Hamas across Gaza today in intense fighting that has prevented the distribution of vital aid in much of the territory and brought some of the devastation and mass displacement seen in the north to the south.\nAs the focus of the ground offensive moves down the Gaza Strip and into the second-largest city of Khan Younis, it is further shrinking the area where Palestinians can seek safety and pushing large numbers of people, many of whom have been forced to flee multiple times, toward the sealed-off border with Egypt.\nMakeshift shelters and family homes set up in and around the city are already overflowing and many are sleeping in the streets.\nOn the other side of the southern Rafah crossing, thousands of Egyptian troops have deployed to prevent any mass influx of refugees, which Egypt says would undermine its decades-old peace treaty with Israel.\nIsrael meanwhile is now said to have completed installing at least five pumps just north of the Al-Shati refugee camp in an audacious plan to force thousands of cubic metres of water per hour through Hamas' elaborate tunnel network underground.\nTheir aim would be to drive Hamas out of the tunnels and render their suspected bases inoperable by flooding the system with seawater from the Mediterranean Sea.\nSome have already raised concerns about the plan; in a meeting with government officials on Tuesday, one former hostage released during the seven-day ceasefire at the end of November said her husband would be at risk.\n'He was taken to the tunnels, and you talk about washing the tunnels with seawater. You prioritize politics over the hostages!' she was reported as saying.\nDisplaced Palestinians, who fled their houses due to Israeli strike, shelter in a camp in Rafah in the southern Gaza Strip, December 6, 2023\nA general view of destroyed buildings following Israeli attacks on Jabalia Camp in Gaza on December 6, 2023\nSmoke billows on December 6 as Israel continues to bombard the southern Gaza Strip\nSmoke rises over Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 6, 2023\nFormer hostages, released after nearly two months in Gaza, have returned with harrowing stories of being deprived of food, water and medicine while being held underground, putting urgent pressure on Israel to go back to the negotiating table.\n'I was dehydrated for 51 days, they didn't give us water, they are inhumane,' one unnamed woman said.\nOthers allege instances of sexual abuse aimed at both male and female hostages held in Hamas' captivity.\nSome have given wildly conflicting reports, saying Hamas generally took care of them and the food quality only deteriorated amid shortages caused by the siege.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel finds one of the largest weapons caches discovered yet in Gaza - near a school and hospital", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12833009/Israel-finds-one-largest-weapons-caches-discovered-Gaza-near-school-hospital.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}