{"authors": [], "date_download": "2024-02-05 15:15:40", "date_modify": "None", "date_publish": "2024-01-26 20:33:36", "description": "Yemen’s Houthi rebels have launched a missile at a U.S. warship patrolling the Gulf of Aden, forcing it to shoot down the projectile", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fyemen-ap-british-israel-red-sea-b2485699.html.json", "image_url": "https://static.independent.co.uk/2024/01/26/20/APTOPIX_Yemen_Israel_Palestinians_US_72265.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nYemen's Houthi rebels launched a missile Friday at a U.S. warship patrolling the Gulf of Aden, forcing it to shoot down the projectile, and struck a British vessel as their aggressive attacks on maritime traffic continue.\nThe attack on the U.S. warship, the destroyer USS Carney, marked a further escalation in the biggest confrontation at sea the U.S. Navy has seen in the Middle East in decades, as Houthi missile fire set another commercial vessel ablaze Friday night.\nThe Carney attack represents the first time the Houthis directly targeted a U.S. warship since the rebels began their assaults on shipping in October, a U.S. official said on condition of anonymity because no authorization had been given to discuss the incident.\nThat contradicted a statement by the U.S. military's Central Command, which said the Houthis fired “toward” the Carney. As it has in previous strikes, the Pentagon said it was difficult to determine what exactly the Houthis were trying to hit.\nEver since the Israel-Hamas war broke out, the U.S. has tried to temper its descriptions of the strikes targeting its bases and warships to try to prevent the conflict from becoming a wider regional war. For weeks the U.S. and allies also held off on striking Houthi weapons sites in Yemen, but they are now taking regular action, often destroying launch sites that are armed but have not fired, and are deemed an imminent threat.\nAcknowledging Friday's assault as a direct attack on a U.S. warship is important, said Brad Bowman, a senior director at the Foundation for the Defense of Democracies.\n“They’re now finally calling a spade a spade, and saying that, yeah, they’re trying to attack our forces, they’re trying to kill us,” he said.\nTempering the language and response, while aimed at preventing a wider war, has had the opposite effect of further emboldening the Houthis, he said.\nIn Friday’s attack, an anti-ship ballistic missile came near the USS Carney, an Arleigh-Burke class destroyer that’s been involved in American operations to try to stop the Houthi campaign since November, Central Command said.\n“The missile was successfully shot down by USS Carney,” it said. “There were no injuries or damage reported.”\nLater Friday, the British military’s United Kingdom Maritime Operations, which oversees Mideast waterways, acknowledged a vessel had been struck by a missile and was on fire in the Gulf of Aden. A U.S. military official confirmed the vessel was struck by a single anti-ship ballistic missile fired from Houthi-controlled Yemen, damaging the ship. The official said there were no known injuries.\nThe attacks were the latest assaults by the rebels in their campaign against ships traveling through the Red Sea and surrounding waters, which has disrupted global trade amid Israel’s war on Hamas in the Gaza Strip.\nHouthi military spokesman Brig. Gen. Yahya Saree did not acknowledge the Carney attack, but claimed a missile attack on a commercial vessel that set it ablaze. He identified the vessel as the Marshall Islands-flagged tanker Marlin Luanda. The Associated Press could not immediately reach the ship's British managers.\nThe U.S. and Britain have launched multiple rounds of airstrikes since the Houthi attacks began targeting Houthi missile depots and launcher sites in Yemen, a country that's been wracked by conflict since the rebels seized the capital, Sanaa, in 2014.\nSince November, the rebels have repeatedly targeted ships in the Red Sea, saying they were avenging Israel’s offensive in Gaza against Hamas. But they have frequently targeted vessels with tenuous or no clear links to Israel, imperiling shipping in a key route for global trade between Asia, the Mideast and Europe.\nSince the airstrike campaign began, the rebels now say they’ll target American and British ships as well. On Wednesday, two American-flagged ships carrying cargo for the U.S. Defense and State departments came under attack by the Houthis, forcing an escorting U.S. Navy warship to shoot some of the projectiles down.\nThe U.S. Navy’s top Mideast commander told the AP on Monday that the Houthi attacks were the worst since the so-called Tanker War of the 1980s. It culminated in a one-day naval battle between Washington and Tehran, and also saw the U.S. Navy accidentally shoot down an Iranian passenger jet, killing 290 people in 1988.\n___\nCopp reported from Washington.", "source_domain": "www.independent.co.uk", "text": null, "title": "Yemen Houthi rebels fire a missile at a US warship, escalating worst Mideast sea conflict in decades", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/yemen-ap-british-israel-red-sea-b2485699.html"}