{"authors": ["Neha Dhillon"], "date_download": "2024-02-05 15:30:17", "date_modify": "None", "date_publish": "2023-12-06 11:02:43", "description": "ISRAELIS have been arming themselves with glocks, AKs and any other firepower they can get their hands on in a desperate attempt to defend themselves", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24961690%2Fisraelis-armed-assault-rifles-attack%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/2023-jerusalem-gunmen-claimed-hamas-864425730.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "Less than a month after the October 7 attack there were 150,000 gun applications\nCOME PACKING Israelis are armed to the teeth with assault rifles on date nights & days out as they take no chances after Hamas attack\nISRAELIS have been arming themselves with glocks, AKs and any other firepower they can get their hands on in a desperate attempt to defend themselves against future terror attacks.\nHamas' October 7 attacks left fear hanging in the air, and many Israelis have felt an overwhelming need to try and protect themselves.\n6 A young woman on a date felt the need to carry an assault rifle Credit: Getty\n6 Guns slung around women's shoulders is becoming a common sighting Credit: Getty\n6 Israeli president Netanyahu has said that he will help civilians get access to guns Credit: Getty\nThe entire nature of even leaving one's house has been reshaped, and vast amounts of the population have started relying on carrying a gun with them to feel a small sense of security.\nJust a few days ago, a young couple were spotted holding hands and walking through Jerusalem.\nA seemingly ordinary date, until you consider the fact that the young woman had an assault rifle slung around her shoulder.\nThe pictures of this couple have revealed the realities of everyday life in Israel now - a life of fear, uncertainty and harrowing memories.\nSome of those pictured carrying guns will be off-duty troops as it's a legal requirement in Israel for soldiers to carry their personal weapons with them at all times.\nThe rule was brought into force in 2016 after off-duty Israeli soldier Tuvia Yanai Weissman was stabbed to death in a West Bank supermarket by two Palestinian terrorists.\nAll Israelis are required to sign up for military service after they reach the age of 18.\nBut since Hamas' unprecedented attack on October 7, applications for gun licenses have soared.\nLess than a month after the attack there were 150,000 applications.\nThe year before had seen a maximum of 42 applications in any one month.\nThis stark increase has partially derived from Israeli president Binyamin Netanyahu saying that his government would help civilians to arm themselves.\nIn a televised speech after the attacks, he said: \"We are in the midst of a campaign for our existence.\n\"We are encouraging civilians, and are helping civilians to arm themselves with personal weapons for defense.\"\nOn November 30 Hamas conducted another terror attack in Jerusalem that killed three, but was ultimately stopped by an Israreli civilian with a gun.\nIsraeli police revealed: \"Two terrorists arrived at the scene in a vehicle armed with firearms, these terrorists opened fire towards civilians at the bus station and were subsequently neutralized by security forces and a nearby civilian.\nThe city's deputy mayor Fleur Hassan-Nahoum said it was hero civilians who shot the two attackers.\nWhile Israeli Security Minister Itamar Ben-Gvir said that the attack “proves again…that we must speak to Hamas only through (rifle) scopes, only through war”.\nPalestinian civilians fear that these guns will be turned on them.\nPalestinian policy analyst, Mariam Barghouti, described the relaxation of gun laws in Israel as a green light in the intensification of killing Palestinians.\nAlthough she expressed that this has always been a reality in the Israeli occupied West Bank, violence against Palestinians in this region has still spiked since October 7.\nAt least 176 Palestinians have been killed by Israeli forces or Jewish settlers in the West Bank alone.\nA resident of the West Bank, Abdelathim Wadi, told CNN that he and his community are living in fear.\nHe said that he lost his brother and his nephew after they were attacked by armed settlers - while they were on their way to a funeral for four other Palestinians.\nHe said: “There’s no one to defend us.\n\"Our movement is so restricted, we’re constantly living in fear that if we leave our house, we’ll be shot.\"\nThis comes as the UN estimates that close to 16,000 Palestinians have been killed in Gaza since the outbreak of the war.\n70% of this number are accounted for by women and children.\nThe IDF's bombardment and ground invasion has also reduced much of the region to rubble.\nTens of thousands more Palestinians are presumed to still be lying under the debris.\nThe UN has also claimed that as many as 80% of Gaza's population is now internally displaced.\nMost of their 2.3 million people have been driven from their homes, with many seeking refuge under makeshift, tent-like shelters.\n6 An Israeli boy playing with a rifle Credit: AFP\n6 Israel’s National Security Minister Itamar Ben-Gvir handing out M5 automatic assault rifles Credit: EPA", "source_domain": "www.thesun.co.uk", "text": null, "title": "Israelis are armed to the teeth with assault rifles on date nights & days out as they take no chances after Hamas attack", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24961690/israelis-armed-assault-rifles-attack/"}