{"authors": ["Jeremy Fowler", "John Keim", "Multiple Contributors", "Stephen Holder", "Kevin Seifert", "Paul Gutierrez", "Associate Press", "Marcel Louis-Jacques", "Nick Wagoner", "Adam Teicher"], "date_download": "2024-02-05 15:30:19", "date_modify": "None", "date_publish": "2023-12-06 11:30:00", "description": "New owner Josh Harris could be close to calling time on Ron Rivera in Washington. Here's why the 2023 season failed to launch, and what the implications are for the organization.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fnfl%2Fstory%2F_%2Fid%2F39033706%2Fwashington-commanders-crossroads-ron-rivera-eric-bieniemy-josh-harris-next.json", "image_url": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F1205%2Fr1262294_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "ASHBURN, Virginia -- The moment of truth for the 2023 Washington Commanders arrived at the OrthoVirginia Training Center on Oct. 30.\nIt was the day after the Commanders had rallied but fallen short to the NFC East-leading Philadelphia Eagles 38-31, dropping to 3-5 and into a purgatory their league competitors understood well. The NFL trade deadline was coming Tuesday and, with postseason contention not a reasonable scenario, Washington was viewed as a team that might trade away veteran contributors.\nAnd so the trade calls flooded the office lines and personal phones of general manager Martin Mayhew and executive vice president of player personnel Marty Hurney, along with head coach Ron Rivera, who had final say on personnel. Pass-rushers Montez Sweat and Chase Young, players the organization once viewed as potential long-term pillars, were the main topics for trade partners. Other veterans with expiring contracts were also under consideration to be dealt.\nBut the boss would have to weigh in before any moves occurred, and no one at Commanders Park knew exactly what that boss -- a little more than three months into his tenure -- was thinking. New owner Josh Harris, meeting remotely with his football brain trust, faced his first big football decision since he'd been approved as owner on July 20. Harris emphasized he was open to acquiring future draft capital on the trade market, particularly with Sweat and Young, according to front-office and team sources.\nHarris didn't \"roll in as a sheriff,\" as the source put it, in line with the owner's philosophy of leaning on staff to make recommendations before major decisions are made. \"He gave his opinion, everyone was heard, and we landed in a fair spot.\"\nBut when you're calling the shots, a suggestion can often be taken as an edict. Sweat and Young were gone within hours of the meeting, dealt to Chicago and San Francisco for second- and third-round picks, respectively. Within league circles, the terms of the trades were viewed as favorable to the Commanders. But that didn't mean it felt like a win for Mayhew, Hurney or Rivera.\n\"Today ... has not been a good day,\" a personnel source said in a text to ESPN on the evening of Oct. 30.\nRivera, in his fourth season as head coach and without a winning season in Washington, understood the business realities but had hoped to keep enough pieces to salvage the season, team sources said. Coaches, including Rivera and since-fired defensive coordinator Jack Del Rio, especially, wanted to keep Sweat. It would be difficult for any objective observer to argue the Commanders had gotten closer to the 2023 playoffs with their work at the deadline.\nThe front office, meanwhile, has found it difficult to celebrate the acquisition of draft picks someone else will probably be making. If Harris cleans house in January -- or earlier -- those five selections in the top 100 of the 2024 NFL draft, along with $87 million in estimated cap space, would make the head coach and general manager jobs plenty attractive.\nThe team's decision to fire Del Rio after a 45-10 Thanksgiving beatdown by the Dallas Cowboys was likely just the beginning. The future of all the organization's remaining prominent figures, including Rivera and offensive coordinator Eric Bieniemy, is in doubt. What's to come in Washington will remain among the biggest storylines -- and uncertainties -- of the 2024 offseason.\n\"It feels like a new direction is coming across the board,\" a front-office source said.\nRivera's gamble on Sam Howell could have long-term positive consequences for the organization. Photo by Jamie Schwaberow/Getty Images\nENTERING A CRITICAL 2023 season, Rivera's success hinged on two huge, and related, bets. One was on the quarterback, the other on the man who would be telling the quarterback which plays to run.\nQuarterback Sam Howell, a fifth-round draft choice in 2022, was handed the ball with 19 career passing attempts entering 2023. Despite Howell's inexperience and low draft position, Rivera and the staff loved his poise, had confidence in his decision-making and believed they could win with him. That thinking has largely proved to be well founded. Despite being in danger of breaking the NFL single-season record of 76 sacks -- he has been dropped 58 times -- Howell is second in the league in passing yards (3,466) and has accounted for 23 touchdowns (18 passing, five rushing) on the year.\nSeveral team sources have been effusive: Howell has, at minimum, placed himself in the conversation to be the starter in 2024, and possibly longer. \"He's just getting better and better each and every week,\" wide receiver Jahan Dotson said during Week 11. \"Especially his pocket presence -- it's grown tremendously.\"\nThe lion's share of the credit for that belongs to Bieniemy. He spent the previous five seasons as the offensive coordinator with the Chiefs but was not their primary playcaller. Bieniemy came to Washington last winter with a chance to remove the \"not a playcaller\" label that had become an albatross as he was passed over for 15 head-coaching jobs with 14 different teams over the previous five years. Bieniemy's case has served as a boiling point for the scarcity of Black people in head-coaching roles, and the different standards to which candidates of color seem to be held.\nIn Washington, Bieniemy took over an offense with inferior talent to Kansas City's and helped it produce three 30-plus-point games in the first eight weeks. Rivera has approved of the offensive product publicly and privately.\nOffensive coordinator Eric Bieniemy has turned Sam Howell loose in the passing game despite the QB's relative lack of experience. AP Photo/Evan Vucci\nAnd while Howell has performed admirably and Bieniemy has proved he can both design and implement an offense, Rivera's wager on the 54-year-old coach has been something less than an instant jackpot.\nRivera relinquished a degree of power -- and, by extension, some authority within the team -- by bringing in Bieniemy. Rivera wanted to shake things up after the firing of previous OC Scott Turner by giving Bieniemy influence over the team's regular-season practice and meeting schedules, among other areas. Like the Chiefs, the Commanders have switched to a Monday off day during game weeks, instead of the customary Tuesday.\nSome players, including team veterans and those with families, have not warmed to it. \"It's what Bieniemy wants,\" one player grumbled.\nRivera, who like Bieniemy has experience under Chiefs head coach Andy Reid, stood aside on this issue.\n\"Ron has been used to the schedule because of his familiarity with coach Andy Reid,\" Bieniemy said. \"He wanted to change because he felt things had got a little out of whack since they've been doing the same thing over and over and over again. So he wanted to invite the new, which was good because now you're changing up the schedule, you're changing up the way you do things, you're changing up the way you view things.\"\nAmong the players' other issues early in the year, per team sources, was that afternoon offensive meetings frequently ran long and got in the way if players needed treatment. Bieniemy's initial concession was to allow players to use foam rollers on the floor of the meeting rooms to save meeting time, per a team source.\nIn recent weeks, Bieniemy has relaxed some of the demands, including shortening Wednesday practices from two hours to closer to an hour and a half.\n\"He's gotten better at respecting our time,\" one player told ESPN.\nBut Bieniemy's approach remains a matter of some debate. In training camp, when star receiver Terry McLaurin intervened after defensive back Benjamin St-Juste hit a teammate in what McLaurin deemed an overzealous manner, Bieniemy fired an expletive warning for him to return to the huddle. McLaurin wouldn't back down, vowing to defend his teammate.\nAs one Chiefs source said of Bieniemy, \"He's demanding, and he'll push people. And he doesn't care if he ruffles feathers.\" That same Chiefs source said many players in Kansas City needed that push, including quarterback Patrick Mahomes and tight end Travis Kelce.\n\"I'm never going to change who I am,\" Bieniemy said last week. \"I've always been like this, I'm going to be your biggest fan, but I'm also going to be your harshest critic. I know everybody's not perfect, but one thing that they can control is their effort and their attitude.\"\nMultiple sources said Bieniemy and the offensive coaches work well past midnight some nights during the week, less than standard practice in an NFL that typically includes early-morning starts to the workday. One member of the staff said while the long hours are a testament to Bieniemy's stamina, the pace is nearly impossible to maintain -- even in the notoriously sleep-deprived NFL coaching profession -- due to the length of the season.\nBieniemy acknowledged the demands on the staff but said they were part of establishing a winning culture.\n\"When you are a new staff, everybody's getting to know each other,\" Bieniemy said. \"We're establishing a culture of accountability. So in order for us to be an example of what we want our team or our offense to be, we have to set the groundwork.\"\nLike the Chiefs, Bieniemy's offense includes a lot of passing. The Commanders spent significant time with the passing game all offseason, with quick throws and run-pass option plays used as an extension of the running game. That theme has persisted in the regular season, with the Commanders leading the league with 509 passing attempts through Week 13, 59 more than any other team. This is an area several team sources believe Rivera should have addressed with Bieniemy on occasions that called for running the ball. But in line with the authority Rivera gave Bieniemy over the offense, the head coach did not meddle in Bieniemy's offensive plan.\nAfter a 14-7 loss to the New York Giants on Oct. 22, McLaurin was critical of the scheme, lamenting the low number of fades and crossing routes called for him against the Giants' blitz. Howell threw McLaurin his first fade late in the third quarter for a 27-yard gain.\n\"I would definitely like to see us continue to get those up early because I think it really forces defenses to play more honest,\" McLaurin said after the game. \"They can't blitz, and the safeties are at 10, 12 yards. They can't do that if you're beating them down the field.\"\nMcLaurin, who was held without a catch in Sunday's loss to the Dolphins, has met weekly with Bieniemy since that public criticism.\n\"I've had conversations with a number of players, and the beauty of it is some are very, very good and productive,\" Bieniemy told ESPN. \"I wish they would share some of their thoughts with me because when it's all said, done with, this is about us. But we are going to do what we feel is best for the team.\"\nWhile changes in both on- and off-field approach have prevailed since Bieniemy came aboard, the wins have not followed -- and the offense has scored 20 or fewer points in four of the past five games. The losing has amplified some of the grumbling both about Bieniemy's style and playcalling. But Bieniemy's defenders insist the complaints are unfair to a coach trying to revamp a system with mediocre talent in some areas.\n\"He took over a tough situation there in Washington and has worked hard to correct it,\" an executive with an NFC team said. \"They needed a culture shock there. I think he's probably helped his profile.\"\nRivera agrees that should be the narrative around Bieniemy, rather than any dissension with his methods.\n\"What he's doing with our quarterback right now shows he's capable,\" Rivera said. \"Are we struggling? Yeah, we're struggling. But there's more things to it.\"\nRivera gave Del Rio autonomy to run the defense, but the unit fell from grace under the coordinator's watch in 2023. Geoff Burke-USA TODAY Sports\nON THE PLANE ride back to Washington following the Commanders' Thanksgiving Day drubbing at the hands of the Cowboys, Rivera watched and graded the game film, focusing on a critical stretch late in the first half.\nWashington had cut the Dallas lead to 14-10 just inside the two-minute warning, with a chance to carry the momentum into halftime if the Commanders' defense could hold its ground.\nBut on back-to-back plays, it allowed a 24-yard gain on a deflected pass from Cowboys quarterback Dak Prescott to receiver Jalen Brooks, followed by a 31-yard pass to Jalen Tolbert that came as a result of a Washington coverage breakdown. Now inside the 10-yard line, the Cowboys scored on the next play to move ahead 20-10. The Commanders never got back in it.\nAs he reviewed the film, and reflected on the game and season, Rivera considered whether to fire Del Rio, a team source said.\nDel Rio was a two-time NFL head coach who a year ago had led one of the league's top defenses in Washington. The jettisoning of Sweat and Young, predictably, had done Del Rio's defense few favors.\nBut the Commanders' defense had struggled even before those trades and, by Thanksgiving, had cratered to last place in points allowed (29.2 per game) and 29th in total defense (377.7 yards per game).\nRivera pondered the impact of moving on. If he fired Del Rio, how would he divide up his tasks? By the time he arrived home, Rivera's mind was racing. He got to sleep around 3 a.m. but woke up a little more than two hours later. As he drove to the team facility, he knew the move needed to be made.\nRivera waited until around 8 a.m. to call Harris, spending his time mapping out the new structure and each coach's responsibilities. When he called, a source said, the owner asked why he wanted to make the move, as well as the plan moving forward. Harris, who generally believes staff changes should be made at the head coach's discretion, approved the move.\nRivera visited Del Rio's office to deliver the news, an interaction coaching staff sources characterized as professional but less than warm. Rivera then exited Del Rio's office, took a few steps into the office of defensive backs coach Brent Vieselmeyer and delivered another blunt message: Vies, we have to let you go.\n\"They knew this was ending eventually,\" a team source said. \"They just got it early.\"\nChase Young brought undeniable talent to the Commanders defense, but was also known to freelance at times. Photo by Jess Rapfogel/Getty Images\nThe unraveling of the Commanders' once-stifling defense has been the biggest surprise of the season. Del Rio and Vieselmeyer took the fall, but their failures also reflect on Rivera, a former NFL linebacker and two-time defensive coordinator whose reputation had been forged on that side of the ball. Washington rebuilt the offense around Bieniemy and Howell with the hope any growing pains would be mitigated by the presence of a proven defense, one that ranked in the top 10 in just about every major category last season.\nThat hope had proved to be a miscalculation.\nThere was a feeling among players and team sources that the more Washington struggled, the more complicated its scheme became. Some players said the game plan didn't change enough; others said the rules of the defense changed and led to on-field breakdowns. Rivera and Del Rio were communicating weekly on how to improve and \"everyone was on the same page,\" per the head coach, which is why Del Rio was at least mildly surprised by the timing of his firing.\n\"One game, we were out-efforted. One game, we might be outschemed. Another game, they just, little things, like a great stretch and three plays where we exhaled and lost it.\"\nOthers sensed uncertainty when Del Rio's contract was not extended last offseason beyond 2023, despite the Commanders' third-ranked total defense. Most coaches with existing deals did not get renewed, due in part to the ownership change. But this left Del Rio's future with the team murky.\nDel Rio is described by team sources as fair but opinionated and \"strong-willed.\" Rivera, as one of the sources put it, \"had to do something\" for defensive players who \"felt defeated, didn't know how to win and didn't believe coaches knew of a way to fix what was going on.\"\n\"We talked a lot about things,\" Rivera said of his interactions with Del Rio throughout the year. \"First of all, what we did schematically, I had no issue with it. It was good. It was good stuff. This was just one of those things when the snowball effect, and [the sequence in the Dallas game] before the halftime ... that was a tough pill to swallow.\"\nDel Rio's scheme was built on discipline up front, especially within rushing lanes, and Young was known to freelance. A group defined largely by its star-studded pass rush wasn't getting enough sacks, a surprise not only because of Young and Sweat, but also handsomely paid defensive tackles Jonathan Allen and Daron Payne.\n\"The thing that's frustrating, it's not one thing,\" Allen said days before Del Rio was let go. \"One game, we were out-efforted. One game, we might be outschemed. Another game, they just, little things, like a great stretch and three plays where we exhaled and lost it. The great defenses don't give up for a second or a play. And that's what we have to get to.\"\nRecent contracts for Allen and Payne, coupled with the defensive line's struggles, informed the decisions to move Young and Sweat, according to front office sources. The Commanders believed it would take top dollar to retain both pass-rushers. In the case of the Sweat deal, the offer of a second-round pick -- which will likely come near the top of the round considering Chicago's 4-8 record -- was too tantalizing to turn down.\nBut in the four games that followed the trades, Washington allowed 122 points and recorded seven sacks without enough difference-makers among the remaining defenders.\nThe Commanders are not getting enough from their draft picks on the defensive side of the ball. While linebacker Jamin Davis (first round, 2019) and safety Kamren Curl (seventh round, 2020) have been productive, 2022 second-round tackle Phidarian Mathis has played six games in two years because of injury.\nRookie second-round defensive back Quan Martin played a combined 15 snaps in the first seven games; his role increased the past two games because of injuries to others. Washington's rookie class overall has not yielded an immediate impact as third-round lineman Ricky Stromberg, who played 24 snaps in the first eight games, is on injured reserve because of a right knee injury and fourth-round lineman Braeden Daniels, who struggled in camp, has been on season-long IR because of a rotator cuff injury.\nFirst-round rookie corner Emmanuel Forbes impressed in the preseason but struggled when Washington asked him to cover top receivers such as the Philadelphia Eagles' A.J. Brown and Chicago Bears' DJ Moore, assignments for which he wasn't ready. Forbes was benched for multiple games, and while he had returned to the lineup and played better, he has missed the past two games because of an elbow injury.\nThe decision to draft Forbes and cast him in such a prominent role was rooted in a cornerback need that arose when the team cut William Jackson III in the middle of the 2022 season. The Commanders had signed Jackson, a press-man corner, in 2021, then asked him to play zone coverages, which weren't his strong suit.\n\"He was done before he started,\" a scouting department source said of Jackson.\nBy late in the season, six of Rivera's draft picks were in the starting lineup, due in part to injuries. This was a challenge because Del Rio's scheme is considered \"complicated mentally,\" as one team source put it. The 2022 defense had more experience.\nThe coordinator changes cast a pall over Rivera's future because of how much faith and responsibility he places in them. Several team sources said Rivera defers to his coordinators on decision-making, sometimes to a fault.\n\"Ron needed to take more ownership,\" one of the team sources said.\nRon Rivera (right) and first-year team owner Josh Harris have communicated regularly throughout the 2023 season. AP Photo/Evan Vucci\nIN THE MOMENTS after Del Rio's and Vieselmeyer's firings went public, Harris released a statement.\n\"I knew our first season of ownership would include challenges along the way,\" the statement read in part, \"and we will not shy away from hard work, nor will we be deterred by adversity. As Coach Rivera and I discussed, all of our energy for the remainder of the season will be focused on playing better, more consistent football and developing our players while intently evaluating the areas in which we need to improve this offseason.\"\nWhen reached by ESPN for this story, a spokesperson for Harris added that while ownership is disappointed by the team's struggles on the field this season, optimism for the future remains strong. The spokesperson said the ownership group has taken its first season as an opportunity to fully evaluate all facets of the organization with the goal of building a team that can win sustainably over the long term.\n\"Do you think [Harris] paid $6 billion for the former Carolina regime?\"\nThe reference to offseason improvements in the Black Friday statement was a less-than-subtle hint about what is likely to come. In contrast to his predecessor Daniel Snyder's impetuous and impulsive ways, Harris has taken a measured approach to his management of the organization, including giving Rivera and the front office a full season on the job. But Harris' history as a team owner with the NBA's Philadelphia 76ers, the NHL's New Jersey Devils and Crystal Palace of the Premier League suggests he won't hesitate to make changes after the season. His teams have fired two coaches in 2023 already -- the Sixers' Doc Rivers and CPFC's Patrick Vieira -- though neither of those moves were particularly unexpected.\nBut the fact that Rivera was retained and permitted to make the call on firing Del Rio, sources within the Commanders said, is telling of another reality -- Rivera has a direct line to Harris, and recent weeks on the job have showcased a coach trying his best to save that connection. Harris has developed a \"solid and respectful\" working relationship with Rivera in recent months, a source close to Harris said.\nHarris has not been known for his impulsiveness as an owner, but has also not been afraid to make changes within his franchises. Brad Mills-USA TODAY Sports\nRivera was considered a slam-dunk hire for Washington in December 2019, when he was coming off a nine-season tenure in Carolina that included 76 wins, four playoff appearances and the team's second Super Bowl bid. Snyder signed Rivera to a lucrative five-year deal, giving him personnel control along with head-coaching duties.\nIn his four seasons with the Commanders, Rivera has been viewed as a likable and calming presence amid the many Snyder calamities that led to his eventual sale of the team. Beyond the professional side of things, Rivera has also dealt with a 2020 diagnosis of squamous cell cancer of the neck and the death of his mother, Dolores, last fall.\nAll of that would be enough to challenge a coach's intensity, but multiple players insist the 61-year-old Rivera has remained steadfast, and many called him a \"good man\" when discussing him.\n\"This team believes in Coach Rivera,\" tackle Andrew Wylie said. \"We're rallying behind him.\"\nBut with Washington sitting at 26-36-1 during his tenure, questions about Rivera's ability to maximize the team's ability persist. Rivera often begins meetings with three words that serve as team pillars: \"Attitude. Preparation. Effort.\" Feeling the mantra was ringing hollow, Rivera stopped using it this season, a team source said.\n\"For whatever reason, the players just didn't seem to be fired up this year,\" one front-office source said of Rivera's motivational impact.\nThat source also noted Rivera showed more fire on the sidelines around the midseason mark. \"I see him getting into huddles, talking to players, getting on referees. He senses the urgency.\"\nA few weeks back, coming off the ugly loss to the Giants, Rivera showed the team clips from early in the season of good practice habits. Sensing a team losing its edge, Rivera sent a clear message: This is what we do and how we work.\n\"Just reminding us what we can do when we do things the right way and how good as a team we can be,\" Allen said. \"I think [it resonated].\"\nSunday's 45-15 home loss to the Miami Dolphins, in which the Commanders were not competitive, casts doubt on that contention.\nMultiple team sources said they believe Rivera is at peace with his tenure, a theme he alluded to in a Week 11 news conference.\n\"S---, I've been through enough,\" Rivera said. \"The last 3½ years has not been easy. Anyone who thinks it's been easy, the hell with them. I'll be honest. That's how I feel about the last three years. It's been a lot. We've done a lot, we've had our moments. The thing that feels good at the end of the day and the questions that need to be asked: Is the culture better, and have we found the quarterback? That's all I can control. Our guys will show up and play hard to the bitter end, and we'll see what happens.\"\nThe futures of key figures inside the front office, meanwhile, are uncertain at best. Multiple sources with the team and sources close to those on the chopping block said wholesale changes from the top down are possible, if not likely.\nMayhew, who won a Super Bowl as a player with Washington in the early '90s, is a well-respected executive with general manager experience with the Commanders and Lions. He has worked closely alongside Rivera since 2021.\nHurney filled that same role for Rivera in Carolina, then came to Washington as a key figure in player evaluations. Senior director of player personnel Eric Stokes also came from Carolina.\nAs one source close to the team wondered from the FedEx Field sideline before the Week 5 loss to the Bears, \"Do you think [Harris] paid $6 billion for the former Carolina regime?\"\nThat begs another question: What exactly will Harris be looking for in a head coach and front office? Several league sources wonder whether Harris will emphasize analytics with his choices, similar to the model he favored in choosing Daryl Morey as GM of the 76ers. In late October, Harris hired Eugene Shen to head the Commanders' analytics department.\nBut the owner has shown he values a balance of analytics and on-field experience, such as the Morey-Elton Brand setup in Philly or the way his Devils general manager, former NHL player Tom Fitzgerald, is supported by a strong analytics department.\nMinority owner Magic Johnson also figures to be prominent in the Commanders' future. People in the building have seen the former NBA legend around multiple times since Harris took over, and it is not believed he'll be content with serving in a low-visibility or low-impact role.\n\"A lot of arithmetic working right now,\" one team official said. \"You'll see improvements, probably some new people in the building, all over the operation.\"\nFour games remain for the front office, Rivera and his remaining players and coaches to prove themselves.\nThe final two will come at FedEx Field against the San Francisco 49ers and the Cowboys, a pair of NFC teams headed for the playoffs and emblematic of the results Commanders fans expect Harris to deliver.\n\"Everyone is always being evaluated,\" Allen said. \"We're playing for our jobs. There's going to be a lot of change, which there is every year.\"", "source_domain": "www.espn.co.uk", "text": null, "title": "How the Commanders reached the crossroads and what comes next", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/nfl/story/_/id/39033706/washington-commanders-crossroads-ron-rivera-eric-bieniemy-josh-harris-next"}