{"authors": ["James Franey", "James Franey For Dailymail.Com"], "date_download": "2024-02-05 15:30:21", "date_modify": "None", "date_publish": "2023-12-06 18:48:50", "description": "Three sources familiar with the Virginia-based firm's plans said the company will ramp up domestic production of arms supplies amid concerns about Kyiv 's flagging counteroffensive.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12832625%2FGeneral-Dynamics-Ukraine-weapons-plant-claims-Joe-Biden-force-Kyiv-negotiating-table-Russia.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/18/78657443-0-image-a-1_1701888523681.jpg", "language": "en", "localpath": null, "maintext": "President Volodymyr Zelensky's chief of staff is currently in the U.S. for talks with defense industry bigwigs\nUkrainian officials have spoken openly about the need for investment from abroad to rebuild their defense industry\nGeneral Dynamics, based in Reston, Virginia, wants to open an artillery factory in western Ukraine producing 155-millimeter shells within six months\nTop defense firm General Dynamics, a major contractor for the U.S. military, is planning to open a new weapons factory in western Ukraine, DailyMail.com can reveal.\nIt means that U.S. taxpayers look set to bankroll Ukraine's weapons supplies via lucrative Pentagon contracts for years to come with no end in sight to the nearly two-year war.\nThree sources familiar with the Virginia-based firm's plans said the company will ramp up domestic production of arms supplies amid concerns about Kyiv's flagging counteroffensive to boot out Russia's armed forces from its occupied territories.\nA proposal was drawn up last month and sent to Ukraine's government to set up the manufacturing facility in the west of the country, which has been largely unscathed from Vladmir Putin's brutal invasion, within the next six months.\nThe revelations would also appear to cast doubt on recent German media reports that the U.S. and Germany are working on a secret plan to force Ukraine to the negotiating table and end the war.\nZelensky cancelled a U.S. Senate address on Tuesday where he was set to call on Congress to approve more aid to Ukraine. His chief of staff, Andriy Yermak, said there was a 'big risk' of Ukrainian defeat without U.S. support.\nThe firm, one of the major suppliers to the U.S. military, is also unperturbed about the possibility of Donald Trump winning November's presidential election.\n'It means that we are, one way or another, going to be in this for the long haul,' said one source, who declined to be identified owing to the sensitivity of the plans.\nA Ukrainian official said that other major U.S. defense companies could follow suit and set up local production to send arms to the frontline.\n'It's not only General Dynamics considering the establishment of a venture in Ukraine. It will be a trend for the next several years,' the source said.\nDailyMail.com understands that the facility will largely focus on producing 155-millimeter shells, a NATO-standard artillery round, that have been key to the Ukrainian fightback against Russia.\nMoscow currently produces roughly a million artillery shells a year; Ukrainian president Volodymyr Zelensky complained last month that deliveries of munitions from his allies had 'slowed down.'\nZelensky unexpectedly cancelled an address to the US Senate on Tuesday where he would have appealed for fresh aid for the war in Ukraine.\nThe 155 mm shells can be packed with highly explosive material, use precision guided systems, pierce armor or produce high fragmentation.\nPast variants have included smoke rounds to obscure troop movement and illumination rounds to expose an enemy's position.\nThey are being fired by Ukraine's military at a rate of 6,000 to 8,000 rounds a day, according to Ukrainian MP Oleksandra Ustinova, who serves on Ukraine's wartime oversight committee.\nIt comes as senior U.S. and Ukrainian government officials, including Zelensky's chief of staff Andriy Yermak, are meeting in Washington on December 6 and 7 with industry bigwigs to rebuild the war-torn nation's defense sector.\nBut Antone Voronin, deputy director of Ukraine's government-owned defense company Spets, said in September that the country needed to bring in fresh funding from abroad to do so.\n'If we can get new investors, they can give us the possibility of building factories outside the country and inside the country,' he said. 'Then our facilities grow, our manufacturing grows and that helps supply the Ministry of Defense.\nGeneral Dynamics also produces other weapons that have been supplied to Ukraine.\nThey include the Guided Multiple Launch Rocket System (GMLRS), which are missiles that have a 45-mile range packed with cluster bombs, combat vehicles such as Stryker and Abrams tanks.\nThe U.S. has also given Abrams battle tanks, seen here in a joint military training exercise with NATO members Bulgaria and Georgia, to Ukraine\nUkrainian servicemen fire with a French self-propelled 155 mm/52-calibre gun Caesar towards Russian positions on the Donbas frontline\nThe company recently reported bumper quarterly revenues of more than $10 billion, boosted by demand from Ukraine's counteroffensive.\nDemand for 155 mm artillery rounds has soared in the wake of Russia's invasion.\nAllies' supplies for their own defense have been run down as they have rushed shells to Kyiv.\nThe U.S. plans to increase its monthly production rate for 155-millimeter artillery shells to 100,000 in 2025.\nArtillery has 'been a big pressure point up to now with Ukraine, one that we've been doing everything we can to support our (U.S.) Army customer,' Jason Aiken, General Dynamics' chief financial officer, said at the time.\nA spokeswoman for the firm refused to be drawn on the location or the cost of the planned facility, directing DailyMail.com's queries to the U.S. military.\nPentagon spokesman Jeff Jurgensen said: 'We are actively working with interagency partners and industry to explore approaches for aiding Ukraine in expanding the capacity and capability of its domestic industrial base for the long-term.'\nThe developments also come as U.S. lawmakers bicker over whether to sign off on a $105 billion aid package for Ukraine and Israel.\nRepublicans have so far refused to back the Biden administration's request, arguing any extra funds for Ukraine should be linked to tougher new border measures.\nBiden's funding request also calls for production to be ramped up to restock supplies that have already been given to the Ukrainian military, potentially boosting jobs in the United States.\nSince the Ukraine war began in February 2022, the US Congress has approved and earmarked more than $110bn (£87bn) in military and economic aid to Kyiv.\nU.S. officials have warned for months, however, that most of that money has already been distributed.\nThe Biden administration is pushing Congress to sign off on a new aid package for Ukraine, that also includes security assistance for Israel\nThe Ukrainian military's counteroffensive has stuttered in recent months. Officials in Kyiv blame slow deliveries of Western arms for the recent lack of progress.\nThat long-running spat over funding comes as Kyiv's long-awaited counter-offensive in the south appears to have stuttered, with Ukrainian officials blaming the slow progress on the speed of Western weapons deliveries.\nThe Ukrainian forces are also struggling to hang on to a foothold they had established on the east bank of the vast Dnipro river.\nMeanwhile, defense and military intelligence officials in Ukraine have accused Russian forces of killing their own injured soldiers to stop them from surrendering to Ukrainian troops.\n'The fact is that the Russians do not allow their soldiers to surrender,' Oleksandr Stupun, a spokesman for Ukraine's Tauride Defense Forces, said during a television interview on Monday.\n'There have even been cases when Russian drones have killed their own wounded,' he said, according to the Kyiv Post.\nAndriy Yusov, a representative for Ukraine's military intelligence agency, said such incidents had been recorded multiple times, including in footage captured by Ukraine's own drones.\nRussia has killed its own soldiers as 'a reaction to the fact that there are quite a few people willing to surrender to Ukrainian captivity,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Top U.S. defense firm General Dynamics is planning to open weapons plant in Ukraine - an investment that implies taxpayers will continue to dole out dollars to support war that has no end in sight", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12832625/General-Dynamics-Ukraine-weapons-plant-claims-Joe-Biden-force-Kyiv-negotiating-table-Russia.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}