{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Richard Luscombe", "Martin Belam", "Kevin Rawlinson", "Reged Ahmad"], "date_download": "2024-02-05 15:30:22", "date_modify": "None", "date_publish": "2023-12-06 01:11:37", "description": "This blog has now closed. Read our full report on the latest developments in Gaza here and our report on a UN meeting to hear accounts of sexual violence committed by Hamas on 7 October here.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F05%2Fisrael-hamas-war-live-updates-news-idf-southern-gaza-attack-palestine-khan-younis.json", "image_url": "https://i.guim.co.uk/img/media/4f3c4595d75cc858156f14af72ad34825d14d3ec/0_481_7219_4332/master/7219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=f8001807509b08d3eb4bf79b24658d98", "language": "en", "localpath": null, "maintext": "From 5 Dec 2023 23.25 CET Biden urges global condemnation of sexual violence by Hamas during 7 October attacks Joe Biden has spoken about “horrific” reports of sexual violence by Hamas during its 7 October attacks on Israel as he blamed the militant group’s refusal to release female hostages for the end of the recent ceasefire. Speaking at a political fundraiser in Boston on Tuesday, the US president said survivors and witnesses of the attacks and shared accounts of “unimaginable cruelty” over the past few weeks. “The world can’t just look away at what’s going on,” he said, adding: Reports of women raped – repeatedly raped – and their bodies being mutilated while still alive, of women’s corpses being desecrated, Hamas terrorists inflicting as much pain and suffering on women and girls as possible and then murdering them. He said it was “on all of us – government, international organizations, civil society and businesses – to forcefully condemn the sexual violence of Hamas terrorists without equivocation”. Biden also called on Hamas to release the female hostages it is still holding in Gaza, saying the group’s refusal to free them had led to the breakdown of a truce with Israel. He said Hamas had “refused to let go” a number of women aged between 20 and 39 under the deal, adding: These women and everyone still being held hostage by Hamas need to be returned to their families immediately. We’re not going to stop until we bring every one of them home and it’s going to be a long process.\nUpdated at 23.31 CET\n6 Dec 2023 02.01 CET It’s not good for the US to be “identified with so much killing, former Irish president Mary Robinson has told CNN in the wake of a statement by the Elders group calling on the US and other countries to reconsider their military aid to Israel. Robinson, who is the chair of the Elders group of global leaders and a former UN human rights commissioner, told the US broadcaster: We as Elders are asking that countries that provide military aid, notably the United States to Israel, now have to urgently review military assistance and put in place conditions for any future provision. I think it’s really necessary. I’ll tell you why – if this doesn’t happen, then the United States owns the problem. And that is not good for the United States, that the United States would be identified with so much killing. In their statement on Monday, the Elders – a group founded by Nelson Mandela – called for government to set conditions for any future provision of arms to Israel. They warned that the military campaign in Gaza risked “fuelling an escalating cycle of mass atrocities”. It continued: Israel’s disproportionate response to the horrendous terror attacks by Hamas on 7 October – which the Elders unequivocally condemned - has reached a level of inhumanity towards Palestinians in Gaza that is intolerable.\n6 Dec 2023 01.43 CET Israel says it regrets death of Lebanese soldier in cross-border fire Agence France-Presse has filed a full report on the death of a Lebanese soldier in cross-border fire with Israel and the Israeli military’ subsequent apology. The news agency writes: A Lebanese soldier was killed by Israeli fire on a military post near the country’s southern border Tuesday, the army said, the first such death since cross-border hostilities began in October. The Lebanon-Israel border has seen intensifying exchanges of fire since the war broke out between Hamas and Israel, mainly involving Iran-backed Hezbollah, raising fears of a broader conflagration. “An army military position in the... Adaysseh area was bombarded by the Israeli enemy, leaving one soldier martyred and three others injured,” the Lebanese army said in a statement. Israel’s army acknowledged the incident, saying in a post on X, formerly Twitter, that it had targeted a Hezbollah position in an effort “to eliminate an imminent threat”. “The Lebanese Armed Forces were not the target of the strike,” the Israel Defense Forces said, adding it regretted the incident. Later Tuesday, Israeli shelling killed a Syrian labourer when it hit the chicken farm where he worked, according to Lebanon’s National News Agency (NNA) and a local official. Israel shelled and carried out air strikes on southern Lebanon, while Hezbollah claimed attacks on Israeli positions, NNA said. More than 110 people have been killed on the Lebanese side since October, mostly Hezbollah fighters and more than a dozen civilians, according to an AFP tally. Israel says six of its soldiers and three Israeli civilians have been killed. The United Nations peacekeeping mission (UNIFIL) says its headquarters in southern Lebanon has been hit by shelling several times. Commenting on the Lebanese soldier’s death, UNIFIL said in a statement: “The Lebanese Armed Forces have not engaged in conflict with Israel. “During the last days, we have seen a rapid and alarming increase in violence,” UNIFIL added, urging an end to “the cycle of violence, which could lead to devastating consequences for people on both sides.” Hezbollah, an Iran-backed Shiite Muslim group, has not had a visible military presence on Lebanon’s southern border since the end of a 2006 conflict with Israel, but says it resumed activities in support of Hamas after its October 7 attack on Israel.\n6 Dec 2023 01.28 CET Israel revokes visa for top UN aid official Israel has revoked the visa of the top UN humanitarian aid official for the Palestinian Gaza Strip and West Bank, foreign minister Eli Cohen has said. In a post on X, Cohen accused Lynn Hastings of failing to condemn Hamas for the 7 October massacre and kidnapping of civilians and instead condemning Israel. He said she “cannot serve in the UN and cannot enter Israel!” We will no longer be silent in the face of the bias of the UN!\nI decided to revoke the residence visa to Israel of the UN \"humanitarian\" coordinator Lynn Hastings.\nSomeone who did not condemn Hamas for the brutal massacre of 1,200 Israelis, for the kidnapping of babies and the… — אלי כהן | Eli Cohen (@elicoh1) December 5, 2023 Israel had already said last week it would not renew Hastings’ visa. The veteran UN official has served as the deputy special coordinator for the Middle East peace process and UN humanitarian coordinator for the Occupied Palestinian Territory for nearly three years. Speaking on Friday, UN spokesperson Stephane Dujarric told reporters that UN secretary-general Antonio Guterres has full confidence in Hastings. Dujarric did not say whether Hastings would be replaced. View image in fullscreen Lynn Hastings, head of the UN’s humanitarian operations in the Occupied Palestinian Territory, visits Gaza City in May 2021. Photograph: Nidal al-Mughrabi/Reuters\nUpdated at 01.34 CET\n6 Dec 2023 01.06 CET US officials expect the current phase of Israeli ground operations in southern Gaza to last several weeks before the military transitions, possibly by January, to “a lower-intensity, hyper-localized strategy that narrowly targets specific Hamas militants and leaders,” CNN has reported citing multiple senior officials in the Biden administration. However, the administration is deeply concerned about how the next few weeks will unfold, one official told the broadcaster. They said that the US had warned Israel in “hard” and “direct” conversations that the military cannot use the same devastating tactics it used in the north and that it must do more to limit civilian casualties. However US warnings appear to have had little effect on Israel. The UN’s top aid official told the Guardian on Tuesday that the Israeli military campaign in southern Gaza has been just as devastating as in the north, creating “apocalyptic” conditions and ending any possibility of meaningful humanitarian operations. “What we’re saying today is: that’s enough now. It has to stop,” Martin Griffiths said, adding that the small amount of aid being allowed into Gaza could no longer be distributed.\n5 Dec 2023 00.43 CET The Israeli military (IDF) has issued a rare apology after an IDF strike killed a Lebanese soldier and injured three others on Tuesday, saying it had been targeting Hezbollah militants on its northern border with Lebanon. In a post on X, the military said, “Earlier today, IDF fighters acted to neutralise a tangible threat detected from Lebanese territory. “The threat was detected from a launch and observation complex of the terrorist organization Hezbollah near Al Awadi on the Lebanese border. “A report was received in the IDF that a number of soldiers from the Lebanese army were injured during the attack. Lebanese army forces were not the target of the attack. The IDF regrets the incident, which is being investigated.” מוקדם יותר היום, לוחמי צה\"ל פעלו לניטרול איום ממשי שזוהה משטח לבנון. האיום זוהה ממתחם שיגור ותצפית של ארגון הטרור חיזבאללה סמוך לאל עוואדי שבגבול לבנון>> — צבא ההגנה לישראל (@idfonline) December 5, 2023 This is Helen Livingstone, taking over from my colleague Léonie Chao-Fong.\n5 Dec 2023 00.19 CET Peter Beaumont As the Israel Defense Forces (IDF) said they were pushing ahead with the second phase of the ground offensive against Hamas, towards the southern city of Khan Younis, it became clear they were still involved in intense combat to control substantial areas of northern Gaza. Gen Yaron Finkelman, the head of the IDF’s southern command, said on Tuesday: “We are in the most intense day [of fighting] since the beginning of the ground operation in terms of Hamas terrorists killed, the number of encounters with the enemy and the volume of fire our forces use, both from the ground and the air. We intend to continue attacking.” Despite pushing into the centre of Gaza City, including to the main hospital, Dar al-Shifa, the IDF is still engaged in heavy fighting for key urban areas in the north, which it says Hamas and other factions use as strongholds, including Jabalia refugee camp and Shuja’iya on the east of Gaza City. Other officials said the IDF was now operating inside Shuja’iya and Jabalia, which have been described as the last Hamas strongholds in the north. Since the collapse of a temporary ceasefire between Israel and Hamas during which militant-held hostages were swapped for Palestinians held in Israeli prisons, the Israeli military has launched an intense campaign of airstrikes and ground fighting in the southern Gaza Strip as well. Underlining the sense that worse fighting may be ahead as Israel tries to advance into some of the most dense urban areas, an Israeli government spokesperson said on Tuesday that the next phase would be challenging. Israel faces difficult phase of war with fighting in north and south Gaza Read more\n5 Dec 2023 23.51 CET Israel is considering flooding tunnels used by Hamas under the Gaza Strip in a bid to destroy the group’s underground network, Israel’s army chief has confirmed. A Wall Street Journal report on Monday said Israel’s army has assembled a large system of pumps that could flood the approximately 300 miles of Hamas tunnels in Gaza. The report said that Israel’s army had completed the set-up of at least five pumps about a mile north of the al-Shati refugee camp that could flood the tunnels within weeks. Asked about the report on Tuesday, Israel’s top military commander, Lt Gen Herzi Halevi, said flooding the tunnels could be a “good idea” and that it was “one of a number of options we are considering”.\nUpdated at 23.55 CET\n5 Dec 2023 23.36 CET Peter Beaumont Recently released hostages and relatives of Israelis still held by Hamas in Gaza have confronted Benjamin Netanyahu at an angry meeting in which some of those present reportedly called on the Israeli prime minister to resign. The meeting on Tuesday was addressed by relatives of those still in captivity and by recently returned hostages, some of whom reportedly described mental and physical abuse at the hands of their captors. Reuven Yablonka, whose son Hanan Yablonka is still being held by Hamas, told the Hebrew daily Maariv that “there was chaos and yelling” at the meeting in which some representatives of the hostage families reportedly walked out as Netanyahu read from pre-prepared remarks. Yablonka said: They shouted that they want all the hostages to come home. The female captives talked about unpleasant things that happened to them. What was described as leaked audio from Tuesday’s meeting appeared to record Netanyahu saying that it had not been possible to free all the hostages in a single deal. By the latest count, 138 Israelis and other nationals are still being held by Hamas in Gaza. “I’m telling you the facts, I respect you too much. We couldn’t bring them all at once. If we could have done it, we would have,” Netanyahu reportedly said. If there was a chance to bring them all in one fell swoop, do you think anyone here would object? Excerpts from audio – which the Guardian has not been able to verify – were broadcast by Kan, the Israeli public broadcaster.\nUpdated at 23.54 CET\n5 Dec 2023 23.25 CET Biden urges global condemnation of sexual violence by Hamas during 7 October attacks Joe Biden has spoken about “horrific” reports of sexual violence by Hamas during its 7 October attacks on Israel as he blamed the militant group’s refusal to release female hostages for the end of the recent ceasefire. Speaking at a political fundraiser in Boston on Tuesday, the US president said survivors and witnesses of the attacks and shared accounts of “unimaginable cruelty” over the past few weeks. “The world can’t just look away at what’s going on,” he said, adding: Reports of women raped – repeatedly raped – and their bodies being mutilated while still alive, of women’s corpses being desecrated, Hamas terrorists inflicting as much pain and suffering on women and girls as possible and then murdering them. He said it was “on all of us – government, international organizations, civil society and businesses – to forcefully condemn the sexual violence of Hamas terrorists without equivocation”. Biden also called on Hamas to release the female hostages it is still holding in Gaza, saying the group’s refusal to free them had led to the breakdown of a truce with Israel. He said Hamas had “refused to let go” a number of women aged between 20 and 39 under the deal, adding: These women and everyone still being held hostage by Hamas need to be returned to their families immediately. We’re not going to stop until we bring every one of them home and it’s going to be a long process.\nUpdated at 23.31 CET", "source_domain": "www.theguardian.com", "text": null, "title": "IDF says it regrets killing of Lebanese soldier - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/05/israel-hamas-war-live-updates-news-idf-southern-gaza-attack-palestine-khan-younis"}