{"authors": ["Geneva Abdul"], "date_download": "2024-02-05 15:30:23", "date_modify": "None", "date_publish": "2023-12-06 18:52:10", "description": "Sigalit Cohen, whose son Eliya was kidnapped from the Supernova festival, has spent her time since campaigning for the hostages’ return", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F06%2Feliya-cohen-israel-hostage-family-agony-gaza-fighting.json", "image_url": "https://i.guim.co.uk/img/media/49c44428d5ad05763087823922b20dd66209a70e/0_174_7373_4426/master/7373.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b63fb02e93208a9d0372a630fc83b862", "language": "en", "localpath": null, "maintext": "On the Sabbath morning of 7 October, Sigalit Cohen could hear alarms sounding from her home in Tzur Hadassah, just outside Jerusalem. Hours later she learned of the unprecedented attack by Hamas in southern Israel, in which more than 1,200 people were killed and 240 taken hostage, including her son.\nEliya Cohen, 27, was at the Supernova music festival with his girlfriend, Ziv, three miles from the Gaza border when Hamas militants attacked partygoers. At least 260 people were killed in the festival grounds in one of the deadliest attacks on Israel in decades. Israel’s offensive in Gaza in response has killed more than 15,000 people, mostly women and children, according to Gaza’s health authorities.\nCohen, 55, said: “It was a very bad dream, I didn’t know what to do, I was in shock. I just sat in the chair and slapped my face to see if I’m in the real world or if it’s a dream.”\nWithin hours of the alarms, Cohen received a phone call from Ziv’s sister telling her of the attack. Ziv was missing but Eliya was said be OK, confirmed by a photograph of him in hospital. But an hour later she received a Facebook message from Eliya’s high school friend asking if she knew that her son had been abducted.\nView image in fullscreen ‘We miss his laugh’: Eliya Cohen.\n“That was the message when I understood that something’s wrong with Eliya,” said Cohen. She was sent the same photo of her son, this time overlaid with Arabic text saying he was in Gaza.\n“At the first moment, I think it’s fake. I tried to call all the hospitals in the south and when I had no answer from the hospital that Eliya is there, I understood that he’s kidnapped,” she recalled. Three days later, confirmation came from Israeli soldiers.\nAt the beginning of December, fighting resumed in Gaza after a temporary ceasefire expired, during which 80 Israeli hostages were released by Hamas in exchange for 240 Palestinian prisoners. According to Gaza’s health authorities, more than 1,200 Palestinians have been killed since the end of the ceasefire.\nOn Tuesday, the Israel Defense Forces (IDF) spokesperson, R Adm Daniel Hagari, said Israel had not lost sight of its “critical mission” to rescue the 138 hostages still in Gaza. They include 17 women and children, according to the Israeli army, which confirmed the death of five hostages.\nHagari said: “Our intelligence has been monitoring the situation of our hostages and I can say with absolute certainty every minute in Hamas captivity endangers their lives. The Israel Defense Forces will do everything in its power to rescue our hostages and bring them home.”\nOn the morning of 7 October, Eliya and Ziv ran as the alarm sounded at the festival. They made it to their car, later abandoning it to seek shelter with nearly 30 others near the Re’im kibbutz. Hours later, two vans of Hamas militants arrived and opened fire on the group, Cohen was later told by Ziv, who survived.\n“She was under the bodies for three hours, she didn’t move,” said Cohen, who was told Eliya had been shot in the leg and fell on top the bodies. Ziv felt her boyfriend being pulled away, and later understood he had been abducted.\n“We miss him very much. We miss his laugh, he was full of life and we don’t know anything about him,” said Cohen. “I just want to see him, to feel him, to smell him, to see that he’s OK, that he’s not hurt in his body and his soul.”\nSince the attack, Cohen has stopped working in her job as an accountant, instead travelling to Washington and London to campaign for the release of her son and the other hostages. When asked if she would like the Israeli government to stop its offensive in Gaza, she declined to answer.\n“We hope and we know that the Israeli army is trying not to harm the hostages, of course, and the civilians in Gaza; [they] just want to clear terrorists from Gaza,” she said. “I just want my son home.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘I just want my son home’: agony of hostage’s family amid Gaza fighting", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/06/eliya-cohen-israel-hostage-family-agony-gaza-fighting"}