{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:30:24", "date_modify": "None", "date_publish": "2023-12-06 07:04:55", "description": "The statement came after Israel launched an offensive in southern Gaza after the ceasefire ended.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Ftop-un-official-calls-conditions-gaza-apocalyptic-1722021.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721756/gaza-strip.jpg", "language": "en", "localpath": null, "maintext": "The Israeli military campaign in Gaza has created \"apocalyptic\" conditions in the southern part of the territory, a top United Nations aid official has warned.\nMartin Griffiths, the UN emergency relief coordinator, said in a warning issued on Tuesday that it is becoming increasingly difficult to supply aid to the affected residents of Gaza. The statement came after Israel launched an offensive in southern Gaza after a 7-day truce in hostilities between Hamas and the Israeli military.\nHe says the military offensive has made it difficult for the aid workers to continue their work in the region. Griffiths has called for an immediate end to the fighting.\n\"It isn't really a statistically significant operation (supplying aid) any more,\" Griffiths told The Guardian. \"It's a bit of a patch on a wound and it doesn't do the job, and it would be an illusion for the world to think that the people in Gaza can be helped by the humanitarian operation under these conditions.\n\"This is an apocalyptic situation now, because these are the remnants of a nation being driven into a pocket in the south,\" he said.\nWhat is the current situation in Gaza?\nThe Israel Defense Forces (IDF) launched a ground operation in northern Gaza weeks after Hamas killed over 1,200 Israelis in a brutal, unprecedented attack. Hamas attacked Israel with a barrage of some 2,000–5,000 missiles. It brutally massacred Israelis (mostly civilians) and took over 200 hostages in the surprise assault.\nIsrael had then asked civilians in Gaza to move to the south to escape Israeli airstrikes and military operations. However, the operation has been extended to southern Gaza as well.\nOn Friday, Israel's military began posting grid-based maps on their social media handles, asking Palestinians to move towards the Mediterranean coast and Rafah. It has now surrounded Khan Yunis, Gaza's second-largest city. The city has seen intense bombing in the last few days. It is home to around 117,000 people.\nThe UN humanitarian office, OCHA, has said that around 1.8 million people (80 per cent of the population) have had to leave their homes and seek safety in temporary shelters, schools, and hospitals.\n\"Nowhere is safe in Gaza and there is nowhere left to go,\" said Lynn Hastings, UN humanitarian coordinator for the Palestinian territories.\nA UN special rapporteur has asked for a stop to the \"massacre of civilians\". The ongoing war has already killed more than 15,000 Palestinians, the majority of them women and children, according to the United Nations.\nIsrael has vowed to continue the operation until it has \"destroyed\" Hamas. \"We are going to continue with our campaign to destroy Hamas, a campaign that the United States sees eye to eye with us about,\" Israeli government spokesperson Eylon Levy said on Tuesday.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Top UN Official Calls Conditions In Gaza 'Apocalyptic'", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/top-un-official-calls-conditions-gaza-apocalyptic-1722021"}