{"authors": [], "date_download": "2024-02-05 15:30:26", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Yemen?s Iran-backed Houthi rebels took responsibility for the attack ? but didn?t acknowledge targeting a US vessel\r\n\r\n\r\nAn American warship an", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274053506%2Fus-warship-attacked-pentagon.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1701634431.jpg", "language": "en", "localpath": null, "maintext": "Yemen's Iran-backed Houthi rebels took responsibility for the attack ? but didn?t acknowledge targeting a US vessel\nAn American warship and multiple commercial vessels came under attack in the Red Sea on Sunday, the Pentagon said, in what is being seen as the latest in a series of maritime attacks on regional shipping routes linked to the Israel-Hamas war.\nIn a statement released by the Department of Defense, US officials did not immediately identify the source of Sunday's attack. Soon after, Yemen's Iran-backed Houthi rebels said that two ships linked to Israel had been attacked by its forces with a drone and a missile but did not acknowledge targeting a US Navy vessel.\n\"We're aware of reports regarding attacks on the USS Carney and commercial vessels in the Red Sea and will provide information as it becomes available,\" the Pentagon said in a statement to the Associated Press. It did not state what damage - if any - the USS Carney, an Arleigh Burke-class destroyer, sustained in the attack.\nEarlier on Sunday, the UK's Maritime Trade Operations agency said that it had been made aware of reports of a drone attack in the Bab el-Mandeb strait of the Red Sea. It also stated that drones originating from Yemen were active in the area and that there had been a possible explosion.\nA series of maritime attacks have been reported in the Middle Eastern waters as the outbreak of war between Israel and Hamas threatens to spiral into a wider regional conflict. Last month, Houthi rebels seized a vehicle transport ship linked to Israel in the Red Sea off the coast of Yemen.\nHouthi militants have previously fired ballistic missiles and armed drones at Israeli targets and have promised to continue targeting Israeli vessels in the region.\n\"The Yemeni armed forces continue to prevent Israeli ships from navigating the Red Sea (and Gulf of Aden) until the Israeli aggression against our steadfast brothers in the Gaza Strip stops,\" Houthi spokesman Brig. Gen. Yahya Saree said in a statement claiming responsibility for Sunday's attacks.\nSaree also issued a warning: \"All Israeli ships or those associated with Israelis will become a legitimate target if they violate what is stated in this statement.\" He made no mention of a US warship in the statement.\nAccording to the Navy Times, the USS Carney shot down an Iranian-made drone that was heading toward its position from Yemen-controlled territory. It added that the incident occurred a day after another Iranian drone came within 1,500 yards of the aircraft carrier Dwight D. Eisenhower as it was in international waters in the Arabian Gulf.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "US warship attacked Pentagon", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274053506/us-warship-attacked-pentagon"}