{"authors": ["Adam Manno", "Charlie Bradley"], "date_download": "2024-02-05 15:15:41", "date_modify": "None", "date_publish": "2024-01-26 18:22:00", "description": "EXCLUSIVE: The UN's International Court of Justice (ICJ) has warned against genocidal acts but not ordered a ceasefire amid reports of Gazans being trapped on the edge of the under-fire enclave.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1860273%2Fpalestine-trapped-al-mawasi-un-israel-genocide.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5183827.jpg", "language": "en", "localpath": null, "maintext": "Tents at Al-Mawasi (left) and a huge explosion in Gaza City (right)\nAl-Mawasi is a small strip of land in Gaza\nTrending\nHe said: \"Khan Younis has been under heavy bombardment and invasion by the IDF since the beginning of December. \"It was previously declared a safe zone for Gazans for the north to come to but that designation by Israel has since been revoked, and Palestinians in Khan Younis have been told to head to a humanitarian zone in al-Mawasi, a tiny coastal town with few facilities that Israel has also been bombing as of late. \"The city has seen entire residential blocks demolished, civil defense crews targeted with airstrikes, and Israeli soldiers have filmed themselves bulldozing Palestinian homes.\" Al-Mawasi had been designated as a humanitarian zone, but people on the ground reported that it hasn't been pleasant to stay there.\nMany Palestinians are stuck in the coastal area\nTrending\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nKhan Younis has seen intense fighting and bombardment", "source_domain": "www.express.co.uk", "text": null, "title": "Palestinians 'trapped' in bombarded coastal town as UN stops short of ordering ceasefire", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1860273/palestine-trapped-al-mawasi-un-israel-genocide"}