{"authors": ["Elena Salvoni"], "date_download": "2024-02-05 15:30:27", "date_modify": "None", "date_publish": "2023-12-06 18:05:17", "description": "Sinwar, who was elected leader of Hamas in Gaza in 2017, is considered to be one of the masterminds behind the bloody October 7 attacks. Israel has said the terror chief is a 'dead man walking'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12833529%2FHamas-terror-chief-Israeli-tanks-home-Yahya-Sinwar-Netanyahu.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/17/78654855-0-image-a-16_1701885598127.jpg", "language": "en", "localpath": null, "maintext": "Israeli forces have encircled the home of top Hamas leader Yahya Sinwar in Gaza, Prime Minister Benjamin Netanyahu announced today, as he vowed to capture the terror chief.\n'Yesterday I said that our forces could reach anywhere in the Gaza Strip. Today they are encircling Sinwar's house,' Netanyahu said in a recorded video statement.\n'His house may not be his fortress and he can escape but it's only a matter of time before we get him.'\nSinwar, who was elected leader of Hamas in 2017, is considered to be one of the masterminds behind the bloody October 7 attacks, which saw terrorists storm southern Israel.\nHamas's Gaza chief has been in hiding ever since, and while there is no indication of whether he was in his Khan Younis home, Israel has called him 'a dead man walking'.\nIsrael Defence Forces Spokesman Rear Admiral Daniel Hagari suggested the whole of southern Gaza's largest city could be targeted in pursuit of Sinwar, saying tonight that '[his] home is the Khan Younis area.'\nHagari added: 'Sinwar is not above ground, but underground. I won't elaborate on where exactly and what we know. Our job is to get to Sinwar and kill him.'\nIsrael has vowed that Hamas leader Yahya Sinwar (pictured here in Gaza City in 2022) is 'a dead man walking'\nPeople watch as others search for victims amid the rubble of a smouldering building following strikes in Rafah in the southern Gaza Strip\nIsraeli tanks roll near the border with the Gaza Strip on December 5, 2023\nIsraeli Prime Minister Benjamin Netanyahu vowed to capture Hamas terror chief Yahya Sinwar\nA picture taken from Rafah on the southern Gaza Strip on December 6, 2023, shows smoke billowing during Israeli bombardment in Gaza\nPictures show fires raging after bombing in the south, including in Rafah which borders Egypt\nThe Chief of the Israel Defense Forces' (IDF) General Staff, Lieutenant General Herzi Halevi, also suggested yesterday that his troops are closing in on Sinwar.\n'We are attacking the center of gravity', Halevi said, adding: 'we are asked frequently about the destruction in Gaza - Hamas is the address. Sinwar is the address.'\nIsraeli forces were encircling the southern city today, fighting terrorists in intense street battles in some of the fiercest combat of the two-month war.\nPictures tonight show fires raging after bombing in the south, including in Rafah which borders Egypt - where thousands of displaced people have been sheltering.\nThe focus of the conflict has shifted to the besieged territory's south following fierce fighting and bombardment that reduced much of the north to rubble and forced nearly two million people to flee their homes.\nAnd despite Washington's desperate calls for Israel to prevent yet more bloodshed in Gaza and provide more aid, Israeli forces, backed by warplanes, reached the heart of Khan Younis yesterday and surrounded the city - trapping the thousands of exhausted civilians who had fled there.\nThe IDF aims to wipe out the Hamas leaders it believes are hiding in Khan Younis while using innocent civilians as human shields.\nSpokesman Hagari said on Wednesday evening that the IDF had broken through Hamas's defenses in =Shejaiya and Jabalia in northern Gaza, as well as in Khan Younis.\n'In the last 48 hours, in Jabalia, Shejaiya, and Khan Younis, we breached the defense lines,' he said.\n'The terrorists are coming out from underground and fighting our forces. And our forces are winning in close-quarters combat, they have the upper hand.'\nThe cost of the war continues to mount, with more than 16,248 Palestinians killed since the conflict broke out two months ago, according to the Hamas-run Health Ministry in Gaza.\nPalestinian children wounded in the Israeli bombardment of the Gaza Strip arrive at a hospital in Rafah\nMedics tend to two Palestinians injured in Israeli bombardments of the Gaza Strip\nResidents and civil defence teams conduct a search and rescue operation around the rubble of a building that collapsed following an Israeli attack at the Nuseirat refugee camp in Deir al-Balah, central Gaza\nA picture taken from southern Israel near the border with the Gaza Strip on December 6\nToday, Israeli tanks, troops and bulldozers encircled the southern city after what the IDF said was the 'most intense day of fighting' since the war began.\nIsraeli air strikes obliterated buildings within Khan Younis today, with the IDF claiming it had killed several Hamas commanders in a strike near the Indonesia Hospital.\nUnited Nations Secretary-General Antonio Guterres today warned the Security Council that the war between Israel and Palestinian Hamas militants in the Gaza Strip 'may aggravate existing threats to international peace and security.'\nGuterres invoked the rarely used Article 99 of the founding U.N. Charter that allows him to 'bring to the attention of the Security Council any matter which in his opinion may threaten the maintenance of international peace and security.'\n'We are facing a severe risk of collapse of the humanitarian system. The situation is fast deteriorating into a catastrophe with potentially irreversible implications for Palestinians as a whole and for peace and security in the region,' Guterres wrote in a letter to the 15-member council.\n'Such an outcome must be avoided at all cost,' he said.\nIsraeli troops and tanks gather near the border with the Gaza Strip on December 3\nA Palestinian woman stands in a destroyed room in a building as she inspects the site of Israeli strikes in Khan Younis on Wednesday\nIsraeli troops are pictured here in the Gaza Strip, in this image released by the IDF today\nHe also warned that public order in Gaza will 'completely break down soon due to the desperate conditions'.\nIsrael's widening air and ground offensive in southern Gaza has displaced tens of thousands more Palestinians and worsened the territory's dire humanitarian conditions.\nBitter fighting has prevented the distribution of food, water and medicine and new military evacuation orders from the IDF have forced civilians into a shrinking area of land.\nIsraeli tanks in the Gaza Strip amid their continued ground invasion of territory\nThe United Nations said 1.87 million people - more than 80 per cent of Gaza's population - have been driven from their homes since the start of the Israel-Hamas war, triggered by the deadly October 7 Hamas assault on southern Israel.\nIsrael declared war on Hamas after the terrorist group's October 7 attacks that killed 1,200 people and saw around 240 hostages taken.\nIsrael has has vowed to destroy Hamas and free the 138 hostages still held after scores were freed during a short-lived truce, which ended last week.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hamas terror chief's lair is surrounded: Israeli tanks have circled the home of Yahya Sinwar as Netanyahu warns 'it's only a matter of time before we get him'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12833529/Hamas-terror-chief-Israeli-tanks-home-Yahya-Sinwar-Netanyahu.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}