{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:30:29", "date_modify": "None", "date_publish": "2023-12-06 18:29:36", "description": "UN secretary general says situation ‘fast deteriorating into catastrophe with potentially irreversible implications’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F06%2Fisrael-and-hamas-fight-house-to-house-battles-across-gaza.json", "image_url": "https://i.guim.co.uk/img/media/1838b9510191c54c0f9fa3b660225c8093518e62/0_68_3386_2032/master/3386.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fefd94cb6af8ae9aa9655ce7d719438f", "language": "en", "localpath": null, "maintext": "Israeli forces and Hamas are fighting house-to-house battles along the length of the Gaza Strip, with devastating consequences for the civilian population amid a complete collapse in humanitarian relief.\nAs the war intensified on Wednesday, the UN secretary general, António Guterres, invoked a rarely used clause in the UN charter to raise the issue on his own initiative before the security council, to warn that the conflict “may aggravate existing threats to international peace and security”.\n“We are facing a severe risk of collapse of the humanitarian system,” Guterres wrote in a letter to the council. “The situation is fast deteriorating into a catastrophe with potentially irreversible implications for Palestinians as a whole and for peace and security in the region.”\nHe added: “Amid constant bombardment by the Israel Defense Forces, and without shelter or the essentials to survive, I expect public order to completely break down soon due to the desperate conditions, rendering even limited humanitarian assistance impossible.\n“An even worse situation could unfold, including epidemic diseases and increased pressure for mass displacement into neighboring countries.”\nAs the Israel Defense Forces (IDF) have been fighting their way through badly bomb-damaged urban areas in northern and southern Gaza, Hamas has increasingly relied on improvised bombs to inflict casualties and slow down the assault.\nGaza’s hospitals have reported a flood of civilian dead and injured, many of them women and children, as medical supplies dwindle, while the spread of ground combat to the south has stopped any delivery of humanitarian aid much farther than the Rafah crossing point with Egypt.\nThe Hamas-run Gaza health ministry said 1,207 Palestinians had been killed since the collapse of a temporary ceasefire at the beginning of the month, and that 70% of the dead were women and children.\nThe ministry said more than 100 bodies were currently awaiting burial inside the Kamal Adwan hospital in northern Gaza, which it said was without fuel and was coming under fire. “The entire north of the Gaza Strip is left without health services,” Munir al-Bursh, the director, said.\nThe focal points of the fighting over the past two days have been the Jabaliya refugee camp and the Shujai’iya district in northern Gaza, and Khan Younis and Bani Suheila in the south.\nThe IDF has taken control of most of the Salah al-Din Road, the main north-south highway running down the middle of the coastal strip.\nOn Wednesday morning, the IDF called on residents of Khan Younis to flee the city for safer areas, noting that there would be a pause until 2pm in the bombardment of Rafah, immediately to the south on the Egyptian border.\nThe UN and aid agencies say nowhere in Gaza is safe any more. According to the UN, 1.87 million people, more than 80% of Gaza’s population, have left their homes. Many have had to flee shelter several times to avoid the Israeli advance.\nThe UN Human Rights Office said on Tuesday that “the pattern of attacks that target or impact on civilian infrastructure raises serious concerns about Israel’s compliance with international humanitarian law and significantly raises the risk of atrocity crimes”.\nThe Norwegian Refugee Council said the Gaza war now ranked “amongst the worst assaults on any civilian population in our time and age”.\nIsrael’s prime minister, Benjamin Netanyahu, claimed that the IDF was winning the war and that more than half of Hamas’s battalion commanders had been killed.\n“The ground shook in Khan Younis and Jabaliya. We have encircled them both. There is no place we cannot reach,” Netanyahu said on Tuesday. He said the IDF was winning every battle, but at “an unbearable price”.\nThe IDF reported seven casualties on Tuesday and two more on Wednesday morning. Since ground operations began, 84 IDF soldiers have been reported killed in the ground operation, many of them as a result of bombs and anti-tank missiles fired at close range.\n“Palestinian militia fighters continued to use more sophisticated tactics to target Israeli forces throughout the Gaza Strip,” the Washington-based Institute for the Study of War said in a report co-authored with the American Enterprise Institute’s critical threats project. It cited an incident on Tuesday in which Hamas’s military wing used explosives to bring down a house on top of Israeli soldiers in Khan Younis and detonated an armour-piercing shaped charge against an Israeli tank.\nHamas was also able to launch 15 rockets from Gaza hideouts on central and southern Israel on Tuesday.\nThe IDF said Khan Younis had become the main Hamas stronghold after the ground assault on the north began on 27 October, with four of the extremist movement’s 24 battalions based there.\nIsraeli commanders believe that the Hamas hierarchy, including its leader, Yahya Sinwar, could be hiding in the extensive tunnel network below the city. Sinwar was born in the Khan Younis refugee camp and late on Wednesday, Israel’s prime minister Benjamin Netanyahu said the IDF were encircling the the Sinwar family home.\n“Yesterday I said that our forces could reach anywhere in the Gaza Strip. Today they are encircling Sinwar’s house. His house may not be his fortress and he can escape but it’s only a matter of time before we get him,” Netanyahu said.\nThe Biden administration has continued to urge Israel to do more to limit civilian casualties. Martin Griffiths, the UN’s top aid official, said the IDF campaign in the south was just as devastating for the Palestinian population as its operations in the north, with US diplomacy making no difference to the outcome.\nOfficials from the US vice-president Kamala Harris’s office are in Israel for talks on what should happen to Gaza after the war, which was started by a Hamas rampage through Israeli villages that killed 1,200 people, more than two-thirds of them civilians, on 7 October.\nIncreasing evidence is emerging of extreme sexual crimes committed by the Hamas attackers against female victims.\nWashington has insisted there should be no long-term Israeli military presence in Gaza, but Netanyahu has claimed there is no option for his country’s security other than direct military control.\n“Gaza must be demilitarised. And in order for Gaza to be demilitarised, there is only one force that can see to this demilitarisation – and that force is the IDF,” the prime minister said in a written statement on Tuesday.\n“No international force can be responsible for this. We have seen what has happened in other places where they brought in international forces for the goal of demilitarisation. I am not prepared to close my eyes and accept any other arrangement.”", "source_domain": "www.theguardian.com", "text": null, "title": "UN chief warns Gaza aid delivery could collapse as Israel and Hamas fight house-to-house", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/06/israel-and-hamas-fight-house-to-house-battles-across-gaza"}