{"authors": ["Nataliya Vasilyeva", "James Rothwell", "Jerusalem Correspondent", "Berlin Correspondent"], "date_download": "2024-02-05 15:30:30", "date_modify": "None", "date_publish": "2023-12-06 00:00:00", "description": "Israeli troops have been photographed setting up pumps to flood Hamas’s tunnels with seawater.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F12%2F06%2Fisrael-hamas-war-hostages-latest-news%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/12/06/TELEMMGLPICT000359078019_17018618840250_trans_NvBQzQNjv4BqrWYeUU_H0zBKyvljOo6zlm8nGi5dnbzU1Uvp1fqu20E.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Israeli troops have been photographed setting up pumps to flood Hamas’s tunnels with seawater.\nThe Israel Defense Forces (IDF) released images on Wednesday of dozens of soldiers laying pipes on Gaza’s Mediterranean Coast.\nIt was reported earlier this week that the IDF was considering whether to flush out the 300-mile tunnel network and had completed construction on five pumps about a mile north of the Al-Shati refugee camp.\nThe pumps could move thousands of cubic metres of water per hour but experts warn the move could damage Gaza’s water supply.\nLt Gen Herzi Halevi, the IDF’s chief of staff, said on Tuesday that flooding the tunnels was “a good idea” when asked about the reports.\n“Any means which gives us an advantage over the enemy, deprives it of these assets, is a means that we are evaluating using,” he said, without giving any further specifics.\nOn Wednesday, Israeli media also released footage of troops apparently working on the pipes underground, with black pipes swelling with water after a valve was turned.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Israeli forces pictured setting seawater pumps to flood Hamas tunnels", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/12/06/israel-hamas-war-hostages-latest-news/"}