{"authors": [], "date_download": "2024-02-05 15:30:32", "date_modify": "None", "date_publish": "2023-12-06 11:48:42", "description": "On the brink of joining NATO, Sweden has signed a defense cooperation agreement with Washington that will allow the United States access to all of the military bases across the Scandinavian country, saying the deal would bolster regional security", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fsweden-ap-nato-recep-tayyip-erdogan-washington-b2459354.html.json", "image_url": "https://static.independent.co.uk/2023/12/06/11/US_Sweden_34847.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nOn the brink of joining NATO, Sweden has signed a defense cooperation agreement with Washington that will allow the United States access to all of the military bases across the Scandinavian country, saying the deal would bolster regional security.\nSwedish Defense Minister Pål Jonson said the deal, signed in Washington Tuesday, “will create better conditions for Sweden to be able to receive support from the United States in the event of a war or crisis.”\nJonson told Swedish broadcaster SVT that it didn’t mean that “all 17 locations will be used“ but ”where it is most important from a military perspective for them to be able to store defense equipment, for example.”\nThe deal was signed at the Pentagon by Jonson and U.S. Defense Secretary Lloyd Austin who said that by adding the capabilities of the Swedish armed forces to NATO, ”we will get even stronger.”\nThe deal “sends a strong signal that we remain committed to addressing security challenges together,” Austin said.\nSweden’s strategically important Baltic Sea island of Gotland sits a little more than 300 kilometers (186 miles) from the Russian Baltic Sea exclave of Kaliningrad.\nThe United States struck a similar deal with Sweden's western neighbor, NATO member Norway, in 2021 and is currently negotiating such an agreement with NATO members Finland and Denmark, two other Nordic countries.\nSweden and its neighbor Finland decided to drop their long-standing policy of non-alignment and apply for NATO membership following Russia’s full-scale invasion of Ukraine last year. Finland joined NATO in April.\nNew members must be approved by all existing members of the alliance. Turkey and Hungary are the only NATO countries that have not formally approved Sweden’s accession bid.\nTurkey has delayed ratification for more than a year, accusing Sweden of not taking Turkey’s security concerns seriously enough, including its fight against Kurdish militants and other groups that Ankara considers to be security threats.\nIn comments published Wednesday by state-run Anadolu Agency, Turkish President Recep Tayyip Erdogan linked the ratification of Sweden’s NATO membership to the approval by the U.S. Congress of Turkey’s request to purchase 40 F-16 fighter jets and kits to modernize its existing fleet.\nThe request has been backed by the White House but run into opposition in Congress.\n“I fulfilled my duty, but I also expect something from you,” Erdogan told a group of journalists, on his way back from Qatar where he attended the 44th Gulf Cooperation Council Council summit. \"You (the United States) should pass the (F-16s) issue simultaneously in your Congress.”\nLast week, NATO Secretary-General Jens Stoltenberg said he told Turkey’s president that “the time has come” to let Sweden become a member of the military alliance.", "source_domain": "www.independent.co.uk", "text": null, "title": "NATO member-to-be Sweden and the US sign defense deal, saying it strengthens regional security", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/sweden-ap-nato-recep-tayyip-erdogan-washington-b2459354.html"}