{"authors": ["Associated Press", "Dominic Yeatman For Dailymail.Com"], "date_download": "2024-02-05 15:30:34", "date_modify": "None", "date_publish": "2023-12-06 15:22:55", "description": "The American was abducted from his home in a Ukrainian village, stripped naked, tortured and asked for his 'last words' during a mock execution", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fushome%2Farticle-12832965%2FDOJ-war-crimes-Ukraine-Russians-merrick-Garland.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/16/78649683-0-Attorney_General_Merrick_Garland_speaks_with_reporters_during_a_-a-7_1701879024071.jpg", "language": "en", "localpath": null, "maintext": "The US has filed war crime charges against four Russians accused of kidnapping an American civilian from his home in Ukraine who was stripped naked, tortured and asked for his 'last words' during a mock execution.\nThe DOJ case marks the first prosecution against Russians in connection with atrocities during their war against Ukraine and is the first war crimes case involving the victimization of an American, officials said.\nThe American was living with his wife in the eastern village of Mylove when he was abducted and held for ten days in April last year at a Russian military base by Suren Seiranovich Mkrtchyan, Dmitry Budnik, and two men known as Valerii and Nazar.\nHe told US investigators that he was repeatedly beaten with fists, boots and rifle stocks and had a gun held to the back of his neck during a mock execution where he was asked for his 'last words'.\n'Again and again, he believed he was about to die,' Attorney General Merrick Garland told a news conference this morning.\nThe American was living peacefully with his wife in the Ukrainian village of Mylove when he was abducted from his home and tortured for ten days by Russian troops\nRussia had taken the village within days of their invasion on February 24 but fierce fighting still raged across the Kherson region\n'The Justice Department and the American people have a long memory.\n'We will not forget the atrocities in Ukraine. And we will never stop working to bring those responsible to justice.'\nAll four Russians are identified as members of the Russian armed forces or its proxy units. Two of them are described as senior officers. None of the four is in custody.\n'During the abduction, we allege that those defendants threw the victim to the ground while he was naked, tied his hands behind his back, pointed a gun at his head, and beat him with their feet, their fists, and the stocks of their guns,' Garland said.\n'As they interrogated him, they tortured him. They beat him, again, with a gun. They punched him in his chest and stomach. They threatened to shoot him. They stripped off his clothes and took pictures. One of their conspirators threatened to sexually assault him.\n'And during the interrogation, when the victim's answers did not satisfy the defendants, we allege that Budnik, who was also a commanding officer, threatened the victim with death and asked for his last words.\n'Nazar and other co-conspirators then took the victim outside. There, they forced him to the ground and put a gun to the back of his head. The victim believed he was about to be killed.\n'They moved the gun just before pulling the trigger, and the bullet went past his head.\n'After the mock execution, the victim was beaten and interrogated again.\n'At one point, he was told through an interpreter that he was 'going to sleep,' and he was told by Mkrtchya: 'goodnight' — leading the victim to believe, again, that he was about to be killed.'\n'The evidence gathered by our agents speaks to the brutality, criminality, and depravity of Russia´s invasion,' Mayorkas said.\nThe village of Mylove was deep inside Russian-held territory when the American was abducted from his home and taken to a nearby military base where he was tortured\nUkrainian troops were fighting fiercely to hold the nearby Azovstal steelworks in the nearby city of Mariupol as the American was kidnapped\nThe abduction came just weeks after the start of the Russian invasion as fierce fighting raged across the Kherson region.\nUkrainian volunteers holed up in the Azovstal steelworks were fighting a desperate rearguard action to save the nearby city of Mariupol, and the International Criminal Court began its own war crimes probe amid claims of murder and rape against Russian forces marauding the countryside.\nIt was not until November 2022 that Ukrainian forces retook the American's village and Homeland Security and FBI investigators were able to interview the American, his family and others in the village to identify the four Russians.\nThe American who was not involved in the fighting and a 'protected person' under international law was eventually evacuated from the country along with his Ukrainian wife.\nThe four accused are all charged with unlawful confinement, torture and inhuman treatment, as well as one count of conspiracy to commit war crimes, the Justice Department said.\nGarland has been outspoken on war crimes in Ukraine since Russia's invasion began in February 2022, and the Justice Department assigned federal prosecutors to examine the potential of bringing criminal charges.\nIndependent human rights experts backed by the U.S. have said they´ve found continued evidence of war crimes committed by Russian forces, including torture that ended in death and rape of women aged up to 83 years old.\nThe International Criminal Court issued an arrest warrant for Russian President Vladimir Putin in March for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine.\nKremlin spokesman Dmitry Peskov said Russia does not recognize the ICC and considers its decisions 'legally void.' He called the court´s move 'outrageous and unacceptable.'\nThe United States is not a member of the ICC, but the Justice Department has been cooperating with it and supporting Ukrainian prosecutors as they carry out their own war crime investigations.\nThe charges carry mostly symbolic significance for the moment given the unclear prospects that any of the four defendants would ever be brought to an American courtroom to face justice.\nThey come as the Biden administration, in an effort to show continued support for Ukraine during a separate war between Israel and Hamas, is pressing Congress to approve military and economic aid for Kyiv´s war effort.\nThe U.S. and Russia do not have an extradition treaty, but the Justice Department has brought repeated criminal cases against Russian nationals, most notably for cyber crimes and including for interference in the 2016 presidential election.\nAttorney General Merrick Garland insisted he would 'not forget the atrocities in Ukraine' as he announced the first ever prosecution under the War Crimes Act in defense of an American\nIn some of those cases, the defendants have been taken into custody by American officials, such as when they´ve traveled outside Russia.\n'These charges, against four Russia-affiliated military personnel, are the Justice Department's first criminal charges under the US war crimes statute,' Garland said.\n'They are also an important step toward accountability for the Russian regime's illegal war in Ukraine.\n'Our work is far from done.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US files war crime charges against Russians accused of...", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/ushome/article-12832965/DOJ-war-crimes-Ukraine-Russians-merrick-Garland.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}