{"authors": ["Mackenzie Tatananni", "Mackenzie Tatananni For Dailymail.Com"], "date_download": "2024-02-05 15:30:36", "date_modify": "None", "date_publish": "2023-12-06 23:58:08", "description": "Educators in California are planning to hold pro-Palestinian lessons Wednesday as part of an unauthorized teach-in that has met criticism from Jewish groups.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12833813%2FOakland-unauthorized-pro-Palestine-lessons-coloring-book-Israel-ZIONISTS.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/06/22/78664227-0-image-m-93_1701900030338.jpg", "language": "en", "localpath": null, "maintext": "The controversy comes amid a series of protests on college campuses that have caused clashes with school administrators\nSuggested curriculum includes a lesson titled 'Part A: Where is Palestine? What is Zionism?'\nThe local school district denounced the event, which was organized by a group called 'OEA for Palestine'\nDozens of public school teachers in California are planning to hold pro-Palestinian lessons Wednesday as part of an unauthorized teach-in that has met criticism from Jewish groups.\nThe Oakland school district publicly opposed the event, with some critics demanding that teachers who participate on Wednesday face punishment.\nThe event was organized by activists within the local teachers’ union, the Oakland Education Association. However, union president Ismael Armendariz said the curriculum had not been reviewed by his group.\nTeachers told KTVU that the teach-in was not authorized by the official OEA, but a small group called 'OEA for Palestine.'\nOrganizers released a lengthy list of suggested curriculum materials for grade levels from pre-K through high school. The first lesson for Upper Elementary School students is titled: 'Part A: Where is Palestine? What is Zionism?'\nDozens of public school teachers in California are planning to hold pro-Palestinian lessons Wednesday in a move that has drawn the ire of Jewish groups and parents\nThe curriculum, posted in a Google Doc, includes references to 'Zionism' in the Upper Elementary School lesson plan\nLincoln Elementary School teacher Jacob Fowler encouraged educators to participate in the teach-in, urging them to facilitate 'positive conversations' about the conflict\nAmong the recommended materials is a coloring book featuring a Palestinian character who says: 'A group of bullies called Zionists wanted our land so they stole it by force and hurt many people.'\nThe curriculum leaves room for art lessons, films, and appreciation of the region's music, food and poetry. But some wording has offended Jewish community members, such as the document's reference to Israel an 'apartheid state.'\nNate Landry, a parent and spokesman for the organizers, said teachers saw the curriculum as 'a corrective' to education materials with a pro-Israel view.\nThe document also condemns antisemitism, stating: 'We must ensure that our Jewish students and colleagues feel safe, supported and heard at school.'\nAn unlisted video uploaded to YouTube by Lincoln Elementary School teacher Jacob Fowler urges educators to take part in the teach-in.\n'You have the ability to encourage students to think critically about what's going on, introduce them to new ideas, and have positive conversations about what's going on and what can be done,' Fowler said.\nHowever, Kyla Johnson-Trammell, superintendent of the Oakland Unified School District, issued a memo to parents on Monday that opposed the event.\nJohnson-Trammell referenced a school board policy, BP 6144, which requires that 'all sides of a controversial issue are impartially presented with adequate and appropriate factual information.'\nA spokesperson for the organizers said teachers view the curriculum as 'a corrective' to materials with a pro-Israel view, while Jewish community members referred to it as 'misinformation'\nSuperintendent Kyla Johnson-Trammell publicly denounced the teach-in, saying teachers were expected to 'keep their personal beliefs out of the classroom'\nThe fallout surrounding comes amid a series of clashes at schools across the country (pictured: a parent and son display signs during an Oakland Unified School District board meeting on November 8)\n'The teacher shall not suppress any student's view on the issue as long as its expression is not malicious or abusive toward others,' the policy reads.\nIn a statement, Johnson-Trammell reiterated that all educators were expected to 'take seriously their responsibility to adhere to principles of education, and to keep their personal beliefs out of the classroom.'\nShira Avoth, an Israeli American and the mother of an Oakland seventh-grader, chalked the curriculum up to 'misinformation.'\nSpeaking to the New York Times, Avoth condemned the portrayal of Israelis as white colonizers from Europe. Many Israelis, including her own family, were thrown out of other Middle Eastern countries, she explained.\nAvoth said her son would be attending school ready to discuss the topic, believing he had a responsibility to 'show up and represent himself.'\nJoshua Diamant, an Oakland music teacher, told the publication that while he was cautious of the teach-in curriculum materials, he would feel the same way about materials with an opposing slant.\n'I would like to see us build a culture in this district where we can actually engage in dialogue about Israel-Palestine and other contentious issues - and not shout slogans past each other,' Diamant said.\nNYU protesters held 'Free Palestine' flags as they demonstrated in Washington Square Park on October 25\nCornell students protested against Israel and the university's involvement with companies that do business with the country, posting signs around the campus\nIn the middle of the October 25 protest, a handful of young Jewish men sang and prayed with their bodies interlocked\nThe fallout surrounding the proposed curriculum comes amid a series of clashes at institutions of higher education.\nLast month, Jewish billionaire Henry Sweica resigned from the board of Columbia Business School, expressing that he needed to 'make a principled stand.'\nIn a letter to his alma mater, Sweica wrote: 'With blatantly anti-Jewish student groups and professors allowed to operate with complete impunity, it sends a clear and distressing message that Jews are not just unwelcome, but also unsafe on campus.'\nHe continued: 'Any other minority group on campus would never have to face anything close to this level of intimidation and hatred of Jewish and pro-Israel students experience.'\nThe university suspended its Students for Justice in Palestine and Jewish Voice for Peace chapters following a series of unauthorized campus protests.\nColumbia's senior executive vice president and chair of its Special Committee on Campus Safety, Gerald Rosberg, said the two groups 'repeatedly violated university policies.' He also referenced one event that 'included threatening rhetoric and intimidation.'\nDays after Hamas' October 7 attack on Israel, the school's SJP chapter issued a statement calling the militant group's actions a 'counter-offensive against their settler-colonial oppressor.'\nSome students who signed a letter in defense of the ambush had job offers rescinded, and several law firms cosigned a letter to Ivy League schools warning them that they would not hire students with 'anti-Semitic' views.\nPro-Palestine demonstrators gathered for a protest at Columbia University on October 12, days after Hamas' attack on Israel\nThe university's Students for Justice in Palestine chapter deemed the militant group's actions a 'counter-offensive against their settler-colonial oppressor'\nA spokesperson for NYU said the university was working to identify students who displayed 'antisemitic' posters including one that depicted a Star of David in a trashcan\nOther universities have seen clashes between students and members of administration.\nLast month, New York University students gathered for a 'walkout' protest organized by Ryna Workman, a law student who previously called Hamas' actions 'necessary.'\nNYU spokesman John Beckman told DailyMail.com that the school was working to confirm the identities of students who carried signs reading 'Keep the world clean,' with one featuring an illustration of the Star of David in a trash can.\n'These signs are antisemitic, repugnant, and a disgrace. We don't know the identity of the people pictured, but we take this seriously and will be looking into it,' Beckman said.\n'To be clear, antisemitism violates the University's rules and violators are subject to university conduct proceedings.'\nBut the hate goes both ways, and last month, the federal government opened discrimination investigations into half a dozen universities over complaints about antisemitic and anti-Muslim rhetoric.\nThe conflict is spilling off campus, too. In November, three students were shot as they walked down a street in Vermont in what is being investigated as a possible hate crime.\nHisham Awartani, Kinnan Abdalhamid and Tahseen Ahmed were wearing keffiyeh scarves and chatting in English and Arabic when they were shot in Burlington, Vermont\nFirst responders were seen loading one of the victims into an ambulance after the attack\nJason J. Eaton, 48, appeared in court last month and pleaded not guilty to three counts of attempted murder in connection with the shooting\nThe conflict is spilling off campus, too. In November, three students were shot as they walked down a street in Vermont in what is being investigated as a possible hate crime.\nThe accused shooter, 48-year-old Jason Eaton, said nothing before opening fire on Hisham Awartani, Kinnan Abdalhamid and Tahseen Ahmed, all 20, as they visited Awartani's grandmother for Thanksgiving.\nIn an interview with the Boston Globe, Abdalhamid urged Americans to educate themselves on the history of the conflict in the Middle East.\n'We’re just as human over there,' said Adbalhamid, who was born in the United States and lived in the occupied West Bank from the time he was three years old.\n'At least speak to a Palestinian before talking about Palestinians,' he added. 'Palestinians need support, not sympathy.'\nIn the unprecedented October 7 attack, Hamas fighters breached a border security fence separating Gaza from Israel, gunning down Israeli civilians and soldiers.\nIn the following weeks, Israeli forces unleashed an aerial and ground blitz against the group, which is recognized by the United States as a foreign terrorist organization.\nSmoke rose over Gaza amid the ongoing conflict between Israel and Hamas on December 6\nPalestinians, including children, were brought to Al-Aqsa Martyrs Hospital for treatment amid the Israeli onslaught\nDisplaced Palestinians fled to a refugee camp in Rafah, as humanitarian aid groups caution\nAt least 16,015 Palestinians have been killed since then, while 1,200 Israelis died in the initial attack.\nMost of Gaza's 2.3 million inhabitants were left homeless and face ongoing shortages of food, water, medical care and fuel.\nToday, US State Department spokesman Matthew Miller responded to comments by Israeli Prime Minister Benjamin Netanyahu, who said Israel must maintain security control in Gaza after the war to ensure the area remains 'demilitarized.'\n'I don't think it would be in anyone's interest – not Israel’s interest, it wouldn’t be in the Palestinian people’s interests – after the end of major combat operations for Israel to just leave and leave a security vacuum in place where there could be rampant lawlessness inside Gaza and innocent civilians exploited,' Miller said.\nHe added that the US has made clear there cannot be an Israeli 'reoccupation of Gaza' after the war ends.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Dozens of public school teachers in Oakland plan to hold unauthorized pro-Palestinian lessons - including a coloring book branding Israelis 'ZIONISTS' - in move slammed by local Jewish groups", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12833813/Oakland-unauthorized-pro-Palestine-lessons-coloring-book-Israel-ZIONISTS.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}