{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:30:39", "date_modify": "None", "date_publish": "2023-12-06 13:44:49", "description": "Gaza’s second biggest urban concentration now being depicted as Hamas’s ‘centre of gravity’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F06%2Fisraels-focus-turns-to-khan-younis-as-it-hunts-for-hamas-leaders.json", "image_url": "https://i.guim.co.uk/img/media/e38efb1353204285fc2c3b18056c85d3f180818e/0_171_3094_1856/master/3094.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1330f2753e2a34dca4e68fd8914805a6", "language": "en", "localpath": null, "maintext": "At the start of Israel’s now more than 60-day offensive in Gaza, its focus was on the north of the territory: Hamas’s leader in Gaza was portrayed as being hunkered down in a bunker disconnected from the world, while its key command centre was said at other times to be located under Dar al-Shifa hospital in Gaza City, illustrated by mocked-up graphics in Israeli briefings.\nNow, amid a rolling Israeli campaign of huge destruction, the southern city of Khan Younis, the territory’s second biggest urban concentration, is being depicted as Hamas’s stronghold as Israeli tanks move in on an area already overwhelmed by hundreds of thousands of people displaced from Gaza’s north.\nIt is here, the Israeli military claims, that Hamas’s leadership is hiding after fleeing northern Gaza earlier in the war along with hostages Hamas seized on 7 October.\nHome to about 400,000 people before the conflict swelled its population, Khan Younis and its satellite towns cover an area larger than Gaza City, although with a strikingly different urban geography.\nWhere Gaza City has high-rise blocks, the skyline of Khan Younis is lower, hemmed in on one side by a rural periphery of villages that run up to the border with Israel – places such as Khuza’a, where there has been fighting in almost every one of the conflicts since 2008.\nAnd while Hamas has been associated with its roots in Gaza City, and in particular the Shati refugee camp, Khan Younis has long been linked to Yahya Sinwar, the leader of Hamas in Gaza, and with its shadowy military leader, Mohammed Deif, the mastermind of the 7 October attack. Both grew up in the Khan Younis refugee camp, where Sinwar was born in 1962 while Gaza was under Egyptian administration.\nGaza’s south is historically one of the most socially conservative areas of the coastal strip and Hamas has long enjoyed support there, not least in Khan Younis itself, home to one of Hamas’s five Qassam “brigades”. Israeli military assessments depict the Hamas structure in the city as being the least damaged by its offensive so far.\nThe reality is that while the Israel Defense Forces (IDF) claim to have killed numerous lower-ranking Hamas commanders, issuing a photograph of one group in a tunnel that had those killed marked, the group’s most senior leadership has so far avoided a similar fate – in keeping with previous conflicts.\nThe aim of the expanded operation in the south, senior IDF officers have said publicly, is to catch or kill Sinwar and other members of the senior leadership.\n“We are attacking the centre of gravity,” the IDF chief of staff, Gen Herzi Halevi, said on Tuesday. “We are asked frequently about the destruction in Gaza. Hamas is the address. Sinwar is the address.”\nView image in fullscreen Palestinians walk through the streets of Khan Younis on Wednesday after Israeli strikes. Photograph: Ahmed Zakot/Reuters\nIt remains the case, however, that the three men who sit atop Hamas’s secretive military council and Israel’s hitlist – Deif, his second in command, Marwan Issa, and Sinwar – remain at large.\n“If [Israel] could say we’ve killed Sinwar, we’ve killed Marwan Issa, we’ve killed Mohammed Deif, that’s a very clear, symbolic and substantive achievement,” said Michael Eisenstadt, the director of the military and security studies programme at the Washington Institute for Near East Policy, last week. “What if they can’t get the guys? Do they keep fighting until they get them? And what if they just prove elusive?”\nHalevi, however, has also made clear that the IDF and Israeli political leadership sees an operation expanded into the south – contrary to the complaints of some families of Hamas hostages – as a way of pressuring Hamas back to negotiations over the remaining 138 hostages.\nSome Israeli commentators have suggested that the terrain in Khan Younis and the composition of Hamas’s forces there may make the IDF take a different approach to they way its operated in the north.\n“The operation in Khan Younis is an inseparable part of the war, but it is being fought in a completely different way from the way the war was fought in the northern Gaza Strip,” suggested Yossi Yehoshua in Yedioth Ahronoth, the Israeli daily.\n“Hamas has an entire brigade operating in the Khan Younis area. That brigade has four strong and well-trained battalions, protecting one of Hamas’s main strongholds. Khan Younis is larger than Gaza City in terms of square kilometres.\n“Most of the buildings in it are low-rise apartment buildings, as opposed to the high-rises in downtown Gaza City. There are dozens of kilometres of tunnels run beneath it, in some cases reaching as far as Rafah [in Gaza’s far south on the Egyptian border].”\nFor those Palestinians who have been displaced once – if not several times – by the fighting, the ground assault on Khan Younis has simply brought more pain and mortal fear.\nAs the Israeli military has ordered people out of nearly two-dozen neighbourhoods in and around the city it has shrunk the area where it says civilians can seek refuge by more than a quarter, despite having ordered them to move south for safety earlier in the war.\nOn Wednesday, that meant almost empty streets as residents sought shelter from tank shelling and artillery fire, while dead and wounded people continued to be brought into the city’s hospitals.\nEven then, it was unclear how many people heeded the evacuation orders, with many Palestinians saying they did not feel safe anywhere in Gaza, and fearing that if they left their homes they would not be allowed to return.\n“Nowhere is safe in Gaza,” said the UN humanitarian chief, Martin Griffiths. “Not hospital, not shelters, not refugee camps. No one is safe.”\nHassan al-Qadi, a displaced Khan Younis resident now in Rafah, said: “The whole city is suffering from destruction and relentless shelling. Many people arriving from northern Gaza are facing dire circumstances. Many are homeless and some are searching for their missing children.\n“We are not mere numbers. We are human beings.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israel’s focus turns to Khan Younis as it hunts for Hamas leaders", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/06/israels-focus-turns-to-khan-younis-as-it-hunts-for-hamas-leaders"}