{"authors": ["Paul Rogers"], "date_download": "2024-02-05 15:30:41", "date_modify": "None", "date_publish": "2023-12-05 12:47:14", "description": "The strategy goes well beyond defeating an opponent: it seeks to destroy key infrastructure and the economy, says academic Paul Rogers", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F05%2Fisrael-disproportionate-force-tactic-infrastructure-economy-civilian-casualties.json", "image_url": "https://i.guim.co.uk/img/media/e1c60022dbdee36c42906b1e0264f767a14aa467/0_44_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=edacb6a7923d7f8fc3cb70e001480049", "language": "en", "localpath": null, "maintext": "How to make sense of the sheer intensity of Israel’s war in Gaza? One understanding is that it is the result of the enduring shock of the 7 October massacre combined with a far-right government that includes extreme elements. Yet this ignores another element: a specific Israeli approach to war known as the Dahiya doctrine. It’s also one reason why the “pause” was never going to last for very long.\nFirst, let us take stock of the state of Gaza. After a seven-day pause in the airstrikes, the war resumed on Friday. In the last three days, bombing has been heavy, and the total death toll since 7 October has risen to 15,899, according to the Gaza health ministry, with at least 41,000 wounded. Among the dead are 6,500 children, including hundreds of infants.\nPhysical destruction in Gaza has been massive: 60% of the territory’s total housing stock (234,000 homes) is damaged, 46,000 of which are completely destroyed. The seven-day pause may have provided limited relief from the comprehensive siege but there are still serious shortages of food, clean water and medical supplies.\nDespite massive Israeli attacks backed by a near-unlimited supply of bombs and missiles and intelligence support from the United States, Hamas continues to fire rockets. Moreover, it retains a substantial paramilitary ability with 18 of the original 24 active paramilitary battalions intact, including all 10 in southern Gaza.\nPalestinian support for Hamas may also be growing in the West Bank, where armed settlers and the Israel Defense Forces have killed scores of Palestinians since the war started. The Israeli government is absolutely determined to continue and is accelerating the war, despite US secretary of state Antony Blinken’s blunt warning to limit casualties and vice-president Kamala Harris confirming that “under no circumstances will the United States permit the forced relocation of Palestinians from Gaza or the West Bank, the besiegement of Gaza, or the redrawing of the borders of Gaza”.\nThat will count for little, given the extreme position of Benjamin Netanyahu’s war cabinet, where the aim is to destroy Hamas. How this will be attempted relates to the specific Israeli way of war that has evolved since 1948, through to its current Dahiya doctrine, which is said to have originated in the 2006 war in Lebanon.\nIn July of that year, facing salvoes of rockets fired from southern Lebanon by Hezbollah militias, the IDF fought an intense air and ground war. Neither succeeded, and the ground troops took heavy casualties; but the significance of the war lies in the nature of the air attacks. It was directed at centres of Hezbollah power in the Dahiya area, in the southern suburbs of Beirut, but also on the Lebanese economic infrastructure.\nThis was the deliberate application of “disproportionate force”, such as the destruction of an entire village, if deemed to be the source of rocket fire. One graphic description of the result was that “around a thousand Lebanese civilians were killed, a third of them children. Towns and villages were reduced to rubble; bridges, sewage treatment plants, port facilities and electric power plants were crippled or destroyed.”\nTwo years after that war, the Institute for National Security Studies at Tel Aviv University published Disproportionate Force: Israel’s Concept of Response in Light of the Second Lebanon War. Written by IDF reserve Col Gabi Siboni, it promoted the Dahiya doctrine as the way forward in response to paramilitary attacks. The head of the Israeli military forces in Lebanon during the war, and overseeing the doctrine, was General Gadi Eizenkot. He went on to be the IDF chief of general staff, retiring in 2019, but was brought back as an adviser to Netanyahu’s war cabinet in October.\nSiboni’s paper for the institute made it crystal clear that the Dahiya doctrine goes well beyond defeating an opponent in a brief conflict, and is about having a truly long-lasting impact. Disproportionate force means just that, extending to the destruction of the economy and state infrastructure with many civilian casualties, with the intention of achieving a sustained deterrent impact.\nThe doctrine has been used in Gaza during the four previous wars since 2008, especially the 2014 war. In those four wars, the IDF killed about 5,000 Palestinians, mostly civilians, for the loss of 350 of their own soldiers and about 30 civilians. In the 2014 war, Gaza’s main power station was damaged in an IDF attack and half of Gaza’s then population of 1.8 million people were affected by water shortages, hundreds of thousands lacked power and raw sewage flooded on to streets.\nEven earlier, after the 2008-9 war in Gaza, the UN published a fact-finding report that concluded that the Israeli strategy had been “designed to punish, humiliate and terrorise a civilian population”.\nThe situation now, after two months of war, is far worse. With the ground offensive in southern Gaza under way, it will not stop, exacerbated by tens of thousands of desperate Gazans repeatedly trying to find places of safety.\nThe immediate Israeli aim, which may take months to achieve, appears to be eliminating Hamas while corralling the Palestinians into a small zone in the south-west of Gaza where they can be more easily controlled. The longer-term aim is to make it utterly clear that Israel will not stand for any opposition. Its armed forces will maintain sufficient power to control any insurgency and, backed by its powerful nuclear capabilities, will not allow any regional state to pose a threat.\nIt will fail. Hamas will emerge either in a different form or strengthened, unless some way is found to begin the very difficult task of bringing the communities together. Meanwhile, the one state that can force a ceasefire is the US, but there is little sign of that – at least so far.\nPaul Rogers is emeritus professor of peace studies at Bradford University and an honorary fellow at the Joint Service Command and Staff College", "source_domain": "www.theguardian.com", "text": null, "title": "Israel’s use of disproportionate force is a long-established tactic - with a clear aim", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/05/israel-disproportionate-force-tactic-infrastructure-economy-civilian-casualties"}