{"authors": ["Stacy Liberatore", "Stacy Liberatore For Dailymail.Com"], "date_download": "2024-02-05 15:15:42", "date_modify": "None", "date_publish": "2024-01-26 16:14:54", "description": "Internal Pentagon watchdogs spent three years evaluating the government's abilities to protect the US from an alien invasion. finding officials do not have proper efforts in place.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsciencetech%2Farticle-13010845%2Fpentagon-report-america-unequipped-defend-alien-invasion-ufos.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/26/15/80509077-0-image-a-13_1706284449910.jpg", "language": "en", "localpath": null, "maintext": "READ MORE: Ex-official weighs in on 'cube in a sphere' UFO at military bases\nThe Pentagon watchdogs have made 11 recommendations in the report\nThe reported noted that the DoD needs formal policies to identify UAPs\nUS officials do not have the capabilities to defend America against a hypothetical alien invasion, internal Pentagon watchdogs have determined.\nA newly declassified document found the Department of Defense (DoD) lacks comprehensive or coordinated effort to track and analyze UFOs - which have been rebranded Unidentified Anomalous Phenomena (UAP) in recent years.\nThe Office of Inspector General (OIG) made the eerie conclusion that this blindspot in the DoD's defensive capabilities 'poses a threat to military forces and national security.'\nTo address the issues identified in this report, the OIG has made 11 recommendations, including the enforcement of protection policies and the development of new tools in the event of an extraterrestrial attack.\nA newly declassified document determined the Department of Defense (DoD) lacks comprehensive or coordinated effort to track and analyze UAP, such as one spotted by the US Navy in 2004\n'DoD efforts to identify and understand UAP has been irregular because of competing priorities, lack of substantive progress, and inconclusive findings,' reads 'Evaluation of the DoD's Actions Regarding Unidentified Anomalous Phenomena', previously issued August 2023.\n'However, military pilots have continued to report UAP incidents despite the sporadic efforts of the DoD to identify, report, and analyze the events'\nThe 2023 report was a collection of evaluations on whether the Pentagon, military branches, defense agencies and counterintelligence organizations conducted actions 'to detect, report, collect, analyze, and identify UAP.'\n'The DoD has not issued a comprehensive UAP response plan that identifies roles, responsibilities, requirements, and coordination procedures for detecting, reporting, collecting, analyzing, and identifying UAP incidents,' OIG concluded.\nThe agency conducted the work for the evaluation from May 2021 through June 2023 and interviewed Presidential and DoD policies, directives and guidance.\nThose individuals are tasked with establishing requirements for intelligence gathering, counterintelligence, force protection, and civil liberty protections for\n'As a result, the DoD response to UAP incidents is uncoordinated and concentrated within each Military Department.'\nIn July 2022, the Pentagon set up the All-domain Anomaly Resolution Office (AARO), to handle reports of UAPs.\nAARO is responsible for synchronizing and standardizing the collection, analysis, and identification of UAP incidents.\nInspector General Robert P. Storch announced the declassification of the report on Thursday, noting it was released due to the 'significant public interest in how the DoD is addressing UAPs'\nHowever, OIG has questioned the abilities of the nation to organize and defend itself in a summary of the classified report.\nOIG found that due to a lack of DoD-level guidance, AARO has not developed a formal process to detect and report on unidentified object in US skies.\nUAPs are designated as 'Special Interest Items' among military officials, who require aircrews to document and report sightings within 24 hours of shutting down the engines of their own aircraft.\nSome of those unexplained observations have been sent to AARO, but the reported noted that the DoD does not require military services to do so.\n'DoD Components have largely excluded geographic combatant commands, which are responsible for detecting, deterring, and preventing threats and attacks against the United States and its territories, possessions, and bases in their respective areas of responsibility, in developing UAP policies and procedures,' OIG determined in the 16-page document.\nIn July 2022, the Pentagon set up the All-domain Anomaly Resolution Office (AARO), to handle reports of UAPs. AARO is responsible for identification of UAP incidents such as this observation in 2023 above LAX\nTo address the issues identified in the report, the DoD OIG said they have made eleven recommendations to the Under Secretary of Defense for Intelligence and Security.\nFor example, OIG recommended that the DoD issue a policy to integrate roles, responsibilities, requirements, and coordination procedures regarding UAP into existing intelligence, counterintelligence, and force protection policies and procedures,' the report reads.\nThe report also suggested the Chairman of the Joint Chiefs of Staff issue guidance to 'the geographic combatant commanders regarding unidentified anomalous phenomena detection, reporting, collection, analysis, and identification within their area of responsibility.\n'At a minimum, the guidance should include tools to help commands determine the threats posed by unidentified anomalous phenomena.'\nInspector General Robert P. Storch announced the declassification of the report on Thursday, noting it was released due to the 'significant public interest in how the DoD is addressing UAPs.'\n'We are releasing this unclassified summary to be as transparent as possible with the American people about our oversight work on this important issue,' Storch shared in a statement.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "What are they trying to tell us? Internal Pentagon report warns America is unequipped to defend itself from an ALIEN invasion", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sciencetech/article-13010845/pentagon-report-america-unequipped-defend-alien-invasion-ufos.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}