{"authors": ["Julian Borger"], "date_download": "2024-02-05 15:30:41", "date_modify": "None", "date_publish": "2023-12-05 19:36:04", "description": "Martin Griffiths says continuing offensive has ended any possibility of meaningful humanitarian operations", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F05%2Fun-martin-griffiths-idf-campaign-southern-gaza-apocalyptic-conditions.json", "image_url": "https://i.guim.co.uk/img/media/7afaa3a79dc3d8f72842cd441c455d3196649a06/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8b0ef380cd7fb8c667672c71b3edf71b", "language": "en", "localpath": null, "maintext": "The UN’s top aid official has said the Israeli military campaign in southern Gaza has been just as devastating as in the north, creating “apocalyptic” conditions and ending any possibility of meaningful humanitarian operations.\nMartin Griffiths, the UN emergency relief coordinator, said he was speaking on behalf of the entire international aid community in saying the continuing offensive had robbed aid workers of any significant means of helping the 2.3 million people of Gaza, other than to call for an immediate end to the fighting.\nHis comments came as the Israeli military said it had stormed southern Gaza’s main city in the most intense day of fighting so far, and hospitals struggled to cope with scores of dead and wounded Palestinians.\n“What we’re saying today is: that’s enough now. It has to stop,” Griffiths said in an interview with the Guardian, adding that the small amount of aid being allowed into Gaza could no longer be distributed, since the Israeli ground offensive had spread to southern Gaza and the city of Khan Younis, bringing the humanitarian operation effectively to an end.\n“It isn’t really a statistically significant operation any more,” said Griffiths, who is also UN undersecretary general for humanitarian affairs. “It’s a bit of a patch on a wound and it doesn’t do the job, and it would be an illusion for the world to think that the people in Gaza can be helped by the humanitarian operation under these conditions.\n“This is an apocalyptic situation now, because these are the remnants of a nation being driven into a pocket in the south.”\nThe Israel Defense Forces (IDF) launched a ground operation into northern Gaza on 27 October, 20 days after Hamas militants killed 1,200 Israelis, most of them civilians, in a cross-border attack. Israel told Palestinian civilians to move into southern Gaza for their own safety before the ground assault, but the south also remained under bombardment. After the breakdown of a week-long ceasefire on 1 December, tanks and infantry have moved into the south, focusing on Khan Younis. The IDF said its troops had reached the heart of the city on Tuesday.\nJoe Biden and his top officials had called on Israel to conduct the campaign in the south in a fundamentally different way from the north, with far more attention paid to avoiding civilian casualties, as the Gaza death toll passed 16,000 according to figures issued by the Hamas media office.\nThe US national security adviser, Jake Sullivan, pointed to an IDF plan to split Gaza into small districts and warn residents of impending military operations in their districts, as a “quite unusual step for a modern military” to avoid civilian deaths. But amid fighting that the IDF said has been the most intense of the ground offensive so far, the civilian toll has remained very high.\nUS officials said on Monday it was too early to draw conclusions about the conduct of the war in southern Gaza, but Griffiths said it was already clear there had been no improvement and that US diplomatic efforts to influence the IDF had failed.\n“The way in which the military operation in the south has been carried out is very similar to what we saw in the north,” he said. “US diplomacy was very much focused on this and [secretary of state] Tony Blinken spoke about it publicly. It does not seem to have worked at all, and so the pace of destruction in the south is as relentless as we see in the north.\n“And so we’re left doing very, very little, and frankly facing the inescapable truth which is this is no longer a humanitarian operation, trying to save lives for the people of Gaza. We’ll stay. We’re not leaving … but please don’t think that the humanitarians can save the day. They can’t.”\nSpeaking in el-Arish, near Egypt’s border with Gaza, the administrator of the US Agency for International Development, Samantha Power, said that civilian toll remained a primary concern for the Biden administration.\n“First, as Israel’s military operations continue, Palestinian civilians must be protected,” Power told journalists after overseeing the delivery of 36,000 (16,330 kg) of US humanitarian relief supplies.\n“Far too many innocent civilians have been killed. Some parents in Gaza are writing names on their children’s legs, so that they can be identified if they or their families are killed. Other parents are having their children split up, sheltering at different locations, putting them with different relatives, so as to increase the chances that at least some of them will survive. No parent should ever have to make choices like that. Military operations need to be conducted in a way that distinguishes fighters from civilians.”\nThe UN had sent the coordinates of UN schools and other institutions to the IDF and Hamas, identifying them as havens for civilians, but Griffiths echoed the comments of other UN officials this week, that there was no longer anywhere safe for Palestinians to take shelter in Gaza.\nGriffiths said: “I had a 10-point plan last week – it makes me embarrassed to even think about it now – as to how we would respond when people came south. There’s no 10-point plan any more because it’s dependent on a certain number of deconfliction institutions being safe for people to live in. They don’t exist.”\nHe said that with no safe havens for civilians to gather, there was nowhere where aid could be delivered and distributed. About 100 trucks of humanitarian supplies have been crossing into Gaza daily since the weekend, but Griffiths said it was no longer possible for workers to reach the crossing point at Rafah to unload them or distribute the aid anywhere else on the Gaza Strip.\n“There’s a logic to this, which is horrific and tragic and frankly apocalyptic,” he said. “And I can’t think of a better way to create a generation of anger and extremism than this.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘Apocalyptic’ conditions in southern Gaza blocking aid, top UN official says", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/05/un-martin-griffiths-idf-campaign-southern-gaza-apocalyptic-conditions"}