{"authors": [], "date_download": "2024-02-05 15:30:43", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Power was restored Saturday at Ukraine's Russian-occupied Zaporizhzhia nuclear power plant after it was lost on Friday, averting again a \"nuclear", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274052815%2Fzaporizhzhia-nuclear-plant-power-restored-averting-catastrophe.json", "image_url": "https://cdn.bignewsnetwork.com/voa1701560114.jpg", "language": "en", "localpath": null, "maintext": "Power was restored Saturday at Ukraine's Russian-occupied Zaporizhzhia nuclear power plant after it was lost on Friday, averting again a 'nuclear catastrophe,' according to a statement by Ukraine's energy ministry on the Telegram messaging app.\n'This is the eighth blackout which occurred at the [Zaporizhzhia plant] and could have led to nuclear catastrophe,' the statement said Saturday. The International Atomic Energy Agency confirmed the outage and restoration of power.\nThe plant was occupied by Russia in March 2022 and is no longer generating power but needs a supply of electricity to cool one of its four reactors, which is in a state of hot conservation, meaning it has not fully been shut down.\nThe energy ministry said that after losing grid connection the plant turned on 20 backup generators to supply its electricity needs.\nAt 7 a.m. local time (0500 GMT), it said, Ukrainian specialists repaired the 750-kW line that is again bringing power to the plant.\nEastern front lines\nFighting continues around the eastern Ukrainian towns of Avdiivka and Marinka with both Russia and Ukraine claiming advances. Ukraine's General Staff said Saturday that Russian forces had been unsuccessful in their attempts to advance on villages near Marinka but said nothing of troop movements in the town.\nOnce a city of 10,000, Marinka - which is southwest of the Russian-held regional center of Donetsk - is a ghost town after almost a year of Russian efforts to seize it. There are no civilians left.\nFor almost two months, Russian forces have been attacking the eastern Ukrainian town of Avdiivka, 40 kilometers (25 miles) north of Marinka. Ukraine says its forces control Avdiivka, though not a single building remains intact.\nUkrainian troops regained swaths of territory last year in a sweep through the northeast, but a counteroffensive launched in the east and south in June has made only incremental gains.\nWhite House National Security Council spokesperson John Kirby called on the U.S. Congress Friday to act swiftly to provide aid to Ukraine before the end of the month, after which it will become difficult to provide Kyiv with the assistance it needs.\n'We need that assistance immediately so we can provide them assistance in an uninterrupted way,' Kirby said during a news briefing.\nKirby said the United States expects that Russia will try to destroy critical Ukrainian energy infrastructure this winter as it did last year.\nWhite House Urges Ukraine Aid Be Expedited Before Winter Arrives\nUkrainian President Volodymyr Zelenskyy acknowledges that the advance has been slow but rejects any notion that the war is slipping into a stalemate.\nThe president met with his military command Friday to discuss ways to produce 'concrete results' next year in the country's war with Russia.\nIn his nightly video address, Zelenskyy spoke about improvements in mobilization methods.\n'This is not simply a question of numbers, of who can be mobilized,' he said. 'It's a question of a time frame for each person who is now in the military, for demobilization and for those who will join the military. And it's about conditions.'\nUkrainian President Volodymyr Zelenskyy, Commander of Ukraine's Ground Forces Col.-Gen. Oleksandr Syrsky, right, and Roman Mashovets, deputy head of the Presidential Office, visit the front-line city of Kupiansk, Kharkiv region, Ukraine, Nov. 30, 2023.\nZelenskyy said these issues had to be examined by commanders and the defense ministry.\n'There were several proposals today and I am awaiting comprehensive solutions,' he said.\nRussian troops\nZelenskyy's comments came as Russia President Vladimir Putin signed a decree increasing the number of members of the Russian armed forces by 170,000, to a total of 1.32 million, the Kremlin and the defense ministry said Friday.\n'The increase in the full-time strength of the armed forces is due to the growing threats to our country associated with the special military operation and the ongoing expansion of NATO,' the ministry said.\nThe ministry also said it has no plans to significantly increase conscription or carry out a new wave of mobilization, and that the increase in the number of troops will happen gradually by recruiting more volunteers.\nThe wives of deployed Russian soldiers are not happy with their spouses' 'indefinite mobilization,' and have expressed their dismay in public protests and online. The British Defense Ministry said Saturday in its daily report on Ukraine that Russian authorities are attempting 'to quash public dissent' by paying the women off and discrediting them online.\nRussian officials are 'likely particularly sensitive,' the report said, to any protests about troops who have been mobilized since September 2022 and have been on the front line for more than a year.\nSome information for this report was provided by The Associated Press, Agence France-Presse and Reuters.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Zaporizhzhia Nuclear Plant Power Restored, Averting 'Catastrophe'", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274052815/zaporizhzhia-nuclear-plant-power-restored-averting-catastrophe"}