{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:30:44", "date_modify": "None", "date_publish": "2023-12-05 21:55:01", "description": "The president during a trip to Boston referenced a series of media reports about horrific accounts of rape during the attack by Hamas fighters Oct. 7 in Israel.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12829455%2FBiden-rips-Hamas-repeatedly-raping-women-girls-mutilating-bodies-alive-President-launches-scathing-attack-reported-atrocities-terrorist-group.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/05/21/78616181-0-image-a-20_1701810840251.jpg", "language": "en", "localpath": null, "maintext": "President Joe Biden used stark language to describe the 'unimaginable cruelty' of Hamas fighters during their Oct. 7 rampage, citing reports of repeated rapes and desecration of Israelis.\nBiden issued the comments in Boston on a day he is holding three fundraisers for his presidential campaign, after the resumption of fighting between Israel and Hamas following a humanitarian pause that allowed for the release of about 100 hostages from Gaza.\n'Before I begin, let me say a few words about what's going on in Israel right now. The terror that Hamas is continuing to inflict on the Israeli people,' Biden said. 'We had a report in the earliest days that Hamas used rape to terrorize women and girls during the attack on October the 7th in Israel.\n'Over the past few weeks, survivors and witnesses of the attacks have shared the horrific accounts of unimaginable cruelty. Reports of women raped — repeatedly raped — and their bodies being mutilated while still alive — of women corpses being desecrated, Hamas terrorists inflicting as much pain and suffering on women and girls as possible and then murdering them. It is appalling,' he said.\nPresident Joe Biden spoke Tuesday about 'unimaginable cruelty' and referenced reports of Hamas fighters raping Israeli women during the October 7 attack. He blasted Hamas for walling away from a humanitarian pause and continuing to hold hostage civilian women\nBiden, who helped author the Violence Against Women Act while serving in the Senate, called ending sexual assault 'one of the causes of my life.'\nHe said the burden was on 'all of us' to 'forcefully condemn the sexual violence of Hamas terrorists without equivocation. Without equivocation, without exception.'\n'These are civilian women, mostly between the ages of 20 and 39, whom Hamas has refused to let go under the deal that paused the fighting, which I helped negotiate with the Qataris. I spent hours with the Qataris and others to broker, sustain and extend that deal. I got more than 100 hostages out,' Biden said.\nHe spoke after a series of independent media reports catalogued evidence of rape during the October 7 attack.\nThen he echoed comments from his national security advisor on Monday about the hostage situation.\n'Let me be crystal clear: Hamas' refusal to release the remaining young women is what broke this deal and ended the pause in the fighting,' the president said. '\n'These women and everyone still being held hostage by Hamas need to be returned to their families immediately. We're not going to stop — we're not going to stop until we bring every one of them home and it's going to be a long process.'\nThe White House said Monday it was 'gravely concerned' about the women civilian hostages who remain captive inside Gaza, as Israel Defense Forces and Hamas continue to exchange fire.\nWhite House National Security Advisor Jake Sullivan emphasized the plight of civilian women seized during the Hamas October 7 raid. There are also Israeli military women being held captive.\nHe was asked during the White House briefing about Hamas' unwillingness to release the balance of civilian women being held in Gaza, following the breakdown of a seven-day cease fire that led to the release of more than 100 hostages, out of a total of about 240 seized during the assault.\n'I'm not going to speculate on that, only to say that they haven't done it, and we're gravely concerned about that. But I'm not going to speculate as to their reasoning,' Sullivan told reporters.\nWhite House National Security Advisor Jake Sullivan said the administration was 'gravely concerned' about the plight of female hostages still held inside Gaza\nHis comments following new reporting from eyewitnesses about the rape of Israeli men and women during the Oct. 7 raid.\nIsrael has expanded its ground operations in Gaza, and Israeli forces say they struck 200 'terror' targets in the latest barrage, even as U.S. officials including Vice President Kamala Harris have issued cautions about the risk to Palestinian civilians.\nAdministraiton officials continue to try to get information about the status of nine American hostages still held in Gaza.\n'Look, the basic bottom line when it comes to where we are in the hostage negotiations, is that the first phase of the hostage negotiation was about the release of women and children,' said Sullivan, who has been involved the strategy.\n'Hamas continues to hold women and civilian women and will not release them. And Israel is not prepared to close the book on those women or to give them up, so Israel is insisting that Hamas follow through on the release of those women,' he said.\nIsraeli soldiers embrace next to photos of people killed and taken captive by Hamas militants during their violent rampage through the Nova music festival in southern Israel, which are displayed at the site of the event, to commemorate the October 7, massacre, near kibbutz Re'im, Friday, Dec. 1, 2023\nSEI*182767099 Released Israeli hostages siblings Maya and Itay Regev (R) arrive to their family home in the city of Herzliya near Tel Aviv, on December 4, 2023, after spending a few days in hospital following their release from captivity by Hamas in the Gaza Strip. The White House said the refusal by Hamas to release more caused an end to the humanitarian pause\nIsrael continued to pound targets in Gaza after the end of the pause\n'And then Israel has said if Hamas is prepared to follow through on that, Israel is absolutely prepared to discuss additional categories of hostages, civilian men, the wounded and ultimately all of the hostages, the idea of soldiers being held.'\nSullivan was loathe to get into points of leverage that might move the process along.\n'The easiest, most straightforward way to get back to it would be for Hamas, to be held accountable for not following through on it. But then we also have to think about how we get all of our American hostages. out and we are giving thought to that as well. And, you know, handicapping forms of leverage or precise strategies for how we go about that is something I will refrain from doing I would just say that we are thinking through, both in concert with Israel and then just as a country with our own citizens. being held, what tools we have at our disposal to be able to get them on.'\nSullivan said it was the 'refusal by Hamas' that 'caused the end of the hostage agreement, and therefore the end of the pause in hostilities.\nIsraeli officials said the pause broke down after Hamas refused to produce a list of another 10 female hostages for release, according to the Times of Israel.\nSullivan also talked about protecting 'safe areas,' as Israeli forces told Gaza residents where to go amid a flurry of attacks.\n'They have also indicated that there are areas where there will be 'no-strike' zones, and in those zones, we do expect Israel to follow through on not striking,' he said, in a caution to the U.S. ally.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden rips Hamas for 'repeatedly raping' women and girls and 'mutilating their bodies while they were still alive': President launches scathing attack on reported atrocities by terrorist group", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12829455/Biden-rips-Hamas-repeatedly-raping-women-girls-mutilating-bodies-alive-President-launches-scathing-attack-reported-atrocities-terrorist-group.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}