{"authors": ["Chris Jewers"], "date_download": "2024-02-05 15:30:46", "date_modify": "None", "date_publish": "2023-12-05 12:13:43", "description": "With Vladimir Putin 's 21-month-long invasion dragging into another winter, Kyiv has suffered a series of setbacks that suggest the war is becoming 'frozen' - raising fears for NATO nations.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12827357%2FNATO-three-years-prepare-Russian-attack-Poland-warning.html.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/05/12/78593671-0-image-m-35_1701777947783.jpg", "language": "en", "localpath": null, "maintext": "However, a Polish official has now said that is an optimistic time frame\nNATO has just three years to prepare for a Russian attack, the chief of Polish national security has warned, amid growing concerns over the war in Ukraine.\nWith Vladimir Putin's 21-month-long invasion dragging into another winter, Kyiv has suffered a series of setbacks that suggest the war is becoming 'frozen'.\nThe United States and the EU are struggling to secure further packages of military aid to Ukraine, which in-turn has struggled to make major advances in its 2023 counteroffensive that many hoped would deal more blows to Moscow's armies.\nAs a result, attention is turning to the threat the Kremlin could pose to NATO and the EU's eastern borders shared with Russia and its ally Belarus.\nIn one troubling report from a leading German think tank, it has been argued that the NATO alliance must be ready to fend off a Russian attack within six to ten years.\nBut according to Jacek Siewiera, the chief of Poland's National Security Bureau and a minister in the country's chancellery, the report has underestimated the time frame.\nNATO has just three years to prepare for a Russian attack, the chief of a Polish national security has warned, amid growing concerns over the war in Ukraine. Pictured: Ukrainian soldiers patrol around Avdiivka, Ukraine on December 4\n'Unfortunately [...] this analysis is consistent with studies prepared in the USA,' he told Polish Catholic newspaper Nasz Dziennik in an interview that was also published on Poland's presidential website.\n'However, in my opinion, the time frames presented by German analysts are too optimistic. If we want to avoid war, NATO countries on the eastern flank should adopt a shorter, 3-year time horizon to prepare for confrontation,' he warned.\n'This is the time when a potential must be created on the eastern flank that would be a clear signal deterring aggression.'\nSince Putin launched his full-scale invasion of Ukraine in February 2022, senior Kremlin officials have hinted that it was just the beginning of the president's imperial ambitions that could see him set his sights on NATO's eastern-most member states.\nWith a full-scale war at NATO's doorstep for the first time in years, such threats have not been taken idly by European nations.\nBoth Finland and Sweden signed up to the military alliance, setting aside their decade-long stance on military non-alignment. Finland officially became a member on April 4 this year, while Sweden's application is currently being held up.\nMeanwhile, Germany was among several countries to increase their defence spending in the wake of the invasion.\nBut concern remains over the threat posed by Russia.\nUkrainian soldiers fire towards Russian targets in Avdiivka, Ukraine, December 1\nA soldier of the 58th Mechanized Brigade of the Ukrainian army walks in a muddy road, as Vladimir Putin's 21-month-long invasion drags into another winter\nIn particular, there are fears for the three Baltic nations - Estonia, Lithuania and Latvia - all of which border either Russia or Belarus.\nSuccessive Russian governments since the 18th century have identified the three small nations as being part of Moscow's sphere of influence, and Putin is understood to view the break-up of the Soviet Union as a national tragedy.\nIn response to Finland joining NATO, Russian defence minister Sergei Shoigu said in May that the Kremlin would establish 12 new 'units or divisions' in its Western Military District that would be stationed along NATO's eastern flank.\nWith the bulk of Russia's military strength bogged down by Ukraine's fierce resistance, those plans have been deferred for now.\nBut many NATO leaders and military analysts fear the alliance has only a small window in which to bolster its own forces.\nAfter suffering heavy losses in Ukraine, Russia will now inevitably scale up its own military industry and mobilise more soldiers to expand its armies for years to come.\nSiewiera's warning came after Christian Mölling and Torben Schütz of the German Council on Foreign Relations think tank wrote in their report that NATO is in a 'race against time' to fend off a Russian attack within six years.\nMeanwhile, in a letter to House and Senate leaders and released publicly, Office of Management and Budget Director Shalanda Young warned the US will run out of funding to send weapons and assistance to Ukraine by the end of the year.\nShe said this would 'kneecap' Ukraine on the battlefield.\nA Lithuanian fence runs along the border to the Russian semi-exclave of Kaliningrad, as seen in October 2022. There are fears that Putin could set his sights on the Baltic states next\nLithuanian border guard officers patrol by the metal fence at the Lithuanian Belarusian border on July 10, 2023 in Dieveniskes, Lithuania\nBritain's Royal Tank regiment take part in maneuvers during NATO exercise Hedgehog on the Estonian-Latvian border on May 25, 2022 in Voru, Estonia\nShe added that the US already has run out of money that it has used to prop up Ukraine's economy, and 'if Ukraine's economy collapses, they will not be able to keep fighting, full stop.' 'We are out of money - and nearly out of time,' she wrote.\nThe letter said that the US government has already sent $111 billion in aid to Kyiv.\nUkraine has sought to play down concerns that support is waning.\nForeign Minister Dmytro Kuleba insisted on Wednesday that NATO allies are showing no sign of war fatigue and remain committed to helping Ukraine defend itself against Russia and take back occupied territory.\nSpeaking to The Associated Press, Kuleba also said that Putin is miscalculating if he sees any value in keeping his forces in Ukraine at least until presidential elections in the United States in a year's time, which could usher in a new administration.\n'I heard a clear \"no\" to any reference to fatigue, and I heard (a) clear \"yes\" to increased support to Ukraine,' Kuleba said after meeting NATO counterparts in Brussels.\nHe told the press agency that some allies had made fresh offers of support, but he declined to provide details.\n'They understand that in order for them to feel safe, in order for them not to end up in a situation where NATO's soldiers will have to fight, Ukraine has to win in this war.'\nMore than 650 days into the war, fighting between Russia and Ukraine has bogged down, with neither able to make significant gains.\nNATO believes that Russia has suffered around 300,000 casualties, but officials decline to speculate about the toll on Ukraine.\nNATO as an organization does not provide military assistance to Ukraine, even though many members do on an individual basis and in groups.\nBut supplying ammunition and equipment has become a challenge as national weapons stocks dwindle.\nAnd the rhetoric has shifted. Six weeks ago, top NATO officials and ministers praised the slow but incremental gains that Ukraine's armed forces were making. This week, the country's mere survival was being hailed as a victory.\nStill, US Secretary of State Antony Blinken said the allies are 'determined to make sure that Ukraine has what it needs, including to take back territory.'\nHe said many NATO members want 'to help Ukraine build a future force that can ensure deterrence, and ensure defense against aggression going forward.'\nNATO Secretary General Jens Stoltenberg holds a press conference after the meeting of NATO Ministers of Foreign Affairs at the NATO Headquarters in Brussels, Belgium on November 29\nBlinken said the only thing preventing an end to the war 'is Vladimir Putin and the extent to which he believes that he can somehow outlast Ukraine, outlast his people,' and Putin's refusal 'to engage in any meaningful way in diplomacy or negotiations.'\nA senior US official said that most, if not all, NATO allies do not believe Putin will agree to any kind of deal with Ukraine until after the US election, and they approach their decisions on assistance to Ukraine with that in mind.\nThis means not only military aid but also reconstruction assistance, economic support and help with reforms to get Ukraine on a more sustainable path to NATO membership, said the official, who spoke on condition of anonymity because of the sensitivity of the issue. He offered no specifics.\nBut Kuleba said that Putin is always holding out for something.\n'He always waits for elections in another country to take place and for the new government and new leadership to change the attitude,' Kuleba said, 'and President Putin always failed, consistently failed, in his expectations.'\nHe added: 'There may be differences about the best ways to contain Russia, to deter Russia. But the understanding (at NATO) that Russia poses a threat is consensual, and I don't see that changing.'\nMeanwhile, on the ground in Ukraine, at least two people were killed in the street after Russian artillery struck the southern Ukrainian city of Kherson, officials said.\nRegional governor Oleksandr Prokudin posted a video of the attack's aftermath, showing two bodies in a city centre street and blood near holes in the road caused by the shelling.\nThe head of the Kherson city administration, Roman Mrochko, added that a health facility was also struck, leaving two medics injured.\nRussian attacks on the Dnieper river port city have become routine since the Ukrainian army liberated the city last year, with civilian deaths reported almost daily.\nWith the war's front line apparently static along most of its more than 600-mile length, and amid wintry weather, both sides in the war have used aerial bombardment to keep up the military pressure.\nRussian authorities said they repelled another heavy Ukrainian drone attack on Crimea, while Ukraine officials said air defences responded to drones and missiles launched by the Kremlin's forces.\nNeither side immediately reported any other casualties or damage.\nThe Russian defence ministry said that air defences destroyed 22 Ukrainian drones and intercepted 13 more over Crimea and the Sea of Azov early on Tuesday.\nShortly after, it added that another four drones were destroyed and two were intercepted.\nRussian officials commonly say drones were destroyed when they were shot down and say they were intercepted when electronic jamming is used.\nA Ukrainian soldier is seen near a Bradley Fighting vehicle as the Russia-Ukraine war continues in Avdiivka, Donbas, Ukraine on December 4\nMilitary and logistics sites in Russian-occupied Crimea, annexed by Moscow in 2014, have been a frequent target for Ukraine since the full-scale invasion.\nLast month, Ukraine launched one of its biggest drone attacks on Crimea, according to Russian officials, though they did not mention any casualties or damage.\nUkraine's air force, meanwhile, said it downed 10 out of 17 Shahed drones that Russia launched during the night. Moscow's forces also unleashed six S-300 missiles, the air force said.\nThe UK's Ministry of Defence said last month that Russia could target Ukraine's power grid again, just like last winter when Moscow aimed to break local resistance by denying civilians home heating and running water.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "NATO has three years to prepare for Russian attack: Stark warning from Poland as multiple reports say another Putin offensive is likely despite Ukraine stalemate", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12827357/NATO-three-years-prepare-Russian-attack-Poland-warning.html"}