{"authors": ["Viasat"], "date_download": "2024-02-05 15:30:47", "date_modify": "None", "date_publish": "2023-12-05 13:00:00", "description": "/PRNewswire/ -- Viasat Inc. (NASDAQ: VSAT), a global communications company, today announced that it has integrated a secure, flexible broadband Ku- and...", "filename": "https%3A%2F%2Fwww.prnewswire.co.uk%2Fnews-releases%2Fviasat-and-airbus-deliver-secure-broadband-satcom-for-irish-defence-forces-on-c295-msa-aircraft-302005434.html.json", "image_url": "http://mma.prnewswire.com/media/612940/VIASAT_LOGO.jpg?p=facebook", "language": "en", "localpath": null, "maintext": "Airbus integrated Viasat's multi-band airborne terminal on the C295 MSA aircraft to enable managed SATCOM service to Irish Air Corps\nCARLSBAD, Calif., Dec. 5, 2023 /PRNewswire/ -- Viasat Inc. (NASDAQ: VSAT), a global communications company, today announced that it has integrated a secure, flexible broadband Ku- and Ka-band airborne technology onto the Airbus C295 MSA aircraft for the Irish Air Corps (IAC), a division of the Irish Defence Forces focused on the Military Air Defence of Ireland airspace and supporting United Nations peacekeeping operations. Viasat and Airbus collaborated to integrate Viasat's flexible dual-band broadband terminal, the GAT-5530, on the C295 MSA aircraft to provide enhanced capability to this multi-purpose military airborne platform. Airbus completed delivery of two C295 MSA aircraft to the Irish Defence Forces earlier this year.\nThe Airbus C295 MSA, a highly reliable multirole surveillance aircraft, provides the Irish Air Corps with a new-generation tactical transport and ISR platform that is extremely versatile in the operations it can perform. With more than 280 C295 aircraft ordered worldwide, the platform's flexibility and tactical support capabilities offer Airbus' global customer base an enhanced multi-mission aircraft to meet modern mission requirements.\nThis integration of the Viasat GAT-5530 terminal will enable greater capability through secure, reliable satellite connectivity and enhance support for a range of command, control and communication (C3) mission needs – from tactical transport of troops and supplies to intelligence, surveillance, and reconnaissance (ISR). The GAT-5530 terminal supports the entire ITU Ku- and Ka-bands, which includes 3.5GHz of commercial and military Ka-band. This multi-faceted terminal offers greater operational flexibility for military customers as they seek increased resilience with multi-frequency (Ku/Mil-Ka/Commercial-Ka), multi-orbit (GEO, MEO, LEO, HEO), multi-network communications architectures.\n\"Viasat is thrilled to equip the C295 MSA aircraft with our advanced Ku- and Ka-band terminal to meet the specific needs of military customers,\" said Victor Farah, vice president, Government Systems. \"By combining our expertise with Airbus, we aim to enhance the operational capability, flexibility, and reliability of aircraft communications systems for military users. Our focus is on delivering secure, resilient, and scalable broadband SATCOM connectivity that is crucial for modern mission success. We're proud of this collaboration with Airbus and its potential to meet the ever-evolving demands of the military.\"\nThe Airbus C295 MSA with the fully integrated dual-band terminal was showcased at the Paris Air Show prior to delivery to the Irish Defence Forces. In addition to supporting mission connectivity needs, Viasat's broadband SATCOM service is designed to provide ample capacity to monitor and analyze in near real time aircraft health data for condition-based maintenance – minimizing operational downtime while extending the life of the airframe.\nViasat has also contracted with the IAC to provide a managed SATCOM service across multiple aircraft. This managed service will provide SATCOM services to the C295 MSA's, as well as a small fleet of PC-12 special mission aircraft, and will include access to Viasat's extensive Ku- and Ka-band networks for near-global service coverage.\nVisit the Viasat website to learn more about available multi-channel SATCOM terminals for air, land and sea platforms and flexible managed services to support military connectivity needs.\nAbout Viasat\nViasat is a global communications company that believes everyone and everything in the world can be connected. With offices in 24 countries around the world, our mission shapes how consumers, businesses, governments and militaries around the world communicate and connect. Viasat is developing the ultimate global communications network to power high-quality, reliable, secure, affordable, fast connections to positively impact people's lives anywhere they are—on the ground, in the air or at sea, while building a sustainable future in space. On May 30, 2023, Viasat completed its acquisition of Inmarsat, combining the teams, technologies and resources of the two companies to create a new global communications partner. Learn more at www.viasat.com the Viasat News Room or follow us on Facebook, Instagram, LinkedIn, X or YouTube.\nForward-Looking Statements\nThis press release contains forward-looking statements that are subject to the safe harbors created under the Securities Act of 1933 and the Securities Exchange Act of 1934. Forward-looking statements include statements about the features, expected benefits and performance of Viasat's GAT-5530 terminal; the enhanced operational capability, flexibility and reliability of aircraft communications systems enabled by the Viasat and Airbus collaboration; and the features and expected benefits to IAC of Viasat's managed SATCOM service. Readers are cautioned that actual results could differ materially and adversely from those expressed in any forward-looking statements. Factors that could cause actual results to differ include: construction, launch and operation of satellites, including the effect of any anomaly, operational failure or degradation in satellite performance; contractual problems, product defects, manufacturing issues or delays, regulatory issues, technologies not being developed according to anticipated schedules, or that do not perform according to expectations; delays in approving U.S. government budgets and cuts in government defense expenditures; and increased competition and other factors affecting the government and defense sectors generally. In addition, please refer to the risk factors contained in Viasat's SEC filings available at www.sec.gov, including Viasat's most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q. Readers are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date on which they are made. Viasat undertakes no obligation to update or revise any forward-looking statements for any reason.\nCopyright © 2023 Viasat, Inc. All rights reserved. Viasat, the Viasat logo and the Viasat Signal are registered in the U.S and in other countries to Viasat, Inc. All other product or company names mentioned are used for identification purposes only and may be trademarks of their respective owners.", "source_domain": "www.prnewswire.co.uk", "text": null, "title": "Viasat and Airbus Deliver Secure Broadband SATCOM for Irish Defence Forces on C295 MSA Aircraft", "title_page": null, "title_rss": null, "url": "https://www.prnewswire.co.uk/news-releases/viasat-and-airbus-deliver-secure-broadband-satcom-for-irish-defence-forces-on-c295-msa-aircraft-302005434.html"}