{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:30:50", "date_modify": "None", "date_publish": "2023-12-05 17:05:09", "description": "Israeli forces pushing towards southern city of Khan Younis and engaged in battles for key urban areas in the north", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F05%2Fisrael-faces-difficult-second-phase-of-war-with-fighting-in-north-and-south-gaza.json", "image_url": "https://i.guim.co.uk/img/media/3cebcc75926c60ec720fbf2177b0f1896d452b17/0_315_6634_3982/master/6634.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7edcb369000d7b72320eb570526b20be", "language": "en", "localpath": null, "maintext": "As the Israel Defense Forces (IDF) said they were pushing ahead with the second phase of the ground offensive against Hamas, towards the southern city of Khan Younis, it became clear they were still involved in intense combat to control substantial areas of northern Gaza.\nGen Yaron Finkelman, the head of the IDF’s southern command, said on Tuesday: “We are in the most intense day [of fighting] since the beginning of the ground operation in terms of Hamas terrorists killed, the number of encounters with the enemy and the volume of fire our forces use, both from the ground and the air. We intend to continue attacking.”\nDespite pushing into the centre of Gaza City, including to the main hospital, Dar al-Shifa, the IDF is still engaged in heavy fighting for key urban areas in the north, which it says Hamas and other factions use as strongholds, including Jabalia refugee camp and Shuja’iya on the east of Gaza City. Other officials said the IDF was now operating inside Shuja’iya and Jabalia, which have been described as the last Hamas strongholds in the north.\nSince the collapse of a temporary ceasefire between Israel and Hamas during which militant-held hostages were swapped for Palestinians held in Israeli prisons, the Israeli military has launched an intense campaign of airstrikes and ground fighting in the southern Gaza Strip as well.\nUnderlining the sense that worse fighting may be ahead as Israel tries to advance into some of the most dense urban areas, an Israeli government spokesperson said on Tuesday that the next phase would be challenging.\nThe IDF spokesperson Lt Col Richard Hecht described the fighting in the north as “close quarter and face to face”. Israeli army chief Herzi Halevi described it as the third phase of the war overall, following the initial aerial offensive and the ground incursion into northern Gaza.\nOn Monday the IDF announced the death of three more soldiers in fighting in northern Gaza, bringing the Israeli military death toll during the ground offensive to 74.\nIt is clear that Israeli forces control a number of significant locations, including large parts of the main Salah al-Din north-south road, and have cut Gaza into at least two sectors with the apparent intention of cutting off Khan Younis too from the southern-most part of the strip. What is less certain is the exact status of a number of key urban centres.\nJabalia is a case in point. The largest of the Palestinian refugee camps in Gaza, which were first established in 1948, Jabalia is home to more than 100,000 people, who live in a dense network of lanes and streets occupying 1.4 square kilometres. It is the closest of Gaza’s refugee camps to the Israeli border, located not far from the main Erez crossing.\nThe IDF made claims to have encircled the Jabalia area earlier in the conflict, but a statement saying it had completed the encirclement of the refugee camp only this week suggests that those battles are far from complete even as the IDF has switched its focus to southern Gaza.\nFor their part, Palestinian fighters have launched attacks on Israeli forces along the route of Fallujah Road in Jabalia and around the Sheihk Radwan area south-west of Jabalia.\nThe fighting in key areas of the north comes as the Israeli military has continued to sustain casualties there, while rocket fire from Gaza has continued on a daily basis, including one that struck a kindergarten building in Tel Aviv on Tuesday.\nFootage released by the IDF on Monday from an area of an intense fighting where two soldiers were killed showed troops moving from building to building.\nShuja’iya, on the eastern outskirts of Gaza City, is home to a similarly sized population as Gaza’s most populous neighbourhood and was the scene of the battle of Shuja’iya during the 2014 Gaza war between the IDF and Hamas’s Izz ad-Din al-Qassam brigades. It has been described in the past as a “terrorist fortress”.\nWhile covering a large area – 6 sq km – it is still one of Gaza’s densely populated areas. During the battle there in July 2014, Israeli troops ran into a series of heavy ambushes after encountering little early resistance.\nIn the south, the focus of the Israeli offensive has been Khan Younis, with Israeli forces advancing from eastern border villages towards Bani Suheila, a town just to the east of Khan Younis on the main road approaching the city.\nHalima Abdel-Rahman, who fled to the town earlier in the war from her home in the north, said they could hear explosions throughout the night. “They are very close,” she said. “It’s the same scenario we saw in the north.”\nSatellite photos from Sunday showed about 150 Israeli tanks, armoured personnel carriers and other vehicles just under 6km (4 miles) north of the heart of the city. Other tanks approached even further to the outskirts of Hamid City, a Qatari-built housing development.\nThe Israeli deployment sits just to the west of Salah al-Din, the main north-south corridor within the Gaza Strip that many used to flee. An AP analysis found positions in four clusters. Israeli soldiers have created packed dirt berms around some of their positions, which can be used for cover.\nA sense of scepticism over the progress of the campaign was provided by the veteran columnist Nahum Barnea, who suggested in the Yedioth Ahronoth newspaper that pressure from Washington over the expanded Israeli campaign in the south, where 1.8 million of Gaza’s population of 2.3 million are now concentrated, would limit its scope.\n“A sober observation of the options currently available leads to the conclusion that the ground fighting in Khan Younis will not be able to last longer than 10 days to two weeks,” he wrote.\n“The combination of 2 million evacuees – 1.8 million from the northern Gaza Strip and 200,000 new ones from Khan Younis – plus American pressure, dictate the limitations of the operation. There is also a danger of friendly fire. In that regard, the price we are paying in the northern Gaza Strip is extremely troubling. Khan Younis is liable to exact a similar price.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israel faces difficult phase of war with fighting in north and south Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/05/israel-faces-difficult-second-phase-of-war-with-fighting-in-north-and-south-gaza"}