{"authors": ["Ajit Niranjan", "Damien Gayle", "Nina Lakhani"], "date_download": "2024-02-05 15:30:51", "date_modify": "None", "date_publish": "2023-12-05 15:00:43", "description": "Many in the global movement are divided on whether or how to take a stand on the conflict", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fenvironment%2F2023%2Fdec%2F05%2Fno-climate-justice-without-peace-gaza-becomes-flashpoint-for-climate-activists.json", "image_url": "https://i.guim.co.uk/img/media/f58a5dc832650fb98fe593a8f6e087a13a757f7d/0_0_4295_2577/master/4295.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1d0ba0b26645598ab140c6e45e17a42f", "language": "en", "localpath": null, "maintext": "When Greta Thunberg posted a photo of herself holding a “stand with Gaza” sign on Instagram in October, the backlash in Israel and Germany came hard and fast.\nAn Israeli Defense Forces (IDF) spokesperson initially told Politico that “whoever identifies with Greta in any way in the future, in my view, is a terror supporter,” although later retracted his comments. The official X account of Israel said “Hamas doesn’t use sustainable materials for their rockets” and told Thunberg to speak up for its victims. The Israeli education ministry said it would strike any reference to the Swedish climate activist from its curriculum.\nIn Germany, politicians and pundits across the political spectrum demanded that the national branch of Fridays for Future, the student protest movement that Thunberg started in 2018, distance itself from her views. The group put out a statement underlining its support for Israel’s right to exist and, in the weeks that followed, explicitly distanced itself from social media posts made by the international group. Germany’s leading news magazine Der Spiegel ran a lengthy article with personal comments on Thunberg’s childhood character and appearance under the headline: “Has Greta Thunberg betrayed the climate movement?”\nThe violence in Israel and Gaza since 7 October has become an unexpected flashpoint for climate activists in rich countries. As world leaders meet for the Cop28 summit in Dubai, the loose collection of movements, many of which have built their support around inclusivity and global justice, are divided on whether or how to take a stand on the conflict.\nPositions taken have led to splits within groups and between them. “The national debates are less about the conflict itself,” said Stefan Aykut, director of the Center for Sustainable Society Research (CSS) at the University of Hamburg. “Instead, they are immediately captured by the dominant cultural prism within each society.”\nThe legacy of the Holocaust carried out by the Nazis is central to Germany’s postwar identity, and in recent years has been used to argue that Israel’s security is fundamentally tied to the German state today. Environmental groups in Germany have expressed solidarity with Israel during the current conflict, as well as sympathy for Palestinian suffering, whereas in the UK and US activists have criticised Israel with stronger language – describing its bombing of Gaza as a “genocide”, which Israel rejects – and pushed their governments to call for a permanent ceasefire.\nFor environmental groups far from the fighting, the pressure to take a position has grown even stronger as racism against Jews and Muslims has soared across the US and Europe. It has also raised the stakes of striking the wrong tone.\nPart of the backlash generated by Thunberg’s post came from a blue octopus toy visible in the corner of the picture. The toy is an emblem of neurodiversity, popular with people with autism as a way to express feelings, that also resembles a symbol used in racist propaganda to falsely claim Jews control the world. Thunberg, who has a form of autism, said she was unaware of the link, and replaced the photo with one that left out the toy.\nThunberg was also criticised for her failure to condemn Hamas or support its victims in the same post in which she spoke out against Israel.\nSharona Shnayder, a Nigerian-Israeli climate activist who lost friends in the Hamas terror attack at a music festival near Israel’s border with Gaza, said: “She didn’t even bother to mention it until people called her out. It hurt on a level that I don’t think you can describe.”\nShnayder, who founded a litter picking movement called Tuesdays for Trash, and was herself inspired by Thunberg, said the lack of compassion towards Israeli victims of the war in global discourse has alienated local activists. “I talk about trash a lot. I talk about waste management. In that moment, I really felt: ‘Wow, maybe I have no value in this world.’”\nHamas militants killed 1,200 people in Israel on 7 October and took more than 200 hostages, according to the Israeli government. Since then, Israel has killed more than 15,000 Palestinians, according to health officials in Gaza, and starved more than 2 million Gazans of food, water, fuel and medical care.\nWhile Fridays for Future did not respond to a request for comment on this article, FFF Sweden including Thunberg wrote a piece in the Guardian on Tuesday clarifying their stance, saying: “Contrary to what many have claimed, Fridays for Future has not ‘been radicalised’ or ‘become politica’. We have always been political, because we have always been a movement for justice.”\nThe German branch has said it stands in solidarity with the victims of Hamas’ violence and with Jews across the world, while also “seeing” the suffering of Gazans and being “greatly concerned” by the rising anti-Muslim racism in Germany. “None of these are contradictions,” it said. “Our hearts are big enough to feel all of this at the same time.”\nA spokesperson for the group said: “There is no room for compromise when it comes to the protection of Jewish lives and Israel’s right to exist. We are horrified by the suffering experienced by innocent lives and stand in solidarity with civilians both in Israel and Gaza.”\nGermany has become an outlier among rich democracies in the breadth of its political and media support for Israel’s response. “Germany is a special case when it comes to those politics,” said Oscar Berglund, a climate activism researcher at the university of Bristol.\nFaced with a death toll that started high and has risen rapidly, other climate advocacy groups have condemned the killing of civilians on both sides without naming the actors involved.\nNamrata Chowdhary, head of public engagement at campaign group 350.org, said: “We’ve been very deliberate about taking a slower, more cautious approach, and speaking where it seems appropriate for us to do so in solidarity.”\nThe group has called for a ceasefire and respect for international humanitarian law. “We recognise that there can be no climate justice without peace, and in calling for peace we’re being very clear about peace on both sides.”\nGreenpeace made similar demands: “Targeting of civilians is a war crime, no matter who does it.”\nThe unfolding horrors – and how to respond to them as a movement – have been a focus at Cop28 this past week. While two large environmental justice coalitions, – the Palestinian Environmental NGOs network (Pengon) and La Via Campesina, an international movement representing millions of peasants, landless workers, farmers, Indigenous people, pastoralists, and migrant farmworkers – have boycotted the summit, others have used it as an opportunity to put a spotlight on the conflict.\nOn Thursday, the first day of the summit, the UNFCCC, the United Nations body overseeing the conference, cut off a livestream to the event as Asad Rehman, director of the UK-based organisation War on Want and founder of the global campaign to demand climate justice, called for a permanent ceasefire. All protests have to be pre-approved by the UNFCCC and no countries or companies are allowed to be mentioned. “The Palestinian struggle is woven into every struggle for justice including climate justice,” Rehman said. “We want a free Palestine.”\nTasneem Essop, an anti-apartheid campaigner from South Africa and director of the Climate Action Network, the world’s largest coalition of 1,900 climate action groups, said: “The unfolding genocide in Gaza may not affect the negotiations directly, but will play into the growing divide and mistrust between the global south and the global north.”\nMany climate justice groups in the UK have swung behind the Palestinian cause. Friends of the Earth UK became one of the earliest, explicitly stating it stood in solidarity with its Palestinian sister organisation “in its longstanding opposition to the occupation” of Palestinian lands.\nIn a statement on its website, Extinction Rebellion described “the collective punishment being imposed on innocent civilians in Gaza” as a “war crime”. The organisation declined to comment for this article, but XR groups have taken autonomous actions. On 11 November, the date of a contentious Palestine solidarity march and counter-protest that coincided with the UK’s Remembrance Day, XR Parents placed hundreds of children’s shoes on the steps of Trafalgar Square in London and read out the names of the 4,100 Palestinian and 26 Israeli children who had already then been killed.\nRobin Wells, director of Fossil Free London, said her group had mobilised support for three of the big solidarity marches in London, as well as staging their own, smaller protests outside the energy companies BP and Ithaca for their roles in extracting gas from Israeli-controlled fields in the eastern Mediterranean contested by the Palestinians.\nBut even beyond the moral question of what position to take, climate activists have also been divided on the strategic value of championing causes that go beyond fossil fuels.\nFor some, the shift in focus has been an unwelcome distraction. At a recent protest in Amsterdam where Thunberg spoke alongside Afghan and Palestinian women, a man stood up on stage and snatched the microphone from her hands. “I came for a climate protest, not a political point of view,” he said.\nSome climate advocacy groups have chosen not to comment on the war, with one adding that they had not expressed a position on previous conflicts. Others have argued that climate and social justice are too tightly linked to ignore extreme violence.\nA spokesperson for Greenpeace said: “We see a strategic benefit and a moral imperative. Environmental issues are hardly ever ‘just’ environmental issues. Many of the crises we face are interconnected, whether it’s social inequalities fuelling the climate crisis or climate impacts driving up food prices and propelling social injustices.”\nBerglund said an issue that some environment movements have faced is their lack of explicit political values or goals. “It was never tenable in the long run to have a depoliticised climate movement,” he said.\nActivists are also having to reckon with the risk of striking the wrong tone and losing support from the people and politicians they are trying to reach. At the CSS in Hamburg, Aykut said that even though the climate movement is global, its impact was “first and foremost” in the countries with the greatest power over emissions.\n“It is not only about rallying minorities, but also about persuading the wider public,” said Aykut. “Intersectionality is obviously crucial for the climate movement but it is not a simple maths problem where you can add more and more different groups until you get a majority. Every time you include a new faction and address their concerns, there is the risk of alienating another part of the movement.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘No climate justice without peace’: Gaza becomes flashpoint for climate activists", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/environment/2023/dec/05/no-climate-justice-without-peace-gaza-becomes-flashpoint-for-climate-activists"}