{"authors": ["Danielle Summer"], "date_download": "2024-02-05 15:30:53", "date_modify": "None", "date_publish": "2023-12-05 00:01:39", "description": "After more than 80 Israeli captives have been released by Hamas in return for 180 Palestinian prisoners, Israel has accused Hamas of breaking the ceasefire agreement.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fpalestinian-prisoner-speaks-out-israel-say-hamas-broke-ceasefire-1721953.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721624/west-bank.jpg", "language": "en", "localpath": null, "maintext": "After being accused of attempted murder of an Israeli in the occupied West Bank, Fatima Shahin was arrested and held in an Israeli prison for seven months.\nShahin, a 33-year-old woman from the city of Bethlehem in the Palestinian West Bank, was freed in a group of 39 prisoners that were released in exchange for Israeli captives.\nSo far, in the last week, Israel has released 180 Palestinian prisoners, including more than 120 people under the age of 18 and more than 35 women.\nAccording to AP, the group of Palestinian civilians have been held under Israel's \"administrative detention\" policy which is used against people who have been accused of planning to commit future terror offences.\nAfter a large group of prisoners were released by Israel from Ofer prison on Friday last week, a detention centre in Jerusalem, crowds gathered around the bus which carried them through the occupied West Bank.\nVideos of the warm welcome showed people in the Palestinian territory greeting the group with the green flags of Hamas and wearing balaclavas.\nLess than 25 per cent of the Palestinian detainees had been convicted of any crime. Israel claimed that they were being held on remand and awaiting trial.\nShahin is one of the 128 out of the 180 prisoners who weren't convicted of a crime.\nA legal adviser at the Israel Defense Forces' International Law Department told reporters that Israel uses two different court systems in the West Bank because it is not allowed to \"export\" its own legal systems in the Palestinian territory.\n\"They accused me of carrying out a stabbing. It's not true. They opened fire (at) me. I was hit in the spine with two bullets... I have partial paralysis. I cannot feel my legs or stand up,\" Shahin said.\nThe 33-year-old also reported that she was denied access to speaking to her family. Shahin was also refused a lawyer, she said.\nSince 1967, under Israel's separate justice systems, Palestinian civilians have been subject to Israel's military court system. However, Jewish settlers in the West Bank fall under the jurisdiction of civilian courts.\nThe Israeli Information Center for Human Rights in the Occupied Territories, B'Tselem, explained that the separate courts \"serve as one of the central systems maintaining Israel's control over the Palestinian people\".\nBefore the \"truce agreement\" was announced last week, the Israeli Ministry of Justice released a list that contained the names of 300 Palestinian prisoners who were eligible for release – according to the Israeli authorities.\nWith reference to Israel's ability to arrest those in the West Bank, based on suspicions relating to future crimes, B'Tselem added: \"This leaves the detainees helpless – facing unknown allegations with no way to disprove them, not knowing when they will be released, and without being charged, tried or convicted.\"\nAs part of the temporary ceasefire, which also allowed for an influx of aid into the Gaza Strip, Hamas has released 81 Israeli captives – including more than 30 children and more than 40 women.\nAmongst the children released, were three-year-old twin sisters and 12-year-old Eitan Yahalomi.\nSpeaking on behalf of Yahalomi, his aunt, Deborah Cohen, told reporters that the 12-year-old was forced to watch a movie-like montage of Hamas' unprecedented attack on Israeli civilians on October 7.\n\"Hamas forced him to watch films of the horrors, the kind that no one wants to see, they forced him to watch them,\" Cohen said.\nAccording to sources on the ground, the Hamas footage included civilians being raped, beheaded, burned alive and murdered.\nThis morning, Israel accused Hamas of breaking the \"truce agreement\" and temporary ceasefire, allegedly firing rockets into Israeli territory.\nAlthough the ceasefire was extended for 48 hours on Tuesday this week, with talks of further extensions, three Israeli civilians were also gunned down by Palestinian militants this morning.\nThe civilians were killed while waiting at a bus stop at the main entrance of Jerusalem.\nBoth of the militants were identified to be affiliated with Hamas and reports note that they had both spent time in Israeli jails for previous terror offences.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Palestinian Prisoner Speaks Out As Israel Say Hamas Broke Ceasefire", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/palestinian-prisoner-speaks-out-israel-say-hamas-broke-ceasefire-1721953"}