{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:15:43", "date_modify": "None", "date_publish": "2024-01-26 02:00:16", "description": "Hasan Minhaj's deal to take over as host of The Daily Show was 'all but done' by the summer of 2023, according to The Hollywood Reporter - but a September expose by The New Yorker sunk him.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13008335%2Fhasan-minhaj-daily-replace-trevor-noah-new-yorker.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/26/01/80487861-0-image-m-23_1706231927757.jpg", "language": "en", "localpath": null, "maintext": "Comedian Hasan Minhaj's deal to take over as host of The Daily Show 'was all but done by late summer,' according to a report - but then torpedoed by the September publication of a New Yorker expose accusing him of embellishing his stories.\nThe 38-year-old was one of several people to take turns hosting after Trevor Noah stepped down in September 2022, ending seven years in the hot seat.\nMinhaj, whose Netflix series Patriot Act won him legions of fans, an Emmy and a Peabody Award, was the top contender to ultimately replace Noah by the summer of 2023, The Hollywood Reporter said on Thursday.\nBut on September 15, 2023, The New Yorker published a deep dive into Minhaj's stories which formed the foundation of his standup routine.\nHasan Minhaj is seen with Trevor Noah, who stood down after seven years in September 2022. Since then there has been a rotating cast of hosts, and Minhaj was the favorite until The New Yorker published its expose\nThe New Yorker dug into some of Minhaj's stories and found they were not entirely true\nThe magazine found that he had never taken his daughter to hospital after receiving a suspicious white powder in the post, and invented a story about a FBI infiltrator coming to his Sacramento-area mosque, in 2002. The infiltrator he named was in prison in 2002, and didn't begin to work for the FBI until 2006.\nMinhaj was also found to have concocted a story about visiting the Saudi embassy in Washington DC and finding out on the way home that Jamal Khashoggi had been murdered that day - Minhaj's visit was a month before the murder.\nAnd a woman who Minhaj described as having rejected him for the prom because he was brown-skinned had a very different recollection of events.\nMinhaj published a 21 minute video online, saying the New Yorker writer made him sound like 'a psycho,' and promising to be 'more thoughtful' about blending fiction and nonfiction.\nJon Stewart, host from 1999-2015, is now returning to host the show on Mondays\nIn the months since, however, Minhaj has been unrepentant, telling crowds at his standup shows that he took the scrutiny as a badge of honor.\n'I've made it: I got a real old scandal,' he said, adding, 'A dorky scandal.'\nMinhaj continued: 'I had to go head-to-head with one of the most dangerous organizations in the world,' noting that he didn't mean the U.S. military or the Israeli Defense Forces.\n'I am talking about a white woman with a keyboard.'\nBut The Hollywood Reporter said that Minhaj, in the eyes of The Daily Show producers, was now tarnished and unfit for the plum role.\nThey announced this week that Jon Stewart, who hosted the show from 1999-2015, will return on Mondays.\nThe rest of the week will still be helmed by a rotating cast of guest hosts.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hasan Minhaj's deal to take over as host of The Daily Show 'was all but done' until he was accused of embellishing his life stories", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13008335/hasan-minhaj-daily-replace-trevor-noah-new-yorker.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}