{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:30:53", "date_modify": "None", "date_publish": "2023-12-05 06:56:26", "description": "He was among three soldiers who were killed in action in Gaza on Sunday.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fbritish-teenager-dies-fighting-israeli-military-gaza-1721994.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721708/smoke-billows-over-gaza-during-israeli-bombardment-amid-continuing-battles-between-israel.jpg", "language": "en", "localpath": null, "maintext": "A 19-year-old British man was killed fighting for the Israel Defense Forces in Gaza on Sunday.\nThe teenager, identified as Binyamin Needham, died fighting Hamas days after a truce between Israel and the militant organisation came to an end. Needham was born in Edgware, in north London. He moved to Israel when he was eight years old, according to local media reports.\n\"He had just finished his apprenticeship and was doing his professional training. We don't know the exact details of what happened, but he was only in Gaza for two days. He went in on Friday and died Sunday,\" his sister, Orli Ferris, told the Mirror.\nAccording to the Israel Defense Forces (IDF), he was among three soldiers who were killed in action in Gaza on Sunday. The other two soldiers have been identified as Neriya Shaer and Ben Zussman.\nThe IDF has said 401 Israeli soldiers have been killed since the beginning of the war between Israel and Hamas.\n🔴A 19-year-old British teenager has been killed in Gaza. Binyamin Needham, who is of duel nationality, was fighting for the Israel Defense Force.\nRead more ⬇️https://t.co/E0uoI9dAHI pic.twitter.com/7KXdNoiFeg — The Telegraph (@Telegraph) December 4, 2023\nNathaniel Young is another British national who died fighting Hamas during its attack on Israel on October 7. The 20-year-old British man was a corporal in the Israel Defense Forces. He had been listed as living in Tel Aviv and a member of the army's 13th Battalion.\nHis family confirmed his death in a statement posted on Facebook. \"We are heartbroken to share that our little brother Nathaniel Young was tragically killed on the Gaza border yesterday,\" it read.\nAnother 26-year-old British man who had gone missing after Hamas' surprise attack was confirmed dead a few weeks ago, per a report by Sky News.\nJake Marlowe had moved to Israel two years ago and was one of the soldiers who were providing security at a music festival near the Gaza border. The news of his death was confirmed by his family in a statement posted on social media.\nAs many as 17 British nationals, including children, have been reported dead or missing in Israel. According to an estimate, 50,000–60,000 Britons and dual nationals live in Israel and Gaza.\nThe big picture:\nThe ongoing war has already killed more than 15,000 Palestinians and more than 1,200 Israelis, according to the United Nations.\nGaza-based Hamas attacked Israel with a barrage of some 2,000–5,000 missiles on October 7. Hamas brutally massacred Israelis (mostly civilians) and took over 200 hostages in the surprise assault.\nThe aftermath of Hamas' attack has led Israel to impose a siege on Gaza and launch thousands of retaliatory airstrikes. The situation has spiralled into a cycle of violence, with mounting casualties on both sides.\nHowever, last week's temporary truce was able to achieve some positive outcomes. More than 100 hostages were released by Hamas in exchange for 240 Palestinians held in Israeli jails during the 7-day truce. It is reported that there are still 130 hostages in Hamas captivity.\nIsrael has said that it will assume \"overall security responsibility\" for the Gaza Strip \"for an indefinite period\" once the war is over. However, it also claims that it has no plans to reoccupy the territory.\nIsraeli Prime Minister Benjamin Netanyahu has said that the latest conflict between Hamas and Israel is \"neither an operation nor a round, but a war to the end\".\nHamas is a Palestinian group that has ruled the Gaza Strip since 2007. The Gaza Strip is a 41-kilometre (25-mile) long and 10-kilometre-wide area wedged between Israel, Egypt, and the Mediterranean Sea.\nIsrael occupied Gaza in the 1967 Six-Day War and returned it to the Palestinians in 2005. It later imposed an air, land, and sea blockade on Gaza. The blockade was imposed after Hamas came to power in Gaza in 2007. It is home to approximately 2.3 million Palestinians.\nIsrael controls Gaza's shoreline, airspace, and trade and has vowed to continue the fight until all hostages are released.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "British Teenager Dies Fighting For Israeli Military In Gaza", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/british-teenager-dies-fighting-israeli-military-gaza-1721994"}