{"authors": ["Reged Ahmad", "Richard Luscombe", "Gloria Oladipo", "Martin Belam", "Helen Livingstone"], "date_download": "2024-02-05 15:30:54", "date_modify": "None", "date_publish": "2023-12-05 02:35:03", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F04%2Fisrael-hamas-war-live-updates-hundreds-palestinians-killed-israel-ground-attack-gaza-strip-news.json", "image_url": "https://i.guim.co.uk/img/media/9f3d9f075b31b1de1084cfaf7d004e6a306c2e8d/0_182_4435_2661/master/4435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=17f88980fec09cb6091203d890bed07c", "language": "en", "localpath": null, "maintext": "From 4 Dec 2023 00.31 CET A UN official has warned on Monday that “an even more hellish scenario” looms in Gaza in which humanitarian aid simply grinds to a halt. Agence France-Presse is reporting: “The conditions required to deliver aid to the people of Gaza do not exist,” said Lynn Hastings, UN humanitarian coordinator for the Palestinian territories. Since the end of a seven-day truce, Israeli forces have pushed into southern Gaza, “forcing tens of thousands … into increasingly compressed spaces, desperate to find food, water, shelter and safety,” Hastings said. “Nowhere is safe in Gaza and there is nowhere left to go.” “If possible, an even more hellish scenario is about to unfold, one in which humanitarian operations may not be able to respond,” Hastings said in a statement. Hastings, a Canadian, rejected the idea of “safe zones” urged upon Israel by the US government where people are still unable to move about freely. “These zones cannot be safe nor humanitarian when unilaterally declared,” she said. “What we see today,” Hastings added, “are shelters with no capacity, a health system on its knees, a lack of clean drinking water, no proper sanitation and poor nutrition for people already mentally and physically exhausted: a textbook formula for epidemics and a public health disaster.” Further complicating aid deliveries, two major roads in Gaza have been declared off-limits to UN teams and trucks, Hastings said. Hastings has her base in Jerusalem but Israel last week informed the UN that it would not renew her visa, accusing her of not being “impartial.” Reged Ahmad here, taking over from Richard Luscombe.\nUpdated at 02.37 CET\n5 Dec 2023 03.35 CET Summary It is 4:34am on Tuesday in Gaza and Tel Aviv and this blog is now closing. You can read the full report of our coverage for more. But here is a summary of the latest developments: A UN official has warned on Monday that “an even more hellish scenario” looms in Gaza in which humanitarian aid simply grinds to a halt. Agence France-Presse has reported that “The conditions required to deliver aid to the people of Gaza do not exist,” said Lynn Hastings, UN humanitarian coordinator for the Palestinian territories. Since the end of a seven-day truce, Israeli forces have pushed into southern Gaza, “forcing tens of thousands … into increasingly compressed spaces, desperate to find food, water, shelter and safety,” Hastings said. “Nowhere is safe in Gaza and there is nowhere left to go.”\nIsrael’s military expanded ground operations deeper into southern Gaza, with dozens of Israeli tanks, armoured personnel carriers and bulldozers entering the Gaza Strip near Khan Younis. Witnesses said Israeli military vehicles were on the southern section of the main north-to-south road in Gaza, “firing bullets and tank shells at cars and people trying to move through the area”. Israeli military issued fresh orders to Palestinians in about 20 areas of central Gaza to move farther south, posting maps online.\nThe Israeli army has denied telling the World Health Organization to empty an aid warehouse in southern Gaza within 24 hours before ground operations in the area render it unusable. The Israeli defence ministry body responsible for Palestinian civilian affairs, COGAT said on X “The truth is that we didn’t ask you to evacuate the warehouses and we also made it clear (and in writing) to the relevant UN representatives”. WHO chief Tedros Adhanom Ghebreyesus wrote on X on Monday: “Today, WHO received notification from the Israel Defense Forces that we should remove our supplies from our medical warehouse in southern Gaza within 24 hours, as ground operations will put it beyond use… We appeal to Israel to withdraw the order, and take every possible measure to protect civilians and civilian infrastructure, including hospitals and humanitarian facilities,” he wrote.\nThe White House said Hamas broke an agreement to release more women hostages, and its refusal to do so was the cause of the collapse of the week-long truce with Israel on Friday. In a briefing at the White House on Monday afternoon, US national security advisor Jake Sullivan said “it is that refusal by Hamas that has caused the end of the hostage agreement, and therefore the end of the pause in hostilities”. He it was “too soon” to judge if Israel provided enough notice, or done enough to inform Palestinian civilians where it would be safe as it moved into southern Gaza, but said the US warned Israel civilians must be protected.\n5 Dec 2023 03.23 CET The Wall Street Journal is reporting that Israel has assembled a large system of pumps that may be used to flood tunnels used by Hamas under the Gaza Strip in a bid to drive out fighters. The paper is citing US officials as the source, but says the plan could threaten Gaza’s water supply. The Wall Street Journal also said an Israel Defense Forces (IDF) official declined to comment on the flooding plan but was quoted as saying: “The IDF is operating to dismantle Hamas’s terror capabilities in various ways, using different military and technological tools.”\n5 Dec 2023 02.45 CET The Israeli army has denied telling the World Health Organization to empty an aid warehouse in southern Gaza within 24 hours before ground operations in the area render it unusable. The Israeli defence ministry body responsible for Palestinian civilian affairs, COGAT said on X “The truth is that we didn’t ask you to evacuate the warehouses and we also made it clear (and in writing) to the relevant UN representatives” WHO chief Tedros Adhanom Ghebreyesus wrote on X on Monday: “Today, WHO received notification from the Israel Defense Forces that we should remove our supplies from our medical warehouse in southern Gaza within 24 hours, as ground operations will put it beyond use”. “We appeal to Israel to withdraw the order, and take every possible measure to protect civilians and civilian infrastructure, including hospitals and humanitarian facilities,” he wrote. At a press conference earlier on Monday, the WHO regional director for the eastern Mediterranean, Ahmed al-Mandhari, said the intensification of military ground operations in southern Gaza risked depriving thousands of people of health care, Agence France-Presse reports. “We saw what happened in the north of Gaza. This cannot serve as a model for the south,” he said.\n5 Dec 2023 01.46 CET The Israel Defence Forces (IDF) says on X and Telegram that it has fired on Hezbollah in Lebanon with “IAF fighter jets”. It says it is in response to a strike by Hezbollah from Lebanon to Israel on Monday. מטוסי קרב של חיל האוויר תקפו לפני זמן קצר עמדות שיגור, תשתית טרור ומבנה צבאי של ארגון הטרור חיזבאללה בשטח לבנון בתגובה לשיגורים לעבר שטח מדינת ישראל אמש >> pic.twitter.com/CRNNzo3kb1 — צבא ההגנה לישראל (@idfonline) December 5, 2023\n5 Dec 2023 01.29 CET Unicef Spokesperson James Elder has posted a video on X a couple of hours ago about children being injured and praised the commitment of the health staff. According to the video, he’s in Nasser hospital in the Gaza Strip. Elder says in the video: We keep saying it’s a war zone, this is again what it looks like Somehow, amid the never-ending attacks in Khan Yonis #Gaza the health workers just keep responding. Though as one told me: \"we are torn, whilst we are here, we know our families may be bombed without us\". pic.twitter.com/JnJJiReBNT — James Elder (@1james_elder) December 4, 2023\n5 Dec 2023 01.13 CET Israel’s military has renewed calls for mass evacuations from the southern town of Khan Younis, according to Associated Press. Israeli warplanes are reported to have heavily bombarded an area around Khan Younis in southern Gaza on Monday. The expanded assault posed a choice for hundreds of thousands of Palestinians – either stay in the path of Israeli forces or flee within the confines of southern Gaza with no guarantee of safety. Aid workers have warned that the mass movement would worsen the already dire humanitarian catastrophe in the territory. “Another wave of displacement is underway, and the humanitarian situation worsens by the hour,” the Gaza chief of the U.N. agency for Palestinian refugees, Thomas White, said in a post on X. Thomas White also described the scene yesterday: Another wave of displacement is underway, and the humanitarian situation worsens by the hour.\nThe roads leading South towards Rafah are clogged with cars and donkey carts packed with people and their meagre possessions. — Thomas White (@TomWhiteGaza) December 4, 2023\n4 Dec 2023 00.51 CET Australia’s deputy prime minister says the country remains a safe place for Jewish people, despite Israel issuing travel warnings for its citizens looking to visit. Israel has upgraded travel warnings to multiple countries, including Australia, after a rise in antisemitism stemming from the ongoing conflict in the Middle East, Australian Associated Press is reporting. Travel warnings to Australia have been raised to level 2, which urges Israeli citizens to take additional precautions while visiting. Richard Marles has urged greater social cohesion in Australia after the conflict. He told the Australian Broadcasting Corporation: It’s really important that all of us, in what is a very difficult time globally, are looking after each other… It is very important that as people legitimately express their views about what’s happening in the world, this is done in a peaceful manner … many in the Jewish community are finding this to be a very difficult time.\n4 Dec 2023 00.31 CET A UN official has warned on Monday that “an even more hellish scenario” looms in Gaza in which humanitarian aid simply grinds to a halt. Agence France-Presse is reporting: “The conditions required to deliver aid to the people of Gaza do not exist,” said Lynn Hastings, UN humanitarian coordinator for the Palestinian territories. Since the end of a seven-day truce, Israeli forces have pushed into southern Gaza, “forcing tens of thousands … into increasingly compressed spaces, desperate to find food, water, shelter and safety,” Hastings said. “Nowhere is safe in Gaza and there is nowhere left to go.” “If possible, an even more hellish scenario is about to unfold, one in which humanitarian operations may not be able to respond,” Hastings said in a statement. Hastings, a Canadian, rejected the idea of “safe zones” urged upon Israel by the US government where people are still unable to move about freely. “These zones cannot be safe nor humanitarian when unilaterally declared,” she said. “What we see today,” Hastings added, “are shelters with no capacity, a health system on its knees, a lack of clean drinking water, no proper sanitation and poor nutrition for people already mentally and physically exhausted: a textbook formula for epidemics and a public health disaster.” Further complicating aid deliveries, two major roads in Gaza have been declared off-limits to UN teams and trucks, Hastings said. Hastings has her base in Jerusalem but Israel last week informed the UN that it would not renew her visa, accusing her of not being “impartial.” Reged Ahmad here, taking over from Richard Luscombe.\nUpdated at 02.37 CET\n4 Dec 2023 00.02 CET Summary It’s 1am on Tuesday in Gaza and Tel Aviv. Here is a summary of the latest developments in the Israel-Hamas conflict as it nears the two-month mark: Israel’s military expanded ground operations deeper into southern Gaza, with dozens of Israeli tanks, armoured personnel carriers and bulldozers entering the Gaza Strip near Khan Younis. Witnesses said Israeli military vehicles were on the southern section of the main north-to-south road in Gaza, “firing bullets and tank shells at cars and people trying to move through the area”. Israeli military issued fresh orders to Palestinians in about 20 areas of central Gaza to move farther south, posting maps online.\nThe White House said Hamas broke an agreement to release more women hostages, and its refusal to do so was the cause of the collapse of the week-long truce with Israel on Friday. In a briefing at the White House on Monday afternoon, US national security advisor Jake Sullivan said “it is that refusal by Hamas that has caused the end of the hostage agreement, and therefore the end of the pause in hostilities”. He it was “too soon” to judge if Israel provided enough notice, or done enough to inform Palestinian civilians where it would be safe as it moved into southern Gaza, but said the US warned Israel civilians must be protected.\nThe World Health Organization (WHO) issued a statement expressing “grave concern” about the resumption of hostilities and bombardment of southern Gaza, and warned “nowhere is safe” for civilians in Gaza. The WHO said it was appealing to Israel for protection of the health system from further attacks and degradation of its capacity, and feared a repeat of the collapse of hospitals and other essential services in the north.\nA Hamas rocket fired during the 7 October attacks struck an Israeli military base where many of the country’s nuclear-capable missiles are believed to have been stored, the New York Times said in a report. None of the missiles were struck, although the attack on the Sdot Micha base in central Israel set a fire that “approached missile storage facilities and other sensitive weaponry”, according to the newspaper’s visual analysis.\nHamas engaged in years of planning, drawing up detailed maps with the help of spies inside Israel ahead of the 7 October attack, the country’s military concluded after examining vast quantities of phones, notebooks and documents seized from gunmen on the battlefield and in Gaza. Fighters also carried guides to hostage-taking and Arabic-to-Hebrew phrasebooks, one of which included the line “put your hands up and spread your legs”. The document was included in a cache of material that was released on Monday by the Israel Defense Forces’ Amshat military intelligence unit.\nMatthew Miller, a US state department spokesperson, said Hamas continued to hold female Israeli hostages because it did not want them to reveal what they experienced in captivity. Hamas fighters committed widespread “gender-based atrocities and sexual violence” during the 7 October attacks according to Israeli police who say they have evidence of more than 1,500 incidents. “The fact [Hamas] continue to hold women hostages, the fact that they continue to hold children hostages … and the reason this pause fell apart, is they don’t want those women to be able to talk about what happened to them during their time in custody,” Miller told a media briefing.\nGaza’s health ministry issued new casualty figures, saying that 15,899 Palestinians have been killed by Israel’s military campaign in the Gaza Strip since 7 October. The ministry, which is part of the Hamas-led government in the Gaza Strip, says that 70% of those who have been killed are women and children. It does not distinguish in the figures between civilians and combatants. The number of deaths is likely under-counted, as the collapse of the health system in Gaza has made it difficult for statistics to be gathered, and there are more than 6,000 Palestinians considered missing within the territory.\nThe head of the International Committee of the Red Cross described the suffering in Gaza as “intolerable” while visiting the territory. Mirjana Spoljaric Egger said: “The level of human suffering is intolerable. It is unacceptable that civilians have no safe place to go in Gaza.”\nTelecoms company PalTel said that Gaza is facing a communications blackout , with all telecom services (landline, cellular and internet) in Gaza City and north Gaza Strip lost due to the disconnection of main elements of the network.\nIsrael ’s military has again said it has fired into Lebanon at the site of launches it claimed were directed into Israel. It said “a number of launches from Lebanon” had occurred, and that they had fallen in open areas, with no casualties as a result. Earlier on Monday it said that three soldiers had been “slightly injured” by fire from Lebanon at an Israeli military site.\nSix hostages from Thailand kidnapped and held for weeks in the Gaza Strip by Hamas arrived back in the kingdom on Monday. Israel believes that Hamas still holds about 137 people hostage in Gaza.\nAt least 60 Palestinians were arrested in the occupied West Bank overnight, Al Jazeera reported, with Israeli forces carrying out raids in the cities of Qalqilya, Jericho, Jenin and Tulkarem. At least 30 armoured vehicles were deployed in Jenin following a dawn raid, the broadcaster reported.\nUpdated at 00.10 CET\n4 Dec 2023 23.42 CET WHO: 'Nowhere is safe in Gaza' The World Health Organization (WHO) has issued a statement expressing its “grave concern” about the resumption of hostilities between Hamas and Israel in Gaza, the bombardment of southern Gaza, and warns that “nowhere is safe” for civilians. WHO appeals for protection of the health system from further attacks and degradation of its capacity\nOnce again, nowhere is safe in #Gaza.\nWHO is gravely concerned about the resumption of hostilities, including heavy bombardment in Gaza, and reiterates its appeal to Israel to… pic.twitter.com/b7EZ1gfddZ — World Health Organization (WHO) (@WHO) December 4, 2023 In its message posted to X, formerly Twitter, on Monday afternoon, the organization said it was appealing for protection of the health system from further attacks and degradation of its capacity: WHO is gravely concerned about the resumption of hostilities, including heavy bombardment in Gaza, and reiterates its appeal to Israel to take every possible measure to protect civilians and civilian infrastructure, including hospitals, as per the laws of war. We have seen what happened in northern Gaza. This cannot be the blueprint for the south. Gaza cannot afford to lose another hospital as health needs continue to soar. As more civilians in southern Gaza receive immediate evacuation orders and are forced to move, more people are being concentrated into smaller areas, while the remaining hospitals in those areas run without sufficient fuel, medicines, food, water, or protection of health workers. Read the WHO’s full statement here.", "source_domain": "www.theguardian.com", "text": null, "title": "The Israeli army says it has fired on Hezbollah in Lebanon in response to attacks on Monday - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/04/israel-hamas-war-live-updates-hundreds-palestinians-killed-israel-ground-attack-gaza-strip-news"}