{"authors": [], "date_download": "2024-02-05 15:30:57", "date_modify": "None", "date_publish": "2023-12-05 06:30:00", "description": "THANK you for publishing the photo of two injured and distressed Palestinian children on your front page today. It’s horrific and shocking, but it…", "filename": "https%3A%2F%2Fwww.heraldscotland.com%2Fopinion%2F23967648.will-leaders-wake-hideous-reality-gaza%2F%3Fref%3Drss.json", "image_url": "https://www.heraldscotland.com/resources/images/17514775/?type=og-image", "language": "en", "localpath": null, "maintext": "The US is finally waking up to what’s happening in Gaza. You report (“Israel orders more evacuations as troops pound Gaza city”, The Herald, December 4) that US Vice President Kamala Harris said at COP28: “Too many innocent Palestinians have been killed.” And US Defense Secretary Lloyd Austin said on Saturday: “If you drive Gaza’s civilians into the arms of the enemy, you replace a tactical victory with a strategic defeat.”\nWhy has it taken so long for the US government to wake up to the reality in Gaza? You published a letter from me on October 11 in which I wrote: “Israel intends a ground invasion that will destroy much of the infrastructure and reduce Gaza to rubble. That may satisfy the desire for revenge and it may reduce the risk of terrorist attacks for a few years; but it will leave a legacy of bitterness that will endure for decades and ensure there will be no peace in the Middle East in the years ahead.” It was obvious even before Israeli military action began what their intent was, so why are so many of the world’s leaders still in denial?\nAmong those in denial are Rishi Sunak and Sir Keir Starmer. Mr Sunak said he wants Israel to win; Sir Keir wants only a brief pause in the slaughter. Some leaders have shown moral leadership, among them Spanish PM Pedro Sanchez, Belgian PM De Croo and our own FM Humza Yousaf. The killing and maiming of innocent Palestinians must stop; now.\nDoug Maughan, Dunblane.\nSickened by this disaster\nBEING neither Jewish nor Arab, I have until now kept from commentating on the rights and wrongs on both sides in what is a historic and complicated conflict and which today monopolises news outlets around the globe.\nWhat has prompted this letter though is the photograph on the front of today's Herald which pictures two boys aged about six and 10 bloodied, bruised and frightened after being caught up in an Israeli airstrike.\nWorse still is the knowledge that these two innocents are only two of thousands injured and killed over the past month with many more to come in the near future.\nYes, I understand Hamas murdered more than1,000 Israeli civilians to kick-start this latest round of barbarity and that a country has the right to defend itself, but what is taking place in Gaza just now goes way beyond what is acceptable in a civilised society as demonstrated by your photograph.\nThose with influence over Israel, the USA in particular, must rein in the Israeli military excesses of indiscriminate air attacks as a humanitarian disaster is being played out before our very eyes and I for one am sickened by it.\nJames Martin, Bearsden.\n• THE harrowing front page photo of two children injured in an Israeli airstrike, crying their eyes out, left my wife and myself on the verge of tears.\nThis needs to stop.\nEric Macdonald, Paisley.\nRead more: Henry Kissinger was a war criminal. Shame on those who eulogise him\nHow can this be justified?\nHOW can any human being no matter their religion continue to watch daily, Palestinian women and children being wiped out? We are told that 70% of casualties are women and children whose only crime is being in the wrong place at the wrong time.\nHow can Israeli forces continue to say that they are targeting Hamas as houses are flattened to the ground without any consideration for human life?\nHow the news showing dead bodies, children screaming and homes destroyed does not move civilised people to tears beats me.\nNeil Stewart, Balfron.\nThis is more than vengeance\nNORMAN Ogston’s letter (December 4) demands an answer. Before the United Nations relieved Britain of the mandate the British authorities in Palestine were getting heartily sick of the Israeli terrorists not merely harassing the Palestine police but committing cowardly attacks and bloody murder. Don’t forget Irgun Zvai Leumi and the Stern Gang.\nWe were all aghast when we saw news and pictorial evidence of the vicious and uncivilised attack on the holiday resort in Israel. Most of us will understand the frustrations of the Palestinian people who have been suppressed and excluded from their homelands since 1948; however, the Hamas attack was medieval in its cruelty and can only be described a war crime.\nThe Israeli response is an even worse war crime than that perpetrated upon them. They suffered 1,400-1,500 casualties and a number of hostages taken. In bare-faced revenge they have killed more than 14,000 men women and children and laid waste to cities, towns, villages, settlements, and farms. How will the rebuilding of that major region destroyed without regard for life ever be financed?\nI believe that Benjamin Netanyahu should be arraigned before the International Court along with the leaders of Hamas as a war criminal.\nIn this war, both sides are in the wrong. I think there is a Hebrew text from the Talmud which reads: “Vengeance is Mine, saith the ord, I will repay.” Don’t you think that 10 to one is vengeance enough?\nPeter D Christie, Newton Mearns.\nBenjamin Netanyahu (Image: Getty)Let us hope goodness wins out\nWITH hostilities renewed it’s worth remembering that over countless centuries millions of Christians, Jews and Muslims travel to Jerusalem, each year, to worship at the Holy sites. This square mile is one of the most contested and fought-over patches of land on the planet, yet remains the basis of our western civilisation. In truth mankind’s endless distortion has devalued all religions, when their simple message has always been peace and love.\nHowever, now as the generational grip on religions lessens, let us hope that religious and race bigotry continues to fade and that age-old hatreds between Judaism, Christianity and Islam finally cease. With confidence in the intrinsic goodness of humanity, faith, love and charity will surely prevail.\nGrant Frazer, Newtonmore.\nRead more: More power to those who are out to stop Patrick Harvie\nWhy Yousaf is leading Starmer\nSCOTLAND’S local authorities are right to be concerned about their funding (\"Scots councils in bankruptcy alert unless more cash found\", The Herald, December 4) as the UK Government plans to cut public investment by a third. Like the rest of us, the Scottish Government’s budget has been decimated by the UK’s failed energy policies, increased prices due to Brexit and Tory failures to tackle inflation.\nAfter the UK Autumn Statement, the OBR warned that the real value of government departmental spending is being cut by £19.1 billion by 2027-28 which has implications for the Barnett consequentials.\nOn November 23 Labour’s Welsh First Minister Mark Drakeford told opposition members in the Senedd “to face the reality\" that \"there simply isn't money\" and that their budget was being cut year by year in real terms by Westminster.\nThe Labour council in Nottingham that declared bankruptcy said it is due to Tory underfunding for 13 years plus inflation due to the Liz Truss economic fiasco, but Labour in Scotland pretend these things have had no impact on council funding in Scotland.\nLabour's fiscal rule guarantees that austerity and failing public services in the UK will continue for years to come and Sir Keir Starmer’s admiration for Mrs Thatcher explains why Humza Yousaf is more popular than the Labour leader in the most recent opinion polls.\nMary Thomas, Edinburgh.\nWhat is the Greens' vision?\nI AM sure readers will support the latest crackdown on the tourist industry (\"Scottish Greens deal major blow to hospitality sector\", The Herald, December 2). Why do people have to come to Scotland when there are plenty of other countries around the world to visit? At the same time, we could relocate the Edinburgh Festivals to Manchester so the Edinburgh residents are not inconvenienced by all those extra people obstructing the pavements and filling restaurants during the summer months. As for whisky, why do we need to transport bottles of liquid all round the world when other alcoholic drinks are readily available?\nAt a time when there is too much emphasis on business and commerce, it is reassuring to know that the Scottish Greens have the vision to offer a better way to run the economy. Can we be told what it is, please?\nScott Simpson, Glasgow.", "source_domain": "www.heraldscotland.com", "text": null, "title": "When will our leaders wake up to this hideous reality in Gaza?", "title_page": null, "title_rss": null, "url": "https://www.heraldscotland.com/opinion/23967648.will-leaders-wake-hideous-reality-gaza/?ref=rss"}