{"authors": [], "date_download": "2024-02-05 15:30:59", "date_modify": "None", "date_publish": "2023-12-05 18:54:21", "description": "The Dutch government says it has allocated 2.5 billion euros to support Ukraine in 2024", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-dutch-kyiv-crimea-b2458957.html.json", "image_url": "https://static.independent.co.uk/2023/12/05/18/Russia_Ukraine_War_Netherlands_53417.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Dutch government has allocated 2.5 billion euros (nearly $2.7 billion) to support Ukraine in 2024, the country’s foreign minister announced during a visit on Tuesday. The announcement comes as the 21-month war drags into another winter and concerns grow that Kyiv's war effort may falter without continued Western support.\nForeign Minister Hanke Bruins Slot sought to assure Ukrainian authorities, telling journalists after a meeting with Ukraine's Foreign Minister Dmytro Kuleba: \"My main message to Minister Kuleba was the same as to all of you here. Be assured of our support.”\nBruins Slot said her country opened a training center for F-16s in Romania on Nov. 13 and is working with the U.S., Denmark and other countries to see that Ukraine can deploy the fighter jets as soon as possible.\n“Your security is our security,” she said.\nShe added that the meeting also touched on Ukraine’s aspiration to become a member of the European Union: “Your future is with us,” she said.\nKuleba said that while media attention has focused on conflict in the Middle East, “political attention” has not diverted from Ukraine. He said the NATO ministerial meeting last week was positive and “the overall mood in the room was that the support will continue and will even be increased.\"\n“I also do not see any decrease in support coming from partners when it comes to deliveries of weapons and ammunition. Things are happening according to the schedule,” Kuleba said.\nIn an effort to attract further support, Ukraine President Volodymyr Zelenskyy was to address U.S. senators by video later Tuesday.\nThe Biden administration wants Congress to approve the White House’s nearly $106 billion funding request for the wars in Ukraine and Israel and other security needs.\nOn the ground, meanwhile, Russian artillery struck the southern Ukrainian city of Kherson on Tuesday morning, local officials said, killing at least two people in the street.\nRegional Gov. Oleksandr Prokudin posted a video of the aftermath showing two bodies near holes in the road caused by the shelling.\nThe head of the Kherson city administration, Roman Mrochko, said a medical facility was also struck, slightly wounding four medics.\nRussian attacks on the Dnieper River port city have become routine since the Ukrainian army liberated it last year, with civilian deaths reported almost daily.\nRussian authorities said they repelled another heavy Ukrainian drone attack on Crimea, while Ukraine officials said air defenses responded to drones and missiles launched by the Kremlin’s forces.\nThe Russian Defense Ministry said air defenses destroyed 22 Ukrainian drones and intercepted 13 more over Crimea and the Sea of Azov early Tuesday. It later added that another four drones were destroyed and two were intercepted.\nRussian officials commonly say drones were destroyed when they were shot down and that they were intercepted when electronic jamming is used.\nMilitary and logistics sites in Russian-occupied Crimea, annexed by Moscow in 2014, have been a frequent target for Ukraine since the full-scale invasion in February 2022.\nLast month, Ukraine launched one of its biggest drone attacks on Crimea, according to Russian officials, though they did not mention any casualties or damage.\nUkraine’s air force, meanwhile, said it downed 10 out of 17 Shahed drones that Russia launched Monday night. Moscow’s forces also unleashed six S-300 missiles, the air force said without providing further details.\nIt was not possible to independently verify either side’s claims.\nThe U.K. defense ministry said last month that Russia could target Ukraine’s power grid again, just like last winter when Moscow aimed to break local resistance by denying civilians home heating and running water.\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Dutch government pledges 2.5 billion euros for Ukraine in 2024 as Zelenskyy to address US senators", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-dutch-kyiv-crimea-b2458957.html"}