{"authors": ["Julian Borger", "Peter Beaumont"], "date_download": "2024-02-05 15:31:01", "date_modify": "None", "date_publish": "2023-12-05 16:29:27", "description": "IDF steps up attacks in north and south and says it has raided Hamas HQ, as increase in civilian deaths reported", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F05%2Fisrael-hamas-war-idf-civilian-impact-gaza-palestine.json", "image_url": "https://i.guim.co.uk/img/media/9dd7771eb817ad526d2119424569e64d7727285d/0_377_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8d2049a037d4d45a6eab2555394113ed", "language": "en", "localpath": null, "maintext": "Israeli forces have reported the most intense day of fighting in Gaza since the ground attack began nearly six weeks ago, with offensives stepped up in northern and southern Gaza and reports of a rise in civilian deaths.\nAmid heavy combat in key urban areas, including around Khan Younis, Hamas said there would be no further return of hostages until Israel’s “aggression against Gaza stopped”.\nThe UN said “some of the heaviest shelling in Gaza so far” took place between Sunday and Monday afternoons. The Hamas-run Gaza health ministry said 349 Palestinians had been killed and 750 injured in that period.\nThe latest fighting came as the Biden administration imposed a visa ban on Israeli settlers engaged in violence against Palestinian civilians in the occupied West Bank, in one of toughest measures on Israel by the White House in recent memory.\n“The United States has consistently opposed actions that undermine stability in the West Bank, including attacks by Israeli settlers against Palestinians, and Palestinian attacks against Israelis,” the US secretary of state, Antony Blinken, said on Tuesday.\n“We have underscored to the Israeli government the need to do more to hold accountable extremist settlers who have committed violent attacks against Palestinians in the West Bank. As President Biden has repeatedly said, those attacks are unacceptable,” Blinken said in a statement.\nTuesday’s move comes just a month after Israel was granted entry into the US’s visa waiver programme, which allows its citizens visa-free entry into the US, after years of pressure from Israel to be admitted to the scheme.\nThose targeted will not be eligible for the programme, and those who hold US visas will have them revoked.\nOutside of the specific settler issue, the move comes amid evidence of Washington’s growing frustration with Israel over the death toll and destruction from its military offensive that has claimed more than 16,200 lives in Gaza since 7 October, according to Gaza’s health ministry.\nThe Israel Defense Forces (IDF) said on Tuesday they had mounted an attack into the “heart” of Jabaliya refugee camp in northern Gaza, and that paratroopers and navy commandos had raided the Hamas general security headquarters there. Heavy fighting was also reported in Shujai’iya, another Hamas stronghold in the north.\nThe IDF spokesperson Lt Col Richard Hecht said the fighting in the north had been “close-quarter and face-to-face” amid building-to-building combat.\nAt the same time, the bombing of Gaza’s second city, Khan Younis, in the south of the coastal strip, intensified before an expected ground incursion. Israeli tanks were reported to be at the entrance to the city. Armoured vehicles were reported to have taken up positions on the southern section of the main north-south highway running through Gaza and to be firing on Palestinians trying to move through the area in cars or on foot.\n“We are in the heart of Jabaliya, in the heart of Shujai’iya, and now also in the heart of Khan Younis,” the commander of the IDF southern command, Maj Gen Yaron Finkelman, said.\n“We are in the most intense day since the beginning of the ground operation – in terms of terrorists killed, the number of firefights and the use of firepower from the land and air. We intend to continue to strike and secure our accomplishments.”\nThe IDF has ordered the evacuation of a fifth of Khan Younis, an area that was home to 117,000 people before an influx of displaced people from northern Gaza arrived following the start of the current conflict in October.\n“What civilians should do to stay safe is listen to the instructions that are coming out from our Twitter accounts, from our website, and also to look at the leaflets that are landing in their areas,” Hecht told reporters on Tuesday.\nAid organisations said it was unclear where the people ordered from their homes in Khan Younis were supposed to take shelter.\n“Nowhere is safe in Gaza and there is nowhere left to go,” Lynn Hastings, the UN humanitarian coordinator for occupied Palestinian territory, said in a written statement. “The conditions required to deliver aid to the people of Gaza do not exist. If possible, an even more hellish scenario is about to unfold, one in which humanitarian operations may not be able to respond.”\nThe UN said 100 trucks carrying humanitarian supplies – including 69,000 litres of fuel – had crossed into Gaza from Egypt on Monday.\nThis was seen as a success in Washington, where the Biden administration had been seeking to persuade the Israeli government to continue to allow aid in despite the collapse of a temporary ceasefire on 1 December.\nHowever, the flow of humanitarian assistance was significantly lower than the 170 trucks a day that crossed the Rafah crossing point during the week-long humanitarian pause.\nIn the face of US requests to allow more aid supplies to cross the border, the Israeli prime minister, Benjamin Netanyahu, deferred a decision and passed the matter to his security cabinet on Tuesday.\nThe resumption of the IDF offensive has significantly reduced the capacity of aid workers to distribute supplies around Gaza, at a time when severe overcrowding in the south, combined with a lack of sanitation, threatens to accelerate the spread of disease.\nHastings said: “What we see today are shelters with no capacity, a health system on its knees, a lack of clean drinking water, no proper sanitation and poor nutrition for people already mentally and physically exhausted: a textbook formula for epidemics and a public health disaster.”\nTedros Adhanom Ghebreyesus, the director general of the World Health Organization, said the IDF had given it 24 hours to remove the supplies stockpiled in its medical warehouse in southern Gaza “as ground operations will put it beyond use”.\n“We appeal to Israel to withdraw the order, and take every possible measure to protect civilians and civilian infrastructure, including hospitals and humanitarian facilities,” Tedros said on social media.\nMirjana Spoljaric, the president of the International Committee of the Red Cross, denounced what she called a “moral failure in the face of the international community”, after visiting the European hospital in Khan Younis.\n“The things I saw there are beyond anything that anyone should be in a position to describe,” Spoljaric said in a post on social media. “What shocked me the most are the children with atrocious injuries and at the same time having lost their parents with no one looking after them.”\nThe IDF chief spokesperson, R Adm Daniel Hagari, insisted that Israeli forces had carried out “very significant, precise and intelligence-based strikes”.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel says fighting in Gaza is most intense since start of ground offensive", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/05/israel-hamas-war-idf-civilian-impact-gaza-palestine"}