{"authors": ["Hayden Vernon", "Mabel Banfield-Nwachi"], "date_download": "2024-02-05 15:31:04", "date_modify": "None", "date_publish": "2023-12-05 15:57:39", "description": "Reuters news agency says children are en route to Ukraine via Moscow, under deal brokered by Qatar", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F05%2Frussia-ukraine-war-live-zelenskiy-putin-biden-us-senators-white-house-aid-latest-updates.json", "image_url": "https://i.guim.co.uk/img/media/21c358f5b8aaeb5faaeb8e3b4370c20523cf253f/0_50_5756_3454/master/5756.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=ab34c60cafb192a69aadb206d234c3be", "language": "en", "localpath": null, "maintext": "From 5 Dec 2023 12.45 CET Six Ukrainian children to be returned from Russia through Qatari mediation Six children will be returned to Ukraine from Russia under a deal brokered by Qatar, Reuters reports. A Qatari official told the news agency of the deal on Tuesday, with a source involved in organising the returns saying they had been staying with relatives in Russia or Russian-occupied territory. The children are en route to Ukraine via Moscow, the source added. This is the second phase of a Qatar-mediated return of children, after four minors were returned in October. Negotiations on the returns had been under way since at least April 2023, a source told Reuters in July. Qatar agreed to a Ukrainian request to mediate with Russia on the return of children to their immediate families during a visit to Ukraine in July 2023 by Qatari Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani. “The process involved attaining the consent of the families ... identification of minors and verification of identification information, coordination with humanitarian organisations, as well as logistical arrangements,” a Qatari official said. Reuters said the cases appear to be different to those of Ukrainian children who Ukraine says were forcibly taken to Russia from territories occupied by Moscow, and which are the subject of an International Criminal Court case. Kyiv says about 20,000 children have been taken from Ukraine to Russia or Russian-held territory without the consent of family or guardians. It calls this a war crime that meets the UN treaty definition of genocide.\nUpdated at 13.18 CET\n5 Dec 2023 16.57 CET Closing summary Thanks for following the Russia-Ukraine war live blog today. It will be closed shortly but you can continue to follow the Guardian’s latest reporting from Ukraine here. Chris Stein will be covering Ukraine president Volodymyr Zelenskiy’s address to the US senate later today over on the US politics live blog (he is due to speak at 8pm GMT). Below is a closing summary of today’s key posts. Six children will be returned to Ukraine from Russia under a deal brokered by Qatar, according to a Qatari official. The children are en route to Ukraine via Moscow, the source said. This is the second phase of a Qatar-mediated return of children, after four minors were returned in October.\nBritish foreign secretary David Cameron has told the House of Lords that there will be no reduction in UK military support for Ukraine in 2024. The update comes after the White House yesterday warned that “it is weeks away from running out of money to support Kyiv’s defence against Russia’s invasion”.\nAt least two people were killed and one wounded after Russian forces struck the southern city of Kherson, the head of the office of the Ukrainian presidency said. Regional prosecutors opened a war crimes investigation into one of the strikes, which occurred at about 9am and killed a 48-year-old man and a woman who had not yet been identified.\nRussia claims it downed dozens of Ukrainian drones overnight. Russian air defence systems destroyed or intercepted a total of 41 Ukraine-launched drones overnight and early morning, the Russian defence ministry has said.\nUkraine’s military shot down 10 out of 17 attack drones launched overnight by Russia, Ukrainian authorities said. The governor of Ukraine’s western Lviv region, Maksym Kozytskyy, said three drones had struck an unspecified infrastructure target, causing a fire, but damage had been minimal and no casualties had been reported.\nUpdated at 17.00 CET\n5 Dec 2023 16.39 CET British foreign secretary says there will be no reduction in UK support for Ukraine in 2024 British foreign secretary David Cameron has told the House of Lords that there will be no reduction in UK military support for Ukraine next year. Cameron said the UK has so far provided humanitarian and economic support worth more than £4.7bn to Ukraine and that it will continue to provide support. Cameron said he did not have the exact figures for next year’s spending to hand, but he said support will continue at the scale it has been before, or beyond that.\n5 Dec 2023 16.34 CET Ukraine is investigating alleged corruption into arms procurement, but vowed there was no “misuse” of Western weapons pouring into the country to fight the Russian invasion, AFP reports. Kyiv has for months promised its EU allies that it is still committed to fighting corruption, even during war time. The announcement comes three months after Kyiv appointed a new defence minister, Rustem Umerov, following allegations of corruption in the army during the tenure of his predecessor. “There are several proceedings related to arms procurement,” Oleksandr Klymenko, the head of the anti-corruption prosecutor’s office, said. He said these included contracts that amount “from tens-to-hundreds of millions of euros”, but said he could not disclose details. “It is necessary to investigate and establish specific facts: whether it happened or not.” Klymenko said that authorities had not received any complaints from Western allies that have provided the country with weapons. Corruption is a major problem in Ukraine and there have been several corruption scandals in recent months, including within the defence ministry.\n5 Dec 2023 16.15 CET Lili Bayer reports that the EU is under pressure not to “appease” Viktor Orbán by unfreezing billions of euros earmarked for Hungary, as the Hungarian prime minister threatens to derail EU plans to open accession talks with Ukraine and grant Kyiv fresh aid. The Hungarian government’s moves in recent years to undermine independent institutions, as well as concerns about corruption and alleged misuse of European funds, have led Brussels to withhold over €27bn (£23bn) earmarked for Hungary. However, in a step likely to fuel frustration among rule of law advocates, the commission has signalled that it may be prepared to unfreeze up to €10bn, ostensibly due to progress made on judicial reforms … Daniel Freund, a German Green member of the European parliament and critic of the Orbán government, urged the EU on Monday not to let Hungary off the hook. “The Orbán government did not fulfil the necessary reforms,” he said. “No money must flow. If the commission decides otherwise, it is only for one reason: they’re trying to appease Orbán who went completely overboard with his veto threat.” EU must not ‘appease’ Viktor Orbán by unfreezing billions earmarked for Hungary Read more\n5 Dec 2023 15.54 CET British foreign secretary David Cameron said he discussed “Russia’s illegal invasion of Ukraine” with his Chinese counterpart, Wang Yi. In a post on X, former British PM Cameron said: “We discussed our intention to have a constructive relationship, the situation in Israel and Gaza, and Russia’s illegal invasion of Ukraine. The UK will continue to engage with China where it furthers our interests.” I spoke to China’s Foreign Minister Wang Yi today.\nWe discussed our intention to have a constructive relationship, the situation in Israel and Gaza, and Russia’s illegal invasion of Ukraine.\nThe UK will continue to engage with China where it furthers our interests. — David Cameron (@David_Cameron) December 5, 2023\n5 Dec 2023 15.41 CET Russian oil giant Lukoil has said it would consider selling its oil refinery in Bulgaria, following a Bulgarian government plan to end imports of Russian crude oil, AFP reports. Bulgaria, a country historically close to Moscow and almost entirely dependent on Russian oil and gas imports before the war, has been seeking to free itself from this dependence. The EU member was granted an exemption from the bloc’s embargo on Russian crude oil to run until the end of 2024, allowing the refinery to produce oil for the country’s own consumption, export oil products to Ukraine and to a lesser extent to Europe. Bulgaria’s new pro-European government is however planning for this to end by next March, according to a recent parliamentary proposal to be ratified in the coming weeks. The government has also imposed a 60% tax on the profits of the Russian oil company. In a statement on Tuesday, Lukoil slammed the “adoption by the Bulgarian state authorities of discriminatory laws and other unfair, biased political decisions towards the refinery.”\n5 Dec 2023 15.07 CET A growing number of Russian women are demanding the return of their husbands, sons and brothers from the frontlines of the war in Ukraine, Reuters reports. A grassroots movement has sprung in recent weeks, with women demanding the return of their loved ones from the conflict. One main outlet for the movement is the “Way Home” Telegram channel, which has 23,000 members. Since Maria Andreeva’s husband was mobilised last year and headed to Ukraine, he has been back only for two short breaks to see his wife and young daughter. His wife says this is insufficient for a soldier fighting in a conflict. “We want our men to be demobilised so that they can return home because we think that for over a year they have done everything they could have – or even more,” Andreeva, 34, told Reuters in an interview in Moscow. Petitions to bring men back have produced almost no response and Russia’s defence ministry has barely engaged with the women, Andreeva said. Protests planned by the women did not secure the authorities’ approval to go ahead. The women have been accused of being backed by Western-based dissidents and opposition parties – slurs without foundations, Andreeva said. The New York Times reported that the organisers of the “Way Home” channel published a manifesto pressing for mobilised soldiers to be sent home after a year of deployment.\n5 Dec 2023 14.53 CET Ukraine is still relying heavily on economic assistance from the west to defend itself from Russia’s invasion. After yesterday’s warning from the White House that it is “out of money and nearly out of time” to assist Ukraine, Reuters has broken down where financial aid for Ukraine is likely come from in the coming years. Ukraine’s government expects a budget deficit of about $43bn (£34bn) in 2024 and plans to cover it with domestic borrowing and financial aid from the west. US: Kyiv is seeking $8.5bn in aid to help cover its budget deficit. Joe Biden’s administration asked Congress in October for nearly $106bn to fund plans for Ukraine, Israel and US border security, but Republicans who control the House rejected the package. Volodymyr Zelenskiy is expected to address US senators by video link behind closed doors today in order to make the case for more Ukrainian funding. Europe: The European Union announced a €50bn (£43bn) multi-year support package named the Ukraine Facility that would be delivered through to 2027. Kyiv officials have said they hope to receive €18bn of support from the facility in 2024, financing that would be crucial for covering the budget gap next year, but there is still no agreement on granting the aid inside the bloc. IMF: Ukraine’s cooperation with the International Monetary Fund is important for its financial stability, Reuters reports. This year the IMF approved a new 48-month lending programme worth $15.6bn. Ukraine received $3.6 billion this year and expects another $900m in December. In 2024 the government hopes to receive $5.4bn, but each tranche is linked to a series of reform targets and economic indicators. Other packages: Ukraine also expects about $1.5bn from other international financial institutions, including the World Bank, next year. Ukraine has agreed financial support packages from Britain and Japan for 2024. It is also in talks with the governments of Canada, Norway, South Korea and others to secure other funds.\nUpdated at 14.59 CET\n5 Dec 2023 14.22 CET Anton Gerashchenko, an adviser to the minister of internal affairs in Ukraine, has shared a video purporting to show Russian children shooting at targets featuring the faces of Ukraine’s president Volodymyr Zelenskiy, US president Joe Biden and Nato secretary general Jens Stoltenberg at a festival in the Siberian city of Tomsk. The Guardian could not independently verify the video, however, Russian state-owned newspaper AiF published a story on the video here. The story said the shooting range was set up as part of patriotic festival “Peaceful Warrior of the Russian Federation”, which was held on 2 December at Tomsk Municipal Construction College. In Russia, children \"learn patriotism\" while shooting at Biden, Zelenskyy and Stoltenberg.\nA festival called \"Peaceful Warrior of the Russian Federation\" was held in the Russian city of Tomsk. At one of the locations, a shooting range was set up for children, where instead of… pic.twitter.com/c55YStNBN5 — Anton Gerashchenko (@Gerashchenko_en) December 5, 2023\nUpdated at 14.23 CET\n5 Dec 2023 13.39 CET On the six Ukrainian children who will be returned to Ukraine from Russia under Qatari mediation, Qatari minister of state for international cooperation said both countries fully cooperated. According to AFP, Lolwah Al-Khater said: [Qatar has facilitated] the reunification of six additional Ukrainian children with their families in time for the festive holidays. Both sides cooperated fully and engaged in good faith throughout the process, with Qatar serving as an intermediary. Khater said the Qatari mediation had come “in response to requests from Russia and Ukraine to identify and explore potential areas of cooperation, with the aim of establishing foundations of trust between the two sides”. Read more about the story here (11:45)\n5 Dec 2023 13.22 CET The Russian foreign minister, Sergei Lavrov, told his Iranian counterpart, Hossein Amirabdollahian, that it was important to boost efforts to overcome the impact of western sanctions on both their countries in talks on Tuesday. Lavrov was hosting Amirabdollahian ahead of a visit by the Iranian president, Ebrahim Raisi, to Russia on 7 December, Reuters reports.\n5 Dec 2023 13.05 CET Hungarian prime minister Viktor Orbán plans to meet French president Emmanuel Macron on Thursday ahead of a crucial European Union summit next week, Orban’s press chief said in a reply to Reuters questions on Tuesday. The meeting comes after Orbán yesterday demanded that a summit of European Union leaders next week avoid any decision on Ukraine’s goal of getting a green light for EU membership talks.\n5 Dec 2023 13.00 CET Here is a summary of today’s events so far It is 2pm in Kyiv and here is a summary of today’s events so far: At least two people were killed and one wounded after Russian forces struck the southern city of Kherson, the head of the office of the Ukrainian presidency said. Regional prosecutors opened a war crimes investigation into one of the strikes, which occurred at about 9am and killed a 48-year-old man and a woman who had not yet been identified.\nUkraine’s military shot down 10 out of 17 attack drones launched overnight by Russia, Ukrainian authorities said. The governor of Ukraine’s western Lviv region, Maksym Kozytskyy, said three drones had struck an unspecified infrastructure target, causing a fire, but damage had been minimal and no casualties had been reported.\nRussian air defence systems destroyed or intercepted a total of 41 Ukraine-launched drones overnight and early morning, the Russian defence ministry has said. Twenty-six of the drones were destroyed over Russian territory, and 15 were intercepted over the Sea of Azov and the Crimean peninsula, the ministry said. It did not say whether there was any damage caused by the attack or falling debris.\nSix children will be returned to Ukraine from Russia under a deal brokered by Qatar, according to a Qatari official. The children are en route to Ukraine via Moscow, the source said. This is the second phase of a Qatar-mediated return of children, after four minors were returned in October.\nVladimir Putin will make a one-day trip to both the United Arab Emirates and Saudi Arabia tomorrow, the Kremlin said. The Russian president will hold talks focusing on bilateral relations, the war between Israel and Hamas and other international issues, the Kremlin spokesperson Dmitry Peskov said.\nIran’s president, Ebrahim Raisi, will travel to Russia on Thursday along with a political and economic delegation, the Tasnim news agency reported. Moscow and Tehran have boosted security, political and economic ties since the start of the war in Ukraine in February 2022.\nTwo Finnish companies are suspected of having exported drones and other military classified products worth over €3m (£2.6m) to Russia in violation of EU sanctions, Finnish customs said. The agency said that nearly 3,500 drones are thought to have ended up in Russia as a result.\nNepal has asked Moscow not to recruit its citizens into the Russian army and immediately send back any Nepali soldiers back to the Himalayan nation, after revealing six soldiers serving Russia’s military had been killed. “The government of Nepal has requested the Russian government to immediately return their bodies and pay compensation to their families,” Nepal’s foreign ministry said late on Monday.\n5 Dec 2023 12.45 CET Six Ukrainian children to be returned from Russia through Qatari mediation Six children will be returned to Ukraine from Russia under a deal brokered by Qatar, Reuters reports. A Qatari official told the news agency of the deal on Tuesday, with a source involved in organising the returns saying they had been staying with relatives in Russia or Russian-occupied territory. The children are en route to Ukraine via Moscow, the source added. This is the second phase of a Qatar-mediated return of children, after four minors were returned in October. Negotiations on the returns had been under way since at least April 2023, a source told Reuters in July. Qatar agreed to a Ukrainian request to mediate with Russia on the return of children to their immediate families during a visit to Ukraine in July 2023 by Qatari Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani. “The process involved attaining the consent of the families ... identification of minors and verification of identification information, coordination with humanitarian organisations, as well as logistical arrangements,” a Qatari official said. Reuters said the cases appear to be different to those of Ukrainian children who Ukraine says were forcibly taken to Russia from territories occupied by Moscow, and which are the subject of an International Criminal Court case. Kyiv says about 20,000 children have been taken from Ukraine to Russia or Russian-held territory without the consent of family or guardians. It calls this a war crime that meets the UN treaty definition of genocide.\nUpdated at 13.18 CET\n5 Dec 2023 12.14 CET Today’s UK Ministry of Defence intelligence briefing focused on Russian gains in Maryinka, a small Donetsk town that has been at the frontline of the conflict between Russia and Ukraine since 2014. The MoD says that while Russia now likely controls most of the built-up area, Ukrainian forces remain in control of pockets of territory on the western edge of the town. Russia’s renewed efforts against Maryinka are part of Russia’s autumn offensive which is prioritising extending Russia’s control over the remaining parts of the Donetsk Oblast – highly likely still one of the Kremlin’s core war aims, according to the MoD. Latest Defence Intelligence update on the situation in Ukraine – 5 December 2023.\nFind out more about Defence Intelligence's use of language: https://t.co/vCciprckfn\n🇺🇦 #StandWithUkraine 🇺🇦 pic.twitter.com/091BxUQEop — Ministry of Defence 🇬🇧 (@DefenceHQ) December 5, 2023 View image in fullscreen An aerial shot from May this year shows razed buildings in Maryinka. The MoD said the majority of buildings in the town have been reduced to rubble. Photograph: Libkos/AP\n5 Dec 2023 11.57 CET Two Finnish companies are suspected of having exported drones and other military classified products worth over €3m (£2.6m) to Russia in violation of EU sanctions, AFP reports Finnish customs as saying. “There are altogether six criminal suspects, one of whom has been detained since September,” the customs agency said in a statement. It said that nearly 3,500 drones are thought to have ended up in Russia as a result. The items were approved for export to a different nation, but ultimately found their way into Russia, the authorities suspect. The customs agency said that “one individual is responsible for both of the companies under investigation”. One of the companies oversaw the purchasing of the sanctioned products and the other forwarded the goods to Russia, according to Finnish Customs. The case involves regulation offences and a defence materiel export offence, and will be taken over by a prosecutor in December.\nUpdated at 12.02 CET\n5 Dec 2023 11.37 CET AFP reports that Ukraine is now using its Leopard tanks in a defensive capacity, as its summer counter-offensive has ground to a halt. Kyiv lobbied for months this year to get the sophisticated Leopard tanks from Germany and other Western allies to push back Russian forces, but since Ukraine’s offensive petered out this summer, the tanks have instead been deployed to hold the line. A deputy of a company in the 21st mechanised brigade told AFP the Strv 122 tank – the Swedish version of the Leopard 2A5 – was now being used to hit infantry groups or ammunition depots. “In other words, it’s not being used in the same way as during the counter-offensive,” said 25-year-old Ruslan, referring to Ukraine’s push this summer to gain ground in the south. Kyiv had hoped the Leopards would penetrate Russian defences and then rumble south towards Crimea - the peninsula unilaterally annexed by the Kremlin in 2014. Instead, they are positioned along the front in the east, acting more like long-range artillery than offensive battle tanks moving deeper into Russian-held territories. Leopard-2 in Ukraine. In the wild. pic.twitter.com/mSKRIikfT7 — Defense of Ukraine (@DefenceU) May 23, 2023\nUpdated at 11.42 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war: more Ukrainian children to be returned from Russia - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/05/russia-ukraine-war-live-zelenskiy-putin-biden-us-senators-white-house-aid-latest-updates"}