{"authors": ["Laura Parnaby", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:31:05", "date_modify": "None", "date_publish": "2023-12-05 18:21:29", "description": "Investigators have so far found PCBs, chemical compounds which are recognized as 'likely carcinogens' by the Environmental Protection Agency, at Wyoming and Montana sites so far.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12828445%2FAir-Force-expands-cancer-study-nuclear-missile-sites-non-Hodgkin-lymphoma-troops.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/05/17/78608237-0-image-m-36_1701799003729.jpg", "language": "en", "localpath": null, "maintext": "The Air Force is expanding its deadly cancer study at three secret underground nuclear missile sites in the US after scores of troops were diagnosed with non-Hodgkin lymphoma.\nInvestigators have so far found PCBs, chemical compounds which are recognized as 'likely carcinogens' by the Environmental Protection Agency, inside launch control capsules at sites in Montana and Wyoming.\nThe Air Force is not making its initial findings on the cancer numbers public for another month or so, but released an initial assessment on Monday saying deeper examination was needed.\n'We´ve determined that additional study is warranted' based on preliminary analyses of the data, said Lt. Col. Keith Beam, one of several Air Force medical officers who updated reporters on the service's missile community cancer review.\nThe Air Force is expanding its deadly cancer study at three secret underground nuclear missile sites in the US after dozens of troops were diagnosed with non-Hodgkin lymphoma. (Pictured: the inside of a launch facility near Malmstrom Air Force Base in Great Falls, Montana)\nDanny Sebeck, who served at Malmstrom AFB from 2003 until 2007, was diagnosed with non-Hodgkin lymphoma and mantle cell lymphoma at the age of 42\nRyan Luecke was diagnosed with non-Hodgkin lymphoma and chronic lymphocytic leukemia in May 2020 at the age of 45\nMedical teams have been conducting thousands of tests of the air, water, soil and surface areas inside and around three nuclear missile bases: Malmstrom Air Force Base in Montana, Minot Air Force Base in North Dakota and F.E. Warren Air Force Base in Wyoming. Results from the North Dakota base are still pending.\nThe review began after at least 268 current or former soldiers who served at nuclear missile sites came forward in recent decades to report cancer diagnoses.\nThis includes at least 41 with non-Hodgkin lymphoma, a blood cancer which is extremely resistant to treatment.\nDanny Sebeck, who served at Malmstrom AFB from 2003 until 2007, was diagnosed with non-Hodgkin lymphoma and mantle cell lymphoma at the age of 42.\nHe said he noticed a lump which swelled to the size of a ping-pong ball over just 30 days in August 2022 and received the devastating diagnosis shortly afterwards in September.\nAnother missileer, Ryan Luecke was diagnosed with non-Hodgkin lymphoma and chronic lymphocytic leukemia in May 2020 at the age of 45.\nHe said he found a grape-sized lump in his neck in May 2020, and his condition rapidly deteriorated as the cancer spread to his bones and he ended up having 'no desire to do anything but rest' in his mid-forties.\n'I’m sharing my story because I don’t believe the toxic exposure from serving in LCCs is limited to Malmstrom AFB,' Luecke warned via the website of a charity supporting the troops, called the Torchlight Initiative.\n'I want to help raise awareness that exposing young men and women to these harsh chemicals at ALL missile bases has consequences,' he added.\n'I want to ensure that future missileers aren’t exposed to toxins that lead to more Cancer diagnoses.'\nJeff Fawcett Sr. served with 564th missile squadron at Malmstrom, from 1988 to 1992, and ending up passing away in 2016 of acute lymphoblastic leukemia and chronic myelomonocytic leukemia, both types of blood cancers at age 56\nJeff Fawcett Sr. (pictured) passed away in 2016 of acute lymphoblastic leukemia and chronic myelomonocytic leukemia, both types of blood cancers at age 56\nDean Shockley was a young man also enlisted at Malmstrom serving in the base's 341st maintenance group, where he worked on the missile silos from 1987 to 1989 at the same time as Fawcett Sr\nIn 2022, Shockley was diagnosed with an inoperable glioblastoma, a brain tumor at 56-years-old, according to Krem2 News\nWhile the Air Force review is looking at a broader set of cancers, the number of self-reported non-Hodgkin lymphoma is striking because the community of missile launch officers is very small.\nNationwide rates of the blood cancer are 18.7 per 100,000 people, according to the National Cancer Institute.\nFor comparison, there have only been about 21,000 who have served as missileers since the 1960s, according to the Torchlight Initiative.\nThe entire missile community population - to include maintainers to fix the warheads and security forces who patrolled the sites - is likely about 84,000, the Air Force said.\nIn a statement, the Torchlight Initiative said 'despite the air, water, and soil findings, the PCB results are concerning.\n'The missile community continues to struggle with disproportionate rates of cancer.\n'The community is in desperate need of appropriate exposure documentation so they can get the care they need.'\nMany of the missileers have already died, including Air Force Capt. Jason Jenness, who was a senior launch officer in the 1990s with a missile squadron at Malmstrom. He died from non-Hodgkin lymphoma in 2001 at the age of 31.\nJeff Fawcett Sr. also served with 564th missile squadron at Malmstrom, from 1988 to 1992, and ending up passing away in 2016 of acute lymphoblastic leukemia and chronic myelomonocytic leukemia, both types of blood cancers at age 56.\nDean Shockley was a young man also enlisted at Malmstrom serving in the base's 341st maintenance group, where he worked on the missile silos from 1987 to 1989 at the same time as Fawcett Sr.\nIn 2022, Shockley was diagnosed with an inoperable glioblastoma, a brain tumor at 56-years-old, according to Krem2 News.\nAir Force Capt. Jason Jenness was a senior missile launch officer in the 1990s with a missile squadron at Malmstrom, who died from non-Hodgkin lymphoma in 2001 at the age of 31\nThe full Air Force study will look not just at the missileers but at the whole missile community, to include all who supported the ICBM mission.\nAt a Friday briefing with reporters to discuss its findings ahead of the release, the Air Force said none of the more than 2,000 samples of air, water and soil at either the Montana or Wyoming bases came back showing harmful levels of contamination.\nHowever, four locations in the underground launch control capsules where the missileers worked had unsafe levels of PCBs. The service is still waiting on results from the North Dakota base.\nPCBs are oily or waxy substances that have been identified as a likely carcinogen by the Environmental Protection Agency.\nBut while that data may show that the air, water and soil are safe now, it still raises questions as to what earlier missile launch officers may have breathed in or been exposed to in the past.\nThe silos and underground control capsules were dug during the 1960s and much of that infrastructure hasn´t been updated since.\n'We can't go back and test to fully quantify what was there in the `90s or 2000s, or even the ´50s and '60s,' said Col. Tory Woodard, commander of the U.S. Air Force School of Aerospace Medicine.\n'But we can use this data to help us inform what those risks might have been.'\nWoodard said between the sampling and further data review, it will help the Air Force 'build a risk profile of what past members may have been exposed to.'\nTo help with that the Air Force is expanding its review of medical records to try to account for as many service members as possible.\nThe initial dataset only goes back to 2001, when DOD began using electronic medical records.\nA large cluster appear to be connected to underground launch control centers at Malmstrom Air Force Base, where hazardous, carcinogenic materials were found. Malmstrom Air Force Base in central Montana is home to a vast field of 150 Minuteman III intercontinental ballistic missile silos.\nAt least 268 soldiers who served at nuclear missile sites have self-reported being diagnosed with cancer, blood diseases or other illnesses over the past several decades, Jeff Fawcett Sr. (pictured)\nBut the group they hope to capture includes any personnel who worked with military nuclear missiles going back to 1976, and will add Department of Veterans Affairs data and state cancer registries.\n'The limitations that were discovered with this initial dataset is driving us to open the aperture to ensure that we are capturing as many cases as possible, particularly among those who previously served in missile related career fields,' the Air Force said in a statement.\nIn all, the study hopes to capture data on all missile community members who served from 1976 to 2010.\nThe Air Force response is far different this time than it has been in the past, when earlier generations of missile launch officers raised concerns about illnesses among their community.\nFor years the missileers were told in multiple Air Force reviews that there was not cause for concern.\nBut the issue received significantly more attention this year as scores of current or former officers or their surviving family members joined forces and went public with self-reported data of their cancers.\nThe heightened response in the Air Force is part of an overall sea change within the Department of Defense and Department of Veterans Affairs to look more bluntly at the issue of exposure to toxic contaminants such as exposure to radiation or harmful air particles in military occupations.\nIt often still requires a grassroots effort, whether by the Torchlight Initiative, or by Iraq and Afghanistan veterans who breathed in toxic fumes from trash-burning pits on base, or by individual pilots drawing attention to numbers of sickened aviators who all flew the same airframe, such as the Navy's E-2 Hawkeye radar plane, to drive further action on military cancer clusters.\nPerhaps the biggest difference from years past in the Air Force's missileer community is that a number of those diagnosed officers are still serving, and many of the officers leading the missile community now have ties to former missileers who have been diagnosed with or have died of cancer.\n'I personally know a number of the folks who are non-Hodgkin lymphoma survivors, so a lot of empathy and a lot of desire to understand better,' said Col. Barry Little, commander of the 341st Missile Wing at Malmstrom Air Force Base.\n'We´re leaving no stone unturned.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Air Force EXPANDS deadly cancer study at secret underground nuclear missile sites after cluster of non-Hodgkin lymphoma cases among troops and 'likely carcinogens' found on two bases", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12828445/Air-Force-expands-cancer-study-nuclear-missile-sites-non-Hodgkin-lymphoma-troops.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}