{"authors": [], "date_download": "2024-02-05 15:15:45", "date_modify": "None", "date_publish": "2024-01-25 09:43:05", "description": "Russian officials accused Kyiv of shooting down the plane, claiming that 65 Ukrainian prisoners of war were on board.", "filename": "https%3A%2F%2Fguernseypress.com%2Fnews%2Fworld-news%2F2024%2F01%2F25%2Frecorders-from-russian-plane-crash-that-killed-all-74-aboard-reportedly-found%2F.json", "image_url": "https://www.guernseypress.com/resizer/KxqtyVvB0wkF0dHGw2gUmTjO6ZI=/1200x900/cloudfront-us-east-1.images.arcpublishing.com/mna/5F7FIQT7EFCVFAHGVPVO2XBXUI.jpg", "language": "en", "localpath": null, "maintext": "Investigators searching the site where a Russian military transport plane crashed in a border region near Ukraine have reportedly found the plane’s flight recorders, a day after Moscow accused Kyiv of shooting down the aircraft and Ukraine’s president demanded an international investigation.\nThe Il-76 fell from the sky and crashed in a huge ball of flame in a rural area of Russia on Wednesday, killing all 74 people on board, Russian authorities said, as the war nears its two-year mark.\nRussian officials accused Kyiv of shooting down the plane with two missiles, claiming that 65 Ukrainian prisoners of war were on board as they headed for a prisoner swap.\nThey offered no evidence for their claim.\nSmoke rises from the scene of a warplane crash at a residential area near Yablonovo, Belgorod region (Validated UGC video via AP)\nDmytro Lubinets, Ukraine’s human rights ombudsman, said on national television on Thursday: “We haven’t seen any indication that such a large number of people was on that plane, Ukrainian citizens or not.”\nUkrainian officials noted that Moscow did not ask for any specific airspace to be kept safe for a certain length of time, as it has in past exchanges.\nWithout mentioning the crash, the General Staff of the Armed Forces of Ukraine said that the country would target any Russian military transport plane believed to be delivering missiles, especially near the border.\nThe discovery of the plane’s flight recorders was reported by the state-owned RIA Novosti news agency, citing emergency services.\nHowever, there was little hope that the true circumstances of the crash and the Russian allegations would be clarified by the investigation.\nDeadly incidents followed by claims and counterclaims are a feature of the war, used as ammunition to tarnish reputations and swing public opinion.\nThe 930-mile front line has been largely static amid a second winter of fighting and as both sides seek to replenish their weapons stockpiles, the war recently has focused on long-range strikes.\nKremlin spokesman Dmitry Peskov on Thursday repeated the allegation that Ukraine had downed the plane, describing it as “a totally monstrous act”.\nUkrainian President Volodymyr Zelensky did not directly address Moscow’s allegation but said Ukraine would push for an international investigation.\n“It is necessary to establish all the facts, as much as possible, considering that the plane crash occurred on Russian territory — beyond our control,” he said in his nightly video address late on Wednesday.\n“It’s obvious Russians are playing with the lives of Ukrainian POWs, with the feelings of their relatives and the emotions of our society,” Mr Zelensky said.\nRussia Foreign Minister Sergey Lavrov called for an emergency meeting of the UN Security Council (AP Photo/Peter K Afriyie)\nAndrei Kartapolov, head of the defense affairs committee in the lower house of the Russian parliament, said Russia would continue exchanging prisoners despite the crash.\n“We can’t abandon our boys and so we will speak to the devil himself to get them out,” he told reporters.\nMeanwhile, Ukraine’s largest oil and gas company, Naftogaz, said on Thursday that one of its data centres had come under a large-scale cyberattack that shut down the company’s web sites and call centres.\nUkraine’s national postal service, Ukrposhta, also reported a major technical failure of its IT systems. It did not specify whether the issue was caused by a cyberattack.\nUkraine’s State Service for Transport Safety also reported a technical failure of its data centre that shut down its website and other services.", "source_domain": "guernseypress.com", "text": null, "title": "Recorders from Russian plane crash that killed all 74 aboard reportedly found", "title_page": null, "title_rss": null, "url": "https://guernseypress.com/news/world-news/2024/01/25/recorders-from-russian-plane-crash-that-killed-all-74-aboard-reportedly-found/"}