{"authors": ["Dolores Chang", "Dolores Chang For Dailymail.Com"], "date_download": "2024-02-05 15:31:09", "date_modify": "None", "date_publish": "2023-12-05 22:58:39", "description": "The search team has recovered three members and located the remains of three others, while still searching for the two missing bodies, authorities said.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12829461%2FUS-Air-Force-Osprey-crash-victims.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/05/22/78616493-0-image-a-10_1701816876622.jpg", "language": "en", "localpath": null, "maintext": "The identities of eight crew members killed when a US Air Force Osprey aircraft crashed last week off southwestern Japan have been revealed.\nA search team recovered three members and located the remains of three others, while still searching for the two missing bodies, authorities said Tuesday.\n'The depth of sorrow is immeasurable,' Lt. Gen. Tony Bauernfeind, Air Force Special Operations Commander, said in a statement announcing the names of the crew.\n'The honorable service of these eight airmen to this great nation will never be forgotten, as they are now among the giants who shape our history.'\nThe crew members who lost their lives during the crash were identified as follows:\nThe identities of eight crew members killed when a US Air Force Osprey aircraft(pictured) crashed last week off southwestern Japan have been revealed\nA search team recovered three members and located the remains of three others, while still searching for the two missing bodies, authorities said Tuesday\nMaj. Jeffrey T. Hoernemann, 32, of Andover, Minnesota, was a CV-22 instructor pilot and officer in charge of training.\nMaj. Eric V. Spendlove, 36, of St. George, Utah, was a residency-trained flight surgeon and medical operations flight commander.\nMaj. Luke A. Unrath, 34, of Riverside was a CV-22 pilot and flight commander.\nCapt. Terrell K. Brayman, 32, of Pittsford, New York, was a CV-22 pilot and flight commander.\nTech. Sgt. Zachary E. Lavoy, 33, of Oviedo, Florida, was a medical operations flight chief.\nStaff Sgt. Jake M. Turnage, 25, of Kennesaw, Georgia, was a flight engineer.\nSenior Airman Brian K. Johnson, 32, of Reynoldsburg, Ohio, was a flight engineer.\nStaff Sgt. Jacob 'Jake' M. Galliher, 24, was a native of Pittsfield, Massachusetts.\nMaj. Jeffrey T. Hoernemann (left), 32, of Andover, Minnesota , was a CV-22 instructor pilot and officer in charge of training. Maj. Eric V. Spendlove (right), 36, of St. George, Utah , was a residency-trained flight surgeon and medical operations flight commander.\nMaj. Luke A. Unrath(left), 34, of Riverside was a CV-22 pilot and flight commander. Capt. Terrell K. Brayman (right), 32, of Pittsford, New York, was a CV-22 pilot and flight commander\nTech. Sgt. Zachary E. Lavoy (left), 33, of Oviedo, Florida, was a medical operations flight chief. Staff Sgt. Jake M. Turnage (right), 25, of Kennesaw, Georgia, was a flight engineer\nSenior Airman Brian K. Johnson (left), 32, of Reynoldsburg, Ohio, was a flight engineer. Staff Sgt. Jacob 'Jake' M. Galliher(right), 24, was a native of Pittsfield, Massachusetts\nAmong the eight crew members, Galliher's remains were the first to be found. He is survived by his wife Ivy and two boys, aged two years and six weeks.\n'Jacob was an incredible son, brother, husband, father and friend to so many,' his family said in a statement.\n'His short life touched and made better the lives of hundreds, if not thousands in Pittsfield, in this region and everywhere he served. Jacob lived to serve his family, his country and the people he loved,' the statement reads.\nPresident Joe Biden said he and first lady Jill Biden were heartbroken by the loss.\n'We owe them everything,' Biden said in a statement. 'Jill and I are praying for the families and friends who lost a loved one in this terrible accident.'\nThe U.S.-made Osprey is a hybrid aircraft that takes off and lands like a helicopter but can rotate its propellers forward and cruise much faster, like an airplane, during flight.\nThe $90 million CV-22 Osprey carrying eight American crew crashed last Wednesday off Yakushima island during a training mission.\n'The main priority is bringing the Airmen home and taking care of their family members. Support to, and the privacy of, the families and loved ones impacted by this incident remains AFSOC's top priority,' it said in a statement.\nOn Monday, divers from the Japanese navy and U.S. military spotted what appeared to be the front section of the Osprey, along with possibly five of the missing crew members, Japan's NHK public television and other media reported.\nJapanese navy officials declined to confirm the reports, saying they could not release details without consent from the U.S.\nA total of six coast guard ships and two helicopters were deployed as part of a rescue operation.\nThe deployment of the Osprey in Japan has been controversial, with critics saying it is prone to accidents. The US military and Japan say it is safe.\nThis is the second time in three months that an Osprey has been involved in a crash. Three Marines were killed during an exercise in northern Australia. The cause of that crash has not been made public.\nThe members of Japanese Coast Guard carry the debris which are believed to be from the crashed U.S. military Osprey aircraft\nParts believed to be pieces of wreckage from the fuselage of a US Air Force CV-22 'Osprey' transport aircraft were recovered during the search\nIn June 2022, five Marines died in a fiery crash in a remote part of California east of San Diego.\nA crash investigation report last month found that the tragedy was caused by a mechanical failure related to a clutch.\nThere had been 16 similar clutch problems with the Marine Ospreys in flight since 2012, the report found.\nIn February 2023, the Marine Corps announced that a piece of equipment believed to be the source of the problem had been replaced.\nThe Osprey, a hybrid aircraft that takes off and lands like a helicopter but during flight can tilt its propellers forward and cruise much faster like an airplane. They are used by the US Marines, US Navy and Japan Self Defense Forces.\nSince 2012, there have been six fatal crashes of Marine Ospreys resulting the deaths of 16 people.\nA majority of the 50,000 U.S. troops based in Japan under a bilateral security pact and 70 percent of U.S. military facilities are stationed in Okinawa, which accounts for only 0.6 percent of Japanese land.\nJapan has suspended all flights of its own fleet of 14 Ospreys.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "PICTURED: US Air Force Osprey crew members killed in crash off the coast of Japan - as troops recover parts of plane but two bodies missing", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12829461/US-Air-Force-Osprey-crash-victims.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}