{"authors": ["Nataliya Vasilyeva", "Tim Sigsworth", "In Jerusalem"], "date_download": "2024-02-05 15:31:10", "date_modify": "None", "date_publish": "2023-12-05 00:00:00", "description": "The Israeli army has had its “most intense day” of war in Gaza so far, commanders said, as tanks entered the southern city of Khan Younis for the first time while surrounding the strip’s largest refugee camp in the north.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F12%2F05%2Fisrael-hamas-palestine-news-latest-idf-raids-headquarters%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/12/05/TELEMMGLPICT000358952213_17018027067630_trans_NvBQzQNjv4BqA7N2CxnJWnYI3tCbVBgu9TWU-KwRaHvlaJXY1texVLQ.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "The Israeli army has had its “most intense day” of war in Gaza so far, commanders said, as tanks entered the southern city of Khan Younis for the first time while surrounding the strip’s largest refugee camp in the north.\nThe Israel Defense Force (IDF) believes Hamas leaders are holed up in Khan Younis, until recently a safe haven for civilians fleeing the fighting in the north during the first phase of the invasion.\nMeanwhile, in the battered northern Gaza City, troops encircled the refugee camp in Jabaliya and raided what the Israeli military said was Hamas’s internal security headquarters, where weapons and various equipment were found.\n“We’re in the heart of Jabaliya, in the heart of Shejaiya and starting [on Monday night], also in the heart of Khan Younis,” Maj Gen Yaron Finkelman, head of the IDF southern command, said on Tuesday.\n“We are in the most intense day since the beginning of the ground operation - in terms of terrorists killed, the number of firefights, and the use of firepower from the land and air.”\nIsrael has restarted its operations in Gaza and troops are rapidly progressing south despite calls for restraint from Western allies and increasingly dire warnings about the humanitarian conditions.\nAllies losing patience with Israel\nSigns are emerging that the US is losing patience with its ally, and it said on Tuesday it would ban extremist Jewish settlers implicated in a rash of recent attacks on Palestinians in the occupied West Bank.\nBenjamin Netanyahu, the Israeli prime minister, signalled he was willing to order his army deeper into Gaza, saying it “may not be possible” to save all the remaining hostages held by Hamas.\nThe death toll in Gaza had reached more than 15,900 by Tuesday evening, the Hamas-run health authority said, with many more missing and feared dead under the rubble.\nThe authorities warned about an impending “massacre” at the Kamal Adwan Hospital in Gaza’s north, one of only six hospitals still operational in the besieged enclave, as Israeli troops reportedly surrounded the facility.\n“Patients and those who took shelter here are gripped with fear and overwhelmed by horror,” Munir Al Bursh, head of Gaza’s health ministry, told Al Jazeera from inside the hospital.\n“The Israeli forces are attacking with the aim of forcibly removing all those displaced inside the hospital. We, the medical staff, are holding our ground. We are standing by our patients.”\nIt follows Israeli takeovers at various medical facilities, which the IDF claim are used by Hamas to hide tunnels and weapons under human shields.\nIsraeli military ‘targeting’ ambulances\nIn Deir al Balah in the south, two ambulances attending to casualties were reportedly targeted by the Israeli military.\nOn Tuesday, the Palestinian Red Crescent Society shared footage showing what it said was an Israeli tank targeting the vicinity. The ambulance was seen racing away amid thuds of explosion, and blasts were seen striking the spot where it had been parked. Israel has said in the past that ambulances are used by Hamas fighters.\nAs casualties in Khan Yunis mounted on Monday night, a convoy apparently bringing a high-profile patient was seen pulling up at a hospital in the city. The footage from the scene showed uniformed officers trying to disperse the crowds and even beating several on-lookers with sticks after an unknown man stepped out of the ambulance for treatment.\nIsraeli media outlets including Channel 14 identified the man as Nizar Awadallah, a senior Hamas official who is believed to be close to Hamas leader in Gaza Yahya Sinwar.\nMeanwhile, the United Nations warned on Tuesday that Israel’s bombing campaign makes it impossible to set up safe zones anywhere in Gaza.\nJames Elder, UNICEF’s spokesman who just returned to Egypt from Gaza, told reporters: “The so-called safe zones are not scientific, they are not rational. They are not possible, and I think the authorities are aware of this.”\nLinda Al Agha and her family fled Khan Yunis two days earlier following an IDF warning and moved to Qa’ al Qurein but the fighting was incessant even in that area, which is about a 15-minute drive from Rafah near the Egyptian border.\n“Last night was terrible. We didn’t sleep at all: 12 hours of continuing shelling and bombing,” she said. “There is no safe place to go in the Gaza Strip. Frankly, I think they [the IDF] are forcing us out to Sinai.”\nIsrael on Tuesday denied asking the World Health Organisation (WHO) to vacate its warehouse in Gaza as it was apparently about to be caught in fighting.\nThe WHO’s chief earlier said his staff received 24 hour evacuation orders for a warehouse in the south and called on Israel to withdraw it. The Israeli Defence Ministry said on Tuesday it never asked the WHO to vacate the premises.\nRichard Peeperkorn, a WHO representative in Gaza said on Tuesday “the situation is getting worse by the hour” as he lamented that the amount of aid allowed into the enclave was “way too little”.\n“We are looking at an increasing humanitarian disaster,” he said.\nIn a new report on Monday, Human Rights Watch (HRW) condemned the IDF for deliberately razing farmland, orchards and greenhouses in northern Gaza, compounding concerns of food security.\nSatellite images reviewed by HRW showed IDF bulldozers carving news roads for Israeli military vehicles across the fields and orchards as large swathes of fertile land near Beit Hanoun were ruined in the initial weeks of the offensive.\nIn Israel, the families of the hostages who still remain in Hamas captivity met with the war cabinet later on Tuesday afternoon as some of them publicly urged the government to resume talks to secure the release of their relatives.\nMr Netanyahu was quoted as saying at the meeting “currently, it’s not possible to bring them all back”.\nDanny Miran, father of Omri Miran who was kidnapped from a frontier kibbutz, told the Haaretz newspaper the meeting was a “disgrace” and that the family did not hear any solutions offered by the government to free the hostages in Gaza.\nEarlier on Tuesday, an Israeli official claimed that Hamas drugged hostages with tranquiliser pills before handing them over to the Red Cross for release during the seven-day cease-fire.\nDr Hagar Mizrahi, told the Knesset, Israel’s parliament, that the hostages were given clonazepam, which is used to help with anxiety and OCD among other mental health disorders, before they were handed over to the aid group.\nShe did not say whether the drugging had been confirmed through blood tests.\nHamas has not yet commented on the claims.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Gaza fighting 'most intense' since war began as IDF enters Khan Younis", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/12/05/israel-hamas-palestine-news-latest-idf-raids-headquarters/"}