{"authors": ["Dan Sabbagh"], "date_download": "2024-02-05 15:31:13", "date_modify": "None", "date_publish": "2023-12-04 19:02:40", "description": "Sheer scale of information seized from fighters exposes Israeli military’s failure to spot signs", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F04%2Fhamas-drew-detailed-attack-plans-for-years-with-help-of-spies-idf-says.json", "image_url": "https://i.guim.co.uk/img/media/c6b095d9fc8831e9177a0c3db846a650fe08ec00/0_248_4072_2445/master/4072.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2c4c90b293cfcaeb4ad2a87e82147379", "language": "en", "localpath": null, "maintext": "Hamas engaged in years of planning, drawing up detailed maps with the help of spies inside Israel ahead of the 7 October attack, the country’s military has concluded after examining vast quantities of phones, notebooks and documents seized from gunmen on the battlefield and in Gaza.\nFighters also carried guides to hostage-taking and Arabic-to-Hebrew phrasebooks, one of which included the line “put your hands up and spread your legs”. The document was included in a cache of material that was released on Monday by the Israel Defense Forces’ Amshat military intelligence unit.\nA senior Israeli officer said the goal of Amshat, reestablished after 7 October, was to understand “Hamas attack and defence plans”, to gain operational intelligence and to better understand its doctrine after Israel’s military was caught unawares by the Hamas raid in which 1,200 were killed and 300 taken hostage.\nThe latest disclosures underline how little Israel’s powerful security establishment understood of Hamas’s capabilities prior to the attack and the sheer amount of signs or clues that were missed or discounted.\nLast week, the New York Times reported that Israeli officials had seen a 40-page battle plan for Hamas’s eventual attack, but it was dismissed as too difficult for Hamas to carry out. Warnings from IDF spotters, mostly women, that Hamas fighters were openly exercising for an attack were also cast aside.\nAmong the documents recovered was a thorough map of an Israeli military base, arguably more detailed than would have been required by the IDF itself. Compiling such a map could only have been done using “inside knowledge” – almost certainly from a Hamas spy – an Israeli intelligence source said.\nLaptops and handwritten notebooks refer to Hamas plans to target military locations and key points in central Israel, suggesting the group or some elements of it had aspirations to penetrate dozens of miles inside the country once its fighters were ordered to breach the wall surrounding the strip.\nThe detail and sheer scale of the information found have led insiders to conclude that Hamas engaged in “years of planning” – an effort that the IDF and other Israeli intelligence agencies simply failed to take seriously as a threat. There are details of weapon stores and home-produced guides to the munitions available.\nOn 7 October, Hamas fighters carried mobile phones with Israeli sim cards and walkie-talkies so they had more than one means of communication. Among the items recovered was a radio transmitter with solar battery to maintain contact, it is understood, for an extended period of time in Israel.\nAn estimated 3,000 Hamas fighters took part in the cross-border attack, and about 1,500 were killed in the initial phase of fighting. But the Israeli military response was so sluggish that in some cases it took many hours for the army to respond, while some Hamas fighters remained at large for days.\nWhile there were signs of careful preparation by Hamas, there was also a last-minute element. Israel believes most of Hamas fighters were kept in the dark ahead of the intended attack, and only told of the plan at the last minute.\nMany of items recovered in cars used by Hamas were personal or family memorabilia. The Israeli military also recovered a map of part of Gaza, riddled with bullet holes, which revealed previously unknown Hamas military sites.\nJournalists were shown a wide range of documents and other items recovered from Hamas on Monday in addition to the handful that were publicly released. Reporters were asked not to describe the extra material too precisely – omitting information such as locations – for operational security reasons.\nOne of the documents that was made public was originally handwritten but recovered from a laptop. It details a plan to seize an IDF command post close to the Gaza border fence with two squads of soldiers, listing their weapons and roles and contains a careful hand-drawn map of the target location.\nOther documents, also made public, appear to demonstrate that Hamas saw a value in hostage-taking. One is described by the IDF as a “how to take a hostage checklist” and it recommends that detention areas are booby-trapped with explosives. It also tells fighters to “kill those who cause trouble and anyone who tries to escape”, with orders to kill to be given by the company commander.\nIt also recommends that Hamas fighters use a phrase list of Hebrew words, phonetically translated from Arabic words. Copies of lists that have been recovered, and which were published by Israel on Monday, include translations for “put your hands up and spread your legs” and “remove your clothes”.\nPhones and laptops have also yielded a welter of videos, including graphic footage of the 7 October terror attacks that Israeli officials have shown to journalists and politicians to underline the violent horror of what occurred.\n00:01:19 Bodycam footage shows Hamas fighters breaching Gaza Strip security wall on 7 October – video\nBut one video released on Monday also appears to show the relative ease with which a squad of fighters were able to blow open the Gaza wall with Israel near the Egyptian border.\nThe footage, taken from a GoPro camera carried by the fighter, follows the squad inside Israel for several hours, until the fighter is killed in a shootout at the Kerem Shalom kibbutz close to the Gaza border.", "source_domain": "www.theguardian.com", "text": null, "title": "Hamas drew detailed attack plans for years with help of spies, documents suggest", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/04/hamas-drew-detailed-attack-plans-for-years-with-help-of-spies-idf-says"}