{"authors": ["Katie Davis"], "date_download": "2024-02-05 15:31:13", "date_modify": "None", "date_publish": "2023-12-04 11:31:28", "description": "GUN-toting rebels have turned a vital shipping lane into a war zone amid a surge in attacks on passing vessels.Yemen's Iran-backed Houthi rebels have", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24938308%2Firan-red-sea-war-zone%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/12/GM_4-12_REDSEAATTACKS_COMP-1.jpg?strip=all&quality=100&w=1500&h=1000&crop=1", "language": "en", "localpath": null, "maintext": "GUN-toting rebels have turned a vital shipping lane into a war zone amid a surge in attacks on passing vessels.\nYemen's Iran-backed Houthi rebels have unleashed chaos in the Red Sea by blasting ships and patrolling waters on speedboats ready to hijack.\n6 USS Carney defeating a combination of Houthi missiles and unmanned aerial vehicles in the Red Sea in October Credit: AFP\n6 Houthi rebels are an Iran-backed militia group in Yemen Credit: Alamy\n6 In November, an Israeli-owned ship was ambushed by Iran-backed Houthi rebels who stormed the deck with guns Credit: Getty\n6\nThe Houthis control Yemen and its west coast along the Red Sea - and Iran is understood to actively arm the group.\nThey vowed to target all ships owned by Israel or flying the country's flag in the Red Sea in the wake of Hamas' horror October 7 massacre.\nThe group declared themselves part of the \"axis of resistance\" of Iran's allies and proxies and have rallied behind the Palestinians since Hamas attacked Israel.\nIn October, Houthi military spokesman Yahya Saree said in a televised statement the group had launched a \"large number\" of ballistic missiles and drones towards Israel.\nSaree insisted there would be more such attacks to come \"to help the Palestinians to victory\".\nAnd since the October 7 massacre almost two months ago, there has been a chilling spike in the number of incidents in the inlet.\nThe Houthis have launched a series of drones and missiles toward Israel in recent weeks as well as blasting ships and seizing a cargo vessel in the last month.\nShipping officials have warned commercial vessels face increasing dangers as the threat of hijacking and missile blasts loom.\nAnalysts suggest the Houthis hope to shore up waning popular support after years of civil war in Yemen between it and Saudi-backed forces.\nHouthi leader Abdulmalik al-Houthi threatened to seize shipping in a rant last month.\nHe said: \"Our eyes are open to constantly monitor and search for any Israeli ship in the Red Sea.\"\nBut the Houthi involvement stokes fears that the war in Gaza could spiral out into the wider Middle East.\nIn November, the Houthis seized a vehicle transport ship linked to Israel, the Galaxy Leader, in the Red Sea off Yemen.\nThe rebels still hold the vessel near the port city of Hodeida.\nMeanwhile, missiles landed near a US warship last week after it assisted a vessel linked to Israel that had briefly been seized by gunmen.\nIn the most recent attack on Sunday, the US Navy was forced to go to the rescue of three ships being ambushed in the Red Sea.\nA British merchant ship was among the trio Houthis fired ballistic missiles at in what was seen as a major escalation in maritime attacks in Middle Eastern waters.\nA government spokesman said: \"The United Kingdom condemns the attacks on commercial shipping in the Red Sea by Houthi militants.\n\"As we’ve previously stated, Iran has long provided military and political support to Houthi militants and it bears responsibility for the actions of its proxies and partners.\n\"These waters are vital routes for global trade and incidents like these show the importance of the Royal Navy’s presence in the region, which we announced last week would be bolstered by the additional deployment of HMS Diamond to join HMS Lancaster.\n\"The UK is committed to ensuring the safety of shipping in the region, including through our contribution to the International Maritime Security Construct (IMSC) and Combined Maritime Forces (CMF).\"\nAs the vessels were blasted in the hours-long assault, a US warship shot down three drones in self-defense.\nThe USS Carney, a Navy destroyer, detected a ballistic missile fired from Houthi-controlled areas of Yemen at the Bahamas-flagged bulk carrier Unity Explorer.\nThe missile hit near the ship, the US said. Shortly afterward, the Carney shot down a drone headed its way, although it's not clear if the destroyer was the target, Central Command said.\nAbout 30 minutes later, the Unity Explorer was hit by a missile.\nWhile responding to its distress call, the Carney shot down another incoming drone.\nCentral Command said the Unity Explorer sustained minor damage from the missile.\nTwo other commercial ships, the Panamanian-flagged bulk carriers Number 9 and Sophie II, were both struck by missiles.\nThe Number 9 reported some damage but no casualties, and the Sophie II reported no significant damage, Central Command said.\nWhile sailing to assist the Sophie II, the Carney shot down another drone heading in its direction. The drones did no damage.\nThe US now threatened to consider \" all appropriate responses\" - specifically calling out Iran after tensions have been high for years now over Tehran's rapidly advancing nuclear program.\nThe US military's Central Command said in a statement. \"These attacks represent a direct threat to international commerce and maritime security.\n\"They have jeopardised the lives of international crews representing multiple countries around the world.\n\"We also have every reason to believe that these attacks, while launched by the Houthis in Yemen, are fully enabled by Iran.\n\"The United States will consider all appropriate responses in full coordination with its international allies and partners.\"\nThe Carney, an Arleigh Burke-class guided-missile destroyer, has shot down multiple rockets the Houthis have fired toward Israel during that nation's war against Hamas in the Gaza Strip.\nIt hasn't been damaged in any of the incidents and no injuries have been reported on board.\nHouthi military spokesman Brig. Gen. Yahya Saree claimed two of Sunday's attacks, saying the first vessel was hit by a missile and the second by a drone while in the Bab el-Mandeb Strait, which links the Red Sea to the Gulf of Aden.\nSaree said: \"The Yemeni armed forces continue to prevent Israeli ships from navigating the Red Sea until the Israeli aggression against our steadfast brothers in the Gaza Strip stops.\n\"The Yemeni armed forces renew their warning to all Israeli ships or those associated with Israelis that they will become a legitimate target if they violate what is stated in this statement.\"\nSaree also identified the first vessel as the Unity Explorer, which is owned by a British firm that includes Dan David Ungar, who lives in Israel, as one of its officers.\nThe Number 9 is linked to Bernhard Schulte Shipmanagement.\nThe Sophie II's owner, Kyowa Kisen of Imabari, Japan, told The Associated Press that the ship's crew were safe and the vessel did not sustain serious damage.\nIsraeli media identified Ungar as being the son of Israeli shipping billionaire Abraham Rami Ungar.\nIran has yet to directly address the attacks.\nIran has yet to directly address the attacks. However, Iranian Foreign Minister Hossein Amirabdollahian threatened “that if the current situation continues, the region will enter a new phase” over the Israel-Hamas war.\nAmirabdollahian said: \"All parties who are after igniting a war are warned, before it’s too late stop the killing of women and children, of which a new round has started.\"\nThe US has stopped short of saying its Navy ships were targeted, but has said Houthi drones have headed toward the ships and have been shot down in self-defense.\nWashington so far has declined to directly respond to the attacks, as has Israel, whose military continues to try to describe the ships as not having links to their country.\nGlobal shipping had increasingly been targeted as the Israel-Hamas war threatens to become a wider regional conflict even as a truce briefly halted fighting and Hamas exchanged hostages for Palestinian prisoners held by Israel.\nHowever, the collapse of the truce and the resumption of punishing Israeli airstrikes on Gaza and a ground offensive there had raised the risk of more seaborne attacks.\nThe Houthis had not directly targeted the Americans for some time, further raising the stakes in the growing maritime conflict.\nIn 2016, the US launched Tomahawk cruise missiles that destroyed three coastal radar sites in Houthi-controlled territory to retaliate for missiles being fired at US Navy ships at the time.\n6 Houthi rebels landed in a chopper to attack the Galaxy Leader ship", "source_domain": "www.thesun.co.uk", "text": null, "title": "How Iran turned Red Sea into a war zone as ships now run gauntlet of missiles & machine-gun-wielding pirates reign", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24938308/iran-red-sea-war-zone/"}