{"authors": ["Robert Tait"], "date_download": "2024-02-05 15:31:14", "date_modify": "None", "date_publish": "2023-12-04 11:00:42", "description": "An inveterate grammarian, Kirby is pushing Biden’s support of Israel even as Biden makes amends with Arab Americans", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F04%2Fjohn-kirby-white-house-genocide.json", "image_url": "https://i.guim.co.uk/img/media/edf5456162641f06ff657c4e57eeb30d38d58434/0_173_3996_2398/master/3996.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ae21f65b83d00b91e2629bde6f95d76a", "language": "en", "localpath": null, "maintext": "John Kirby, the story goes, once used the military discipline that helped propel him to admiral rank in the US navy to launch a rhetorical war on behalf of the English language.\nAs the navy’s chief information officer, Kirby bluntly advised underlings in his department to kick their supposed addiction to technical jargon and “learn a second language: English”, according to a 2014 profile in Politico.\nMocking a navy description detailing what the Zumwalt-class destroyer, a missile, could “provide”, the then uniformed spokesperson fired off a semantic fusillade in a scathing essay, writing: “Warships don’t ‘provide’. They Fight. They destroy … My doctor provides. My mother provides.”\nThe urge to lecture on appropriate language resurfaced last week as the 60-year-old Kirby – now the public face of White House foreign policy in his role of communications coordinator for the National Security Council – tackled an infinitely more emotive word: genocide.\nThe term, defined in an international treaty that was adopted by the United Nations in 1948, has been used by critics to describe Israel’s military offensive in Gaza, launched in response to Hamas’s attack on 7 October, which killed than 1,200 Israelis.\nThe Israeli bombardment and ground invasion has so far killed approximately 15,000 Palestinians and displaced more than 1.7 million people, forcing them into increasingly precarious conditions. Joe Biden has voiced unequivocal support for Israel and so far has resisted calls to press the country to accept a permanent ceasefire, opting instead to focus on humanitarian pauses and sending aid to Gaza.\nNow with polls showing Biden haemorrhaging support among Arab, young and ethnic minority voters over his support for Israel in Gaza, questions are growing over whether Kirby, arguably the most visible spokesperson for Biden’s approach to the war, presents a liability for the president’s 2024 re-election bid.\nView image in fullscreen People hold a Palestinian flag reading ‘Against the genocide, support the Palestinians’ in Paris, France, on 18 November 2023. Photograph: Mohammed Badra/EPA\nChallenged at a White House briefing to confront the term “Genocide Joe” by some protesters to described Biden, Kirby, who had previously ruled out “drawing red lines” for Israel’s actions in Gaza, embarked on an animated exposition.\n“People can say what they want on the sidewalk and we respect that. That’s what the first amendment’s about,” he said. “But this word genocide’s getting thrown around in a pretty inappropriate way by lots of different folks. What Hamas wants, make no mistake about it, is genocide. They want to wipe Israel off the map.\n“And they’ve said that they’re not going to stop. What happened on the 7th of October is going to happen again and again and again. And what happened on the 7th of October? Murder; slaughter of innocent people in their homes or at a music festival. That’s genocidal intentions.\n“Yes, there are too many civilian casualties in Gaza … And yes, we continue to urge the Israelis to be as careful and cautious as possible. But Israel is not trying to wipe the Palestinian people off the map. Israel’s not trying to wipe Gaza off the map. Israel is trying to defend itself against a genocidal terrorist threat. If we’re going to start using that word – fine. Let’s use it appropriately.”\nView image in fullscreen Protesters carry a banner reading ‘All in the streets for Palestine. Stop Israel’s genocide of Palestinians’ in Copenhagen, Denmark, on 2 December 2023. Photograph: Emil Nicolai Helms/EPA\nFor left-leaning Democrats already critical of Biden’s unconditional pro-Israel stance, Kirby’s remarks embody what they see as a telling difference between the administration’s attitude towards civilians killed in Russia’s invasion of Ukraine and Palestinians killed in Israel’s military onslaught.\nWhile the response to Kirby’s past linguistic homilies were unrecorded, his latest foray provoked a significant backlash.\nWriting on X, the MSNBC commentator Mehdi Hasan pointed out that among those Kirby was accusing of using the word inappropriately were renowned Jewish Holocaust scholars.\n“ … multiple Jewish and Israeli scholars of the Holocaust have raised the issue of genocide,” Hasan tweeted. “Not sure Kirby is more of an expert than Omer Bartov or Raz Segal.”\nBartov and Segal, both Israeli citizens, each have argued cases that flatly contradict Kirby’s understanding.\nSegal, an associate professor of Holocaust and genocide studies at Stockton University in New Jersey, has accused Israel of a “quite explicit, open and unashamed” genocidal assault on Gaza. Writing in Jewish Currents days after Israel launched its military retaliation against the Hamas attack, Segal said the country was already committing three of the five acts stipulated in the UN genocide convention.\nView image in fullscreen Palestinians and Romanian supporters hold banners, one reading ‘Stop the genocide! Ceasefire now!’ in downtown Bucharest, Romania, on 18 November 2023. Photograph: Robert Ghement/EPA\nHe defined these as: “1. Killing members of the group. 2. Causing serious bodily or mental harm to members of the group. 3. Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part.”\nBartov, a professor of Holocaust and genocide studies at Brown University in Rhode Island, said multiple Israeli ministers and senior figures, including the prime minister, Benjamin Netanyahu, had made “genocidal statements” and “terrifying pronouncements” that have never been revoked. Netanyahu has repeatedly invoked the Old Testament fate of Amalek, whose followers were condemned to annihilation after attacking the ancient Hebrews during their exodus from Egypt.\nIn commentary for the Council for Global Cooperation, a version of which was published in the Guardian, Bartov singled out comments by Maj Gen Giora Eiland, a former head of the Israeli national security council. Eiland told Israel’s Yedioth Ahronoth newspaper on 10 October that “Gaza will become a place where no human being can exist” before expanding on the theme in a 19 November article for the same publication.\n“The way to win this war faster and at a lower cost to us necessitates the collapse of the systems on the other side, not the killing of more Hamas fighters,” wrote Eiland, who expanded his enemy definition to include the Gaza population whom he said cheered Hamas’s atrocities.\n“The international community warns us of a humanitarian disaster in Gaza and of severe epidemics. We must not be deterred by that … severe epidemics in the southern strip will bring victory closer and diminish the number of IDF [Israeli Defense Forces] casualties.”\nSumming up, Bartov wrote: “Israeli rhetoric and actions are preparing the ground for what may well become mass killing, ethnic cleansing and genocide, followed by annexation and settlement of the territory.”\nKirby’s embrace of an opposing interpretation comes amid reports of dissension within the White House among Biden’s own staff members, many of whom are torn over the president’s unambiguous support for Israel in the immediate aftermath of 7 October.\nView image in fullscreen People hold a banner reading ‘Genocide’ at a rally in Madrid, Spain, on 18 November 2023. Photograph: Víctor Lerena/EPA\nHis comments also echo Biden’s own rhetoric, which has invoked the historical Jewish experience of murderous antisemitism and emphasised Hamas’s assault as the deadliest day for Jews since the Holocaust. Biden has since tried to qualify his earlier public statements, meeting with Arab American and Muslim leaders and expressing regret over comments casting doubt on the Palestinian death toll.\nJames Zogby, president of the Arab American Institute and a veteran pollster, cast Kirby as part of a “group think” cabal surrounding Biden and impeding his political need to “inch back” from his initial post-7 October posture.\n“There’s been a spontaneous support for Palestine on this issue [among normally pro-Democrat voters] that’s quite unprecedented and I know there are people in the party worried about losing this level of support,” said Zogby. “I know the president is trying to inch back, but there are people around him who just don’t get it.\n“I think Kirby is a liability, period. We had a meeting with the secretary of state [Antony Blinken] a while back and Kirby was there. But the next day at his press briefing he made comments that were just not on board with the conversation that was being had. It’s almost as if he has an agenda that goes beyond the agenda that’s developing.”\nThis is not the first time Kirby’s pronouncements have put him in the political line of fire.\nIn 2014, while he was the official spokesperson for the Pentagon under the then defence secretary Chuck Hagel, he was branded “an idiot” by the late Republican senator John McCain of Arizona over his attempts to deflect criticism of the US effort to defeat the Islamic State.\nAfter being reappointed to the same role after Biden’s 2020’s election win, he was plucked to work in the White House in May last year, frequently appearing beside the administration’s official press secretary, Karine Jean-Pierre, and emerging as a key proponent of US backing for Ukraine.\nKirby’s level of behind-the-scenes influence in the corridors of power is unclear, despite the suspicion of at least one observer that he has his “own agenda”.\nIn announcing Kirby’s White House appointment last year, Biden praised his “background, knowledge and experience” and highlighted his past role as a state department spokesperson, in addition to his ex-Pentagon post, as qualifying him to deal with the “complexities” of US foreign and defence policy.\nView image in fullscreen Doctors and members of NGOs hold placards outside Egypt’s embassy in Kuala Lumpur, Malaysia, on 16 November 2023. Photograph: Fazry Ismail/EPA\nIn recent days, however, it appears that the need to change the direction of a conflict whose human costs are spiralling has been internalized by the administration, with Kirby evidently on board.\nIn a telephone conversation with Netanyahu last weekend, Biden voiced opposition to Israel switching its onslaught following the end of the recent ceasefires to southern Gaza, where an estimated 2 million people are believed to have gathered – at Israel’s demand. The president argued that Israel cannot repeat the sweeping operation it conducted in the northern part of the territory because the crowded conditions in the south creates the potential for deeper humanitarian suffering.\nIn a White House briefing on Tuesday, Kirby told reporters that the administration “does not support southern operations unless or until the Israelis can show that they have accounted for all the internally displaced people of Gaza”.\nThe White House has also made it clear to Israel that it expects increased aid levels for Gaza permitted during the pauses to be sustained even after hostilities resume – a policy that would presumably at least mitigate the darker consequences of the path mapped out by Eiland, the former Israeli national security council supremo who cited the benefits of “severe epidemics”.\nYet for many of the president’s detractors, this brings little comfort – with Kirby’s proxy role emblematic of what critics see as a sign of hypocrisy: the stark contrast between American condemnation of the killing of civilians in Russia’s invasion of Ukraine and an apparent indifference to the number of Palestinians killed at the hands of Israel’s military onslaught.\n“For me, Kirby is the mouthpiece of the American war machine and for those who have very selective outrage about the kind of civilians lives we mourn more than others,” said Usamah Andrabi, the communications director of Justice Democrats, a progressive group whose eight congressional members have vocally supported Palestinian rights.\n“Most of us don’t understand why John Kirby, Joe Biden and Jake Sullivan [the national security adviser] don’t take Israeli leaders at their word when they say they want to wipe Gaza off the face of the planet.\n“If Vladimir Putin said these things, I’m sure they would believe it.”", "source_domain": "www.theguardian.com", "text": null, "title": "How the White House’s John Kirby is taking on the word ‘genocide’", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/04/john-kirby-white-house-genocide"}