{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:31:15", "date_modify": "None", "date_publish": "2023-12-04 10:03:12", "description": "U.S. and Japanese divers have discovered wreckage and remains of crew members from a U.S. Air Force Osprey aircraft that crashed last week off southwestern Japan.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12822675%2FRemains-crew-members-wreckage-five-days-Air-Force-Osprey-crashed-sea-Japan-training-mission.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/04/10/78548641-0-image-a-16_1701684106794.jpg", "language": "en", "localpath": null, "maintext": "U.S. and Japanese divers have discovered wreckage and remains of crew members from a U.S. Air Force Osprey aircraft that crashed last week off southwestern Japan, the Air Force announced Monday.\nThe $90 million CV-22 Osprey carrying eight American crew crashed last Wednesday off Yakushima island during a training mission. The body of one victim was recovered and identified earlier, while seven others remained missing.\nFive of the crew were found inside a large part of the aircraft's fuselage.\nThe Air Force Special Operations Command said the remains were being recovered and their identities have yet to be determined.\n'The main priority is bringing the Airmen home and taking care of their family members. Support to, and the privacy of, the families and loved ones impacted by this incident remains AFSOC's top priority,' it said in a statement.\nThe U.S. military identified the one confirmed victim as Air Force Staff Sgt. Jacob Galliher, a married father-of-two from Pittsfield, Massachusetts, on Saturday.\nThe members of Japanese Coast Guard carry the debris which are believed to be from the crashed U.S. military Osprey aircraft\nU.S. military CV-22 Osprey takes off from Iwakuni base, Yamaguchi prefecture, western Japan, this crash is the latest in a string of fatal accidents involving the $90 million aircraft\nJapanese coast guard rescuers have found three people as well as debris after a US military Osprey plane crashed into the ocean close to Yakushima island\nOn Monday, divers from the Japanese navy and U.S. military spotted what appeared to be the front section of the Osprey, along with possibly five of the missing crew members, Japan's NHK public television and other media reported.\nJapanese navy officials declined to confirm the reports, saying they could not release details without consent from the U.S.\nThe U.S.-made Osprey is a hybrid aircraft that takes off and lands like a helicopter but can rotate its propellers forward and cruise much faster, like an airplane, during flight.\nA total of six coast guard ships and two helicopters were deployed as part of a rescue operation.\nThe deployment of the Osprey in Japan has been controversial, with critics saying it is prone to accidents. The US military and Japan say it is safe.\nThis is the second time in three months that an Osprey has been involved in a crash. Three Marines were killed during an exercise in northern Australia. The cause of that crash has not been made public.\nIn June 2022, five Marines died in a fiery crash in a remote part of California east of San Diego.\nA crash investigation report last month found that the tragedy was caused by a mechanical failure related to a clutch.\nThis picture shows the remains of the US military Osprey aircraft\nThis is the second fatal crash involving an Osprey aircraft in the last three months following the deaths of three Marines on board one in August\nA Japanese ship is seen hauling the empty inflatable life craft out of the water\nThere had been 16 similar clutch problems with the Marine Ospreys in flight since 2012, the report found.\nIn February 2023, the Marine Corps announced that a piece of equipment believed to be the source of the problem had been replaced.\nThe Osprey, a hybrid aircraft that takes off and lands like a helicopter but during flight can tilt its propellers forward and cruise much faster like an airplane. They are used by the US Marines, US Navy and Japan Self Defense Forces.\nSince 2012, there have been six fatal crashes of Marine Ospreys resulting the deaths of 16 people.\nA majority of the 50,000 U.S. troops based in Japan under a bilateral security pact and 70 percent of U.S. military facilities are stationed in Okinawa, which accounts for only 0.6 percent of Japanese land.\nJapan has suspended all flights of its own fleet of 14 Ospreys.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Remains of crew members and wreckage are found five days after US Air Force Osprey crashed into the sea off Japan during training mission", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12822675/Remains-crew-members-wreckage-five-days-Air-Force-Osprey-crashed-sea-Japan-training-mission.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}