{"authors": ["Christy Cooney"], "date_download": "2024-02-05 15:31:17", "date_modify": "None", "date_publish": "2023-12-04 21:00:15", "description": "Binyamin Needham was born in England but moved with his family to Israel at the age of eight", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F04%2Fbritish-national-19-killed-while-fighting-for-idf-in-gaza.json", "image_url": "https://i.guim.co.uk/img/media/b012654ed45d356c3f07e3067eec898e92f87cca/1_50_822_493/master/822.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a126faf263ec4174d10e5b78964ef7ba", "language": "en", "localpath": null, "maintext": "A 19-year-old British national has been killed while fighting for the Israel Defense Forces in Gaza.\nBinyamin Needham was one of two soldiers killed during an operation in the north of the territory on Sunday, according to a statement released by the IDF.\nNeedham, the youngest of five siblings, was born in England and emigrated with his family to Israel at the age of eight, Haaretz reported. The newspaper said he was from the town of Zichron Yaakov.\nNeedham is thought to be the second British national to have been killed serving with the IDF during or after the 7 October attacks. The first was 20-year-old Nathanel Young.\nThe IDF said Needham was killed in close combat after his unit entered a building and encountered Hamas militants.\nIt said Sgt Ben Zussman was also killed and that another two soldiers were wounded.\nNeedham’s sister, Orly, was quoted by Haaretz as saying her brother was “so proud” to be fighting with the IDF. “He had just finished basic training. He was happy to defend the country,” she said.\nAfter his death, Needham was promoted to the rank of sergeant.\nThe IDF said 75 soldiers have now been killed in operations in Gaza since 7 October, not including the personnel killed in the attacks themselves.\nFriday saw Israeli operations in Gaza resume after the end of a seven-day ceasefire during which more than 100 hostages had been released and the flow of aid into the territory had increased.\nOn Monday, civilians in about 20 areas of central Gaza were told to move further south, with maps posted online for people to access via smartphones.\nIsraeli tanks, armoured personnel carriers and bulldozers were also seen moving down the main north-to-south road in Gaza near the southern city of Khan Younis.\nThis movement came after Brig Gen Hisham Ibrahim, the commander of Israel’s armoured corps, said the goals of Israeli forces in northern Gaza had “almost been met”.\nGaza’s health ministry, which is controlled by Hamas, says more than 15,500 people, about 70% of them women and children, have so far been killed in the territory.\nSpeaking on Saturday at his first press conference since fighting resumed, the Israeli prime minister, Benjamin Netanyahu, said the war would continue “until we achieve all its aims”.\nHe added that the temporary ceasefire had allowed Israel’s soldiers to prepare for “total victory” over Hamas.", "source_domain": "www.theguardian.com", "text": null, "title": "British national, 19, killed while fighting for IDF in Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/04/british-national-19-killed-while-fighting-for-idf-in-gaza"}