{"authors": [], "date_download": "2024-02-05 15:31:17", "date_modify": "None", "date_publish": "2023-12-04 21:03:07", "description": "After three vessels were struck by missiles fired by Iranian-back Houthis in Yemen, the White House says the U.S. may establish a naval task force to escort commercial ships in the Red Sea", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-jake-sullivan-houthi-red-sea-white-house-b2458330.html.json", "image_url": "https://static.independent.co.uk/2023/12/04/21/Biden_82770.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe White House said Monday that the U.S. may establish a naval task force to escort commercial ships in the Red Sea, a day after three vessels were struck by missiles fired by Iranian-back Houthis in Yemen.\nNational security adviser Jake Sullivan said the U.S. has been in active conversations with allies about setting up the escorts though nothing is finalized, describing it as a “natural” response to that sort of incident.\nOn Sunday, ballistic missiles fired by Yemen’s Houthi rebels struck three commercial ships, while a U.S. warship shot down three drones in self-defense during an hourslong assault, the U.S. military said. It marked an escalation in a series of maritime attacks in the Mideast linked to the Israel-Hamas war.\n“We are in talks with other countries about a maritime task force of sorts involving the ships from partner nations alongside the United States in ensuring safe passage,” Sullivan told reporters. He noted similar task forces are used to protect commercial shipping elsewhere, including off the coast of Somalia.\nThe Houthi attacks imperil traffic on one of the world’s most vital shipping lanes and with it global trade overall. The U.S. Energy Information Administration says 8.8 million barrels of oil a day are shipped through the Red Sea and the narrow straits of the Bab al-Mandab within range of the Houthis, making it one of world trade’s most crucial chokepoints. The ships carry oil and natural gas from the Gulf to Europe, the United States and China.\nThe Red Sea and Bab al-Mandab are also part of a vital route for commercial shipping overall, carrying millions of tons of agricultural products and other goods to markets yearly.\nSullivan said that while the Houthis had “their finger on the trigger,\" the group's Iranian sponsors were ultimately responsible.\n“The weapons here are being supplied by Iran,” Sullivan said. “Iran, we believe, is the ultimate party responsible for this.”\nSullivan said the U.S. does not believe that all three of the ships struck by the Houthis had ties to Israel, saying, “It goes to show you the level of recklessness that the Houthis are operating.”\n—\nAP writers Jon Gambrell and Ellen Knickmeyer contributed reporting.", "source_domain": "www.independent.co.uk", "text": null, "title": "US, allies in talks on naval task force to protect shipping in Red Sea after Houthi attacks", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-jake-sullivan-houthi-red-sea-white-house-b2458330.html"}