{"authors": [], "date_download": "2024-02-05 15:15:47", "date_modify": "None", "date_publish": "2024-01-25 18:24:18", "description": "An unprecedent lawsuit accuses the president of failing to prevent genocide in Gaza. A federal judge will decide if the case can proceed, Alex Woodward reports", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fus-politics%2Fbiden-genocide-gaza-israel-court-hearing-b2484404.html.json", "image_url": "https://static.independent.co.uk/2024/01/24/22/2024-01-20T215650Z_546507207_RC2UL5AMKMF6_RTRMADP_3_ISRAEL-PALESTINIANS-USA-PROTEST.JPG?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up for the daily Inside Washington email for exclusive US coverage and analysis sent to your inbox Get our free Inside Washington email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nInside Washington email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWhile Israel faces allegations of genocide and war crimes in The Hague for its devastation of Gaza, attorneys for President Joe Biden’s administration are defending him in a federal courtroom in Oakland, California.\nA group of Palestinians and civil rights groups are suing the president for his alleged failure to prevent genocide in Gaza, citing violation of international and federal law, and are asking a judge to halt any additional military aid or diplomatic support to Israel.\nAfter several weeks of court filings between parties, the plaintiffs will have their day in court on 26 January, when attorneys with the US Department of Justice will argue in front of a federal judge for a hearing that marks the first time that a president has faced allegations of genocide in an American courthouse. The Biden administration is asking the court to dismiss the case.\nThe lawsuit, which also names defense secretary Lloyd Austin and secretary of state Antony Blinken, invokes US obligations to the Genocide Convention and the Genocide Convention Implementation Act, which was signed into law by then-president Ronald Reagan in 1988. It was ushered through Congress by a US senator from Delaware named Joe Biden.\n“I am certainly not aware of another sitting US president who has had charges of complicity in genocide brought against him in federal court, or against his senior cabinet members – a testament in and of itself to the gravity of the US’s significant role in this genocide, the crime of crimes,” Sadaf Doost, a Berth Justice fellow with the Center for Constitutional Rights, told The Independent.\nThe Center for Constitutional Rights filed the lawsuit in November on behalf of Dr Omar Al-Najjar, a physician at Nasser Medical Complex in Khan Yunis in the Gaza Strip, and Palestinian human rights groups Defense for Children International – Palestine and Al-Haq.\nDefence for Children International – Palestine is the lead plaintiff in the case.\n“Palestinian children in Gaza are undoubtedly targets as repeated Israeli military offensives destroy their homes, schools, and neighbourhoods, as Israeli forces use US-made and funded weapons to kill them and their families with impunity,” the organisation’s general director, Khaled Quzmar, said in a statement.\nPlaintiffs also include a group of Gaza residents and several US citizens with families in Gaza, all of whom have lost loved ones from Israel’s attacks or are among the tens of thousands who have been violently displaced.\n“If the legal responsibility to prevent an unfolding genocide is to mean anything – indeed, if the rule of law is to signify anything – courts must have a role and responsibility to enforce these foundational international law principles,” according to the lawsuit. “The lives of so many more people are at stake.”\nA court hearing in the case will force the Biden administration “to confront what it has gone to great lengths to deny or even recognise – and through a public, permanent record,” according to Ms Doost.\nJoe Biden meets with Benjamin Netanyahu in Israel on 13 October (AFP via Getty)\nThe lawsuit was filed roughly one month into the Israeli military’s retaliatory bombardments in Gaza after Hamas attacks on 7 October killed 1,200 people.\nThe armed conflict between Israel and Hamas-led Palestinian militant groups has been taking place in the Gaza Strip since 7 October. At the time of the complaint, Israel had killed more than 11,000 Palestinians (according to Gaza’s health ministry). Over the weeks that followed, Israel’s airstrikes and ongoing siege have killed more than 25,000 Palestinians, including more than 10,000 children, according to Gaza’s health ministry.\nThe US is “obligated, from the time it learned of the specter of genocide of the Palestinian people, to exercise its clear and considerable influence on Israel to prevent this grave crime from unfolding”, which the Biden administration enabled by supporting conditions with “unconditional military and diplomatic support”, plaintiffs allege.\n“The court must hold these United States defendants, including the President of the United States, to their obligations under the law to prevent the unfolding crime of genocide, and cease providing support for it,” the lawsuit states. “In the face of continuing death and destruction of their people, these plaintiffs and the 2.2 million Palestinians they stand for, half of whom are children, have no other choice but to seek the relief of law from this court.”\nWhite House National Security Council spokesperson John Kirby told The Independent on 23 January that the administration would not comment on the lawsuit but added that “nothing’s changed about the president’s strong view that we’ve got to continue to make sure Israel has what it needs to defend itself”.\nThe United Nations International Court of Justice is imminently expected to issue an interim ruling following South Africa’s genocide complaint against Israel.\nA ruling against Israel from the so-called World Court or International Criminal Court at The Hague “will certainly have implications for other state parties – including the US,” Ms Doost told The Independent.\nA determination from The Hague finding Israel liable for genocide “will be given serious attention by the district court, though the district court, too, has the responsibility to legally determine whether there is a genocide in Gaza and in addition to that, the US’s violation of US federal common law by aiding and abetting this genocide,” she said.\nIn January, nearly 100 global civil rights and humanitarian aid groups submitted briefs to the court in support of the plaintiffs, collecting accounts from American Palestinians trying to reach their families and navigating diplomatic hurdles to get them to safety. They are joined by health workers who are “watching the intentional destruction of the health sector in Gaza with grave concern” and journalists enduring “blackouts, appalling living conditions, and constant and imminent lethal threats from Israeli bombardment”.\nA brief from the Council for Islamic American Relations (CAIR), the nation’s largest Muslim civil rights organisation, describes a “convoluted and opaque process” for US citizens and their families to get out of Gaza that places them “in imminent threat of death or serious bodily injury”.\nFor the thousands of Palestinian Americans and Muslim and Arab Americans represented by CAIR, a court hearing in the case is “such an important moment to have their voices heard,” according to staff attorney, Brittney Rezaei, who filed a brief in support of the plaintiffs.\n“The administration is ignoring Palestinian Americans, ignoring their humanity, ignoring their needs, and treating them as less than Israelis or anyone else,” she told The Independent.\n“And we’re seeing, day to day, that Palestinians are being treated as less than,” she said. “They’re not getting any assistance evacuating from Gaza. US citizens in Gaza are not getting any help from our government, much less their family, green card holders, or others.”\nThe brief includes an account from a 27-year-old law student from Illinois who lost at least 120 of her family members in Gaza, including two young cousins who – while digging through the rubble of their destroyed home to find their family members – were killed by another Israeli strike.\nA 25-year-old man from California spent days trying to arrange for an emergency medical transport for his father, who was shot in the leg by an Israel sniper while holding a white flag, according to court documents. His father died while on the phone with him. “His last words to his son were him begging for mercy,” the brief states.\nAn account from a 31-year-old New Jersey man whose relatives were sheltering in a grocery store, describes his grandmother’s repeated attempts to cross from Gaza into Egypt, all of which were denied. At one point, Egyptian border guards “physically picked her up and moved her back to Gaza,” according to court documents.\nPalestinians demand an end to the war with Israel and call for the release of Israeli hostages held in Gaza by Hamas in Deir al Balah on 24 January (AP)\nThe Genocide Convention Implementation Act established the crime of genocide – specified in federal law as acts committed with the specific intent to destroy a national, ethnic, racial, or religious group acts – as an offence punishable up to 20 years to life imprisonment.\nThe law, codifying the Genocide Convention into US code, was sponsored by then-senator Biden and signed into law by then-president Reagan in 1988. The legislation “represents a strong and clear statement by the United States that it will punish acts of genocide with the force of law and the righteousness of justice,” he said during a signing ceremony in Chicago.\nThe law establishes criminal penalties for directly and publicly inciting an act of genocide, punishable by up to five years in prison and a fine of $500,000.\nThe 89-page lawsuit outlines a timeline of Israel’s military campaign as well as statements from Israeli officials “evidencing an intent to destroy the Palestinian people in Gaza, including using dehumanising descriptions, which is frequently associated with genocidal and persecutory campaigns.”\nPlaintiffs allege the Biden administration has failed to prevent genocide and is complicit in an ongoing genocide against the Palestinian people. The US “refused to use its considerable influence to call for an end to the bombing, cut off weapons deliveries, or take measures to end the siege on the Palestinian populations in Gaza,” according to plaintiffs.\nThe Biden administration “knowingly provided assistance with a substantial effect on the commission of Israel’s violations of international law, and specifically on the underlying acts of genocide of killing, causing serious bodily or mental harm, and inflicting conditions of life on the Palestinian population calculated to bring about its destruction,” according to the lawsuit.\nUS attorneys defending the Biden administration have asked US District Judge Jeffrey White to dismiss the case, arguing that there isn’t a private right of action for alleged violations of the Genocide Convention nor the federal statute that codified those rules into US law.\n“Plaintiffs seek to have the Court override the Executive Branch’s foreign policy and national security determinations,” attorneys for the Justice Department wrote. “But decisions about whether and how to attempt to influence foreign nations, and whether and how to provide them military assistance, financial assistance, or other support, are constitutionally committed to the political branches of the government.”\nThe government’s response to the lawsuit does not contest Israel’s actions or allegations of genocide, arguing instead that the “alleged injuries are the result of the military and other activities of an independent foreign sovereign, Israel, over which this court has no authority.”\nJustice Department attorneys also asked the judge to reject a court hearing entirely, arguing that the case’s “written record is more than sufficient” for a judge to make a decision about granting a preliminary injunction.\nThe Independent has requested additional comment from the White House.\n“Palestinians here in America are deeply connected to Gaza, whether it’s through their family or friends with their own life,” Ms Rezaei told The Independent. “We’re trying to take whatever action necessary to stop the genocide, through whatever legal recourse is possible, and hope to hold this administration accountable for what they’ve done.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Joe Biden is being taken to court for ‘complicity’ in Palestinian genocide", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-genocide-gaza-israel-court-hearing-b2484404.html"}