{"authors": ["Harriet Sherwood", "Jason Burke"], "date_download": "2024-02-05 15:31:24", "date_modify": "None", "date_publish": "2023-12-04 19:17:02", "description": "Israel orders people to evacuate areas marked on maps online, but move criticised as many in Gaza do not have internet access", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F04%2Fisrael-extends-ground-offensive-into-southern-gaza-with-mission-in-north-almost-complete.json", "image_url": "https://i.guim.co.uk/img/media/e0af2de47ef77335824c4e3d6f8082a8d26ee26e/0_342_6240_3744/master/6240.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=30887273c9a637f1f6d5f859b8bde4be", "language": "en", "localpath": null, "maintext": "Israeli tanks, armoured personnel carriers and bulldozers have entered the southern part of the Gaza Strip near Khan Younis, as an Israeli commander claimed the army had almost completed its mission in the north.\nIsraeli military vehicles were on the southern section of the main north-to-south road in Gaza, “firing bullets and tank shells at cars and people trying to move through the area”, a witness, Moaz Mohammed, told the AFP news agency.\nThe reports came soon after the Israeli military issued fresh orders to Palestinians in about 20 areas of central Gaza to move farther south, posting maps online for people to access via smartphones.\nThe move was criticised by a leading human rights organisation. Sari Bashi of Human Rights Watch, said Israel was asking people “who don’t have electricity or the internet to somehow scan a barcode to see where they’re supposed to go”.\nAt the United Nations, the secretary general, António Guterres, appealed to Israel to avoid further action that would make the already dire humanitarian situation in Gaza even worse.\n“For people ordered to evacuate, there is nowhere safe to go and very little to survive on,” said UN spokesperson Stéphane Dujarric.\nDespite the Israeli instruction, there was heavy bombing in the south of Gaza overnight and early on Monday.\n“There is continuous shelling and airstrikes. It hasn’t stopped for a minute since yesterday,” said a UN administrator who is sheltering with his family in a former vocational training centre in Khan Younis. “The ground is shaking and the sound is horrible. People are living in a continuous panic and horror and the most scary thing is the uncertainty. People don’t know what to do to save their own lives.”\nView image in fullscreen Smoke billowing after an Israeli strike in Gaza near the Israeli border. Photograph: John MacDougall/AFP/Getty Images\nMohammed Aghaalkurdi, a programme officer for the NGO Medical Aid for Palestinians, who was also in Khan Younis said: “Last night, the intensity of airstrikes made us feel we would wake up to rubble all around us. We were shocked the next morning when we learned the airstrikes were on a distant area. Fighting and airstrikes never stopped last night – fighting on the ground and bombardment by air, land, and sea. The terror this has caused is catching all of us, and I cannot comfort those around me.”\nJames Elder, a spokesperson for the UN children’s agency, Unicef, said the “worst bombardment of the war right now [is] in south Gaza”. Airstrikes were coming every 10 minutes, he said. He posted on X: “Despite what has been assured, attacks in the south of Gaza are every bit as vicious as what the north endured. Somehow, it’s getting worse for children and mothers.”\nThe Hamas-run Palestinian health ministry says about 70% of the almost 16,000 Palestinians killed in the war have been women and children.\nAghaalkurdi said: “The Israeli military meant it when they said Khan Younis would be a battlefield. Most of our friends who had escaped Gaza City with us were forced again today to escape their shelters in the south of the strip and find ‘safer’ places. Barely has any kind of aid been delivered to people, nor is there any food left in shops. We are now bartering for things like flour, salt or yeast.”\nPaul Ley, an orthopaedic surgeon at the European hospital in Khan Younis, told the BBC World Service: “It is chaotic – we can’t absorb any more patients and they keep coming. As well as patients from the north [of Gaza], we have fresh cases coming from the fighting which is sometimes very close.”\nLey, who is part of an International Committee of the Red Cross surgical team, said: “We have more than 360 people on the operating list, which is impossible to deal with. The hospital is full of displaced people who are taking refuge – we are talking 6,000 to 7,000 people in the corridors and outside the hospital.” He said anaesthetics and painkillers were in short supply.\nIsrael is under mounting diplomatic pressure to avoid civilian deaths in its military operation in Gaza. At least 50 people were killed in an airstrike that hit two schools sheltering displaced families in northern Gaza on Monday, according to the Palestinian news agency Wafa.\nAt the weekend, Kamala Harris, the US vice-president, said: “The United States is unequivocal: international humanitarian law must be respected. Too many innocent Palestinians have been killed. Frankly, the scale of civilian suffering and the images and videos coming from Gaza are devastating.”\nBut on Monday, senior US officials said it was too early to make a definitive assessment on whether Israel was taking concrete steps to ensure protections for civilians.\nMeanwhile, Brig Gen Hisham Ibrahim, the commander of Israel’s armoured corps, said ground forces were close to achieving their war mission in northern Gaza. “The goals in the northern section have almost been met,” he told Israel’s Army Radio. “We are beginning to expand the ground manoeuvre to other parts of the strip, with one goal: to topple the Hamas terrorist group.”\nThe Israel Defense Forces (IDF) said on Monday they had struck “approximately 200 Hamas terror targets”. The IDF also said its navy had “a number of Hamas terror targets, assisting with the reinforcement of ground troops. The Hamas terror targets included observation posts belonging to the Hamas naval forces and terrorist infrastructure at the Gaza harbour.”\nR Adm Daniel Hagari, the IDF’s chief spokesperson, said soldiers were coming “face to face” with Palestinian fighters. Three Israeli soldiers – a 22-year-old major general, a 19-year-old sergeant and a 36-year-old commander – were killed in battles in Gaza on Sunday. The deaths bring the number of Israeli troops killed in the conflict to 75.\nThe military operation appears to be focused in and around Khan Younis, which Israel claims is a Hamas stronghold and where its top commanders are believed to be hiding out. Hundreds of thousands of displaced Palestinians are sheltering in Khan Younis after fleeing from fighting in the north. About 1.8 million people in Gaza, or roughly 75% of the population, have been displaced, according to the UN humanitarian agency OCHA.\nSome Israeli hostages are believed to be held in and around Khan Younis. Israel has divided the area into “blocks”, indicating on social media and websites which are at risk of airstrikes. It has dropped thousands of leaflets with QR codes linking to websites.\nA map posted on X on Monday morning showed about a quarter of the city marked in yellow as territory that must be evacuated immediately. Three arrows pointed south and west, telling people to head further towards the Mediterranean and the Egyptian border.\nThe information may be difficult for some Palestinians to access. Internet connectivity in Gaza has been patchy for several weeks and some people are having difficulty charging their phones because of power shortages. It is also unclear how the information provided by the IDF of its bombing intentions would not be of assistance to Hamas leaders and operatives, who have been identified by Israel as its military target.\nPaltel, one of the main telecommunications companies in Gaza, reported on Monday that all its services had been lost in Gaza City and the north of the territory due to the resumed fighting between Israel and Hamas.\nIsraeli media reported that 21-year-old Jonathan Samerano, who has been missing since Hamas launched its assault on Israel on 7 October, is dead. Samerano had been at the Supernova music festival in southern Israel when Hamas attacked from the Gaza Strip. His parents had been told to assume he had been taken hostage and was in Gaza.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel extends ground offensive into southern Gaza, with mission in north ‘almost complete’", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/04/israel-extends-ground-offensive-into-southern-gaza-with-mission-in-north-almost-complete"}