{"authors": ["Helen Livingstone", "Maya Yang", "Martin Belam", "Tom Ambrose", "Helen Davidson"], "date_download": "2024-02-05 15:31:25", "date_modify": "None", "date_publish": "2023-12-04 02:03:12", "description": "This blog has now closed.", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F03%2Fisrael-hamas-war-live-israeli-attacks-on-gaza-continue-overnight-macron-warns-israels-plan-to-eliminate-hamas-risks-decade-of-war.json", "image_url": "https://i.guim.co.uk/img/media/062dd57c48ccfda62e30b54938c23aeec4be8220/0_114_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=6e8e54d1fc64e0c94041d03ab23d5aff", "language": "en", "localpath": null, "maintext": "From 3 Dec 2023 19.56 CET Gaza health ministry: 15,523 Palestinians killed, 41,316 wounded Over 15,500 Palestinians have been killed by Israeli strikes in the last two months, Gaza’s health ministry announced on Sunday. According to ministry spokesperson Ashraf al-Qudra, 70% of the Palestinians killed were women and children, Agence France-Presse reports. He said that 41,316 have been injured. “During the past hours, only 316 dead and 664 wounded were removed from rubble and taken to hospitals, but many others are still under the rubble,” al-Qudra added.\nUpdated at 20.07 CET\n4 Dec 2023 03.03 CET Closing summary It’s jut after 4am in Israel and Gaza and we’ll be closing the blog soon. In the meantime here’s a summary of the latest developments: Israel continued with its intense bombing campaign across the north and south of Gaza for a third day since the end of the truce with Hamas and on Sunday night said it had expanded its ground operation to all of Gaza . “The IDF [Israel Defense Forces] continues to extend its ground operation against Hamas centres in all of the Gaza Strip,” spokesperson Rear Admiral Daniel Hagari told reporters in Tel Aviv.\nThe Jabalia refugee camp in the north of Gaza was among the sites reported hit from the air as were the cities of Khan Younis and Rafah in the south of Gaza . Israeli government spokesperson, Eylon Levy, said the military had struck more than 400 targets over the weekend “including extensive aerial attacks in the Khan Younis area” and had also killed Hamas militants and destroyed their infrastructure in Beit Lahiya in the north.\nOver 15,500 Palestinians have been killed by Israeli strikes in the last two months, Gaza’s health ministry announced on Sunday. According to ministry spokesperson Ashraf al-Qudra, 70% of the Palestinians killed were women and children. He said that 41,316 had been injured.\nDuring “the past hours” 316 dead and 664 wounded were removed from the rubble and taken to hospitals , al-Qudra said, adding that “many others are still under the rubble”.\nThe UN humanitarian agency (OCHA) said that about 1.8 million people – roughly 75% of Gaza’s population – are internally displaced, up from a previous figure of 1.7 million. “However, obtaining an accurate count is challenging,” it said.\nHospitals in southern Gaza overflowed with dead and wounded, amid what Uncief spokesperson James Elder said was “the worst worst bombardment of the war right now in south Gaza” on Sunday evening . “I feel like I’m almost failing in my ability to convey the endless killing of children here,” Elder said in a video from Nasser hospital in Khan Younis.\nQatar is demanding an “immediate, comprehensive and impartial international investigation” into what its prime minister called Israeli crimes in Gaza, according to Al Jazeera. Sheikh Mohammed Bin Abdulrahman al-Thani also said Qatar would continue its efforts towards facilitating another truce and reaching a permanent ceasefire in the besieged enclave, Al Jazeera added.\nIsrael’s military (UDF) claimed to have found about 800 shafts leading to Hamas tunnels and bunkers since the IDF began its Gaza ground operation on 27 October. It said it had destroyed more than half of them.\nThe IDF also said it had killed Hamas commander Haitham Khuwajari in an airstrike . It said Khuwajari, the leader of the Shati battalion, was responsible for “numerous acts of terror” against Israel and under his command “Hamas terrorists carried out raids into Israeli territory on October 7th”.\nThe Israeli army reported 17 rocket salvos from Gaza into Israel on Sunday, adding that most were intercepted and there was only slight material damage . Israel said two of its soldiers had died in combat, the first since the week-long truce expired on Friday.\nThe prosecutor of the International Criminal Court (ICC) called on Israel to respect the international rules of war and said he was accelerating his investigation into violence by Israeli settlers against Palestinians in the occupied West Bank . In a video address following a visit to Israel and Palestine, ICC chief prosecutor Karim Khan added, “In Gaza, there is no justification for doctors to perform operations without light, for children to be operated upon without anaesthetics. Imagine the pain … I was crystal clear, that this is the time to comply with the law. If Israel doesn’t comply now, they shouldn’t complain later.”\nIsraeli settlers attacked two Palestinian villages in the occupied West Bank late on Saturday, killing one man and torching a car, Palestinian authorities said . The Palestinian ambulance service said a 38-year-old man in the town of Qarawat Bani Hassan, in the northern West Bank, was shot in the chest and died as residents confronted settlers and Israeli soldiers.\nLebanon’s militant Hezbollah group said it had struck Israeli positions near the Lebanon-Israel border . Eight soldiers and three civilians were wounded by Hezbollah fire in the area of Beit Hillel, Israeli army radio reported. The IDF said its artillery struck sources of fire from Lebanon and its fighter jets struck other Hezbollah targets.\nA US air strike killed five Iraqi militants near the northern city of Kirkuk as they prepared to launch explosive projectiles at US forces in the country, three Iraqi security sources told Reuters , identifying them as members of an Iran-backed militia. A US military official confirmed a “self-defense strike on an imminent threat” that targeted a drone staging site near Kirkuk on Sunday afternoon.\nThree commercial vessels came under attack in international waters in the southern Red Sea, the US military said Sunday, as Yemen’s Houthi group claimed drone and missile attacks on two Israeli vessels in the area. The USS Carney, an American destroyer, responded to distress calls and provided assistance following missile and drone launches from Houthi-controlled territory, according to US Central Command.\n4 Dec 2023 02.11 CET James Elder, a spokesman for the UN’s children’s agency Unicef, has posted several tweets from Gaza, including this video inside Nasser hospital in Khan Younis in the southern Gaza Strip. Israel had told Palestinians to flee to Khan Younis for safety in the early weeks of the war, but has now told them to flee to specific smaller areas as it intensifies its campaign in the south. Elder says: I feel like I am running out of ways to describe the horrors hitting children here. I feel like I’m almost failing in my ability to convey the endless killing of children here. Another intense evening of attacks here in Khan Younis, in #Gaza pic.twitter.com/682rHFai4l — James Elder (@1james_elder) December 3, 2023\n4 Dec 2023 01.41 CET Hamas commander Haitham Khuwajari has been killed in an Israeli airstrike, the Israeli military (IDF) has said in a statement on Telegram. The IDF said that he was the leader of Hamas’ Shati battalion and that under his command “Hamas terrorists carried out raids into Israeli territory on October 7th” and that Khuwajari had also “secured Hamas terrorist activity in the Shifa hospital”. Khuwajari was responsible for “numerous acts of terror” against Israel and was in command of Hamas forces fighting Israel in the Shati refugee camp in northern Gaza. Israeli troops raided al-Shifa, the largest hospital in the Gaza Strip, last month, drawing international condemnation.\n4 Dec 2023 01.23 CET A bit more from the US military statement on the Houthi attacks on ships in the Red Sea, which says that the US has “every reason to believe that these attacks … are fully enabled by Iran”. It continued: The United States will consider all appropriate responses in full coordination with its international allies and partners.\n4 Dec 2023 01.08 CET As Israel continues to bomb Gaza, killing hundreds of people, Associated Press has spoken to Palestinians whose lives have been devastated: The news wire reports: Outside a Gaza City hospital, a dust-covered boy named Saaed Khalid Shehta dropped to his knees beside the bloodied body of his little brother Mohammad, one of several bodies laid out after people said their street was hit by airstrikes. He kissed him. “You bury me with him!” the boy cried. A health worker at Al-Ahli Baptist Hospital said more than 15 children were killed. Israel’s military said its fighter jets and helicopters struck targets in Gaza including “tunnel shafts, command centers and weapons storage facilities.” It acknowledged “extensive aerial attacks in the Khan Younis area.” The bodies of 31 people killed in the bombardment of central Gaza were taken to the Al-Aqsa hospital in Deir al-Balah, said Omar al-Darawi, a hospital administrative employee. One woman wept, cradling a child’s body. Another carried the body of a baby. Later, hospital workers reported 11 more dead after another airstrike. Bloodied survivors included a child carried in on a mattress. Outside a hospital morgue in Khan Younis, resident Samy al-Najeila carried the body of a child. He said his sons had been preparing to evacuate their home, “but the occupation didn’t give us any time. The three-floor building was destroyed completely, the whole block was totally destroyed.” He said six of the bodies were his relatives. “Five people are still under the rubble,” he said. “God help us.” View image in fullscreen An injured child is taken to Nasser hospital after an Israeli attack on the city of Khan Younis. Photograph: Habboub Ramez/ABACA/Shutterstock\nUpdated at 01.14 CET\n3 Dec 2023 00.43 CET Four attacks on three separate ships in Red Sea on Sunday, US military says An update on attacks against ships in the Red Sea, where the US military has said in its latest statement that there were four attacks against three separate commercial ships on Sunday. The ships were connected to 14 different countries and the US destroyer USS Carney responded to distress calls from the ships, US Central Command said in a statement on X, formerly Twitter. The Unity Explorer was targeted by a ballistic missile launched from a Houthi-controlled area of Yemen which landed “in the vicinity of the vessel” at around 9.15 am, the US said. Three hours later it was targeted again and this time was struck. The statement continued: CARNEY responded to the distress call. While assisting with the damage assessment, CARNEY detected another inbound UAV, destroying the drone with no damage or injuries on the CARNEY or UNITY EXPLORER. UNITY EXPLORER reports minor damage from the missile strike. Hours after that attack, at around 3.30pm, another ship, the Number 9, was also struck by a missile launched from a Houthi-controlled area of Yemen. The bulk carrier reported damage but no casualties. An hour later, a third ship, the Sophie II, sent a distress call saying they had been struck by a missile, Central Command said. CARNEY again responded to the distress call and reported no significant damage. While en route to render support, CARNEY shot down a UAV headed in its direction. The Carney had also shot down a drone at around midday, the US military said, adding: “The drone was headed toward CARNEY although its specific target is not clear.” Today, there were four attacks against three separate commercial vessels operating in international waters in the southern Red Sea. These three vessels are connected to 14 separate nations. The Arleigh-Burke Class destroyer USS CARNEY responded to the distress calls from the… — U.S. Central Command (@CENTCOM) December 3, 2023\n3 Dec 2023 00.12 CET A US air strike has killed five Iraqi militants near the northern city of Kirkuk as they prepared to launch explosive projectiles at US forces in the country, three Iraqi security sources have told Reuters, identifying them as members of an Iran-backed militia. The news wire reports: A US military official confirmed a “self-defense strike on an imminent threat” that targeted a drone staging site near Kirkuk on Sunday afternoon. A statement by the Islamic Resistance in Iraq, an umbrella group representing several Iraqi armed factions with close ties to Tehran, said five of its members had been killed, and vowed retaliation against US forces. The group had claimed several attacks against US forces throughout Sunday. Earlier Sunday, the US military official said US and international forces were attacked with multiple rockets at the Rumalyn Landing Zone in northeastern Syria, but there were no casualties or damage to infrastructure. Iraqi armed groups have claimed more than 70 such attacks against US forces since 17 October over Washington’s backing of Israel in its bombardment of Gaza. The attacks paused during the recent Israel-Hamas ceasefire but have since resumed. This is Helen Livingstone taking over from my colleague Maya Yang.\n3 Dec 2023 23.21 CET Paramedics from the Palestine Red Crescent Society are communicating with their families via radios amid frequent communication outages conducted by Israel, the PRCS revealed on Sunday: The video highlights the challenges faced by PRCS paramedics in Jabalia, working tirelessly around the clock, separated from their families with communication interruptions, wireless devices become their only means to connect with their children.💔\nA salute to the humanitarian… pic.twitter.com/dPKplFOlCc — PRCS (@PalestineRCS) December 3, 2023\n3 Dec 2023 22.55 CET Qatar’s prime minister and its foreign minister received a phone call from the US secretary of state on Sunday, in which they discussed “means of de-escalation and ceasefire” in the ongoing war between Israel and Hamas. A statement released by the Qatari foreign ministry on Sunday said: HE prime minister and miniser of foreign affairs Sheikh Mohammed bin Abdulrahman bin Jassim Al-Thani received on Sunday a phone call from HE secretary of state of the United States of America Antony Blinken. During the call, they discussed the latest developments in the Gaza strip and the occupied Palestinian territories, means of de-escalation and ceasefire. His Excellency confirmed that the state of Qatar is committed, with its mediation partners, to continue the efforts for the return of calm, stressing that the continued bombing of the Gaza strip after the end of the pause complicates mediation efforts and exacerbates the humanitarian catastrophe in the strip. Prime Minister and Minister of Foreign Affairs Receives Phone Call from US Secretary of State#MOFAQatar pic.twitter.com/zgnnO7sMEI — Ministry of Foreign Affairs - Qatar (@MofaQatar_EN) December 3, 2023\nUpdated at 22.58 CET\n3 Dec 2023 22.34 CET Israeli forces fired upon two ambulances in the Faluja area of the north of Gaza, injuring two paramedics and an accompanying injured person on Sunday, the Palestine Red Crescent Society said. 🚨Urgent: Two PRCS paramedics and an accompanying injured person were wounded as IOF fired upon two ambulances 🚑 in the Faluja area, north of the #Gaza Strip, while transporting an injured individual.#Gaza#NotATarget pic.twitter.com/pEqhOxFkX8 — PRCS (@PalestineRCS) December 3, 2023\nUpdated at 22.36 CET\n3 Dec 2023 22.11 CET The Israeli bombardment of southern Gaza is the “worst bombardment of the war right now”, Unicef spokesperson James Elder said on Sunday. “I am seeing massive casualties. We have a final warning to save children; and our collective conscience,” he added. pic.twitter.com/7Gz9cnR2OQ — James Elder (@1james_elder) December 3, 2023\nUpdated at 22.14 CET\n3 Dec 2023 21.46 CET A US warship has shot down at least two drones in the Red Sea, according to a US defense official speaking to the Washington Post. Initial assessments reportedly indicated that at least one of the drones came from a Houthi-controlled area in Yemen. According to the official, the Unity Explorer commercial vessel sent a distress call to the USS Carney. While the USS Carney was near the Unity Explorer, a drone approached the two ships and the USS Carney shot it down, Washington Post reports the official saying. Earlier today, Yemen’s Houthi rebels claimed drone and missile attacks on two Israeli vessels in the Red Sea. However, Israel Defense Forces spokesperson Daniel Hagari said that the two ships had no connection to Israel.\nUpdated at 22.01 CET", "source_domain": "www.theguardian.com", "text": null, "title": "IDF claims to have found 800 tunnel shafts - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/03/israel-hamas-war-live-israeli-attacks-on-gaza-continue-overnight-macron-warns-israels-plan-to-eliminate-hamas-risks-decade-of-war"}