{"authors": [], "date_download": "2024-02-05 15:31:27", "date_modify": "None", "date_publish": "2023-12-04 04:47:16", "description": "French Foreign Minister Catherine Colonna says she is open to any resettlement request from tiny South Pacific nations threatened by rising sea levels, similar to Australia’s agreement with Tuvalu", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Faustralia-ap-tuvalu-south-pacific-french-b2457838.html.json", "image_url": "https://static.independent.co.uk/2023/12/04/04/Australia_France_52606.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFrench Foreign Minister Catherine Colonna said on Monday she was open to any resettlement request from tiny South Pacific nations threatened by rising sea levels, similar to Australia’s agreement with Tuvalu.\nColonna said France had watched with “great interest” last month when Australia offered Tuvalu a lifeline to help residents escape the rising seas and increased storms brought by climate change.\nAt a meeting of Pacific leaders in the Cook Islands, Australian Prime Minister Anthony Albanese announced a plan that will initially allow up to 280 Tuvaluans to come to Australia each year. Tuvalu has a population of 11,000, and its low-lying atolls make it particularly vulnerable to global warming.\nColonna said she was not sure if the French Pacific territories of French Polynesia and New Caledonia had the capacity to make similar offers.\n“I’m open to consider any specific request,” Colonna told the National Press Club.\n“But ... the size of the Australian continent makes a big difference with the size and beauties of French Polynesia and New Caledonia,” she added.\nColonna said the Australian deal initiated by Tuvalu was one way to address some of the challenges posed by climate change.\n“I’d rather see climate change being controlled and mastered,” Colonna said.\n“Preemptive action maybe is better than taking some corrective measures when it is late,” she added.\nShe said she did not know the details of the Australia-Tuvalu treaty but was confident it respected basic principles of international law.\nThe treaty commits Australia to assist Tuvalu in response to major natural disasters, health pandemics and military aggression, Albanese said in a statement.\nIt also gives Australia veto power over any security or defense-related agreement Tuvalu wants to make with any other country such as China.\nTuvalu Prime Minister Kausea Natano said the new arrangement with Australia respected both nations’ sovereignty and committed each country to supporting the other through such challenges as climate change.\nColonna spoke to the media ahead of a meeting at Parliament House with Australian Foreign Minister Penny Wong aimed at increasing the two countries’ cooperation in the region.\nDefense Minister Richard Marles flies to New Caledonia this week to meet French Armed Forces Minister Sebastien Lecornu and their South Pacific counterparts.\nFrance and Australia's relations have improved with the election of Albanese's government last year after a previous administration angered Paris in 2021 by canceling a 90 billion Australian dollar ($66 billion) contract for a fleet of French-built submarines.", "source_domain": "www.independent.co.uk", "text": null, "title": "French foreign minister says she is open to South Pacific resettlement requests due to rising seas", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/australia-ap-tuvalu-south-pacific-french-b2457838.html"}