{"authors": ["Sophie Mann", "Sophie Mann For Dailymail.Com"], "date_download": "2024-02-05 15:31:27", "date_modify": "None", "date_publish": "2023-12-04 05:43:49", "description": "Senator Lindsey Graham slams Secretary Lloyd Austin for taking aim at Israeli military leadership as the IDF continues to battle Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12821867%2FLindsey-Graham-Lloyd-Austin-Israel-Gaza-Hamas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/04/05/78540725-0-image-m-16_1701668102493.jpg", "language": "en", "localpath": null, "maintext": "GOP Senator Lindsey Graham said he has 'lost all confidence' in US Defense Secretary Lloyd Austin after he warned Israel faces a 'strategic defeat' if it cannot contain civilian casualties in Gaza.\nDuring a Sunday morning appearance on CNN's State of the Union with Dana Bash, Graham countered that 'strategic failure' from Israel would be 'letting Hamas stand.'\nHe made the comment in response to a question about Secretary Austin's recent claim that Israel's continued killing of civilians in Gaza as it seeks to eradicate Hamas would yield a 'tactical victory' at the expense of a 'strategic' one.\n'He's so naïve. I've just lost all confidence in this guy,' said Graham, slightly exasperated.\n'Secretary Austin is telling Israel things that are impossible to achieve,' he said, asking what strategy the head of DoD would suggest implementing in order to eradicate Hamas.\n'If you've got a better idea of how to defeat Hamas, pass it on, but quit criticizing Israel in public,' he continued.\nSenator Lindsey Graham said the DoD leader should stop openly criticizing Israel's military tactics\n'Strategic defeat would be inflaming the Palestinians? They’re already inflamed. They’re taught from the time they’re born to hate the Jews and to kill them.'\nGraham called the civilian population of Gaza 'radicalized' and cited the way Israeli hostages were treated by Palestinian civilians as evidence.\nOn Saturday, during a speech at the Reagan National Defense Forum in Simi Valley, California, Austin said that the 'civilian population' of Gaza is the 'center of gravity' in the ongoing fight between the two sides.\n'And if you drive them into the arms of the enemy, you replace a tactical victory with a strategic defeat,' he said.\nHamas leaders say the number of casualties in Gaza since October 7 has reached more than 15,000, most of whom they say were women and children.\n'The reason so many Palestinians are dying, I think, is because Hamas wants them to die,' Graham said when Bash gestured to the number of dead Palestinians.\n'No Republican,' he said, 'is telling Israel to change their military tactics,' because it's not clear how they would change them and still accomplish the goal of defeating Hamas.\nLate last week, Israel said it would continue its military operation in Gaza following a ceasefire that lasted several days while a number of the roughly 240 Israeli hostages were exchanged for three times the number of Palestinian terrorists.\nHamas ultimately broke the ceasefire and decided not to pursue a pause in fighting in order to release more hostages at this time.\nOn Saturday, Defense Secretary Lloyd Austin said Israel was sacrificing a strategic victory for a tactical one because of the rising number of dead Palestinians\nHamas authorities claim more than 15,000 Palestinians have died since they started the war on October 7\nSome injured Palestinians are seen at the Al-Shifa Hospital which houses thousands of injured and displaced people\nAfter a temporary ceasefire that Hamas broke last week, Israel announced its military operation in Gaza has resumed\nGraham, a longtime foreign policy wonk, said he thinks the way to continue pushing for more freed hostages, several of whom are believed to be American citizens, is to put pressure on Iran.\n'Hamas doesn't exist without Iranian help,' he said.\nOver the weekend, Israeli forces continued to bomb swathes of Gazan territory, killing and wounding dozens of Palestinians.\nFor weeks, Israel has warned civilians in Gaza to move south in the enclave as their battles against Hamas raged in the north, and it continued to be labelled as a safer option despite continuous Israeli bombing of Khan Younis and other areas.\nNow, the IDF has declared that they are fighting 'strongly and thoroughly' in the south, with warnings to displaced civilians to evacuate even further south away from the fighting.\nChief of General Staff Herzi Halevi said on Sunday: 'Yesterday, and today, we eliminated brigade commanders, company commanders, many operatives, and yesterday morning we started the same process in the southern Gaza Strip,' he said.\nOn Sunday night Israel also announced it had eliminated a key Hamas figure who had organized the October 7 attacks. In a statement it said an IDF jet has struck and killed Commander Haitham Khuwajari, head of Hamas' Shati Battalion.\nIsrael has vowed to annihilate Hamas after the October 7 attack during which 1,200 Israelis were murdered in barbaric fashion. The Iranian-backed group is sworn to Israel's destruction", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Lindsey Graham slams Defense Secretary Lloyd Austin for warning Israel faces 'strategic defeat' against Hamas because of civilian casualties in Gaza", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12821867/Lindsey-Graham-Lloyd-Austin-Israel-Gaza-Hamas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}