{"authors": [], "date_download": "2024-02-05 15:31:29", "date_modify": "None", "date_publish": "2023-12-04 19:24:32", "description": "Editorial: As Israel pursues Hamas, the horrifying cost to civilians demands our attention. The ramifications don’t end there", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F04%2Fthe-guardian-view-on-gazas-devastation-dont-look-away-see-the-bigger-picture-too.json", "image_url": "https://i.guim.co.uk/img/media/194d20e592a78a34bf2ed4333e7bc43ef358792a/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=00805929f07ed71bffd818cc0953fc5e", "language": "en", "localpath": null, "maintext": "We cannot and must not look away from what is happening in Gaza. Half its population was forced from the north by merciless bombardment; now the Israel Defense Forces’ attacks upon the south have intensified and dozens of tanks have entered. Adults and children alike anticipate their deaths. More than 15,900 people in Gaza have been killed already, the vast majority of them women and children, according to Palestinian officials. Israel’s prime minister, Benjamin Netanyahu, has directed the military to act with “increasing force” in its pursuit of Hamas, this time facing an even larger, denser population in even more desperate circumstances.\nThe IDF says its concern for civilians is evinced by its evacuation orders. Given the lack of power and connectivity, even the most assiduous would struggle to keep up with complex and fast-changing instructions – and this is a hungry, exhausted, grieving and traumatised population, many of whom have already moved multiple times. In any case, there is nowhere to go: “Safe places have no water, no sanitation, are often not safe anyway … They are not safe in hospitals, they are not safe in shelters,” James Elder, a Unicef spokesperson, said on Monday.\nThe US, which pays around a fifth of Israel’s defence budget, is increasingly blunt in public as well as private, reflecting growing discontent among Democrats. The vice-president, Kamala Harris, warned that “too many innocent Palestinians have been killed”. The US defence secretary, Lloyd Austin, couched it in terms of Israel’s own interests: “If you drive [the civilian population] into the arms of the enemy, you replace a tactical victory with a strategic defeat.”\nBut though Joe Biden has described conditionality as “a worthwhile thought”, administration officials swiftly shut down further discussion. The US could perhaps slow-roll its replenishment of shells. But Mr Netanyahu appears confident that the administration will not actually use its leverage. Israel reportedly plans a “very long war” stretching into 2024, and still has no plan for what comes next.\nYet while Gaza’s suffering appears to have no end, we must also look to the broader picture. The UN human rights office last month warned of an “alarming and urgent” picture in the West Bank. A sharp increase in raids by Israeli forces and attacks by settlers since the Hamas attacks of 7 October have killed a growing number of Palestinians, including children, and forced more from their homes. Violence was already at a higher level than it has been for more than 15 years. Last Thursday, Hamas claimed responsibility for shooting dead three Israelis at a bus stop in West Jerusalem.\nIn the Red Sea at the weekend, the US reported that one of its destroyers shot down two drones as it came to the aid of three commercial vessels under attack by Yemen’s Houthi militia, though it is not clear if the warship itself was targeted. This appeared to be the most significant of attacks by the Iran-backed Houthis in the area since 7 October, mostly on Israeli targets. The US has regarded its principal achievement in embracing Israel (and dispatching two aircraft carriers to the region) as averting an uncontrollable escalation between Israel and Hezbollah and ultimately the latter’s patron, Iran. Though the Houthis are far less of a concern for Israel, and the initial fears of regional conflagration have ebbed, the incident highlights the ongoing risks of conflict spreading. This war is devastating Gaza. But its effects are not containable there.", "source_domain": "www.theguardian.com", "text": null, "title": "The Guardian view on Gaza’s devastation: don’t look away. See the bigger picture too", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/04/the-guardian-view-on-gazas-devastation-dont-look-away-see-the-bigger-picture-too"}