{"authors": [], "date_download": "2024-02-05 15:31:32", "date_modify": "None", "date_publish": "2023-12-04 13:00:00", "description": "/PRNewswire/ -- BioCatch, the global leader in digital fraud and money laundering detection and response powered by behavioral biometric intelligence, today...", "filename": "https%3A%2F%2Fwww.prnewswire.co.uk%2Fnews-releases%2Fbiocatch-welcomes-sallie-krawcheck-and-liat-nadai-arad-to-board-of-directors-302003778.html.json", "image_url": "https://mma.prnewswire.com/media/1843699/biocatch_logo_rgb_2x_Logo.jpg?p=facebook", "language": "en", "localpath": null, "maintext": "Financial Services and Cybersecurity Industry Veterans Bring Extensive Growth, Operations, and Innovation Experience to BioCatch\nNEW YORK and TEL AVIV, Israel, Dec. 4, 2023 /PRNewswire/ -- BioCatch, the global leader in digital fraud and money laundering detection and response powered by behavioral biometric intelligence, today announced the addition of Sallie Krawcheck and Liat Nadai Arad to the company's board of directors. Together, the award-winning financial services and cybersecurity veterans bring more than 50 years of growth, operations, and innovation experience in support of BioCatch's expanding fraud detection and financial crime prevention product portfolio and market growth strategies.\nSallie Krawcheck is the CEO and co-founder of Ellevest, an invest-tech and wealth management company, built by women, for women. She is one of the few financial executives of her generation to have found success both in large, global companies and as a start-up CEO. Before launching Ellevest, Krawcheck served as CEO of Merrill Lynch Wealth Management, Smith Barney, US Trust, the Citi Private Bank, and Sanford C. Bernstein. She was also Chief Financial Officer for Citigroup. Prior to her multiple executive leadership roles, Krawcheck was a top-ranked research analyst covering the securities industry. She is also the best-selling author of \"Own It: The Power of Women at Work,\" is considered one of the \"Most Influential People in ESG Investing\" by Barron's, and was named the seventh most powerful woman in the world by Forbes.\nLiat Nadai Arad is the Chief Transformation Officer at the Tel Aviv Medical Center, where she focuses on revolutionizing Israel's public healthcare capabilities utilizing data and data science. Prior to joining the Tel Aviv Medical Center, Ms. Arad applied her unique combination of senior leadership, technology, and operations experience as the first-ever female Colonel to hold an operational technology role within the Israeli Defense Forces Unit 8200, where she served as Head of the Cyber Department. A highly decorated leader and officer, Ms. Arad was selected by Global Business Magazine as one of the '50 Most Influential Women of Israel' in 2022 and in 2021 was awarded the Israel Defense Award. Earlier in her career, Ms. Liat Nadai Arad served as a Board Member and Vice President at modu as well as Vice President at msystems, which was acquired by SanDisk Corp for $1.6B.\n\"Sally and Liat each bring incredible entrepreneurial energy, operational perspective, and growth experience that will invigorate our board room with insights, ideas, and opportunities,\" said Gadi Mazor, BioCatch's CEO. \"Sallie's business acumen and creativity, as well as her time in the trenches with some the world's leading financial brands, will undoubtedly challenge our growth strategies while Liat's digital transformation and cyber security expertise will drive us to expand our innovation initiatives. It is gives me great pleasure to welcome both Sallie and Liat to our Board of Directors.\"\nSallie Krawcheck and Liat Nadai Arad join BioCatch in parallel with the company's realization of $100M in annual recurring revenue, the achievement of protecting more than 315 million banking customer from fraud and financial crime globally, and the accomplishment of EBITA profitability. Krawcheck and Arad are joining Dewey Awad, Partner with the Public Equity and Tech Opportunities businesses at Bain Capital, Matthew Kinsella, Managing Director at Maverick Ventures, Mitchel Lenson, independent advisor and former Managing Director with Deutsche Bank, Jay Mandelbaum, Managing Partner with One South Advisors and formerly EVP at JP Morgan Chase, and Gadi Mazor, the company's CEO, as BioCatch board members.\n\"I try to be thoughtful in choosing the organizations that I work with in today's fast-moving financial technology landscape,\" said Sallie Krawcheck. \"For me, a company's mission and its commitment to inclusion are as, if not more, important than technology-fit and revenue growth. BioCatch prioritizes all of these in its mission to protect banks and their customers from digital fraud and financial crime. I'm looking forward to working closely with Gadi, his team and my fellow board members in BioCatch's mission to fight fraud and stop the financial crimes that threaten consumers' personal security and peace of mind.\"\n\"As a long time cyber security practitioner and executive it is clear to me that we as humans may very well hold the key to our own safety and security online,\" said Liat Nadai Arad. \"Our behavior is unique, no one of us is the same, and the nuances in how we interact with technology makes us one of a kind. BioCatch's data science in the area of behavioral biometric intelligence is truly next-generational and offers banks, and their customers, the power to improve online identity authentication, strengthen transactional security, and streamline their experience all by simply being themselves. I'm excited to work with the BioCatch team as they embark on the next phase of their journey.\"\nAbout BioCatch\nBioCatch stands at the forefront of digital fraud detection, pioneering behavioral biometric intelligence grounded in advanced cognitive science and machine learning. BioCatch analyzes thousands of user interactions to support a digital banking environment where identity, trust and ease coexist. Today, more than 25 of the world's leading 100 banks and 150 of the largest 500 rely on BioCatch Connect™ to combat fraud, facilitate digital transformation, and grow customer relationships. BioCatch's Client Innovation Board, an industry-led initiative featuring American Express, Barclays, Citi Ventures, HSBC, and National Australia Bank, collaborates to pioneer creative and innovative ways to leverage customer relationships for fraud prevention. With more than a decade of data analysis, 90 registered patents, and unmatched expertise, BioCatch continues to lead innovation to address future challenges. For more information, please visit www.biocatch.com.\nMedia Contact:\nJay Jones\nJay.jones@biocatch.com\n404.668.0218\nLogo - https://mma.prnewswire.com/media/1843699/biocatch_logo_rgb_2x_Logo.jpg", "source_domain": "www.prnewswire.co.uk", "text": null, "title": "BioCatch Welcomes Sallie Krawcheck and Liat Nadai Arad to Board of Directors", "title_page": null, "title_rss": null, "url": "https://www.prnewswire.co.uk/news-releases/biocatch-welcomes-sallie-krawcheck-and-liat-nadai-arad-to-board-of-directors-302003778.html"}