{"authors": ["Claudia Aoraha", "Senior Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:31:34", "date_modify": "None", "date_publish": "2023-12-03 20:27:36", "description": "House Intelligence Committee chairman Mike Turner said the US is now helping Israel identify its blind spots as the war continues with terrorist group Hamas.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12820685%2FUS-Israel-gaps-intelligence-led-Hamas-surprise-attack.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/03/20/78529573-0-image-a-29_1701634911697.jpg", "language": "en", "localpath": null, "maintext": "House Intelligence Committee chairman Mike Turner said the US is now helping Israel identify its blind spots in information gathering and how it missed Hamas' attack as the war continues with the terrorist group.\nThe Ohio Republican, 63, said the US is 'working closely' with Israeli intelligence 'to see the gaps that they have,' after reports suggested that Israel knew about a potential threat from Hamas before October 7 happened.\nHe spoke after an Israeli soldier told CBS News that Israel 'didn't take anything seriously' when they were warned of Hamas' potential in the last few months.\nOver 1,200 innocent Israelis were massacred on October 7 - caused by a 'complete breakdown' of communication between Israel and its intelligence agents, Turner suggested.\nTurner told 'Face the Nation': 'I think what you saw was just a general dismissal by Israel and Israel's intelligence community of the possibility of this level of a threat, which really goes to the complete breakdown that occurred here.\nOhio Republican Mike Turner said the US is ' working closely' with Israeli intelligence 'to see the gaps that they have,' after reports suggested that Israel knew about a potential threat from Hamas before October 7 happened\nShocking footage showed festival goers flee carnage as Hamas terrorists gunned down revelers at a music festival on October 7\n'This obviously could have been an institutional bias that resulted in dismissing it, but the other aspect that made this so dangerous, is that even when October 7 began to unfold, their forces didn't react.\n'They didn't have the deployment ability to respond, not just the intelligence ability to prevent it\n'It's one thing to be able to look to try to identify a specific individual and provide information as to their location and operations and actually directing an operation.\n'[CIA Director William] Burns has been very clear that we are not just providing direct access to our intelligence and that certainly gives us the ability to have caution.'\nBurns recently returned from the Middle East, and according to Turner, he tried 'to make certain that our intelligence apparatus is working closely with Israel to try to fill some of those gaps that they clearly have.'\nIt followed reports that Israeli officials had an intimate understanding of Hamas' brutal October 7 terrorist attack over a year before it happened, but brushed off the battle plan as too aspirational for the group to pull off, a bombshell report has claimed.\nIn a 40-page document obtained by The New York Times, Hamas laid out a detailed plan to carry out its assault on Israel that ultimately led to the deaths of approximately 1,200 people in a day.\nThe blueprint reportedly did not set a date for the attack, but offered an exhaustive look at the terrorist group's strategy, including a targeting fortifications around the Gaza Strip while storming key military bases and division headquarters.\nThis graphic (above) shows how the Hamas massacre on the Kfar Aza kibbutz unfolded\nThe blood-stained floors of a kibbutz after Hamas terrorists ripped through the area\nAccording to the outlet, the plans within the document were followed by Hamas with chilling precision in the attacks last month, raising questions as to why Israel failed to take steps to prevent it.\nIt is also claimed that officials admitted they could have stopped, or at least blunted, the October 7 attacks had they taken a number of urgent warnings from analysts seriously.\nFor over a year, Israeli officials reportedly understood that Hamas had designs on beginning an attack over the border with a barrage of rockets in a surprise onslaught.\nThe use of drones to knock out security cameras and automated machine guns positioned along the border were also part of Hamas' longstanding plan.\nIn a sign of the shocking accuracy Hamas followed to its master plan, the document ordered gunmen to fly into Israel on paragliders, with the unorthodox strategy used to horrific affect at the fateful Supernova music festival where at least 364 people were killed.\nIsraeli intelligence officials have come under scrutiny in the weeks after the October 7 attacks, amid questions over a lack of understanding of the impending attack before it took place.\nBut Hamas appeared to have a far better grasp on Israel's apparatus than previously known, as the document included extensive, sensitive details on the location and size of Israel's military forces and communication hubs.\nThis has also raised questions as to how Hamas was able to obtain this information, and the possibility of leaks within Israeli intelligence.\nDespite the chilling details found in the document, which was circulated widely within Israeli military and intelligence circles, experts reportedly determined that the attack was far too ambitious for Hamas to achieve.\nIt is not known if Israeli Prime Minister Benjamin Netanyahu saw the document.\nNamed 'Jericho Wall' after the border in modern-day West Bank that are cited in biblical texts, sixty points within the wall were said to be the targets for Hamas fighters for their siege into Israel.\n'Surprise them through the gate. If you do, you will certainly prevail', the document began, a quote from the Quran. The same quote has been repeated by Hamas terrorists in chilling footage from the October 7 attacks, and in the weeks since.\nA house left in ruins after an attack by Hamas militants on this kibbutz days earlier when dozens of civilians were killed near the border with Gaza on Tuesday\nDespite widespread knowledge of the document, it was largely dismissed, including by the Israeli military's Gaza division, the wing tasked with defending the border with Gaza where much of the ongoing conflict has centered.\nThe division's experts determined that Hamas' objectives and intentions were unclear, with a separate military assessment of the document finding: 'It is not yet possible to determine whether the plan has been fully accepted and how it will be manifested.'\nThree months before the October 7 attacks, German diplomat Sven Kühn von Burgsdorff demonstrated how 'everything is possible in Gaza' as he paraglided into the region in a warning over its vulnerability.\nAt that same time, a veteran analyst with Unit 8200, the signals intelligence division of the agency, reportedly warned that Hamas had carried out days-long training exercises that chillingly mimicked the battle plans from the document.\n'I utterly refute that the scenario is imaginary,' the analyst warned, comparing the exercise to the 'content of Jericho Wall.'\n'It is a plan designed to start war... it is not just a raid on a village.'\nOn Sunday, more than 400 strikes were carried out by Israel in Gaza after Hamas broke the fragile week-long truce.\nThe Israeli army said it had conducted hundreds of bombardments since the ceasefire collapsed on Friday, while Hamas announced 'rocket barrages' against multiple Israeli towns and cities, including Tel Aviv.\nThe Israel Defense Forces said that fighter jets carried out extensive strikes on the southern city of Khan Younis, where Hamas leaders are thought to be stationed.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US is working with Israel to find 'gaps' in 'complete breakdown' of intelligence that led to Hamas's surprise attack that slaughtered 1,200, US House Intelligence chair says", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12820685/US-Israel-gaps-intelligence-led-Hamas-surprise-attack.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}