{"authors": ["Matthew Lodge"], "date_download": "2024-02-05 15:31:36", "date_modify": "None", "date_publish": "2023-12-03 12:06:59", "description": "Tzipi Hotovely hit out at the United Nations Entity for Gender Equality and the Empowerment of Women after it 'stayed silent' on reports women were raped and tortured by the terrorist group on October 7.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12819793%2FIsrael-ambassador-britain-womens-rights-condemn-hamas-rape-murder-backlash.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/03/11/78521161-0-image-m-38_1701603636984.jpg", "language": "en", "localpath": null, "maintext": "Critics have slammed a United Nation's women's women's rights body for taking nearly two months to criticise Hamas for its rape and murder spree.\nThe United Nations Entity for Gender Equality and the Empowerment of Women, known as UN Women, has been blasted as a 'disgrace' for 'staying silent' on reports women were raped and tortured by the terrorist group during the October 7 atrocities.\nIn the immediate aftermath and the weeks that followed, there have been widespread reports of the terrorists using sexual violence against women during the attacks, which also claimed the lives of more than 1,200 innocent civilians and saw over 200 people taken hostage.\nHowever, despite issuing numerous statements condemning the attacks and the subsequent response by Israel, UN Women stayed silent on the reports of gender-based violence perpetrated by Hamas.\nOn Friday, December, it finally issued a statement saying it was 'alarmed' by the reports, sparking ire from anti-Semitism groups, women's rights campaigners and the Israeli ambassador to Britain, Tzipi Hotovely.\nThis was followed by a demonstration in Whitehall this morning, where protesters slammed the organisation for its perceived silence by holding signs with pictures of women kidnapped by Hamas.\nTzipi Hotovely, the Israeli ambassador to Britain, questioned why it took so long for the UN Women organisation to speak out about the sexual violence in the October 7 attacks\nA protester holds a sign with a picture o Shiri Bibas, who was kidnapped by Hamas, during a rally in Whitehall today\nA rally-goer holds a sign saying 'UN Women your silence is loud #speakup' after it took nearly two months to issue a statement on reports of rape by Hamas terrorists\nWomen with orange tape over their mouths hold signs as they gather in Whitehall for the protest\nDemonstrators in Whitehall this morning demanding that the UN condemns alleged sexual violence by Hamas\nIn a post on X, formerly known as Twitter, on Saturday morning UN Women said: 'We reiterate that all women, Israeli women, Palestinian women, as all others, are entitled to a life lived in safety and free from violence.'\nIn a follow-up post it added: 'We unequivocally condemn the brutal attacks by Hamas on Israel on 7 October. We are alarmed by the numerous accounts of gender-based atrocities and sexual violence during those attacks.'\nREAD MORE HERE: RAF will conduct 'unarmed surveillance flights' over the Middle East to search for dungeons where Hamas are keeping kidnapped civilians hostage Advertisement\nHowever, the length of time taken to address the issue has brought fury from some quarters.\nSpeaking on Sky News, Tzipi Hotovely said: 'It took over 50 days for the UN women's organisation to condemn something that is so clear.\n'Why and how come it took the UN women's organisation 50 days to deal with that?\n'It was part of Hamas' plan, to use sexual violence against women, and we want to make sure the world understands what we are dealing with.\n'Hamas brutally murdered and raped innocent women.'\nLeading US campaign group Stop AntiSemitism wrote: 'It took UN Women FIFTY SEVEN DAYS to condemn the brutal rape and sodomy Jewish women experienced at the hands of Hamas terrorists.\n'FIFTY SEVEN DAYS. And they couldn't even do it as a main post - they sub posted it.'\nJournalist Nicole Lampert added: 'All-a-f******-yula. UN Women mentions how it is 'alarmed' by the rapes. It has taken 8 weeks. EIGHT.\n'NOW CAN IT ASK HAMAS TO GIVE THE YOUNG WOMEN BACK. Because I'm worried the rapes are continuing.'\nYael Sherer, an internationally respected forensic expert with experience in collecting evidence from victims of sexual violence, said it was a 'disgrace' it had taken so long for the body to speak out.\nIsrael and Hamas had held a several day long ceasefire to allow for the exchange of hostages, but the conflict has since resumed despite more than 130 still remaining in captivity in the Gaza Strip.\nUN Women released a statement on Twitter on Saturday saying it was 'alarmed by the numerous accounts of gender-based atrocities and sexual violence' by Hamas during the October 7 attacks\nCampaign group Stop AntiSemitism hit out the group for taking '57 days to condemn the brutal rape and sodomy Jewish women experienced'\nA street in kibbutz Kfar Aza is seen on October 27 - 20 days after Hamas stormed the area\nPeople are seen fleeing the Nova music festival as Hamas launches its attack on October 7\nThere has been outcry in recent weeks from Israeli women and legal activists over what they see as a conspiracy of silence over alleged rapes an sexual crimes committed by Hamas militants during the October 7 attacks.\nEven before forensic examinations began, an abundance of images pointed to the gruesome nature of the attacks, with pictures shared online and live footage streamed by the militants as they killed 1,200 people, mostly civilians, according to an Israeli count.\nIn addition to investigating the bloodshed, Israeli police say they have been exploring evidence of sexual violence, ranging from alleged gang rape to post-mortem mutilation.\nTheir inquiry has, so far, gathered 'more than 1,500 shocking and difficult testimonies', a senior police officer told Israel's parliament this week, from witnesses, medics and pathologists.\nShortly after the attacks, Israeli rights experts sent letters detailing the evidence to key international bodies such as UN Women and the UN Committee on the Elimination of Discrimination Against Women (CEDAW).\nBut until this week, when both the UN secretary-general and UN Women issued statements on the allegations, campaigners say the responses were minimal, leaving them deeply frustrated and accusing the global human rights community of betrayal.\nIn a response to AFP late Friday, UN Women said it was 'aware of concerns' about the reactions of women's organisations, saying it was 'the first part of the UN system to publicly express alarm at reports of gender-based violence including sexual violence'.\nIn its full statement issued on Friday, UN Women said: ' We deeply regret that military operations have resumed in Gaza, and we reiterate that all women, Israeli women, Palestinian women, as all others, are entitled to a life lived in safety and free from violence.\n'We unequivocally condemn the brutal attacks by Hamas on Israel on 7 October. We are alarmed by the numerous accounts of gender-based atrocities and sexual violence during those attacks. This is why we have called for all accounts of gender-based violence to be duly investigated and prosecuted, with the rights of the victim at the core.\n'In all conflicts, UN women fully supports rigorous investigations and Commissions of Inquiry where they exist. We are actively supporting the UN Commission of Inquiry on the Occupied Palestinian Territory, including East Jerusalem, and Israel, which began its investigation into sexual violence very shortly after the attacks occurred. We welcome that the Commission has opened its call for submissions on gender-based crimes since 7 October.'\nIt said that UN Women and other bodies within the United Nations would 'proactively share UN-sourced and verified information on incidents, patterns, and trends of conflict-related sexual violence to aid all investigations'.\nIt added: 'We continue to call for accountability for all acts of gender-based violence committed on and after 7 October, the immediate and unconditional release of all remaining hostages, and a humanitarian ceasefire.\n'For the sake of everyone in the Occupied Palestinian Territory and Israel, and especially women and children, we call for a return to a path of peace, a respect for international humanitarian and international human rights law, and an end to the suffering of people in Gaza and in Israel, and those families still waiting for their loved ones to return.'\nIsraeli soldiers look at the photos of people killed or taken captive by Hamas militants at the Nova festival on October 7\nDrone footage shows the devastation in the aftermath of the Hamas attack at the Nova festival on October 7\nIsraeli soldiers carry the body of a victim of an attack by militants from Gaza at Kibbutz Kfar Aza, in southern Israel, October 10\nPersonal belongings lie among the debris of a house destroyed during the October 7 attack by Hamas militants in kibbutz Kfar Aza in southern Israel near the Gaza Strip on October 18\nLegal expert Ruth Halperin-Kaddari, who has been at the forefront of efforts to challenge the silence from global institutions, told AFP: 'This is the statement they should have issued two months ago.'\nThe issue has fuelled growing anger in Israel. A cartoon last week in Yediot Aharonot newspaper depicted an Israeli woman in bloodied, torn clothes saying 'Me too' to a panel of three UN women - one covering her ears, one covering her eyes and one covering her mouth.\nIn the weeks after October 7, statements by UN Women predominantly focused on the situation in the Gaza Strip, where the Hamas government says Israel's retaliatory bombardment has killed more than 15,000 people, mostly women and children.\nEXCLUSIVE READ MORE HERE: 'The music stopped and the nightmare began': Israeli reveller reveals how she smeared herself in blood and pretended to lie dead for three hours as Hamas festival massacre unfolded Advertisement\nOn October 27, CEDAW urged 'all parties to systematically address the gender dimension of conflict'.\nA UN commission has now invited submissions on 'allegations of gender-based crimes, with an emphasis on murder and hostage-taking, rape and other forms of sexual violence'.\nHalperin-Kaddari accused international organisations of wilfully ignoring evidence for nearly two months.\n'None of these bodies acknowledged the fact that there were war crimes committed here or crimes against humanity,' she told AFP.\n'And none mentioned the sexual violence against women that was used systematically, intentionally and deliberately, which is a case of weaponising women and using rape as a weapon of war.'\nHalperin-Kaddari, a former vice-chair of CEDAW, said the reticence of such UN entities was 'a shameful abuse of their mandate and their mission'.\nAt an Israeli parliamentary hearing on Monday, senior police investigator Shelly Harush provided harrowing evidence of sexual violence and mutilation including 'an apocalypse of corpses, girls stripped bare above the waist and below', and a grisly witness account of the gang rape, mutilation and murder of a young woman.\nAnother witness she cited spoke of wounds to the 'genitals, abdomen, legs and buttocks' with some having their 'breasts cut off' or sustaining 'gunshot wounds'. First responders described encountering bodies 'with their hands cuffed behind their backs, a woman's corpse bleeding from the genital area'.\nPolice investigations chief Shlomit Landes said they were attacked 'just for being women', including some who were pregnant.\nMore than 400 strikes have been carried out by Israel in Gaza in the past 48 hours after Hamas broke the fragile week-long truce\nThe Israel Defense Forces said that fighter jets carried out extensive strikes on the southern city of Khan Younis, where Hamas leaders are thought to be stationed\nResidential buildings lie in ruin following Israeli strikes at the Qatari-funded Hamad City in Khan Younis in the southern Gaza Strip December 2, 2023\n'Most were murdered. Those who survived - because they hid, among them children - we've not yet spoken to... due to the depth of their trauma,' she said.\nEuropean Parliament vice president Pina Picierno told the hearing that Hamas had committed 'war crimes' that were 'beyond what any woman in the world could ever imagine... Israeli women cannot be left alone in this terrible time.'\n'All international organisations and women's organisations should condemn the Hamas attack and defend the victims,' she said.\n'Pretending to not see... for political reasons is a second terrible violence.'\nIsrael Women's Network head Einat Fischer Lalo said the global feminist struggle and the MeToo movement had turned into 'a struggle of 'Yes, but... '.'\nREAD MORE HERE: Israel launches deadly strike on Iranian officers training Hezbollah terrorists in Syria just ten miles from Damascus Advertisement\n''Yes, we are against rape, but not of all women', 'Yes, we are against sexual abuse, but it depends on what nationality you are', 'Yes, we believe you, but if you are Israeli women who have been hurt by terrorists, then please bring us proof otherwise we are not on your side',' she said.\nOn Thursday, UN Secretary-General Antonio Guterres issued a statement on X, saying: 'There are numerous accounts of sexual violence during the abhorrent acts of terror by Hamas on 7 October that must be vigorously investigated and prosecuted.'\nYael Sherer, an internationally respected forensic expert with experience in collecting evidence from victims of sexual violence, said it was the first time he had addressed the issue, dismissing his reaction as 'too little, too late'.\n'It's a disgrace,' she told AFP, saying his reaction came after 'immense public pressure' and thousands of emails to UN departments.\nShe said she had encountered unprecedented levels of cynicism about the allegations, despite her expertise in the field.\n'The fact that people were found naked, restrained with their hands behind their backs and tied to chairs wasn't enough for them?' she said. 'It's outrageous and insulting.'\nHalperin-Kaddari said international bodies' reticence was partly driven by preconceptions about the decades-long conflict including 'the difficulty of stepping away from the conventional construction of Israel as the aggressor as the Palestinians as victims'.\n'Here, the situation flipped,' she said. 'They could not attribute such evil to those who they always prefer to see as being the victims.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Why did it take 57 DAYS for the UN's women's rights body to condemn Hamas' rape and murder spree? Israel's Ambassador to Britain leads backlash after group 'stayed silent' nearly two months after atta", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12819793/Israel-ambassador-britain-womens-rights-condemn-hamas-rape-murder-backlash.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}