{"authors": [], "date_download": "2024-02-05 15:31:37", "date_modify": "None", "date_publish": "2023-12-03 14:53:41", "description": "Japanese authorities say they have handed over pieces of the wreckage from an U.S. Air Force Osprey that crashed off southwestern Japan to the U.S. military, as the search continued for seven missing servicemembers", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fjapan-ap-japanese-osprey-tokyo-b2457667.html.json", "image_url": "https://static.independent.co.uk/2023/12/01/09/Japan_US_Osprey_Crash_78911.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nJapanese authorities handed over pieces of the wreckage from an U.S. Air Force Osprey that crashed off southwestern Japan to the U.S. military on Sunday, as the search continued for seven missing servicemembers. The only body so far recovered has now been formally identified.\nThe wreckage had been collected by a ship from the regional coast guard headquarters and by fishers from the town of Yakushima since the CV-22 aircraft crashed into the water near the town Wednesday during a training mission to Okinawa.\nJapan Coast Guard 10th Regional Headquarters said the unidentified pieces of wreckage, which had been kept at the town hall, were handed over to the U.S. military for further examination. Debris collected by the fishers had been picked up by the U.S. military earlier Sunday, and that collected by the coast guard was also to be handed over later in the day.\nThe handover is procedure according to the Japan-U.S. Status Forces Agreement, under which Japanese authorities are not given the right to seize or investigate U.S. military property unless the U.S. decides otherwise. That means it will be practically impossible for Japan to investigate the cause of the accident.\nThe agreement, known as SOFA, has in the past repeatedly made Japanese investigation difficult in criminal cases involving American service members on Okinawa and elsewhere, and has been criticized as unequal by rights activists and others, including Okinawa Gov. Denny Tamaki, who call for a revision.\nThe Air Force Special Operations Command formally identified the one confirmed victim as Air Force Staff Sgt. Jacob Galliher of Pittsfield, Massachusetts, on Saturday, after tributes had begun pouring in the day before.\nGalliher's family issued a statement Saturday saying it was in mourning and asking for privacy and prayers for his wife, two children and other family members.\n\"Jacob was an incredible son, brother, husband, father and friend to so many. His short life touched and made better the lives of hundreds, if not thousands in Pittsfield, in this region and everywhere he served,\" the family said. “Jacob lived to serve his family, his country and the people he loved.”\nThe U.S. military said it was continuing to look for the rest of the crew.\n“We want to assure our air commandos’ families that our efforts will continue and include every possible capability at our disposal,” said Rear Adm. Jeromy Williams, Pacific commander for the Special Operations Command.\nU.S. Ambassador to Japan Rahm Emanuel, in a statement Sunday, said “your heart and your spirit are torn when you see a young man with such promise lose his life in the service of a set of ideals.” He said the top priority is the safety of the servicemembers, as well as the communities where they operate, and pledged to make sure \"the equipment, the aircraft, anything that you're using\" is safe.\nEmanuel thanked the Japanese Self Defense Forces, the Coast Guard and the local fishing communities for their support in the search for the seven still missing, and promised full transparency.\n“Obviously, in a fully transparent way as we investigate what happened, to rectify it, we will be transparent with our partner, Japan. And while there are a lot of questions to be answered, we are focused like a laser on the search and rescue operation to secure the safety of the other servicemembers,” Emanuel said, but did not say if the U.S. side would allow Japanese authorities into the crash probe.\n___\nSharp reported from Portland, Maine.", "source_domain": "www.independent.co.uk", "text": null, "title": "Search for military personnel continues after Osprey crash off coast of southern Japan", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/japan-ap-japanese-osprey-tokyo-b2457667.html"}