{"authors": ["Helen Davidson", "Maya Yang", "Geneva Abdul", "Adam Fulton"], "date_download": "2024-02-05 15:31:39", "date_modify": "None", "date_publish": "2023-12-03 03:29:16", "description": "A team from Israel’s Mossad intelligence services has been ordered home after talks in Qatar about another pause in fighting in Gaza reach a ‘dead end’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F02%2Fisrael-hamas-war-live-israel-reportedly-wants-gaza-buffer-zone-184-palestinians-killed-in-renewed-fighting-say-gaza-authorities.json", "image_url": "https://i.guim.co.uk/img/media/61b64ad1e9536c3bca0a7ae20a791253a017966d/0_453_5055_3032/master/5055.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=730b70518a4ba5973b160d6e5490fb81", "language": "en", "localpath": null, "maintext": "From 3 Dec 2023 02.01 CET Israel plan to eliminate Hamas risks a decade of war: Macron French President Emmanuel Macron warned Saturday that Israel’s aim of eliminating Hamas risked unleashing a decade of war. “I think we’re at a point where the Israeli authorities are going to have to define their objective and desired end state more precisely,” Macron said at a press conference on the sidelines of the UN’s COP28 climate talks in Dubai. Israel has vowed to eliminate Hamas in response to the 7 October attack, and has unleashed an air and ground campaign that has killed more than 15,000 people, also mostly civilians, the Hamas authorities who run Gaza say. “What is the total destruction of Hamas, and does anyone think it’s possible? If it is, the war will last 10 years,” Macron said on Saturday. French President Emmanuel Macron at the United Nations Climate Change Conference (COP28), in Dubai, United Arab Emirates, 2 December, 2023. Photograph: Thaier Al-Sudani/Reuters After the Israeli army resumed shelling the Gaza Strip on Friday following the collapse of a week-long truce, Macron spoke of the need for “stepped-up efforts to reach a lasting ceasefire” in the conflict. Macron travelled to Doha on Saturday to meet with Qatar’s Emir Tamim bin Hamad Al-Thani, whose government has been central to diplomatic efforts to end the conflict. But his five-hour stopover in Doha came just after the departure of the Israeli negotiators, with Israel citing a “stalemate” in the talks. Israel and Hamas blamed each other for the breakdown of the truce, which before it expired had enabled the release of 80 Israeli hostages in exchange for 240 Palestinian prisoners. The Israeli army said it had carried out more than 400 strikes in Gaza since the collapse of the ceasefire, while Hamas announced “rocket barrages” against multiple Israeli cities and towns including Tel Aviv. Macron had planned to make an extensive tour of the Middle East but instead held meetings about the conflict on the sidelines of UN climate talks. Neither Israeli Prime Minister Benjamin Netanyahu nor Palestinian Authority leader Mahmoud Abbas attended the Dubai summit. In October, Macron met with Netanyahu in Israel. Analysts say Macron’s visits to Dubai and Doha illustrate the difficulty his government faces in finding a way to influence the conflict. “France and Macron are not really finding their place in this crisis,” said Agnes Levallois, vice-president of the Institute for Mediterranean Middle East Research and Studies.\n3 Dec 2023 04.29 CET Summary We are pausing our coverage temporarily, and will move to a new blog soon. Here is where things stand: Israeli prime minister Benjamin Netanyahu has vowed the IDF will continue its assault on Gaza with intensified force until they have achieved the total elimination of Hamas. Strikes on Palestinian territory continued overnight, according to Palestinian media.\nIn Dubai, French leader Emmanuel Macron has warned that seeking the elimination of Hamas risked unleashing a decade of war. “I think we’re at a point where the Israeli authorities are going to have to define their objective and desired end state more precisely,” he said on the sidelines of the COP28 forum.\nThe UK has announced that it will conduct surveillance flights over the eastern Mediterranean, including operating in air space over Israel and Gaza “in support of hostage rescue activity.” In a statement released on Saturday, the UK government said, “Surveillance aircraft will be unarmed, do not have a combat role, and will be tasked solely to locate hostages. Only information relating to hostage rescue will be passed to the relevant authorities responsible for hostage rescue.”\nTwo Qatar Armed Forces aircraft carried aid for Palestinians in Gaza on Saturday, the Qatari foreign ministry announced. The two aircraft carried 62 tons of aid consisting of food supplies and shelter equipment. Saturday’s delivery from Qatar brings the total amount of aid planes sent to Gaza from Qatar to 35.\nThe US defense secretary Lloyd Austin urged Israel to protect civilians on Saturday as Israel increases its attacks across Gaza, which have killed more than 15,200 Palestinians in the last two months. Speaking at the Reagan National Defense Forum in California, Austin said, “In this kind of a fight, the center of gravity is the civilian population. And if you drive them into the arms of the enemy, you replace a tactical victory with a strategic defeat.”\nThere are around 50,000 pregnant women in Gaza with more than 180 giving birth daily, according to UNRWA, the main UN agency for Palestinian refugees. “Post-natal care continues in shelters, but conditions are not at all suitable for newborns,” the agency said.\nThe deputy Hamas chief Saleh al-Arouri told Al Jazeera on Saturday that no more hostages would be exchanged with Israel until there is a ceasefire in Gaza, Reuters reports. According to Arouri, the hostages still held by Hamas were Israeli soldiers and civilian men who had previously served in the Israeli army. The remaining hostages will not be released unless there is a ceasefire and all Palestinians held in Israeli prisons are also released.\nThe Palestine Red Crescent Society received 100 aid trucks through the Rafah border crossing on Saturday, the humanitarian organization announced. The trucks contained food, water, relief assistance, medical supplies and medicines, the PRCS said.\nAn Israeli military spokesman has defended the IDF’s use of artificial intelligence following reports by the Guardian and the Israeli-Palestinian publication +972 Magazine and partner Hebrew-language outlet Local Call about how it is using an AI-driven tool to select bombing targets in Gaza. Responding to a question from an X user in a Spaces conversation, IDF spokesman Jonathan Conricus said, “In anything that is generated by a machine, there’s always a human in the loop that has definitive and executive say over whatever is generated by a machine … and they are accountable for their decisions.”\nUnicef has condemned the “ongoing war on children” as Israel resumed strikes on Gaza swiftly after the truce between Israel and Hamas expired on Friday. Speaking to journalists at the UN office in Geneva via video link from Khan Younis, Unicef spokesperson James Elder said: “The bombs started just a few seconds after the ceasefire [ended],” before decrying the “ongoing war on children.”\nThe US vice-president, Kamala Harris, said on Saturday that “under no circumstance will the United States permit the forced relocation of Palestinians”, according to a statement released by the White House. It stated, “The vice president reiterated that under no circumstances will the United States permit the forced relocation of Palestinians from Gaza or the West Bank, the besiegement of Gaza, or the redrawing of the borders of Gaza.”\nPalestinian human rights groups refused to meet the international criminal court prosecutor Karim Khan on Saturday, accusing him of favouring Israeli accusations of rights abuses over longstanding Palestinian charges. Khan has been visiting Israel and the occupied West Bank following a request by a group representing families of victims of the 7 October attack on Israel by Hamas gunmen, but he was also due to meet Palestinian officials in Ramallah. However, Palestinian activists said they would refuse to see him because they objected to what they saw as unequal treatment of Israeli and Palestinian cases, according to Reuters.\n3 Dec 2023 03.50 CET The IDF says the rocket warning sirens activated in Ashkelon and other towns near the Gaza border were a false alarm, according to the Times of Israel.\n3 Dec 2023 03.32 CET Fighting is continuing overnight, as Palestinian media reports Israeli air and artillery strikes in Gaza. Israeli media is also reporting rocket warning sirens in the coastal cities of Ashkelon, Sderot and other towns near the border with the Gaza Strip. #فيديو| مشهد من القصف العنيف وغير المسبوق في خانيونس جنوب القطاع pic.twitter.com/5LXpGPlsYo — وكالة شهاب للأنباء (@ShehabAgency) December 2, 2023\n3 Dec 2023 02.50 CET A few hours ago the Israeli prime minister, Benjamin Netanyahu, held a press conference vowing to continue the ground assault “with increasing force”, saying it was the only way to achieve Israel’s goal of “eliminating Hamas and releasing our hostages”. He said the IDF and security forces were continuing the ground incursion while upholding international law – a claim which has been repeatedly called into question by some human rights observers and world leaders including the Spanish prime minister just last week. Netanyahu said soldiers had prepared for ongoing fighting “with full force” during the pause in fighting. “The day before yesterday I directed the IDF, together with the War Cabinet, to resume fighting, with increasing force. In the last 24 hours, we have destroyed over 400 Hamas terrorist targets. We carried out extensive aerial attacks in Khan Yunis. We eliminated terrorists and infrastructure in Beit Lahiya. We are continuing to act in the northern Gaza Strip.” He said Israel was “returning fire many times over”, and issued a warning to Hezbollah, the Lebanese group allied with Hamas and which has been exchanging fire with Israeli forces. “Let it be clear: We are committed to restoring security both in the south and the north. If Hezbollah makes a mistake and enters into a broad war, it will be destroying Lebanon with its own hands.”\n3 Dec 2023 02.01 CET Israel plan to eliminate Hamas risks a decade of war: Macron French President Emmanuel Macron warned Saturday that Israel’s aim of eliminating Hamas risked unleashing a decade of war. “I think we’re at a point where the Israeli authorities are going to have to define their objective and desired end state more precisely,” Macron said at a press conference on the sidelines of the UN’s COP28 climate talks in Dubai. Israel has vowed to eliminate Hamas in response to the 7 October attack, and has unleashed an air and ground campaign that has killed more than 15,000 people, also mostly civilians, the Hamas authorities who run Gaza say. “What is the total destruction of Hamas, and does anyone think it’s possible? If it is, the war will last 10 years,” Macron said on Saturday. View image in fullscreen French President Emmanuel Macron at the United Nations Climate Change Conference (COP28), in Dubai, United Arab Emirates, 2 December, 2023. Photograph: Thaier Al-Sudani/Reuters After the Israeli army resumed shelling the Gaza Strip on Friday following the collapse of a week-long truce, Macron spoke of the need for “stepped-up efforts to reach a lasting ceasefire” in the conflict. Macron travelled to Doha on Saturday to meet with Qatar’s Emir Tamim bin Hamad Al-Thani, whose government has been central to diplomatic efforts to end the conflict. But his five-hour stopover in Doha came just after the departure of the Israeli negotiators, with Israel citing a “stalemate” in the talks. Israel and Hamas blamed each other for the breakdown of the truce, which before it expired had enabled the release of 80 Israeli hostages in exchange for 240 Palestinian prisoners. The Israeli army said it had carried out more than 400 strikes in Gaza since the collapse of the ceasefire, while Hamas announced “rocket barrages” against multiple Israeli cities and towns including Tel Aviv. Macron had planned to make an extensive tour of the Middle East but instead held meetings about the conflict on the sidelines of UN climate talks. Neither Israeli Prime Minister Benjamin Netanyahu nor Palestinian Authority leader Mahmoud Abbas attended the Dubai summit. In October, Macron met with Netanyahu in Israel. Analysts say Macron’s visits to Dubai and Doha illustrate the difficulty his government faces in finding a way to influence the conflict. “France and Macron are not really finding their place in this crisis,” said Agnes Levallois, vice-president of the Institute for Mediterranean Middle East Research and Studies.\n3 Dec 2023 01.32 CET Israeli hostages released from Gaza have addressed addressed a rally in central Tel Aviv, urging their government to secure the freedom of those still held captive in Palestinian territory. The hostages, who were taken during the 7 October attacks, spoke in a video broadcast to a crowd of thousands about the fear, hunger, and sleeplessness of their captivity. “Our daughters saw things that children at that age - or of any age - don’t need to see,” said Danielle Aloni, 45, who was released last week along with her five-year-old daughter. “The food wasn’t plentiful to start with, and as time passed, the food dwindled,” said 84-year-old Ditza Heiman, who was released Tuesday. The freed hostages urged the government to take all action necessary to secure the remaining captives’ release. Yocheved Lifschitz, 85, who was released by Hamas in October, outside the parameters of the truce deal, said “the moral obligation of this government is to bring them home immediately, without hesitation”. Their comments came a day after the collapse of the US-Qatari mediate truce that saw the release of 80 Israeli hostages, mostly women and children, in exchange for 240 Palestinian prisoners over the course of a week. Israeli troops renewed fighting in the Gaza Strip Friday morning. Speaking at the rally Yelena Trupanov, who was released Wednesday, told the crowd assembled outside the Tel Aviv Art Museum that “we must return my Sasha and the rest,” referring to her son, still held in Gaza. Trupanov, 50, had appeared in a hostage video disseminated by Hamas in the weeks after the attacks. Israeli army spokesman Daniel Hagari said Saturday that 137 Israelis and foreign nationals remained captive in the Gaza Strip.\n2 Dec 2023 00.59 CET Summary Here is where things stand: The UK has announced that it will conduct surveillance flights over the eastern Mediterranean, including operating in air space over Israel and Gaza “in support of hostage rescue activity.” In a statement released on Saturday, the UK government said, “Surveillance aircraft will be unarmed, do not have a combat role, and will be tasked solely to locate hostages. Only information relating to hostage rescue will be passed to the relevant authorities responsible for hostage rescue.”\nTwo Qatar Armed Forces aircraft carried aid for Palestinians in Gaza on Saturday, the Qatari foreign ministry announced. The two aircraft carried 62 tons of aid consisting of food supplies and shelter equipment. Saturday’s delivery from Qatar brings the total amount of aid planes sent to Gaza from Qatar to 35.\nThe US defense secretary Lloyd Austin urged Israel to protect civilians on Saturday as Israel increases its attacks across Gaza, which have killed more than 15,200 Palestinians in the last two months. Speaking at the Reagan National Defense Forum in California, Austin said, “In this kind of a fight, the center of gravity is the civilian population. And if you drive them into the arms of the enemy, you replace a tactical victory with a strategic defeat.”\nThere are around 50,000 pregnant women in Gaza with more than 180 giving birth daily, according to UNRWA, the main UN agency for Palestinian refugees. “Post-natal care continues in shelters, but conditions are not at all suitable for newborns,” the agency said.\nThe deputy Hamas chief Saleh al-Arouri told Al Jazeera on Saturday that no more hostages would be exchanged with Israel until there is a ceasefire in Gaza, Reuters reports. According to Arouri, the hostages still held by Hamas were Israeli soldiers and civilian men who had previously served in the Israeli army. The remaining hostages will not be released unless there is a ceasefire and all Palestinians held in Israeli prisons are also released.\nThe Palestine Red Crescent Society received 100 aid trucks through the Rafah border crossing on Saturday, the humanitarian organization announced. The trucks contained food, water, relief assistance, medical supplies and medicines, the PRCS said.\nAn Israeli military spokesman has defended the IDF’s use of artificial intelligence following reports by the Guardian and the Israeli-Palestinian publication +972 Magazine and partner Hebrew-language outlet Local Call about how it is using an AI-driven tool to select bombing targets in Gaza. Responding to a question from an X user in a Spaces conversation, IDF spokesman Jonathan Conricus said, “In anything that is generated by a machine, there’s always a human in the loop that has definitive and executive say over whatever is generated by a machine … and they are accountable for their decisions.”\nUnicef has condemned the “ongoing war on children” as Israel resumed strikes on Gaza swiftly after the truce between Israel and Hamas expired on Friday. Speaking to journalists at the UN office in Geneva via video link from Khan Younis, Unicef spokesperson James Elder said: “The bombs started just a few seconds after the ceasefire [ended],” before decrying the “ongoing war on children.”\nThe US vice-president, Kamala Harris, said on Saturday that “under no circumstance will the United States permit the forced relocation of Palestinians”, according to a statement released by the White House. It stated, “The vice president reiterated that under no circumstances will the United States permit the forced relocation of Palestinians from Gaza or the West Bank, the besiegement of Gaza, or the redrawing of the borders of Gaza.”\nPalestinian human rights groups refused to meet the international criminal court prosecutor Karim Khan on Saturday, accusing him of favouring Israeli accusations of rights abuses over longstanding Palestinian charges. Khan has been visiting Israel and the occupied West Bank following a request by a group representing families of victims of the 7 October attack on Israel by Hamas gunmen, but he was also due to meet Palestinian officials in Ramallah. However, Palestinian activists said they would refuse to see him because they objected to what they saw as unequal treatment of Israeli and Palestinian cases, according to Reuters.\n2 Dec 2023 00.30 CET Rashida Tlaib, the only Palestinian American serving in the US Congress, said that the “constant dehumanization of Palestinians have real consequences”. In a House address, Tlaib, a Democratic representative of Michigan, cited the recent shooting of three Palestinian college students in Vermont, as well as the fatal stabbing of six-year old Palestinian American Wadea Al Fayoume in Chicago in October. Tlaib said that the dehumanization of Palestinians is “fueling anti-Palestinian racism and violence”. She added: “The dehumanization and the rhetoric repeated by many elected officials, many in this chamber, is inciting violence against Palestinians.” Hisham, Kinnan, and Tahseen, all Palestinian students, were shot while speaking Arabic and wearing the same keffiyehs that I wear. The dehumanizing rhetoric repeated by our elected officials is inciting violence against Palestinians and it must stop. pic.twitter.com/HwAm8hZIsT — Congresswoman Rashida Tlaib (@RepRashida) December 2, 2023\nUpdated at 00.59 CET\n2 Dec 2023 23.54 CET Here are some images coming through the newswires from Gaza where more than 15,200 Palestinians have been killed by Israeli airstrikes in the last two months while survivors grapple with a scarcity in food, fuel, medical supplies and water across the strip: View image in fullscreen Palestinians flee from east to west of Khan Younis, Gaza Strip, during the ongoing Israeli bombardment, Saturday, Dec. 2, 2023 Photograph: Fatima Shbair/AP View image in fullscreen Palestinians gather to get their share of charity food offered by volunteers, amid food shortages, as the conflict between Israel and the Palestinian Islamist group Hamas continues, in Rafah, in the southern Gaza Strip, on 2 December 2023. Photograph: Ibraheem Abu Mustafa/Reuters View image in fullscreen People mourn next to the bodies of Palestinians killed in Israeli strikes at Nasser hospital, in Khan Younis, in the southern Gaza Strip, on 2 December 2023. Photograph: Fadi Shana/Reuters View image in fullscreen Displaced Palestinian man Abu Wael Nasrallah sits next to his grandchild near their tent, where they take shelter as the conflict between Israel and Hamas continues, at Nasser hospital in Khan Younis in the southern Gaza Strip, on 2 December 2023. Photograph: Saleh Salem/Reuters View image in fullscreen Palestinian children wounded in Israeli strikes wait to receive treatment at Nasser hospital, in Khan Younis in the southern Gaza Strip on 2 December 2023. Photograph: Mohammed Salem/Reuters View image in fullscreen Palestinians mourn their relatives killed in the Israeli bombardment of the Gaza Strip, in the hospital in Khan Younis on 2 December 2023. Photograph: Fatima Shbair/AP\nUpdated at 00.25 CET\n2 Dec 2023 23.12 CET UK to conduct \"surveillance flights\" in air space over Israel and Gaza The UK has announced that it will conduct surveillance flights over the eastern Mediterranean, including operating in air space over Israel and Gaza “in support of hostage rescue activity”. In a statement released on Saturday, the UK government said: Surveillance aircraft will be unarmed, do not have a combat role, and will be tasked solely to locate hostages. Only information relating to hostage rescue will be passed to the relevant authorities responsible for hostage rescue.\nUpdated at 23.37 CET\n2 Dec 2023 22.51 CET Two Qatar Armed Forces aircraft carried aid for Palestinians in Gaza on Saturday, the Qatari foreign ministry announced. The two aircraft carried 62 tons of aid consisting of food supplies and shelter equipment. Saturday’s delivery from Qatar brings the total amount of aid planes sent to Gaza from Qatar to 35. Two Qatar Armed Forces Aircraft Carrying Aid for Palestinians in Gaza Heads to Egypt's Al Arish#MOFAQatar pic.twitter.com/EL30DMI0O0 — Ministry of Foreign Affairs - Qatar (@MofaQatar_EN) December 2, 2023\nUpdated at 22.55 CET\n2 Dec 2023 22.28 CET The US defense secretary Lloyd Austin urged Israel to protect civilians on Saturday as Israel increases its attacks across Gaza, which have killed more than 15,200 Palestinians in the last two months. Speaking at the Reagan National Defense Forum in California, Austin said that he had “learned a thing or two about urban warfare” while fighting in Iraq and leading the campaign against the Islamic State, Agence France-Presse reports. Austin said: Like Hamas, Isis was deeply embedded in urban areas. And the international coalition against Isis worked hard to protect civilians and create humanitarian corridors, even during the toughest battles. He went on to add: The lesson is not that you can win in urban warfare by protecting civilians. The lesson is that you can only win in urban warfare by protecting civilians … In this kind of a fight, the center of gravity is the civilian population. And if you drive them into the arms of the enemy, you replace a tactical victory with a strategic defeat.\nUpdated at 22.46 CET\n2 Dec 2023 22.06 CET An Israeli srike has destoyed a Qatar-funded complex in Gaza following the end of the truce between Israel and Hamas. Agence France-Presse reports: At almost exactly the same time Israeli negotiators pulled out of deadlocked truce talks in Qatar on Saturday, Israeli jets sent a prestige Doha-funded housing development in the Gaza Strip up in smoke. Hamad City is named for the former emir of the Gulf petro-state, Sheikh Hamad bin Khalifa al-Thani, who laid the foundation stone on a visit 11 years ago. Inaugurated in 2016, it was still among the newest projects in the Gaza Strip, [with] the housing complex in the city of Khan Younis boasting an impressive mosque, shops and gardens. The first flats – more than 1,000 of them – were provided to Palestinians whose homes were destroyed in the war between Israel and Hamas two years earlier. On Saturday it happened again, a day after a Qatar-brokered pause in the current war between Israel and Hamas expired. First their phones pinged around noon with an “immediate” evacuation-order SMS sent by the Israeli army, which says the system is aimed at minimising civilian casualties. Around an hour later, five Israeli air strikes rained down on the neighbourhood in the space of just two minutes. Bombs slammed into the pale apartment blocks one by one, reducing them largely to rubble and sending a huge pall of black smoke into the sky, as people fled and cries of ‘help!’ and ‘ambulance!’ rang out. “At least we got through it,” 26-year-old Nader Abu Warda told AFP, amazed he was still alive.\n2 Dec 2023 21.42 CET Aid workers are warning that Israel’s new grid system for targeted evacuation warnings in southern Gaza risks turning life for Palestinians into a “macabre game of Battleships”. The Guardian’s Emma Graham-Harrison and Jason Burke report: Israel has started using its new grid system for evacuation warnings, which breaks Gaza down into more than 600 blocks, and can be accessed through a QR code on leaflets and social media posts. It appears designed to allow the Israel Defense Forces (IDF) to try to shuffle civilians around in a shrinking battle space as they target Hamas fighters, by ordering them to leave areas that in some cases cover just a few blocks. But on the ground, people said it had just added to their fear and confusion. After weeks of bombardment and blockades, most people have little access to electricity to charge phones and other devices, and even for those who can get online, the telecommunications system regularly collapses. That means residents have no reliable way of accessing the map, the UN Office for the Coordination of Humanitarian Affairs (Ocha) said. For the full story, click here: Israeli grid maps make life in Gaza ‘macabre game of Battleships’, say aid workers Read more", "source_domain": "www.theguardian.com", "text": null, "title": "Further Israel-Hamas truce talks ‘reach dead end’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/02/israel-hamas-war-live-israel-reportedly-wants-gaza-buffer-zone-184-palestinians-killed-in-renewed-fighting-say-gaza-authorities"}