{"authors": [], "date_download": "2024-02-05 15:31:40", "date_modify": "None", "date_publish": "2023-12-03 13:11:36", "description": "The Israel-Hamas war and its polarizing reverberations in America are straining some Muslim-Jewish interfaith relationships in the U.S. more than ever", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fjewish-ap-people-muslim-israel-b2457627.html.json", "image_url": "https://static.independent.co.uk/2023/12/03/13/Jews_Muslims-Strained_Relations_45419.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nShireen Quaizar was wracked with doubt. For years, the school psychologist has been active in Muslim-Jewish interfaith dialogue, but the Israel-Hamas war left her reeling.\n“What are we doing with talking to each other?” she recalled thinking, frustrated by a conversation about the exact number of Palestinians killed in an Israeli airstrike. “This doesn’t work.”\nBut she decided to fight that thought and tackle the hard discussions once again. Later, Quaizar, who is Muslim, met with women like Aviva Seltzer, the daughter of a rabbi and a Jewish school principal who was raised with the belief that “but for the existence of Israel, we’d all be dead.”\nThe two had come together for a conference in New Brunswick, New Jersey, convened by the Sisterhood of Salaam Shalom, an organization seeking to build trust and friendships between Muslim and Jewish women.\nThese conversations are becoming increasingly difficult, with the war and its polarizing reverberations in America testing and straining some interfaith relationships more than ever. For many, the losses are too personal, the emotions too raw.\nThe latest violence, triggered by the Oct. 7 Hamas attack on Israel, is prompting some to question the point of these conversations — and how to have them — while steeling the resolve of others to keep going.\n“We’re very courageous, you and I, because we don’t stop talking,” Seltzer told Quaizar. “The minute we stop talking, there’s no hope.”\nQuaizar nodded and said, “We’re doing the hardest work right now.”\nAt the event, Sisterhood co-founder Atiya Aftab, a Muslim, told participants that simply showing up was an achievement. Next to her, Roberta Elliott, who’s Jewish and the nonprofit’s president, said she couldn’t have gotten through the previous weeks “without my Muslim sisters.”\nThey’ve seen the challenges mount.\nThere are “all these barriers now to come to the table,” Aftab said in an interview.\nShe’s questioned why she’s not walking away herself.\n“Sometimes it seems insurmountable to have conversations with people who have a diametrically different viewpoint,” Aftab said. “Faith is what keeps me there — and hope.”\nPart of the difficulty of discussing the war was underscored in responses to the organization's public call earlier for a cease-fire. Elliott said some Jewish women would have preferred the group advocated for a humanitarian pause instead.\nMore recently, heated debates also erupted over what to call Israel’s military action. Tensions flared on members’ WhatsApp groups.\n“We’ve had to remind people that they need to step back, that they need to take deep breaths,\" Elliott said. Still, she said, “this is what we’ve been preparing for ... to try to be a comfort for each other and try to achieve something together.”\nBut in the Israeli-Palestinian context, some critics say many interfaith efforts fall short. Detractors argue that focusing on Muslim-Jewish relationships also risks inadvertently reducing the conflict to religion, ignoring all factors at play or overlooking the diversity of communities, including non-Muslim Palestinians and Jewish supporters of the Palestinian cause.\nAftab said wading into areas of disagreement, especially after establishing trust, is necessary for meaningful interactions.\n“This isn’t a religious conflict, but this conflict is sometimes clothed in religion,” she said. “I think our faith groups can inspire us to do the right thing, to remedy the wrongs, to stand up for justice, to stand up for life.”\nAndrea Hodos, associate director of Los Angeles-based NewGround, another Muslim-Jewish partnership, said religion is “not the entire puzzle,” but is a piece of it and that helping people understand these things is important.\nSome, she said, are saying, \"'How can you just talk right now? People are dying.’” But “if we’re not doing our work to help people see one another, we’re all going to remain in our silos and it actually makes it more dangerous.”\nIt’s hard for some that the group isn’t taking certain positions, Hodos, who is Jewish, said, adding that political action isn’t its role.\n“We try to get people who have differences of opinion to be able to hear one another.\" That way, when they are doing advocacy, they can consider more perspectives and have compassion for their side and the other, she said.\nThe Kaufman Interfaith Institute held a meeting that highlighted the challenges ahead, said Fred Stella, who is a member of the organization’s advisory board.\n“People were looking for statements from us,” he said. “The question is, how do you respond to something like this without either offending one of the sides or simply mouthing virtually meaningless platitudes?”\nHis group has mostly focused on fighting antisemitic and anti-Muslim hate, which has risen during the war. “The only thing I think we in the interfaith community can do … is to continue to remind people of our shared humanity.”\nInterfaith advocates say they’ve also seen bonds — old and new — nurtured.\n“Even when people are in deep disagreement, there’s a great deal of goodwill and attempts to reach out,” Hodos said. “Not everyone can do it. Some of the groups have just been ... very quiet and I think people have, for now, walked away from the table.”\nOthers are newcomers. In Teaneck, New Jersey, two high school students and friends — Rawda Elbatrawish, who is Muslim, and Liora Pelavin, who is Jewish — said they organized events for conversations and education on the conflict.\nThey wanted attendees to get comfortable with being uncomfortable. “The whole point ... was to really understand the other perspective and why someone believes what they do,\" said Elbatrawish, who was born in Egypt.\nPelavin — who has relatives in the Israel Defense Forces and a rabbi mom who's been involved with human rights organizations — said some participants lauded the importance of interfaith events and the deeper connections of in-person conversations.\nShe and Elbatrawish \"come from different perspectives,” she said, but both want a cease-fire.\nAt the Sisterhood conference, Quaizar said communicating with Jewish members has helped her through her anger. It’s OK, she said “for me to grieve for my people as well as for people on the Jewish side.”\nBut she recalled struggling at one point before the conference with staying in such dialogue. She then attended a Sisterhood chapter meeting, feeling in turmoil. Everyone cried, she said. That gave her hope. “They were not crying for Jews or Muslims or Israelis or Palestinians; they were crying for people who have been suffering.”\nOn the conference sidelines, Quaizar told Seltzer: “I have a very unfiltered way of talking” but don’t mean to cause hurt.\nSeltzer reassured her: “You speak unfiltered, so that’s how we get to the core.”\nSeltzer found the event eye-opening.\n“A number of the speakers said you can hold two feelings in your heart at the same time,” she said. “I never knew I could do that.”\nContinuing to talk, she said, was crucial.\n“You want peace; you want your family; you want your home; you want your kids to grow up happy, just like me.”\nAt the end of the day, the two women tightly embraced.\n“People are angry and people are in pain and it goes around and around. ... We have to find a way to stop,” Seltzer said. “Or there will not be anything left for our children.”\n___\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.", "source_domain": "www.independent.co.uk", "text": null, "title": "In US, some Muslim-Jewish interfaith initiatives are strained by Israel-Hamas war", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/jewish-ap-people-muslim-israel-b2457627.html"}