{"authors": ["Charlie Moloney", "Tom Ambrose"], "date_download": "2024-02-05 15:31:42", "date_modify": "None", "date_publish": "2023-12-03 16:51:49", "description": "Ukraine says Russian troops committed war crime as video appears to show two men surrendering before being shot", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F03%2Frussia-ukraine-war-live-soldiers-attack-avdiivka-moscow-kyiv.json", "image_url": "https://i.guim.co.uk/img/media/840cc4fd844acdef1a8b63ffcbfff40d57f60216/0_283_4985_2993/master/4985.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=b048d1e0a53c574472d6b7aff4997eb4", "language": "en", "localpath": null, "maintext": "From 3 Dec 2023 12.09 CET Ukraine launches inquiry into 'execution' of captured soldiers Ukraine launched an inquiry on Sunday into what it said was an “execution” by Russian forces of two unarmed Ukrainian soldiers who had signalled their intention to surrender. The public prosecutor’s office in the eastern Ukrainian region of Donetsk said that according to “preliminary data” the images were filmed near the village of Stepove, close to Avdiivka, an eastern town where fighting is raging. “The video shows how a group of people in Russian uniforms shoot at close range two unarmed servicemen in the uniform of the Armed Forces of Ukraine who surrendered as prisoners,” the prosecutor’s office wrote. “Investigators and prosecutors have started an investigation. The killing of prisoners of war is a gross violation of the Geneva conventions and is classified as a serious international crime.”\nUpdated at 12.24 CET\n3 Dec 2023 16.46 CET Here is a summary of today's events so far: Ukraine said at least two people – a woman and a 78-year-old man - were killed and four injured by Russian shelling in the Kherson region on Sunday, while air defences downed 10 Russian drones overnight.\nUkraine and Poland will open an additional border crossing for empty trucks on Monday in order to open up a much-needed route for Kyiv, with some crossings blocked by weeks of protests by Polish drivers, Ukrainian authorities said on Sunday.\nUkraine launched an inquiry on Sunday into what it said was an “execution” by Russian forces of two unarmed Ukrainian soldiers who had signalled their intention to surrender.\nRussia launched 12 drones and a cruise missile at Ukraine overnight, with Ukraine’s air defence systems destroying 10 drones before they reached their targets, Ukraine’s air force said on Sunday.\nRussian forces have eased attacks on the beleaguered eastern Ukrainian town of Avdiivka and unofficial reports from the region suggested they had failed to capture the devastated town of Maryinka to the south-west.\n3 Dec 2023 16.37 CET At least two dead in Kherson after shelling Ukraine said at least two people were killed and four injured by Russian shelling in the Kherson region on Sunday, while air defences downed 10 Russian drones overnight. Kherson was recaptured by Ukrainian forces in November 2022 but has since faced relentless shelling by Russian forces from the opposite bank of the adjoining Dnipro river. Officials said a 78-year-old man was killed on Sunday morning when the village of Sadove was bombarded, while a woman in Kherson city was killed by shelling in a street. Sadove lies on the western bank of the Dnipro River, which marks the de-facto frontline between Ukrainian and Russian forces. Russia attacked several other locations in Ukraine overnight, using a total of 12 Shahed drones, Ukraine’s armed forces said in its daily briefing. It also said a guided Kh-59 missile failed to reach its target.\nUpdated at 16.39 CET\n3 Dec 2023 16.05 CET Ukraine’s military has shared footage that it claims shows its 14th Separate Regiment destroying Russian armoured vehicles, a tank repair base and a truck: Professional and effective work of our warriors from the 14th Separate Regiment.\nAs a result, occupier's armored vehicles, a tank repair base and a truck were destroyed. pic.twitter.com/iVC6ZLUUIw — Defense of Ukraine (@DefenceU) December 3, 2023\nUpdated at 16.19 CET\n3 Dec 2023 15.22 CET Ukraine’s first deputy defence minister, Oleksandr Pavliuk, has claimed Russia has lost 7,210 troops over the last week. Posting on Telegram, he added that the Russians had lost 534 units of weapons and military equipment.\nUpdated at 15.29 CET\n3 Dec 2023 14.51 CET A Ukrainian commander has said Russian infantry activity is rising on the nation’s south-eastern frontline. Genl Oleksandr Tarnavskyi said Russian forces had reduced the number of airstrikes against Ukraine but intensified infantry activity in the region. Posting on Telegram, Tarnavskyi said: “The activity of the occupiers’ infantry increased again in the operational zone of the Tavria Air Defense Forces – 55 combat clashes took place. “During the day, the enemy lost 440 personnel and nine units of military equipment. About a dozen occupiers surrendered. The activity of enemy aviation is low – five airstrikes were recorded during the day. At night, the enemy threw anti-aircraft missiles at Donetsk region. Tarnavskyi said Russian attacks had been repelled in multiple regions, and that in Zaporozhye, Russia unsuccessfully tried 12 times to restore positions Tarnavskyi claims they lost in the areas south of Robotyny and west of Verbovoy. He added: “At the same time, the defence forces of Ukraine continue to conduct an offensive operation in the Melitopol direction, inflict losses in manpower and equipment on the occupying forces, and exhaust the enemy along the entire frontline.”\nUpdated at 15.30 CET\n3 Dec 2023 14.17 CET Easing of offensive on Avdiivka shows Russian's 'running out of steam' The Ukrainian town of Avdiivka, under constant Russian fire, has experienced fewer ground attacks in the past 24 hours due to heavy Russian losses and harsh weather, the mayor said on Sunday. For nearly two months, Russia has been trying to seize Avdiivka, an industrial town near Donetsk that has become one of the most contended points on the frontline. Russian soldiers are now on the east, north and south of the town, which is largely in ruins. It is nearly surrounded but is still served by a tarmac road. Ukraine says its soldiers are holding firm and repelling the attacks. View image in fullscreen A local resident walks in front of damaged residential buildings in Avdiivka, Donetsk region, Ukraine. Photograph: Reuters “Over the past 24 hours, the number of (ground) attacks has decreased,” Vitaliy Barabash, the head of the city’s military administration, told the Ukrainian broadcaster Freedom. He said this was due to three factors – difficult “weather conditions”, “large losses in both (Russian) and manpower” and the fact that the Russian army was “running out of steam”. “There are fewer and fewer (Russian) people willing to go on assaults voluntarily, and there are more and more refuseniks,” Barabash said. AFP has been unable to independently confirm his comments.\nUpdated at 14.23 CET\n3 Dec 2023 13.43 CET Ukraine and Poland will open an additional border crossing for empty trucks on Monday in order to open up a much-needed route for Kyiv, with some crossings blocked by weeks of protests by Polish drivers, Ukrainian authorities said on Sunday. Those protests, over what Polish truckers see as unfair competition from their Ukrainian peers, started on 6 November, with four border crossings now under blockade, Reuters reported. Polish hauliers’ main demand is to stop Ukrainian truckers having permit-free access to the EU, something that Kyiv and Brussels say is impossible. Ukrainian border service said Uhryniv checkpoint, which is operating only for passenger cars and buses, would be opened from 1am (midnight GMT) on Monday for empty heavy vehicles with a total permissible weight of more than 7.5 metric tons. “The opening of Uhryniv is the first point on the list of measures implemented to unblock the border, reduce queues and increase the capacity of the Ukrainian-Polish border,” the border service said. Ukraine said last week it had agreed some measures with Poland that could ease the pressure at the blockaded border crossings, but that they had not discussed the main demands of the protests.\nUpdated at 13.54 CET\n3 Dec 2023 13.04 CET An elderly man was killed during Russian shelling of Ukraine’s southern region of Kherson on Sunday, regional officials said. “The occupants attacked the (Sadove) village. One of the hits was to a private garage, where a 78-year-old man was at the time. He died on the spot from the explosive injury,” the Kherson military administration said on the Telegram messaging app. Reuters could not independently confirm the report. Russian troops had abandoned Kherson and the western bank of the Dnipro River late last year, but now regularly shell those areas from positions on the eastern bank.\nUpdated at 13.12 CET\n3 Dec 2023 12.40 CET Russian forces hit a fortified commander post of Ukraine’s “East” air defence and alerting centre in the central city of Dnipro, the Russian defence ministry said on Sunday. It said it inflicted combined strikes by operational-tactical and army aviation, unmanned aerial vehicles, missile forces and artillery. Reuters was not immediately able to corroborate the battlefield reports from either side. Earlier on Sunday, Ukraine’s air force said Russia launched 12 drones and a cruise missile at Ukraine overnight, with air defence systems destroying 10 drones before they reached their targets. Russia’s defence ministry also said it its daily dispatch that it hit fuel depots in the areas of Myrhorod, Poltava region and the city of Khmelnytskyi, an ammunition arsenal in the Mykolaiv region as well as manpower and equipment in 107 various districts.\nUpdated at 12.48 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Russia-Ukraine war live: Ukraine launches inquiry into ‘execution’ of captured soldiers - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/03/russia-ukraine-war-live-soldiers-attack-avdiivka-moscow-kyiv"}