{"authors": [], "date_download": "2024-02-05 15:31:43", "date_modify": "None", "date_publish": "2023-12-03 08:21:31", "description": "Israel’s military has ordered more areas in and around Gaza’s second-largest city of Khan Younis to evacuate, as it shifts its offensive to the southern half of the territory where it says many Hamas leaders are hiding", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fgaza-ap-hamas-israel-khan-younis-b2457550.html.json", "image_url": "https://static.independent.co.uk/2023/12/03/08/Israel_Palestinians_59685.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael's military on Sunday ordered more areas in and around Gaza's second-largest city of Khan Younis to evacuate, as it shifted its offensive to the southern half of the territory where it says many Hamas leaders are hiding.\nHeavy bombardments were reported overnight and into Sunday in the area of Khan Younis and the southern city of Rafah, as well as parts of the north that had been the focus of Israel's blistering air and ground campaign.\nMany of the territory’s 2.3 million people are crammed in the south after Israeli forces ordered civilians to leave the north in the early days of the 2-month-old war.\nWith the resumption of fighting, hopes receded that another temporary truce could be negotiated. A weeklong cease-fire, which expired Friday, had facilitated the release of dozens of Gaza-held Israeli and foreign hostages and Palestinians imprisoned by Israel.\n“We will continue the war until we achieve all its goals, and it’s impossible to achieve those goals without the ground operation,” Prime Minister Benjamin Netanyahu said in an address Saturday night.\nOn Sunday, the Israeli military widened evacuation orders in and around Khan Younis, asking residents of at least five more areas and neighborhoods to leave for their safety.\nResidents said the Israeli military dropped leaflets ordering residents to move south to Rafah or to a coastal area in the southwest. “Khan Younis city is a dangerous combat zone,” the leaflets read.\nU.N. monitors said in a report issued before the latest evacuation orders that the areas residents were told to leave make up about one-quarter of the territory of Gaza. The report said that these areas were home to nearly 800,000 people before the war.\nAhead of a resumption of fighting, the United States, Israel’s closest ally, had warned Israel to avoid significant new mass displacement.\nThe Israeli military said Sunday that its fighter jets and helicopters “struck terror targets in the Gaza Strip, including terror tunnel shafts, command centers and weapons storage facilities” overnight, while a drone killed five Hamas fighters.\nIn northern Gaza, rescue teams with little equipment scrambled Sunday to dig through the rubble of buildings in the Jabaliya refugee camp and other neighborhoods in Gaza City in search for potential survivors and dead bodies.\n“They strike everywhere,” said Amal Radwan, a woman sheltering in Jabaliya, an urban refugee camp. “There is the non-stop sound of explosions around us.”\nMohamed Abu Abed, who lives in the Sheikh Radwan neighborhood in Gaza City, also said there were relentless airstrikes and artillery shelling in his neighborhood and surrounding areas.\n“The situation here is imaginable,” he said. “Death is everywhere. One can die in a flash.”\nThe Health Ministry in Hamas-ruled Gaza said Saturday that the overall death toll in the strip since the Oct. 7 start of the war had surpassed 15,200, a sharp jump from the previous count of more than 13,300 on Nov. 20. The ministry does not differentiate between civilian and combatant deaths, but it said 70% of the dead were women and children. It said more than 40,000 people had been wounded since the war began.\nU.S. appeals to protect civilians came after an offensive in the first weeks of the war devastated large areas of northern Gaza. Much of Gaza’s population is packed into the territory’s southern half. The territory itself, bordering Israel and Egypt to the south, is sealed, leaving residents with the only option of moving around within Gaza to avoid the bombings.\n“Too many innocent Palestinians have been killed. Frankly, the scale of civilian suffering and the images and videos coming from Gaza are devastating,” U.S. Vice President Kamala Harris told reporters Saturday during the COP28 climate conference in Dubai.\nMark Regev, a senior adviser to Netanyahu, said Israel was making “maximum effort” to protect civilians and the military has used leaflets, phone calls, and radio and TV broadcasts to urge Gazans to move from specific areas. He added that Israel is considering creating a security buffer zone that would not allow Gazans direct access to the border fence on foot.\nIsrael says it targets Hamas operatives and blames civilian casualties on the militants, accusing them of operating in residential neighborhoods. It claims to have killed thousands of militants, without providing evidence. Israel says at least 78 of its soldiers have been killed in the offensive in northern Gaza.\nBombardments on Saturday destroyed a block of about 50 residential buildings in the Shijaiyah neighborhood of Gaza City and a six-story building in the urban refugee camp of Jabaliya on the northern edge of the city, said the U.N. Office for the Coordination of Humanitarian Affairs.\nMore than 60 people were killed in the Shijaiyah strikes and more than 300 buried under the rubble, the monitors said, citing the Palestinian Red Crescent.\nMahmoud Bassal, a spokesman for Gaza's Civil Defense, said rescuers lack bulldozers and other equipment to reach those buried under the rubble, confirming the Red Crescent estimate of about 300 people missing. He said the block had housed over 1,000 people.\n“Retrieving the martyrs is extremely difficult,” he said in video comments from the site of the attack.\nMeanwhile, Harris told Egyptian President Abdel Fattah el-Sissi in a meeting that “under no circumstances” would the U.S. permit the forced relocation of Palestinians from Gaza or the West Bank, an ongoing siege of Gaza or the redrawing of its borders, according to a U.S. summary.\nThe war was sparked by an Oct. 7 attack by Hamas and other militants that killed about 1,200 people, mostly civilians, in southern Israel. Around 240 people were taken captive.\nThe renewed hostilities have heightened concerns for 137 hostages, who the Israeli military says are still being held after 105 were freed during the recent truce. Israel freed 240 Palestinians during the truce. Most of those released by both sides were women and children.\n___\nMagdy reported from Cairo and Becatoros from Athens. Tia Goldenberg in Tel Aviv contributed.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel widens evacuation orders as it shifts its offensive to southern Gaza amid heavy bombardments", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/gaza-ap-hamas-israel-khan-younis-b2457550.html"}