{"authors": ["Peter Allan", "Peter Allan In Paris", "Sukhmani Sethi", "Perkin Amalaraj"], "date_download": "2024-02-05 15:31:45", "date_modify": "None", "date_publish": "2023-12-03 18:49:20", "description": "The deadly attack during a busy weekend at around 9pm (8pm in the UK) near the Eiffel Tower came as France is at its highest alert level, as tension rise amid the war between Israel and Hamas .", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12820403%2Ffrench-terror-plot-stabbed-death-eiffel-tower.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/03/10/78519933-0-image-m-33_1701598328584.jpg", "language": "en", "localpath": null, "maintext": "French officials last night launched a probe into a 'terror plot' after a convicted Iranian Islamist allegedly stabbed a German tourist to death and wounded two others including a Briton.\nArmand Rajabpour-Miyandoab, 26, was arrested at the scene on Saturday following a violent rampage with a knife and hammer near the Eiffel Tower.\nHe viciously attacked three men, including a 24-year-old German-Filipino nurse who suffered a fatal heart attack following the assault, which took place in front of his wife and a female friend.\nHe then allegedly targeted a 66-year-old British tourist in the foyer of a block of flats, plunging a knife into his right eye, before hitting a 60-year-old French father around the head with a hammer as he was out walking with his wife and child.\nTerrorism prosecutors said on Sunday they were investigating the attacker, who is suspected of murder and attempted murder, 'in connection with a terrorist plot'.\nThree people 'close to' Rajabpour-Miyandoab were being held in custody yesterday afternoon following the incident by Bir Hakeim bridge over the River Seine, prosecutors said.\nArmand Rajabpour-Miyandoab, 26, (pictured) was released from prison in 2020, and left to live at home with his parents while undergoing 'psychiatric and neurological treatment'\nA French national born to Iranian parents and known radical Islamist, he shouted 'Allahu Akbar' - Arabic for 'God is greatest' - and professed his support for ISIS as he embarked on his vicious attack, according to Interior Minister Gerald Darmanin.\nThe 26-year-old suspect had previously been sentenced in 2016 to four years in prison for a failed attack in the Paris business district of La Defense, and Darmanin confirmed the suspect had officially been on an 'S-list', for surveillance.\nThe deadly attack during a busy weekend at around 9pm (8pm in the UK) near the Eiffel Tower came as France is at its highest alert level, as tension rise amid the war between Israel and Hamas.\nRajabpour-Miyandoab was let out of prison early in 2020, and left to live at home with his parents, in the Essonne region south of Paris, while undergoing 'psychiatric and neurological treatment'.\nHe told police he could not stand Muslims being killed in 'Afghanistan and Palestine' and accused France of being 'an accomplice to what Israel is doing' in the Gaza Strip, Darmanin added.\nInvestigators will scrutinise his medical history, a security source said, saying the attacker was 'very unstable and easily influenced'.\nRajabpour-Miyandoab was 'being monitored in a way that did not mean he was being hospitalised, and was supposed to follow a course of treatment' for his mental health issues, said Aurélien Rousseau, the French health minister.\nArmand Rajabpour-Miyandoab shouted 'Allahu Akbar' as he was taken in by Paris police, who immobilised him with a stun gun\n'As often in these cases, there's a mixture of an ideology, an easily influenced person and, unfortunately, psychiatry,' he added.\nGerman Chancellor Olaf Scholz wrote on X that he was 'devastated' by the attack, saying that 'our thoughts are with the wounded, their families and friends'.\nHis Interior Minister Nancy Faeser had earlier warned that 'the war in Gaza after Hamas' terrorist act (of October 7) has worsened the threat,' saying that 'the threat of Islamist terrorism is acute and serious'.\nPolice and security sources confirmed the attacker had claimed responsibility in a social media video as he struck, speaking about 'current events, the government (and) the murder of innocent Muslims'.\nThe 24-year-old German-Filipino nurse was killed as a taxi driver intervened to keep the attacker away from his wife.\nPatrick Pelloux, an emergency doctor on duty at the time of the attack, said the couple were both nurses, adding that the woman was severely shocked but unhurt.\nVideo of the suspect's arrest shows him slowly backing away from several French police officers while carrying what appears to be a hammer.\nTwo officers stride towards him as he backs away on the corner of a street in Paris.\nFollowing a chase, and the intervention of a taxi driver, Rajabpour-Miyandoab was finally disabled by police using tasers.\nRousseau told broadcaster France 3 that the wounded victims suffered only 'superficial (physical) traumas, but of course psychological traumas that will be enormous'.\nOn Sunday both surviving victims were still undergoing medical care - one at the Georges Pompidou hospital in Paris, the other at the city's Cochin hospital. Their condition was said to be 'stable'.\nProsecutors announced a press conference for 7:30 pm on Sunday to give updates on the investigation.\nFrench gendarmes patrol the Trocadero plaza near the Eiffel Tower following the bloodbath on Saturday\nFrench police attend the scene following the terrorist knife attack near the Bir Hakeim bridge and Quai de Grenelle\nA forensic police officer works at the scene on Saturday night following the terror attack in the French capital\nRajabpour-Miyandoab converted to Islam in 2015 after being radicalised online by an ISIS supporter, according to prosecution documents.\nRajabpour-Miyandoab was well known for forging online links with other terrorists including Larossi Aballa, who went on to stab two police officers to death in Magnanville in June 2016.\nAnother Facebook friend was Adel Kermiche, one of the perpetrators of the stabbing to death of a Catholic priest in Saint-Étienne du Rouvray in the same year.\nMany of those linked with such crimes were, like Rajabpour-Miyandoab, on an S-File, which means they are officially under surveillance.\nRajabpour-Miyandoab later claimed to have completed a 'deradicalization programme', claiming he had lost interest in terrorism.\nIn court in 2018, he said: 'Islamism was ruining my life,' while claiming he had taken to drinking beer and eating pork - activities which are barred to practising Muslims.\nBut online activity showed that Rajabpour-Miyandoab was still researching how to make phosphorus bombs, and posted a video of himself disguised, and making political statements.\nThe attacker, who has been named locally as Armand R., shouted 'Allahu Akbar' as he was taken in by Paris police, who immobilised him with a stun gun\nThe deadly attack in central Paris during a busy weekend night came with the country on its highest alert for attack\nThe attack has rocked France, which has seen tensions rise amid the Israel-Hamas conflict\nTensions have risen in France, home to large Jewish and Muslim populations, following Hamas's attack on Israel on October 7 and Israel's bombardment of the Gaza Strip\nThe deadly attack in central Paris during a busy weekend night came with the country on its highest alert for attacks, as tensions rise against the background of the war between Israel and Hamas.\nThe second victim of the attack was British, and was out walking with his wife when Armand R. attacked him from behind.\n'The family were on the Avenue President Kennedy when they were set upon,' said an investigating source, who added: 'A hammer was used to hit the man over the head.'\nThe Englishman was rushed to hospital, where his condition was later described as 'stable'. A third victim was also badly hurt in a hammer attack, said the source.\nThe UK's Foreign Office said on Sunday: 'We are supporting a British man who was injured in Paris, and are in contact with the local authorities.'\nThe area by Bir Hakeim bridge, usually thronging with tourists and locals, was cordoned off by police and bright with the flashing lights of security forces and emergency services.\nA taxi driver who witnessed the scene intervened, Darmanin said.\n'He had threatened them very violently... he will now have to answer for his actions before justice,' Darmanin said.\nThe attack has rocked France, which has seen tensions rise amid the Israel-Hamas conflict.\nPresident Emmanuel Macron said he was sending his condolences to the family of a German killed in the 'terrorist attack'.\nA police source said that the attacker was known for psychiatric disorders and had said he could not stand Muslims being killed in the world. Pictured: French police secures the access to the Bir-Hakeim bridge\nA man has been stabbed to death while a British tourist is reportedly among two others badly injured after a knifeman screaming 'Allahu Akbar' launched a frenzied attack in Paris. Pictured: Police secures the access to the Bir-Hakeim bridge near the Eiffel Tower\nA police source said that the attacker was known for psychiatric disorders and had said he could not stand Muslims being killed in the world\nMacron, writing on X, thanked security forces for their quick arrest of the suspected attacker and said justice should be served 'in the name of the French people'.\n'We will not give in to terrorism,' Prime Minister Elisabeth Borne wrote on X after the attack.\n'Paris is in mourning after this terrible attack,' Transport Minister Clement Beaune wrote on X.\nJoseph S., a 37-year-old supermarket manager who asked not to give his last name, witnessed the scene as he sat in a bar, and said he heard screams and people shouting 'help, help' as they ran.\nHe said a man wielding an object attacked a man who had fallen down, and within 10 minutes the police arrived.\nOne person died and another was injured, Interior Minister Gerald Darmanin said on social media platform X\nPolice officers stand guard. Officers said there was no early indication as to the motive of the stabbing\nFrance has suffered several attacks by Islamist extremists, including the November 2015 suicide and gun attacks in Paris claimed by the Islamic State group in which 130 people were killed.\nThere had been a relative lull in recent years, even as officials have warned that the threat remains.\nBut tensions have risen in France, home to large Jewish and Muslim populations, following Hamas's attack on Israel on October 7 and Israel's bombardment of the Gaza Strip.\nSecurity in Paris is also under particular scrutiny as it gears up to host the 2024 Summer Olympic Games.\nIn October, teacher Dominique Bernard was killed in the northern French town of Arras by a young radicalised Islamist from Russia's Caucasus region.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "French officials launch probe into 'terror plot' after convicted Iranian Islamist stabbed German tourist to death and wounded two others - including Briton knifed in the eye - during horror Paris ramp", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12820403/french-terror-plot-stabbed-death-eiffel-tower.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}