{"authors": ["Summer Goodkind"], "date_download": "2024-02-05 15:31:47", "date_modify": "None", "date_publish": "2023-12-03 08:55:19", "description": "The Israeli army said it had conducted hundreds of bombardments since the ceasefire collapsed on Friday, while Hamas announced 'rocket barrages' against multiple Israeli towns and cities.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12819609%2FIsrael-launches-400-strikes-48-hours-Hamas-broke-fragile-truce-Netanyahu-aide-reveals-plans-create-buffer-zone-inside-Gaza-stop-terrorists-launching-October-7-style-attacks-future.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/03/08/78518529-0-image-m-33_1701593681560.jpg", "language": "en", "localpath": null, "maintext": "More than 400 strikes have been carried out by Israel in Gaza in the past 48 hours after Hamas broke the fragile week-long truce.\nThe Israeli army said it had conducted hundreds of bombardments since the ceasefire collapsed on Friday, while Hamas announced 'rocket barrages' against multiple Israeli towns and cities including Tel Aviv.\nThe Israel Defense Forces said that fighter jets carried out extensive strikes on the southern city of Khan Younis, where Hamas leaders are thought to be stationed.\nElsewhere in Gaza, Israeli strikes hit the Nuseirat refugee camp late Saturday, killing at least 13 people, according to the official Palestinian news agency Wafa.\nA week-long truce, brokered with the help of Qatar and backed by Egypt and the United States, led to the release of 80 Israeli hostages in exchange for 240 Palestinian prisoners.\nBut that truce collapsed with both sides blaming each other for violating its conditions.\nMore than 400 strikes have been carried out by Israel in Gaza in the past 48 hours after Hamas broke the fragile week-long truce\nThe Israeli army said it had conducted hundreds of bombardments since the ceasefire collapsed on Friday, while Hamas announced 'rocket barrages' against multiple Israeli towns and cities including Tel Aviv\nThe Israel Defense Forces said that fighter jets carried out extensive strikes on the southern city of Khan Younis, where Hamas leaders are thought to be stationed\nIsrael said that Hamas had tried to fire a rocket before the ceasefire ended, and that it had failed to produce a list of further hostages for release.\nIsraeli negotiators left Doha on Saturday after reaching a dead end in talks aimed at securing a fresh pause in hostilities.\nThe Israeli army on Saturday said 137 hostages were still being held in Gaza.\nIsrael's Defence Minister Yoav Gallant told reporters on Saturday that fresh military action was needed to 'create the conditions that push (Hamas) to pay a heavy price, and that is in the release of hostages'.\nMeanwhile, Saleh al Arouri, the deputy Hamas chief, told Al Jazeera that there will be no further exchanges of Israeli hostages and Palestinian prisoners until 'the war on Gaza is over'.\nHe said the remaining Israeli soldiers are civilian men who served in the military.\nIt comes as a senior aide to Israeli Prime Minister Benjamin Netanyahu revealed Israel's plans to create a 'buffer' zone within Gaza to stop Hamas from being able launch any attacks like October 7 again.\nMark Regev, a senior adviser to Netanyahu, said Jerusalem needs a 'security envelope' around the coastal strip to prevent Gazans accessing the border fence on foot.\nMr Netanyahu's government has reportedly already informed several Arab neighbours of its desire to demarcate a section on the Palestinian side of the border as part of proposals for the post-war future of the enclave.\nSmoke billowing over the Palestinian enclave during Israeli bombardment on Saturday\nIsraeli soldiers with their armoured fighting vehicles gather at a position near the border with the Gaza Strip, in southern Israel, 2 December 2023\nPalestinians flee from east to west of Khan Younis, Gaza Strip, during the ongoing Israeli bombardment, Saturday, December 2, 2023\nAsked whether Israel was seeking a buffer zone between itself and Gaza to prevent future attacks, senior adviser Regev told reporters: 'Israel will have to have a security envelope. We can never again allow terrorists to cross the border and butcher our people the way they did on October 7.'\n'If you ask me about a buffer zone, let me be clear; you won't have a situation in the future where you can have Hamas terrorists on the border, directly on the border, positioned just to cross over and kill our people again,' Regev said.\n'That is not Israel taking territory from Gaza,' said Regev. 'On the contrary, that is creating security zones where you have a special situation on the ground which limits the ability of people to enter Israel to kill our people. It's common sense.'\nHowever, the proposals received a lukewarm reception in Washington, where John Kirby, the White House's leading spokesman on the conflict, said: 'We don't support any reduction of the geographic limits of Gaza.'\nKamala Harris, the US vice president, sketched out the US's own vision for a post-war Gaza. She said: 'We want to see a unified Gaza and West Bank under the Palestinian Authority.'\nHamas fighters broke through Gaza's militarised border into Israel on October 7, killed about 1,200 people, mostly civilians, and took around 240 Israelis and foreigners hostage.\nIsraeli hostages released from Gaza spoke publicly on Saturday for the first time urging their government to secure the release of the remaining captives held in the war-torn Palestinian territory.\n'The moral obligation of this government is to bring them home immediately, without hesitation,' said Yocheved Lifschitz, 85, who was released by Hamas in October, before the truce deal.\nMeanwhile, United States Vice President Kamala Harris sharply rebuked on Saturday the rising civilian toll in Israel's eight-week war.\n'Too many innocent Palestinians have been killed,' she told reporters at UN climate talks in Dubai.\n'Frankly, the scale of civilian suffering and the images and videos coming from Gaza are devastating.'\nAccording to the United Nations, an estimated 1.7 million people in Gaza - more than two-thirds of the population - have been displaced by eight weeks of war.\nGazans are short of food, water and other essentials, and many homes have been destroyed. UN agencies have declared a humanitarian catastrophe, although some aid trucks did arrive Saturday.\nSpeaking in Tel Aviv on Saturday, Netanyahu said the war would continue 'until we achieve all its aims' including eliminating the Islamist movement.\n'Our soldiers prepared during the days of truce for total victory against Hamas,' he said at his first press conference since fighting resumed.\n'There is no way to win except by continuing the ground campaign,' Netanyahu told reporters, underscoring that this would be done while 'observing international law'.\nIsrael's air, naval and ground forces have attacked more than 400 targets in Gaza since the end of the ceasefire, the army said on Saturday.\nThe figure is roughly in line with the daily average number of strikes prior to the pause, according to military figures released previously.\nWarplanes hit 'more than 50 targets in an extensive attack in the Khan Yunis area' of southern Gaza, according to the military.\nSome 1.7mn Palestinians have been displaced from their homes, the UN said late in November\nResidential buildings lie in ruin following Israeli strikes at the Qatari-funded Hamad City in Khan Younis in the southern Gaza Strip December 2, 2023\nA view of damage in the street between Rafah and Khan Yunis cities due to Israeli attacks after the end of the humanitarian pause in Khan Yunis, Gaza on December 2, 2023\nSeparately, members of an Israeli armoured brigade 'eliminated terrorist squads and directed fire against terrorist targets in the north of the Gaza Strip', the military said.\nIn the occupied West Bank, the Israeli army said troops shot dead a Palestinian at a checkpoint near the city of Nablus after he 'drew a knife and started to advance towards them.'\nSyria said Israel carried out air strikes near Damascus on Saturday.\nIran's Revolutionary Guard accused Israel of killing two of its members in Syria who it said had been on an 'advisory mission'.\nHamas in October last year said it had restored relations with Syria's government.\nIsraeli attacks on targets in Syria have intensified since the Israel-Hamas war began.\nA multiphase strategy is expected to see Israeli forces sweep south from their forward bases around Gaza City in an effort to kill Hamas' top officials, according to sources familiar with Israeli operations.\nIsrael will look to target Hamas' three top leaders in a bid to displace Hamas from its de facto governance of the Gaza Strip.\nYahya Sinwar, Mohammed Deif and Marwan Issa were identified as top targets for Israel by sources speaking to the FT. Between them, they form a secretive triumvirate responsible for planning and executing the October 7 assault into Israel.\nSInwar, 61, is suspected to be based in a Hamas command and control centre under the Al Shifa hospital, which Israel has been steadily navigating since its raid last month.\nAs the Head of Hamas in Gaza, he is the second most powerful member of Hamas after Ismail Haniyeh. The latter now lives in Doha, Qatar and has been suggested as another main target for assassination, as reported in October.\nSinwar is believed to be a key planner of the October 7 attacks that left some 1,200 Israelis dead. He set up Hamas' armed outfit, the IQB, but the division has since been taken over by chiefs Mohammed Deif and Marwan Issa.\nThe whereabouts of Deif, 58, are unknown, though he is most likely in Gaza in the maze of tunnels under the enclave. An Israeli security source said in October he was directly involved in the planning and operational aspects of the attack.\nPictured: Yahya Sinwar (left) and Mohammed Deif (right)\nIsraeli soldiers operate in the Gaza Strip in this handout picture released on December 2, 2023\nIsraeli soldiers operate in the Gaza Strip, after a temporary truce expired between Israel and the Palestinian Islamist group Hamas, in this handout picture released on December 2, 2023\n'There are two brains, but there is one mastermind,' the source said, referring to Sinwar and Deif without elaborating.\nMarwan Issa, 58, is the deputy leader of Hamas' IQB military wing.\nTwo military experts told Reuters that killing Sinwar, Deif and Issa would allow Israel to claim an important symbolic victory. But achieving even that goal would be long and costly, with no guarantee of success.\nMeanwhile, a total of 110 hostages taken prisoner during the October 7 attacks on Israel were released during the truce after extensive negotiations.\nSeventy-eight of them were Israeli woman and children, freed as part of a deal between Israel and Gaza mediated by Qatar.\nThree Russian-Israelis, two women and one man were also released outside of the deal. The freeing of Yelena Trupanov, and her mother Irena Tati, were understood to be part of a gesture to Russian President Vladimir Putin from Hamas.\nUnder the main deal, 180 Palestinians were also released from Israeli jails.\nThe Palestinian Prisoners Society said that as of November 22, two days before the truce began, 7,200 prisoners were being held by Israel, among them 88 women and 250 children 17 and under.\nMost on Israel's list of prisoners to be released were from the Israeli-occupied West Bank and Jerusalem and were held for incidents such as attempted stabbings, hurling stones at Israeli soldiers, making explosives, damaging property and having contacts with hostile organisations. None are accused of murder.\nMany were held under administrative detention, meaning they were held without trial.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel launches 400 strikes in the 48 hours since Hamas broke fragile truce - as Netanyahu aide reveals plans to create 'buffer zone' inside Gaza to stop terrorists from launching October 7-style atta", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12819609/Israel-launches-400-strikes-48-hours-Hamas-broke-fragile-truce-Netanyahu-aide-reveals-plans-create-buffer-zone-inside-Gaza-stop-terrorists-launching-October-7-style-attacks-future.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}