{"authors": ["Chiara Fiorillo", "Image", "Ismael Mohamad Upi Rex Shutterstock", "Ap", "Getty Images"], "date_download": "2024-02-05 15:31:48", "date_modify": "None", "date_publish": "2023-12-03 20:56:02", "description": "The Israeli military said its ground offensive had expanded to every part of Gaza as it ordered more evacuations in the crowded south, where people escaped in the early days of the war", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fbreaking-israel-hamas-war-ground-31588830.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31588834.ece/ALTERNATES/s1200/0_ISRAEL-PALESTINIAN-CONFLICT.jpg", "language": "en", "localpath": null, "maintext": "The Israeli military said its ground offensive had expanded to every part of Gaza as it ordered more evacuations in the crowded south, where people escaped in the early days of the war\nIsraeli ground forces are pushing into southern Gaza after expanding their operations following the end of a temporary ceasefire.\nReports from Israeli army radio confirmed a ground operation has now begun in the north of Khan Younis. The head of the Israel Defense Forces (IDF) said troops were fighting \"strongly and thoroughly\" in south Gaza.\nHeavy bombardment followed evacuation orders, and Palestinians said they were running out of places to go in the sealed-off territory bordering Israel and Egypt. Many of Gaza's 2.3 million people are crammed into the south after Israel ordered civilians to leave the north in the early days of the war.\nImage: Ismael Mohamad/UPI/REX/Shutterstock) Ismael Mohamad/UPI/REX/Shutterstock)\nThe United Nations estimates that 1.8 million Gazans have been displaced. Nearly 958,000 of them are in 99 UN facilities in the south, said Juliette Toma, director of communications at the UN agency for Palestinian refugees. After dark, gunfire and shelling were heard in the central town of Deir al-Balah as flares lit the sky. In Gaza's second-largest city of Khan Younis, Israeli drones buzzed overhead. UN human rights chief Volker Türk urged an end to the war, saying civilian suffering was \"too much to bear\".\nThe Health Ministry in Gaza said the death toll there since October 7 has surpassed 15,500, with more than 41,000 wounded. It added 70 per cent of the dead were women and children. A Health Ministry spokesman said that hundreds had been killed or wounded since a weeklong cease-fire ended Friday. \"The majority of victims are still under the rubble,\" Ashraf al-Qidra said.\nImage: AP) AP)\nIsrael's military widened evacuation orders in and around Khan Younis in the south, telling residents of at least five more areas to leave. Residents said the military dropped leaflets calling Khan Younis \"a dangerous combat zone\" and ordering them to move to the border city of Rafah or a coastal area in the southwest.\nBut Halima Abdel-Rahman, a widow and mother of four, said she won’t heed such orders anymore. She fled her home in October to an area outside Khan Younis, where she stays with relatives.\n“The occupation tells you to go to this area, then they bomb it,” she said by phone. \"The reality is that no place is safe in Gaza. They kill people in the north. They kill people in the south.\"\nImage: Getty Images) Getty Images)\nA spokesman for Unicef said children badly injured have turned a hospital in Gaza into a \"death zone\". James Elder, spokesman for Unicef, the United Nations Children’s Fund, described conditions inside Nasser Medical Hospital in Khan Younis.\nHe said: \"Everywhere you turn to, there are children with third-degree burns, shrapnel wounds, brain injuries and broken bones. Mothers crying over children who look as if they are hours away from death. It seems like a death zone now.\" Mr Elder added: \"I feel like I’m almost failing in my ability to convey the endless killing of children here.\"", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel-Hamas war: Ground operation under way as IDF forces push into southern Gaza", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/breaking-israel-hamas-war-ground-31588830"}