{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Hamish Mackay", "Harry Taylor", "Kevin Rawlinson"], "date_download": "2024-02-05 15:31:51", "date_modify": "None", "date_publish": "2023-12-02 05:16:58", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fdec%2F01%2Fisrael-hamas-war-live-updates-ceasefire-latest-news-extension-israel-frees-30-palestinians-hostages-released-news.json", "image_url": "https://i.guim.co.uk/img/media/6029294d2d83ab9cf85e4b9a7816d8cb2c604a39/0_160_6122_3675/master/6122.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c79e14f8ed6647471d6f8d6275a78f10", "language": "en", "localpath": null, "maintext": "From 2 Dec 2023 02.57 CET 184 killed since resumption of fighting, Gaza authorities say Gaza health officials say Israeli air strikes have killed 184 people and wounded at least 589 others since the truce expired on Friday morning. More than 20 houses had been hit, Reuters reports the officials as saying on Friday evening. The Gaza health ministry said earlier that most of those killed were children and women. The figures cannot be independently verified. Israel’s bombardment on Friday after the collapse of the seven-day ceasefire was most intense in the southern areas of Khan Younis and Rafah, medics and witnesses said. Hundreds of thousands of Palestinians have been sheltering there because of fighting in the north. Houses in central and northern areas were also hit.\n2 Dec 2023 06.16 CET Closing summary It’s just passed 7.15am in Gaza City and Tel Aviv and we’re closing this blog now. Our live coverage continues here. Thanks for reading. Here’s a look at the latest major developments: Israel’s military pounded the Gaza Strip on Friday after the end of the week-long truce. Israel launched more than 200 strikes across the territory over the day, including in the densely populated south, where many civilians have fled. The bombardment was most intense in the southern areas of Khan Younis and Rafah, medics and witnesses were reported as saying. Gaza health officials the strikes killed 184 people and wounded at least 589 others, with most of the dead being children and women. Israel has signalled it is preparing to launch a ground assault into southern Gaza in a significant escalation of the war.\nIsraeli prime minister Benjamin Netanyahu appeared to brush aside US calls to pursue a more restrained military campaign as the resumption of hostilities began. Netanyahu said his country’s forces were now “charging forward” and that the plan was for a total military victory.\nIsraeli shelling killed three people in southern Lebanon on Friday , Lebanon’s state news agency reported, as the end of the truce prompted a resumption of hostilities at the frontier. The Iran-backed Lebanese group Hezbollah, a Hamas ally, later said two of those killed were its fighters. It also said it had carried out several attacks on Israeli military positions at the border in support Palestinians in Gaza. The Israeli army said its artillery struck sources of fire from Lebanon and that air defences had intercepted two launches. The army also said it struck a “terrorist cell”.\nThe head of the UN children’s agency has warned of a “humanitarian catastrophe” if Israeli bombings in Gaza return to the intensity of before the Israel-Hamas truce. Catherine Russell urged “all parties to ensure that children are protected and assisted” and called for a “lasting humanitarian ceasefire”.\nSyrian air defences repelled an Israeli rocket attack against targets near Damascus early on Saturday, Syrian state media reported, saying the defences shot down most of the missiles. It said there were no casualties and “only material damages”, and that the strikes came from the direction of the occupied Golan Heights.\nIsrael’s military has set out its plan for the “next stage of the war”: dividing Gaza into dozens of numbered “evacuation areas”, a core part of the military’s plan to gradually take control of the southern part of the strip. Under the plan, people in certain numbered districts of Gaza will be told to evacuate before bombing begins, although how much time they will get is not clear. Leaflets were dropped in parts of Khan Younis, where Israel believes Hamas’s leadership is based, warning citizens to evacuate further south to Rafah.\nHumanitarian groups said the Israeli warnings would be insufficient because civilians in Gaza were running out of places to evacuate to . Palestinians risked being forced completely out of the territory, they said. Homes in Khan Younis were among the targets struck on Friday hours after the truce expired, and residents were given little, if any, time to flee.\nNo humanitarian aid has been allowed into Gaza on Friday, including fuel, the head of the UN agency for Palestinian refugees (UNRWA) has said. The Palestinian Red Crescent Society said Israeli forces told organisations operating at the Rafah crossing that the entry of aid trucks was prohibited “until further notice”.\nWhite House national security spokesperson John Kirby, citing reports from Israel, said Israel had agreed to resume letting truck deliveries through at the urging of the US. But he said truck deliveries would likely be reduced to dozens a day rather than the hundreds of trucks that were getting into Gaza daily during the seven-day pause in fighting that ended on Friday morning.\nThe families of hostages being held in Gaza have said they are terrified about the safety of their loved ones after the end of the ceasefire. The relatives of some of the remaining 126 Israeli hostages have said they are grappling with feeling joy for those who have been released, while being worried sick for loved ones left behind.\nThe UN said it deeply regretted the resumption of hostilities in the Gaza Strip, calling the situation “catastrophic”. The body also said it was concerned by suggestions Israel could seek to expand its military offensive inside the Palestinian territory. The UN’s human rights chief, Volker Türk, urged efforts to be redoubled to try to bring about a ceasefire on humanitarian and human rights grounds.\nIsrael has said it will not renew a visa for a top UN official who helps oversee humanitarian aid for the Gaza Strip and occupied West Bank, a UN spokesperson said. Israel’s foreign ministry last month accused Lynn Hastings, the UN’s deputy special coordinator for the Middle East peace process and UN humanitarian coordinator for the occupied Palestinian territory, of failing to be impartial and objective.\nBritish prime minister Rishi Sunak has described the breakdown of the truce as “deeply disappointing” and issued renewed calls for “sustained humanitarian pauses” in Gaza as he held talks with Israel’s president and the leaders of Egypt, Qatar and Jordan on the sidelines of the Cop28 summit on Friday.\nDoctors Without Borders/Médecins Sans Frontières (MSF) has blamed the Israeli military for what it said was a deliberate attack last month on a convoy that was trying to evacuate people out of Gaza City. In a report that cites several witnesses from the organisation, MSF said “all elements point to the responsibility of the Israeli army for this attack”.\nThe Biden administration has informed Israel that Washington will impose visa bans in the next few weeks on Israeli extremist settlers engaged in violence against Palestinian civilians in the occupied West Bank, a senior state department official said, in the first sign the US is prepared to publicly distance itself from some of the Israeli government’s actions.\nA protester with a Palestinian flag self-immolated on Friday outside the Israeli consulate in Atlanta, Georgia, injuring a security guard who attempted to intervene, authorities said. The protester was reported to be in critical condition.\nUpdated at 09.34 CET\n2 Dec 2023 05.46 CET A protester in the US is in critical condition after setting themself on fire outside the Israeli consulate in Atlanta, Georgia, Associated Press reports in an update. A security guard who tried to intervene was also injured. A Palestinian flag found at the scene was part of Friday’s protest, Atlanta police chief Darin Schierbaum said. Investigators did not believe there was any connection to terrorism and none of the consular staff was ever in danger, he said. Authorities did not release the protester’s name, age or gender. The person was in critical condition with burn injuries to the body. Fire officials say the guard who tried to stop the person was burned on his wrist and leg.\n2 Dec 2023 04.57 CET Former California governor Arnold Schwarzenegger has met relatives of three people seized by Hamas in Israel and now held in Gaza, lending his celebrity to support those whose loved ones are still unaccounted for following the 7 October attack, Reuters reports. Schwarzenegger gave bronze eagle sculptures to his visitors at a video production company in Santa Monica, just west of Los Angeles, on Friday. In turn they presented Schwarzenegger with “Bring Them Home” dog tags. Declaring himself “a big friend of the Jewish people and Israel”, Schwarzenegger said he wanted to amplify the message not to abandon those who remained captive. View image in fullscreen Schwarzenegger in a file photo. Photograph: Chris Pizzello/Invision/AP Israel said on Friday that 136 hostages remained in Gaza. Among those meeting the Terminator star was Bar Rudaeff, 27, whose father Lior Rudaeff, 61, was taken from the Kibbutz Nir Yitzchak. He said Schwarzenegger was one of his father’s favourite actors. I remember watching a Terminator movie with him in the living room. And I know that when he comes back, it will put a smile on his face. Schwarzenegger also met Jacob Bohbot, 36, whose brother Elkana Bohbot, 34, was taken from the Supernova music festival in Israel near the border with Gaza, and with Ella Shani, 14, whose cousin Amit Shani, 16, was kidnapped in the attack on Kibbutz Be’eri, taken to the Gaza Strip and released on Wednesday. Ella’s father, Itzik Kozin, was killed in the kibbutz attack.\nUpdated at 05.01 CET\n2 Dec 2023 04.29 CET Unicef chief warns of 'humanitarian catastrophe' if fighting intensifies The head of the UN children’s agency has warned of a “humanitarian catastrophe” if Israeli bombings in Gaza return to the intensity of before the Israel-Hamas truce. Catherine Russell also urged “all parties to ensure that children are protected and assisted” and called for a “lasting humanitarian ceasefire”. The executive director of Unicef said in a statement that the Gaza Strip “is once again the most dangerous place in the world to be a child” and that “more children will surely die” as a result of the resumption in fighting. Russell’s comments on Friday came after the seven-day ceasefire between Israel and Hamas expired and Israel resumed military operations in the territory. All children in the State of Palestine and Israel deserve peace and hope for a better future.\nWe call on all parties to ensure that children are protected and assisted.\nMy statement on the resumption of fighting in Gaza ▶️ https://t.co/jcbyOAEZVS — Catherine Russell (@unicefchief) December 1, 2023 Russell said: Before the pause, more than 5,300 Palestinian children were reportedly killed in 48 days of relentless bombing – a figure that does not include many children still missing and presumed to be buried under rubble. Should violence return to this scale and intensity, we can assume that hundreds more children will be killed and injured every day. And if we are not able to get water, food, medical supplies, blankets and warm clothes to those in need, we will face a humanitarian catastrophe.\nUpdated at 05.32 CET\n2 Dec 2023 03.42 CET Israeli airstrikes hit near Damascus, says Syria More has come in on the reported Israeli strikes in Syria: an Agence France-Presse journalist in the Syrian capital reports hearing the loud sound of bombings. Syria’s defence ministry said Israel carried out the airstrikes about 1.35am (1035 GMT) on Saturday “targeting some points near the city of Damascus”. The strikes came from the direction of the occupied Golan Heights, it said, reporting no casualties. Syria state television earlier said there had been “Israeli aggression near the capital”, AFP reports. Israel has launched hundreds of airstrikes on its northern neighbour since Syria’s civil war began in 2011, primarily targeting Iran-backed forces and Lebanese Hezbollah fighters, as well as Syrian army positions. But it has intensified attacks since its war with Hamas, a Hezbollah ally, began in October. The Israeli army did not comment when asked by AFP about the latest strikes. View image in fullscreen Fences on the ceasefire line between Israel and Syria in the Israeli-occupied Golan Heights. Photograph: Ammar Awad/Reuters Rami Abdel Rahman, who heads the Syrian Observatory for Human Rights war monitor, said Israel struck “Hezbollah targets” in the Sayyida Zeinab area south of Damascus. Ambulances had rushed to the scene of the bombing, said the chief of the British-based monitor, which runs a network inside Syria. Israeli air strikes on 26 November rendered Damascus airport inoperable just hours after flights resumed following a similar attack the month before. Israel rarely comments on individual strikes targeting Syria, but has repeatedly said it will not allow arch-foe Iran to expand its presence there.\nUpdated at 04.47 CET\n2 Dec 2023 02.57 CET 184 killed since resumption of fighting, Gaza authorities say Gaza health officials say Israeli air strikes have killed 184 people and wounded at least 589 others since the truce expired on Friday morning. More than 20 houses had been hit, Reuters reports the officials as saying on Friday evening. The Gaza health ministry said earlier that most of those killed were children and women. The figures cannot be independently verified. Israel’s bombardment on Friday after the collapse of the seven-day ceasefire was most intense in the southern areas of Khan Younis and Rafah, medics and witnesses said. Hundreds of thousands of Palestinians have been sheltering there because of fighting in the north. Houses in central and northern areas were also hit.\n2 Dec 2023 02.22 CET The International Monetary Fund has announced it will revise its economic outlook for the Middle East and North Africa region due to the continuing Israel-Hamas war. The conflict would have wide-ranging consequences for “both people and economies” in the region, although the extent of the impact remains “highly uncertain”, IMF staff wrote in a blog post on Friday. A large-scale conflict would constitute a major economic challenge for the region. The post also called on the international community to act to prevent a further escalation, Agence France-Presse reports. In the event of a large-scale conflict, “what is certain is that forecasts for the most directly exposed economies will be downgraded and that policies to buffer economies against shocks and preserve stability will be critical”, the IMF post added. It did not say if the revisions would be released ahead of its next outlook publication, which is due in January.\n2 Dec 2023 02.08 CET Syrian air defences repelled an Israeli rocket attack against targets in the vicinity of Damascus early on Saturday, Syrian state media reported, adding that defences shot down most of the missiles. The report, citing a military source, said the attack came from the direction of the occupied Golan Heights. It said there were only material damages, Reuters reported.\n2 Dec 2023 01.31 CET Israeli shelling in south Lebanon kills three, Lebanese media says Israeli shelling killed three people in southern Lebanon on Friday, Lebanon’s state news agency reported, as the collapse of a Israel-Hamas truce prompted a resumption of hostilities at the frontier. The number rose after two people were earlier reported killed. The Iran-backed Lebanese group Hezbollah, a Hamas ally, later said two of those killed were its fighters. It also said it had carried out several attacks on Israeli military positions at the border in support Palestinians in Gaza, Reuters reports. The Israeli army said its artillery struck sources of fire from Lebanon and that air defences had intercepted two launches. The army also said it struck a “terrorist cell”. Sirens warning of possible incoming rockets sounded in several towns in northern Israel, sending residents running for shelter. Lebanon’s state news agency reported that two people were killed by Israeli shelling in the Lebanese border town of Houla, and one person was killed in the village of Jebbayn. This is Adam Fulton picking up our live coverage of the Israel-Hamas war – stay with us for all the latest developments as they unfold\nUpdated at 03.23 CET\n1 Dec 2023 00.44 CET 'Terrified' children, women and men of Gaza 'have nowhere safe to go', says UN aid chief The UN aid chief, Martin Griffiths, has said “hopes were dashed” in a matter of hours after the truce between Israel and Hamas came to an end on Friday morning. In a statement, Griffiths said during seven days of the ceasefire, hostages were released, families were reunited, more patients received medical care, and the volume of aid into Gaza increased. But, he said: Today, in a matter of hours, scores were reportedly killed and injured. Families were told to evacuate, again. Hopes were dashed. Almost two months into the fighting, the children, women and men of Gaza are all terrified. They have nowhere safe to go and very little to survive on. They live surrounded by disease, destruction and death. He urged a humanitarian ceasefire to maintain aid deliveries into Gaza and to allow the remaining hostages to be released. “We need the fighting to stop” he said. The past week offered us a glimpse of what can happen when the guns fall silent. The situation in Khan Younis today is a shocking reminder of what happens when they don’t.\n1 Dec 2023 00.09 CET Rachel Leingang A Democratic congressman says his home was vandalized on Thursday night by “people advocating for a ceasefire in Israel and Gaza”. Adam Smith, a US House member from Washington state, called the vandalism to his home in the city of Bellevue “sadly reflective of the coarsening of the political discourse in our country, and is completely unwarranted, unnecessary, and harmful to our political system”. Smith, the ranking Democrat on the House armed services committee, has not joined calls from some in his party for a ceasefire and was part of a group that sent a letter to Joe Biden applauding the president’s support for Israel. Smith said he and his staff have often met with groups across the political spectrum, including pro-Palestinian activists. And he said he was still willing to meet with those groups “in a productive and peaceful way”. “The extremism on both the left and right side of our political spectrum is a threat to a healthy, functioning democracy and has been condoned for far too long,” Smith said in a statement. The simple truth is that extremism on both sides is degrading to our political system and must be rooted out for our democracy to be able to persist. Pramila Jayapal, also a Democratic House member from Washington state, wrote on X that vandalizing someone’s home “crosses the line”. “As an activist before coming to Congress, as a member of Congress who’s been violently targeted at my home, I firmly believe everyone should be able to feel safe in their homes,” Jayapal said. Let’s find smart, non-violent ways to air our differences & respect the boundaries of home & family.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli airstrikes hit near Damascus, says Syria - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/dec/01/israel-hamas-war-live-updates-ceasefire-latest-news-extension-israel-frees-30-palestinians-hostages-released-news"}