{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:15:49", "date_modify": "None", "date_publish": "2024-01-25 17:46:13", "description": "Doha ‘appalled’ at leaked recordings allegedly showing Israeli PM saying Qatar’s role in talks is ‘problematic’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F25%2Fqatar-accuses-benjamin-netanyahu-deliberately-obstructing-gaza-mediation-efforts.json", "image_url": "https://i.guim.co.uk/img/media/2450f33db0cae8c23dad0af44b0aed39a12b2f05/128_80_3312_1987/master/3312.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7908222c5f8443e11369b53982ac9820", "language": "en", "localpath": null, "maintext": "Qatar has harshly criticised Israel’s prime minister, accusing Benjamin Netanyahu of deliberately obstructing ceasefire and hostage release negotiations with Hamas for personal political gain.\nDoha’s foreign ministry spokesperson, Majed al-Ansari, said on Wednesday night that his government was “appalled” by leaked remarks allegedly made by Netanyahu in which he criticised the country’s mediation efforts over the war in Gaza, adding that the Israeli leader’s comments were “irresponsible and destructive” but “not surprising”.\n“If the reported remarks are found to be true, the Israeli PM would only be obstructing and undermining the mediation process, for reasons that appear to serve his political career instead of prioritising saving innocent lives, including Israeli hostages,” Ansari wrote on X, formerly Twitter.\nNetanyahu’s office is yet to issue a response in the public spat, which threatens to complicate the already arduous negotiations on aid, a ceasefire and the release of approximately 130 hostages believed to still be in captivity in the Gaza Strip.\nAt least 20 people were killed and 150 wounded while waiting for the distribution of aid in Gaza City, local authorities said on Thursday, as fierce fighting continues to rage across the besieged coastal territory. Hamas blamed Israel for the attack. The Israel Defense Forces did not immediately respond to a request for comment.\nView image in fullscreen Displaced Palestinians hold out empty containers as they wait to receive food aid in the Rafah refugee camp on Friday. Photograph: Haitham Imad/EPA\nOn Thursday, Israel’s far-right finance minister, Bezalel Smotrich, fanned the flames with a post on X accusing Qatar of being responsible for the 7 October Hamas attack, calling the Gulf state the “patron of Hamas” and “a country that supports terrorism and finances terrorism”.\nAnsari’s statement came in response to recordings of Netanyahu’s closed-door meeting with family members of hostages earlier this week obtained by Israel’s Channel 12, in which he reportedly said Qatar’s role in the mediation process was “problematic”.\nThe prime minister allegedly told the relatives he had intentionally not thanked Doha for its efforts to date and that he had expressed anger towards the US, Israel’s most important ally, for deciding to keep a military base in the semi-democratic oil state.\n“Qatar in my opinion is no different, in essence, from the UN. It is no different, in essence, from the Red Cross, and in some ways it is even more problematic,” he said. “I am prepared to use any actor at the moment that will help me get [the hostages] home. I haven’t any illusions about [Qatar]. They have leverage.”\nIsrael has long maintained that international organisations such as the UN are biased against it. Doha in recent years has carved out a role as international mediator in conflicts such as Ukraine, Sudan and Afghanistan, as well as in previous rounds of fighting in Gaza. It has deep ties to Hamas and hosts several members of its political wing.\nQatar, along with Egypt and the US, has served as a leading mediator in the three-month war in Gaza sparked by Hamas’s attack on Israel in which 1,140 people were killed and about 250 taken hostage. Israel’s offensive, which it says will completely eradicate the Palestinian militant group, has killed more than 25,700 people and displaced about 85% of the strip’s 2.3 million population from their homes.\nQatar was critical in securing a week-long truce in November in which more than 100 hostages were released in return for 240 women and children held in Israeli jails.\nNumerous rounds of negotiations have since faltered. The current deal under review is believed to include a 30-day pause in fighting, during which the remaining Israeli hostages would be freed in several instalments, but the parties are far from agreeing more permanent steps to end the conflict.\nRecent diplomatic efforts have been overshadowed by the heaviest fighting in Gaza this year, centred on the southern city of Khan Younis, which the Israeli army said on Wednesday it had “encircled” after two days of airstrikes and fierce ground fighting.\nKhan Younis’s three hospitals had been cut off by the fighting, Médecins Sans Frontières and the Palestine Red Crescent said. On Wednesday, a centre in the city run by the UN’s agency for Palestinian refugees, where about 800 people had sought shelter, was hit by shelling, according to the agency’s director. Twelve people were killed and 75 injured, with medical teams unable to access the building.\nIsrael denied its forces were responsible for the attack.\nSupport for the war remains high among Israelis, but opinion polls show lagging support for Netanyahu and his far-right coalition. Weekly Saturday night rallies demanding the release of hostages have been supplemented in recent weeks by growing calls for elections.\nTuesday’s killing of 21 Israeli soldiers who were mining buildings for demolition and were hit by grenade fire – the deadliest single incident for Israeli forces in the conflict to date – has fuelled public dissent.\nOn Wednesday night, traffic on a major motorway was briefly blocked as thousands of people attended a protest in Tel Aviv organised by women’s advocacy groups to demand an immediate government proposal for a new deal to free the hostages.", "source_domain": "www.theguardian.com", "text": null, "title": "Qatar accuses Netanyahu of deliberately obstructing Gaza mediation efforts", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/25/qatar-accuses-benjamin-netanyahu-deliberately-obstructing-gaza-mediation-efforts"}