{"authors": ["Jason Burke", "Emma Graham-Harrison"], "date_download": "2024-02-05 15:31:54", "date_modify": "None", "date_publish": "2023-12-02 19:34:21", "description": "As pressure grows on Israel to avoid civilian deaths, IDF believes killing leaders will collapse organisation", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F02%2Fisrael-using-hamas-prisoners-to-track-down-terror-chiefs.json", "image_url": "https://i.guim.co.uk/img/media/552bb10fe0b88a1cdd6b1e66b60fbd3cc8042512/0_113_3396_2038/master/3396.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=2610d206e3eb0d825185b8af580378fe", "language": "en", "localpath": null, "maintext": "The Israeli military’s coming push into southern Gaza is driven by the belief that intelligence gleaned from hundreds of militants captured during the fighting in the north will allow them to find and kill leaders of Hamas.\nIsrael’s politicians and generals believe that taking out top commanders – and leader Yahya Sinwar – is their best chance of forcing the collapse of an organisation that is deeply embedded in Gaza, after nearly two decades controlling the enclave.\nTwo serving military officials with knowledge of strategy for the next phase confirmed there would be an intense focus on using new intelligence to target Hamas leaders.\nCritics say the new strategy will do little to reduce the high cost in civilian lives in the campaign so far.\nHopes of a fresh truce, which had been kept alive by mediators from Qatar and Egypt as the fighting began, were fading over the weekend, even as French president Emmanuel Macron said he was heading to Doha to work on a new deal.\nBoth sides, who had blamed each other for the collapse of the original agreement, publicly hardened their position.\nIsraeli prime minister Benjamin Netanyahu ordered a Mossad delegation to return from Qatar where it had been negotiating a possible second truce, saying Hamas “did not uphold its part of the agreement, which included the release of all of the children and women according to a list that was given to Hamas and approved by it”.\nA senior Hamas official then told Al Jazeera there would be no more hostage releases unless there is a ceasefire and all Palestinian detainees in Israel are released. “Let the war take its course. This decision is final. We will not compromise on it,” said deputy Hamas chief Saleh al-Arouri.\nThe prospect of a military offensive in the south has spread terror in Gaza, where four in five people have already fled their homes for crowded shelters, schools, tents and hospital corridors.\nAfter the end of a week-long ceasefire, the area is under intensifying bombardment. As many as 1.5 million civilians face a second displacement from places that Israel initially said would be safe and into an even smaller portion of Gaza.\nEven Israel’s closest ally, the US, has warned that it must do more to protect civilians as it pursues Hamas in the latest round of fighting. US vice-president Kamala Harris, speaking on the sidelines of the Cop28 summit, said Israel had a right to defend itself but not at any cost.\n“As Israel defends itself, it matters how,” she said. “The US is unequivocal: international humanitarian law must be respected. Too many innocent Palestinians have been killed.”\nIn Britain, opposition leader Keir Starmer also warned Israel against waging a war in southern Gaza that was as bloody as its campaign in the north. “We can’t go back to the way the first phase of this war was conducted,” he said. “Too many people, innocent individuals, have lost their lives in Israel and across Gaza … We have to see this as a different stage.”\nThe Israeli military offensive has killed about 15,200 people, including at least 6,000 children and 4,000 women, according to the Hamas-run authorities in Gaza. In the first 36 hours since the ceasefire broke down, more than 200 Palestinians have been killed, they said.\nView image in fullscreen Israeli bombardment of the northern Gaza Strip on Saturday. Photograph: Léo Corrêa/AP\nUnder US pressure over civilian deaths, the Israel Defense Forces (IDF) sees an all-out push to assassinate the Hamas leadership as its best hope of reaching its goals – collapsing the militant organisation, forcing the return of Israeli hostages on acceptable terms and ending the war on a timescale agreeable to Washington.\n“We are under American pressure that is getting tougher. The American demand is get rid of Hamas but stop killing so many civilians,” said Yossi Alpher, an analyst and former Mossad official. “You can’t dismantle the infrastructure without killing a lot of people but maybe you can attack the leadership and dismantle [Hamas] that way without killing a lot of people.”\nThe Israeli government proclaimed Sinwar its top target in the wake of the 7 October attacks that triggered the war, when Hamas killed about 1,200 people, mostly civilians. But in the first stage of fighting inside Gaza, troops mostly seized territory and degraded infrastructure. Israeli military officials have previously admitted to the Observer that, though Israel has killed significant numbers of mid-ranking battlefield commanders, it has not managed to reach any senior leaders.\nView image in fullscreen People mourning their relatives killed by the Israeli bombardment in Khan Younis, southern Gaza, on Saturday. Photograph: Fatima Shbair/AP\nSinwar and other high-ranking leaders run the movement from a vast network of tunnels under Gaza and the Israeli military now believes they may be sheltering beneath the city of Khan Younis, a focus of attacks since the truce broke down.\nMore than 50 missiles hit targets in and around the city on Saturday, while at least nine people, including three children, were killed in a strike on a house in Deir al-Balah city, also in the south, according to the hospital where the bodies were taken.\nThere were also strikes in the north, where casualties included a prominent academic, Sufyan Tayeh, president of the Islamic University of Gaza and a leading researcher in physics and applied mathematics. He was killed with his family, Reuters reported.\nA military spokesman said on Saturday afternoon that the IDF was focused on Hamas “centres of gravity” distributed throughout the Gaza Strip.\n“The IDF have learned lessons. The aim will be to bring the war much closer to the leaders in order to have better a deal with regard to the release of the hostages,” said Kobi Michael, an expert at the Institute for International Security Studies in Tel Aviv. Any information is likely to be fed into an AI-based system called Habsora (the Gospel) to “produce targets at a fast pace”.\nMany experts are sceptical of assertions that AI-based systems reduced civilian harm by encouraging more accurate targeting, pointing to widespread destruction of entire neighbourhoods and the death toll in Gaza.\nLast night the UK said it was increasing efforts to locate hostages in Gaza. The Ministry of Defence will conduct surveillance flights over the eastern Mediterranean. The aircraft will be unarmed and only information relating to hostage rescue will be passed to the relevant authorities.\nBoth Israel’s allies and critics have warned that it has not drawn up plans for Gaza’s future when the war is over, when the reconstruction and governing of the devastated enclave will pose a huge challenge; the UN says 60% of the housing stock has been damaged or destroyed. Concerns are likely to be heightened by Israeli plans to carve out a buffer zone on the Palestinian side of Gaza‘s border to prevent future attacks, which Reuters reported had been shared with regional powers, and were confirmed by a key aide to Netanyahu. The prospect of putting part of the already small enclave off limits is likely to fuel anger in Gaza and beyond.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel using captured Hamas prisoners to track down top leaders", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/02/israel-using-hamas-prisoners-to-track-down-terror-chiefs"}