{"authors": ["Emma Graham-Harrison", "Jason Burke"], "date_download": "2024-02-05 15:31:55", "date_modify": "None", "date_publish": "2023-12-02 17:23:11", "description": "Online system designed to order precise evacuations inaccessible to those without power or network access", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F02%2Fisraeli-grid-system-makes-life-in-gaza-macabre-game-of-battleships-say-aid-workers.json", "image_url": "https://i.guim.co.uk/img/media/b18cc17dac4b81b454e2ecde268676ffed0f3b7c/37_860_536_321/master/536.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=48d2e86fa615b212ae84cb429a907a9c", "language": "en", "localpath": null, "maintext": "Israel’s new grid system for targeted evacuation warnings in southern Gaza risks turning life in the territory into a “macabre game of Battleships”, aid workers have warned.\nWhen Israel resumed its offensive in Gaza after a week-long ceasefire deal collapsed, it immediately signalled plans to intensify attacks on the south of the territory, in areas where Palestinian civilians had previously been urged to take shelter.\nBombing began within seconds of the truce ending early on Friday morning, and at least 200 people had been killed by Saturday, Gaza’s health authorities said.\nResidents who have been squeezed into a shrinking corner of Gaza, most of them already internal refugees displaced and struggling to find enough to eat, described desperation and despair as they weighed up what to do as the fighting drew closer.\nThey are hemmed in by the sea on one side, the closely guarded Israeli border on the other, and at their backs is the border with Egypt.\nView image in fullscreen The post in full, which reads: The IDF has resumed forceful action against Hamas and other terrorist organisations in the Gaza Strip. We kindly inform you of the following: In the northern Gaza Strip: • Residents of Jabalia, al-Shuja’iya, al-Zaytoun, and the Old City of Gaza. • Jabalia residents residing in the following blocks: 1772, 1808, 1811, 961, 963, 760. For your safety, we call on you to evacuate your homes immediately through the Haifa and Khalil al-Wazir axes and go to the known shelter centres and schools in the al-Daraj and Tuffah neighbourhoods and west of Gaza City. Photograph: @AvichayAdraee/X\nAlthough that border is heavily patrolled, Cairo has said it fears people fleeing the offensive may still try to break through into its territory. The Egyptian foreign ministry has described the forced transfer of Palestinians as a “red line”.\nIsrael has started using its new grid system for evacuation warnings, which breaks Gaza down into more than 600 blocks, and can be accessed through a QR code on leaflets and social media posts.\nIt appears designed to allow the Israel Defense Forces (IDF) to try to shuffle civilians around in a shrinking battle space as they target Hamas fighters, by ordering them to leave areas that in some cases cover just a few blocks.\nBut on the ground, people said it had just added to their fear and confusion. After weeks of bombardment and blockades, most people have little access to electricity to charge phones and other devices, and even for those who can get online, the telecommunications system regularly collapses.\nThat means residents have no reliable way of accessing the map, the UN Office for the Coordination of Humanitarian Affairs (Ocha) said.\n“Reportedly, the map is intended to facilitate orders to evacuate specific areas ahead of their targeting. The publication does not specify where people should evacuate to,” the daily briefing from the UN agency said. “It is unclear how those residing in Gaza would access the map without electricity and amid recurrent telecommunications cuts.”\nIsrael’s military used the grid system for the first time on Saturday morning, in online evacuation warnings from its Arabic-language spokesperson Lt Col Avichay Adraee. But some of the shaded areas marked for evacuation did not correspond fully with the numbered blocks he listed.\nThose maps should not have been considered evacuation warnings, a second spokesperson said when asked about the discrepancy. They are “not the interactive map that should be used for this [warning] purpose,” she said.\nOther Israeli leaflets dropped into Gaza have added to the confusion, by eschewing the grid system and urging evacuation from broader areas. That leaves Gaza’s civilians trying to make life-or-death decisions without basic information, aid groups say.\n“Communications are increasingly difficult and this map is not going to provide Palestinians with the protections that are their right under international law,” said Rohan Talbot, advocacy director at the charity Medical Aid for Palestinians (Map). “It is more akin to a macabre game of Battleships in which terrified civilians will be left guessing which square will save their life.”\nHealth professionals are particularly concerned about hospitals and clinics in blocks marked for evacuation, after Israeli forces targeted medical buildings in the north, his colleague Fikr Shalltoot, the Gaza director for Map, said.\n“This grid has caused fear and panic among our colleagues on the ground. Some of them are currently in areas Israel says might be targeted, but Israel has also been bombing homes outside these areas, so they don’t know what to do,” Shalltoot said.\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n“We don’t know what will happen if an area with a hospital is marked ‘unsafe’ by Israel. These hospitals are already operating far beyond capacity, so where will patients and staff evacuate to?”\nAsked about the logistics of warnings based on the online grid system, Israel’s military did not clarify whether they would also provide offline warnings about the evacuation of specific blocks to Gaza residents.\n00:01:34 Strikes on Gaza resume after Israel accuses Hamas of breaking truce – video\nThere have already been grave concerns raised about Israeli plans to expand its military operation in the south, where hungry and exhausted civilians are trying to survive the fighting in overcrowded shelters where diseases are spreading fast.\nMany of those who have been urged to move had already fled their homes in other parts of Gaza – about 80% of the territory’s population is now displaced – and have watched missiles kill hundreds of people in an area they were told was safe.\n“We are living a scary uncertainty, without any control on our life. I don’t know exactly where the bombing is, but the sound is loud and the earth is shaking,” said one UN administrator at an overcrowded shelter near Khan Younis, whose own family had fled the north earlier in the conflict. “Some of the children are terrified but mine just don’t understand the situation, and I don’t want to explain it to them.”\nThe overall death toll in Gaza has passed 15,200, with more than two-thirds of those women and children, the health ministry said. The UN says the ministry has a track record of providing reliable casualty figures.\nPaul Ley, a surgeon, told the Observer late on Friday that the first casualties had arrived hours after the ceasefire and he had not left the operating theatre since.\n“The casualties started coming in mid-morning. I’ve done 12 amputations today and there are more to do. All are shrapnel wounds,” he said. “There was a two-and-a-half-year-old who lost both his legs, and his brother was badly injured too. The rest of his family were killed, I was told.”\n“But we had an adult with shrapnel in the heart who we managed to save. I’ve no idea how many came into the hospital because I’ve not left the operating theatre all day, so I just see the ones who come to me. But I know they keep coming in.”\nIsrael has vowed to destroy Hamas after its fighters broke through the border on 7 October and killed around 1,200 people, the majority of them civilians. The IDF says Israeli troops must move south because Hamas fighters are hiding there.", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli grid maps make life in Gaza ‘macabre game of Battleships’, say aid workers", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/02/israeli-grid-system-makes-life-in-gaza-macabre-game-of-battleships-say-aid-workers"}