{"authors": [], "date_download": "2024-02-05 15:31:56", "date_modify": "None", "date_publish": "2023-12-02 10:25:46", "description": "Pentagon says the US Ospreys continue to operate in Japan", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fasia%2Fjapan%2Fjapan-ospreys-pentagon-tokyo-military-crash-b2457266.html.json", "image_url": "https://static.independent.co.uk/2023/12/01/09/Japan_US_Osprey_Crash_78911.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States has rejected a request from Japan to suspend all non-emergency V-22 Osprey flights over its territory after one fell into the sea on Wednesday in western Japan.\nA US military aircraft with six personnel on board crashed into the sea near Japan’s Yakushima island, killing one of them last week. The crash involved an Osprey aircraft, which can function as a helicopter or a turboprop craft, and happened at about 2.47pm local time on Wednesday, according to a spokesperson for the coastguard.\nThe tilt-rotor aircraft in Japan operate “only after undergoing thorough maintenance and safety checks”, Pentagon deputy spokeswoman Sabrina Singh said in a statement. However, the statement did not refer to Japan’s request.\n“We have good communications between our senior leaders and are in constant dialogue regarding aviation safety and other safety-related issues,” Ms Singh said.\nThe Pentagon said on Thursday that the US Ospreys continue to operate in Japan.\n“We are concerned about the continuing Osprey flights despite our repeated requests and the absence of a sufficient explanation about their safety” from the US military, Japan’s chief cabinet secretary Hirokazu Matsuno said on Friday.\nJapan’s minister of defence, Minoru Kihara stated that he held a meeting with Lt Gen Ricky Rupp, the commander of US Forces Japan, on Thursday afternoon. During the meeting, he reiterated his request for flights to be permitted only after confirming the safety of the aircraft. Although he acknowledged not explicitly using the terms “grounding” or “suspension” during the meeting and emphasised on ensuring the aircraft’s safety.\nThe Osprey aircraft are used for a wide range of mission types that include air assaults, air refuelling, evacuation and recovery and transporting VIPs.\nSeveral crashes involving the aircraft have been reported in recent years.\nIn August this year, three of 20 US marines were killed on Australia’s Melville Island while taking part in a military drill with the armies of Australia, Indonesia, the Philippines and East Timor.\nMeanwhile, the Pentagon statement said the Osprey flights have been suspended in the Air Force unit that flew the crashed plane. Japan’s Ground Self-Defense Force has grounded its own fleet of Ospreys.\nSeparately, the Air Force said the search continues for the crew lost in the crash.\nLast year, four US soldiers were killed in a crash in a Norwegian town during a Nato exercise unrelated to the Ukraine war. The aircraft involved was a V-22B Osprey that belonged to the US Marine Corps, Norway’s armed forces said.\nIn a 2017 crash, an Osprey struck a warship in an incident that killed three marines on board. New footage of the incident emerged last year.\nAdditional reporting with agencies", "source_domain": "www.independent.co.uk", "text": null, "title": "US denies Japan’s call to ground Osprey aircraft following fatal crash", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/asia/japan/japan-ospreys-pentagon-tokyo-military-crash-b2457266.html"}