{"authors": ["Dan Sabbagh"], "date_download": "2024-02-05 15:31:59", "date_modify": "None", "date_publish": "2023-12-02 15:42:18", "description": "As the Israeli offensive restarts, those who fled the north find themselves exposed and fearful on the frontline again", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F02%2Fwe-now-just-wish-to-be-killed-the-palestinians-under-fire-in-southern-gaza.json", "image_url": "https://i.guim.co.uk/img/media/b2971354271b1f2aae30de7077fab179466ed8d0/0_647_1140_683/master/1140.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=48c3e6d0aed6683fd1018a1d58dc0692", "language": "en", "localpath": null, "maintext": "On Friday morning, Reham Shaheen had a rare chance to talk to her husband, Muhanad, who had been sheltering with their family in Deir al-Balah, in the southern half of Gaza, shortly after Israel’s military restarted its campaign of bombing.\nThe aid worker, now in Jordan, had been separated from Muhanad and their three children because of a work trip two days before the war. Now she could do little other than listen to his despair down the line as Israel’s air force struck again and again.\n“He was feeling really helpless and feeling frustrated,” said Shaheen, who works for the disability charity Humanity & Inclusion. “He told me ‘I’m really regretting that I moved from the north to the south, because now the bombing this morning is targeting the south. I am afraid we will get killed after being forced to flee our home’.”\nThe fear – and distrust – had spread to her two sons, 12 and 10, she said, because they had been told by their parents it would be safer in the south, after Israel demanded the evacuation of the north in October. “Now they are not trusting even what we are telling them. So it really impacts the psychological situation of our children,” she said.\nMeanwhile, another relative, an uncle, had put it more succinctly: “What we wish now is to be killed, to avoid going through all this feeling of threat all the time and being in that distress.” As the war restarts, hope is running out.\nIsrael’s military said on Saturday it had bombed 400 targets in the first 24 hours of its renewed campaign against Hamas on the Gaza Strip, including 50 in Khan Younis, the southern city that is now the focus of its attacks.\n00:01:34 Strikes on Gaza resume after Israel accuses Hamas of breaking truce – video\nReports from the city said that, while it had been attacked before, it was coming under its heaviest bombardment yet, while Gaza’s Ministry of Health said that at least 193 Palestinians had been killed and 650 wounded in Gaza since the collapse of the truce.\nAn official video from the Israel Defense Forces released on Saturday showed a string of bombings against combatants and infrastructure. In some cases whole buildings, such as one described as a “Hamas military command centre”, are engulfed in flames, apparently hit by heavy bombs able to destroy a block of flats.\nFilm shot by photojournalist Yosef Basam showed the terrifying intensity of the attacks on Saturday morning, a succession of loud explosions in the north of the territory captured from a distance. A day earlier, an Al Jazeera video report showed a bombed-out neighbourhood of Khan Younis, where local people said 10 homes had been destroyed.\nLeaflets dropped by Israel’s military demanded that residents of certain districts near Khan Younis head south to Rafah, on the Egyptian border, warning that the area was now “a dangerous combat zone”. Footage on Saturday showed displaced Palestinians making their way south on the rubble-strewn main Salah al-Din road.\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nJason Lee, the Palestine country director for Save the Children, was in Rafah on Friday, and said he had begun to see a fresh population transfer in a country where 1.7 million people have already been displaced and close to 2 million are crowded into the broader south. “How is it possible for people to move again? For many, this is not their first evacuation. The scale and scope of this is unprecedented,” he said.\nThe aid worker said there were “only two hospitals functioning, with barely any medical supplies”. Fuel and aid deliveries stopped on Friday, and a modest 50 trucks were allowed through the border on Saturday. “If fuel deliveries go down to pre-truce levels, it will be insufficient to run the desalination plants and water wells” on which Palestinians rely on for drinking water, he said.\nCamps and shelters are hopelessly overcrowded – in one case by 35 times, Lee said – and outbreaks of gastroenteritis and diarrhoea are becoming increasingly common in a territory where there are about 1.1 million children. Lee said he had seen one family spend a day searching desperately for baby milk for a starving child a few months old, because the mother had been killed.\nTrauma, as well as illness, is becoming a deeper problem. Shaheen said her four-year-old daughter was unwell from polluted water and had been unsettled by having to evacuate once already. “She was not eating since the beginning of the war. She’s lost three kilos,” Shaheen said, holding back her emotions. “I can’t describe her situation, to be honest.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘We now just wish to be killed’: the Palestinians under fire in southern Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/02/we-now-just-wish-to-be-killed-the-palestinians-under-fire-in-southern-gaza"}