{"authors": ["Jason Burke"], "date_download": "2024-02-05 15:32:00", "date_modify": "None", "date_publish": "2023-12-02 18:13:08", "description": "One lesson from the 1982 Lebanon war is that Israel’s enemy only needs to survive against superior firepower to gain an advantage", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F02%2Fas-the-ceasefire-ends-a-question-from-history-lingers-will-israel-win-the-battle-but-lose-the-war-against-hamas.json", "image_url": "https://i.guim.co.uk/img/media/b763321c8d8eb55b7cd2e58d3b064c5c73b9a870/0_18_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=d1ddb5f8f9ff4f655732a42b2bc604da", "language": "en", "localpath": null, "maintext": "The scene is one familiar from many conflicts. Soldiers line up to get food from an outdoor canteen, weapons slung haphazardly over their shoulders, boots muddy, shirts undone. An armoured personnel carrier clanks by, the roar of its engine temporarily drowning out the boom of artillery. Officers shout orders. Tired men jump down from dusty vehicles and swear.\nEven during the recent ceasefire, the rear areas of the massive Israeli military offensive in Gaza were busy. So too was Hamas, which used the seven-day pause in hostilities to reorganise its battered forces and reconstitute some of its degraded capabilities.\nAt 6.45am on Friday, 15 minutes before the truce was due to expire, Hamas fired a barrage of rockets into southern Israel. All day, the apps that most Israelis have on their phones that warn of incoming missiles buzzed and beeped. In the late afternoon, drivers on the northern outskirts of Tel Aviv pulled over, left their cars and lay down in the dirt of the roadside – the recommended routine when incoming rockets are signalled.\nWhat the Israeli military had been preparing rapidly became clear. At 7.04am exactly, the first airstrikes hit targets in Khan Younis in the southern part of Gaza. An hour or so later, a doctor in the European hospital in the city described his fears for the coming hours.\n“First, they’ll go to emergency and then they’ll come to me,” said Paul Ley, an orthopaedic surgeon with the International Committees of the Red Cross, who has been operating on civilian casualties of Israeli airstrikes for weeks. The howl of ambulance sirens could be heard in the distance as he talked to the Observer.\nWhen contacted again in early evening, Ley had performed eight amputations, including the double amputation of legs from a two-year-old child, whose entire family had been wiped out earlier in the day, except for one badly injured brother.\n“I’ve not left the [operating] theatre all day, so I don’t know how many casualties have come in so far,” Ley said. “But they keep coming.”\nThat hostilities started again came as little surprise to anyone in the region. The seven-day ceasefire brokered by Qatar, Egypt and the US had been forced on the reluctant Israeli government because domestic public pressure meant that the prime minister, Benjamin Netanyahu, could not refuse an opportunity to bring home at least some of the 240 hostages snatched by Hamas when the militant organisation broke through the perimeter fence around Gaza close to two months ago and killed more than 1,200 people, mostly civilians, in their homes or at a music festival.\nThe fact that Israeli official government releases speak of the “redemption” of the hostages was revealing. Beyond that of 84 Israeli women and children taken into terrifying, traumatising and sometimes brutal captivity, it is also a partial redemption of the country’s leaders, whose catastrophic failures allowed the attack in the first place.\nBut the ceasefire had run its course. Hamas was the bigger beneficiary, winning the release of hundreds of Palestinian prisoners from Israeli jails and receiving a huge boost in popularity in return.\nThis worried many. Speaking to the Observer, Kobi Michael of the Institute for National Security Studies in Tel Aviv said he was concerned that Israel was prioritising the security of individual citizens over “collective and national security”.\nView image in fullscreen The PLO leader Yasser Arafat inspects bomb damage in west Beirut in 1982 following Israeli bombardment. Photograph: Mourad Raouf/AP\nOthers put it more bluntly. Approximately 15,000 people have been killed in Gaza during the Israeli offensive, including about 6,000 children and 4,000 women, according to Hamas-run authorities. Hundreds more have reportedly been killed since the ceasefire broke down. “The Arabs only understand force and anything else is seen as a weakness,” one former intelligence officer said.\nFor the moment, Israeli society remains squarely behind the war. It is also convinced that the Israel Defense Forces (IDF) will win. But this confidence may be misplaced, according to some commentators.\nLast month, Jon Alterman, director of the Middle East programme at the Washington-based Center for Strategic and International Studies, published a commentary entitled “Israel could lose.” It received little attention, perhaps because the formidable reputation of Israel’s military and the disparity of forces now deployed in the conflict made its argument too counterintuitive.\n“Hamas is thinking about this as losing the battle but winning the war. Their concept is not that they can beat Israel on the battlefield. They know that Israel will act militarily and decisively in the coming months but Hamas sees what it is doing as a generational effort that is much larger,” Alterman said.\nThe core of his argument is that Hamas follows the logic of martial arts such as judo and seeks to turn the strength of its enemy into a vulnerability.\n“Hamas hopes that Israel can hit so hard that it weakens Israel. Israel’s capabilities are practically infinite but Hamas sees … an advantage from Israeli overreach … [which] builds sympathy for Hamas and antipathy towards Israel.”\nThe Israeli military is now beginning to fight its way into southern Gaza – trying to root out an insurgency in the middle of a densely populated urban environment amid an acute humanitarian crisis.\nMany commentators have pointed to a parallel with the Yom Kippur war of 1973, which saw a similar intelligence failure.\nskip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nA better parallel may be the 1982 invasion of Lebanon, which was also sparked by a terrorist attack, though of such differing scale and lethality that it does not bear comparison. In 1982, the attempted assassination of Israeli ambassador Shlomo Argov in London served as pretext for a long-considered, though wildly unrealistic, plan. In 2023, the Hamas attack revealed a lack of strategic thinking, not an excess.\nBut in 1982 the IDF and the Israeli government also ended up laying siege to an urban area as they sought to root out what they called terrorists. The target was the Fakhani neighbourhood of Beirut, where the Palestine Liberation Organization (PLO) was based. A key aim was to kill Yasser Arafat, its leader.\nThen, too, the toll of civilian casualties was horrific, prompting international outrage. Then too, Israel’s enemies deliberately hid among the population, with bunkers under blocks of flats and anti-aircraft weapons next to schools. The city’s buildings were the defenders’ “best barricades”, one PLO leader later said.\nThe 1982 siege of Beirut ended when US president Ronald Reagan called Israeli prime minister Menachem Begin and warned that the “holocaust” in the Lebanese capital risked damaging relations between their countries.\n“I think I know what a Holocaust is,” drily replied Begin, whose family had been wiped out by the Nazis, but who complied nonetheless. Thousands of PLO fighters then left on ships for other Arab countries and Israel claimed victory.\nNow, the 1982 war is seen as a catastrophe. Not only did it mark a turning point in the view of Israel in international opinion – from a plucky Middle Eastern David to a bullying, heavily armed Goliath – but it divided Israeli society and committed the country to decades of a draining occupation.\nThe expulsion of the PLO also aided the rise in Lebanon of Hezbollah, the Iranian-backed Islamist militant group and political movement. This enemy is now considered by Israel to be far more formidable than Hamas.\nIn Gaza, violence is now an extension of negotiations, and the negotiations part of the violence. Many observers predict successive rounds of fighting and ceasefires as hostages are gradually traded for Palestinian prisoners and other concessions, such as increased humanitarian aid.\nThe cost to Israel will rise, however, especially for the soldiers held by Hamas and allied armed factions. Ezaat al-Rashq, a Hamas leader, told Qatar’s Al Araby TV last week that the organisation would “negotiate over [Israeli] military prisoners but at the right time and the price will be much higher”. Hamas leaders have also said they would trade all Israeli hostages for all Palestinian prisoners in Israeli jails. Eyal Hulata, a former national security adviser in Israel, said no one should expect Israel to “go for something like that” and that Hamas were “overplaying their hand”.\nBut if this fits with Israeli military planners’ vision of a grinding campaign to obliterate Hamas as a political force and military threat, and force the group to free the hostages, it does not quite match the political reality.\nAs in 1982, decisions in Washington may end or at least mitigate the violence. US president Joe Biden and the Democratic party, facing a tough election campaign, have many reasons for wanting this deeply divisive conflict to end.\nAntony Blinken, the US secretary of state, has already signalled that Americans will tolerate only weeks, not months, of Israeli military action. Hawkish Israeli officials say this would leave their job in Gaza “half done” but others see little chance of a swift resolution.\nLast month, Emi Palmor, a former senior Israeli official involved in the 2011 deal with Hamas to free captured IDF soldier Gilad Shalit, suggested to the Observer that bringing back all the hostages may take years.\nThis timescale may suit Hamas. Netanyahu has defined victory as the elimination of the enemy, a goal only rarely achieved by any military even against another conventional force.\nBut the old strategic adage is clear: the insurgents, militants, guerrillas, terrorists, or whatever word you choose, need only to survive to win.", "source_domain": "www.theguardian.com", "text": null, "title": "As the ceasefire ends, a question from history lingers: will Israel win the battle but lose the war against Hamas?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/02/as-the-ceasefire-ends-a-question-from-history-lingers-will-israel-win-the-battle-but-lose-the-war-against-hamas"}