{"authors": ["Chiara Fiorillo", "Image", "Anadolu Via Getty Images"], "date_download": "2024-02-05 15:32:01", "date_modify": "None", "date_publish": "2023-12-02 11:35:02", "description": "The Palestinian Press Agency said that more than 100 people were killed in an Israeli airstrike on the Jabalia refugee camp in the northern Gaza Strip, a day after the truce ended", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fbreaking-israel-hamas-war-up-31580428.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31580484.ece/ALTERNATES/s1200/1_Israeli-attacks-on-Gaza-continue.jpg", "language": "en", "localpath": null, "maintext": "The Palestinian Press Agency said that more than 100 people were killed in an Israeli airstrike on the Jabalia refugee camp in the northern Gaza Strip, a day after the truce ended\nMore than 100 people have been killed after Israel bombarded a refugee camp in Gaza, according to a Palestinian news agency.\nThe Israel Defense Forces (IDF) bombed the Jabalia refugee camp in the northern Gaza Strip, where previously displaced families had been staying. The Palestinian Press Agency wrote on X, formerly known as Twitter: \"More than 100 martyrs as occupation aircraft bombed a house housing families and displaced people in Jabalia camp, northern Gaza Strip.\"\nIsrael also bombed the southern Gaza Strip on Saturday, intensifying a renewed offensive that followed a week-long truce with Hamas and giving rise to renewed concerns about civilian casualties. At least 200 Palestinians have been killed since the fighting resumed Friday morning, according to the Health Ministry in Gaza, even as the United States urged ally Israel to do everything possible to protect civilians.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nSince October 7, 15,027 Palestinians have been killed by Israeli attacks in Gaza and more than 40,000 people have been wounded, according to the Health Ministry. Hundreds of wounded people are being treated on the ground after hospitals went out of service as they ran out of fuel - or were damaged by bombings.\nYesterday, the UN described the end of the ceasefire as \" the nightmare that everyone feared\". Speaking from a hospital in Khan Younis, in southern Gaza, James Elder, a spokesman for Unicef, said there was a strike nearby, with ambulances at the scene and plumes of smoke visible in the sky.\nHe said that Nasser Hospital was \"overflowing with children and people with wounds of war\" recovering from the last attack. He added that many families had been sleeping on mattresses at the hospital for weeks after being displaced from their homes - many of which have been destroyed by Israeli airstrikes.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nMr Elder told the BBC's Newsday programme: \"This hospital cannot possibly cope with a surge in wounds from the battlefield with more children with burns, with those horrendous shrapnel injuries.\" Many of Israel's attacks on Saturday were focused on the Khan Younis area in southern Gaza, where the military said it had struck more than 50 Hamas targets with airstrikes, tank fire and its navy.\nThe military dropped leaflets the day before warning residents to leave but, as of late Friday, there had been no reports of large numbers of people leaving, according to the United Nations. \"There is no place to go,\" said Emad Hajar, who fled with his wife and three children from the northern town of Beit Lahia a month ago to seek refuge in Khan Younis. They expelled us from the north, and now they are pushing us to leave the south.\"\nIsrael's military said it also carried out strikes in the north, and hit more than 400 targets in all across the Gaza Strip. Some 2 million people - almost Gaza's entire population - are crammed into the territory’s south, where Israel urged people to relocate at the start of the war.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel-Hamas war: 'Up to 100 killed' in alleged Israeli strike on Jabalia refugee camp", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/breaking-israel-hamas-war-up-31580428"}