{"authors": ["Kitty Chrisp"], "date_download": "2024-02-05 15:32:02", "date_modify": "None", "date_publish": "2023-12-02 07:00:00", "description": "Tom Houghton is a comedian and was once a naked ghost in the Tower of London, where he happened to live for six years. As you do.", "filename": "https%3A%2F%2Fmetro.co.uk%2F2023%2F12%2F02%2Fi-a-naked-ghost-tower-london-19901928%2F.json", "image_url": "https://metro.co.uk/wp-content/uploads/2023/12/Tower-photo-0d9f-e1701475501815_1701476815.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "language": "en", "localpath": null, "maintext": "The Tower of London is a spooky place, people… (Picture: Supplied)\nHave you ever seen the naked ghost in the Tower of London?\nHe skulks the corridors in the merciless light of day, often looking somewhat in a hurry, as tourists gawk through the windows to catch a glimpse, and even – in a rare supernatural phenomena Ghost Hunters could only dream of – record the whole encounter on camera.\nWell, if you have, please relax. That was not some supernatural entity, but comedian Tom Houghton doing a naked shower dash.\n‘I’m what they call a pad brat,’ says the 38-year-old who – contrary to having lived in the Tower of London for six years – actually doesn’t seem spoilt at all.\nFor those who don’t know, ‘pad brats’ or ‘military brats’ are kids who grew up with a parent in the armed forces. Quite an unfair moniker, really. In this case, Tom’s dad was the former Chief of the Defense Staff and the late Queen Elizabeth asked – when she was alive, don’t worry now – if they wanted to live in the Tower of London. As you do.\nBut Tom didn’t grow up there. He moved in aged 30 as a stand-up comedian hungry for material. Well, he got some alright – and now his show, It’s Not Ideal, is touring the country. If you haven’t spotted his ghoulish outline in the Tower of London, you might recognise him on TikTok, where he talks about just that.\nTom’s new stand-up show It’s Not Ideal is touring in 2024 (Picture: AEMEN SUKKAR JIKSAW)\n‘It was pretty eerie. The house I lived in at the time was called Queen’s House – which is now King’s House because we’ve got a king,’ Tom tells Metro.co.uk over Zoom.\n‘In my house was the room that Guy Fawkes was interrogated in. My bedroom was next to the bell tower which had Anne Boleyn and Lady Jane Grey and Thomas Moore in it. Lady Arabella Stuart was a young girl who died in my bedroom,’ he tells me over Zoom.\nAny little, erm, ghosties of poor Arabella…? (Couldn’t not ask).\n‘I was the ghost for a while,’ responded Tom. Hold up. What?\n‘You know when you need a shower and you walk from your bedroom naked just to save yourself getting dressed? I used to do that in the shower,’ he chortled.\n‘The Beefeaters told me that tourists kept on seeing a naked man walking across the windows. From then on I clothed myself rather than be the naked ghost of the Tower of London.\n‘People don’t think people live there, they think it’s just abandoned. So there were TikToks going around going, “I’ve just seen a ghost who walked past the window,” and people would comment being like, “Tom Houghton, is that you?”‘\nBut while Tom has been a ghost in the, er, real supernatural sense, he’s also been a ghost of himself trudging the cobbled historically-weighty paths he called home, surrounded by wide-eyed tourists.\n‘My walk of shame was one of the most shameful walks of shame known to man,’ Tom admitted. Where most people can hide themselves, Tom’s included an army of beady-eyed tourists snapping pictures of the comic, just in case this was genuinely what Prince Harry looks like after a big night. He considers this a real possibility.\n‘”Prince Harry’s looking bit a bit rough,”‘ he joked, impersonating a tourist.\nAnd bringing someone back to his on an an evening..? At the start of his stay, Tom was a single man, and if the woman in the smoking area believed that he actually did live in the Tower of London – despite the fact this sounds like a blatant pick-up line, he admits – when they got to his, things could get complicated.\n‘There was quite a protocol,’ Tom reflected, but quite reasonably didn’t want to disclose anything that would breach the Tower’s security. Absolutely fair enough, sorry Tom.\n‘But it’s a funny thing I realised, you’ve got to sign them in,’ he shared. ‘So the Beefeaters probably have a record of my dating history somewhere in the Tower.’\nAlthough Tom’s tales are some mega comedy Crown Jewels, he understands the historical gravitas of living in such a place.\n‘You realise quite quickly you’ve got to be very respectful living there, because it’s it’s a huge privilege to have lived there,’ he said.\n‘It’s also none of my achievement. It’s all my dad’s. So I think maybe when I first lived there I got a bit excited, and then after a while, I realised, no, you’ve got to obey the rules.’\nNowadays, it would be easy to dismiss a white male comic who talks about boarding school and growing up in a very impressive pad as, well, a bit boring.\nAfter all, we’ve heard it all before. And we’ve heard all the satires now, too, with the likes of Josh Berry’s poshboy and gal takedowns, and Jack Whitehall pretty much took the self-deprecating posho spot long ago in the mainstream.\nBut Tom isn’t what he seems, and he’s certainly not boring. He’s the opposite to posh boys who attempt to thinly veil their wealth with their distressed garms, minimalist T-shirt businesses (yawn), greasy hair, flats in Finsbury Park and rollies bought in bulk from duty free so they can continue catch eyes with a dashing yellow Amber Leaf packet. We know the type.\nHe’s a funny man, with some truly bizarre stories to tell… (Picture: AEMEN SUKKAR JIKSAW)\nTom is reflective, honest, and isn’t shying away from who he is. Behind the jokes, his favourite thing about living in the Tower of London was reconnecting with his dad as an adult.\nAs well as his dad being away a lot for work, Tom was bundled off to a boarding school in the Lake District aged six. It was either that or change schools every one or two years with the military postings.\n‘It was quite genuinely, mentally scarring at six years old, being sent off. That’s quite a young age,’ Tom remembered. But all in all, it was the lesser of two evils.\nTom talks about his boarding school experience in much of his comedy, and has some interesting insights.\nThe weirdest thing about his whole experience in an all-boys boarding school was not some gross prank, or anything to do with a live animal (don’t know why this springs to mind) – but Tom recalled it was when his school went co-educational, and 22 girls arrived at the gates.\nBut the result was not the celebration you’d expect from 300 or so pubescent boys.\n‘The truth is, we were so inept dealing with it,’ he admitted. ‘We just all completely lost our minds and didn’t know how to talk to them and the hierarchies all shift as well. It was like who was the toughest was the hierarchy. But now, as a kid in drama and doing musicals I was friends with all the girls, so my popularity went up.’\nTom lived in the Tower of London for six years (Picture: AEMEN SUKKAR JIKSAW)\nBut there’s more. ‘When the school went co-ed they were so concerned about girls getting pregnant in the first year they introduced a five-inch rule, so you weren’t allowed to be within five inches of a girl.’\nThis naturally meant couples snuck off into the bushes, which caused a whole lot more drama than if they didn’t try to ‘damage control’.\n‘The intent was to cause damage control, but it was horrendously handled,’ reflected Tom, serious now.\nBefore the co-educational change, girls were introduced to the boys school in a very strange way, indeed.\nYou may have heard of boarding school children talking about ‘socials’ – those things that would happen every Saturday with the other all-girls or all-boys school, designed to let the two sexes interact.\n‘You’d be stuck in a sports hall for three hours [with the girls’ school] after playing rugby so it’s a sort of like, “Hey, as your reward here are some girls.”‘ And because you’ve only got three hours, and you don’t really know them…’ Tom cuts off.\n‘Genuinely I think lots of my friends growing up, we didn’t see girls as friends. We saw them as things you’re trying to kiss within three hours.\n‘It’s a very damaging way to be introduced to women as prizes or objects, and as such, when you go into the real world so many of my friends struggled to properly form friendships and relationships with women because you never got to experience them in any sort of down to earth, relaxed friendship way.\n‘I think it’s very, very damaging in the long run.’\nWhat a clever ghost.\nTo book tickets for Tom’s 2024 show It’s Not Ideal, please visit his website.\nGot a story?\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.\nMORE : ‘I fed my dad to a pelican’\nMORE : Katherine Ryan joins the I’m A Celebrity boycott as Jamie Lynn Spears makes shock exit", "source_domain": "metro.co.uk", "text": null, "title": "'I was a naked ghost in the Tower of London'", "title_page": null, "title_rss": null, "url": "https://metro.co.uk/2023/12/02/i-a-naked-ghost-tower-london-19901928/"}