{"authors": ["Adam Gabbatt"], "date_download": "2024-02-05 15:32:03", "date_modify": "None", "date_publish": "2023-12-02 14:00:47", "description": "Tahseen Ali Ahmad, Kinnan Abdalhamid and Hisham Awartani, all 20, are childhood friends and ‘incredibly tight’ – especially now", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fdec%2F02%2Fvermont-palestinians-students-three-friends-shot.json", "image_url": "https://i.guim.co.uk/img/media/402f0f514cc1d3d893fc242ebe3662b814e99c99/0_0_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8d216696b96447b268f4105f79011a31", "language": "en", "localpath": null, "maintext": "In Ramallah, in the West Bank, in the spring of 2021, three school friends huddled round their computer screens.\nHisham Awartani, Kinnan Abdalhamid and Tahseen Ali Ahmad had all applied to study at American universities. Responses from the colleges tended to come through by email, usually between midnight and 2am Palestinian time.\nThe 18-year-old Palestinians, who had been friends since they were small children, spent that period video-chatting. As each one opened his email – “yes, you have been accepted”; “sorry, your application has been denied” – he had two friends there for support.\nEventually, they were able to celebrate: all three earned places at universities, in Pennsylvania, Connecticut and Rhode Island. After a horrific shooting over the weekend, Awartani, Abdalhamid and Ali Ahmad have had to offer each other a different kind of support.\nThe three friends, all now 20 years old, were on their way to Thanksgiving dinner at Awartani’s grandmother’s house in Burlington, Vermont, when a white man fired at them with a handgun. One of the bullets struck Awartani’s spine, and he may not walk again.\nJason J Eaton, 48, was arrested on Sunday afternoon and charged with attempted murder. He has pleaded not guilty.\nPolice are investigating whether to charge Eaton with a hate crime; Burlington police say the three men had been speaking Arabic, and two had been wearing keffiyehs. The shooting has fuelled anxiety about the rise in violence against Muslim and Arab people in the US, which has also seen an increase in antisemitic incidents.\nIn the aftermath of the shooting, as the three were treated in hospital, there was some comfort in having each other there.\nAwartani (center) and Abdalhamid (right) with another childhood friend. Photograph: Courtesy Elizabeth Price\nAwartani and Abdalhamid have been friends since they were babies. “They were forced to be friends,” Awartani’s mother, Elizabeth Price, said, noting that their parents had been close. Ali Ahmad, who is keeping a low profile in the media as he recovers, has been part of the trio for almost as long, since joining the two at the Ramallah Friends School, where all three excelled.\n“They’re incredibly tight,” Price said.\n“I would say that they are brothers. And when they got shot, the hospital very kindly put all of them in one ICU room, and I think that was very instrumental in helping them to deal with the trauma of the experience.\n“They were teasing each other, and talking to each other. My mother slept there that first night and she said it was like a sleepover.”\nPrice, a US citizen who has lived in the West Bank for 25 years, arrived in Burlington on Wednesday, having traveled from Ramallah to Jordan before flying to the US.\nAwartani and Abdalhamid, who suffered the worst injuries, are in a lot of pain, Price said. Awartani has been left “potentially paralysed” by the shooting; he has feeling in his legs – a good sign, Price said – but cannot move them.\nStill, the 20-year-old has “been joking around” in recent days. His grandmother had recently bought him a Cardiff rugby shirt – Price’s family has links to Wales – and Awartani was quick to tell her that at least he hadn’t been wearing the shirt when he was shot.\n“He’s got a wicked sense of humor, which will stand him in good stead,” Price said.\n“Palestinians have had to struggle for 75 years in very difficult circumstances, and resilience is bred into these boys.”\nAwartani had been shot before: when he was a teenager in Palestine, the Israeli military shot him with a rubber bullet during a protest against Israel’s occupation. He has been studying at Brown University, a prestigious Ivy League college set on a leafy campus in Providence, for the past two years. He is working toward two degrees, in pure mathematics and archaeology, his mother said, and prior to Saturday, was planning work on an archaeological dig in Italy.\nIf all had gone to plan, Awartani would have seen his 13-year-old brother and 17-year-old sister later this month. He had been aiming to return to Ramallah for Christmas, although his father had concerns.\nView image in fullscreen Awartani with his mother, Elizabeth Price. Photograph: Courtesy Elizabeth Price\n“​​My husband really didn’t want Hisham to come back,” Price said.\n“Traveling on West Bank roads is very dangerous, so my husband did not want to expose Hisham to being hurt on the way back to Ramallah.”\nWhile Ramallah has been relatively safe since the Israel-Hamas war broke out in November, that’s not so for other parts of the West Bank. On Wednesday two boys, Adam Samer al-Ghoul, eight, and Basil Suleiman Abu al-Wafa, 15, were killed by Israeli Defense Forces in the city of Jenin. About 200 Palestinians have been killed by Israeli forces or settlers in the West Bank since Hamas’s rampage in southern Israel on 7 October, which killed about 1,200 people. The IDF’s retaliatory attacks on Gaza to the south have so far killed almost 15,000 people, including more than 6,000 children.\n“Now he’s not coming back,” Price said. “He’s not coming back for a while.”\nAwartani faces months of recovery. A written statement he provided after the shooting contained signs of his sense of humor.\n“Who knew that all I had to do to become famous was to get shot?” Awartani said in the statement, which was read out loud at a vigil at Brown by Beshara Doumani, a professor of Palestinian studies at the school.\nIn the statement, Awartani urged students to view what happened to him as part of a much broader context.\n“I am but one casualty in this much wider conflict. Had I been shot in the West Bank where I grew up, the medical services which saved my life here would likely have been withheld by the Israeli army. The soldier who would have shot me would go home and never be convicted,” Awartani said.\nView image in fullscreen People gather in Pliny Park in Brattleboro, Vermont, for a vigil on 27 November for Ali Ahmad, Abdalhamid and Awartani. Photograph: Kristopher Radder/AP\n“This is why when you send your wishes and later, candles for me today, your mind should not just be focused on me as an individual, but rather as a proud member of the people being oppressed.”\n‘He framed the Palestinian condition beautifully’\nAboud Ashhab, 20, went to school with Awartani in the West Bank. Both ended up at Brown.\nAshhab would call Awartani “Wikipedia” for the depth of his general knowledge. (“He’s like a kid in a candy store at Brown,” Price said of Awartani. “He’s studied Aramaic, he’s done Persian, he’s doing Italian, he was learning Spanish for a while, as well as doing graduate-level math courses, topology and algebra. ​​I think for him going to college is just exhilarating.”)\nBut Awartani and Ashhab don’t spend all their time studying. Awartani is a keen follower of Brighton and Hove Albion FC, the English football team, and is a “bit of a chef”, Ashhab said. Earlier this year he invited an intimidatingly large number of people over to their shared apartment for a mid-Ramadan feast.\n“We spent hours cooking,” Ashhab said. “We made so much. Hisham cooks a lot of Arab and Palestinian food. He also makes his own kefir yoghurt, we made baba ganoush … ”\nAshhab and Awartani both protested against Israeli strikes on Gaza in 2021, which is when Awartani was shot by a rubber bullet, Ashhab said, in a grim echo of what would happen in Vermont two years later.\nView image in fullscreen Awartani (right) with his friend Aboud Ashhab. Photograph: Courtesy Elizabeth Price\nBoth are also active in campus politics. They are members of the Brown Students for Justice in Palestine, and have spoken up against Brown University’s response to Israel’s actions in Gaza. In October, Ashhab, Awartani and several other students attended a meeting with university administrators to demand better protection for Arab students, and to ask the school to denounce Israel’s bombing campaign in Gaza.\nThe university’s response remains a source of frustration.\n“It took a Palestinian being shot to actually have some acknowledgement of what we’re going through from the university administration,” said Sherena Razek, a Palestinian-Canadian and a PhD candidate at Brown, who was part of the meeting with Brown higher-ups.\nRazek first met Awartani when he spoke at a vigil at Brown, held for lives lost in Gaza.\n“He was a profound speaker, his words really resonated with me. He shared a personal story. It’s also very upsetting to have heard Hisham share a personal story about having been targeted and shot by the Israeli military during a protest with a rubber bullet in his leg, and to see that these bullets followed him here to America,” Razek said.\n“But he just framed the Palestinian condition so beautifully. He has very young bright energy.”\nSince 7 October, when Hamas attacked Israel, and Israel responded with an unprecedented bombardment that has killed thousands and forced 1.8 million people to flee their homes, hate crimes against Muslim, Arab and Jewish communities have spiked, according to the FBI.\nThe charged climate in the US, and the government’s vocal support of Israel’s military campaign, have led many to fear for their safety, including Inteemum Ahsan, a friend of Abdalhamid at Haverford College.\nView image in fullscreen Classmates from Ramallah Friends School, including Tahseen Ali Ahmad (second from left), Kinnan Abdalhamid (center) and Hisham Awartani (far right). Photograph: Courtesy Elizabeth Price\n“As a brown Muslim student from Bangladesh, I am terrified,” Ahsan said.\n“Being reminded of the threat of violence and hate by the attack on Kinnan this weekend is horrifying and heartbreaking.”\nAhsan, 21, has been friends with Abdalhamid since the latter arrived at Haverford, about 10 miles north-west of Philadelphia, Pennsylvania.\n“He’s a warm, energetic person. He is a caring friend, and an impactful community member,” Ahsan said.\nAbdalhamid, who holds US citizenship, was released from hospital on Thursday. A pre-med student at Haverford, he’s described as “something of a science genius” by Micah, a close friend who asked that his real name not be used, adding: “We love to jump around singing our favorite hip-hop lyrics completely carefree.”\nIn addition to listening to music, Micah and Abdalhamid lift weights together, Micah said, where they “are constantly competing”. (Micah did not say who could lift more.) Abdalhamid, a talented runner, is a member of the men’s track and field team.\nThe shooting has left friends and family of the three men confused, angry and sometimes scared.\n“I felt so sad, angry and shocked,” Micah said. “I also felt a sense of guilt. Kinnan, a US citizen, came to America seeking an education, and this is how we treat him? I also began to think about how desensitized even I am, a Black American man, to hateful violence.”\n“For the past two months, I have been reading in the news every day about Israel’s bombing and killing of Palestinians in Gaza ... it’s easy to forget that each one of them is loved and supported by a big network of friends and family, just like Kinnan is.”", "source_domain": "www.theguardian.com", "text": null, "title": "Young, bright, Palestinian: the three friends shot in Vermont", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/dec/02/vermont-palestinians-students-three-friends-shot"}