{"authors": ["Mohamad Bazzi"], "date_download": "2024-02-05 15:15:49", "date_modify": "None", "date_publish": "2024-01-25 11:01:44", "description": "The Houthis are eager to show that they can stand up to the world’s most powerful country, all for the Palestinian cause", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2024%2Fjan%2F25%2Fjoe-biden-us-middle-east-war-houthis-gaza.json", "image_url": "https://i.guim.co.uk/img/media/c82098e203037655c531620d414216ad7d23ecd4/0_56_3912_2348/master/3912.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a8756a64e49ab15b9dccfafeb108ad6f", "language": "en", "localpath": null, "maintext": "As a presidential candidate, Joe Biden made a forceful case for restraining US military intervention and ending the wars that America had unleashed after the September 11 attacks. “The use of force should be our last resort, not our first,” he said in a July 2019 speech, adding that military power should be “used only to defend our vital interests, when the objective is clear and achievable … It’s past time to end the forever wars, which have cost us untold blood and treasure.”\nYet Biden is now dragging the US into another potential war, one which doesn’t meet many of the standards he set out as a candidate. The Biden administration is risking a wider conflict with the Houthis in Yemen, amid reports that the Pentagon is preparing a “sustained military campaign”, after nearly two weeks of air and missile strikes failed to stop them from attacking shipping vessels in the Red Sea.\nOn 18 January, when reporters in Washington DC asked Biden if US attacks on Houthi targets were working, he was remarkably candid. “Are they stopping the Houthis? No,” he said. “Are they gonna continue? Yes.”\nBiden and his administration are practically sleepwalking the US into another war – this time in Yemen, where Washington has already helped provoke one of the world’s worst humanitarian crises thanks to its support of Saudi Arabia in a years-long conflict against the Houthis.\nRemarkably, Biden and his aides have consistently said that one of their top priorities is to prevent Israel’s devastating invasion of Gaza, which began after the 7 October attacks by Hamas, from spreading into a regional conflict that could spiral out of control. But the Gaza invasion has already spilled into clashes in Lebanon, Iraq, Syria, Yemen and the Red Sea.\nFor months, Biden has avoided the most clear-cut solution to avert a wider conflagration: pressuring the Israeli government to end its assault on Gaza and negotiate a ceasefire with Hamas.\nNetanyahu ... has the most to gain by prolonging the Gaza conflict, so that he can avoid a political reckoning in Israel over multiple corruption charges ...\nThe US administration has multiple options to lean on the Israeli prime minister, Benjamin Netanyahu. It could threaten to withhold billions of dollars in military aid, which allow Israel to continue its assault, or it could stop using Washington’s veto power on the UN security council to quash resolutions calling for a ceasefire. Instead, Biden and his aides have gone out of their way to deal with the regional conflict as somehow separate from the war in Gaza – a kind of wishful thinking motivated by treating symptoms rather than finding the cure for an underlying illness.\nBy getting more deeply involved in Yemen, Biden is acting against his own interests – as well as larger US security priorities – during a presidential election campaign when he’s likely to face Donald Trump once again. Netanyahu, on the other hand, has the most to gain by prolonging the Gaza conflict, so that he can avoid a political reckoning in Israel over multiple corruption charges and an investigation into whether his administration could have prevented the 7 October attacks.\nThe Houthis began the Red Sea attacks in late October, when they started firing missiles and drones at – and, in some cases, trying to hijack – commercial vessels sailing through the area. The Houthis claimed they were acting in support of the Palestinians and said they would stop targeting ships once Israel ends its invasion of Gaza.\nThe attacks prompted the world’s largest shipping companies to reroute vessels around South Africa, which can add thousands of miles to a freighter’s journey between Asia and Europe. With global companies facing skyrocketing fuel, labor and insurance costs, the Biden administration last month assembled an international coalition to protect commercial ships in the region.\nWhen the Houthis would not back down, the US and Britain launched air and missile strikes against dozens of targets in Yemen on 12 January. Since then, the US military has struck Yemen eight times, most recently on Monday night. But Houthi leaders are undaunted and they’ve promised to exact revenge against the US and Britain.\nThe Houthis are portraying themselves as one of the few forces in the Middle East willing to stand against Israel and its western allies in defense of the Palestinian cause. At a rally in Yemen’s capital, Sana’a, after the first wave of US strikes, thousands of people chanted, “We don’t care – make it a world war.”\nHouthis leaders are also using the global attention to enhance their reputation throughout the Middle East and raise their standing within the “axis of resistance”, a network of regional militias supported by Iran. Aside from the Houthis and Hamas, the alliance also includes several Shia militias in Iraq and Syria, and the powerful Lebanese militant group Hezbollah. Since 7 October, this alliance has tried to increase the stakes of the Gaza war by striking at Israeli and US targets across the region.\nWith its persistent support of Israel, the Biden administration has alienated its allies in the Arab world and it has been unable to convince two states that fought a seven-year war with the Houthis, Saudi Arabia and the United Arab Emirates, to join the Red Sea task force. Because of their experience fighting the Houthis – with billions of dollars in US weapons and intelligence support – Saudi and UAE leaders are trying to avoid instigating the militia, which carried out missile and drone attacks in both countries.\nThe Saudis also want to maintain a tenuous ceasefire with the Houthis, which was brokered by the UN in 2022. The two sides are still negotiating a permanent deal that would recognize Houthi control over parts of Yemen, including the capital, and provide Saudi reparations.\nDuring years of fighting with the Houthis, Saudi leaders learned a lesson that the Biden administration appears to have forgotten in the current confrontation: it’s nearly impossible to dislodge an Indigenous insurgent movement without a huge commitment of ground troops. Even then, as the US military realized during its wars in Afghanistan and Iraq, it’s costly to maintain an indefinite occupation.\nThe Houthis, who are officially known as Ansar Allah, or the Partisans of God, have been around since the 1990s as a Shia tribal movement based in northern Yemen that fought repeated battles against Yemen’s central government and its Saudi backers. In September 2014, the Houthis intensified Yemen’s civil war when they marched into the capital and within a few months forced the internationally recognized government to flee to Saudi Arabia.\nBy March 2015, the Saudis led an alliance of Sunni Arab states to intervene in Yemen, trying to dislodge the Houthis from Sana’a through a blockade and ultimately thousands of air strikes. By the end of 2021, the UN estimated that the conflict had killed 377,000 people – nearly 60% of whom died not through fighting but from other causes, such as cholera outbreaks, food shortages and destruction of the healthcare system.\nThe Houthis survived the US-backed onslaught, and emerged stronger than they had been at the start of the war. Today, the militia is eager to show the world that it can withstand not just a sustained military assault by Saudi Arabia, a US ally, but by Washington itself.\nSince Biden refuses to pressure Israel to stop its bombardment of Gaza and accept a ceasefire, he is escalating the US confrontation with the Houthis. In the process, Biden risks entangling the US in another open-ended conflict, which is likely to expand by accident or miscalculation, rather than by design. Either way, it threatens to prolong the forever wars.", "source_domain": "www.theguardian.com", "text": null, "title": "Why is Joe Biden dragging the US into another potential war?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2024/jan/25/joe-biden-us-middle-east-war-houthis-gaza"}