{"authors": [], "date_download": "2024-02-05 15:32:05", "date_modify": "None", "date_publish": "2023-12-02 11:25:49", "description": "France and the Philippines are considering a defense pact that would allow them to send military forces to each other’s territory for joint exercises", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Ffrance-ap-united-states-manila-minister-b2457289.html.json", "image_url": "https://static.independent.co.uk/2023/12/02/11/Philippines_France_09003.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nFrance and the Philippines are condiering a defense pact that would allow them to send military forces to each other’s territory for joint exercises, the Philippine defense chief said Saturday after holding talks with his French counterpart.\nGilberto Teodoro Jr. said in a joint press conference with French Minister for the Armed Forces Sebastien Lecornu that they were seeking authorization from their heads of state to begin negotiations.\n\"We intend to take concrete steps into leveling up and making more comprehensive our defense cooperation, principally by working to get authorization from our respective heads of state and relevant agencies to begin negotiations for a status of visiting forces agreement,” Teodoro said.\n“The first goal is to create interoperability or a strategic closeness between both armed forces, see how both navies work together, how air forces work together,” Lecornu said through an interpreter.\nThe Philippines has such an agreement — which provides a legal framework for visits of foreign troops — only with the United States, its longtime treaty ally, and with Australia. Negotiations between the Philippines and Japan are also underway for a reciprocal access agreement that would allow Japanese and Philippine troop deployments to one another for military exercises and other security activities.\nThe Philippine and French defense chiefs agreed to deepen defense cooperation, including by boosting intelligence and information exchanges to address security threats, Teodoro said.\nThey agreed to sustain Philippine and French ship visits and underscored the importance of upholding international law, including the 1982 U.N. Convention on the Law of the Sea, he said.\nThat language has often been used by the U.S. and the Philippines, along with their allies, in their criticism of China for its increasingly aggressive actions in the disputed South China Sea.\nFrance has deployed its navy ships to the South China Sea to promote freedom of navigation and push back against Chinese expansionism. China claims virtually the entire waterway and has constructed island bases protected by a missile system in the past decade, alarming smaller claimant states, including the Philippines, Vietnam and Malaysia.\nWashington has repeatedly warned that it is obligated to defend the Philippines, its oldest treaty ally in Asia, if Filipino forces, ships and aircraft come under armed attack, including in the South China Sea.\nThe Philippines recently staged joint air and naval patrols separately with the U.S. and Australia in the South China Sea, provoking an angry reaction from China, which warned that the joint patrols should not harm its sovereignty and territorial interests.\nPhilippine National Security Adviser Eduardo Ano said Friday that the joint patrols with U.S. and Australia would continue and could be expanded to include other friendly nations like Japan.\nAno spoke to invited journalists on Thitu Island, a Philippine-occupied island in the South China Sea, where he led the inauguration of a new coast guard monitoring station that would be equipped with a radar, satellite communications, coastal cameras and ship-tracking equipment to help counter what he described as China's “pure bullying.”", "source_domain": "www.independent.co.uk", "text": null, "title": "France and Philippines eye a security pact to allow joint military combat exercises", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/france-ap-united-states-manila-minister-b2457289.html"}