{"authors": ["Lisa Letcher", "Image", "Kcna Via Kns Afp Via Getty Image", "Ap"], "date_download": "2024-02-05 15:32:07", "date_modify": "None", "date_publish": "2023-12-02 16:56:03", "description": "The country in East Asia says if the US interferes with its satellites it would amount to a declaration of war and the country would take 'responsive action measures' to defend itself in response", "filename": "https%3A%2F%2Fwww.dailystar.co.uk%2Fnews%2Fworld-news%2Fnorth-korea-sparks-war-fears-31582000.json", "image_url": "https://i2-prod.dailystar.co.uk/incoming/article31582133.ece/ALTERNATES/s1200/1_NKOREA-SKOREA-SATELLITE-MISSILE.jpg", "language": "en", "localpath": null, "maintext": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nSomething went wrong, please try again later.\nNever miss any of the fun stuff. Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday email\nNorth Korea has threatened to declare war if the United States dares to interfere with its space satellite operations.\nThe country, led by Kim Jong Un, says there would be \"responsive action\" if this was to happen. It made the stark declaration on Saturday (December 12) remarking that any interference with its satellite operations would be a declaration of war and would mobilize its war deterrence if any attack against its strategic assets was imminent.\nState media KCNA reported Pyongyang - the capital and largest city of North Korea - would respond to any US interference in space by eliminating the viability of US spy satellites, citing a statement made by North Korea’s defense ministry spokesperson.\nREAD MORE: WW3 threat as Putin ally warns European Borders will not 'exist much longer'\nFor all the latest news on North Korea, click here.\nThe statement said: “In case the US tries to violate the legitimate territory of a sovereign state by weaponizing the latest technologies illegally and unjustly, the DPRK (the Democratic People’s Republic of Korea) will consider taking responsive action measures for self-defense to undermine or destroy the viability of the US spy satellites.\"\nIt comes after North Korea declared a successful launched of its first military spy satellite on November 12, which is used to transmit photos of military installations in the US, Japan and the US territory of Guam. After failed attempts in May and August, the official Korean Central News Agency reported that a rocket had blasted off late on November 21 and \"accurately put the reconnaissance satellite 'Malligyong-1' on its orbit\".\n(Image: KCNA VIA KNS/AFP via Getty Image)\nA US Space Command spokesman, asked if Washington had the capability to interrupt the North Korean satellite's reconnaissance operations, said the US could deny an adversary's space capabilities using a variety of means, according to broadcaster RFA.\nIn a statement issued later, North Korea's foreign ministry said it will take countermeasures against individuals and organisations of the US and \"its vassal forces\" that impose and enforce sanctions against North Korea, saying that US sanctions violate international law\n(Image: AP)\nThe United States on Thursday targeted North Korea with fresh sanctions after the launch, designating foreign-based agents it accused of facilitating sanctions evasion to gather revenue and technology for its weapons of mass destruction programme.\nFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletter by clicking here.", "source_domain": "www.dailystar.co.uk", "text": null, "title": "North Korea sparks war fears as satellite interference would see 'responsive action'", "title_page": null, "title_rss": null, "url": "https://www.dailystar.co.uk/news/world-news/north-korea-sparks-war-fears-31582000"}