{"authors": ["Dan Sabbagh", "Jason Burke"], "date_download": "2024-02-05 15:32:08", "date_modify": "None", "date_publish": "2023-12-01 18:48:44", "description": "More than 170 Palestinians killed as Red Cross head warns ‘nightmarish situation’ for civilians has returned", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F01%2Fisrael-hamas-war-ceasefire-ends-fighting-resumes-gaza-palestine.json", "image_url": "https://i.guim.co.uk/img/media/a14a9db2db0bb2bb2c67e7f6b67a2379aa6d10ab/0_33_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=103b024ba344cbfe9f1199e9bfff6e99", "language": "en", "localpath": null, "maintext": "Israel attacked targets across Gaza after the end of a seven-day ceasefire on Friday, leaving more than 170 Palestinians dead after negotiations over further hostage releases fell apart overnight.\nIsrael’s military said it had attacked 200 targets from land, sea and air across the north and south of the strip by lunchtime, including in Khan Younis, a southern city from which it had ordered civilians to evacuate.\nHomes and other buildings were destroyed by the bombing in Gaza while aid to its 2.3 million people was halted, prompting Robert Mardini, the head of the Red Cross, to warn that a “nightmarish situation” for civilians had returned.\nThe Hamas-run ministry of health said that 178 Palestinians had been killed and 589 wounded in Gaza since Israel resumed bombing on Friday morning, with most casualties being women and children.\nSirens also went off repeatedly in southern Israel, starting before the ceasefire expired at 7am, and continuing throughout the day as Hamas resumed a campaign of rocket attacks. Nobody in Israel was reported killed.\nIsrael said the truce had been broken by Hamas and could not be renewed because the group had failed to offer to release the remaining female hostages in Gaza. Eylon Levy, a government spokesperson, said: “Having chosen to hold on to our women, Hamas will now take the mother of all thumpings.”\nHamas said some of the women asked for were Israeli soldiers, and that it had offered to hand over two other detainees plus the bodies of three members of the Bibas family it said had been killed by Israeli bombing, but this was rejected. In a statement, Hamas accused Israel of making a “prior decision to resume its criminal aggression against the Gaza Strip”.\nThe fighting ended a fragile seven-day truce during which 80 Israeli hostages and 24 foreign nationals were released by Gaza, while Israel released 240 Palestinian prisoners from its jails. Limited humanitarian aid had gone into Gaza, as food, water and medicines remain desperately short.\nResidents of Khan Younis, in the south of the strip, reported that 10 homes were destroyed in a bomb attack on Friday, and film from Al Jazeera showed a devastated area near the city’s refugee camp. Bombing was reported across Gaza, with Israel confirming it had attacked Khan Younis and Rafah farther south.\n“I deeply regret that military operations have started again in Gaza,” said António Gutteres, the UN secretary general. “I still hope that it will be possible to renew the pause that was established. The return to hostilities only shows how important it is to have a true humanitarian ceasefire.”\nNegotiations were continuing to restart the truce with the release of more hostages, said the US and Qatar, who have been acting as brokers. There are 137 people still held hostage, 20 women and 117 men, many of whom are Israeli military personnel. Until now, Israel has offered a day of truce in return for every 10 people returned – and agreed to release 30 Palestinians it holds.\nIsrael’s military said it was dividing the entirety of Gaza into dozens of numbered blocks as a prelude to demanding targeted local evacuations in the crowded south of the strip before attacking a highlighted area. It dropped leaflets on to Gaza with a QR code to a website with a map of all the areas and geolocating people within them.\nEarlier this week, Israeli military sources said they anticipated the next phase of the operation in Gaza to involve an attack on the south, and in particular Khan Younis, where Israel believes Hamas’s leadership is based. Israel Defense Forces (IDF) would call for the civilian population to relocate on a district-by-district basis before targeting the area with airstrikes and artillery, they added.\nHumanitarian groups said on Friday that a plan to divide and attack the south, where 2 million people were sheltering, risked stretching Gaza to breaking point. “There is fundamentally nowhere for people to go,” said Danila Zizi, the Palestine country manager for the charity Humanity & Inclusion.\nDoctors in Gaza said that though some of the IDF strikes appeared precisely targeted to avoid hospitals or areas with big concentrations of civilians, some were not. Most dangerous was shelling or other retaliation by the IDF after the launch of rockets from Gaza, with many being fired from or near urban areas, the doctors said.\nCivilian casualties began arriving at the European hospital in Khan Younis, one of the few still functioning in Gaza, from mid-morning, with surgeons performing dozens of amputations and other operations throughout the day. Casualties included a two-year-old, whose legs had been smashed by shrapnel, and his older brother. The rest of the family had been killed, one surgeon said.\nOvernight, six more Israelis, some holding dual nationality, were released, hours after two women were freed. That brought the total of people freed on Thursday to eight, fewer than the 10 hostages a day the truce deal required Hamas to release. A source close to the militant group said it was counting two Russian-Israeli women released on Wednesday as part of the seventh batch.\nFighting began on 7 October when Hamas militants broke through Gaza’s perimeter fence into Israel. About 1,200 people, mostly civilians, were killed in the surprise attack, in their homes and at a music festival, and Hamas kidnapped about 240 people, according to Israeli authorities.\nIsrael vowed to eliminate Hamas in response and began an air and ground military campaign in Gaza that the Hamas government there says has killed more than 15,000 people, mostly civilians.\nThere are concerns that hostilities will restart on Israel’s northern border, where Hezbollah observed a unilateral ceasefire over the last seven days. The Lebanon-based Islamist militia and political organisation was not party to the negotiations between Hamas and Israel.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel launches strikes on Gaza as fighting resumes after truce expires", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/01/israel-hamas-war-ceasefire-ends-fighting-resumes-gaza-palestine"}