{"authors": ["Tatiana Krisztina", "Image", "Afp Via Getty Images", "Getty Images"], "date_download": "2024-02-05 15:32:11", "date_modify": "None", "date_publish": "2023-12-01 05:26:00", "description": "The week-long ceasefire has ended between Israel and Hamas as the Israel Defense Forces confirmed the war has continued and air strikes have commenced in the Gaza Strip", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fisrael-hamas-ceasefire-ends-abruptly-31570791.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31571064.ece/ALTERNATES/s1200/0_TOPSHOT-PALESTINIAN-ISRAEL-CONFLICT.jpg", "language": "en", "localpath": null, "maintext": "The week-long ceasefire has ended between Israel and Hamas as the Israel Defense Forces confirmed the war has continued and air strikes have commenced in the Gaza Strip\nCombat has resumed in the war between Israel and Hamas following a ceasefire which saw more than 100 innocent hostages released.\nIsrael's military said it resumed combat operations in the Gaza Strip minutes after a temporary truce officially came to an end. It has blamed the militant group for breaking the cease-fire. The halt in fighting began on November 24 and was initially meant to be for four days, however it was extended - which meant more hostages were feed.\nIsrael Defense Forces confirmed fighting has continued on social media. The official account wrote: \"Hamas violated the operational pause, and in addition, fired toward Israeli territory. The IDF has resumed combat against the Hamas terrorist organization in Gaza.\"\nREAD MORE: Kissinger's final warning that Israel-Gaza war could engulf Arab world\nImage: AFP via Getty Images) AFP via Getty Images)\nAccording to BBC, air strikes have begun in the southern Gaza Strip according to their sources inside Gaza and the Hamas-run national security ministry's Telegram account. These strikes come about 30 minutes after the IDF's announcement that the ceasefire was over.\nBBC also claimed that explosions can be seen on a live feed and their sources report fighting in the northwest of Gaza City. The IDF said that its fighter jets are going after Hamas targets in the Gaza Strip.\nImage: Getty Images) Getty Images)\nDuring the week-long truce, Hamas and other militants in Gaza released more than 100 hostages, most of them Israelis, in return for 240 Palestinians freed from prisons in Israel. The majority of those released were women and children, including four-year-old American Abigail Edan.\nFriday morning, Israel accused Hamas of violating the ceasefire, saying they fired rockets towards Israel from Gaza. IDF claims to have intercepted these rockets.\nImage: AFP via Getty Images) AFP via Getty Images)\nQatar and Egypt, which have played a key role as mediators had sought to prolong the truce by another two days. Their goal was allow the release of more hostages and prisoners while also bringing humanitarian aid to the strip. Reaching an agreement on prisoner and hostage releases appeared to be getting tougher as most women and children in Gaza have already been released.\nAmerican Secretary of State Antony Blinken is currently in the Middle East and was told yesterday but Israeli officials that they were going to resume military action at some point. Blinkin has advised Israel to try and make \"humanitarian civilian protection plans\" before the ceasefire ends and to avoid damaging any important infrastructure such as hospitals or power stations. The secretary of state met with Israeli leaders and Palestinian President Mahmoud Abbas in the West Bank.\nReports claim that over 14,500 lives have been taken and more than 1.7 million people have been displaced in Gaza since the Israeli attacks. The IDF said about 1,200 people were killed in the October 7 attack and around 160 people are still held hostage in Gaza.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel and Hamas ceasefire ends abruptly with air strikes in the Gaza Strip", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/israel-hamas-ceasefire-ends-abruptly-31570791"}