{"authors": ["Chiara Fiorillo", "Image", "Ap", "Apaimages Rex Shutterstock", "Supplied", "Manchester Evening News", "Ismael Mohamad Upi Rex Shutterstock"], "date_download": "2024-02-05 15:32:12", "date_modify": "None", "date_publish": "2023-12-01 15:56:30", "description": "A temporary truce between Israel and Hamas began on November 24 and was renewed twice before ending today. Fighting has now resumed in Gaza, leaving Palestinians terrified once again", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fisrael-hamas-war-end-gaza-31575150.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31575814.ece/ALTERNATES/s1200/0_Israel-Resumes-Bombing-of-Gaza-after-Seven-day-Ceasefire-Ends-Rafah-30-Nov-2023.jpg", "language": "en", "localpath": null, "maintext": "A temporary truce between Israel and Hamas began on November 24 and was renewed twice before ending today. Fighting has now resumed in Gaza, leaving Palestinians terrified once again\nThe end of a temporary ceasefire in Gaza and the resumption of fighting between Israel and Hamas have been described by the UN as \"the nightmare that everyone feared\".\nIsrael restarted bombing the Gaza Strip after the truce expired today - and the renewed clashes are \"catastrophic for the people of Gaza\", said James Elder, a spokesman for Unicef. Speaking from a hospital in Khan Younis, in southern Gaza, Mr Elder said there was a strike nearby, with ambulances at the scene and plumes of smoke visible in the sky.\nHe said that Nasser Hospital was \"overflowing with children and people with wounds of war\" recovering from the last attack. He added that many families had been sleeping on mattresses at the hospital for weeks after being displaced from their homes - many of which have been destroyed by Israeli air strikes.\nImage: AP) AP)\nMr Elder told the BBC's Newsday programme: \"This hospital cannot possibly cope with a surge in wounds from the battlefield with more children with burns, with those horrendous shrapnel injuries.\" On Friday morning, the Israel Defense Forces (IDF) said Hamas had opened fire at Israel, violating the terms of the temporary ceasefire agreement and leading to the resumption of hostilities.\nLeaflets dropped by the IDF warned that Khan Younis is a \"dangerous combat zone\" and urged people in some areas to head further south. Hundreds of thousands of people fled northern Gaza earlier in the war, with many taking shelter in Khan Younis and other places in the south.\nMost of Gaza's population is now crammed into the south with no exit, raising questions over how an Israeli offensive there can avoid heavy civilian casualties. One of the first airstrikes on Friday destroyed a large building in Khan Younis.\nMoments later, residents were seen frantically searching the rubble for survivors as medics approached. One wounded person was carried away on a stretcher. In Hamad City, a Qatari-funded housing development near the city, a strike hit an apartment in a multi-story residential building, while other parts of the building appeared largely intact. Elsewhere, a strike hit a home near Gaza City in the north.\nImage: APAImages/REX/Shutterstock) APAImages/REX/Shutterstock)\nIn the refugee camp of Maghazi, near the Gaza Strip's center, rescuers clawed through the rubble of a large building hit by warplanes. A foot stuck out of the tangle of concrete and wiring.\nDuring the week-long truce, Hamas and other militants in Gaza released more than 100 hostages, most of them Israelis, in return for 240 Palestinians freed from prisons in Israel. Mediators Qatar and Egypt had sought to prolong the break in fighting by another two days.\nWeeks of Israeli bombardment and a ground campaign have left more than three-quarters of Gaza's population of 2.3 million uprooted, leading to a humanitarian crisis. More than 13,300 Palestinians have been killed - roughly two-thirds of them women and children - according to the health ministry in Gaza. Some 1,200 Israelis have been killed, mostly on October 7.\nA British Palestinian in Gaza said the truce in the territory brought temporary \"relief\" but he has no plans to leave even as hostilities restart because he refuses to be \"driven out of his homeland\". Mohammed Ghalayini, an atmospheric scientist from Manchester, said he initially travelled to Gaza in September for a holiday in hopes of moving to his homeland in the future.\nImage: AP) AP)\nThe 44-year-old decided to stay in Gaza despite his mother, sister and father fleeing to Britain with help from the Foreign Office because he refuses to be \"driven out\" of his homeland. \"I stayed because while I've lived in the UK close to 20 years now, I came back on this trip in September to move back, to look at living in Gaza again,\" he said.\n\"I refuse that the Israeli army dictates where I should live and how I should relate to my homeland, and I refuse to be driven out like that. I have a community here that I can support and bolster, family, friends, society; so why should people be forced out by a foreign military force, it's collective punishment and it should not fly.\"\nMr Ghalayini is currently living in a three-bedroom flat in the southern Gaza city of Khan Younis with 25 family members, including 10 children, and said a continued blockade on supplies has left his family with \"barely\" enough food and other essentials. Before the truce began, Mr Ghalayini had been moving from place to place within Gaza with extended family as Israeli attacks destroyed buildings around them, he said.\nHe said he was shown a photo of his family home near the beach with smashed windows, snipers on the roof and tanks below, while a subsequent flat his family stayed in has been destroyed. \"After that, I sheltered in my father's place and in the time since leaving there, that also has serious damage from bombing,\" he said.\nImage: Supplied) Supplied) Image: Manchester Evening News) Manchester Evening News)\n\"We (then) sheltered in a hotel in north Gaza ... and while we were staying there, there was bombing almost every hour of the day on apartment blocks nearby. That broke windows in, debris fell in and around the hotel, it brought down ceilings, and then after we left (the hotel), it's been bombed.\"\nHe said he and his family have endured food and fuel shortages, which did not abate despite the temporary truce in the territory. \"We struggle every day, there are massive shortages of flour, shortages and price inflation for all goods, for example, yeast usually sells for five shekels (£1.07) - that now costs between 30 and 50 shekels (£6.42 to £10.70),\" he said.\nHe said the truce did not \"bring back normality\" but added it was \"a relief to feel you can travel and go out of the city and feel safe\". He explained: \"We couldn't travel out of the city without risk and so we were only doing the necessary essential journeys.\"\nImage: Ismael Mohamad/UPI/REX/Shutterstock) Ismael Mohamad/UPI/REX/Shutterstock)\nDuring the pause in aggression, he cycled down to the beach, which he said was a \"bittersweet\" experience. \"I was there in this very beautiful beach scene but then people were also scavenging for whatever resources they could find at the moment,\" Mr Ghalayini said. \"Fuel is very short so people were taking out telephone poles, people were dismantling huts and what have you and just taking the wood to burn.\"\nThe scientist, who left Gaza for the UK in 2004, said his family could harvest olives in his mother's garden due to the ceasefire. He said: \"My mother has a very small plot of land with 20 olive trees and because of the Israeli attack on Gaza we've not been able to harvest that until the truce came.\n\"There's a mass of people who rely on this land for their subsistence, our land is meant to yield 200 kilograms of olives, however this year we were only to yield 80 kilograms because of the delayed harvest, subsequently we are suffering financially.\" The Foreign, Commonwealth & Development Office has advised against all but essential travel to Israel and Palestinian territories.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel-Hamas war: End of Gaza ceasefire is 'the nightmare that everyone feared', says UN", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/israel-hamas-war-end-gaza-31575150"}