{"authors": [], "date_download": "2024-02-05 15:32:13", "date_modify": "None", "date_publish": "2023-12-01 07:58:57", "description": "The Philippine coast guard has opened a new surveillance base on a remote island occupied by Filipino forces in the disputed South China Sea as Manila ramps up efforts to counter China’s increasingly aggressive actions in the strategic waterway", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fphilippines-ap-chinese-united-states-manila-b2456695.html.json", "image_url": "https://static.independent.co.uk/2023/12/01/09/Philippines_South_China_Sea_Disputed_Island_87200.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe Philippine coast guard inaugurated a new monitoring base Friday on a remote island occupied by Filipino forces in the disputed South China Sea as Manila ramps up efforts to counter China’s increasingly aggressive actions in the strategic waterway.\nConfrontations between Chinese and Philippine ships have intensified this year in the contested waters, resulting in minor but alarming collisions near the disputed Second Thomas Shoal occupied by a Filipino marine contingent in October.\nThe high-seas faceoffs have fueled fears of a larger conflict that could involve the United States, which has repeatedly warned that it’s obligated to defend the Philippines, its oldest treaty ally in Asia, if Filipino forces, ships and aircraft come under an armed attack, including in the South China Sea.\nChina has accused the U.S. of meddling in an Asian dispute and sowing discord in the region.\nNational Security Adviser Eduardo Ano and other Philippine officials flew to Thitu Island on an air force plane Friday and led a ceremony to open the newly constructed, two-story center that will have radar, ship-tracking and other monitoring equipment — either already installed or added early next year — to monitor China’s actions in the hotly disputed waters and other problems, including sea accidents.\n“It’s no longer gray zone. It’s pure bullying,” Ano told reporters after the ceremony, describing the actions of Chinese ships as flouting international law.\nLater peering through a mounted telescope on the island, Ano said he spotted at least 18 suspected Chinese militia ships scattered off Thitu, including a Chinese navy vessel.\nVillagers say they have gotten used to the sight of Chinese ships lurking at a distance from Thitu, but a few say they’re still haunted at times by the fear of Chinese forces intruding one day into the island.\n“I can’t avoid thinking sometimes that they would suddenly barge into our territory,” said Daisy Cojamco, a 51-year-old mother of three whose husband works as a town government employee.\nSurrounded by white beaches, the tadpole-shaped Thitu Island is called Pag-asa — Tagalog for hope — by about 250 Filipino villagers. It’s one of nine islands, islets and atolls that have been occupied by Philippine forces since the 1970s in the South China Sea’s Spratlys archipelago.\nThe Philippines claims the region as its most remote offshore township, under its western island province of Palawan. It has encouraged fishing families to move there with incentives such as free rice, to underscore its control over an area also claimed by China and Vietnam.\nThe 37-hectare (91-acre) island now boasts internet and cellphone connections, a more stable power and water supply, a newly cemented runway, a wharf, grade school, gymnasium and even an evacuation center in times of typhoons. However, Thitu remains a meagre frontier settlement compared to the Chinese-built Subi island, more than 22 kilometers (14 miles) away.\nSubi is one of seven mostly submerged reefs that China transformed starting about a decade ago into a missile-protected cluster of island bases, three of them with military-grade runways, sparking alarm among other claimant states in the South China Sea.\nPhilippine aircraft and ships, including those visiting Thitu island, have routinely been warned by the Chinese coast guard via radio calls to stay away from what China claims as its territory or face unspecified repercussions. The Filipinos have countered with their own radio messages, ordering the Chinese to leave their territory and stop dangerous and provocative maneuvers.\nIt was not immediately clear if Chinese radio warnings were sent to the Philippine air force and coast guard planes that brought Ano and other officials to Thitu on Friday along with three Associated Press journalists and several other invited members of the media.\nDwarfed by China’s military might, the Philippines has decided this year to allow an expansion of U.S. military presence in its local camps under a 2014 defense pact. It also recently launched joint sea and air patrols with the United States and Australia in a new deterrent strategy that puts the two allied powers on a collision course with Beijing.\nChina has warned that such joint naval patrols must not hurt its “territorial sovereignty and maritime rights and interests.”\nSince President Ferdinand Marcos Jr. took office last year, the Philippines has been deepening its security ties with Washington and U.S. allies like Japan and Australia in a major shift from his predecessor, Rodrigo Duterte, who had nurtured cozy relations with Chinese President Xi Jinping and Russian leader Vladimir Putin while criticizing Western security policies.\nDuterte had mostly kept the territorial disputes with Beijing on a backburner during his six-year term.\nEarly this year, the Marcos administration launched a strategy of exposing China’s aggressive actions in the South China Sea, including the Chinese coast guard’s use of a military-grade laser and water cannons and the blocking of Philippine patrol ships and supply boats near disputed shoals, to draw international attention to such aggression, according to Philippine officials.\nSpeaking in Honolulu, where he met U.S. military leaders about two weeks ago, Marcos said the situation in the South China Sea “has become more dire” with China showing interest in atolls and shoals that are “closer and closer” to the Philippine coast.\nBut he stressed that the Philippines wouldn’t yield.\n“The Philippines will not give a single square inch of our territory to any foreign power,” Marcos warned.\n___\nFollow AP's Asia-Pacific coverage at https://apnews.com/hub/asia-pacific", "source_domain": "www.independent.co.uk", "text": null, "title": "Philippines opens a coast guard surveillance base in the South China Sea to watch Chinese vessels", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/philippines-ap-chinese-united-states-manila-b2456695.html"}