{"authors": ["Russ Weakland", "Russ Weakland For Dailymail.Com"], "date_download": "2024-02-05 15:32:16", "date_modify": "None", "date_publish": "2023-12-01 16:12:48", "description": "Gigi, 28, backtracked and apologized to her followers this week after sharing claims on Instagram that Israel is 'the only country in the world that keeps children as prisoners of war'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ftvshowbiz%2Farticle-12810111%2Fgigi-hadid-fears-bradley-cooper-backlash-israel-palestinians.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/30/17/78429359-0-image-m-32_1701363919374.jpg", "language": "en", "localpath": null, "maintext": "Gigi Hadid is worried that she may have caused 'collateral damage' for her rumored love interest Bradley Cooper after receiving a backlash for a social media post she shared about the Israeli government.\nThe supermodel, 28, apologized this week after sharing claims on Instagram that Israel is 'the only country in the world that keeps children as prisoners of war' - a post she illustrated with an image of a boy who, as a 13-year-old, went on a stabbing rampage in Jerusalem.\nNow Gigi is said to be concerned that her actions could have a knock-on effect for 48-year-old Bradley ahead of the release of his new movie Maestro on December 20, and even fears it could impact his success during awards season.\nSpeaking exclusively to DailyMail.com, a source said: 'Not that she is making what is happening with Bradley public, but as he is embarking on his new film coming out and he is looking to get nominated, she doesn't want to ever have him answering any questions about anything she does or says.\nGigi Hadid is worried that she may have caused 'collateral damage' for her rumored love interest Bradley Cooper\nThe 28-year-old star has received criticizm over her social media posts about the Israeli government\nThe model posted a photo on Instagram falsely portraying Palestinian terrorist Ahmed Manasra as a 'child prisoner of war'\n'She doesn't want to provide any collateral damage to his career and the relationship they are trying to pursue.'\nThe insider continued: 'Gigi is looking to stay out of the limelight in the next few weeks as she would love for her words to die down and she wants to see where her apology takes her and where that all lands.\n'Many people have been rattled by her words and it is making an impact on her livelihood. She isn't fearing for her life, but she knows she made people uncomfortable that she works with and may work with in the future.\n'She wants to mend some fences, learn from it all, and not be canceled as she feels she made a mistake.'\nThe source added that Gigi is very much focused on getting 'back to work' now, but also wants to 'make things right'.\n'She now has to go through the forgiving process and only hopes that people rally for her just as much as people have recently rallied against her. And once that happens, she can get back to work with a trust that may have been lost with her recent comments,' they said.\n'She is eager to make things right and is anxious to see how it all goes from here. It has matured her.'\nDailyMail.com has reached out to representatives for Gigi for comment.\nThe post in question saw Gigi accuse Israel of the 'abduction, rape, humiliation, torture, and murder of Palestinians' and falsely portrayed Palestinian terrorist Ahmed Manasra as a 'child prisoner of war.'\nAccording to a source, Gigi is 'looking to stay out of the limelight in the next few weeks'\nOn Tuesday, after receiving a backlash against her post, the model - whose father is Palestinian, and last month likened Israelis to Nazis - apologized for her 'mistake,' which she said was careless.\n'It is important to me to share real stories about the hardships that Palestinians have endured and continue to endure, but this weekend I shared something that I did not fact check or think deeply about prior to reposting,' she wrote.\nGigi said she 'wanted to show the ways in which international law is being violated by the Israeli government', and said that a Palestinian child arrested by the Israeli Defense Forces (IDF) would be treated differently than an Israeli child stopped by the IDF.\n'Unfortunately, I used the wrong example to make that point, and I regret that,' she continued.\nGigi, who has frequently courted controversy with her anti-Israel posts, asked for forgiveness from her 80 million followers.\n'I understand that with the power of my platform comes a huge responsibility,' she said.\n'I'm human and I make mistakes. But I also hold myself accountable for those mistakes.'\nDespite her explanation, Gigi was slammed by Megyn Kelly who labeled her an 'idiot' during an exclusive interview with DailyMail.com, and said she 'should concentrate on walking down the long runway and trying to look pretty,' claiming 'she stinks as a political pundit.'\nGigi was first linked to Bradley earlier this year, following an alleged romance with Leonardo DiCaprio.\nThe pair were pictured enjoying several dinner dates in New York City before they were later seen returning from a weekend getaway.\nBradley has also dealt with his own backlash over his prosthetic nose for his role as Leonard Bernstein in Maestro.\nFather-of-one Bradley, pictured here on November 27, was first linked to Gigi back in October\nBradley (left) has been accused of playing to 'Jewface' stereotypes after his decision to wear a prosthetic nose to portray Leonard Bernstein\nBradley was accused of playing to 'Jewface' stereotypes by some, while others criticized the casting of a non-Jewish actor in a Jewish role.\nThe Philadelphia native plays the role of the legendary musical conductor in the film opposite Carey Mulligan as his wife Felicia Montealegre.\nOn social media, many users sounded off on the size of the prosthetic - which was visible as he filmed the movie in 2022 - with some using photos to show that Bernstein's nose was not close to that size.\n'It seems completely unnecessary to have gone in that direction given the uncanny resemblance,' one user said 'the real Leonard Bernstein did not have the funny nose that Bradley Cooper is wearing in Maestro.'\nAnother user added that 'there was no need for Bradley Cooper to add an odd prosthetic nose on top of this to play Leonard Bernstein,' as 'his own nose is longer!'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Gigi Hadid fears she has caused 'collateral damage' for love interest Bradley Cooper after backlash over her Instagram post about Israel 'raping and torturing' Palestinians - and plans to 'stay out of", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/tvshowbiz/article-12810111/gigi-hadid-fears-bradley-cooper-backlash-israel-palestinians.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}