{"authors": [], "date_download": "2024-02-05 15:32:17", "date_modify": "None", "date_publish": "2023-12-01 05:03:14", "description": "Ukrainian President Volodymyr Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-russia-joe-biden-b2456602.html.json", "image_url": "https://static.independent.co.uk/2023/12/01/05/The_AP_Interview_Zelenskyy_99138.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nUkrainian President Volodymyr Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces.\nDespite setbacks, however, he said Ukraine won't give up.\n“We have a new phase of war, and that is a fact,” Zelenskyy said in an exclusive interview Thursday with The Associated Press in Kharkiv in northeastern Ukraine after a morale-boosting tour of the region. “Winter as a whole is a new phase of war.”\nAsked if he was satisfied by the results of the counteroffensive, he gave a complex answer.\n“Look, we are not backing down, I am satisfied. We are fighting with the second (best) army in the world, I am satisfied,” he said, referring to the Russian military. But he added: “We are losing people, I’m not satisfied. We didn’t get all the weapons we wanted, I can’t be satisfied, but I also can’t complain too much.”\nZelenskyy also said he fears the Israel-Hamas war threatens to overshadow the conflict in Ukraine, as competing political agendas and limited resources put the flow of Western military aid to Kyiv at risk.\nAnd those concerns are amplified by the tumult that inevitably arises during a U.S. election year and its potential implications for his country, which has seen the international community largely rally around it following Russia’s Feb. 24, 2022, invasion.\nThe highly anticipated counteroffensive, powered by tens of billions of dollars in Western military aid, including heavy weaponry, did not forge the expected breakthroughs. Now, some Ukrainian officials worry whether further assistance will be as generous.\nAt the same time, ammunition stockpiles are running low, threatening to bring Ukrainian battlefield operations to a standstill.\nWith winter set to cloak a wartime Ukraine once again, military leaders must contend with new but familiar challenges as the conflict grinds toward the end of its second full year: There are freezing temperatures and barren fields that leave soldiers exposed. And there's the renewed threat of widespread Russian aerial assaults in cities that target energy infrastructure and civilians.\nOn Nov. 25, Moscow launched its most extensive drone attack of the war, with most of the 75 Iranian-made Shahed drones targeting Kyiv in a troubling precedent for the months ahead.\n“That is why a winter war is difficult,” Zelenskyy said.\nHe gave a frank appraisal of the last summer's counteroffensive.\n“We wanted faster results. From that perspective, unfortunately, we did not achieve the desired results. And this is a fact,” he said.\nUkraine did not get all the weapons it needed from allies, he said, and limits in the size of his military force precluded a quick advance, he said.\n“There is not enough power to achieve the desired results faster. But this does not mean that we should give up, that we have to surrender,” Zelenskyy said. “We are confident in our actions. We fight for what is ours.”\nThere were some positive takeaways from the last few months, he said.\nUkraine managed to make incremental territorial gains against a better-armed and fortified enemy, Zelenskyy said.\nIn addition, the might of Moscow’s Black Sea Fleet has been diminished, following Ukrainian attacks that penetrated air defenses and struck its headquarters in occupied Crimea, Zelenskyy added.\nAnd a temporary grain corridor established by Kyiv following Russia’s withdrawal from a wartime agreement to ensure the safe exports is still working.\nZelenskyy, though, isn’t dwelling on the past but is focused on the next stage — boosting domestic arms production.\nA sizeable chunk of Ukraine's budget is allocated for that, but current output is far from enough to turn the tide of war. Now, Zelenskyy is looking to Western allies, including the U.S., to offer favorable loans and contracts to meet that goal.\n“This is the way out,” Zelenskyy said, adding that nothing terrifies Russia more than a militarily self-sufficient Ukraine.\nWhen he last met with U.S. President Joe Biden, members of Congress and other top officials, he made one urgent appeal: Give Ukraine cheap loans and licenses to manufacture U.S. weaponry.\n“Give us these opportunities, and we will build,” he said he told them. “Whatever effort and time it will take, we will do it, and we will do it very quickly.”\nZelenskyy remains concerned that upheaval in the Middle East, the most violent in decades, threatens to take global attention and resources away from Ukraine’s ability to defend itself.\n“We already can see the consequences of the international community shifting (attention) because of the tragedy in the Middle East,” he said. “Only the blind don’t recognize this.”\nUkrainians understand “that we also need to fight for attention for the full-scale war,” he said. “We must not allow people to forget about the war here.”\nThat change in focus could lead to less economic and military assistance for his country, he said. In an apparent attempt to assuage those fears, U.S. and European officials have continued to visit Kyiv since the Oct. 7 attacks in Israel.\nThe shift still concerns him, Zelenskyy said.\n“You see, attention equals help. No attention will mean no help. We fight for every bit of attention,” he said. “Without attention, there may be weakness in (the U.S.) Congress.”\nTurning to the upcoming U.S. presidential and congressional campaigns, where Biden faces skepticism over his staunch support for Kyiv, Zelenskyy acknowledged that “elections are always a shock, and it is completely understandable.”\nA recent AP poll i n the U.S. showed nearly half of Americans think too much is being spent on Ukraine. An increasing number of Republicans are not in favor of sending more aid, and it is not clear if or when a request from the White House for additional aid will be approved by Congress.\nWhen asked about this, Zelenskyy replied bluntly that \"the choice of Americans is the choice of Americans.”\nBut he argued that by helping Ukraine, Americans are also helping themselves.\n“In the case of Ukraine, if resilience fails today due to lack of aid and shortages of weapons and funding, it will mean that Russia will most likely invade NATO countries,” he said. “And then the American children will fight.”\nZelenskyy has sought recently to ensure Ukraine’s war machine was running as it should by making a recent shakeup of top-level government officials, touching on another of his goals to fight graft in a post-Soviet institution rife with corruption as a prelude to joining the European Union.\nHe said he has to know how weapons, supplies, food and even clothing are being delivered to the front — and what fails to get there.\n“On one hand, this is not the job of the president, but on the other hand, I can trust those who did not just pass on the information to me, but told me in person,” he said.\nThe static battle lines have not brought pressure from Ukraine's allies to negotiate a peace deal with Russia.\n“I don’t feel it yet,\" he said, although he added: \"Some voices are always heard.”\nUkraine wants to “push the formula for peace and involve as many countries of the world as possible, so that they politically isolate Russia,” he noted.\nThe war has also made it impossible to hold a presidential election in Ukraine, originally slated for March under the constitution, he said.\nAlthough Zelenskyy said he was ready to hold an election, most Ukrainians are not, believing such a vote to be “dangerous and meaningless” as war rages around them.\nWith a budget anticipating spending 22% of the country’s GDP for defense and national security, Ukraine’s economy is being restructured around a war with no end in sight, much like the day-to-day lives of its citizens.\nThat raised another question: How long can Zelenskyy himself cope with being the leader of a country at war?\nThere are no words to describe how difficult the job is, he said, but he also can't imagine leaving the post.\n“You honestly can’t do that,\" he said. “This would be very unfair, wrong and definitely demotivating.”\n___\nFollow AP's coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "The AP Interview: Ukraine's Zelenskyy says the war with Russia is in a new phase as winter looms", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-russia-joe-biden-b2456602.html"}