{"authors": [], "date_download": "2024-02-05 15:32:19", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Chinese naval vessels ignored repeated distress calls from an Israeli-owned commercial tanker that was under attack on Sunday, the Pentagon said on Monday.", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274048930%2Fus-chinese-navy-ignored-distress-calls-of-hijacked-israeli-ship.json", "image_url": "https://cdn.bignewsnetwork.com/ani1701250991.jpg", "language": "en", "localpath": null, "maintext": "Tel Aviv [Israel], November 29 (ANI/TPS): Chinese naval vessels ignored repeated distress calls from an Israeli-owned commercial tanker that was under attack on Sunday, the Pentagon said on Monday.\nThe USS Mason and allied ships--reportedly belonging to Japan-- recovered the Israel-linked Central Park tanker, which an \"unknown entity\" hijacked in the Gulf of Aden off the coast of Yemen, US Central Command (CENTCOM) confirmed on Monday.\nConcurrently to the attempted hijacking, two ballistic missiles were fired towards the USS Mason from areas controlled by Iranian-backed Houthi rebels in Yemen. The missiles fell 10 nautical miles (11.5 statute miles) away from the vessel, causing no injuries or damage.\nThe 22-member crew of the Central Park was uninjured, according to CENTCOM.\nDuring the rescue operation, five armed hijackers attempted to flee in a small boat and were detained by the US Navy.\n\"We're continuing to assess, but initial indications [are] that these five individuals are Somali,\" said Ryder. \"But again, we'll continue to assess that, as well as next steps in terms of the disposition of those five individuals,\" he added.\nPentagon Press Secretary Brig. Gen. Pat Ryder confirmed that at least three People's Liberation Army Navy ships in the area failed to heed the distress calls.\n\"So, my understanding is there were three PLA Navy ships in the vicinity. However, they did not respond. Supposedly, those ships are there as part of a counter-piracy mission, but they did not respond,\" said Ryder.\n\"If there's a vessel that's hailing a distress signal and all vessels in the vicinity should--are required to come and help and support,\" he added.\n\"Clearly, a piracy-related incident in that this vessel was boarded by these five individuals. They attempted to access the crew cabin,\" said Ryder. \"The crew essentially were able to lock themselves into a safe haven. These individuals attempted to access and take control of the ship. But when the combined task force responded, they essentially fled,\" he added.\n\"Maritime domain security is essential to regional stability,\" said Gen. Michael Erik Kurilla, CENTCOM commander. \"We will continue to work with allies and partners to ensure the safety and security of international shipping lanes.\"The Zodiac Maritime ship management company, part of Israeli billionaire Eyal Ofer's Zodiac Group, had called the attack on the Central Park \"a suspected piracy incident.\"\"We would like to thank the coalition forces who responded quickly, protecting assets in the area and upholding international maritime law,\" said Zodiac Maritime on Monday.\nAccording to the company, the Turkish-captained vessel has a multinational crew consisting of Russian, Vietnamese, Bulgarian, Indian, Georgian and Filipino nationals.\nThe ship is carrying phosphoric acid.\nOn Friday, an Iranian drone attacked an Israeli-owned commercial vessel in the Indian Ocean. The attack on the CMA CGM Symi container ship came a week after Houthi rebels hijacked an Israeli-linked ship in the Red Sea.\nOn Nov. 19, the Israel Defense Forces confirmed that the Houthis hijacked the Bahamian-flagged Galaxy Leader vehicle carrier, calling it a \"very grave incident of global consequence.\"\"The ship departed Turkey on its way to India, staffed by civilians of various nationalities, not including Israelis. It is not an Israeli ship,\" the military added. The Galaxy Leader is registered by a British company partially owned by Israeli tycoon Abraham Ungar.\n\"This is another act of Iranian terrorism and constitutes a leap forward in Iran's aggression against the citizens of the free world, with international consequences regarding the security of the global shipping lanes,\" the Prime Minister's Office in Jerusalem said.\nOn Wednesday, the Canadian, French, German, Italian, Japanese, U.K. and U.S. foreign ministers, as well as the high representative of the European Union, called on the Houthis to halt their attacks.\n\"Emphasizing the importance of maritime security, we call on all parties not to threaten or interfere with lawful exercise of navigational rights and freedoms by all vessels,\" according to a statement by the top G7 diplomats.\n\"We especially call on the Houthis to immediately cease attacks on civilians and threats to international shipping lanes and commercial vessels and release the M/V Galaxy Leader and its crew, illegally seized from international waters on Nov. 19,\" it added.\nOn Nov. 9, Houthi rebels fired a ballistic missile at Eilat, which was intercepted by Israel's Arrow 3 in the aerial-defense system's first operational use.\nOn Oct. 31, Israel's Arrow 2 air defense system for the first time intercepted a surface-to-surface missile fired from the Red Sea area.\nAdditionally, dozens of U.S. troops have been wounded in more than 60 attacks by Iranian-backed proxies in Iraq and Syria since Oct. 17, according to the Pentagon. (ANI/TPS)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "US: Chinese Navy ignored distress calls of hijacked Israeli ship", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274048930/us-chinese-navy-ignored-distress-calls-of-hijacked-israeli-ship"}