{"authors": [], "date_download": "2024-02-05 15:14:34", "date_modify": "None", "date_publish": "2024-01-30 02:30:40", "description": "Lloyd Austin says president ‘will not tolerate attacks on US forces’, but Qatar warns that reprisal attacks could undermine Israel hostage talks", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2024%2Fjan%2F29%2Fpentagon-lloyd-austin-jordan-troops-killed.json", "image_url": "https://i.guim.co.uk/img/media/697293d0ddd0ab23ffdb0b94760a2c6f6b2bed20/0_22_4674_2803/master/4674.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b37dfba0803372067f3a41fc601bb2c", "language": "en", "localpath": null, "maintext": "US defense secretary Lloyd Austin has vowed to take “all necessary actions” to defend US troops after Iran-backed militants killed three US troops and wounded dozens more in a drone attack on a US base in Jordan.\n“The president and I will not tolerate attacks on US forces and we will take all necessary actions to defend the US and our troops,” Austin said at the Pentagon on Monday.\nThe statement came as US officials told the Associated Press that the enemy drone – which also wounded dozens of people at the desert outpost in Jordan – may have been confused with an American drone returning to the US installation.\nThe Pentagon on Monday named the three troops killed in the attack as army reservists Sgt William Jerome Rivers, Spc Breonna Alexsondria Moffett and Spc Kennedy Sanders.\nThe attack on Sunday was the first deadly strike against US troops since the Israel-Hamas war erupted in October, and marks a major escalation in tensions that have engulfed the Middle East.\nQatar’s prime minister said on Monday he hoped any US retaliation would not undercut progress toward a new Israel-Hamas hostage release deal in weekend talks.\n“I hope that nothing would undermine the efforts that we are doing or jeopardise the process,” sheikh Mohammed bin Abdulrahman bin Jassim al Thani said in Washington.\nAl Thani, who attended the talks, said “good progress” had been made and the parties were “hoping to relay this proposal to Hamas and to get them to a place where they engage positively and constructively in the process”. US secretary of state Antony Blinken expressed hope for the deal, saying: “Very important, productive work has been done. And there is some real hope going forward.”\nA senior Hamas official, Taher al-Nunu, said it wanted a “complete and comprehensive ceasefire, not a temporary truce”, although it was not immediately clear whether Hamas officials had received the Qatari text.\nJohn Kirby, a spokesperson for the national security council at the White House, told CBS: “We are not interested in a broader conflict in the region, we’re not looking for another war, but we absolutely will do what we have to do to protect ourselves.”\nPresident Joe Biden now faces a balancing act, blaming Iran and looking to strike back in a forceful way without causing any further escalation of the Gaza conflict. The White House said on Monday the president was “weighing his options” for a “very consequential” answer to the attack.\nUS Republicans have suggested they would use Iran as a test case of Biden’s strength ahead of the US elections. “The entire world now watches for signs that the president is finally prepared to exercise American strength,” Republican senate minority Leader Mitch McConnell said.\nLindsey Graham, the top Republican on the Senate judiciary committee and a leading hawk, urged Biden to “hit Iran now. Hit them hard.”\nIn describing the drone attack two US officials who were not authorised to comment and insisted on anonymity, said preliminary accounts suggest the enemy drone that struck the installation known as Tower 22 may have been mistaken for an American drone that was in the air at the same time.\nThe officials said that as the enemy drone was flying in at a low altitude, a US drone was returning to the base. As a result, there was no effort to shoot down the enemy drone.\nView image in fullscreen Sgt William Jerome Rivers, Specialist Breonna Alexsondria Moffett and Specialist Kennedy Ladon Sanders, who were killed in Jordan. Photograph: Us Army/Reuters\nThe attack, which the Biden administration blames on Iranian-based proxies, adds another layer of complexity to an already tense Middle East situation as the Biden administration tries to keep the Israel-Hamas war from expanding into a broader regional conflict.\nThe targeted base, known as Tower 22, sits near the demilitarized zone on the border between Jordan and Syria along a sandy, bulldozed berm marking the DMZ’s southern edge. The Iraqi border is only 10km (6 miles) away.\nThe area is known as Rukban, a vast arid region that once saw a refugee camp spring up on the Syrian side over the rise of the Islamic State group’s so-called caliphate in 2014.\nThe base’s location offers a site for US forces to infiltrate and quietly leave Syria.\nUS troops long have used Jordan, a kingdom bordering Iraq, Israel, the West Bank, Saudi Arabia and Syria, as a basing point. Some 3,000 American troops typically are stationed across Jordan.\nHowever, the US presence in Jordan risks angering a population that has already held mass demonstrations against Israel’s war on Hamas in Gaza over civilian casualties in a conflict that has already killed over 26,000 Palestinians.\nReuters and the Associated Press contributed to this report", "source_domain": "www.theguardian.com", "text": null, "title": "Pentagon mulls response to Jordan drone strike amid fears for Gaza ceasefire efforts", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2024/jan/29/pentagon-lloyd-austin-jordan-troops-killed"}