{"authors": [], "date_download": "2024-02-05 15:15:50", "date_modify": "None", "date_publish": "2024-01-25 15:23:18", "description": "The French president arrived in India on Thursday, where he is expected to meet with Prime Minister Narendra Modi and will be the chief guest at the country’s national day celebrations", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Femmanuel-macron-ap-narendra-modi-india-new-delhi-b2484649.html.json", "image_url": "https://static.independent.co.uk/2024/01/25/11/India_France_Macron_01240.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe French president arrived in India on Thursday, where he is expected to meet with Prime Minister Narendra Modi and will be the chief guest at the country’s national day celebrations.\nEmmanuel Macron began his visit with some sightseeing in the western city of Jaipur, a popular tourist destination, where he visited a 17th-century fort and an 18th-century observatory.\nMacron will hold talks with Prime Minister Narendra Modi later Thursday in Jaipur before flying to New Delhi. The two leaders are expected to discuss major global challenges in economic, defense, space and cyber security, as well as France's role in the Indo-Pacific region.\nFrance is looking to strengthen cooperation with India in areas ranging from climate to military sales, despite frictions over the two countries' attitudes to Russia's war on Ukraine.\nThey are expected to continue discussions on India’s plans to purchase 26 French Rafale fighter aircraft for its navy, approved by India's Defense Acquisition Council last year. The council also approved a plan to purchase three Scorpene submarines, jointly developed by France and Spain.\nFrance already has delivered 36 Rafale fighter aircraft ordered by the Indian Air Force.\nFrance has reiterated its commitment to a defense relationship with India, including sharing technology. The two countries are working on co-development and co-production defense projects, the Indian External Affairs Ministry said.\n\"Macron is committed to the pursuit of a closer dialogue with India, a key player on the international scene from a demographic point of view, as well as economic, scientific and diplomatic,” his office said in a statement.\nThree ministers are traveling with the President: Sébastien Lecornu, Minister of the Armed Forces; Stéphane Sejourne, Minister for Europe and Foreign Affairs; and Rachida Dati, Minister of Culture.\nOn Friday, Macron will be the guest of honor at India’s Republic Day parade in New Delhi celebrating the anniversary of the adoption of the country’s constitution in 1950, nearly three years after it won independence from British colonial rule.\nModi was a guest of honor at Bastille Day parade in Paris in July last year, where Macron called India a key player “in our future.”\nMacron visited India in November for the Group of 20 summit of industrialized and developing nations.\nIndian exports to France totaled $3.06 billion and imports from France $2.36 billion in the past year, according to India’s External Affairs Ministry.", "source_domain": "www.independent.co.uk", "text": null, "title": "French President Macron arrives in India, where he'll be chief guest at National Day celebrations", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/emmanuel-macron-ap-narendra-modi-india-new-delhi-b2484649.html"}