{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Richard Luscombe", "Christy Cooney", "Tom Bryant", "Reged Ahmad"], "date_download": "2024-02-05 15:32:20", "date_modify": "None", "date_publish": "2023-12-01 03:29:17", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F30%2Fisrael-hamas-war-live-updates-news-ceasefire-ending-gaza-palestine-hostage-deal-palestinian-prisoners-released.json", "image_url": "https://i.guim.co.uk/img/media/cfff20dcb0d75c20954edab091c9c8622bae75f1/0_203_5346_3208/master/5346.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=aec55edec8fc1d665460d70ab54a29df", "language": "en", "localpath": null, "maintext": "From 30 Nov 2023 00.15 CET Israel frees 30 Palestinians from prisons The Israel Prison Service said early on Friday it had released 30 Palestinians from Israeli jails as part of the latest exchange for hostages under the truce deal with Hamas. The prison service said the Palestinians were released from prisons in Israel, the occupied West Bank and Jerusalem under the seventh swap, Reuters reported. This is Adam Fulton picking up our live coverage. Stay with us for all the latest development in the Israel-Hamas war\n1 Dec 2023 03.23 CET Summary It’s approaching 4.30am in Gaza City and Tel Aviv. Here’s an overview of where things stand: Eight Israeli hostages held in Gaza were released on Thursday. Hamas freed six of the hostages hours after releasing two Israeli women. All were handed over to the Red Cross in Gaza and were being brought to Israel to be taken to hospitals and be reunited with their families, the Israeli military said.\nIsrael released 30 Palestinians from Israeli jails as part of latest exchange, the Israel Prison Service said early on Friday. News agency images show them being welcomed by jubilant crowds Ramallah in the West Bank.\nHamas is willing to further extend the truce to pause fighting with Israel , a source close to Hamas has told Agence France-Presse. The extension is due to expire early on Friday after a seven-day pause. The source was quoted as saying mediators were making intense efforts to have the truce continued. Israel had yet to respond, AFP said.\nUS secretary of state Antony Blinken said in Tel Aviv on Thursday: “Clearly, we want to see this process continue to move forward.” Blinken also stepped up calls for Israel to comply with international law and spare civilians in the war against Hamas in Gaza.\nThree people were killed and 13 injured after two brothers from East Jerusalem shot at people waiting at a bus stop on a main road towards the western edge of the city in the rush hour, local police and medics reported. Hamas’s armed wing, al-Qassam Brigades, claimed responsibility for the attack.\nAn Israeli military assault into the south of Gaza may lead to 1 million refugees, the head of the UN’s Palestine relief agency, UNRWA, has warned. After a second overnight visit to Gaza, Philippe Lazzarini urged Israel to think through the consequences of an offensive in the south if the temporary truce in the fighting was not extended.\nSeventeen Thai hostages freed by Hamas over recent days have landed back in Bangkok, where relatives had gathered at the airport to welcome them home. The latest releases bring the total number of Thai nationals freed to 23, with nine still being held.\nUpdated at 03.44 CET\n1 Dec 2023 02.56 CET Israel knew of Hamas’s attack plan more than a year ago, according to a report in the New York Times. The report says a blueprint reviewed by the Times laid out the attack in detail, but that Israeli officials dismissed it as aspirational and ignoring specific warnings. The NYT report says: Israeli officials obtained Hamas’s battle plan for the Oct. 7 terrorist attack more than a year before it happened, documents, emails and interviews show. But Israeli military and intelligence officials dismissed the plan as aspirational, considering it too difficult for Hamas to carry out. The approximately 40-page document, which the Israeli authorities code-named “Jericho Wall,” outlined, point by point, exactly the kind of devastating invasion that led to the deaths of about 1,200 people. The translated document, which was reviewed by The New York Times, did not set a date for the attack, but described a methodical assault designed to overwhelm the fortifications around the Gaza Strip, take over Israeli cities and storm key military bases, including a division headquarters. Hamas followed the blueprint with shocking precision. … Officials privately concede that, had the military taken these warnings seriously and redirected significant reinforcements to the south, where Hamas attacked, Israel could have blunted the attacks or possibly even prevented them. … The Israeli military and the Israeli Security Agency, which is in charge of counterterrorism in Gaza, declined to comment.\n1 Dec 2023 02.13 CET On the number of hostages released by Hamas in the latest exchange, Agence France-Presse is reporting how the truce deal stipulates that a minimum of 10 Israeli captives should be released alive each day. The militant group released just eight Israelis on Thursday. But a source close to Hamas told AFP that two Russian-Israeli women freed on Wednesday in addition to 10 others made up for only eight being released on Thursday. Mediator Qatar appeared to back the calculation. In exchange under the extended truce deal – due to expire within hours – Israeli prison authorities said 30 Palestinians prisoners were freed overnight on Thursday. Since the agreement came into force on 24 November, 110 hostages have been released, including 80 Israelis. The majority of the 30 non-Israeli hostages freed were from Thailand, released under a separate agreement. Israel has freed 240 Palestinian prisoners in exchange.\n1 Dec 2023 01.45 CET Al Jazeera is reporting that a bus carrying newly released Palestinian detainees has been hit with tear gas fired by Israeli forces, according to a witness. The network’s report says Issam Rimawi, a Palestinian photojournalist, witnessed and recorded the incident and said Israeli forces were deployed outside Ofer prison in the West Bank before the release of the Palestinian prisoners. The report quotes Rimawi as telling Al Jazeera in Ramallah: They were firing tear gas just as the bus carrying the prisoners was leaving The prisoners were suffocating, and the driver had to stop the bus until the Red Cross crew came to help them. The medical team had to go into the bus, and we have documented this with our own camera. The Israeli authorities are doing this because they don’t want people to celebrate the release of the prisoners. The Al Jazeera Media Network is funded by the Qatari royal family and says it has editorial independence. The Israel Prison Service said early on Friday it had released 30 Palestinians from Israeli jails as part of the latest exchange for hostages under Israel’s truce agreement with Hamas.\nUpdated at 01.49 CET\n30 Nov 2023 00.56 CET Here’s more around the Agence France-Presse report that Hamas has said it is willing to further extend the truce pausing fighting with Israel. Israel had yet to respond, the news agency reports. The current truce is due to expire early on Friday after a seven-day pause. US secretary of state Antony Blinken urged an extension after meeting with leaders in Israel and the occupied West Bank. “Clearly, we want to see this process continue to move forward,” he told reporters in Tel Aviv on Thursday. We want an eighth day and beyond. Blinken also said Israel “must put in place humanitarian civilian protection plans that minimise further casualties of innocent Palestinians, including by clearly and precisely designating areas and places in southern and central Gaza, where they can be safe and out of the line of fire”. International pressure has risen for a lasting halt to the war. The White House said it was “working on it literally by the hour” to try to extend the temporary ceasefire. Amid the latest release of Israeli hostages in exchange for Palestinian prisoners, a source close to Hamas, who asked not to be named because they were not authorised to speak to the media, told AFP it was “willing to extend the truce”. The source added: The mediators are currently making strong, intense and continuous efforts for an additional day in the truce and then working to extend it again for other days.\nUpdated at 01.06 CET\n30 Nov 2023 00.15 CET Israel frees 30 Palestinians from prisons The Israel Prison Service said early on Friday it had released 30 Palestinians from Israeli jails as part of the latest exchange for hostages under the truce deal with Hamas. The prison service said the Palestinians were released from prisons in Israel, the occupied West Bank and Jerusalem under the seventh swap, Reuters reported. This is Adam Fulton picking up our live coverage. Stay with us for all the latest development in the Israel-Hamas war\n30 Nov 2023 23.28 CET Among the Israeli hostages who were released today include two children and six women, Qatar’s foreign ministry spokesperson Majed Al Ansari said. The International Committee of the Red Cross (ICRC) has confirmed that eight people who were being held hostage in Gaza have been released. The Israeli hostages who were released include 2 minors & 6 women of dual nationality:\n⁃A Mexican\n⁃A Russian\n⁃An Uruguayan\nThey We’re handed over to the ICRC. — د. ماجد محمد الأنصاري Dr. Majed Al Ansari (@majedalansari) November 30, 2023\n30 Nov 2023 23.23 CET Hamas 'willing to extend the truce' - report Hamas is willing to further extend a truce to pause fighting with Israel, a source close to Hamas has told Agence France-Presse. The source told the news agency: The mediators are currently making strong, intense and continuous efforts for an additional day in the truce and then working to extend it again for other days.\nUpdated at 23.25 CET\n30 Nov 2023 23.18 CET Here’s a clip from Antony Blinken’s press conference earlier, held in Tel Aviv after meetings with Israeli and Palestinian officials. The US secretary of state said the immediate focus of his visit was to try to extend the pause in fighting in Gaza and enable more hostages to be freed. The US also urged Benjamin Netanyahu to protect civilians in Gaza. Blinken said: Israel has one of the most sophisticated militaries in the world, it is capable of neutralising the threat while minimising harm to innocent men, women and children. 00:00:38 US urges Israel to protect Palestinian civilians in Gaza – video\nUpdated at 23.21 CET\n30 Nov 2023 23.04 CET Two siblings, Aisha Ziyadne, 17, and Bilal Ziyadne, 18, are among the Israeli hostages who have been released tonight. The pair were abducted from the kibbutz Holit together with their older brother, Hamza, and their father, Yousef. Since the day of the assault, the extended Ziyadne family has been holding a permanent vigil outside the house of Yousef, the Times of Israel reported.\n30 Nov 2023 22.46 CET Ilana Gritzewsky, one of the two Mexican hostages held in Gaza, has been released, Mexico’s foreign minister, Alicia Bárcena, has confirmed. In a social media post, Bárcena thanked the Qatari government for its “invaluable mediation”, adding that Mexico continues to work for the release of its other citizen, Orion Hernandez. Con enorme alegría informo que Ilana Gritzewsky, una de las dos retenidas en Gaza, fue liberada hoy. A nombre del @GobiernoMX agradecemos profundamente al Gobierno de Qatar por su invaluable mediación. 1/2 — Alicia Bárcena (@aliciabarcena) November 30, 2023\nUpdated at 22.48 CET\n30 Nov 2023 22.41 CET Red Cross says eight hostages held in Gaza have been released The International Committee of the Red Cross (ICRC) has confirmed that eight people who were being held hostage in Gaza have been released. An ICRC statement reads: We’re glad to inform that 8 people who were being held hostage in Gaza have just been released, with facilitation from the ICRC. Our teams have transferred them and handed them over to the Israeli authorities. This is possible thanks to our neutral intermediary role. We’re glad to inform that 8 people who were being held hostage in Gaza have just been released, with facilitation from the ICRC.\nOur teams have transferred them and handed them over to the Israeli authorities.\nThis is possible thanks to our neutral intermediary role. — ICRC in Israel & OT (@ICRC_ilot) November 30, 2023\n30 Nov 2023 22.29 CET The six Israeli hostages who are being released tonight by Hamas from captivity in Gaza have been named. They are: Aisha Ziyadne, 17\nBilal Ziyadne, 18\nNili Margalit , 40\nShani Goren, 29\nSapir Cohen, 29\nIlana Gritzewsky, 30 The eight Israeli hostages released from Hamas captivity tonight: Siblings Bilal and Aisha Ziyadne, Ilana Gritzewsky, Nili Margalit, Shani Goren, Amit Soussana, Sapir Cohen, Mia Schem. pic.twitter.com/3J2ESpZ1tp — Emanuel (Mannie) Fabian (@manniefabian) November 30, 2023", "source_domain": "www.theguardian.com", "text": null, "title": "Blinken keen for truce to ‘continue to move forward’ - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/30/israel-hamas-war-live-updates-news-ceasefire-ending-gaza-palestine-hostage-deal-palestinian-prisoners-released"}