{"authors": ["Christine Rendon", "Harriet Alexander", "Noa Halff For Dailymail.Com"], "date_download": "2024-02-05 15:32:23", "date_modify": "None", "date_publish": "2023-12-01 23:54:01", "description": "In photos exclusively obtained by DailyMail.com, the model was spotted jetting into New York City on Friday, looking slightly somber as she made her way through JFK Airport with the luggage in and.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ftvshowbiz%2Farticle-12816239%2FGigi-Hadid-looks-somber-jetting-NYC-seen-time.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/01/23/78488173-0-image-a-58_1701474808293.jpg", "language": "en", "localpath": null, "maintext": "Gigi Hadid has been pictured for the first time since admitting to failing to 'fact check' a post about the Israeli government.\nIn photos exclusively obtained by DailyMail.com, the model was spotted jetting into New York City on Friday, looking slightly somber as she made her way through JFK Airport with her luggage in hand.\nGigi, 28, wore a slick leather jacket over a casual grey tee and billowing black trousers that were belted into her trim waist.\nIt comes after Gigi shared claims on Instagram that Israel is 'the only country in the world that keeps children as prisoners of war' - a post she illustrated with a boy who, as a 13-year-old, went on a stabbing rampage in Jerusalem.\nAfter the message sparked backlash, Gigi backtracked and admitted she failed to 'fact check' or 'deeply think about' the post prior to sharing it on her account.\nGigi Hadid has been pictured for the first time since admitting to failing to 'fact check' a post about the Israeli government\nAs Gigi strode through the busy airport, she slicked her blonde hair back into a bun with the help of a clip while a pair of amber tint shades concealed her eyes.\nShe neatly piled her luxurious Louis Vuitton duffle bag atop her glossy olive green suitcase as she wheeled her belongings through the transport hub.\nEnsuring she remained comfortable for her trek home, she opted for comfortable footwear.\nThe model also carried her cell phone, adorned with a fun beaded strap.\nThe post in question saw Gigi accuse Israel of the 'abduction, rape, humiliation, torture, and murder of Palestinians' and falsely portrayed Palestinian Ahmed Manasra as a 'child prisoner of war.'\nOn Tuesday, after a backlash against her post, the model - whose father is Palestinian, and last month likened Israelis to Nazis - apologized for her 'mistake', which she said was careless.\nShe wrote: 'It is important to me to share real stories about the hardships that Palestinians have endured and continue to endure, but this weekend I shared something that I did not fact check or think deeply about prior to reposting.'\nGigi said she 'wanted to show the ways in which international law is being violated by the Israeli government', and said that a Palestinian child arrested by the Israeli Defense Forces (IDF) would be treated differently than an Israeli child stopped by the IDF.\n'Unfortunately, I used the wrong example to make that point, and I regret that,' she continued.\nHadid donned a stylish black leather jacket along with a casual grey tee and loose trousers\nGigi strode trough the airport in comfortable sneakers\nThe model wore a pair of amber sunglasses and several petite hoop earrings\nThe star, who has been the face of Maybelline and is currently fronting Versace's campaigns, said she condemned violence against all people.\n'To want freedom and humane treatment for Palestinians and to want safety for Jewish people can both be important to the same person - including myself,' she said.\nBut she then switched to accusing Israel of human rights abuses, and emphasized years of abuse by Israel. She did not reference the October 7 terror attack, or the current hostage situation.\nHadid, who has frequently courted controversy with her incendiary anti-Israel posts, pled for forgiveness from her 80 million followers.\nHadid made her way through the busy airport\nShe piled her luxurious Louis Vuitton bag atop her glossy suitcase\nThe sighting comes after Gigi backtracked on a controversial post and admitted she failed to 'fact check' or 'deeply think about' it prior to sharing it on her account\nHer cell phone was adorned with a fun beaded strap\nThis is not the first time Hadid was blasted for her anti-Israel posts\n'I understand that with the power of my platform comes a huge responsibility,' she said.\n'I'm human and I make mistakes. But I also hold myself accountable for those mistakes.'\nHadid's post received immediate backlash and has since been taken down.\nThe post received criticism for spreading false information and increasing antisemitism. Users condemned her, with one calling her a 'social media terrorist' and another suggesting that the Hadid family move to Gaza.\nOne wrote: 'She's a social media terrorist and should be punished for spreading false information that increases antisemitism.'\nThe post in question saw Gigi accuse Israel of the 'abduction, rape, humiliation, torture, and murder of Palestinians' and falsely portrayed Palestinian Ahmed Manasra as a 'child prisoner of war'\nHadid shared this statement after her post about the Israeli government sparked backlash\nAnother commented: 'The entire Hadid family have blood on their hands.'\n'Why doesn't the Hadid family move to Gaza? Yalla,' a third user wrote.\nThis is not the first time Hadid was blasted for her anti-Israel posts.\nHadid was slammed by the Israeli government after she posted in support of the Palestinian people on her Instagram story in October, only weeks after the October 7 terror attack.\nHadid, whose famous real-estate developer father Mohamed Hadid is Palestinian, posted a graphic about the war that read: 'There is nothing Jewish about the Israeli government's treatment of Palestinians.'\n'Condemning the Israeli government is not anti-Semitic and supporting Palestinians is not supporting Hamas.'\nIsrael's government quickly skewered Hadid's position, posting on their Instagram story a response that read: 'There is nothing valiant about Hamas' massacre of Israelis.\n'Condemning Hamas for what it is (ISIS) is not anti-Palestine and supporting Israelis in their fight against barbaric terrorists is the right thing to do.'\nThe account then directed comments at Hadid specifically, tagging her account and writing: 'Have you been sleeping the past week?\n'Or you just fine turning a blind eye to Jewish babies being butchered in their homes?\n'Your silence has been very clear about where you stand. We see you.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Somber Gigi Hadid jets into NYC in FIRST sighting since star backtracked on claims Israel is 'raping and torturing' Palestinians and admitted she failed to 'fact check' inflammatory post", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/tvshowbiz/article-12816239/Gigi-Hadid-looks-somber-jetting-NYC-seen-time.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}