{"authors": ["Adry Torres", "Adry Torres For Dailymail.Com"], "date_download": "2024-02-05 15:32:25", "date_modify": "None", "date_publish": "2023-12-01 21:36:14", "description": "Nestor 'El Nini' Pérez, alleged security chief for El Chapo's sons, who longed for his own narco corrido (ballad), has seen his wish come true - on the very same day he was arrested.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12815623%2FMexico-narco-corrido-Tucanes-Tijuana-El-Nini.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/01/21/78485295-0-image-m-9_1701466094940.jpg", "language": "en", "localpath": null, "maintext": "The alleged security chief for El Chapo's sons, who longed for his own narco corrido (ballad), has seen his wish come true - on the very same day he was arrested.\nNestor 'El Nini' Pérez, 30, was apprehended without incident at his home in an upscale neighborhood in the Sinaloa city of Culiacán on November 22.\nA military report has now revealed: 'He asked for his own corrido when he learned that his compadre 'El Flaquito' was sent to do a corrido with Los Tucanes de Tijuana.'\nThe song 'Comandante 09' was released by Los Tucanes de Tijuana, one of Mexico's most popular norteño bands.\nAccording to the report, El Nini did not stop until he got the band to produce the song and was hands on with the lines.\n'He was very obsessive about getting Los Tucanes to make the corrido, he wanted to see the lyrics, he wanted to hear the tune, he wanted to control everything. He really wanted to be famous,' the military said.\nNestor 'El Nini' Pérez, who was the alleged security chief for El Chapo's sons, was celebrating the release of his own narco corrido (ballad) that was interpreted by Mexican norteño band Los Tucanes de Tijuana when he was arrested November 22, the same day the song premiered\nMario Quintero, lead singer of Mexican band Los Tucanes de Tijuana, narrated the narco life of Nestor 'El Nini' Pérez, the alleged security chief for El Chapo's son, in a song titled 'Comandante 09,' which was released November 22, the same day El Nini was arrested in Culiacán, Mexico\nA Mexican military briefing obtained by online news outlet La Opinión indicated that El Nini played a role in his own capture by relaxing his security protocol while he celebrated the premier of 'Comandante 09,' his nom-de-guerre within the Sinaloa Cartel.\nThe song, which was also made available on iTunes and Spotify, details El Nini's growth as a gangster member of the Arrelano-Félix Cartel before he joined the Sinaloa Cartel.\n'He got hooked and took his gun / when he was barely 18 years old / this is how Nini's story begins with El Chapo's children,' Los Tucanes de Tijuana lead singer Mario Quintero says.\nLater in the song, Quintero mentions that El Nini was the armed protector of Los Chapitos – as Joaquín 'El Chapo' Guzmán's four sons are known.\n'Armed wing of the heirs / in action, he is always ahead / wherever he wants he has gunmen / protecting the cartel turfs, he is very brave / he does not know fear,' the song goes. 'The commander was born very warlike / and although the government is looking for him / 09 celebrates in a big way.'\nThe song also boasts about El Nini's standing in the organization as the protector of the sons of Joaquín 'El Chapo' Guzmán, including Ovidio Guzmán, who was briefly detained by Mexican security forces in October 2019 before President Andrés Manuel López Obrador ordered his release after the cartel responded with a war-like assault in broad daylight.\nLos Tucanes de Tijuana were founded in 1987 and are one of the most popular bands in Mexico\nNestor 'El Nini' Pérez, 30, was apprehended at his home in Culiacán, Mexico on November 22. The United States Department of Justices alleges he was in charge of overseeing security for the sons of Joaquín 'El Chapo Guzmán, who operate the Sinaloa Cartel faction, Los Chapitos\nAccording to the Ministry of National Defense, El Nini also ordered an attack on a complex where soldiers' families lived as the military attempted to serve an arrest warrant after the U.S. Department of Justice had filed an extradition request.\nQuintero sings: 'They wanted to grab him and kill him / they have sent marines and cops / 09 has his shooters / in the head of the moment they report information / by the time they arrive, they are gone / or they run into them firing bullet.'\nWhen the military captured Ovidio Guzmán in January, El Nini was reportedly involved in an assault that left 30 people dead, including 10 military personnel.\nPrior to the apprehension, the U.S. was offering a $3 million reward for information leading to El Nini's arrest and/or conviction. He is accused of conspiring to traffic cocaine, methamphetamine and fentanyl.\nHis infatuation with having his narco life narrated by Los Tucanes de Tijuana made it possible.\nIn a Thanksgiving Day statement, President Joe Biden lauded the apprehension.\n'These arrests are testament to the commitment between the United States and Mexico to secure our communities against violence, counter the cartels, and end the scourge of illicit fentanyl that is hurting so many families,' Biden said.\nU.S. federal prosecutors allege that El Nini oversaw a group known as 'Los Ninis' that served as the security team for Iván Guzmán and his brothers, Joaquín Guzmán, Jesús Guzmán and Ovidio Guzmán, who is currently in U.S. custody.\nEl Nini was allegedly involved in the 2017 torture of a Mexican federal agent. His gang reportedly received 'military-style training in multiple areas of combat, including urban warfare, special weapons and tactics, and sniper proficiency.'\nThe group also had the green light to 'kidnap, torture, and kill anyone who opposed the Chapitos,' the indictment said.\nIn 2022, Pérez and José Figueroa, who also led Los Ninis, allegedly tested the purity of a fentanyl sample on a woman and injected her 'repeatedly … until she died.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Top Mexican band Los Tucanes releases 'narco ballad' about man accused of overseeing security for cartel cell operated by El Chapo's sons - on the same day he is arrested", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12815623/Mexico-narco-corrido-Tucanes-Tijuana-El-Nini.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}