{"authors": ["Manisha Ganguly", "Elena Morresi", "Ashley Kirk", "Bryony Moore", "Harvey Symons"], "date_download": "2024-02-05 15:32:27", "date_modify": "None", "date_publish": "2023-12-01 06:00:08", "description": "Study covering period in late October and early November shows damage to 10 hospitals and health facilities", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F01%2Fhospital-damage-in-gaza-during-israeli-offensive-a-visual-investigation.json", "image_url": "https://i.guim.co.uk/img/media/bd32e519aeecffcff785726ca544c28fc5c3f2b9/836_396_2710_1626/master/2710.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=581369ff7716c2c3fa994935c4df4fd5", "language": "en", "localpath": null, "maintext": "An investigation has revealed the damage caused to hospitals, health facilities and ambulances in the northern Gaza Strip over 21 days in the course of the Israeli offensive against Hamas in Gaza.\nThe Guardian collected and analysed more than 200 pieces of evidence including videos, photos, news footage and satellite imagery from between approximately 21 October and 11 November, and spoke to international humanitarian organisations, to investigate the damage caused to 10 of Gaza’s hospitals and health facilities. Of the 10, only two are functioning.\nBoth paediatric hospitals in Gaza are now non-functional, as are the strip’s only dedicated cancer hospital and its psychiatric hospital.\nThe investigation also examined damage to the roads and infrastructure around hospitals, the presence of Israel Defense Forces tanks on hospital grounds, and the extent to which hospitals have been used by civilians to shelter.\nNine of the facilities are plotted on the map below. The Guardian was unable to independently confirm the location of one – the Palestinian Medical Relief Centre for the Rehabilitation of the Disabled. The map shows the extent of damage to neighbourhoods where the hospitals are located.\nIn multiple instances investigated by the Guardian, the evidence indicated that Israeli munitions had hit facilities. In other instances it was not possible to attribute responsibility.\nIsrael has repeatedly said Hamas operates within and beneath hospitals. In the case of at least two of the hospitals studied – al-Shifa and al-Rantisi – Israel has accused Hamas of using the basements as command centres. It also points to evacuation routes it says civilians can use to leave areas under attack.\nUnder international humanitarian law, schools and hospitals are protected civilian objects, and the humanitarian principles of distinction and proportionality must be taken into consideration during targeting.\nAnalysis of the imagery found damage to ambulances near five hospitals. It also found that civilians were sheltering in four of Gaza’s biggest hospitals – al-Quds, al-Rantisi, Indonesian and al-Shifa – when the damage occurred.\nThe IDF issued multiple orders to hospitals to evacuate. In some instances, video footage suggests that the intense bombardment around facilities made it unsafe for people to leave. The World Health Organization has said evacuation of some hospitals was “impossible to carry out”.\nVisual evidence shows Israeli tanks at various points in the area around three hospitals.\nAn IDF spokesperson told the Guardian: “The IDF has repeatedly and specifically warned these medical facilities to cease all military activity in accordance with international law. Regrettably, Hamas’s systematic use of vital and sensitive civilian infrastructure such as hospitals is part of their continued and well-documented tactics of using their people as human shields.\n“Combat against a terrorist organisation that places itself near hospitals is complicated and may involve incidental hits of the facility although it was not targeted itself and without any intention to harm it.”\nSince 7 October, when Hamas killed 1,200 people and seized an estimated 240 hostages in an unprecedented attack on Israel, Israel’s bombardment of the Gaza Strip has killed more than 15,000 people.\nThe photos and videos below detail some of the damage to healthcare facilities in the time period studied.\nNote: the explosion on 17 October at al-Ahli hospital that caused heavy casualties and has been attributed to a misfired Palestinian rocket fell outside the scope of this investigation.\nAl-Shifa hospital\n3 November\nA convoy of ambulances was targeted by Israel outside the hospital, with one ambulance hit directly. Videos and photos of the aftermath show more than 10 injured people on the roadside.\nVideo shows more than 10 injured people on the roadside and panic as others try to help Video: Reuters\nThe damage to the ambulance and shrapnel in its body work appear to be consistent with Spike NLOS, an Israeli munition, according to Marc Garlasco, a former Pentagon chief of high-value targeting.\nView image in fullscreen Photograph: Reuters\nThe IDF said the ambulance was being used by Hamas to transport its militants. A video of the inside of the ambulance shows a woman in a hospital gown lying wounded, with no weapons visible. Israel military officials have said Hamas would move its fighters unarmed in such instances.\n10 November\nVisual evidence shows the hospital being hit three times. On two occasions, fragments recovered after the hits appear to be from Israeli munitions.\nIn the early hours of the morning, while civilians were sheltering in the hospital compound, a video seems to show a civilian injured by a munition fragment. The IDF said a “misfired projectile” launched by Hamas was responsible. Photos and videos of fragments found on the ground appear to indicate an Israeli 105mm artillery illumination flare round, which Garlasco said would have been used to aid visibility on a dark night.\nVideo shows moment munition hits road in al-Shifa hospital compound Video: Ahmed Hijazi | Saleh Aljafarawi\nIn a separate incident, a video shows two large holes in a wall of the hospital, and part of a ceiling collapsed. Remnants of munitions appear to show a tail for a 120mm high-explosive Israeli tank shell, a munition that due to its force can cause collateral damage after hitting the initial target. Garlasco said: “These shells have a problem with over-penetration … so after hitting their target, they may keep going.”\nView image in fullscreen Photograph: Saleh Aljafarawi\nIn a later incident, separate clips show structural damage to the roof of a shelter in the hospital and people including injured children on the floor. It is unclear from the footage what kind of munition was involved.\nView image in fullscreen Photograph: Ahmed Hijazi | Saleh Aljafarawi\nA pair of satellite images from 8 October and 6 November show how civilians moved into the hospital complex’s grounds to shelter there.\nAl-Rantisi paediatric hospital\n5-6 November\nFootage shows substantial damage to the third floor and parts of the second floor, as well as damage to an ambulance parked in the vicinity.\nVideo shows damage to hospital building Video: Anadolu Agency via Reuters\n9-10 November\nVideos taken from the hospital window show two tanks in the surrounding streets.\nIDF drone footage released on 14 November – three days after the period studied by the Guardian – shows four Israeli tanks parked next to the hospital, and nine tanks in the streets surrounding the hospital.\nIndonesian hospital\n9 November\nMultiple videos show incidents of bombardment near the hospital, with one hit appearing to be close to the hospital entrance. Videos show people rushing from outside to shelter inside the hospital building, which has visible internal ceiling damage.\n00:00:12 Explosions ring out close to Indonesian hospital entrance – video\nAl-Quds hospital\n29-30 October\nVideos show damage to buildings around the hospital, broken windows at the hospital, and smoke and panic among civilians inside.\nDamage to roads around hospital and smoke and damage inside hospital Video: Palestinian Red Crescent\n2-8 November\nFootage shows the entrance of the hospital after what seems to be blast damage from aerial bombardment in the vicinity.\nThe building opposite the entrance to the hospital was severely damaged. Civilians appear to be sheltering on the hospital floor.\nComposite of videos after a blast near al-Quds hospital Video: Palestinian Red Crescent\nOther videos appear to show further blast damage to the interior: shattered glass on the floor, damaged patient beds and hospital equipment, parts of a ceiling down, and a curtain rod collapsed on to more hospital equipment.\nVideos and satellite imagery from 11 November show damage to roads and buildings around the hospital. The Palestinian Red Crescent said ambulances could not reach patients due to damaged roads.\nTurkish-Palestinian Friendship hospital\n30 October\nVideos show the only dedicated cancer hospital in the Gaza Strip enveloped in dense clouds of smoke after what appears to be a nearby hit. Footage shows a wall in one area caved in.\nView image in fullscreen Photograph: X\nSatellite imagery shows cratered roads, multiple craters around the main hospital building, and tracks from Israeli armoured cars. The hospital reported blast damage to two rooms and to its oxygen and water supply.\nPsychiatric hospital\n5-6 November\nImages show severe damage to the hospital, with three substantial holes in exterior walls.\nView image in fullscreen Photograph: Anadolu Agency\nAl-Nasr children’s hospital\n8-10 November\nFootage appears to show extensive damage, including holes in the walls of multiple rooms, including one used for imaging.\nVideo shows holes in hospital war and debris on the floor Video: PalestineTV\nAl-Awda hospital\n9 November\nImages show two Palestinian Red Crescent ambulances near the hospital that appear damaged. Another video shows people appearing to shelter inside an ambulance amid heavy bombardment. The PCR reported one injured paramedic.\nView image in fullscreen Photograph: PRCS | X\nInternational eye hospital\n8-9 October\nOne image shows the decimated ground floor of the building. The building was probably hit again, reducing it to rubble. A large crater is visible in satellite imagery showing the aftermath of what appears to be an Israeli airstrike.\nView image in fullscreen Photograph: Facebook ا لمستشفى الدولي للعيون\nPalestinian Medical Relief Centre for the Rehabilitation of the Disabled\n25 October\nThe medical facility reported on 26 October that the building was destroyed in a bombardment. Photos uploaded by the facility show a collapsed building and a large crater. The Guardian was unable to independently verify the images related to the facility.", "source_domain": "www.theguardian.com", "text": null, "title": "Hospital damage in Gaza during Israeli offensive - a visual investigation", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/01/hospital-damage-in-gaza-during-israeli-offensive-a-visual-investigation"}