{"authors": ["Emma Saletta", "Emma Saletta For Dailymail.Com"], "date_download": "2024-02-05 15:32:28", "date_modify": "None", "date_publish": "2023-12-01 18:32:22", "description": "McDonald's customers get ready, because the fast food chain is bringing back adult Happy Meals and McNugget Buddies.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12815117%2FMcDonalds-kerwin-frost-ADULT-happy-meals-nugget-toy-1980s.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/01/18/78479607-0-image-m-2_1701455532407.jpg", "language": "en", "localpath": null, "maintext": "McDonald's customers get ready, because the fast food chain is bringing back Adult Happy Meals and McNugget Buddies.\nConsumers can choose between a Big Mac Adult Meal and a 10-piece McNugget Meal with fries and their choice of soft drink.\nMcDonald's partnered with New York native Kerwin Frost - an entertainer and street style influencer to create the Kerwin Frost Box and brand new McNugget Buddies inspired by the 1990s.\nThis year, there will be a total of six McNugget Buddies: Kerwin Frost, Uptown Moe, Waffutu, BRRRICK, Darla, and Don Bernice.\nThe Kerwin Frost Box will be available for a limited time at participating US and select worldwide McDonald's restaurants on December 11.\nMcDonald's has partnered with New York native Kerwin Frost to create the Kerwin Frost Box adult happy meal that will be available in participating stores starting December 11\nConsumers will have the option to purchase a 10 piece nugget or Big Mac adult meal with fries and their choice of soft drink\nThe McNugget Buddies were first released in the 1980s, and like the upcoming toys, wear mix and match outfits and have different names and personalities\nAll of the dolls featured in the Kerwin Frost Box are members of Frost Way, which Kerwin said in the press release is where 'everyone is welcome to be exactly who they are.'\nEach doll is wearing an outfit inspired by Kerwin's childhood and belief that 'everyone should feel free to express themselves.'\nThey also have individual names and personalities that make each toy stand out in their own way.\nThe Uptown Moe toy is the no-nonsense, street-smart, loveable guy, the Frost Way neighborhood hero who looks good in a blue baseball hat.\nWaffutu is the beautiful female toy that is the curious optimist full of positivity raised by the whole Frost Way neighborhood.\nMcDonald's customers who are jokesters will love the BRRRICK toy for his adventurous personality, his love of techno music, and speaking in puns.\nDon Bernice is the fashionista toy described as a wise and experienced designer who 'creates all the outfits' and offers 'stern advice and words of wisdom.'\nDarla, the soft-spoken dreamer, is the toy that is a confident singer looking to pursue her dreams as a member of The Frostettos, while keeping busy running the local McDonald's in Frost Way.\nThe Kerwin Frost Box also includes a special Kerwin Frost toy - the town mayor who encourages the members of Frost Way to be themselves while keeping busy adding to his art collection and fixing the neighborhood.\nUptown Moe toy is the no-nonsense, street-smart, loveable guy that's the Frost Way neighborhood hero. Waffutu is the beautiful female toy that is the curious optimist full of positivity\nThe Kerwin Frost toy is the town mayor who encourages the members of Frost Way to be themselves\nThe BRRRICK toy is known for his personality, his love of techno music, and speaking in puns. Don Bernice is a wise designer who 'creates all the outfits' and offers 'stern advice and words of wisdom'\nDarla, the soft-spoken dreamer, is the toy that is a confident singer looking to pursue her dreams as a member of The Frostettos and running the local McDonald's in Frost Way\nSocial media users on X (formerly Twitter) have been excited for the upcoming adult meals - many of them being from Canada.\n'1. The last ones never came to Canada 2. I'm an adult 3. I love Happy Meals 4. They come with fricken McNugget buddies!!! I'm very excited for this,' an X user wrote.\nOther X users are not responding well to the news, citing displeasure with the food and opposition to the chain donating meals to Israel Defense Forces.\nOne person wrote: 'The happy meals are still cheap. Adults should not eat at McDonald's'\n'Apparently McDonalds is bringing back Adult Happy Meals and I feel the need to remind people that there is an active boycott of McDonalds for being a sponsor of the blue country that's committing gen0cide,' another person wrote.\n1. The last ones never came to Canada\n2. I'm an adult\n3. I love Happy Meals\n4. They come with fricken McNugget buddies!!!\nI'm very excited for this 😁https://t.co/P7tl6HJxpV — Jamie (@DaNerdling) December 1, 2023\nSocial media users have different opinions about McDonald's bringing back the Adult Meals, many being because of recent boycotts\nMcDonald's will also release merchandise based on the Kerwin Frost collection.\nA portion of the proceeds from the merchandise collection will go to the Harlem Arts Alliance.\nBased in Frost's hometown, this non-profit organization helps build resources, networks, and capacity for emerging and established artists.\nThe McNugget Buddies introduced in the 1980s are all over eBay, and one of its current listings for ten original toys is $325.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "McDonald's is bringing back ADULT happy meals - complete with a nostalgic fan-favorite toy from the 1980s", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12815117/McDonalds-kerwin-frost-ADULT-happy-meals-nugget-toy-1980s.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}