{"authors": ["Jon King"], "date_download": "2024-02-05 15:32:30", "date_modify": "None", "date_publish": "2023-12-01 07:21:00", "description": "The audience member said Israel Defense Forces were terrorists like Hamas, shocking the BBC Question Time presenter.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fpolitics%2F1840967%2Ffiona-bruce-question-time-idf-terrorists.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/139/1200x712/5094134.jpg", "language": "en", "localpath": null, "maintext": "Fiona Bruce stunned after audience member brands IDF ‘terrorists’\nQuestion Time presenter Fiona Bruce was left stunned after an audience member described the Israeli military as terrorist. The BBC star was chairing a debate about whether the British Government should call for a permanent ceasefire in Gaza. The ceasefire, which was set to expire on Monday (November 27), has paused the deadliest fighting between Israel and Palestinians in decades. Since the programme first aired, Israeli fighter jets have fired on Hamas targets as the week-long truce came to a violent end on Friday (December 1). Responding to Bruce's call for a final point from among the Question Time audience in a ceasefire debate, a man asked why politicians always talk about Israel's right to defend itself, but \"never\" assert the same for the Palestinians. He said: \"Why is our Government standing behind Israel? \"Hamas, I believe, are a terrorist organisation. So is IDF (Israel Defense Forces), but full support is given to them.\" Click here to join our Whatsapp community to be the first to receive politics news from The Express\nREAD MORE Six more Israeli hostages released sparks hope for more\nBruce then interrupted the questioner, wagging a finger and saying: \"You're calling the Israeli Defence Force (sic) - their national army - you're calling it a terrorist organisation? There are a lot of people that would take great offence at that.\" The man stood by his claim, insisting the IDF were operating in the same way as Hamas. He said: \"If you look at the proportion of the people killed on the seventh (of October when Hamas gunmen attacked Israel), the last 75 years - I do not defend Hamas. I am not part of them. Never have I defended any person killing anybody.\" He continued: \"The Palestinian people, they have the right to defend (themselves).\" The member of the audience then agreed with Bruce who characterised as a double standard his accusation against British politicians and sections of the media. Veteran journalist and broadcaster Andrew Neill responded to the question, telling the audience in Doncaster governments can call for a ceasefire all they want, but it wouldn't make any difference.\nFiona Bruce challenges the questioner, telling him a lot of people would find the idea offensive\nNeil said: \"There is no military solution to this and there is no political solution either. The two state scenario is dead. I used to support it - it's dead.\" Pushed by Liberal Democrat foreign affairs spokesperson Layla Moran to outline the alternative, Neil said there isn't one. He added: \"That's the problem. Not every problem has a solution. Sometimes things have to play out in the most horrific way.\" He explained that the Palestinians in Gaza had elected Hamas, and that the organisation which is proscribed as terrorist in the UK, is re-grouping and \"can't wait\" to carry out another October 7-style attack again. Israel has vowed to resume the war in an effort to end Hamas' 16-year rule of Gaza, but it is facing mounting international pressure to extend the truce and spare southern Gaza a devastating ground offensive similar to the one that has demolished much of the north. Roughly 240 hostages were captured by Hamas in its October 7 attack in southern Israel which ignited the war. More than 13,300 Palestinians have been killed since the conflict began, according to the Hamas-controlled Health Ministry in Gaza. About 1,200 people have been killed in Israel, mostly during the initial incursion by Hamas.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending\nThe Question Time audience member asks where is the right for Palestinians to defend themselves", "source_domain": "www.express.co.uk", "text": null, "title": "Fiona Bruce stunned after audience member brands IDF ‘terrorists’", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/politics/1840967/fiona-bruce-question-time-idf-terrorists"}