{"authors": [], "date_download": "2024-02-05 15:15:50", "date_modify": "None", "date_publish": "2024-01-25 15:06:44", "description": "The United States and Iraq will soon begin formal talks soon to transition the mission of a U.S.-led military coalition formed to fight the Islamic State in Iraq", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-iraq-baghdad-iran-islamic-state-b2484828.html.json", "image_url": "https://static.independent.co.uk/2024/01/25/15/Iraq_61163.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States and Iraq expect to begin formal talks soon to wind down the mission of a U.S.-led military coalition formed to fight the Islamic State group in Iraq, both governments said Thursday.\nThe U.S. has had a continuous presence in Iraq since its 2003 invasion. Although all U.S. combat forces left in 2011, thousands of troops returned in 2014 to help the government of Iraq defeat IS.\nIn the years since, the presence of U.S. forces, who have remained there to conduct counter-IS missions and training, has been a lightning rod for an increasingly influential faction of Iran-aligned militias and politicians in the country.\nIn a statement, Defense Secretary Lloyd Austin said the discussions will take place as part of a higher military commission that was agreed upon last summer — before the outbreak of the Israel-Hamas war on Oct. 7 rocked the region — and will discuss the “transition to an enduring bilateral security partnership between Iraq and the United States.\"\nIraq’s foreign ministry in a statement said Baghdad aims to “formulate a specific and clear timetable that specifies the duration of the presence of international coalition advisors in Iraq” and to “initiate the gradual and deliberate reduction of its advisors on Iraqi soil,” eventually leading to the end of the coalition mission and a “move to comprehensive bilateral political and economic relations with the coalition countries.”\nIt added that Iraq is committed to ensuring the “safety of the international coalition’s advisors during the negotiation period in all parts of the country” and to “maintaining stability and preventing escalation.”\nIraqi officials have periodically called for a withdrawal of coalition forces for years, particularly in the wake of a U.S. airstrike in January 2020 that killed Iranian Gen. Qassem Soleimani and Iraqi militia leader Abu Mahdi al-Muhandis outside the Baghdad airport.\nThe issue has surfaced again since Israel launched its major counteroffensive in Gaza following the Oct. 7 Hamas-led attack in southern Israel.\nSince mid-October, a group of Iran-backed militias calling itself the Islamic Resistance in Iraq have launched regular attacks on U.S. forces in Iraq and Syria, which the group said are in retaliation for Washington’s support for Israel in the war in Gaza.\nThose estimated 2,500 U.S. troops and the bases they serve on have drawn more than 150 missile and drone attacks fired by the militias. Scores of U.S. personnel have received minor injuries including traumatic brain injuries during the attacks.\nThe U.S. has struck militia targets in return, including some linked to the Popular Mobilization Forces, a coalition of mainly Shiite, Iran-backed paramilitary groups that is officially under the control of the Iraqi military although in practice it largely operates on its own. Iraqi officials have complained that the U.S. strikes are a violation of Iraqi sovereignty.\nSpeaking at the World Economic Forum in Davos earlier this month, Prime Minister Mohammed Shia al-Sudani said that there is no longer justification for the coalition’s presence in Iraq and that the Iraqi army is capable of tracking and fighting the remaining IS cells in the country.\n“We are a sovereign country, and therefore it is only natural that we moved towards this position,” he said. “This is a request from the people, and this is a democratic country.”\nAn Iraqi government official who spoke on condition of anonymity because they were not authorized to speak to journalists about the matter said that Iraq had sent a written request for the withdrawal of the coalition forces to the White House in November 2023.\nThe official said that Iraqi and U.S. officials were at odds over the timeline, with U.S. officials proposing a two- to five-year timeline while the Iraqis wanted a more immediate withdrawal.\nThe announcement of impending talks on an end to the mission is likely to be claimed as a victory by Iran-linked factions in Iraq.\nA U.S. defense official who spoke on condition of anonymity because he was not authorized to discuss details of the discussions said the U.S. and Iraq have been “discussing this for months and the “timing is not related to recent attacks.” The U.S. will maintain the “full right of self-defense” during the talks, he said.\nEven if U.S. forces leave bases in federal Iraq, they would likely remain in the semi-autonomous northern Kurdish region, whose government has closer ties to Washington.\n___\nAbdul-Zahra reported from Baghdad. Associated Press writer Abby Sewell in Beirut contributed to this report.", "source_domain": "www.independent.co.uk", "text": null, "title": "Washington and Baghdad plan to hold talks soon to end presence of US-led coalition in Iraq", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-iraq-baghdad-iran-islamic-state-b2484828.html"}