{"authors": ["Daniel Hurst"], "date_download": "2024-02-05 15:32:32", "date_modify": "None", "date_publish": "2023-12-01 14:00:20", "description": "European Commission vice-president says there must be ‘no role for Hamas in any post-conflict horizon’ during visit to Australia", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F02%2Faustralia-eu-talks-day-after-israel-hamas-war-gaza-palestine-two-state-solution.json", "image_url": "https://i.guim.co.uk/img/media/c904a30f066d38f649fc638af1e6d426576f3004/0_57_7788_4673/master/7788.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7fde0736a130e93520f5d40deb48d6d3", "language": "en", "localpath": null, "maintext": "Australia and the European Union are in talks about “the day after” the war in Gaza and are united on calls to revive a two-state solution, a senior official has said.\nBut the European Commission vice-president, Margaritis Schinas, added that Hamas had forfeited the right to be part of any political settlement.\nThe Israel Defense Forces resumed combat in Gaza after a tentative truce expired on Friday, with the IDF accusing Hamas of violating the terms of the temporary ceasefire by firing towards Israeli territory.\nIn an interview with Guardian Australia, Schinas said the war must be carried out “according to international law”, but he stopped short of making any assessment about compliance to date.\n“Well, this is something that is not easy to establish when you discuss a situation thousands of miles away, either in an office in Brussels or in the parliament building in Canberra,” he said during a visit to Australia.\nSchinas said the world must also “start thinking about the day after – the post-conflict horizon – where I think Australia and the European Union view things in the same way”.\nHe called for the international community to help create conditions for stability “so that Israel and Palestinians can live in peace and security in the clear perspective of a two-state solution”.\nSchinas said that could include support “in terms of reconstruction, humanitarian assistance and building up structures of a new state”.\nHe said the EU had tripled humanitarian aid to Gaza and intended to play a supportive role after the conflict “and I understand that Australia is on the same wavelength”.\nWhile pushing for a two-state solution, Schinas argued that there must be “no role for Hamas in any post-conflict horizon”.\n“Hamas lost the right to be part of a post-conflict horizon on 7 October,” the former Greek politician said.\nSchinas, whose responsibilities at the commission include fighting antisemitism, also vowed to step up the fight to counter growing prejudice.\n“The Holocaust and the Shoa are the stain in Europe’s history; these are the darkest chapters of our history books and we are determined not to relive them,” he said.\nThe comments come amid increasing concerns about a fracturing of social cohesion in Australia, including rising levels of antisemitism and Islamophobia.\nFamily members of Israelis killed or kidnapped by Hamas reiterated during a visit to Australia this week that they wanted to make “a very strong distinction” between the terrorist group and the Palestinian people.\nskip past newsletter promotion Sign up to Afternoon Update Free daily newsletter Our Australian afternoon update breaks down the key stories of the day, telling you what’s happening and why it matters Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n“They [Hamas] came to kill – they simply came to kill everybody,” said Tali Kizhner, whose son Segev, 22, was killed on 7 October at the Supernova music festival in Re’im.\n“I have two kids at home – 17 years old and nine-and-a-half – and they deserve to live in a country where they can be allowed to go to dance and not be killed. And they have the right to live in the country when they can go out and come back home to their mums.\n“Hatred is a disease and we do not want to be ill.”\nThe delegation of Israeli relatives and friends said they felt unsafe after a pro-Palestinian protest occurred on Wednesday night in the lobby of the Melbourne hotel where they were staying.\nThe demonstration prompted condemnation from Australian politicians, but the uproar also largely overshadowed a piece of good news for one member of the visiting Israeli delegation.\nMika Shani, 18, flew home early on Thursday after learning that her brother, Amit Shani, 16, had been freed when Hamas released another group of hostages in return for the release of Palestinians held in Israeli jails.\n“I’m beyond happy,” she said.\nThe Israeli delegation visited Parliament House in Canberra on Tuesday to share their stories with senior MPs, including the prime minister, Anthony Albanese.\nThe following day, a pro-Palestine delegation also visited Canberra to raise alarm about the “humanitarian catastrophe that is engulfing the whole of Gaza” and to urge MPs to back calls for a full ceasefire.", "source_domain": "www.theguardian.com", "text": null, "title": "Australia and EU in talks about ‘the day after’ war in Gaza and unite on two-state solution", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/02/australia-eu-talks-day-after-israel-hamas-war-gaza-palestine-two-state-solution"}