{"authors": [], "date_download": "2024-02-05 15:32:33", "date_modify": "None", "date_publish": "2023-12-01 01:02:59", "description": "A major offensive against Myanmar’s military-run government by an alliance of three militias of ethnic minorities has been moving at lightning speed, inspiring resistance forces around the country to attack", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fmyanmar-ap-beijing-bangkok-aung-san-suu-kyi-b2456560.html.json", "image_url": "https://static.independent.co.uk/2023/12/01/01/Myanmar_Fighting_62109.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA major offensive against Myanmar’s military-run government by an alliance of three militias of ethnic minorities in the northeast has been moving at lightning speed, inspiring resistance forces around the country to launch new attacks.\nWith Myanmar’s military falling back on almost every front, hope is rising among opponents that this could be a turning point in the struggle to oust the army leaders who toppled democratically elected Aung San Suu Kyi almost three years ago.\n“The current operation is a great opportunity to change the political situation in Myanmar,” said Le Kyar Win, spokesperson for the Myanmar National Democratic Alliance Army, or MNDAA, one of the three militias known as the Three Brotherhood Alliance that launched the offensive on Oct. 27.\nCaught by surprise by the attack dubbed Operation 1027, the military has lost more than 180 outposts and strongpoints, including four major bases and four economically important border crossings with China.\nBoth sides claim they have inflicted heavy tolls on the other, though accurate casualty figures are not available. Nearly 335,000 civilians have been displaced by the current fighting, bringing the total to more than 2 million displaced nationwide, according to the United Nations.\n“For the regime, this is by far the most difficult moment it’s faced since the early days of the coup,\" said Richard Horsey, the International Crisis Group’s Myanmar expert.\nComplicating matters for the military is China ’s apparent tacit support for the Three Brotherhood Alliance, stemming, at least partially, from Beijing’s growing irritation at the burgeoning drug trade along its border and the proliferation of centers in Myanmar from which cyberscams are run, frequently by Chinese organized crime cartels with workers trafficked from China or elsewhere in the region.\nAs Operation 1027 has gained ground, thousands of Chinese nationals involved in such operations have been repatriated into police custody in China, giving Beijing little reason to exert pressure on the Brotherhood to stop fighting.\n“If they really wanted the cease-fire, they do have the leverage to enforce one or get pretty far toward enforcing one,” Horsey said. “They haven’t done that, so that’s telling.”\nThe military, known as the Tatmadaw, remains far bigger and better trained than the resistance forces, and has armor, airpower and even naval assets to fight the lightly armed militias organized by various ethnic minority groups.\nBut with its unexpectedly quick and widespread losses and overstretched forces, morale is sagging with more troops surrendering and defecting, giving rise to a wary optimism among its diverse opponents.\n“I would say the revolution has reached the next level,” said Nay Phone Latt, a spokesperson for the National Unity Government, the leading opposition organization.\nTHE OFFENSIVE\nThe Feb. 1, 2021, seizure of power by army commander Senior Gen. Min Aung Hlaing brought thousands of pro-democracy demonstrators to the streets of Myanmar’s cities.\nMilitary leaders responded with brutal crackdowns and have arrested more than 25,000 people and killed more than 4,200 as of Friday, according to the Assistance Association for Political Prisoners.\nIts violent tactics gave rise to People’s Defense Forces, or PDFs — armed resistance forces that support the National Unity Government, many of which were trained by the ethnic armed organizations the military has fought in the country’s border regions for years.\nBut resistance was fragmented until Operation 1027, when three of the country’s most powerful armed ethnic groups, the Myanmar National Democratic Alliance Army and the Ta’ang National Liberation Army in northeastern Shan state, and the Arakan Army in western Rakhine state, assembled a force of some 10,000 fighters, according to expert estimates, and rapidly overran military positions.\nSensing weakness and inspired by the early successes of those attacks, the Kachin Independence Army followed by launching new attacks in northern Kachin state, then joined the Arakan Army to help lead a PDF group to take a town in central Sagaing, the heartland of traditional ethnic Bamar support for the Tatmadaw.\nIn the eastern state of Kayah, also known as Karenni, an alliance of ethnic armed organizations launched their own attacks, beginning a direct assault on Nov. 11 on the state capital of Loikaw, where the Tatmadaw has a regional command base.\nCompleting the encirclement of Tatmadaw forces, the Arakan Army attacked outposts in its home state of Rakhine in the country’s west on Nov. 13. Their success has been slow, with the Tatmadaw making use of naval power off the west coast to bombard positions, along with concentrated artillery and air strikes, according to a report by the International Institute for Strategic Studies.\n“It’s not done fighting, and the air and artillery strikes are increasing and becoming more intense,” said Morgan Michaels, who authored the report and runs the IISS Myanmar Conflict Map project. “So we have to see how that plays out.”\nAnd despite their talk of ridding the country of the military regime, a lot of the fighting is also about the various groups seizing control of territory, raising the possibility that the Tatmadaw could end at least some of the fighting by making large concessions, he said.\nStill, unlike the civil war in Syria where multiple groups have different and often conflicting objectives, in Myanmar the anti-military groups are not fighting among each other, he said.\n“It’s important to emphasize that many groups have the shared goal of either overthrowing or dismantling or severely depleting the capacity of the military regime,” Michaels said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Myanmar's military is losing ground against coordinated nationwide attacks, buoying opposition hopes", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/myanmar-ap-beijing-bangkok-aung-san-suu-kyi-b2456560.html"}