{"authors": ["Sadhna Yadav"], "date_download": "2024-02-05 15:32:35", "date_modify": "None", "date_publish": "2023-12-01 06:11:23", "description": "Most of the people in Gaza have been forced to live in temporary shelters, tents, or cars.", "filename": "https%3A%2F%2Fwww.ibtimes.co.uk%2Fisraeli-airstrikes-southern-gaza-may-force-1-million-refugees-egypt-warns-unrwa-chief-1721940.json", "image_url": "https://d.ibtimes.co.uk/en/full/1721697/gaza.jpg", "language": "en", "localpath": null, "maintext": "Hundreds and thousands of Gaza residents have been displaced due to the war between Hamas and Israel.\nNow the head of the UN agency for Palestinian refugees, Phillippe Lazzarini, has warned that the internally displaced 1 million refugees may try to cross into Egypt if the Israeli military resumes its assault south of Gaza.\nThe statement came after Lazzarini paid a visit to Gaza and interacted with the people. He called for another extension of the truce between Israel and Hamas, per The Guardian.\n\"We are in a race against time, and already disease is becoming as much a threat as the bombardment [...] The combined impact of the bombardment and the siege has already pushed people to the south, if there is fighting there is indeed a higher likelihood that they might wish to flee further south and beyond the border.\"\nIsraeli authorities had asked civilians in Gaza to move to the south after they declared war on Hamas following the October 7 Hamas attack on Israel.\nThe Gaza Strip was one of the most densely populated places in the world. The civilians moving to the south have only exacerbated the situation, with UN agencies struggling to deliver aid and assistance.\n\"So, you have the almost complete concentration of the population in half the territory – an area that cannot support such a presence because of even the lack of water,\" he added.\nThe World Health Organisation (WHO) also warned of a humanitarian crisis if the fighting does not come to an end soon.\nAccording to a UN estimate, 1.8 million people have been displaced in the Gaza Strip. Most of them have been forced to live in temporary shelters, tents, or cars.\n\"Eventually, we will see more people dying from disease than we are even seeing from the bombardment, if we are not able to put back this health system and provide the basics of life. Food, water, medicines and of course fuel to operate hospitals,\" warned Margaret Harris, a WHO spokesperson.\nIt has warned that the lack of clean drinking water, toilets, and clean food could lead to typhoid and cholera outbreaks if something is not done immediately. The agency went on to claim that the deaths due to disease in Gaza may surpass those from war.\nThe ongoing war has already killed more than 14,000 Palestinians, including 6,000 children, according to the Gaza Health Ministry, which is also controlled by Hamas.\nMeanwhile, the truce between Israel and Hamas has come to an end, with Israel stating that it has resumed fighting with Hamas in the Gaza Strip. The IDF said that it shot down a rocket fired from Gaza shortly before the truce was to officially expire. The truce was to last four days initially, but it was extended twice.\nIn a post on X, the Israel Defense Forces said that Hamas opened fire at Israel and violated the terms of the truce agreement.\nThe Hamas-run interior and national security ministry also confirmed the development on their Telegram channel and said that several air strikes have hit southern Gaza this morning.\nAs part of the truce, Israel had agreed to release Palestinian prisoners held in Israeli jails, and Hamas agreed to release hostages. As many as 105 hostages held in Gaza were released during the temporary ceasefire, while Israel released 240 Palestinian prisoners.\nThe war between Israel and Hamas began after the militant group launched an unprecedented coordinated attack on Israel. Hamas attacked Israel with a barrage of some 2,000–5,000 missiles on October 7.\nGunmen crossed the border by land, sea, and air, attacking the southern and central parts of Israel, including Tel Aviv and Jerusalem. In retaliation for the Hamas attacks, Israel's prime minister declared war against the militant outfit.", "source_domain": "www.ibtimes.co.uk", "text": null, "title": "Israeli Airstrikes On Southern Gaza May Force 1 Million Refugees To Egypt, Warns UNRWA Chief", "title_page": null, "title_rss": null, "url": "https://www.ibtimes.co.uk/israeli-airstrikes-southern-gaza-may-force-1-million-refugees-egypt-warns-unrwa-chief-1721940"}