{"authors": [], "date_download": "2024-02-05 15:32:36", "date_modify": "None", "date_publish": "2023-12-01 07:00:09", "description": "This isn’t some ghoulish competition, where any empathy shown to dead Israelis leaves less available for Palestinians, says Guardian columnist Gaby Hinsliff", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fdec%2F01%2Fisrael-hamas-war-rape-israelis-palestinians.json", "image_url": "https://i.guim.co.uk/img/media/1f402fd857e2df16b21ef9f773383f879441ecfd/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=1878c812f5ca10a7c5bd0ee13edcc8e2", "language": "en", "localpath": null, "maintext": "There is no such thing as a perfect victim, but a million ways to be an imperfect one. She was drinking. Her skirt was too short. She went willingly back to the footballer’s mansion, or up to Harvey Weinstein’s hotel suite, so what did she think was going to happen? Maybe she was a teenage runaway, or a sex worker; he was a good boy, or a much-loved celebrity. There is a long list of reasons rapists get away with it, but it all too often starts with a jury’s refusal to listen to a woman they have already decided for some stubborn reason not to like. Remember that, as we come to the distressing picture now emerging of alleged multiple rapes and sexual assaults by Hamas fighters amid the atrocities of 7 October.\nThis week, the UN secretary general, António Guterres, finally called for what he described as “numerous accounts of sexual violence during the abhorrent acts of terror by Hamas” to be “vigorously investigated”.\nHarrowing stories had begun emerging within days from the desert rave where traumatised young women, who survived only by hiding from the gunmen, described watching in silent horror as other women were gang raped, mutilated and shot. Israeli women’s rights groups, worried that chances to collect forensic evidence were missed in the initial chaos of a country under attack, swiftly mobilised – and last week, Dr Cochav Elkayam-Levy, the lawyer chairing a civil commission hastily created to document crimes against women and children during the massacre, flew to meet UN officials to discuss the testimony collated. Look away now if you would rather not read about women and young girls found dead with their pants pulled down, and telltale evidence of bleeding, bruises and scratches; about smashed pelvises, semen samples, and graphic details I wouldn’t normally go into on these pages except that otherwise it seems people don’t believe it. Though some won’t, even then.\nRape is a war crime as old as war itself, and yet still often invisible thanks to the stigma surrounding survivors, the practical challenges of gathering evidence under fire, and bleakly, sometimes also the lack of survivors. But in recent years we have at least got better at recognising a pattern deserving of investigation. So when tales of Islamic State fighters raping and enslaving Yazidi women began to surface, or when horrific stories started filtering out from women in occupied Ukraine last year, I don’t remember too many sceptics demanding to see video proof. Nor do I recall many victim support workers responding as the director of the Sexual Assault Centre at the University of Alberta in Canada did after 7 October, by signing an open letter condemning genocide in Gaza that criticised a Canadian politician for repeating “the unverified accusation that Palestinians were guilty of sexual violence”. Only in this conflict have some normally proud progressives seemingly gone out of their way to show they don’t always #BelieveWomen, after all.\nThe response to Jews posting about the issue on X this week has ranged from casual whataboutery to a gruesome variant of the “pics or it didn’t happen” school of online scepticism, questioning why there aren’t any actual live rapes visible on that grisly compilation of atrocities the Israel Defense Forces (IDF) are currently screening to select opinion formers. (The film, compiled from security camera footage and terrorists’ GoPros, includes only material that survivors’ families have expressly consented to publishing – not everyone wants their child’s last moments made public – and the IDF says some scenes judged too distressing or intrusive were excluded.) Evidently the stomach-turning images millions have already seen online – a dead woman, lying with her skirt pulled above her waist and no underwear on; the young woman bundled out of a truck in the Gaza Strip, the crotch of her jogging bottoms soaked in blood – aren’t enough for some.\nWhy do people who would probably happily judge an allegedly predatory actor or MP based on little more than hearsay seemingly struggle to entertain doubts about the sexual conduct of a terrorist, as if to do so would somehow be a betrayal of the Palestinian cause? For those who still conceive of Hamas gunmen as freedom fighters engaged in glorious resistance, it’s perhaps easier to rationalise away dead women than raped ones. It’s a war, they might tell themselves, and people die in war; anyway, look how many thousands more innocent women and children have died in Gaza. But a crime so obviously born of misogyny, revenge and exploitative power is not so easily explained away. For those who can’t deal with the troubling cognitive dissonance, the easiest thing is to decide that it just didn’t happen. The survivors must be liars, along with the first responders who reported finding half-naked bodies with injuries I won’t describe here, and the pathologists and women’s rights activists and news agencies claiming to have been shown supporting photographs and ambassadors saying they believe what they’ve heard from morgue workers; liars, the lot of them. Because if they aren’t, what are you?\nAlmost two months have now elapsed since 7 October, and in that short time, the Hamas-controlled Gaza health ministry says that more than 15,000 Palestinians have died in Gaza. The current truce may not hold much longer, and the consequences if the fighting spreads to the impossibly overcrowded south don’t bear thinking about. The war crimes allegedly committed by Israel against Palestinians during this conflict obviously require investigation every bit as urgently as the ones that triggered it, and the UN’s ability to investigate rape claims has doubtless not been helped by the Netanyahu government’s reluctance to engage with a body that has been repeatedly and justifiably critical of Israel’s past actions in the occupied territories.\nBut all that said, this isn’t some ghoulish competition, nor a zero-sum game where any empathy shown to dead Israelis somehow leaves less available for Palestinians. Collectively, our international institutions must be capable of keeping more than one wrong in mind at once. And individually, we should expect of ourselves what we ask of juries, judges and police every time they hear a rape case, which is not to unquestioningly believe every word, but to listen with compassion and an open mind. A war crime is a war crime, regardless of who committed it. And rape is rape, even when perpetrated against someone you secretly don’t want to think of as a victim.\nGaby Hinsliff is a Guardian columnist", "source_domain": "www.theguardian.com", "text": null, "title": "Whatever your view of the Israel-Hamas war, rape is rape. To trivialise it is to diminish ourselves", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/dec/01/israel-hamas-war-rape-israelis-palestinians"}