{"authors": ["Dan Sabbagh"], "date_download": "2024-02-05 15:32:37", "date_modify": "None", "date_publish": "2023-12-01 16:36:22", "description": "IDF claim to be avoiding blanket bombing the south, where about 2mn people live, but their new approach does not look much different", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fdec%2F01%2Fisraels-military-strategy-threatens-to-worsen-humanitarian-crisis-in-south.json", "image_url": "https://i.guim.co.uk/img/media/52ff17b473c3fde6ef57213e0b435d2f3e6fbb89/0_192_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=92f4d158c81f4518244214dc9756e3f7", "language": "en", "localpath": null, "maintext": "Israel’s Defense Forces waited just four minutes after the truce expired at 7am before restarting bombing, according to one resident of Khan Younis. An hour later, its military set out its plan for the “next stage of the war”: a division of Gaza into dozens of numbered “evacuation areas”, a core part of the military’s plan to gradually take control of the southern part of the strip.\nThe military’s plan, canvassed privately this week, is to avoid a repeat of the blanket bombing of the northern Gaza in the crowded south, with sequential, targeted bombing campaigns. Under the plan, people in certain numbered districts of Gaza will be told to evacuate before bombing begins, although how much time they will get is not clear; homes in Khan Younis were among the targets struck on Friday hours after the truce expired, and residents were given little if any time to flee.\nIsrael’s military dropped leaflets into Khan Younis on Friday morning, warning people in certain districts to evacuate and that the city was now “a dangerous combat zone” and telling them that people should take shelter in Rafah further south. It also featured a QR code linked to a website mapping all the numbered districts and asking residents for their device’s location.\nIsrael’s military remains determined to target Khan Younis because it believes Hamas’s leadership, led by Yahya Sinwar, is based in tunnels underneath the city. “The aim of the phase we are currently in is the destruction of the military capability of Hamas,” said Tamir Hayman, a former IDF major general, who has returned to provide advice to former colleagues. At some point, after a certain level of bombing, a ground operation is anticipated.\nHowever, the new military approach threatens to turn an already desperate humanitarian situation in the crowded south into an utterly dire one. An estimated 2 million people now live in the south, half of whom were evacuated from the north. Jason Lee, Palestine country director for Save the Children, said he visited a shelter in Khan Younis two days ago: “It was designed for 1,000 people, but has 35,000 in it. There are 600 people for every toilet.”\nIsraeli defence sources say they expect a southern campaign to take longer than the north, running into January or longer, although timescales in war can be hard to predict. But while it may proceed gradually, and avoid a certain number of civilian casualties if the evacuations go ahead as planned, it will inevitably leave more and more people pushed south around Rafah. “Where can people move to?” asked Lee. “Will they end up pushed next to the Mediterranean, and in the sea?”\nIt raises the grim prospect of fighting running through December, perhaps punctuated by pauses to allow more hostage releases, and risks increasing tensions between Israel and the international community, in particular with the US. Antony Blinken, the US secretary of state, said on Thursday that Israel must “minimise further casualties of innocent Palestinians” in future military operations and “avoid further significant displacement of civilians inside of Gaza”.\nBut it is hard to see how both goals can be achieved, even on Israel’s revised area-by-area strategy, given Israel’s overarching objective to eliminate Hamas as a military and political force in the Gaza Strip. And for all the emphasis on civilian evacuations, Israel said it struck 200 targets on Friday, including in Khan Younis and Rafah. In practice, its new military strategy does not yet look much different.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel’s military strategy threatens to make a desperate situation utterly dire", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/dec/01/israels-military-strategy-threatens-to-worsen-humanitarian-crisis-in-south"}