{"authors": ["Will Potter", "Will Potter For Dailymail.Com"], "date_download": "2024-02-05 15:32:38", "date_modify": "None", "date_publish": "2023-12-01 05:34:17", "description": "A bombshell report has claimed Israeli intelligence had an intimate understanding of Hamas' October 7 attack blueprint over a year prior, but brushed it off as it was deemed unachievable.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12812537%2FIsrael-Knew-Hamas-Attack-Plan-Year-Ago.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/12/01/05/78452359-0-image-a-60_1701408850669.jpg", "language": "en", "localpath": null, "maintext": "It comes amid mounting scrutiny on Israeli intelligence and its failure to grasp the military capabilities of Hamas\nIsraeli officials had an intimate understanding of Hamas' brutal October 7 terrorist attack over a year before it happened, but brushed off the battle plan as too aspirational for the group to pull off, a bombshell report has claimed.\nIn a 40-page document obtained by The New York Times, Hamas laid out a detailed plan to carry out its assault on Israel that ultimately led to the deaths of approximately 1,200 people in a day.\nThe blueprint reportedly did not set a date for the attack, but offered an exhaustive look at the terrorist group's strategy, including a targeting fortifications around the Gaza Strip while storming key military bases and division headquarters.\nAccording to the outlet, the plans within the document were followed by Hamas with chilling precision in the attacks last month, raising questions as to why Israel failed to take steps to prevent it.\nIt is also claimed that officials admitted they could have stopped, or at least blunted, the October 7 attacks had they taken a number of urgent warnings from analysts seriously.\nA bombshell report claims that Israel had an extensive understanding Hamas' plans for an attack a year before the October 7 siege, including detailed training exercises (pictured) of Hamas terrorists planning to paraglide at the outset\nA document reportedly offered chillingly accurate information over Hamas' intentions to take Israel by surprise and launch a blistering attack, which saw them attack a music festival on unsuspecting partiers (pictured)\nThis graphic (above) shows how the Hamas massacre on the Kfar Aza kibbutz unfolded\nThe report comes amid mounting scrutiny on Israel's intelligence systems and its failure to understand the military capabilities of Hamas. It is not known if Prime Minister Benjamin Netanyahu (pictured October 24) saw the document, which was widely circulated a year before the attacks\nFor over a year, Israeli officials reportedly understood that Hamas had designs on beginning an attack over the border with a barrage of rockets in a surprise onslaught.\nThe use of drones to knock out security cameras and automated machine guns positioned along the border were also part of Hamas' longstanding plan.\nIn a sign of the shocking accuracy Hamas followed to its master plan, the document ordered gunmen to fly into Israel on paragliders, with the unorthodox strategy used to horrific affect at the fateful Supernova music festival where at least 364 people were killed.\nIsraeli intelligence officials have come under scrutiny in the weeks after the October 7 attacks, amid questions over a lack of understanding of the impending attack before it took place.\nBut Hamas appeared to have a far better grasp on Israel's apparatus than previously known, as the document included extensive, sensitive details on the location and size of Israel's military forces and communication hubs.\nThis has also raised questions as to how Hamas was able to obtain this information, and the possibility of leaks within Israeli intelligence.\nDespite the chilling details found in the document, which was circulated widely within Israeli military and intelligence circles, experts reportedly determined that the attack was far too ambitious for Hamas to achieve.\nIt is not known if Israeli Prime Minister Benjamin Netanyahu saw the document.\nNamed 'Jericho Wall' after the border in modern-day West Bank that are cited in biblical texts, sixty points within the wall were said to be the targets for Hamas fighters for their siege into Israel.\n'Surprise them through the gate. If you do, you will certainly prevail', the document began, a quote from the Quran. The same quote has been repeated by Hamas terrorists in chilling footage from the October 7 attacks, and in the weeks since.\nShocking footage showed festival goers flee carnage as Hamas terrorists gunned down revellers at a music festival on October 7\nThe blood-stained floors of a kibbutz after Hamas terrorists ripped through the area\nA house left in ruins after an attack by Hamas militants on this kibbutz days earlier when dozens of civilians were killed near the border with Gaza on Tuesday\nThe burned-out carcass of the home of Bilha and Yakovi Inon, an Israeli couple who were killed by Hamas terrorists when their American style wooden chalet was burnt to the ground with them inside\nDespite widespread knowledge of the document, it was largely dismissed, including by the Israeli military's Gaza division, the wing tasked with defending the border with Gaza where much of the ongoing conflict has centered.\nThe division's experts determined that Hamas' objectives and intentions were unclear, with a separate military assessment of the document finding: 'It is not yet possible to determine whether the plan has been fully accepted and how it will be manifested.'\nThree months before the October 7 attacks, German diplomat Sven Kühn von Burgsdorff demonstrated how 'everything is possible in Gaza' as he paraglided into the region in a warning over its vulnerability.\nAt that same time, a veteran analyst with Unit 8200, the signals intelligence division of the agency, reportedly warned that Hamas had carried out days-long training exercises that chillingly mimicked the battle plans from the document.\n'I utterly refute that the scenario is imaginary,' the analyst warned, comparing the exercise to the 'content of Jericho Wall.'\n'It is a plan designed to start war... it is not just a raid on a village.'\nA dead body lies on the ground at the site of an attack on the Nova Festival by Hamas gunmen from Gaza, days after the bloody attack was launched\nAn Israeli flag flies over body bags of over 20 dead Hamas militants with the word 'terrorist' written in Hebrew, on a main field at Kibbutz Be'eri, where dozens of Israeli civilians were killed days earlier near the border with Gaza on October 11\nAccording to encrypted emails seen by the New York Times, a colonel in Israel's Gaza division brushed off the veteran analyst's concerns.\nThe outlet claimed that in interviews with officials, it was admitted that Hamas' siege could have been prevented, or at least diminished, if the warnings had been taken seriously.\nIsrael's lack of proper attention paid to the blueprint appears to be directly tied to a misunderstanding of Hamas' military capabilities.\nOfficials reportedly admitted that this came even as they saw growing evidence of the terrorist group's growing influence, with many staggered in the weeks since over the extensive tunnel systems the group has constructed in Gaza.\nIt is unclear how the document was obtained by Israeli officials, and the counterterrorism division and the military declined to comment on the Times report.\nThe blueprint is also not the first such document to be seen by the nation, with a separate 2016 Defense Military memo reportedly claiming: 'Hamas intends to move the next confrontation into Israeli territory.'\nIn a chilling contrast to the 2023 attack, the plans for seven years ago also included hostage taking and 'occupying an Israeli community (and perhaps even a number of communities).'\nSimilarly to the plans were seen in 2016, the recent document also included details of rocket attacks to distract Israeli soldiers and direct them to bunkers, alongside drones to target Israel's surveillance and security apparatus.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel obtained Hamas' October 7 battle plan a YEAR before it happened - but dismissed attack as 'aspirational', bombshell report claims", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12812537/Israel-Knew-Hamas-Attack-Plan-Year-Ago.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}