{"authors": ["Tim Mcnulty", "Alessandra Scotto Di Santolo", "Natalie Crookham"], "date_download": "2024-02-05 15:32:39", "date_modify": "None", "date_publish": "2023-11-30 22:07:00", "description": "While Kremlin spokespersons acknowledge unexpectedly heavy losses, they attribute the situation to inflated claims by Kyiv.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1840598%2Fukraine-war-live-vladimir-putin-missiles-winter-attack.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5093556.jpg", "language": "en", "localpath": null, "maintext": "Russia is grappling with an alarming surge in casualties, drawing comparisons to the staggering losses seen during World War I. Recent data indicates that Russian soldiers engaged in the conflict in Ukraine are experiencing a level of casualties unprecedented throughout the war.\nOn November 29, military data researcher Ragnar Gudmundsson revealed statistics highlighting the dire situation. According to his findings, Kremlin troop casualties averaged 994 men killed per day during the previous week. Shockingly, over 25,000 Russian service personnel have either lost their lives or suffered severe injuries in combat in Ukraine throughout the month of November.\nThis rate of casualties, notably concentrated in attacks near the Donbas region's Avdiivka, surpasses the peak losses incurred by the Russian army during both successful assaults on Severodonetsk in March and April 2022 and unsuccessful attacks on Vuhledar in February 2023. Gudmundsson's analysis, based on Ukrainian claims of Russian troop losses, indicates a 10 percent increase in the current casualty pace.\nWhile Kremlin spokespersons acknowledge unexpectedly heavy losses, they attribute the situation to inflated claims by Kyiv. However, most Western estimates align with Ukrainian figures, considering them reasonably accurate. Notably, secret Pentagon estimates leaked in April 2023 via the Discord gamer network suggested around 40,000 Russian deaths and 110,000 severe injuries at that time. In contrast, Ukrainian open-source claims as of May 1, 2023, exceeded even these estimates, citing 160,000 Russian casualties.\nTHIS BLOG HAS CLOSED. THANK YOU FOR FOLLOWING OUR UPDATES.", "source_domain": "www.express.co.uk", "text": null, "title": "Putin left scrambling as Russia’s monthly losses comparable to WWI", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1840598/ukraine-war-live-vladimir-putin-missiles-winter-attack"}