{"authors": ["Jason Burke", "Sufian Taha"], "date_download": "2024-02-05 15:32:44", "date_modify": "None", "date_publish": "2023-11-30 05:00:39", "description": "With olives the largest single agricultural product on the West Bank, Palestinians say Israeli restrictions and settler violence are losing them $70m", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F30%2Fno-work-and-no-olives-harvest-rots-as-west-bank-farmers-cut-off-from-trees.json", "image_url": "https://i.guim.co.uk/img/media/1b8df5569b7680de1ffc73a81b6c201df9b3fedb/0_272_4032_2419/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=24d2a39f2e86dc93237bc9f52e4146c2", "language": "en", "localpath": null, "maintext": "Shaadi, Isa and Mahmud Saleh look out across the valley, bite their nails, wring their hands and worry. There is no work locally and travelling to find any is almost impossible because of restrictions imposed by Israel on the occupied West Bank after the 7 October attacks by Hamas that killed more than 1,200 people. The main road into their village has been almost entirely blocked. Their debts are mounting up.\n“There has never been anything like this,” says Isa, 73. “Life is not normal.”\nThis is true of more or less everything in Israel and the occupied territories at the moment. In Gaza, the Israeli offensive has reduced swaths of the territory to rubble, displaced more than a million people and killed about 15,000, about 40% of them children, according to local authorities in the Hamas-run territory.\nIn the West Bank, there has been a wave of violence including Israeli military raids, firefights between troops and armed Palestinian factions, airstrikes, stone-throwing during protests and more. A clampdown by security forces has led to thousands of arrests and sweeping restrictions on movement. The measures are more severe than anything in nearly a generation, Palestinians say.\nIsraeli officials say the repression is necessary to keep Israelis safe and thwart further violence being planned by Hamas and extremists on the West Bank. Those detained are Hamas leaders or planning attacks, they say. NGOs and others dispute this, saying that many of the 2,000 or more people who have been arrested are innocent and the security measures are indiscriminate.\n“This is beyond protecting anyone … It is collective punishment for October 7,” says Mahmud Saleh, 48.\nMost of all, though, the Saleh family worry about their olives. It is close to the end of the traditional harvest season and they, like villagers across the West Bank, have been unable to reach most of their trees.\nThis means no oil, soap and multiple other products, or revenue from their sale, and disruption of a profoundly important time for the nearly 3 million Palestinians on the West Bank.\nRiham Jafari, who lives in Bethlehem and works for ActionAid Palestine, says the olive harvest season is traditionally “a special and joyful time for Palestinians, when families and friends gather to pick their olives, sing and share food”.\nOlives are the largest single agricultural product on the West Bank, and would have earned farmers $70m in total this year, says Abbas Milhem, of the Palestinian Farmers’ Union (PFU).\nWith 110,000 farmers directly profiting from the olive harvest and another 50,000 people earning much of their livelihood from working with the trees and produce, the impact is enormous. Between a quarter and a third of the Palestinian population of the West Bank is affected.\nMilhem blames attacks and intimidation of villagers by Jewish Israeli settlers in the West Bank. That violence will mean around half of the harvest on the West Bank will be left on the trees, he says.\nPalestinian and international NGOs say that the settlers, whose presence is illegal under most interpretations of international law, are exploiting the new climate of fear in Israel after the 7 October attacks to further their own ideological agenda.\n“This year is very different. There is a lot of violence and intimidation with trees cut, uprooted, or set on fire. It is more than just economic. The olive trees represent our connection to the land. It is very important to our identity as Palestinians,” says Jafari, whose family has trees.\nMilhem says the change since 7 October has been dramatic. “It used to be a few farmers near a settlement or the separation wall [which divides the occupied West Bank from Israel] but since the war occurred, it is the worst we can remember in decades. Sadly, the war coincided with the beginning of the olive season.”\nBenjamin Netanyahu, the Israeli prime minister, recently blamed a “tiny handful of extremists” for violence against Palestinians and warned that their actions could lead to problems in the West Bank. But critics say Israel’s government, which includes a series of far-right parties, has backed the settlers and their claims, despite international calls to rein them in.\nEarlier this month, the finance minister, Bezalel Smotrich, a settler who leads one of the far-right parties, called for a ban on Palestinians harvesting olives close to Israeli West Bank settlements. Smotrich demanded “sterile” zones forbidden to Palestinians close to settlements and their access roads.\nSettlers say they regularly come under attack from villagers and are acting in self-defence. They say they are frightened by violent threats whenever they leave their homes.\nAfter an Israeli soldier was killed at a checkpoint on the West Bank’s route 60 earlier this month, Itamar Ben-Gvir, Israel’s national security minister, said Israel needed to deal with Hamas in the West Bank “exactly like we are dealing with Gaza”.\nIn previous years, the olive harvest has been carefully coordinated by local Palestinian authorities and the Israeli military to allow farmers specific dates on which they can reach their trees. A schedule of timings for the farmers of as-Sawiya was published the day before Hamas attacked southern Israel.\nSince then, all requests for permission to reach most of their trees have been turned down, says Mahoud Ahmed, 66, the head of the village council.\n“We always consult but now we are told by the Palestinian Authority that there is no response from the Israeli side and without a response we can’t go anywhere safely,” he says. “Since October 7 there has been no economic activity in the village. Most of the people here are dependent on construction work … for employment and that just stopped totally. No one can go anywhere, let alone into Israel for work.”\nNew restrictions mean most of those who once worked in Israel, often as builders, cannot now cross from the West Bank.\nIn a statement, the Israel Defense Forces said that since 7 October there had been a significant increase in terrorist attacks in the West Bank, with more than 550 attempted attacks recorded.\n“The mission of the IDF is to maintain the security of all residents of the area and to act to prevent terrorism and activities that endanger the citizens of the state of Israel,” it said.\n“Due to the IDF constant presence in the area, the soldiers encounter incidents of violations of the law by Israelis, some may be violent incidents or incidents directed at Palestinians or their property. In these cases, the soldiers are required to act to stop the violation and, if necessary, to delay or detain the suspects until the police arrive at the scene. In situations where soldiers fail to adhere to IDF orders, the incidents are thoroughly reviewed, and disciplinary actions are implemented accordingly.”\nAmid the cinder block houses, potholed roads and refuse-strewn fields of as-Sawiya, there is deep concern that the current situation will last for months, even years.\nShaadi Saleh, who usually earns his living as a house painter, says he needs 13,000 Israeli shekels ($3,500) the olive harvest would have brought to pay school fees for his four children. “I can’t do anything. I am just sitting at home. I have no work and no olives,” the 45-year-old says.\nThe worst incident occurred last month when Bilal Saleh, a cousin of Mahmud and Shaadi, was shot dead in an olive grove, allegedly by settlers.\nBilal Saleh was known throughout the region for the wild herbs he sold from a barrow on the streets of Ramallah, the capital of the Palestinian Authority. He was killed, allegedly by a shot fired by a settler, while harvesting olive trees on the edges of the villages’ communal land. The trees stand just a few hundred metres from the gates of Rehelim, a settlement on the sloping ridge opposite as-Sawiya.\nSettlers’ leaders say the killing was in self-defence after settlers were “attacked with rocks by dozens of rioting Hamas supporters”. The Saleh family say Bilal Saleh was a “quiet, simple” man who had been with his wife and children minutes before the shooting and had tried to flee, but turned back to pick up his phone.\n“We haven’t been to the trees since Bilal was shot,” says Shaadi. “You have to understand olive trees take a long time to grow. Maybe 50 years or more, so you can’t just replace them. For me, my olive trees and my sons are the same. They are all my children.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘No work and no olives’: harvest rots as West Bank farmers cut off from trees", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/30/no-work-and-no-olives-harvest-rots-as-west-bank-farmers-cut-off-from-trees"}