{"authors": ["Shauna Brown"], "date_download": "2024-02-05 15:15:51", "date_modify": "None", "date_publish": "2022-09-23 00:00:00", "description": "Also from the Front Page newsletter: Top scientist claims BBC 'misrepresented' Covid risk. Sign up below.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2024%2F01%2F25%2Fthursday-evening-news-briefing-justice-not-served-say-victi%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/news/2022/09/23/TELEMMGLPICT000310354963_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Good evening. The families of Valdo Calocane’s victims have spoken out after he was sentenced to an indefinite hospital order. Elsewhere, a top scientist has claimed the BBC ‘misrepresented’ the risk posed by Covid.\nProsecutors railroaded us into accepting Nottingham killer’s manslaughter plea, say victim’s family\nThe family of one of Valdo Calocane’s victims say they were “railroaded” by prosecutors into accepting the triple killer’s manslaughter plea, after he was sentenced to an indefinite hospital order. The families’ full statements can be read here.\nCalocane, a paranoid schizophrenic, was sentenced after pleading guilty to manslaughter on the basis of diminished responsibility.\nConstance Marten had four children taken into care before going on run with baby, court hears\nConstance Marten had four children taken away from her before going on the run with her fifth baby who died, a court has heard.\nShe and her partner, Mark Gordon, camped out in freezing conditions depriving the child of the warmth, shelter, food and safety she needed, meaning she “never stood a chance”, a jury was told.\nBBC ‘misrepresented’ Covid risk to boost lockdown support, says top scientist\nThe BBC was allowed to “misrepresent” the risk posed by Covid to most people to boost public support for lockdown, the UK Covid Inquiry has heard.\nProf Mark Woolhouse, an eminent epidemiologist and government adviser, lambasted the corporation for having “repeatedly reported rare deaths or illnesses among healthy adults as if they were the norm”.\nEvening Briefing: Today’s essential headlines\nPost Office scandal | A former prosecutor said that the decision to prosecute sub-postmasters was based solely on information provided by Post Office investigators.\nRwanda policy | European judge claims plan is unlawful\nCovid Inquiry | Sturgeon branded Johnson a ‘f---ing clown’ in deleted WhatsApps\nRussia-Ukraine war | Britain in plans to send more Storm Shadows to Ukraine\nScience | Emperor penguin colonies discovered in Antarctica after poo stains spotted from space\nRoyals | Duchess of York seen for first time after cancer diagnosis\nWatch: Thai woman takes lion for joyride in open-top Bentley\nThe stunt could prove costly for the owner in Pattaya, where permission is needed to take wild animals to public locations.\nComment and analysis\nTom Harris | The Tories’ problem is the party itself, not Sunak\nJemima Lewis | Letter-writing may be poised to enjoy an unlikely revival\nEric Kaufmann | Trudeau’s mass migration cult is destroying Canada\nJudith Woods | Claudia Schiffer’s cat was a pitiful captive on the red carpet – that face says it all\nYour View | ‘Owning a Range Rover has become a bit tacky’\nWorld news: Israeli commandos waging guerilla campaign in Khan Younis\nIsraeli soldiers are waging a guerilla campaign to take control of Gaza’s second-largest city, according to the Israel Defense Forces (IDF).\nCommandos are reportedly pushing back Palestinian saboteurs with tank and rocket fire from the “heart” of Khan Younis as they tighten their grip on the besieged southern settlement.\nFOLLOW LATEST\nFeature of the day\n‘I’ve been to all 50 US states – and I wish I hadn’t bothered’\nWith extortionate prices, unreliable transport and an ever-present gun problem, James Wong claims that the USA is a poor substitute for travel elsewhere.\nREAD MORE\nBusiness news: UAE’s Vodafone swoop triggers national security intervention\nThe United Arab Emirates’ partnership with Vodafone has sparked national security concerns after ministers warned the Gulf state could “materially influence” the British telecoms business.\nLive markets news: Lloyds Bank to axe 1,600 jobs across branches\nEditor’s choice\nAll of Us Strangers | Andrew Scott and Paul Mescal’s chemistry is off the charts\nBryony Gordon | ‘When I ran out of food from the cupboard, I started thinking about the food in the bin…’\nBehind the music | Inside the documentary that turned Metallica into mental health trailblazers\nSport briefing: Today’s essential headlines\nCarney Chukwuemeka | ‘I do not regret leaving Aston Villa’\nCricket | England fans struggle to access water during first Test in India\nThom Gibbs | ‘Kane can take comfort from Sheringham if trophy curse continues’\nUEFA | Guardiola hits back at Ceferin for Man City ‘guilty’ claims\nWomen’s Football | Spanish High Court proposes Luis Rubiales stand trial over Jenni Hermoso kiss\nThree things for you\nBeauty | How to make your skin look great without make-up\nHealth | The surprising ways to deal with chronic pain\nFashion | ‘I designed Kate Moss’s 50th birthday dress – it could be any woman’s forever frock’", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Thursday evening news briefing: 'Justice not served' say victim's family as Nottingham killer sentenced", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/news/2024/01/25/thursday-evening-news-briefing-justice-not-served-say-victi/"}