{"authors": [], "date_download": "2024-02-05 15:32:45", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The DPRK says it placed its first military reconnaissance satellite into orbit last week\r\n\r\n\r\nNorth Korea claims it has obtained photos of the", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274047746%2Fnorth-korean-spy-satellite-captures-white-house-pyongyang.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1701166437.jpg", "language": "en", "localpath": null, "maintext": "The DPRK says it placed its first military reconnaissance satellite into orbit last week\nNorth Korea claims it has obtained photos of the White House and a variety of sensitive US military sites thanks to its new spy satellite, which it previously said would be used to monitor American and South Korean forces.\nIn comments carried by the state-run Korean Central Media Agency (KCNA) on Tuesday, Pyongyang said the country's leader, Kim Jong-un, had reviewed satellite imagery of US military and government facilities in \"major target regions,\" including the Pentagon and even the White House itself.\n\"Respected Comrade Kim Jong-un expressed great satisfaction with the successful progress of the operational preparation project for the reconnaissance satellite 'Manrikyeong-1,' which is about to begin its official mission,\" the outlet reported. It added that the satellite had also photographed the Andersen US Air Force Base on the Pacific island of Guam, two naval installations, and an airfield in Virginia, as well as areas of Italy's capital, Rome.\nKCNA also reported that \"four US Navy nuclear aircraft carriers and one British aircraft carrier were captured\" in the images taken over Virginia.\nSouth Korean officials said they were unable to verify the claims, and that Pyongyang had not released the photos in question.\nAn unnamed US National Security Council spokesperson also told Bloomberg that the existence of such satellite images could not be confirmed, but went on to condemn the launch of the North Korean spy craft last week, saying it violated UN Security Council resolutions against the DPRK's ballistic missile program.\nPyongyang announced the satellite launch last week, with Kim declaring that it marked a \"new era of space power\" for his country and a \"full-fledged exercise of the right of self-defense.\" The North Korean government said it had already inspected photos of US military sites and areas of South Korea's capital just one day later. The successful launch reportedly took place after two failed attempts in May and August.\nWashington has repeatedly slammed North Korea's burgeoning satellite program, while Seoul responded to the launch by partially suspending a 2018 military de-escalation agreement with the North, resuming surveillance flights near the border between the two Koreas. North Korea's Defense Ministry later said it had terminated the deal altogether, and warned South Korea would \"pay dearly\" for its \"reckless\" decision to breach the agreement.\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "North Korean spy satellite 'captures' White House Pyongyang", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274047746/north-korean-spy-satellite-captures-white-house-pyongyang"}