{"authors": ["Katie Daly", "Lifestyle Writer"], "date_download": "2024-02-05 15:32:46", "date_modify": "None", "date_publish": "2023-11-30 16:12:36", "description": "The Queen of Spain has attended the opening of parliament with her lookalike daughter Princess Leonor and husband King Felipe", "filename": "https%3A%2F%2Fwww.hellomagazine.com%2Froyalty%2F508646%2Fqueen-letizia-opening-spanish-parliament-lookalike-daughter%2F.json", "image_url": "https://images.hellomagazine.com/horizon/landscape/1ddb061516e4-leonor-letizia.jpg?tx=c_fill%2Cw_1200", "language": "en", "localpath": null, "maintext": "The Queen of Spain attended the opening of the Parliament in Madrid just yesterday with her daughter Princess Leonor and husband King Felipe VI.\nThe Spanish royal, 51, stepped out with her lookalike daughter as her husband declared the 14th Spanish Legislature inaugurated, with a coalition government headed up by President Pedro Sánchez.\nWATCH: Queen Letizia and King Felipe bid farewell to Princess Leonor as she starts military training\n© Getty The solemn opening of the 15th legislature at the Spanish Parliament\nThe Queen looked on as her husband gave a speech in the Congress of Deputies. Letizia arrived at the Solemn Opening Session of the XV Legislature of the Cortes Generales looking stunning in a dark crimson fit and flare long-sleeve dress by Carolina Herrera, a faux fur-trimmed cape by the same brand, and a PinkChic GuaGua heels in burgundy.\nThe 18-year-old Princess of Asturias looked the spitting image of her mother in a tasteful bottle green dress in a similar fit but with shorter sleeves. She wore a camel-coloured coat over the top and a matching leather handbag and heels.\n© Getty Princess Leonor is the heir to the Spanish throne\nThe royals were welcomed by the president and the Chief of the Defense Staff, Teodoro Esteban López Calderón. On the Carrera de San Jerónim, the royal couple reviewed the military troops and received greetings from the president of the Congress of Deputies, Francina Armengol, the president of the Senate, Pedro Rollán, and from the members of the Tables of the Lower House on the steps of the Palacio de la Carrera de San Jerónimo.\nThe military tribute to the royals was undertaken by The Honors Battalion, a Music Unit, and four companies from the Army, Air Force, Navy, and Civil Guard.\n© Getty King Felipe gave a speech\nIn his speech to the assembly, King Felipe said: \"The Spanish people have placed in their honours the most precious political asset: trust. They have entrusted them with the task of ensuring that the political pluralism represented here promotes the improvement of the living conditions of the people and groups in which it is integrated.\n\"The performance of the powers attributed to the Chambers constitutes a high honor for all your honors. An honor that also entails the obligation to perform the entrusted constitutional functions, always seeking the common good of all Spaniards,\" the royal continued.\n© Getty The King opened the fifteenth legislature of Spain\n\"This is, unequivocally, the return due to the trust granted by the citizens \"after which the XV Constitutional Legislature was declared open while the president of the Congress of Deputies adjourned the session.\"\nAfter the assembly, the King, Queen, and Princess moved to the Conference Hall where they greeted the authorities moved to the Conference Hall where they greeted the authorities and later witnessed a a military parade of the Group of the Armed Forces and the Civil Guard.\n© Getty King Felipe and Queen Letizia visit the Community Residence Hospital del Rey\nQueen Letizia has also been spotted out today visiting the Community Residence \"Hospital Del Rey\" in Toledo alongside her husband. She was seen with the Minister of Housing and Urban Agenda Isabel Rodriguez and, as always, looked beautiful in a Uterqüe houndstooth blazer, cigarette trousers, and cap-toe kitten heels.\nDISCOVER: Queen Letizia and King Felipe bid farewell to Princess Leonor as she starts military training", "source_domain": "www.hellomagazine.com", "text": null, "title": "Queen Letizia steps out for special occasion with lookalike daughter Princess Leonor", "title_page": null, "title_rss": null, "url": "https://www.hellomagazine.com/royalty/508646/queen-letizia-opening-spanish-parliament-lookalike-daughter/"}