{"authors": ["Germania Rodriguez Poleo", "Germania Rodriguez Poleo For Dailymail.Com"], "date_download": "2024-02-05 15:32:47", "date_modify": "None", "date_publish": "2023-11-30 17:11:58", "description": "Erik Charles Maund, 46, paid two ex-Marines and a dormer Israel Defense Forces soldier $750,000 to kidnap and kill Holly Williams, 33, and her partner William Lanway.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12810661%2FErik-maund-murder-holly-williams.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/30/17/51745757-0-image-m-215_1701364870446.jpg", "language": "en", "localpath": null, "maintext": "A married Texas car dealership heir has been found guilty of plotting to kill a sex worker and her boyfriend after they tried to blackmail him.\nErik Charles Maund, 48, paid two ex-Marines and an ex-Israel Defense Forces soldier $750,000 to kill Holly Williams, 33, and her partner William Lanway, 36, in 2020.\nWilliams and Lanway were both found shot several times in in his crashed Acura, which had veered off a road, down an embankment and into a tree in a Nashville construction site.\nMaund was arrested over a year after the murders, along with Austin residents Gilad Peled, 47, and Byron Brockway, 46, and North Carolina resident Adam Carey, 30 - all former military men who worked with private security companies.\nProsecutors said Maund, the grandson of an automotive tycoon, plotted to kill the couple after he began receiving texts demanding $25,000 to conceal the extramarital encounters he had with Nashville-based Williams.\nErik Charles Maund, 46, paid two ex-Marines and a former Israel Defense Forces soldier $750,000 to kidnap and kill Holly Williams, 33, and her partner William Lanway, 36, in 2020\nHolly Williams (right), 33, and William Lanway, 36 (left), were found dead in Lanway's crashed Acura sedan on March 12, 2020\nLanway's 2005 white Acura sedan (pictured) had veered off a construction road, down an embankment and into a tree, and its occupants were both fatally shot several times\nThe father-of-two began an investigation after receiving the threatening texts that resulted in the couple's murder just 11 days later.\nMaund was found guilty of the murders after an 11-day trial earlier this month, in which former Marines Brockway and Carey were also convicted. They each face life in prison and will be sentenced next year separately.\nFormer IDF member Peled, on his part, pleaded guilty before the trial and was the star witness against the other defendants.\nMaund had an encounter with Williams after texting her in February 2020 saying he was traveling to Nashville. The two had previously hooked up about a year earlier.\nPeled claimed in court that Maund told his wife he was traveling to the city to visit their son in college, per transcripts seen by Fox News Digital.\n'He told me that he went to visit his son, and while he was there, he was using escort services,' Peled testified, adding that Maund said he would be 'devastated' if his family discovered his extramarital escapades.\nThe 'hitmen': Former marines Byron Brockway (left), and Adam Carey of North Carolina (right), were found guilty of murdering the couple in the murder-for-hire plot\nFormer IDF member Gilad Peled Peled pleaded guilty before the trial and was the star witness against the other defendants\nOn March 1, William's boyfriend Lanway began sending a series of texts demanding money in exchange for keeping quiet about Maund's use of escort services.\nThe next day Maund contacted Peled and offered to pay him $60,000 to conduct an investigation into the sender of the texts.\nMaund then enlisted family friend Brockway, who recruited Carey.\nThe two ex-marines and the former IDF fighter then traveled to Nashville to follow Williams and Lanway, but did not manage to make contact with them for 10 days.\nMeanwhile the March 11, 2020, as the deadline for payment set by Lanway was approached, Mound panicked, prompting Brockway to go back to Nashville to 'solve the problem by taking Lanway out,' per Peled's testimony.\nWilliam's boyfriend Lanway tried extorting Maund after he had an encounter with the escort in 2020. Williams and Lanway are pictured together\nMaund took up the offer and agreed to pay $100,000 each to Brockway and Carey. The heir also gave $550,000 to Peled, per prosecutors.\nBrockway then shot Lanway in the parking lot of William's apartment building, and Carey killed Williams after driving to the construction site where the bodies were found.\nAssistant U.S. Attorney Rob McGuire said after the verdict: 'It's not going to bring Holly and William back, but they now know that the people who murdered them are going to be held accountable for what they've done.'\nThe Maund automotive group, which operates its flagship location out of 6900 Burnett Road in Austin, is prominent in the Central Texas area.\nIn 1945, Maund's grandfather opened a used car lot in Port Arthur at the age of 18, and eventually acquired four more lots. Over time, he bought out four car dealerships in the area, according to the company's website.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Married Texas car dealership heir, Erik Charles Maund, 48, is found guilty of paying two ex-US Marines and former IDF fighter $750k to kill sex worker, 33, and boyfriend after they tried to blackmail", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12810661/Erik-maund-murder-holly-williams.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}