{"authors": ["Harriet Alexander", "Harriet Alexander For Dailymail.Com"], "date_download": "2024-02-05 15:32:48", "date_modify": "None", "date_publish": "2023-11-30 06:44:41", "description": "The Rockefeller Christmas tree was lit on Wednesday evening in a spectacular ceremony. One block away, pro-Palestine protesters clashed with police who blocked their path.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12808263%2Frockefeller-christmas-tree-palestine-rally-swastika.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/30/06/78407457-0-image-m-30_1701325397050.jpg", "language": "en", "localpath": null, "maintext": "Thousands of New Yorkers braved the chill on Wednesday night to watch the Rockefeller Center's Christmas tree being lit - as protesters a block from the event loudly chanted for an end to the Israel-Hamas war.\nUgly scenes unfolded as pro-Palestine protesters - some holding swastika placards - attempted to get past metal barricades separating the demonstrators from those there to celebrate. Several people were arrested.\n'We allow people to exercise their first amendment, but by no means do we allow anyone to come out here to do hate, crime or assault,' said NYPD Chief of Patrol John Chell.\nThe tree lighting passed without serious disruption, and hours later it was announced that the Israel-Hamas truce, begun on Friday and initially expected to last four days, had been further extended.\nThe hope is that more of the hostages will be freed during the lull in fighting, and more aid allowed to enter the stricken Gaza Strip.\nThousands gathered on Wednesday night for the lighting of the Rockefeller Christmas tree\nPolice are seen pushing back pro-Palestine protesters on Wednesday night who tried to disrupt the lighting of the Rockefeller Christmas tree\nProtesters waving swastikas are seen on Wednesday night, accusing Israel of behaving like Nazis\nProtesters waved offensive placards on Wednesday, including one likening Israel's actions to those of Hitler\nAround 500 people attended the pro-Palestine rally in New York City on Wednesday night\nChants of 'From the river to the sea, Palestine will be free' rang out - a call many Israelis find deeply offensive, arguing it advocates the erasure of their country.\nMany held up expletive-filled signs condemning Israel, which is currently embroiled in a war with Hamas, sparked by the terror group's October 7 terror attack. The attack killed 1,200 Israelis; in response, Israel bombed Gaza, killing 15,000 so far.\nOne protester on Wednesday night held a sign reading: 'Stop doing what Hitler did to you', with the slogan: 'Zionism is terrorism'.\nThe rally began outside the News Corp building, one block from the tree, with around 500 people, ABC News reported.\nThe group unfurled a large Palestinian flag and briefly tried to push north towards the tree, but were met by a line of NYPD officers and barricades.\nAs the group turned back, there were scuffles and a handful of arrests, ABC said.\nProtesters are seen on Wednesday night confronting NYPD officers\nActivists demanding a ceasefire in Gaza are seen on Wednesday night in front of St Patrick's cathedral, by the Rockefeller Center\nProtesters yell slogans on Wednesday night as the Rockefeller tree was being lit\nPro-Palestine protesters demand an end to the Israel-Hamas war on Wednesday\nThe pro-Palestine demonstration on Wednesday night drew around 500 people\nThe Rockefeller tree is pictured on Wednesday night in all its glory\nEric Adams, the mayor of New York, is seen at the lighting along with Jerry Speyer (third left), whose company controls the Rockefeller Center; Kelly Clarkson (fourth left); and TV presenter Craig Melvin (right)\nClarkson first performed for the tree lighting ceremony 20 years ago, when she had just won American Idol\nClarkson is seen performing to the crowds on Wednesday evening\nBarry Manilow, 80, also performed at the Rockefeller Center Christmas tree lighting ceremony on Wednesday\nManilow is seen with his band, performing during the television broadcast before the lighting\nManilow is seen before the tree is lit on Wednesday night\nOne block away, the Christmas season was being officially launched in Manhattan.\nKelly Clarkson sang, festively-dressed in a white coat with a featured a faux fur collar and cuffs.\nThe 41-year-old Texan first performed on Christmas in Rockefeller Center in 2003, one year after she became the first winner of American Idol.\nEric Adams, the mayor of New York, took part in the lighting, before a cheering throng and a chorus sang 'Joy to the World.'\nThe ceremony also featured appearances by Cher, Barry Manilow and the Rockettes.\nStarting in the 1930s, the Christmas tree tradition has drawn thousands of visitors to the city each year during the holiday season.\nThe tree will remain lit from 5am to midnight every day until January 13.\nOn Christmas day, it will be lit for 24 hours.\nThis year's tree came from Vestal, New York, and stands 80 feet tall and weighs about 12 tons.\nThe tree has been decorated with 50,000 LED lights and a Swarovski star.\nAnd its lighting was followed by good news from the Middle East.\nWith just minutes to go before a six-day ceasefire was set to expire, Israel and Hamas reached a deal to continue the pause in an effort to free the remaining hostages.\nIsraeli Prime Minister Benjamin Netanyahu's office said in a statement that 'a short time ago, Israel was given a list of women and children in accordance with the terms of the agreement, and therefore the truce will continue.'\nThe announcement followed a last-minute standoff earlier Thursday, with Hamas saying Israel had rejected a proposed list that included seven living captives and the remains of three who the group said were killed in previous Israeli airstrikes.\nThe extension was originally announced in a post on X from the Israeli Defense Forces.\n'In light of the mediators' efforts to continue the process of releasing the abductees and subject to the terms of the agreement, the ceasefire will continue,' they wrote in Hebrew.\nThe Qatari Foreign Ministry said the truce was being extended under the same terms as in the past, under which Hamas has released 10 Israeli hostages per day in exchange for 30 Palestinian prisoners.\nWith just minutes to go before a six-day ceasefire was set to expire, Israel and Hamas have reached a deal to continue the pause in an effort to free the remaining hostages\nThe expectation had been to extend the pause in fighting for at least another day or two, with the focus on releasing women and children.\nThe talks appear to be growing tougher as most of the women and children held by Hamas are freed, as the militants are expected to seek greater releases in return for freeing men and soldiers.\nInternational mediators had been working to extend the truce in Gaza, encouraging Hamas terrorists to keep freeing hostages in exchange for the release of Palestinian prisoners and further relief from Israel's air and ground offensive.\nNinety-seven hostages have been freed since the start of the truce, according to a Reuters tally. The Israeli military says 145 hostages remain in Gaza.\nOn Wednesday night, the Israeli military said Hamas handed over twelve Israeli and four Thai hostages on the sixth day of the temporary ceasefire.\nThe truce, extended from its initial four days, has brought the first respite in the bombardment of Gaza with much of the coastal territory of 2.3 million having been reduced to wasteland in response to a deadly rampage by Hamas militants into southern Israel on October 7.\nHamas, which freed 16 hostages in exchange for 30 Palestinian prisoners on Wednesday, said in a statement that the truce would continue for a seventh day.\nThe militant group earlier said Israel had refused to receive a further seven women and children and the bodies of three other hostages in exchange for extending the truce.\nNetanyahu underscored on Wednesday that Israel will resume its campaign to eliminate Hamas, which has ruled Gaza for 16 years and orchestrated the deadly attack on Israel that triggered the war\nHamas' military wing Izz ad-Din al-Qassam Brigades are present as the prisoner swap between Israel and Hamas\nA helicopter carrying Israeli hostages released by Hamas arrives in Petah Tikva\nMilitary personnel talk with each other as a helicopter carrying hostages released amid a hostages-prisoners swap deal\nInternational pressure has mounted for the ceasefire to continue as long as possible after nearly eight weeks of Israeli bombardment and a ground campaign in Gaza that has killed thousands of Palestinians, uprooted three quarters of the population of 2.3 million and led to a humanitarian crisis.\nIsrael has welcomed the release of dozens of hostages in recent days and says it will maintain the truce if Hamas keeps freeing captives. Both sides had said they were ready to resume fighting.\nNetanyahu underscored on Wednesday that Israel will resume its campaign to eliminate Hamas, which has ruled Gaza for 16 years and orchestrated the deadly attack on Israel that triggered the war.\n'After this phase of returning our abductees is exhausted, will Israel return to fighting? So my answer is an unequivocal yes,' he said.\n'There is no way we are not going back to fighting until the end.'\nHe spoke ahead of a visit to the region by U.S. Secretary of State Antony Blinken to press for further extensions of the truce and hostage releases.\nBlinken arrived in Israel late on Wednesday.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Spectacular moment Rockefeller Christmas tree glistens in New York City as lighting is attended by thousands - after pro-Palestinian mob brandishing a swastika tried to wreck the ceremony", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12808263/rockefeller-christmas-tree-palestine-rally-swastika.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}