{"authors": ["Emma Graham-Harrison"], "date_download": "2024-02-05 15:32:49", "date_modify": "None", "date_publish": "2023-11-30 08:40:11", "description": "Anthony Hurndall, whose son was shot by the IDF in 2003, has called on governments to challenge Israeli claims about deaths of women and children", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F30%2Fwest-encourages-killing-of-civilians-in-gaza-says-father-of-activist.json", "image_url": "https://i.guim.co.uk/img/media/2397c3ae47fa5d3edda0d5c25816b8f44c542614/309_38_1379_827/master/1379.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7475ddf1f1e01440189c76f89191b2bb", "language": "en", "localpath": null, "maintext": "Western governments are “actively encourag[ing] the killing of women and children” in Gaza, because they are not willing to challenge Israeli accounts of the war there, the father of a British peace activist killed by an Israeli Defense Forces (IDF) sniper has warned.\nAnthony Hurndall’s son, Tom Hurndall, was shot in the head in April 2003 in Rafah, while he was helping Palestinian children.\nAnthony Hurndall left his job as a City lawyer to work on an investigation into the shooting and embarked on an international campaign for justice after Israeli authorities initially declined to open an inquiry into the case.\nHe described himself as “a longstanding supporter of the state of Israel”, but said his work nearly two decades ago exposed a culture of impunity and cover-ups over civilian deaths that he fears is being replicated in attacks on Gaza today.\n“The IDF … routinely falsely misrepresent civilians and children as militants, or as armed, and fabricate accounts of events, as a pretext for their killing,” he wrote in a statement about the war.\n“These claims appear similar to the claims the IDF are currently making to justify their bombing, missile and other attacks on civilian targets and hospitals in Gaza.”\nHis meticulous dossier was critical to creating international pressure that led to the arrest and trial of the sniper, who was sentenced to eight years for manslaughter. Hurndall said that Palestinians in Gaza do not have the resources to investigate the death of civilian relatives in the same way.\n“Only when confronted with irrefutable evidence, and subjected to the unrelenting pressure of the UK government and press, did [the Israeli military] concede and accept responsibility. Unfortunately, Palestinian civilians do not have the resources or support to protect themselves in this way,” he wrote.\nHe called on both the UK government and opposition to interrogate Israeli claims about civilian deaths in Gaza more rigorously.\n“Western governments and media appear overly willing to accept Israeli accounts and narratives and repeat them,” he wrote. “In doing so they actively encourage the killing of women and children, and are, in my view, themselves complicit in, or at least condoning, the deliberate killing of civilians and war crimes.\n“The situation has deteriorated since the time we were involved, as Israeli policy becomes more extreme. I believe the government and opposition in this country should carefully consider their positions over present events and over the situation in Israel and the occupied territories.”\nHe said he was “a longstanding supporter of the state of Israel” and was reluctant to speak out, and did so only because asked, and in the hope that it would contribute to understanding and resolution.\n“I wish Israel a happy, secure and prosperous future, but it needs to abandon policies which destroy the very prospects of such a future,” he added.\nThe IDF has been contacted for comment.", "source_domain": "www.theguardian.com", "text": null, "title": "West ‘encourages’ killing of civilians in Gaza, says father of activist shot dead by IDF", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/30/west-encourages-killing-of-civilians-in-gaza-says-father-of-activist"}