{"authors": ["Monica Charsley", "Mizy Judah Clifton", "Image", "Anadolu Via Getty Images"], "date_download": "2024-02-05 15:32:53", "date_modify": "None", "date_publish": "2023-11-30 11:03:53", "description": "WARNING GRAPHIC CONTENT: Euro-Mediterranean Human Rights Monitor is calling for an investigation as a video appeared to show the bodies of infants after staff were forced to evacuate Al-Nasr Hospital", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fharrowing-footage-gaza-city-hospital-31563274.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31563268.ece/ALTERNATES/s1200/0_Destruction-at-Al-Shati-refugee-camp-after-Israeli-attacks.jpg", "language": "en", "localpath": null, "maintext": "WARNING GRAPHIC CONTENT: Euro-Mediterranean Human Rights Monitor is calling for an investigation as a video appeared to show the bodies of infants after staff were forced to evacuate Al-Nasr Hospital\nHarrowing footage appears to show decomposing bodies of premature babies left to die in their beds in Gaza City Hospital.\nOrganisation, Euro-Mediterranean Human Rights Monitor, are calling for international bodies to investigate after the Israel Defense Forces forced staff at the Al-Nasr Hospital to evacuate.\nThe Switzerland-based group stated it managed to \"confirm that it documented the discovery of five infants dead and in a state of decomposition\" in a neonatal ward.\nThe human rights monitor, which is led by ex- UN rapporteur Richard Falk, reported that the infants were abandoned three weeks ago after the IDF launched an attack on the hospital.\nImage: Anadolu via Getty Images) Anadolu via Getty Images)\nA disturbing video, which was initially shared by the Arabic-language news channel Al Mashha, filmed five beds which allegedly had the lifeless bodies of the babies, reports Daily Mail. The footage was heavily blurred. In the clip, the room featured hospital equipment which seemed to be out of service. The Mirror has been unable to independently verify the video.\nIt has been reported that a spokesperson for the Hamas-run Gaza Health Ministry supported the allegations and described the babies as \"premature.\" They further claimed that Israeli soldiers had obstructed access to the ward where the children were located on Tuesday. The director of the hospital had told CNN that he pled for help to international organisations, however, Euro-Med shared that he didn't get an answer.\nDirector, Dr. Mustafa Al-Kahlot, said the IDF had attacked the hospital twice which reportedly caused the death of a child because of oxygen deprivation. \"One attack targeted the hospital's gate and the other was directed at the departments in the hospital,\" he said. \"No one could reach the hospital and ambulances on the road were also targeted.\" He further explained how the hospital was \"completely surrounded\" and said tanks were placed outside of the hospital. “We do not have electricity, no oxygen for the patients, we do not have medicine and water,” al-Kahlout previously said. “We do not know our fate.”\nA spokesperson for the IDF denied the allegations and said: \"Given that the IDF did not operate inside the Al-Nasr hospital, these allegations are not only false but also a perverse exploitation of innocent lives, used as tools to spread dangerous misinformation. This is more evident when taking into account that the IDF assisted in moving newborns from the pediatric ward of the Shifa hospital to safety, as well as provide Israeli incubators in the process\"", "source_domain": "www.mirror.co.uk", "text": null, "title": "Harrowing footage in Gaza City hospital 'shows decomposing bodies of babies left to die'", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/harrowing-footage-gaza-city-hospital-31563274"}