{"authors": ["Tom Stevenson"], "date_download": "2024-02-05 15:32:55", "date_modify": "None", "date_publish": "2023-11-30 12:00:49", "description": "The long read: For more than a decade, people have been saying that the era of US dominance is coming to an end. But in reality there are still no other global players to rival it", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fus-news%2F2023%2Fnov%2F30%2Famericas-undying-empire-why-the-decline-of-us-power-has-been-greatly-exaggerated.json", "image_url": "https://i.guim.co.uk/img/media/5847f54cb249903464bfa20a6289ee61cb999f59/0_85_4717_2830/master/4717.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5f1f88ccdcaffe374a667cc493f2a90", "language": "en", "localpath": null, "maintext": "In recent years, the idea that the United States is an empire in decline has gained considerable support, some of it from quarters that until very recently would have denied it was ever an empire at all. The New York Times, for instance, has run columns that describe a “remarkably benign” American empire that is “in retreat”, or even at risk of decline and fall.\nYet the shadow American power still casts over the rest of the world is unmistakable. The US has military superiority over all other countries, control of the world’s oceans via critical sea lanes, garrisons on every continent, a network of alliances that covers much of the industrial world, the ability to render individuals to secret prisons in countries from Cuba to Thailand, preponderant influence over the global financial system, about 30% of the world’s wealth and a continental economy not dependent on international trade.\nTo call this an empire is, if anything, to understate its range. Within the American security establishment, what it amounted to was never in doubt. US power was to be exercised around the world using the “conduits of national power”: economic centrality, military scale, sole possession of a global navy, nuclear superiority and global surveillance architecture that makes use of the dominant American share of the Earth’s orbital infrastructure.\nIf proponents of the end of the US global order do not assert a decrease in the potency of the instruments of American power, that is because there has been no such decrease. The share of global transactions conducted in dollars has been increasing, not declining. No other state can affect political outcomes in other countries the way the US still does. The reach of the contemporary US is so great that it tends to blend into the background of daily events. In January 2019, the US demanded that Germany ban the Iranian airline Mahan Air from landing on its territory. In September 2020, it sanctioned the chief prosecutor of the international criminal court for refusing to drop investigations into American citizens. In February 2022, at US request, Japan agreed to redirect liquefied fossil gas, which is critical to Japanese industry, to Europe in the event of a conflict with Russia over Ukraine. At the height of that conflict, the secretary of state, Antony Blinken, found the time to visit Algiers to negotiate the reopening of a gas pipeline to Spain via Morocco. These were all quotidian events, unremarkable daily instances of humdrum imperial activity. The practical operation of the empire remains poorly understood, not despite its ubiquity, but because of it.\nFrom this perspective, the menial adherence of Britain to the US global project is at least intelligible. Historically, American planners divided their approach to the rest of the world by region. In western Europe and Japan, American interests were usually pursued by cautious political management. In Latin America and the Middle East, constant interventions, coups and invasions were needed. In east Asia and south-east Asia there was military exertion at scale. As long as it lasted, the Soviet Union was cordoned off and contained, against the wishes of the generals in the US Strategic Air Command, who would have preferred to destroy it in a nuclear holocaust. The major US allies were on the right side of this calculus and had less reason to begrudge it.\nWhen dealing with the US, elites in countries on the periphery of the global economy still often behave as though they are dealing with the imperial centre. The US permits a variety of political systems in its subordinates. US client states include medieval monarchies in the Arab Gulf, military juntas like Abdel Fatah al-Sisi’s Egypt, personal presidential autocracies in the Philippines and Thailand, apartheid parliamentary systems like Israel and reasonably democratic systems with greater social equity and conditions than the US itself. What is required is not democracy, but reasonably close allegiance to American foreign policy goals.\nIn Britain’s case, accordance with US foreign policy has been so consistent, over time and between political factions, that one must wonder whether Britain retains an independent foreign policy at all. The stance of Boris Johnson’s government – “stay close to the Americans” – continued uninterrupted through the collapse of the Truss government and the troubled ascent of Rishi Sunak. In Ukraine, the vision was straightforwardly that of Britain as airbase, provider of troops to the Baltic frontier, and advanced anti-tank weapons when needed. As prime minister, Sunak may have discovered the promises made by his two forebears to increase military spending to 2.5% or 3% of GDP were beyond the capacity of the Treasury, but the decision to back away from those pledges was based on finances, not a different political programme. British leaders may talk of a shifting world system, but the subordinate style in British foreign policy persists.\nView image in fullscreen The German chancellor Angela Merkel meets US president Donald Trump during the G7 summit in 2018. Also pictured (l-r) Larry Kudlow, Theresa May, Emmanuel Macron, Yasutoshi Nishimura, Shinzo Abe, Kazuyuki Yamazaki and John Bolton. Photograph: Getty Images\nTo its credit, the contemporary US foreign policy establishment has shown some candour about its world-ordering ambitions. Much of the discussion takes place in public between a nexus of thinktank and academic institutions, such as the Council on Foreign Relations (CFR), the Kennedy School at Harvard, the Wilson Center, the Brookings Institution and the Carnegie Foundation. Respectable pillars of the establishment such as Michael Mandelbaum at Johns Hopkins University (formerly of the CFR) have talked of the US acting as “the world’s government”. By 2011, John Ikenberry – the central intellectual figure behind the idea that the US builds and upholds a “liberal international order” – was willing to entertain the idea of “imperial tendencies” in US actions deriving from its overwhelmingly powerful global position. Some discussion has begun about the kinds of imperial activity in which the US should engage. In 2014, Barry Posen, the director of the security studies programme at MIT, began to advocate for US “restraint” in the use of force in global affairs, if only for the ultimate goal of the empire’s reinvigoration. But whatever the merits of these contributions, hegemonists who seek American primacy and neo-cold warriors fixed on the likelihood of a confrontation with China have retained a plurality.\nFor more than a decade, commentators on international affairs have obsessed over the supposed transition from a unipolar order, in which the US is the sole global superpower, to a multipolar or polycentric world in which the distribution of power is less lopsided. But this is easy to overstate. International affairs scholars have long predicted a return to a balance of power among the great states, as a correction to the enormous imbalance represented by the US since the late cold war, if not since the end of the second world war. One question is why it seems to have taken so long. Stephen Brooks and William Wohlforth, two scholars at Dartmouth College, persuasively argued that the extent of American power had to be reckoned with in a different way: the US had attained power preponderance – a degree of global power so great that its very extent served to disincentivise other states from challenging it.\nTo many observers, the election of Donald Trump in 2016 was another omen of American decline. Most of the US national security establishment did not welcome Trump’s rise, and four years later would cheer his departure. In parts of the Holy Roman empire, a new prince was obliged not just to attend the funeral of his predecessor but to bury the body. After Joe Biden’s victory in 2020, many Trump opponents appeared to desire the finality of interment.\nIt was clear why Biden’s victory was seen as a form of deliverance by many in the US. But a similar view was not uncommon among the elites in the core American allies. When the election results came through, the Frankfurter Allgemeine Zeitung carried the news under the headline “Demonstrativ Staatsmännisch” (Demonstratively Statesmanly), reflecting a belief that a Biden victory represents a return to dignity and rectitude. In the Washington Post, one columnist wrote that Biden held the promise of salvation from the Trump days: “A return to a bipartisan, internationalist foreign policy that moderate Republicans and Democrats have long championed.” For the New York Times, the moment would be accompanied by “sighs of relief overseas”. In Britain there was more ambiguity: Rishi Sunak’s future adviser James Forsyth wrote that the end of Trump was a “mixed blessing”: Biden would “take the drama out of Anglo-American relations” but might punish Britain over Brexit.\nView image in fullscreen US soldiers line up during the visit of Nato secretary general Jens Stoltenberg at the Mihail Kogălniceanu airbase, near Constanta, Romania, February 2022. Photograph: Andreea Alexandru/AP\nThe Trump administration’s foreign policy was more orthodox than is generally admitted. While derided as an isolationist by the US bureaucracy, for whom the term is a stock insult, Trump was committed to the US’s “unquestioned military dominance”. Many of his appointees were old regime hands: his trade representative, Robert Lighthizer, was a Reagan-era official; the director of the CIA, Gina Haspel, ran a torture site under George W Bush; Trump’s fifth secretary of defence, Mark Esper, was formerly an adviser to Barack Obama’s defence secretary Chuck Hagel.\nHaving pledged to “get out of foreign wars”, Trump did nothing of the sort. He pursued the global assassination programme established under Obama and prosecuted the US-backed war in Yemen. Trump did not get along with the diplomats at the state department, but his administration did very little that was out of the usual line of business.\nTrump was disdainful of international cooperation on terms other than those of the US, but this was nothing new, and disputes with the foreign policy intelligentsia were for the most part matters of style, not principle. In Latin America, Trump made clear through his adminstration’s “western hemisphere strategic framework” that the western hemisphere is “our neighbourhood”. In the Middle East, Trump overturned the minor accommodation the Obama administration had reached with Tehran and in doing so reverted to the traditional American strategy of strangling Iran while prevailing on the Gulf monarchies to recognise Israel. Trump criticised the costs of the US military’s presence in the Middle East, but US troop levels in the region increased during his time in office, as did military spending overall. His eccentricities were those of the modern Republican party, a reflection of the polity’s rightwing shift rather than of a barbarian anomaly. Dismantling American hegemony would have been a historic act, but Trump never considered it.\nThe US withdrawal from Afghanistan in August 2021, which necessitated the simultaneous withdrawal of the forces of any remaining western allies, was yet another death for American empire. The clamour of the final exit partly drowned out the tawdry record of every US president in Afghanistan from Bush to Biden. That 20 years of occupation and state-building crumbled in weeks confirmed only that the Afghan government had been an artificial and corrupt dependent. Under Trump and Biden, US planners had concluded that the US could no longer afford to keep up pretences with a fragile and exposed government in Kabul.\nEnough of the US global order survived the withdrawal from Afghanistan that it could die again in February 2022 with the Russian invasion of Ukraine. Contrary to unserious predictions before its outbreak, this was no “hybrid war” or “cyberwar”, but a traditional ground operation that proved far more difficult than the Russian leadership imagined. In the event, expectations of a dash for Kyiv causing the quick capitulation of the Ukrainian government were frustrated. The US strategy of building up Ukrainian armed forces as a specific counter to Russian armoured invasion proved effective in staving off the initial assault. The US, Britain, Poland and other allies supplied key weapons and detailed intelligence, including satellite targeting, while seeking to inflict some economic damage on Russia with sanctions. That US intelligence appeared to have had a source in the Kremlin with access to the war plans – the US told Ukraine that Russia would invade before it did, and then made that assessment public, and CIA director Bill Burns has said clearly that the war planning was conducted by Putin and a small number of advisers – also ran counter to the narrative of the empire’s demise.\nView image in fullscreen The ruins of Gaza City after Israel airstrikes earlier this month. Photograph: Reuters\nThat Ukraine, with heavy US support has, so far at least, held the line against Russia even at the extremity of eastern Ukraine reinforces the reality of current American power on global affairs. Russia’s general strategy has, since 2008, been to reassert influence in the former Soviet states around its borders. Yet between 1999 and 2009, Nato expanded into Poland, Hungary, the Czech Republic, the Baltic states, Romania, Bulgaria, Slovakia, Slovenia, Albania and Croatia. Perceiving this as a defeat, Russia had sought to bring it to a stop through machinations on its immediate borders. Yet in Georgia, the Caucasus, Crimea, Belarus and Kazakhstan, recent Russian operations were comparatively small-scale. Why a completely different and far more hubristic strategy was adopted for Ukraine remains poorly understood. Part of the story must lie in the two strategic agreements signed between the US and Ukraine between September and November 2021. Yet the US, Britain and Nato itself had studiously kept to ambiguous ground about future Ukrainian accession. Putin’s decision to invade may have been taken after the failure of diplomatic talks between the US and Russia in January 2022. In any case, the invasion itself was a terrible crime and a grave gamble. It has been mirrored in the strategy of the US and its allies, which since April 2022 has shifted from a simple frustration of the initial invasion to the grander ambition of using the war to achieve strategic attrition of Russia.\nIn the Middle East, Israel’s brutal retributive attack on Gaza, the mirror of the orgiastic violence carried out by Hamas fighters on 7 October, only reinforces this picture. Over the past two months, the influence of US global power has been plain to see. Thanks to US protection, Israel has been free to carry out what in all likelihood amount to large-scale war crimes while largely disregarding any threat from regional states that might otherwise have sought to limit its attacks on Gaza. The US has supplied Israel (probably with some help from Britain’s military base at Akrotiri in Cyprus) throughout the campaign and has moved aircraft carrier groups and nuclear armed submarines to the region to make the point abundantly clear. Britain has followed in lockstep with its more modest capabilities. The US and its allies have effectively rendered action at the UN impossible. American imperial power is all too evident in the ruins of Gaza city.\nIn large part, talk of the end of American dominance was a reaction to the global financial crisis and China’s industrial rise. For prominent western strategic planners like Elbridge Colby, one of the authors of the 2018 US National Defense Strategy, conflicts in Afghanistan, the Middle East and even Ukraine had come to be seen as distractions from the China threat, which represents the only plausible challenge to American global dominance. In its 2022 National Security Strategy, the Biden administration declared that the 2020s were to be a decisive decade. Past military adventures in the Middle East were criticised as extravagances and distractions in the era of competition with China. “We do not seek conflict or a new cold war,” the NSS said, but “we must proactively shape the international order in line with our interests and values”. In order to prevail in competition with China, the US had to enhance its industrial capacity by “investing in our people”. The present moment was said to represent “a consequential new period of American foreign policy that will demand more of the US in the Indo-Pacific than has been asked of us since the second world war.”\nWhat should be made of the fact that it is Biden, not Trump, who has overseen a major escalation of tension with Russia and an escalation in the trade war with China? At the time, the one ostensibly distinct part of the Trump programme appeared to be the trade war. Trump was seen as standing for an insular protectionist turn, but the same basic policies have been continued under Biden through export controls on advanced microchips. Still, Biden has proved to be just as uninterested in limiting capital flows from surplus countries like Germany and China into US treasuries, which arguably have negative effects on industrial workers in the US, but certainly inflate the prices of assets owned by the rich and underpin US power over the international financial system.\nThe US political system as a whole appears, at present, to be opting for China containment. President Biden said on the campaign trail that under him US strategy would be to “pressure, isolate and punish” China. Encouraged by the US, Japan, like Britain, is engaged in a major arms buildup. American politicians make showy visits to Taipei. The US has threatened China with nuclear weapons in the past on the basis that it does not have a comparable nuclear arsenal. There is some debate over whether China’s current nuclear-armed submarines are able to avoid tracking by the US. China is also working to make its intercontinental ballistic missiles more secure. It is possible that soon they will together constitute a completely reliable second-strike capability against the US. The most dangerous moment of the cold war was in the early 1960s, when an aggressive and overwhelmingly dominant nuclear power saw itself in competition with an adversary that didn’t yet have equivalent nuclear forces. The US and China may be approaching a similar point.\nView image in fullscreen President Xi Jinping and President Joe Biden during the Apec summit, California, in November. Photograph: Kevin Lamarque/Reuters\nEarlier this month, Biden and Xi Jinping met in San Francisco in an attempt to smooth over relations that had become dangerously unstable. In November 2022, when Biden met Xi at the G20 in Indonesia, both had appeared to strike a conciliatory tone. Biden said the two had “a responsibility to show that China and the US can manage our differences” and “prevent competition from becoming conflict”. But the 2022 decision to ban Chinese access to the semiconductor trade was a straightforward escalation. Trump and Biden responded to their respective moments according to a general strategy that is longer-lived than either of them. US foreign policy has been quite stable for 30 years: a mode best characterised as reactive management of the world empire, with the aim of pre-empting the emergence of any potential challengers to its primacy.\nFor all the talk of multipolar worlds, other poles of world power have been hard to find. Russia has hardly proved itself a global power in its botched invasion of Ukraine. Fantasies of European strategic autonomy have shown themselves insubstantial. India’s economic growth has been notable but it projects very little influence away from the subcontinent. The resurgent nationalisms in Turkey and Iran hardly qualify them as poles of global power, and the former still serves as a staging ground for American nuclear weapons. As the former Tsinghua professor Sun Zhe observed, developing countries are not cooperatively “rising together” to “challenge the current order” – the likes of Brazil and South Africa have, if anything, been declining in terms of economic heft. So where is the multiplicity in world politics?\nMuch of the predicted systemic change consists of the emergence of Sino-American competition. But “multipolarity” is a poor description for this development. The strategic balance so far remains hugely in favour of the US. China does not militarily threaten the US. Chinese naval power is routinely exaggerated; its navy is not predicted to rival the US Pacific fleet for another generation, and it still lacks “quiet” nuclear-powered submarines that resist sonar detection. It is not clear that China is capable of mounting an invasion even of Taiwan, and there are good reasons to think China’s leadership knows this. For its part, China has not even made a serious effort to escape the dominance of the dollar in its trade with the rest of the world. It is the US that asserts a policy of isolation and punishment of China, not vice versa. So long as the US is maintaining a “defense perimeter” in the East and South China Seas that extends to a few kilometres from mainland China, it is not dealing with a peer, it is threatening a recalcitrant.\nAssertions of the inevitability of American imperial decline over the long term are fair enough; in their most abstract form, and on a long enough timescale, they must eventually turn out to be true. And the US position does look shakier than it has for decades. But what is striking is how seldom this system that is said to be in decline is given even a cursory description, especially in the subordinate parts of the Anglosphere.\nWhy the reticence to explain the nature of American power? And why ignore that so much of contemporary US grand strategy is oriented precisely to prevent its dissolution? As the 2022 National Security Strategy said, “prophecies of American decline have repeatedly been disproven in the past”. This time the effort may be in vain. The risks of a Sino-American confrontation and the Russo-American nuclear standoff implied in the war in Ukraine are considerable. Whatever is to come, the fact remains that global power at present remains unipolar. The task for those not committed to its continuation is to understand it and, wherever possible, to challenge its assumptions.\nAdapted from Someone Else’s Empire: British Illusions and American Hegemony by Tom Stevenson, published by Verso and available at guardianbookshop.com\nThe best stories take time. The Guardian Long Read magazine compiles the finest longform journalism the Guardian has to offer: from politics to technology, food to cosmology, literature to sex, there is something for everyone. Beautifully bound, this 100-page special edition is available to order from the Guardian bookshop and is on sale at selected WH Smith Travel stores.", "source_domain": "www.theguardian.com", "text": null, "title": "America’s undying empire: why the decline of US power has been greatly exaggerated", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/us-news/2023/nov/30/americas-undying-empire-why-the-decline-of-us-power-has-been-greatly-exaggerated"}