{"authors": ["Juliana Cruz Lima", "Will Stewart"], "date_download": "2024-02-05 15:15:52", "date_modify": "None", "date_publish": "2024-01-24 16:47:21", "description": "SEVEN bombshell clues have indicated how Russia could be lying over claims that Ukraine downed a Russian military Il-76 plane.The victims are alleged", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25476050%2Fbombshell-clues-russia-lies-ukraine-plane-crash%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/newspress-collage-crajmhd09-1706114199132.jpg?1706114312&strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "SEVEN bombshell clues have indicated how Russia could be lying over claims that Ukraine downed a Russian military Il-76 plane.\nThe victims are alleged to include 65 Ukrainian PoWs who were due to be handed over today in a swap as all 74 passengers were killed on board.\n14 The moment the Il-76 military plane crashed near the Ukrainian border in Belgorod region Credit: X\n14 Smoke can be in the sky near Krivoy Khutor village\n14\nUkraine has promised to reply to the Moscow charge that it killed its own people on board the Russian plane - but only after it has examined all the evidence.\nBut OSINT sources and analysts have pointed to striking inconsistencies in the Russian claims.\nFootage at the site of the crash in Belgorod region does not so far show multiple bodies - or parts - at the scene.\nThe bloody remains of one body may be visible on a blurred image.\nFormer Ukraine advisor Anton Gerashchenko shared the clips, announcing there has been no official information.\n\"Ukrainian Defense Ministry cannot confirm at the moment whether the aircraft has been shot down by Ukrainian Defense Forces - information is being clarified,\" he wrote on X.\n\"Footage from the site of the crash shows that the plane is completely destroyed.\"\nThe Russians say the human remains are up to over a mile from the site - but they have not been shown.\nInstead, the Emergencies Ministry staff - who would normally deal with air crashes - have been banished from the site and replaced with Defence Ministry soldiers with police support, according to reports.\nThey were especially keen to get hold of documents seen scattered in the snow.\nNext, the Russians said there were 65 PoWs, six crew and three security guards aboard the plane.\nVeterans of other exchanges like Ukrainian POW Max Kolesnikov said that three guards is not plausible and suggests it is a “lie”.\nIn his case, there were at least 20 guards on the plane carrying 50 prisoners.\nFurther, a list of names of those supposedly on the plane was given by Vladimir Putin’s leading woman propagandist Margarita Simonyan, head of the RT state media empire.\nPictures of some of the 65 she named are shown.\nYet at least one of those on the list was handed back to Ukraine on January 3, say Ukrainian reports.\nOther accounts say up to 18 were swapped earlier this month.\nThey are no longer in Russia.\nThere is also confusion over the plane’s routing.\nThe Il-75 was reported - for example by Russian Telegram channel VChK-OGPU, with links to law enforcement - to have crashed soon after taking off from Belgorod airport.\nYet this airport has been mainly closed since early in the war, as it is too near to the Ukrainian border.\nOther Russian accounts say the plane was heading from Moscow to Belgorod when it crashed.\nUkrainian telegram source Skrynka Pandory claims the plane’s tail number was RA-78830.\nIt was spotted over Armenia on January 23, 2024 and flew towards Iran, where it disappeared, said the channel.\nAccording to this account, it flew over Egypt after having overflown Saudi Arabia, along with the Red Sea and Iran.\nIt disappeared from the radar near Syria, and then flew to Belgorod, it is claimed.\nIts previous flight was under the number RFF8319 on January 24, 2024.\nIts direction from Belgorod was towards central Russia.\nIf this is true, it is unlikely to have been carrying prisoners of war.\nIndeed, there are claims that the plane has been regularly used through the war to ferry arms from Iran.\n“Everything points to the fact that it brought weapons from the East,” said the channel.\nHowever, it does seem this aircraft has been used before to transfer PoWs, as in the case of Azov fighters.\nMore suspicions come from the speed at which the Russian propaganda machine spewed out allegations against Ukraine after the crash.\nThe Insider media outlet claimed that the speed indicates advance planning.\nAmong the first to be ready with well-oiled rhetoric against Ukraine was ex-deputy defence minister Col-Gen Andrey Kartapolov, a pro-war MP and trusted loyalist.\n“It seems that the situation was planned and Kartapolov is acting as a media mediator for the spread of Russian disinformation,” said the report.\nThis likely had a “multi-layered goal: to convince Ukraine's allies that the supply of air defence systems is ‘dangerous’ for Ukrainians themselves, to find an excuse for Russian mothers, why the Russian Federation stops exchanges, transfer responsibility to Ukraine and other layers of the operation.”\nEx-president Dmitry Medvedev, seen as a Putin lacky, was also on hand with his invective attacking Ukraine.\nState TV and pro-Putin media seized the moment to blame Ukraine.\nFor example, Shot media accepted the official playbook without question and reported: \"The youngest Ukrainian prisoner to die on board the Il-76 was 21-year-old Ivan Roy....Today he was killed by the Ukrainian Armed Forces.\"\nAs of now, there is no proof of his death.\nRussia has said the Il-76 aircraft was shot down by three missiles of the\nPatriot or German-made IRIS-T surface-to-air missile system.\n“The launch of two Ukrainian missiles was observed by radar means of the Russian Air Force,” said the defence ministry.\nYet no evidence was given to prove this.\nCould the Russians have blown the plane out of the sky?\nWitnesses spoke of two explosions before the plane hit the ground, which could have been bombs or missiles or some other cause.\nAir crashes caused by friendly fire from the Russian side have been a feature of the war.\nMore sinister, Wagner warlord Yevgeny Prigozhin’s plane is widely seen to have crashed after a bomb exploded on board in June last year.\nThe bomb is suspected to have been planted with Vladimir Putin’s knowledge to wipe out the top leadership of Wagner which were no longer useful for him.\nUkraine later appeared to admit it had targeted the Il-76, while not commenting on the military plane having Kyiv PoWs on board, as Russia has alleged.\nThe statement implied such transport planes are used for moving missiles close to the war zone.\n“The General Staff of the Armed Forces of Ukraine announced against the background of the downing of the Russian Il-76 military transport plane that the Defence Forces are closely monitoring the logistics of the supply of missiles in order to reduce the missile threat to Kharkiv region,” said an official statement.\n\"The recorded intensity of shelling is directly related to the increase in the number of military transport planes that have recently been heading to the Belgorod airfield.\n“Taking this into account, the Armed Forces will continue to take measures to destroy means of delivery, control the airspace to destroy the terrorist threat, including in the Belgorod-Kharkiv direction.”\nIn the last week alone Russia had staged 19 missile attacks on Kharkiv region, killing 16 people including one child, said the statement.\n78 people were wounded.\n14 The crash site of the Russian Il-76 military transport plane Credit: East2West\n14 Pictures shared by Russian media appear to show the wreckage from the crash\n14 Footage showed what appears to be the bloody remains of one body Credit: East2West\n14 The £30million military aircraft can be seen flying out of control\n14 Russia claims the aircraft was carrying Ukrainian prisoners of war\n14 Ukrainian PoW Konstantin Danilchenko, 45, alleged by Russian state TV to have been on the crashed Il-76 Credit: East2West\n14 Ukrainian PoW Tailakov Deuran, 36 Credit: East2West\n14 Ukrainian PoW Oleksandr Babayev, 30 Credit: East2West\n14 Ukrainian PoW Oleksiy Gladyr, 28 Credit: East2West\n14 Ukrainian PoW Ivan Roy, 21 Credit: East2West", "source_domain": "www.thesun.co.uk", "text": null, "title": "7 bombshell clues Russia is LYING about Ukraine killing 65 of its own PoWs after £30m Il-76 plane ‘blown out of the sky’", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25476050/bombshell-clues-russia-lies-ukraine-plane-crash/"}