{"authors": ["Reged Ahmad", "Maya Yang", "Léonie Chao-Fong", "Martin Belam", "Jonathan Yerushalmy"], "date_download": "2024-02-05 15:32:56", "date_modify": "None", "date_publish": "2023-11-30 02:52:32", "description": "This blog is now closed", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F29%2Fisrael-hamas-war-live-updates-news-ceasefire-extension-reports-israel-raid-gaza-west-bank-palestine-jenin.json", "image_url": "https://i.guim.co.uk/img/media/9cab9f3709b72af1e6ba95b8f91f04ef733e6984/110_0_1700_1020/master/1700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=cdeac1c36177900c800b6a9e1edf833b", "language": "en", "localpath": null, "maintext": "From 30 Nov 2023 01.07 CET 30 Palestinians freed, says Israel Prison Service The Israel Prison Service said early on Thursday it had freed 30 Palestinians from Israeli jails in the sixth such release under a truce arrangement with Gaza’s Hamas militant group, Reuters is reporting. The Palestinians were released from prison facilities in Israel, the occupied West Bank and Jerusalem, the prison service said in a statement.\n30 Nov 2023 03.06 CET Here are some of the latest images of the 30 Palestinian prisoners released in the latest swap. It comes as international mediators race to seal another extension to allow further exchanges and prolong the halt of Israel’s air and ground offensive. View image in fullscreen A man smiles as he is welcomed after being released from prison by Israel, in the West Bank town of Ramallah. Photograph: Nasser Nasser/AP View image in fullscreen A woman smiles after being released from prison by Israel, in the West Bank town of Ramallah. Photograph: Nasser Nasser/AP View image in fullscreen Palestinian activist Ahed Tamimi walks with her mother after being released. A Palestinian official said she was released after being jailed in Damon Prison, near the Israeli city of Haifa, according to Reuters. Photograph: Ammar Awad/Reuters View image in fullscreen A Palestinian prisoner reacts after being released in Ramallah. Photograph: Ammar Awad/Reuters\n30 Nov 2023 02.48 CET The Thai Foreign Minister Parnpree Bahiddha-Nukara has held back tears when he met fellow Thais released to Israel by Hamas, Reuters is reporting. Another two Thai workers were set free on Tuesday, bringing the total released to 19. With their arrival at Shamir Medical Center, the workers embraced one another. “We survived! We survived!” they cheered, and one was seen wiping away tears. “We are not part of the conflict,” Parnpree said in a Reuters interview later on Wednesday after an emotional meeting with the workers on Tuesday. He said there were no conditions for their release. View image in fullscreen A handout photo made available by the Thai Ministry of Foreign Affairs shows the latest two Thai nationals freed from Hamas captivity as they are welcomed by Thai Foreign Affairs Minister Parnpree Bahiddha-Nukara. Photograph: Ministry Of Foreign Affairs/EPA\n30 Nov 2023 02.29 CET The extended truce between Israel and Hamas is due to end at 7am Thursday local time (5am GMT) and there is little sign so far of an agreement between the two sides on a second extension. It is currently 3.30am. Haaretz is reporting that no understanding has yet been reached regarding a list of captives to be released in a next round, with Israel apparently insisting that it include women and children. Agence France-Presse has quoted a Hamas source as saying that talks were focused on extending the pause by “two days or more” but that “what is being proposed in the discussions to extend the truce is not the best.” Israel’s war cabinet was meeting late on Wednesday over terms to extend the truce.\n30 Nov 2023 02.18 CET Ahed Tamimi among Palestinian prisoners released View image in fullscreen Ahed Tamimi is released in Ramallah, in the Israeli-occupied West Bank, early on Thursday. Photograph: Ammar Awad/Reuters Among the 30 Palestinian prisoners freed on Wednesday night was Ahed Tamimi, a 22-year-old activist who has become a key figure for Palestinians defying the Israeli occupation. Thirty Palestinian prisoners were freed overnight Wednesday, Israeli prison authorities said, in the final exchange under an extended truce deal that is due to expire within hours. “During the night, 30 male and female security prisoners were released from a number of prison facilities,” the country’s prison service said in a statement. Tamimi was detained over an Instagram post, which her family denies she made. The overnight releases, which came after a sixth batch of hostages were freed from Gaza, bring the number of Palestinian prisoners freed by Israel under a truce deal to 210. Hamas and other militants in Gaza have released 70 Israelis under the deal, along with nearly 30 hostages of other nationalities outside the truce framework. For more on who Ahed Tamimi is – read this piece by Beth McKernan and Sufian Taha. Activist Ahed Tamimi among 50 jailed Palestinians listed for release by Israel Read more\n30 Nov 2023 02.09 CET China says the UN security council should intensify its diplomatic mediation, relaunch the two-state solution and convene a “more authoritative and effective” international peace conference at the soonest, in a position paper on the Israeli-Palestinian conflict released on Thursday. China also urged the security council to heed the general call of the international community for a comprehensive ceasefire to be put in place to stop the fighting, the country’s foreign ministry said in statement listing the proposals, Reuters reports.\n30 Nov 2023 01.41 CET Jordan on Thursday will host an international conference attended by the main UN bodies and regional and international relief agencies to coordinate humanitarian aid to war-devastated Gaza, official media said. UN aid chief Martin Griffiths and key UN bodies and non-governmental organisations (NGOs) involved in ramping up aid to Gaza will be present at the conference, along with representatives of western and Arab countries involved in the aid effort, Reuters reports. The conference, to be held behind closed doors, will be addressed by King Abdullah who has been lobbying western leaders to back a UN resolution that calls for an immediate ceasefire.\n30 Nov 2023 01.07 CET 30 Palestinians freed, says Israel Prison Service The Israel Prison Service said early on Thursday it had freed 30 Palestinians from Israeli jails in the sixth such release under a truce arrangement with Gaza’s Hamas militant group, Reuters is reporting. The Palestinians were released from prison facilities in Israel, the occupied West Bank and Jerusalem, the prison service said in a statement.\n30 Nov 2023 01.03 CET The United States is urging Israel to narrow the zone of combat and clarify where Palestinian civilians can seek safety during any Israeli operation in southern Gaza, to prevent a repeat of the large death toll from Israel’s northern Gaza attacks, Reuters is reporting. Officials from President Joe Biden down, including in the state department and the Pentagon, are reportedly pleading with Israel to take a more cautious approach if and when the Israeli military extends its offensive to southern Gaza. It’s understood two-thirds of Gaza’s population of 2.3 million have fled south to avoid the war zone in the north.\n29 Nov 2023 00.46 CET In the US, Senate majority Leader Chuck Schumer is warning that antisemitism in the country has reached levels unseen in generations, Associated Press reports. He’s called on his fellow Democrats to clearly condemn it. Schumer said: The vitriol against Israel in the wake of 7 October is all too often crossing a line into brazen and widespread antisemitism the likes of which we haven’t seen in generations in this country, if ever Schumer added that because many of the incidents targeting Jewish people have come alongside left-wing demonstrations against Israel, liberal Jewish people “are feeling singled, targeted and isolated.” He specifically called out the phrase “from the river to the sea,” saying it alarms Jewish people to hear it used. He told The Associated Press he spent days over the Thanksgiving holiday writing the speech. Schumer is the highest-ranked Jewish elected official in the US. His remarks during a nearly-45 minute speech on the Senate floor Wednesday come at a sensitive time in the Israel-Hamas war, as the Biden administration is engaged in delicate negotiations to release hostages held by Hamas and extend the ceasefire. In an interview, he said his position “called on me to do this speech.”\n29 Nov 2023 00.28 CET US secretary of state Antony Blinken arrived on Thursday in Tel Aviv where he was expected to meet with Israeli leaders to discuss extending Israel’s temporary truce with Hamas militants and boosting humanitarian aid into the Gaza Strip, Reuters news agency reports. Blinken is making his third trip to the region since the deadly 7 October attacks by Hamas on Israel and is also expected to visit the occupied West Bank, where he will probably meet with Palestinian President Mahmoud Abbas, according to a Palestinian official. Blinken said at a news conference in Brussels on Wednesday: Looking at the next couple of days, we’ll be focused on … doing what we can to extend the pause so that we continue to get more hostages out and more humanitarian assistance in\n29 Nov 2023 00.07 CET Summary It is now slightly past 1am in Gaza and Tel Aviv. Here is where the day stands: Sixteen hostages were released today, including 12 Israelis and four Thais. Among the Israeli hostages released today were Elena Trupanov and Irena Tati, two dual Israeli-Russian citizens who were released earlier this evening.\nThe Palestinians to be released from Israeli prisons in exchange include 16 minors and 14 women, the Qatari foreign ministry said.\nA Hamas source said on Wednesday that the group was not satisfied with Israel’s proposals for another truce extension, Agence France-Presse (AFP) reports. Speaking to AFP ahead of the expiration of the current truce, which will be at 7am local time on Thursday, the source said: “What is being proposed in the discussions to extend the truce is not the best.”\nThe Palestine Red Cross Society (PRCS) delivered 21 trucks of aid into Gaza and northern areas on Wednesday. “PRCS is committed to delivering the largest number possible of humanitarian aid to north Gaza, which had not received any aid prior to the humanitarian pause agreement,” the group said.\nIsrael’s defens e minister, Yoav Gallant, has said Israeli forces are ready to resume fighting “immediately ”. Posting to social media on Wednesday, Gallant wrote: “We are making every attempt to return all the abductees and to fully exploit the current move to return all the abducted women and children in Gaza. IDF forces in the air, on land and at sea are ready to resume fighting immediately.”\nTwo boys, one eight years old and the other 15, w ere shot and killed by Israeli forces on Wednesday in the occupied West Bank city of Jenin, the Palestinian health ministry said. In a statement reported by Agence France-Presse, the health ministry said: “Adam al-Ghul, eight years old, and Bassem Abu el-Wafa, 15 years old, were killed by bullets from the occupier [Israel].”\nBenjamin Nentanyahu has spoken with representatives of the Bibas family after reports from Hamas that three of its members were killed, including 10-month-old Kfir Bibas, Haaretz reports. According to Haaretz, the Israeli prime minister told the family representatives that the matter was being investigated by Israel’s security forces.\nThe US is hopeful that the truce in Gaza between Israel and Hamas can be extended, the US ambassador to the UN, Linda Thomas-Greenfield, told reporters on Wednesday, Reuters reports. “We’re hopeful the truce can be extended,” Thomas-Greenfield said, adding: “This is all in the hands of Hamas. The Israelis have said if they continue to release 10 hostages a day, they will extend by a day. So it truly is in their hands. But I do think there is a potential for that and we are actively working to extend the deal.”\nThree Qatari armed forces aircraft carrying 108 tons of aid for Palestinians in Gaza have arrived in El Erish, Egypt, Qatar’s news agency announced on Wednesday. The three planes, which carried basic food supplies and shelter equipment, brings the total number of Qatari planes sent to Gaza to 30, carrying 1,018 tons of aid.\nSpeaking at the UN security council on Wednesday, Palestine’s foreign minister, Riad al-Maliki, said that the ongoing violence between Israel and Hamas was “not a war” but rather a “carnage that no one can justify ”. “It must be brought to an end,” al-Maliki said.\nJordan will host an international conference on Thursday that will be attended by the main UN bodies, as well as regional and international relief agencies to coordinate humanitarian aid to Gaza, Reuters reports. The UN aid head, Martin Griffiths, as well as key UN bodies and NGOs involved in increasing the entry of aid into Gaza, are expected to attend the conference, along with representatives from western and Arab countries.\nThe UN secretary general, António Guterres, said on Wednesday that Gaza is in the midst of an “epic humanitarian catastrophe”. Addressing a UN security council meeting chaired by China’s foreign minister, Wang Yi, Guterres said “we must not look away” from the deteriorating humanitarian crisis that has engulfed Gaza.\nUpdated at 00.12 CET\n29 Nov 2023 23.48 CET Speaking at the United Nations in New York on Wednesday, the Saudi foreign minister, Prince Faisal bin Farhan, said that Saudi Arabia is “not going to work with anyone” who seeks to encourage Palestinians to leave their land. Bin Farhan said: The Palestinians do not want to leave their land and we are not going to encourage them or force them to leave their land and we are not going to work with anyone who has that agenda. The Palestinians have a right to their land and they have a right to live in safety and security and dignity on their land. That is what we will push for and that is what we will work towards. #NewYork | Foreign Minister HH Prince @FaisalbinFarhan: The Palestinians do not want to leave their land. We are not going to encourage them to leave their land and we are not going to work with anyone who has that agenda. pic.twitter.com/ef1tRS9h5v — Foreign Ministry 🇸🇦 (@KSAmofaEN) November 29, 2023\nUpdated at 23.55 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Qatar mediator says latest prisoner release would comprise 16 children and 14 women - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/29/israel-hamas-war-live-updates-news-ceasefire-extension-reports-israel-raid-gaza-west-bank-palestine-jenin"}