{"authors": ["Dan Sabbagh"], "date_download": "2024-02-05 15:32:57", "date_modify": "None", "date_publish": "2023-11-29 12:23:51", "description": "Palestinian officials say incursion in West Bank also killed boy of 15 as IDF reports deaths of terror leader and associate", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F29%2Fclashes-jenin-israel-major-incursion-west-bank.json", "image_url": "https://i.guim.co.uk/img/media/97fd962cc999fa2cb396d5c9cfc1da971e31a153/0_167_5016_3010/master/5016.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=54965723666688abf62fe7991a867375", "language": "en", "localpath": null, "maintext": "Four people, including two children, were reportedly killed during a major Israeli incursion into the West Bank city of Jenin that the Israel Defense Forces said was aimed at suppressing jihadist activity.\nAdam Samer al-Ghoul, eight, and Basil Suleiman Abu al-Wafa, 15, were shot dead during the fighting, Palestinian officials said, while the IDF said a terror leader and his associate had been found dead after their building was attacked.\nA video from the Palestinian news agency Wafa appeared to show Adam being shot dead in a street by what the agency said were Israeli forces. No shooter can be seen in the film and there was no immediate comment from the IDF.\nMuhammad Zubeidi, described by Israel as the Jenin camp commander from Islamic Jihad, was killed in a house where he had been sheltering with another man. They had been surrounded and were attacked with shoulder-fired missiles, grenades and other explosives, the IDF said.\nIsrael said Zubeidi had been involved in “extensive terrorist activity”, including the killing of Meir Tamari, a 31-year-old Israeli citizen who was shot dead at the end of May in his SUV while travelling near his home in the settlement of Hermesh.\nIsrael said 17 other people were arrested in Jenin after house searches where weapons and ammunition were found, while residents in one neighbourhood reported being forced from their homes amid violent confrontations.\nHundreds of Israeli troops entered Jenin and its camp on Tuesday evening, and continued their activities on Wednesday, in an operation that residents said was unusually large in scale and was probably timed to coincide with the pause in fighting in Gaza.\nJenin has long been a centre of Palestinian resistance to Israel, with a series of deadly clashes since Hamas launched its attack from Gaza. Fourteen people were killed in fighting earlier this month, while five were killed this week after Israeli forces launched a raid aimed at detaining a suspected militant.\nArmed clashes were reported from early Tuesday evening, and overnight two hospitals in the area were cut off as the first casualties were reported.\nIsrael said it had conducted an airstrike during the raid, while the Wafa agency reported raids on homes in the east of Jenin, bulldozers knocking out electricity and destroying infrastructure and a drone attack.\nEight people were initially reported as injured while video and photographs showed damage to houses, cars and roads..\nChristos Christou, the international director of Médecins Sans Frontières, said on Tuesday night that Israel had cut off the Khalil Suleiman hospital during the raid, meaning that “there was no way for any of the injured patients to reach the hospital, and there’s no way for us to reach these people”.\nThe Palestinian Red Crescent Society reported that Israeli forces had blocked the entrance of Jenin government hospital for 40 minutes, preventing medics from transferring a patient with a gunshot wound in the leg to the hospital. The patient was subsequently arrested, the society added.\nIsrael says it has detained 2,000 wanted suspects in the West Bank since the 7 October terrorist attack, and that 1,100 of them are affiliated to Hamas, the dominant force in Gaza.", "source_domain": "www.theguardian.com", "text": null, "title": "Eight-year-old boy among four reported dead in Israeli raid on Jenin", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/29/clashes-jenin-israel-major-incursion-west-bank"}