{"authors": ["Paul Farrell", "Paul Farrell For Dailymail.Com"], "date_download": "2024-02-05 15:33:00", "date_modify": "None", "date_publish": "2023-11-29 07:02:09", "description": "One person has been confirmed dead after a US military Osprey plane crashed into the ocean close to Yakushima island, around 600 miles south of Tokyo.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12803647%2FUS-military-aircraft-eight-board-crashes-sea-Japan.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/29/07/78361725-0-image-a-9_1701241323633.jpg", "language": "en", "localpath": null, "maintext": "One person has been confirmed dead after yet another US military Osprey plane crashed, this time over the ocean close to Yakushima island, around 600 miles south of Tokyo.\nOfficials said there were eight people on board the $90 million aircraft when it plummeted into the water.\nThe crash happened at around 2:47 p.m. local time, with local residents reporting the aircraft had fire blowing from its left engine as it fell into the sea, Japanese broadcaster MBC reported.\nJapanese officials said three people had been rescued. One person was found was alive but unconscious, the conditions of the two others is unclear.\nThe aircraft was attempting to make an emergency landing at Yakushima Airport when it crashed.\nThe network also reported that the weather was clear in the area where the incident took place.\nJapanese coast guard rescuers have found three people as well as debris after a US military Osprey plane crashed into the ocean close to Yakushima island\nThis picture shows the remains of the US military Osprey aircraft\nA Japanese coast guard helicopter searching for the downed plane close to the East China Sea\nOn the right, an inflatable life vessel from the aircraft which was reportedly found empty\nA Japanese ship is seen hauling the empty inflatable life craft out of the water\nThe Osprey was en route from Iwakuni base in the Yamaguchi region to Kadena base in Okinawa.\nIt disappeared from radar around 12:40 Eastern time. A distress call was received by the coast guard shortly afterwards.\nThe cause of the crash and the status of the seven others on board were not immediately known, coast guard spokesperson Kazuo Ogawa said.\nIt had been carrying eight crew and is an Air Force aircraft, a U.S. official who was not authorized to speak to the media said on condition of anonymity.\nThe official, who spoke to the Associated Press, could not provide further information pending notification of next of kin.\nCoast guard aircraft and patrol boats found one person identified only as a male who was later pronounced dead by a doctor at a nearby port, he said.\nThey also found gray-colored debris believed to be from the aircraft and an empty inflatable life raft, Ogawa said.\nChief Cabinet Secretary Hirokazu Matsuno said the Osprey disappeared from radar a few minutes before the coast guard received the emergency call.\nThe aircraft requested an emergency landing at the Yakushima airport about five minutes before it was lost from radar, NHK public television and other media reported.\nThe Boeing MV-22B Osprey is shown here, there have been six fatal crashes involving the craft since 2012\nAccording to pictures released by the Japanese media, the search continued after sunset in the region\nThis is the second fatal crash involving an Osprey aircraft in the last three months following the deaths of three Marines on board one in August\nA total of six coast guard ships and two helicopters were deployed as part of a rescue operation.\nThe deployment of the Osprey in Japan has been controversial, with critics saying it is prone to accidents. The US military and Japan say it is safe.\nThis is the second time in three months that an Osprey has been involved in a crash. Three Marines were killed during an exercise in northern Australia. The cause of that crash has not been made public.\nIn June 2022, five Marines died in a fiery crash in a remote part of California east of San Diego.\nA crash investigation report last month found that the tragedy was caused by a mechanical failure related to a clutch.\nThere had been 16 similar clutch problems with the Marine Ospreys in flight since 2012, the report found.\nIn February 2023, the Marine Corps announced that a piece of equipment believed to be the source of the problem had been replaced.\nThe Osprey, a hybrid aircraft that takes off and lands like a helicopter but during flight can tilt its propellers forward and cruise much faster like an airplane. They are used by the US Marines, US Navy and Japan Self Defense Forces.\nSince 2012, there have been six fatal crashes of Marine Ospreys resulting the deaths of 16 people.\nA majority of the 50,000 U.S. troops based in Japan under a bilateral security pact and 70 percent of U.S. military facilities are stationed in Okinawa, which accounts for only 0.6 percent of Japanese land.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "One confirmed dead after US military Osprey aircraft with eight on board crashes into sea off southern Japan - as search continues and coast guard find three people and debris", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12803647/US-military-aircraft-eight-board-crashes-sea-Japan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}