{"authors": ["Emine Sinmaz"], "date_download": "2024-02-05 15:33:08", "date_modify": "None", "date_publish": "2023-11-29 19:04:49", "description": "Infant was kidnapped alongside his brother, Ariel, and their mother, Shiri, who the group say have also died", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F29%2Fhamas-says-10-month-old-hostage-kfir-bibas-was-killed-in-israeli-bombing.json", "image_url": "https://i.guim.co.uk/img/media/8529e2b9b1dca231c0216e6015877a385cf7567e/0_275_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7d125c3da923aaa374e0fbdedd0c22dd", "language": "en", "localpath": null, "maintext": "A 10-month-old baby who was the youngest hostage kidnapped and taken to Gaza has reportedly been killed in an Israeli bombing alongside his mother and brother, Hamas has claimed.\nKfir Bibas was taken from the Nir Oz kibbutz along with his four-year-old brother, Ariel, and their mother, Shiri. His father, Yarden, was also abducted during the 7 October Hamas attacks on Israel, in which about 1,200 people were killed and 240 taken hostage.\nFootage of the family’s abduction showed a terrified Shiri clutching her two sons as they were bundled away. Yarden appeared in a separate video with an apparent head injury.\nTheir relatives have been campaigning for their release after the brothers were not included in groups of those freed under the temporary ceasefire.\nEarlier on Wednesday relatives said their loved ones were not among the hostages due to be released as negotiations to extend the truce continued.\nShortly before Wednesday’s planned release of women and children, the military wing of Hamas said Kfir had been killed in an earlier Israeli bombing in the Gaza Strip, along with his brother and their mother. Yarden was not mentioned.\nIn a statement released through the Hostages and Missing Families Forum, the relatives said: “Our family has learned of Hamas’s latest claims. We are waiting for the information to be confirmed and hopefully refuted by military officials. We thank the people of Israel for their warm support but kindly request privacy during this difficult time.”\nThe Israel Defense Forces (IDF) said it was trying to verifying the claims. It said in a statement: “IDF representatives spoke with the Bibas family following the recent reports and are with them at this difficult time. The IDF is assessing the accuracy of the information.\n“Hamas is wholly responsible for the security of all hostages in the Gaza Strip. Hamas must be held accountable. Hamas’s actions continue to endanger the hostages, which include nine children. Hamas must immediately release our hostages.”\nView image in fullscreen At JW3 in north London, empty chairs and a highchair represented missing persons, including Ariel, four, and Kfir, who was nine months old when he was taken hostage. Photograph: Lucy North/PA\nHours earlier, the relatives of the four hostages had released a heartfelt statement in which they spoke of their devastation that they were not among those to be freed on Wednesday.\n“Those last days, since the beginning of the ceasefire, have been unbearably difficult for us. We’re waiting and hoping to see and to hug our family again,” they said.\n“Time is critical – any single day in captivity is a major risk for their life and could irreversibly damage their bodies and minds. We demand their immediate release due to the humanitarian emergency reasons that cannot be ignored. They must be released NOW!”\nIn a press conference on Tuesday, Yarden’s sister, Ofri Bibas Levy, and cousin, Eylon Keshet, said they were “worried sick” about the family and living in a “complete nightmare”.\nIsraeli authorities on Tuesday said they believed the family had been handed over by Hamas to another Palestinian militant group in a possible complication of efforts to free them.\nThe latest claims are likely to add to the anguish of other families whose loved ones are still being held hostage.\nThe families of two young men who were abducted from the Supernova music festival have travelled to London to campaign for their release.\nView image in fullscreen Aviram Meir holds a poster of his nephew, Almog Meir Jan, 21, who is a Hamas hostage. Photograph: Sam Hall/PA\nOrit Meir, 61, wept as she told how she had watched the footage of her son, Almog Meir Jan, 21, in a hostage video released by Hamas.\n“I saw him lie on the floor with four other young guys. My son is covering his face with his hands and he looks scared, terrified. It’s horrible; I want to shout, I want to cry,” she said.\nThe mother of two, who was due to meet MPs in Westminster, said she wanted the Red Cross to check on her son and tell her is he is alive. “The first goal is to bring Almog back. It’s why we came here,” she said.\nIlay David, 26, said he had watched several “horrifying” Hamas videos featuring his brother, Evyatar, 22.\n“But we have had no signs of life from most of the hostages for more than 54 days, and we are clueless about their wellbeing, it can cost their lives,” he said.\nDavid said he also wanted to raise awareness about the male hostages who have not been included in the current deal.\n“We are very afraid that the world will forget our loved ones after the release of children and women, that the global community will feel like: ‘That’s it, mission accomplished,’ he said.\n“That they will forget about more than 100 men, and that the only crime they committed was celebrating in a party or just living their lives in their homes and so that’s the most important thing.”", "source_domain": "www.theguardian.com", "text": null, "title": "Hamas says 10-month-old hostage Kfir Bibas was killed in Israeli bombing", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/29/hamas-says-10-month-old-hostage-kfir-bibas-was-killed-in-israeli-bombing"}