{"authors": ["Matthew Phelan Senior", "Matthew Phelan Senior Science Reporter For Dailymail.Com"], "date_download": "2024-02-05 15:33:09", "date_modify": "None", "date_publish": "2023-11-29 21:53:25", "description": "US Space Force released a plan to identify and track 'anomalous' UFO sightings. The newest Pentagon branch said that 'unknown objects' disrupt its 'threat identification'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsciencetech%2Farticle-12805617%2Fus-military-ufos-space.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/29/18/78384307-0-image-m-28_1701282569938.jpg", "language": "en", "localpath": null, "maintext": "The Pentagon branch tasked with protecting America from space-based threats, local and galactic, has detected thousands of UFOs in Earth's orbit, DailyMail.com can reveal.\nUS Space Force, America's newest military branch created under President Trump in 2019, told personnel this month that the sightings were so regular that they are 'hindering threat identification,' the branch's core mission.\nWhile many of the sightings will prove to be man-made space junk and 'natural debris' like meteoroids, US foreign adversaries continue to launch spy satellites, like North Korea's new Malligyong-1, and other covert orbital platforms.\nOne new concern, Space Force noted: the risk of threatening spacecraft hidden in the large unwatched area between Earth and the moon, dubbed 'cislunar' orbit.\nIn their new report, published this month, Space Force's leadership emphasized the importance of finding these grave 'threats' among mere 'hazards' like space junk.\nBut the military branch also went into considerable detail on a weirder, new category of potential 'hazards and threats' under scrutiny.\nUS Space Force, America's newest military branch created under President Trump in 2019, told personnel this month that 'abnormal observables' in space are a pervasive problem that is 'hindering threat identification,' the branch's core mission\nSpace Force hopes to 'distinguish between sources of spacecraft anomalies in support of anomaly resolution, recovery, and space attack assessment.' Since the branch's creation in 2019, the number of UFO 'unknowns' in Earth's orbit has skyrocketed by the thousands (above)\nSpace Force's mandate 'to rapidly identify and respond to threats and hazards,' the strategy document noted, also includes, 'objects that exhibit abnormal observables and patterns of life and cannot [be] correlated to any owner or point of origin.'\nDailyMail.com has reached out to STARCOM, Space Force's Space Training and Readiness Command which published the new document, for detailed clarification on its precise meaning by the terms 'abnormal observables' and 'patterns of life.'\nIn recent years, Pentagon officials tasked with investigating UFO cases, including the now famous 2004 Tic Tac incursions, have focused their attention on 'five observables' they say are unique features of serious unexplained phenomena.\n'Unidentified aerial phenomena' or UAP that check off these 'observables' appear to display either one or all of the following: (1.) gravity-defying behavior, (2.) eerily low observability on radar or other sensors, (3.) sudden or instantaneous accelerations, (4.) hypersonic speeds without signatures like 'sonic booms,' and (5.) so-called 'trans-medium' travel between air, sea and outer space.\nIt's unclear from the Space Force STARCOM document, however, whether these five, established UFO techno-signatures overlap with their own 'abnormal observables.'\nIt's also unclear what 'patterns of life' have been detected from orbital unknowns.\nSpace Force's strategy document, titled 'Space Doctrine Publication 3-100, Space Domain Awareness,' outlines the military branch's mission to monitor a vast orbital range that includes everything from low earth orbit (LEO) to the moon\nAcross US military branches, the term 'patterns of life' has been used to reference the thermal heat signatures given off by living human targets, for everything from drone warfare to troop deployment surveillance.\nThe Pentagon's departing UFO investigation chief, physicist Dr. Sean Kirkpatrick, also used the term to indicate UAP mysteries that would include extraterrestrial craft.\n'We are executing a rigorous science and technology plan to ensure controlled calibration of sensors, patterns of life, and signature characterization development,' Kirkpatrick said last December.\n'More data will help build a more complete picture and support the resolution of […] anomalous phenomena.'\nThermal signatures from the body heat of a living thing (whether terrestrial or E.T. in origin), may fall into this category, to judge from the passages of Space Force's new strategy document that focused on the infra-red capabilities of US military satellites.\n'Optical and infrared sensors with relatively wide (one square degree or more) field-of-view,' Space Force's STARCOM advised, 'are also well suited for searching for unknown objects or objects with only a roughly known location.'\nHowever, Lt. General DeAnna Burt, the deputy chief devoted to Space Force's cyber and nuclear operations, among others, have also used 'patterns of life' to reference detectable, routine activity by any and all technological platforms in space.\nLast May, Lt. Gen. Burt dropped the term of art while criticizing China for its opaque and noncooperative space program activities.\n'We've said what our capabilities are,' Lt. Gen. Burt told SpaceNews. 'If you are honest and say what things are and have patterns of life that indicate they are what they are, then it's an everyday operation,' Burt said.\nWhatever Space Force's intent, the branch issued its new publication in mid-November to announce, in part, its plan to identify and track UFOs in orbit around Earth — a high priority initiative the branch calls 'Space Domain Awareness' (SDA).\nThe strategy document, titled 'Space Doctrine Publication 3-100, Space Domain Awareness,' outlines Space Force's mission to successfully monitor a vast orbital range that includes everything from low earth orbit (LEO) to the moon.\nSTARCOM drafted the document as part of its mission to educate and train US Space Force personnel, officially dubbed 'guardians.'\nSince the branch's creation in 2019, the number of orbital knowns and UFO 'unknowns' shadowing the Earth has skyrocketed by the thousands.\nSpace Force, citing NASA data, published a chart revealing that there are now over 25,000 objects total in orbit, although most were determined to be 'rocket bodies,' 'spacecraft,' 'mission-related debris' or other known man-made objects.\nMuch of the clutter orbiting Earth is man-made space junk and 'natural debris' like meteoroids, but Space Force's document detailed a weirder, new category: 'objects that exhibit abnormal observables and patterns of life and cannot [be] correlated to any owner or point of origin'\nOver 60 percent of the US Space Force budget, or about $19.2 billion worth, has earmarked for research, development, testing and evaluation - creating the tools and techniques for the new and growing problem of defending US interests from foreign military activity in space\nAccording to the Air Force Research Lab, its new security and monitoring probe, the Oracle spacecraft (above) 'aims to launch in 2026 to an area of gravitational stability between the Earth and the Moon to test techniques to monitor space traffic that travels through that region'\nSpace Force leadership said it hopes to positively identify any and all UFOs to determine if they should be recovered or if they pose a clear and present danger to the United States.\nOr, in military's own unique jargon, Space Force hopes to 'distinguish between sources of spacecraft anomalies in support of anomaly resolution, recovery, and space attack assessment,' the new document states.\nBut that will cost money, alongside Space Force's other duties providing satellite and other space-based support for American troops on the ground worldwide.\nThis year, the new military branch is requesting a $30 billion budget from Congress for 2024, just one of many UFO-centric provisions to the 2024 National Defense Authorization (NDAA) now approaching a heated, contested vote on Capitol Hill.\nAs detailed by the law creating Space Force, the military branch has two related but distinct duties.\nREAD MORE: Air Force officer breaks silence on 'red, glowing UFO the size of a football field' hovering at low altitude over US space base in California The ex-Air Force security officer said he investigated two sightings of a 100-yard UFO witnessed by Boeing contractors and Air Force police on October 14, 2003. There's 'at least 80 people that know this happened,' the USAF vet., Jeff Nuccetelli, told the Merged podcast. As the officer recalled of the eyewitnesses, 'They're scared. Everyone's freaked out' Advertisement\nFirst it must organize, train and equip personnel to 'protect US and allied interests in space.' But, secondarily, it must also 'provide space capabilities to the joint forces' here on Earth, such as maintaining spy satellites and other space-based military hardware.\nSpace Force's STARCOM noted that figuring out the mystery of what these UFOs or UAP are is essential, in part, so that it can get on with it's other military troop-support tasks.\n'Anomalous indications,' the new guidance document states, 'unnecessarily consume SDA resources (e.g., sensors, communication nodes, command and control [C2] centers, planners, operators) that would otherwise be supporting space and terrestrial combatant commands.'\nOne new concern, the document added, is the growing threat of foreign spy satellites and worse, in the large dark orbital region between the Earth and the moon, dubbed 'cislunar' orbit.\n'Current sensor capabilities will find that the vastness of space between the Earth and the moon, and around the moon, creates challenging conditions for search, custody, and collection operations in support of joint forces,' the branch's new strategy document stated.\nSpace Force noted plans by the US Air Force Research Lab for a new security and monitoring probe, the Oracle spacecraft, which 'aims to launch in 2026 to an area of gravitational stability between the Earth and the Moon to test techniques to monitor space traffic that travels through that region.'\nGiven all this uncharted territory, which is at best poorly monitored by US defense systems, it is no surprise that the branch's 'guardians' are requesting $3.9 billion more from taxpayers for 2024 than its 2023 fiscal year budget.\nAt present, over 60 percent of the US Space Force's budget, or about $19.2 billion worth, has been earmarked for research, development, testing and evaluation.\nNearly $20 billion, in other words, just to create the tools and techniques for the new and growing problem of defending US interests from foreign military activity, terrestrial and possibly extraterrestrial, in outer space.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US military is seeing UFOs in SPACE, official report says", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sciencetech/article-12805617/us-military-ufos-space.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}