{"authors": [], "date_download": "2024-02-05 15:33:15", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The secretary of Ukraine's security council has reportedly claimed that Russian 'sleeper spies' are now working in Kiev to topple government Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274047050%2Fkiev-denies-russian-moles-penetrated-security-agency.json", "image_url": "https://cdn.bignewsnetwork.com/YzI3MjQyZDYtYzY.jpg", "language": "en", "localpath": null, "maintext": "Aleksey Danilov, secretary of the Ukrainian security council, had been cited earlier by The Times claiming the SBU was rife with Russian 'sleeper spies'\nOne of Ukraine's top security officials, Aleksey Danilov, has reportedly retracted his claim published by The Times on Monday, that the country's intelligence service is rife with Russian 'sleeper' agents. Danilov, who is secretary of Kiev's Security Council, insisted he'd been misinterpreted and that the agency was actually rooting out moles.\nThe SBU had a change of leadership in July 2022 when President Vladimir Zelensky declared that widespread treason in the ranks of the agency required fresh blood. The current SBU head, Vasily Malyuk, is also a member of the Ukrainian security council, on which Danilov serves as secretary.\nAccording to The Times, Danilov claimed that any alleged Russian ring is a legacy of ousted President Viktor Yanukovich, during whose term in office in the early 2010s the SBU was infiltrated. The sleeper cell has now been activated to topple Zelenksy, he was originally cited as saying.\nSpeaking to Ukrainskaya Pravda later in the day, Danilov insisted that the British newspaper had misunderstood him and that the sleeper agents were not in the SBU. According to the Ukrainian paper, the spy agency itself has also argued in a statement that Danilov's words were misinterpreted by the media.\nIn his interview with the Times, Danilov claimed that Moscow is attempting \"to organize anti-war rallies\" in Ukraine and to push a \"false narrative\" about tensions between the country's civilian and military leadership through these \"activated\" agents.\nEarlier this month, Ukraine's top army commander Valery Zaluzhny publicly contradicted Zelensky by describing the situation on the frontline as \"a stalemate.\" The president has since warned military commanders against interfering in national politics.\n\"With all due respect to General Zaluzhny ... there is an absolute understanding of the hierarchy and that is it, and there can't be two, three, four, five [leaders],\" Zelensky told The Sun last week.\nHe has also claimed that a Russian conspiracy was underway to undermine his presidency through mass protests.\nLast month, The Washington Post published a detailed story about US influence on Ukraine's special services. Since 2015, the CIA has invested tens of millions of dollars into transforming them \"into potent allies against Moscow,\" it said. American spies considered the SBU a security risk and created an entirely new directorate, while GUR, the military intelligence branch, was rebuilt from scratch.\nThe Russian military has estimated Ukrainian frontline losses since early June, when Kiev launched its Western-backed counteroffensive, at over 100,000. Defense Minister Sergey Shoigu described Kiev's forces earlier this month as being on the brink of collapse.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Kiev denies Russian moles penetrated security agency", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274047050/kiev-denies-russian-moles-penetrated-security-agency"}