{"authors": ["Dan Sabbagh"], "date_download": "2024-02-05 15:33:16", "date_modify": "None", "date_publish": "2023-11-29 18:49:06", "description": "It is far from clear how Israel can attack south of territory without making dire situation even worse", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F29%2Fnext-phase-of-gaza-war-risks-unprecedented-humanitarian-crisis.json", "image_url": "https://i.guim.co.uk/img/media/902f43030bcb77cfffd1de2ad6bda9067eeabec4/0_273_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=86883df7419fbf66792e5be8b7c4bd60", "language": "en", "localpath": null, "maintext": "While talks continued over extending the truce in Gaza, the Israeli Defense Forces have continued to prepare for a resumption of hostilities within days – which risks provoking an unprecedented humanitarian crisis among an already desperate population.\nIsrael remains determined to take control of the southern part of the strip, and in particular Khan Younis, where it believes Hamas’s leader, Yahwa Sinwar, is based, in pursuit of the overall goal of destroying the group’s military and political capacity.\nBut after demanding the evacuation of northern Gaza, insiders and experts accept the strategy has to change. “The IDF knows it cannot conduct a duplicate of the operation in northern Gaza in the south,” said Tamir Hayman, a former head of Israel’s military intelligence, who has been providing advice to his previous employer since 7 October.\nThere are, Hayman says, 2 million people in the south of Gaza, 1 million of whom have moved there since the start of Israel’s attacks on the strip, in response to demands that they evacuate from the heart of the combat zone. This has not stopped Israel’s air force bombing in the south, but by contrast the north has been smashed.\nOn Wednesday, Yahya al-Sarraj, the mayor of Gaza City, told Al Jazeera that 60% of housing units and apartments have been destroyed, roughly in line with analysis from satellite imagery. By contrast, in Khan Younis, the estimate is that 10% to 15% of buildings have been damaged.\nAn idea that is being aired in some circles, though not publicly, is that Israel’s military will have to organise local evacuations of civilians on a village-by-village or district-by-district basis, before attacking to take control of both the ground and tunnels below. Air power may only be deployed once an evacuation is complete.\nIt would also mean drawn-out fighting – “the overarching strategy is for a very long war,” Hayman says grimly. Gaza’s northernmost town, Beit Hanoun, was after the initial aerial bombardment attacked and surrounded, and a commander, Col Arye Baat from the 252nd division, a unit of reservists, said it took “about 24 days” to seize military control in heavy fighting.\nIf the new model is viable, the IDF thinks fighting will could go on for months, at least into January. But the prospect of a longer war and above all further evacuations, to an increasingly small portion of the strip, alarms aid agencies and will raise wider concerns that Israel’s ultimate goal is to depopulate the strip.\n“I would call that a Nakba,” said one aid official who asked not to be named, a reference to the mass displacement of Palestinians in the 1948 war.\nIn any event, the humanitarian situation in the south is challenging enough. Oxfam says it and its partners have struggled to deliver aid on the levels required during the current pause in fighting, with water, electricity and full telecoms not restored, with humanitarian workers and machinery to remove the rubble often denied entry.\nBushra Khalidi, Oxfam’s policy lead for Gaza, said the six-day pause “has failed” as an effective mechanism for enhanced aid delivery. “One of our main concerns remains the establishment and management of safe zones or humanitarian areas, which have proven to be highly problematic,” she added.\nThe concerns are not lost on Israel’s principal supporter, the US. “We don’t support southern operations unless or until the Israelis can show that they have accounted for all the internally displaced people of Gaza,” John Kirby, the White House national security spokesperson said on Tuesday, a message that he added the Israelis “were receptive to”.\nEarly in the seven-week war, Israel announced the establishment of a humanitarian zone in al-Mawasi, a parcel of land on the Mediterranean coast 0.6 miles (1km) wide and 8.7 miles (14km) long, but earlier this month the idea was condemned by Tedros Adhanom Ghebreyesus, the head of the World Health Organization.\n“Attempting to cram so many people into such a small area with such little infrastructure or services will significantly increase risks to health for people who are already on the brink,” he told the UN, and said his body would not participate in setting up such a zone unless safety and security conditions were met.\nIsrael’s leaders and generals, however, keep repeating they are determined to defeat Hamas militarily. A fresh IDF estimate suggests half – seven out of 14 – Hamas battalions remain combat-effective in northern Gaza after nearly a month of pre-truce ground operations, and there are a further 10 in the south.\nThe stakes have been raised so high by Israel, which argues that the very existence of Hamas on its border amounts to an existential threat, that the simple survival of the group as a coherent force and Sinwar himself would be seen as a defeat. But with diminishing amounts of land left, it is far from clear how Israel can attack in the south without the most dire consequences for 2 million or more people.", "source_domain": "www.theguardian.com", "text": null, "title": "Next phase of Gaza war risks unprecedented humanitarian crisis", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/29/next-phase-of-gaza-war-risks-unprecedented-humanitarian-crisis"}