{"authors": ["Shlomo Sand", "Shlomo Sand Is An Israeli Emeritus Professor Of History At Tel Aviv University", "More This Author"], "date_download": "2024-02-05 15:33:18", "date_modify": "None", "date_publish": "2023-11-29 16:55:43", "description": "The IDF’s response against all Gazans has made it harder to only see in Israel a victim of immediate circumstance.", "filename": "https%3A%2F%2Fwww.newstatesman.com%2Fideas%2F2023%2F11%2Fshlomo-sand-left-wing-jews-values-conflict.json", "image_url": "https://dl6pgk4f88hky.cloudfront.net/2023/11/29/Rosa_Luxemburg-800x418.jpg?1707143599", "language": "en", "localpath": null, "maintext": "As is well known, in the long history of the left there have always been many Jews. Although in both of the great revolutions, the English and the French, that opened the modern age there were no significant figures of Jewish background. The moment that the left started to form in 19th-century Germany, people such as Karl Marx and Ferdinand Lassalle, and later on in eastern Europe Rosa Luxemburg, Leon Trotsky, and many other Jewish revolutionaries, became an inseparable part of the formation and spread of socialism in the West.\nMany of those figures did not ask questions about their Jewish heritage, but others were preoccupied with the issue of Jewish identity, and tried to mediate in different ways between being part of the political left and having a unique background. They ranged from Moses Hess who, in his early career, was close to Marx through Bernard Lazare (the French anarchist who sparked the Dreyfus affair), to Harold Laski, the economist and political theorist who chaired the British Labour Party, or even the historian Isaac Deutscher, author of Message of the Non-Jewish Jew.\nThat modern anti-Semitism had already blossomed in the 19th century, including among different left-wing currents, did not deter Jews from identifying with the universal values of socialism. In the 20th century the alliance between Jews and the myth of social and political equality was strengthened and turned into an almost unquestionable fact.\nWithin the international Zionist movement, too, the left grew and spread until, with the establishment of the State of Israel in 1948, the left became the hegemon. In fact, it was the left that built and established Zionist society, at least until the 1970s. It is noteworthy that both the socialist and communist movement, led by Josef Stalin, supported the founding of the Jewish state.\nSince the end of the 19th century, the relationship between Jews and the traditional right (Catholic, Protestant, or orthodox), or extreme secular right was always unstable and tense. The immigration of Jews from the Russian empire to the West had raised the level of hate towards Jewish immigrants even higher, and extreme nationalism turned the Jew into the chosen enemy of the nation. The peak of that hate was the Nazi genocide, but even after that, radical right-wing parties remained suspicious of any Jewish population in Europe.\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. Sign up directly at saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. Sign up directly at morningcall.substack.com Events and Offers Stay up to date with NS events, subscription offers & updates. The Green Transition Weekly analysis of the shift to a new economy from the New Statesman's Spotlight on Policy team. Your email address Job title Job title\nAdministration / Office\nArts and Culture\nBoard Member\nBusiness / Corporate Services\nClient / Customer Services\nCommunications\nConstruction, Works, Engineering\nEducation, Curriculum and Teaching\nEnvironment, Conservation and NRM\nFacility / Grounds Management and Maintenance\nFinance Management\nHealth - Medical and Nursing Management\nHR, Training and Organisational Development\nInformation and Communications Technology\nInformation Services, Statistics, Records, Archives\nInfrastructure Management - Transport, Utilities\nLegal Officers and Practitioners\nLibrarians and Library Management\nManagement\nMarketing\nOH&S, Risk Management\nOperations Management\nPlanning, Policy, Strategy\nPrinting, Design, Publishing, Web\nProjects, Programs and Advisors\nProperty, Assets and Fleet Management\nPublic Relations and Media\nPurchasing and Procurement\nQuality Management\nScience and Technical Research and Development\nSecurity and Law Enforcement\nService Delivery\nSport and Recreation\nTravel, Accommodation, Tourism\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\nTwo developments slowly changed attitudes towards Jews, real or imaginary. First, Israel’s decisive victory over Arab states in the 1967 Six Day War turned the country into a symbol of aggressive national force, which stood out as unique against the background of Western defeats through decolonisation. Second, the significant immigration of Muslim workers to Europe again increased the xenophobia there under the surface, and Israel’s harsh treatment of Palestinians living under occupation increasingly became a political model worthy of replication. The image of the strong, fighting Jew became popular in the eyes of conservatives and, at a later stage, in the eyes of a radical right wing that was growing more extreme.\nAt the same time, the long historical bond between Jews and the liberal or social left loosened. In the 1960s dreams of the revolution sparkled among the Jewish youth, but with the defeat of the radical left in the 1970s, some joined growing waves of conservatism. In fact, the movement of many Jewish intellectuals to the right was an accompanying factor in the retreat of the global left.\nThen came the horrors of 7 October. Hamas’ murderous attack shook Jews around the world. It was especially hard for Jews from the global left. On the one hand, you could no longer support the traditional argument, dating from Jean-Paul Sartre and Frantz Fanon, that defends the violence of the oppressed, and on the other hand it was hard to ignore the siege that Gaza’s residents have been living under, while at least half of them are descendants of refugees from the 1948 war.\nThe Israel Defense Forces’ (IDF) response against all Gaza residents has made it even harder to defend Israel, and to ­continue to only see in Israel a victim of immediate circumstance. In addition, the rise of Judeophobia among Islamists, seen against the rise of Islamophobia among right-wingers and centrists in Europe, has ­embarrassed left-wing Jews. They have been torn between their universal values and this ­intensifying mutual hatred.\nWhat is left for us is to turn to a wise Jew who expressed his view about the ongoing conflict when it had only begun. On 25 November 1929, after the terrible massacre of Hebron – when Arabs murdered 69 Jews following rumours that Jews were planning to seize the Temple Mount in Jerusalem – Albert Einstein wrote to Chaim Weizmann, the Zionist leader: “Should we be unable to find a way to honest cooperation and honest pacts with the Arabs, then we have learned absolutely nothing during our 2,000 years of suffering and deserve all that will come to us.”\nThis article is part of the series What It Means to Be Jewish Now.", "source_domain": "www.newstatesman.com", "text": null, "title": "Left-wing Jews are torn between their values and the intensifying conflict", "title_page": null, "title_rss": null, "url": "https://www.newstatesman.com/ideas/2023/11/shlomo-sand-left-wing-jews-values-conflict"}