{"authors": ["Harriet Alexander", "Noa Halff For Dailymail.Com"], "date_download": "2024-02-05 15:33:20", "date_modify": "None", "date_publish": "2023-11-29 05:47:03", "description": "Gigi Hadid on Tuesday apologized for a now-deleted Instagram post at the weekend, in which she said Israel 'the only country in the world that keeps children as prisoners of war'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12803207%2Fgigi-hadid-instagram-israel-palestine-child-prisoners-war.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/29/05/78358941-0-image-m-48_1701235890038.jpg", "language": "en", "localpath": null, "maintext": "Gigi Hadid has backtracked after sharing claims on Instagram that Israel is 'the only country in the world that keeps children as prisoners of war' - a post she illustrated with a boy who, as a 13-year-old, went on a stabbing rampage in Jerusalem.\nHadid's post accused Israel of the 'abduction, rape, humiliation, torture, murder of Palestinians'.\nOn Tuesday, after a backlash against her post, the model - whose father is Palestinian, and last month likened Israelis to Nazis - apologized for her 'mistake', which she said was careless.\n'It is important to me to share real stories about the hardships that Palestinians have endured and continue to endure, but this weekend I shared something that I did not fact check or think deeply about prior to reposting,' she wrote.\nShe said she 'wanted to show the ways in which international law is being violated by the Israeli government', and said that a Palestinian child arrested by the Israeli Defense Forces (IDF) would be treated differently than an Israeli child stopped by the IDF.\nGigi Hadid, known for her controversial anti-Israel activism, falsely claimed that Israel is the only country keeping children as prisoners of war\nGigi Hadid, 28, seen on Tuesday heading to Al-Ajami, a Lebanese restaurant in Paris\n'Unfortunately, I used the wrong example to make that point, and I regret that,' she said.\nThe 28-year-old, who has been the face of Maybelline and is currently fronting Versace's campaigns, said she condemned violence against all people.\n'To want freedom and humane treatment for Palestinians and to want safety for Jewish people can both be important to the same person - including myself,' she said.\nBut she then switched to accusing Israel of human rights abuses, and emphasized years of abuse by Israel. She did not reference the October 7 terror attack, or the current hostage situation.\nHadid, who has frequently courted controversy with her incendiary anti-Israel posts, pled for forgiveness from her 80 million followers.\n'I understand that with the power of my platform comes a huge responsibility,' she said.\n'I'm human and I make mistakes. But I also hold myself accountable for those mistakes.'\nHadid also posted a reel to her Instagram story that claimed Israelis harvest the organs of dead Palestinians. The video was filmed by Malihai Henacho, a TikTok make-up artist from Cardiff who has been advocating for Palestinians since the beginning of the conflict. It was shared on an account run by a user called Umme_Murtazaa\nHadid posted a photo on Instagram falsely portraying Palestinian terrorist Ahmed Manasra as a 'child prisoner of war'\nIn the since-removed post, Hadid shared a photo of Ahmed, who was imprisoned for going on a stabbing rampage in Jerusalem back in 2015\nDisturbing footage released by police at the time shows the then-13-year-old knife-wielding Ahmed and his cousin, Hassan Manasra, 15, chasing after Israelis on the street as the innocent civilians run away\nManasra, the 'prisoner of war' she promoted, proudly claimed after his attack: 'I came here with my cousin to stab Jews.'\nDisturbing footage released by police at the time shows the then-13-year-old knife-wielding Ahmed and his cousin, Hassan Manasra, 15, chasing after Israelis on the street as the civilians run away.\nThey critically stabbed a 13-year-old boy on a bicycle, who was leaving a candy shop.\nHadid claimed the Ahmed was 'abducted' by the 'Israeli occupation' at 12.\nAhmed was 13 at the time, and was not abducted but arrested and prosecuted for attempted murder.\nHe was sentenced to nine and a half years in prison.\nWhile in prison, he attempted to harm himself and others multiple times.\nHadid's post received immediate backlash and has since been taken down.\nThe post received criticism for spreading false information and increasing antisemitism. Users condemned her, with one calling her a 'social media terrorist' and another suggesting that the Hadid family move to Gaza.\nOne wrote: 'She's a social media terrorist and should be punished for spreading false information that increases antisemitism.'\nAnother commented: 'The entire Hadid family have blood on their hands.'\n'Why doesn't the Hadid family move to Gaza? Yalla,' a third user wrote.\nAhmad was convicted of attempted murder and sentenced to nine and a half years in prison. While in prison, he attempted to harm himself and others multiple times - he's pictured here running with Hassan\nIn stills from the footage from Ahmed and Hassan's rampage the boys can be see running\nThe post received criticism for spreading false information and increasing antisemitism\nThis is not the first time Hadid was blasted for her anti-Israel posts.\nHadid was slammed by the Israeli government after she posted in support of the Palestinian people on her Instagram story in October, only weeks after the October 7 terror attack.\nHadid, whose famous real-estate developer father Mohamed Hadid, is Palestinian, posted a graphic about the war that read: 'There is nothing Jewish about the Israeli government's treatment of Palestinians.'\n'Condemning the Israeli government is not anti-Semitic and supporting Palestinians is not supporting Hamas.'\nIsrael's government quickly skewered Hadid's position, posting on their Instagram story a response that read: 'There is nothing valiant about Hamas' massacre of Israelis.\n'Condemning Hamas for what it is (ISIS) is not anti-Palestine and supporting Israelis in their fight against barbaric terrorists is the right thing to do.'\nThe account then directed comments at Hadid specifically, tagging her account and writing: 'Have you been sleeping the past week?\n'Or you just fine turning a blind eye to Jewish babies being butchered in their homes?\n'Your silence has been very clear about where you stand. We see you.'\nHadid previously shared this post, which angered the Israeli government", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Gigi Hadid backtracks on claims Israel is 'raping and torturing' Palestinians as she ADMITS she failed to 'fact check' inflammatory post - amid mounting pressure on modeling agency to cut ties", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12803207/gigi-hadid-instagram-israel-palestine-child-prisoners-war.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}