{"authors": [], "date_download": "2024-02-05 15:33:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "An Israeli-linked ship was hijacked in the Gulf of Aden, off the coast of Yemen, the vessel management said on Sunday.", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274046117%2Fsecond-israeli-linked-ship-hijacked-off-yemen-coast.json", "image_url": "https://cdn.bignewsnetwork.com/ani1701034016.jpg", "language": "en", "localpath": null, "maintext": "Tel Aviv [Israel], November 27 (ANI/TPS): An Israeli-linked ship was hijacked in the Gulf of Aden, off the coast of Yemen, the vessel's management said on Sunday.\n\"Our priority is the safety of our 22 crew members onboard,\" Zodiac said in a statement.\n\"The Turkish-captained vessel has a multinational crew consisting of a crew of Russian, Vietnamese, Bulgarian, Indian, Georgian and Filipino nationals. The vessel is carrying a full cargo of phosphoric acid,\" added the company.\nGlobal maritime risk management firm Ambrey said that it appeared that \"U.S. naval forces are engaged in the situation and have asked vessels to stay clear of the area.\"It wasn't immediately clear who was behind the suspected hijacking. Aden is held by forces allied to Yemen's internationally recognized government and a Saudi-led coalition fighting Yemen's Iranian-backed Houthi rebels.\nOn Friday, an Iranian drone attacked an Israeli-owned commercial vessel in the Indian Ocean.\nThe attack on the CMA CGM Symi container ship came a week after Houthi rebels hijacked an Israeli-linked ship in the Red Sea. On Nov. 19, the Israel Defense Forces confirmed that the Houthis hijacked the Bahaman-flagged Galaxy Leader vehicle carrier, calling it a \"very grave incident of global consequence.\"\"The ship departed Turkey on its way to India, staffed by civilians of various nationalities, not including Israelis. It is not an Israeli ship,\" the military added. The Galaxy Leader is registered by a British company partially owned by Israeli tycoon Abraham Ungar.\n\"This is another act of Iranian terrorism and constitutes a leap forward in Iran's aggression against the citizens of the free world, with international consequences regarding the security of the global shipping lanes,\" the Prime Minister's Office in Jerusalem said. (ANI/TPS)", "source_domain": "www.britainnews.net", "text": null, "title": "Second Israeli-linked ship hijacked off Yemen coast", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274046117/second-israeli-linked-ship-hijacked-off-yemen-coast"}