{"authors": ["Jason Burke", "Julian Borger"], "date_download": "2024-02-05 15:33:26", "date_modify": "None", "date_publish": "2023-11-29 21:35:10", "description": "Ten Israelis, two Russian citizens and four Thais have been handed over to the Red Cross in Gaza, according to the Israeli military", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F29%2Flatest-group-of-hostages-to-be-freed-amid-intense-efforts-to-extend-gaza-truce.json", "image_url": "https://i.guim.co.uk/img/media/8b80542ddf9c78814632e47778a6b40bb95dc79e/302_17_1345_807/master/1345.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bd6a8fda57bb897c344017a4553a7d2a", "language": "en", "localpath": null, "maintext": "Sixteen hostages have been released from captivity in Gaza, the Israeli military said, as diplomatic efforts continued to extend the truce further to allow for more exchanges.\nThe Israel Defense Forces (IDF) said late on Wednesday evening that two hostages with Russian citizenship had crossed into Egypt.\nLater on Wednesday night, Israeli military radio said that 10 Israelis and four Thais had been handed over to the Red Cross in Gaza. The group included dual citizens with US, German and German nationality, Qatar said.\nThe releases came as 30 Palestinian prisoners were freed overnight, Israeli prison authorities said.\n“During the night, 30 male and female security prisoners were released from a number of prison facilities,” the country’s prison service said in a statement.\nThe release included well-known activist Ahed Tamimi.\nThe first two Israeli hostages released were Yelena Trupanob, 50, and her mother, Irena Tati, a doctor aged 73, both Russian-Israelis who Hamas said had been released outside the framework of the Hamas-Israeli hostage deal, as a “tribute” to Vladimir Putin.\nThe other 10 Israeli hostages (five women and five children) were freed under a two-day extension to a ceasefire deal agreed last week. Thirty Palestinian prisoners were due to be freed from Israeli jails in return.\nJoe Biden said the released hostages included an Israeli-American woman, Liat Beinin, 49, and said he had spoken to her mother and father.\n“They’re very appreciative and things are moving well,” he told reporters before boarding Air Force One to return to Washington. “She’ll soon be home with her three children,” he said.\nThe Palestinian Islamic Jihad (PIJ) movement said earlier it had handed over several civilian hostages as part of an exchange deal, an apparent confirmation that not all the estimated 240 hostages seized in the 7 October raid into Israel were being held by Hamas.\nView image in fullscreen A Thai national leaving the Shamir hospital in Ramle, Israel on 29 November after being released from Hamas custody. Photograph: Maya Levin/AP\nHamas also informed Israeli authorities that three of the hostages had been killed earlier in Israeli bombing of Gaza, naming them as Shiri Bibas, 32, and her two sons: four-year-old Ariel and Kfir, a 10-month-old baby. The IDF said it was investigating the claim about the Bibas family and accused Hamas of behaving in a “cruel and inhuman manner”. There was no independent verification of the claim and previous similar claims have proved unfounded.\nThe family were being held by a Palestinian faction other than Hamas, IDF spokesperson Daniel Hagari said in a briefing a few days ago.\nIsrael said on Wednesday that about 160 hostages are still held in Gaza. Of those, 126 are men and 35 are women. Four are under the age of 18, and 10 over the age of 75.\nA total of 60 Israelis have been freed under the truce. Another 21 hostages – 19 Thais, one Filipino and one Russian-Israeli – have been released in separate negotiations since the truce began. Before the ceasefire, Hamas released four hostages, and the Israeli army rescued one, a female soldier. Two others were found dead in Gaza.\nThe directors of the CIA and the Mossad, William Burns and David Barnea, have spent a second day in Doha in talks with the Qatari government aimed at stretching the truce further. The Egyptian spy chief, Abbas Kamel, is also reported to be taking part in the discussions. Hamas has reportedly indicated that it is ready for a four-day extension – that would take the pause in fighting through to Monday.\n“We are hopeful that within a couple of hours we will have the release of the final batch [of hostages] but also we will be able to announce an extension,” the spokesperson for the Qatari foreign ministry, Majed Al-Ansari, told CNN. “We are very optimistic that we will have good news to share today.”\nThe US secretary of state, Antony Blinken arrived in Israel early on Thursday, to try to convince the government of Benjamin Netanyahu to agree to an extension and to keep up the flow of humanitarian aid across the border from Egypt into Gaza.\n“We’ll discuss with Israel how it can achieve its objective of ensuring that the terrorist attacks of 7 October never happen again, while sustaining and increasing humanitarian assistance – and minimising further suffering and casualties among Palestinian civilians,” Blinken told reporters in Brussels.\nBlinken arrived in Tel Aviv when tension is rising between the US and Israel over the conduct of the war and a strategic plan for what should come after. Washington has made it clear it does not want to see the blanket bombing of residential districts carried out in northern Gaza repeated in the south, during the next phase of the military campaign.\nThe two governments are also at odds over who should run Gaza after the war, with Joe Biden advocating Palestinian Authority rule as a step towards the creation of a Palestinian state. Blinken is due to visit Ramallah in the West Bank to talk to the Palestinian Authority president, Mahmoud Abbas, and other leaders, in a show of recognition.\nNetanyahu has said Israeli forces would indefinitely retain control over security in Gaza and has reassured his rightwing cabinet that he remains adamantly opposed to an independent Palestine as part of a two-state solution.\nThe prime minister made clear he had no intention of considering a more lasting ceasefire. “After this phase of returning our abductees is exhausted, will Israel return to fighting? So my answer is an unequivocal yes,” Netanyahu said on Wednesday. “There is no way we are not going back to fighting until the end.”\nThe IDF also said its chief of staff, Lt Gen Herzi Halevi, had “approved the attack plans for the continuation of the campaign”, showing him inspecting maps with his commanders.\n“We know what needs to be done, and are ready for the next step,” Halevi said.\nIn the latest of a series of warnings to the Israelis on the next phase in the Gaza offensive, the head of the US Agency for International Development, Samantha Power, said that Biden was intensely focused on civilian casualties, reminding the IDF “there are no law-free zones in war”.\n“President Biden, who has been a kind of humanitarian desk officer from the beginning of this conflict, again, increasing these supplies in – he’s also extremely focused on civilian protection, on the fact that civilians need to be accounted for as this next phase of the military campaign begins … to the need to have spaces in the south like hospitals, like UN shelters, that are zones where civilians can gather and know that they will not suffer bombardment,” Power told CNN.\n“And so these are the very, very detailed conversations that are going on. There is receptivity to this message. But again, the planning is key, applying the lessons of the conflict in the north to the conduct of warfare in the south is absolutely critical because, again, civilians must be protected. There are no law-free zones in war.”\nThere was more violence on the occupied West Bank, with continuing Israeli military raids and large numbers of detentions.\nPalestinian officials reported the deaths of two boys, who they said were shot in the northern West Bank town of Jenin by Israeli soldiers. Local journalists said the boys were aged eight and 14.\nThe Israeli military spokesperson said troops had fired on people who threw explosives at them, but did not specify whether that referred to the boys. The IDF claimed separately it had also killed two adult “terrorist commanders” during the raid on Jenin.", "source_domain": "www.theguardian.com", "text": null, "title": "Hamas releases 16 more hostages amid intense efforts to extend Gaza truce", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/29/latest-group-of-hostages-to-be-freed-amid-intense-efforts-to-extend-gaza-truce"}