{"authors": ["Jonathan Yerushalmy", "Léonie Chao-Fong", "Richard Luscombe", "Martin Belam", "Helen Livingstone"], "date_download": "2024-02-05 15:33:28", "date_modify": "None", "date_publish": "2023-11-29 04:26:01", "description": "Israel says Palestinians have been freed after nine women, a child and two foreign nationals were handed to the Red Cross", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F28%2Fisrael-hamas-war-live-updates-hostages-palestinians-released-gaza-ceasefire-extended.json", "image_url": "https://i.guim.co.uk/img/media/37ddc97d8b268bd45ead7ee594fa683c55d640dd/119_0_3437_2064/master/3437.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=ba78d3916bcdc08cac87e8ed90ab2c4f", "language": "en", "localpath": null, "maintext": "From 28 Nov 2023 21.01 CET Israel frees 30 Palestinian prisoners The Israel Prison Service has said it released 30 Palestinians from Israeli jails late on Tuesday in a fifth swap under a truce deal with Gaza’s Hamas militants. In a statement, the prison service said the 30 Palestinians were released from Ofer Prison, near Ramallah in the occupied West Bank, and from a detention centre in Jerusalem. Qatar earlier said 15 women and 15 children would be released. Mediators are meeting in Qatar, meanwhile, to try to secure an extension of the five-day truce between Israel and Hamas that is set to expire on Wednesday.\nUpdated at 21.23 CET\n29 Nov 2023 04.43 CET Rebecca Ratcliffe Philippine president Ferdinand Marocs has said he is “very happy” to announce that Noralyn Babadilla is now safely back in Israel, adding that “all Filipinos affected by the war have been accounted for”.\nNoralyn, who was released on Tuesday, was the second Filipino to be released by Hamas. Filipino caregiver Gelienor “Jimmy” Pacheco was among the group of hostages released on the first day of the temporary truce. Marcos said in a statement: “We extend our sincerest gratitude to Israeli authorities for facilitating Noralyn’s release, and for all ongoing assistance to Filipinos in Israel. Our gratitude also goes to Egypt and the State of Qatar for their crucial role in this process over the past several weeks.” About 30,000 Filipinos work in Israel, mainly in the care sector. Most live away from the conflict areas.\n29 Nov 2023 04.25 CET Israeli military raid West Bank city of Jenin - reports There are reports that parts of the city of Jenin, in the West Bank, have been closed off with checkpoints set up at routes into the city. Al Jazeera says that armed clashes between Israeli troops and Palestinian fighters have taken place, with at least eight people injured. They report that hundreds of Israeli troops have taken part in the raid, supported by more than 50 armoured vehicles. The Palestinian Red Crescent has said that one of its medical teams was detained by Israeli troops outside a Jenin hospital, preventing them from transferring a patient with a gunshot wound in the leg to the hospital. They later said that the patient was arrested. Christos Christou, the international president of Médecins Sans Frontières, is in Jenin and says that the Israeli army “conducted an incursion on Jenin refugee camp.” In a video posted to X, he says that he has been trapped in the Khalil Suleiman hospital for more than two hours, while Israeli forces “operated in Jenin camp”. I’m in #Jenin, the West Bank, #Palestine, where I was just visiting the @MSF team at the Khalil Suleiman hospital. While we were there, the Israeli army conducted an incursion on Jenin refugee camp. pic.twitter.com/RNF8JGdf8I — Christos Christou (@DrChristou) November 28, 2023\n29 Nov 2023 04.08 CET List of hostages to be freed on Wednesday released - reports Israeli media are reporting that Benjamin Netanyahu’s office has received a list with the names of the Israeli hostages that Hamas intends to release on Wednesday, the sixth group of hostages to be freed as part of the temporary truce. The families of those on the list have reportedly been informed.\n29 Nov 2023 03.39 CET Jason Burke The chances of the truce being extended much beyond 10 days appear slim, analysts say. One reason is that both sides are running out of hostages or prisoners whom they can free relatively painlessly. The Palestinians released from Israeli jails so far are mainly women and children. So, too, are the hostages freed by Hamas in Gaza. In the brutal calculations of such things, neither category includes “high value” individuals. Among the hostages, these would include military personnel. Among the prisoners, it may mean high-profile political leaders, those accused of very serious crimes and others thought to endanger Israel’s security. One possibility is that the current ceasefire could be extended to include elderly and sick people among the remaining 180 or so hostages and the thousands of Palestinians in Israeli jails. But that would postpone, not prevent, the coming trial of strength. Nour Odeh, an analyst and commentator based in Ramallah, said that phase 2 would not be a continuation of phase 1. “[This] is when we get into the hardball. The civilian hostages is one thing, but the soldiers is another. Hamas have said all along they want ‘all for all’ [all the hostages for all the prisoners in Israel] but I don’t think [Benjamin] Netanyahu will accept such a high price.” She added: “The likelihood of a resumption of bombardment and also a ground offensive in the south [of Gaza] continues to loom large.” To reconcile the apparently conflicting goals of freeing the hostages and “crushing” Hamas, Israeli officials and many analysts say military pressure is the only way to force the organisation to make concessions – despite the cost in civilian life and harm to Israel’s international reputation. Hostage talks show a battered Hamas is far from down and out Read more\n29 Nov 2023 03.19 CET Egyptian media reports that a preliminary understanding has been reached to extend the truce Egypt’s Al-Araby Al-Jadeed newspaper is reporting that a preliminary understanding has been reached to extend the truce for two more days, under the same conditions that are currently being observed. The paper has quoted Egyptian officials as its source. Israeli officials confirmed to the Haaretz newspaper that the proposal was being examined, but has not yet been confirmed. Haaretz reports an Israeli source as saying the agreement on an extension depended on whether Hamas is able to release 10 additional Israeli hostages a day. As we reported earlier, with fewer women and children remaining in captivity extending the truce may require Hamas to free at least some Israeli men for the first time.\n29 Nov 2023 03.03 CET The AFP news agency has reported on the testimony of some of the recently freed Israeli hostages, who have detailed the conditions of their confinement. None of the hostages released under the truce have so far given any direct accounts of the conditions in which they were held and hospitals say they have been instructed to refrain from disclosing details. However some details are slowly surfacing from medical professionals treating them, while relatives are offering more dramatic accounts of mistreatment and hardship. Esther Yaeli, grandmother of 12-year-old French-Israeli boy Eitan Yahalomi, who was released on Monday, told the Walla news website he was held in solitary confinement for 16 days. “The days that he was alone were horrible,” she said. “Now Eitan appears very withdrawn.” His aunt, Deborah Cohen, said that Eitan suffered “horrors” at the hands of Hamas and described them as “monsters”. She told France’s BFM TV: “Hamas forced him to watch films of the horrors, the kind that no one wants to see, they forced him to watch them. Hagar Mizrahi, the head of the Israeli health ministry’s operations for returning hostages, told AFP that they had been held in “horrible conditions” and that “the medical consequences are pretty clear”. “Some of the things that I’ve heard in recent days are heart-wrenching,” she added, offering no specifics. “They’re simply outrageous in every way.” Ruti Munder, 78, said she was kept in a “suffocating” room and slept on plastic chairs with a sheet for nearly 50 days. In one of the first interviews with a freed hostage, Munder told Israel’s Channel 13 television that initially they ate “chicken with rice, all sorts of canned food and cheese”. They were given tea in the morning and evening, and the children were given sweets, but the food changed when “the economic situation was not good, and people were hungry”, she said.\n29 Nov 2023 02.37 CET Here’s where the temporary pause in fighting stands as Wednesday begins in the Middle East. Hamas and Israel are expected to release more hostages and prisoners today, the last day of the prolonged six-day truce. Israel has said the truce could be extended further, provided Hamas continues to free at least 10 Israeli hostages a day. But with fewer women and children remaining in captivity, that may require Hamas freeing at least some Israeli men for the first time. Attention now turns to Qatar which mediated indirect talks between Hamas and Israel that resulted in the ceasefire. On Tuesday, Qatar hosted spy chiefs from Israel’s Mossad and the United States’ CIA. The meeting sought to “build on the progress of the extended humanitarian pause agreement and to initiate further discussions about the next phase of a potential deal”, a source briefed on the visits told Reuters. The truce has brought Gaza its first respite after seven weeks of fighting and bombardment that has reduced much of the region to rubble. The temporary ceasefire has allowed about 800 aid trucks to enter Gaza and the first of three US planes with humanitarian supplies for Gaza landed in Egypt on Tuesday.\n29 Nov 2023 02.18 CET White House says Israel must avoid 'further displacement' of Palestinians in southern Gaza - reports The Biden administration has told Israel that it must work to avoid “significant further displacement” of Palestinian civilians in southern Gaza if it renews its ground campaign after the current pause in fighting, the AP news agency reported senior US officials as saying on Tuesday. Separately, White House national security council spokesperson John Kirby said the Israelis had been receptive when US officials have raised the issue. The White House, seeking to avoid more large-scale civilian casualties or mass displacement like that seen before the current temporary pause in the fighting, underscored to the Israelis that they must operate with far greater precision in southern Gaza than they did in the north, said officials who briefed reporters on condition of anonymity, according to AP. The White House has begun to put greater pressure on Israel that the manner of the coming campaign must be “carefully thought through,” AP reports. Kirby, told reporters separately, “Now you have an added population of hundreds of thousands more in the south that you didn’t have before [the Israelis] moved into Gaza City.” “And so it’s even all that more of an added burden on Israel to make sure … that they have properly accounted for … the extra innocent life that is now in south Gaza.” Israeli prime minister Benjamin Netanyahu has made clear that Israeli Defense Forces will eventually restart military operations after the conclusion of the current, temporary ceasefire. President Joe Biden has said he would like to see the pause – which has also allowed a surge of much-needed humanitarian aid to get into Gaza – continue as long as feasible.\n29 Nov 2023 02.04 CET Thai foreign minister Parnpree Bahiddha-Nukara has said he welcomes the release of two more Thai hostages that had been held by Hamas in Gaza. “Happy to personally welcome 2 additional Thai hostages just released and arrived at the hospital in Tel Aviv,” he posted on the social media platform X. Nineteen Thai hostages have so far been released, while the foreign ministry says 13 more remain in captivity. There were 39 Thai nationals killed in the 7 October attack by Hamas.\nUpdated at 02.36 CET\n29 Nov 2023 01.43 CET Here’s more of what we know about the 10 Israeli hostages released by Hamas on Tuesday. Ofelia Roitman, 77 View image in fullscreen Ofelia Roitman who was released Tuesday. Photograph: AP On 7 October, Roitman’s family lost contact with her shortly before 10am, while she was in her safe room. That evening, when soldiers inspected her house, they found no sign of a struggle, suggesting that the Argentinian national had been abducted. Her husband, hospitalised after a fall, was absent at the time of the attack. Ada Sagi, 74 View image in fullscreen Ada Sagi who was released Tuesday. Photograph: AP Sagi, who has lived alone in Nir Oz since her husband died of cancer, was abducted from her safe room. Her son Noam Sagi, who lives in London, had no news of his mother until he saw a video online of a stranger in his mother’s garden. Ada, who suffers from asthma, had been due to visit him to celebrate her 75th birthday. Noralin Agojo, 60 View image in fullscreen Noralin Agojo, a Philippines-born hostage taken from kibbutz Nirim. Photograph: handout Philippines-born Agojo was abducted from Nirim, where she was visiting friends on 7 October along with her partner Gideon Babani, who was killed in the attack. Before her capture, Agojo called her brother Exo and told him he might not see her again. Meirav Tal, 53 View image in fullscreen Meirav Tal who was released Tuesday. Photograph: AP Tal was freed after the release of her partner’s two children, Yagil and Or Yaakov, on Monday. Tal and the children’s father, Yair Yaakov, who remains in Gaza, were abducted when militants stormed their home in Nir Oz as they were hiding in a safe room. The children, who were staying with their mother, were taken into Gaza separately. Rimon Kirsht, 36 View image in fullscreen Rimon Kirsht who was released Tuesday. Photograph: AP Abducted from her home in Nirim, Kirsht was taken along with her partner, Yagev Buchstab, 34, who has not been released. Kirsht sent her mother a voice message at about 8:30am on 7 October, a relative told the media. The message ended with the sounds of militants shouting and firing shots. Hours later, when Israeli security forces asked residents of the community to gather, Kirsht and Buchstab were missing and their house was empty.\n29 Nov 2023 01.22 CET We’re getting more information on the Israeli hostages freed by Hamas on Tuesday. Ten Israeli women including a 17-year-old were released, Israeli officials said, as well as two Thai nationals. Their release was followed by the freeing of 30 Palestinian prisoners held in Israeli jails. Here’s what we know about some of the hostages released on Tuesday. Mia Leimberg, 17, her mother, Gabriela, 59, and aunt Clara Marman, 63 View image in fullscreen Mother and daughter Gabriela Leimberg, 59, and Mia Leimberg, 17. Photograph: Government Press Office/Reuters Mia, the youngest hostage released on Tuesday, her mother and aunt were all abducted from Nir Yitzhak kibbutz. Originally from Jerusalem, the Leimbergs were visiting Marman, Gabriela’s sister, when Nir Yitzhak was attacked on 7 October. Marman’s partner, Luis Har, and brother, Fernando Marman, were also taken hostage and remain in Gaza. Ditza Heiman, 84 View image in fullscreen Ditza Heiman, 84, who was released after being taken hostage during the 7 October attack on Israel. Photograph: Hostages And Missing Families Forum/Reuters The video of Heiman’s abduction in a car, alongside the testimony of a neighbour, was the only proof of life her family had until now. Living alone in Nir Oz kibbutz, the widow and former social worker had taken refuge in her safe room. When friends attempted to reach the great-grandmother on the day of the attack, her phone rang for hours, until someone speaking in Arabic answered at around 4pm. Tamar Metzger, 78 View image in fullscreen Tamar Metzger who was released on Tuesday. Photograph: AP Metzger, a mother-of-three, and her husband, Yoram, 80, were abducted from their home in Nir Oz. She was released without her husband.", "source_domain": "www.theguardian.com", "text": null, "title": "Israel says 30 Palestinians released after 12 hostages returned from Gaza - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/28/israel-hamas-war-live-updates-hostages-palestinians-released-gaza-ceasefire-extended"}