{"authors": ["Stephen Glover", "Stephen Glover For The Daily Mail"], "date_download": "2024-02-05 15:33:32", "date_modify": "None", "date_publish": "2023-11-29 21:48:25", "description": "STEPHEN GLOVER: the excesses of the past have surely been surpassed in recent weeks by our national broadcaster's shamefully one-sided coverage of the Israeli-Hamas conflict.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fdebate%2Farticle-12806911%2FSTEPHEN-GLOVER-charge-BBC-ignore-reporting-makes-Jews-Britain-feel-safe.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/29/21/78188819-0-Eight_UK_based_BBC_staff_wrote_a_2_300_word_letter_to_Al_Jazeera-a-20_1701294426519.jpg", "language": "en", "localpath": null, "maintext": "Over the years I've sometimes criticised the BBC over its political bias. Examples of Auntie's Left- leaning prejudices could fill many books.\nAnd, indeed, a former director-general of the BBC, Mark Thompson, has candidly admitted that when he joined the Corporation in 1979 there was 'a massive bias to the Left' in 'much of current affairs'.\nBut the excesses of the past have surely been surpassed in recent weeks by our national broadcaster's shamefully one-sided coverage of the Israeli-Hamas conflict. It can't even bring itself to describe an organisation that butchers women and children, and seizes hostages, as 'terrorists'.\nThe consequences of such imbalance will be harmful. I am particularly thinking of Britain's Jewish population, many of whom feel threatened in their own country. Some believe that the BBC's lack of impartiality has helped to inflame anti-Semitism.\nThere are so many egregious examples it's hard to know where to start. A good place is the blast at al-Ahli Hospital in Gaza on October 17 in which dozens of people including children were killed.\nEight UK-based BBC staff wrote a 2,300-word letter to Al Jazeera in which they claimed the corporation had failed to 'humanise Palestinian victims' of the war\nJeremy Bowen, the BBC's international editor, admitted that his coverage of the alleged bombing had been 'wrong', but added that he didn't 'regret one thing' about his reporting\nThe BBC at once suggested that the Israel Defense Forces (IDF) were responsible for the blast at al-Ahli hospital. Its reporter, Jon Donnison (pictured), said on BBC News within hours of the explosion that 'it's hard to see what else this could be'\nThe BBC at once suggested that the Israel Defense Forces (IDF) were responsible. Its reporter, Jon Donnison, said on BBC News within hours of the explosion that 'it's hard to see what else this could be'. Over on BBC1, veteran correspondent Jeremy Bowen offered a similar view, though in less forthright terms.\nOf course, it might have been the IDF. They have killed thousands of innocent people in Gaza, though not deliberately, during the war against Hamas. What was objectionable was the BBC's instant assumption, without a shred of evidence, that Israel was at fault, though it had immediately denied responsibility.\nEven worse was the Corporation's mealy-mouthed half-apology (it had been 'wrong to speculate') two days later. As for Jeremy Bowen's comments during a television interview a few days ago, they were utterly inexcusable.\nThe BBC's international editor admitted that his coverage of the alleged bombing had been 'wrong', but added that he didn't 'regret one thing' about his reporting.\nNot one thing? Not a sliver of self-reproach? Evidently not. The BBC propagated a damaging falsehood. President Joe Biden was forced to curtail his Middle Eastern tour because several Arab potentates were convinced that the IDF had killed children in a hospital, and refused to meet him. Enemies of Israel at home and abroad believed, and probably still believe, that mass murder had taken place.\nBut Jeremy Bowen 'doesn't regret one thing'. What kind of man is he? Is his truculence attributable to a belief that because he and the BBC mean well they can do no wrong? Or is he, deep down, anti-Israeli?\nBack in 2009, the BBC Trust found Bowen guilty of inaccuracy, though not of bias, after three complaints about his reporting on the Middle East. However, Auntie clearly thinks that this doesn't disqualify him from reporting — actually, he often simply offers his opinion — on Israel and Gaza.\nOn this occasion, the BBC's 'Executive Complaints Unit' has declined to uphold complaints about the BBC News Channel's coverage of the situation in Gaza, including the blast at the al-Ahli Hospital. That is unsurprising, given the organisation's habitual self-righteousness.\nThe BBC assumes it is always justified in its coverage of Israel. It seems not to trouble Auntie there are countless examples of her displaying palpable bias.\nA couple of weeks ago, a newsreader on BBC News Channel twice announced that Israeli forces were 'targeting medical staff and Arab speakers' at Gaza's largest hospital. Deliberately killing them, in other words. This smear was later retracted. The Beeb had wilfully misinterpreted a Reuters report.\nA man salvages objects amid the rubble of a school hit during an Israeli strike on the Gaza Strip\nMeanwhile, the BBC's diplomatic correspondent, Caroline Hawley, has written numerous posts on X about the 'terrifying' situation in Gaza, while sharing calls for a ceasefire. One analysis found that only 9 per cent of her 195 tweets and retweets until about ten days ago mentioned Israeli deaths, casualties or hostages.\nInstances of bias may often appear comparatively minor in themselves. Collectively, though, they become significant and betray a mindset that is consistently critical of Israel and sympathetic to Hamas.\nAn example is the BBC's invitation to Guz Khan, who has accused Israel of 'genocide', 'war crimes' and 'ethnic cleansing', to host BBC1's Have I Got News For You, which will be aired tomorrow. Why now? Isn't this crassly insensitive?\nThe Beeb also banned its staff from attending the march against anti-Semitism in London last weekend, invoking impartiality rules that employees 'should not participate in public demonstrations or gatherings about controversial issues'. Is it now considered controversial to profess opposition to anti-Semitism? BBC staff are allowed to go on Pride marches.\nIncidentally, on the subject of marches I'm sceptical about the figures the BBC uncritically produces. It suggested that last Saturday's pro-Palestinian march attracted 300,000 people, though some observers thought it smaller than in previous weeks. By contrast, last Sunday's march against anti-Semitism was reckoned by the BBC's website to have drawn only 'tens of thousands', despite its organisers claiming more than 100,000.\nAnd so it goes on. A more substantial current example of bias is the BBC's tendency to equate hostages released by Hamas with prisoners handed over by Israel. We are led to believe that a straightforward prisoner swap of very similar sorts of people is taking place.\nIn fact, those set free by the Israelis have been accused or found guilty of terror-related offences. The hostages let go by Hamas have obviously committed no crime. Their only mistake was to have been in southern Israel when Palestinian terrorists went on the rampage.\nGranted, the BBC isn't solely at fault. Sky News is another offender. Last week its presenter, Kay Burley, suggested to Israeli government spokesman Eylon Levy that a planned release of 150 Palestinian prisoners in exchange for just 50 hostages showed that 'Israel does not think that Palestinian lives are valued as highly as Israeli lives'. That's literally crazy.\nA protester at the March Against Anti-Semitism holds a placard that says 'BBC Muzzles Journalists' at Sunday's demonstration\nLast week former BBC television chief Danny Cohen said the BBC was 'fuelling antisemitism' by failing to refer to Hamas as terrorists\nBut the BBC's bias is more disquieting than that of Sky or others because the Corporation is vastly bigger and far more influential than any other media organisation. It is also our national broadcaster, over which licence-payers are supposed to be able to exert some control.\nI don't suggest that all its coverage of the Israel-Hamas conflict is biased. It is sometimes balanced. Auntie employs many good journalists who strive for impartiality. But I don't see how a fair-minded person could deny that much of the output is skewed.\nCan anything be done? Danny Cohen, a former head of BBC Television who is Jewish, has proposed an independent review of the Corporation's coverage of the conflict. It is a very hopeful suggestion from someone who knows the BBC well, and must have observed that in recent weeks its director-general, Tim Davie, has continued, preposterously, to maintain that it is impartial.\nBut this time, something must be done. Favouring the Left over the Right is what the BBC does. We complain — and nothing changes. It's serious, but it's the way things are.\nNow it's worse. Fellow Britons who are Jewish believe that the prejudices of our national broadcaster are making it more difficult for them to live in their own country. This is a grave charge, which the BBC cannot in good conscience ignore", "source_domain": "www.dailymail.co.uk", "text": null, "title": "STEPHEN GLOVER: It's a charge the BBC can't ignore - That its reporting makes Jews in Britain feel less safe", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/debate/article-12806911/STEPHEN-GLOVER-charge-BBC-ignore-reporting-makes-Jews-Britain-feel-safe.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}