{"authors": ["Josh Boswell", "Chris Sharp", "Matt Ford For Dailymail.Com"], "date_download": "2024-02-05 15:33:33", "date_modify": "None", "date_publish": "2023-11-28 14:26:37", "description": "The Office of Global Access (OGA)- a wing of the CIA - has played a central role in collecting alien spacecraft since 2003, sources tell DailyMail.com.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12796167%2FCIA-secret-office-UFO-retrieval-missions-whistleblowers.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/27/18/78286097-0-image-a-37_1701109292252.jpg", "language": "en", "localpath": null, "maintext": "A secretive CIA office has been coordinating the retrieval of crashed UFOs around the world for decades, multiple sources told DailyMail.com.\nOne source said that at least nine apparent 'non-human craft' have been recovered by the US government – some wrecked from a crash, and two completely intact.\nThree sources briefed on those alleged top secret operations told DailyMail.com that the Office of Global Access (OGA), a wing of the Central Intelligence Agency's Science and Technology Directorate, has played a central role since 2003 in orchestrating the collection of what could be alien spacecraft.\nThe three sources, who spoke on condition of anonymity to avoid reprisals, have all been briefed by individuals involved in those alleged UFO retrieval missions.\nThough the shocking claims sound like they come from a science fiction novel, they are part of a growing body of evidence suggesting the US government could indeed be hiding advanced vehicles that were not made by humans.\nThe Office of Global Access - a wing of the CIA - has played a central role in collecting alien spacecraft since 2003, sources tell DailyMail.com\nDavid Grusch - a former high-ranking intelligence official – is one of three military whistleblowers who testified under oath about UFOs. Grusch claims he has evidence of secret programs involving technology far surpassing the US's capabilities\nIn July Senate Majority Leader Chuck Schumer co-sponsored a bill to allow disclosure of 'recovered technologies of unknown origin and biological evidence of non-human intelligence'\nFormer top intelligence officer David Grusch told Congress as much in an explosive public hearing in July.\nThe same month, Senate Majority Leader Chuck Schumer sponsored an extraordinary bill to allow disclosure of 'recovered technologies of unknown origin and biological evidence of non-human intelligence' – which has now passed in the Senate.\nSources who spoke to DailyMail.com shed light on how the CIA has allegedly coordinated the secret recovery and storage of these alleged crashed or landed UFOs.\nLate CIA expert Jeffrey Richelson wrote in his 2016 book, The US Intelligence Community, that the Office of Global Access helped provide 'worldwide collection capability'\n'There's at least nine vehicles. There were different circumstances for different ones,' one source briefed by UFO program insiders told DailyMail.com. 'It has to do with the physical condition they're in. If it crashes, there's a lot of damage done. Others, two of them, are completely intact.'\nThe source said the CIA has a 'system in place that can discern UFOs while they're still cloaked,' and that if the 'non-human' craft land, crash or are brought down to earth, special military units are sent to try to salvage the wreckage.\nAnother source with knowledge of the OGA's role said that they specialize in allowing the US military to secretly access areas around the world where they would usually be 'denied' – for example behind enemy lines.\n'They are basically a facilitator for people to get in and out of countries,' the source said. 'They are very clever at being able to get anywhere in the world they want to.'\nMultiple sources briefed on the OGA's activities told DailyMail.com that most of its operations involve more conventional retrieval missions, such as stray nuclear weapons, downed satellites or adversaries' technology.\nBut they claimed some missions coordinated by the OGA have involved retrieval of UFOs.\n'The task at hand is simply to get it into custody and protect the secrecy of it,' one source said. 'The actual physical retrieval is by the military. But it's not kept under military control, because they have to keep too many records. So they start moving it out fairly quickly into private hands.'\nDocuments published by the National Archives and Records Administration (NARA) in December 2016 showed that the OGA was one of 56 offices in the CIA, with its chief and deputy making up two of a total 286 director-level officials in the spy agency.\nAn unclassified organizational chart published by the CIA in October 2015 lists the OGA among nine offices in the 'Science and Technology' wing of the agency.\nLate CIA expert Jeffrey Richelson wrote in a 2016 book on the agency that the OGA was established in 2003, and cited a CIA description that it 'integrate[s] analysis, technology, and tradecraft to attack the most difficult targets, and to provide worldwide collection capability.'\nDoug Wolfe helped set up the CIA's Office of Global Access in 2003 and served as its deputy director. He managed 'unwarned access programs that deliver intelligence from the most challenging denied areas' according to a short biography published by a conference he attended in 2017\nSchumer's bill requires all government agencies to turn over evidence of any 'recovered technologies of unknown origin and biological evidence of non-human intelligence' to a panel of experts, who can then choose to make the information public\nOne source claimed at least nine 'non-human craft' have been recovered by the US government – some wrecked from a crash, and two completely intact. A 3D rendering of a UFO\nA 255-word biography of former OGA deputy director Doug Wolfe, published by an aerospace conference in 2017, says that he 'helped start the Office of Global Access'.\nWolfe's bio cryptically adds that he 'was responsible for leading and managing strategic, unwarned access programs that deliver intelligence from the most challenging denied areas' and 'served as program manager with responsibility for the end-to-end system acquisition of an innovative new source and method for the IC [Intelligence Community].'\nTwo sources told DailyMail.com that the OGA coordinates with Special Operations Forces such as SEAL teams or Delta Force under the Pentagon's Joint Special Operations Command (JSOC), or nuclear weapons experts such as the Nuclear Emergency Support Team (NEST), to collect the crashed or landed craft.\nBut another source, who has briefed members of Congress on alleged crash retrievals, said that NEST had not been involved in any of these operations.\nA spokesperson for the agency also denied involvement.\n'[NEST] personnel encounter materials from unknown origins on a regular basis,' a spokesperson said. 'In fact, one of NEST's missions is to help determine the origin of nuclear material interdicted outside of regulatory control or used in a nuclear device.\n'During its operations, NEST has never encountered any material related to UAP.'\nIn a written statement, a JSOC spokesperson told DailyMail.com: 'We have nothing for you on this.'\nA former SEAL team member told DailyMail.com that they had been on operations coordinated by the CIA to retrieve high-value stray enemy weapons, and that they knew of colleagues who had been on similar operations where they recovered technology that appeared highly advanced – though not necessarily out-of-this-world.\n'Absolutely that happens,' the ex-SEAL said. 'Even ordinance or a weapon that we've never seen, we recover and bring it back.'\nOne source said that the Air Force Special Operations Command's 24th Special Tactics Squadron, based at Pope Field Army Airbase in North Carolina, has also been involved in securing areas for UFO crash retrievals.\nSources said the CIA office then often hands the wreckage or material over to private aerospace contractors for analysis, where it is not subject to rigorous government audits and can be shielded with protections for trade secrets.\n'The CIA is the portfolio manager or owner of the UAP [Unidentified Anomalous Phenomena] crash retrieval operation,' one source, who has shared their information with Congress, told DailyMail.com.\n'The Department of Energy national labs are materials analysis contractors whenever recovered radioisotopes are involved but not always just radioisotope materials. The aerospace-defense industry are also contractors that specifically do not handle any recovered radioisotopes, but they handle the other non-radioactive material – and intact craft.'\nMultiple sources said that many of the people involved in these programs may not even realize they are dealing with non-human craft, due to the intense security and compartmentalization of information in such top secret programs.\nUFO whistleblower David Grusch appeared on the Joe Rogan Experience podcast on Wednesday, repeating his claims of a secret US government program that is hiding crashed 'non-human' UFOs\nIn an interview on Wednesday with podcaster Joe Rogan, whistleblower David Grusch gave an example of engineers in the Manhattan Project of the 1940s not realizing they were working on fuses for the atom bomb that would eventually be dropped on Japan.\nLate Senate Majority Leader Harry Reid told the New Yorker in 2021 that top defense company Lockheed Martin was one of the private contractors holding potentially alien wreckage.\n'I was told for decades that Lockheed had some of these retrieved materials,' he said.\nAs majority leader, Reid was one of the 'Gang of Eight', a select group of top lawmakers given access to the country's most closely held secrets too sensitive to share widely in Congress.\nBut even he was denied access to these alleged programs, he told the magazine.\n'I tried to get, as I recall, a classified approval by the Pentagon to have me go look at the stuff. They would not approve that. I don't know what all the numbers were, what kind of classification it was, but they would not give that to me.'\nReid helped set up a new UFO investigation office in the Pentagon in 2008 to probe the regular encounters US military pilots and other armed forces members had with strange objects in the sky and sea.\nIn June, former top intelligence officer Grusch came forward with claims that while working for the Pentagon's UFO office he discovered the US had a secret program trying to glean new technology from multiple 'non-human' craft it had obtained, dating as far back as the 1930s.\nThe former National Reconnaissance Office staffer's claims were deemed 'urgent and credible' by the Intelligence Community Inspector General, whom Grusch says he gave documents evidencing his story, and introduced to around 40 witnesses involved in the alleged 'reverse engineering' UFO programs in July 2021.\nThe OGA is one of 56 offices in the CIA, according to documents published by the National Archives in 2016\nThe Office of Global Access sits inside the CIA's directorate of Science and Technology, one of five directorates at the agency according to a 2015 unclassified organizational chart\nEarlier this year Senate Intelligence Committee ranking member Marco Rubio told TV news station NewsNation that he had spoken to some of these 'first-hand' program insiders, who allegedly worked to glean new technology from potentially alien captured craft.\n'There are people that have come forward to share information with our committee over the last couple of years,' Rubio said in the June 26 interview.\n'Some of these people still work in the government. A lot of them are very fearful. Fearful for their jobs, fearful for their clearances, fearful of their career. Some of them are fearful of harm coming to them.\n'Most of these people, at some point or maybe even currently, have held very high clearances and high positions within our government.\n'Some of these claims are things that are beyond the realm of what any of us has ever dealt with.\n'If it's even partially true, then somebody's broken the law. There's been some violations. Because these things have to be disclosed to Congress.'\nTop lawmakers appear to be taking seriously the claims of UFOs hidden in secret bunkers.\nSenate leader Schumer co-sponsored a bill to create a review board with presidential-level powers, with the aim of uncovering and disclosing any non-human craft or even bodies, held by the US government.\nEarlier this year Senate Intelligence Committee ranking member Marco Rubio said that he had spoken to some of these 'first-hand' program insiders, who allegedly worked to glean new technology from potentially alien captured craft\nSenate leader Schumer co-sponsored a bill to create a review board with presidential-level powers, with the aim of uncovering and disclosing any non-human craft or even bodies, held by the US government\nIt requires all government agencies to turn over evidence of any 'recovered technologies of unknown origin and biological evidence of non-human intelligence' to a panel of experts, who can then choose to make the information public.\nThe Senate has voted in favor of Schumer's bill. If passed in the House of Representatives, it will be added as an amendment to the annual military spending bill for 2024.\n'The American public has a right to learn about technologies of unknown origins, non-human intelligence, and unexplainable phenomena,' Schumer said in a July press release announcing the amendment.\nMissouri Republican congressman Eric Burlison, part of an informal caucus of lawmakers campaigning for greater transparency on UFOs, told DailyMail.com that the sources' claims gave him and his colleagues a lead to follow in their investigations.\n'These are the kind of specific programs we've been trying to get the names of,' he said. 'It's been so difficult because we can't get that information with specifics from Grusch or from the [Intelligence Community] Inspector General.\n'I can't confirm it's true. But it certainly gives us a trail to follow.\n'I think that if it does exist, even if they give us no information beyond that, I think we owe it to the world to disclose that.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "EXCLUSIVE: CIA's secret office has conducted UFO retrieval missions on at least NINE crash sites around the world, whistleblowers reveal", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12796167/CIA-secret-office-UFO-retrieval-missions-whistleblowers.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}