{"authors": [], "date_download": "2024-02-05 15:33:35", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The vessel is owned by a billionaire with historical links to Israeli intelligence operations, according to reports\r\n\r\n\r\nA Maltese-flagged cont", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274045296%2Fisraeli-owned-ship-attacked-by-suspected-iranian-drone-ap.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1700936038.jpg", "language": "en", "localpath": null, "maintext": "The vessel is owned by a billionaire with historical links to Israeli intelligence operations, according to reports\nA Maltese-flagged container ship owned by one of Israel's wealthiest individuals was targeted in the Indian Ocean on Friday in a suspected Iranian drone attack, Associated Press (AP) said on Saturday, citing a US defense official who remains anonymous.\nFriday's attack on the vessel CMA CGM Symi, which comes amid increasing threats to regional shipping routes during Israel's war with the Palestinian militant group Hamas, occurred in international waters, AP reported. The strike was conducted shortly before Friday's start of the four-day ceasefire in the besieged Gaza enclave, to facilitate a prisoner-hostage exchange and the supply of humanitarian aid, according to the Arab news channel Al-Mayadeen.\nThe unnamed US official also told AP that a suspected Shahed-136 drone damaged the ship but did not cause injury to any of the crew. \"We continue to monitor the situation closely,\" the official told the news agency, declining to reveal why US intelligence believe Iran is responsible.\nThe ship had turned off its Automatic Identification System (AIS) tracker in advance of the attack, AP said, citing maritime data viewed by the news agency - a measure commonly taken by crew when they believe a vessel may be a target.\n\"The attack is likely to have been targeted due to the vessel's Israeli affiliation through [Israeli-owned shipping management company] Eastern Pacific Shipping,\" risk management company Ambrey told AP. \"The vessel's AIS transmissions were off days prior to the event, indicating this alone does not prevent an attack.\"\nThe Symi is owned by the Singapore-headquartered Eastern Pacific Shipping, belonging to the Israeli billionaire Idan Ofer. In 2011, UK newspaper The Sunday Times reported that ships owned by the Ofer family had allegedly been used to transport elite Israeli special forces units to conduct operations, including assassinations, in the region.\nEarlier this week, Yemen's Houthi rebels said that Israeli ships are a \"legitimate target,\" in a statement seen as potentially opening a new, expanded front in the Israel-Hamas conflict. For weeks, international leaders have warned that the war could broaden into a larger regional dispute in the Middle East.\nLast week, Israel said that Houthis had seized a British-owned cargo ship in the southern Red Sea, claiming the incident to be an \"Iranian act of terrorism.\" The Houthis later confirmed the report but described the vessel as being Israeli in origin, although the office of Israeli Prime Minister Benjamin Netanyahu denied any connection as it condemned the hijacking.\nPublic records cited by Associated Press say the British owner of the vessel, Ray Car Carriers, was founded by shipping magnate Abraham 'Rami' Ungar, one of richest men in Israel and a supporter of right-wing causes.\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Israeli-owned ship attacked by suspected Iranian drone AP", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274045296/israeli-owned-ship-attacked-by-suspected-iranian-drone-ap"}