{"authors": ["Margaret Sullivan"], "date_download": "2024-02-05 15:33:36", "date_modify": "None", "date_publish": "2023-11-28 11:02:08", "description": "At least 53 journalists have been killed since 7 October, the deadliest figure in the 30 years of keeping these dire statistics", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fcommentisfree%2F2023%2Fnov%2F28%2Fjournalists-killed-israel-hamas-war.json", "image_url": "https://i.guim.co.uk/img/media/5373698cc3df21b6e8e234043166999bd6040892/0_195_7128_4277/master/7128.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=b3aabfe5a6da8bf96b3de6b9c0801080", "language": "en", "localpath": null, "maintext": "Sign up to get email alerts every time Margaret Sullivan publishes a new column.\nThe numbers alone are dreadful. Journalists are being killed in the Israel-Hamas war at the rate of more than one every day since 7 October – at least 53 so far, according to the Committee to Protect Journalists, or CPJ.\nThis has been the deadliest period for journalists in the 30 years since the New York-based organization began keeping these dire statistics.\nBut, of course, it’s not all about the numbers.\nThere’s also the reality that the loss of journalists translates into less information. And that lies and propaganda love a void.\nAnd, of course, there are the people themselves. Each with a life, a career, a family, hopes and a mission – now cut short.\nIt may help understanding to name some of the victims. According to CPJ, they include people like Roshdi Sarraj, a journalist and co-founder of Ain Media, a Palestinian company, who was killed in an Israeli airstrike in Gaza.\nOr the Israeli journalist Roee Idan, a photographer for the newspaper Ynet. He and his wife were killed in the Hamas attack on 7 October. He was working when he died. His four-year-old daughter, held hostage by Hamas for seven weeks, was released on Sunday.\nOr Issam Abdallah, a Beirut-based videographer for Reuters, the international news agency, who was killed near the Lebanon border while documenting the shelling between Israeli forces and the Lebanese militant group Hezbollah.\n“The world needs to know what is going on,” but that’s getting harder all the time, Clayton Weimers, the executive director of RSF (the international organization also known as Reporters Without Borders), recently said.\nRSF’s representatives, in a meeting at the White House this week, urged Joe Biden to do more to support journalists.\nThe overwhelming majority of the dead appear to be Palestinian journalists killed in Israeli airstrikes. As of Monday, the CPJ reports that of the 57 journalists and media workers known to have died during the current war, 50 were Palestinian, four Israeli and three Lebanese.\nRSF has pleaded with the Biden administration to put more pressure on the Israeli government to protect civilian lives, including those of journalists. RSF also objected to the difficulty of getting necessary supplies – chargers, phones and camera equipment – to those working in Gaza.\n“Meanwhile, the journalists in Gaza cannot leave, and the only outside media permitted to enter have been invited to embed with the Israeli Defense Forces and submit to strict rules controlling what they can see and share,” the organization said in a statement.\nWhile this embedded coverage is valuable, RSF notes, “it is no substitute for independent reporting”.\nEspecially painful to the broader journalism world is the loss of Belal Jadallah, the press freedom defender who made an important contribution to a CPJ report published in May, “Deadly Pattern”. It revealed a complete lack of accountability in Israeli military killings of journalists over the past two decades.\n“His killing leaves a gaping hole in the media landscape in Gaza,” said Sherif Mansour, who coordinates CPJ’s Middle East programs.\nskip past newsletter promotion Sign up to Follow Margaret Sullivan Free newsletter Sign up to get email alerts every time Margaret Sullivan publishes a new column. Enter your email address Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\nThe Palestinian Journalists’ Syndicate believes that, given his work, Jadallah may have been targeted by the Israeli military – thus falling victim to the very pattern he helped to uncover and document.\nCPJ tries to help by monitoring deaths, arrests and harassment, by providing protective gear, and by working to get journalists released from prison or detention. It publishes guidelines for reporting in conflict zones and for treating the physical and psychological trauma that often follows.\nPerhaps most importantly, it raises awareness about what’s happening – and what goes missing when journalists are killed.\nJodie Ginsberg, the organization’s president, said in an interview on Sunday that due to the extreme dangers since the first week of October, “there was not a single international journalist working in Gaza” until very recent days.\nThat meant that nearly all the information getting to the world from inside Gaza was coming from Palestinian journalists – those who have apparently been targeted, or at least not protected.\nCPJ has joined the calls for a humanitarian ceasefire to spare civilians.\n“Journalists are civilians – it’s really important to remember that,” Ginsberg told Canada’s CBC News. “They have a vital role to play in any war and they need to be protected.”\nBut that’s not happening. The price is steep for individuals, for news organizations and for truth itself.\nAt the moment, Ginsberg said, journalists remain in serious peril and the numbers continue to mount.\n“Nowhere in Gaza is safe.”", "source_domain": "www.theguardian.com", "text": null, "title": "The Israel-Hamas war is deadly for journalists. Lives are being lost, and truth", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/commentisfree/2023/nov/28/journalists-killed-israel-hamas-war"}