{"authors": ["Perkin Amalaraj"], "date_download": "2024-02-05 15:33:38", "date_modify": "None", "date_publish": "2023-11-28 01:52:29", "description": "Baby Kfir had just learned to walk when he, along with his brother Ariel, four, and his mother Shiri, 32, was taken from his family's home in Kibbutz Nir Oz during Hamas' incursion on October 7", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12798063%2FWarped-Hamas-warlords-REFUSE-release-youngest-hostage-instead-handing-TEN-MONTH-OLD-Kfir-Bibas-separate-Palestine-terror-group-operating-southern-city-expected-obliterated-IDF-ceasefire-ends-Israel-welcomes-11-captives-home.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/28/01/78303181-0-image-a-35_1701136219819.jpg", "language": "en", "localpath": null, "maintext": "Israel has claimed that Hamas has moved its youngest hostage into the IDF's firing line, hours after it last night received the fourth group of hostages from the terror group.\nHamas has handed ten-month-old Kfir Bibas to a separate Palestinian terror group in the southern city of Khan Younis, an IDF spokesperson today claimed.\nIsrael Defense Forces spokesperson Colonel Avihai Adrei said the 'babies with the red hair' were 'now being held by one of the factions' in the area around Khan Younis, Gaza, according to a message posted on X.\nBaby Kfir had just learned to walk when he, along with his brother Ariel, four, and his mother Shiri, 32, was taken from his family's home in Kibbutz Nir Oz during Hamas' incursion on October 7.\nDuring the deadly attack on Israel, Shiri, her husband Yarden, 34, and the two young boys desperately hid in a safe room armed only with a pistol, only to be taken out as Hamas gunmen smashed down their door.\nBaby Kfir (pictured) had just learned to walk when he, along with his brother Ariel, four, and his mother Shiri, 32, was taken from his family's home in Kibbutz Nir Oz\nAgam Goldstein-Almog, 17, (pictured, centre) was seen back in the arms of her loved ones after spending weeks as a hostage\nOne as-yet-unidentified hostage was seen leaving Hamas custody in a wheelchair, while several others were seen in bright pink clothes\nYuli Cunio, three, Emma Cunio, three, and Sharon Aloni Cunio, 34, (pictured) were all released today\nTal Goldstein-Almog, 9, (pictured) was seen being cradled by his loved ones after he and the other hostages arrived back in Israel\nThe image of the two young boys being carried by their weeping mother, Shiri, as they were marched from their homes was one of the most striking to be published in the early days of the Israel-Hamas war\nThe image of the two young boys being carried by their weeping mother, Shiri, as they were marched from their homes was one of the most striking to be published in the early days of the Israel-Hamas war.\nYarden's fate is unknown, and it is believed that he is either dead or one of the roughly 200 hostages remaining in Hamas custody.\nTheir family said in a statement today: 'We are experiencing moments of great uncertainty. The realisation that we will not get the hug we wished for leaves us speechless.'\nWhile it is not known exactly which group currently holds the family, military analyst Michael Horowitz said: 'It appears they may be in the hands of the Popular Front for the Liberation of Palestine (PFLP).'\nThe PFLP is one of the largest groups that form the political coalition that claims to represent the West Bank and Gaza.\nIt does not recognise Israel as a state, and has historically pushed for a one-state solution with Palestine at the steering wheel.\nThe hostages are now safely back in Israel, after spending weeks in Hamas' custody\nThe hostages released last night were largely made up of young children, teenagers and mothers\nThe hostages were handed over to the Red Cross last night\nREAD MORE: Moment 11 more Israeli hostages including nine children arrive back in Israel after spending seven weeks in Hamas captivity in Gaza Advertisement\nThe group are believed to be holding the Bibas family in Khan Younis, the Gaza Strip's second city, which in 2017 was home to just over 205,000 people.\nThough they may be held by a different group, IDF spokesperson Daniel Hagari said the responsibility for the hostages remained with Hamas.\nThe city is set to be the next target in Israel's bloody offensive against the Gaza Strip, which has so far killed over 14,000, according to the Hamas-run health ministry.\nIsrael urged Palestinians living in the city to leave just over a week ago, suggesting it will soon be the site of renewed fighting once the now-extended ceasefire concludes.\nMark Regev, an adviser to Israeli PM Benjamin Netanyahu, told MSNBC earlier this month: 'We're asking people to relocate. I know it's not easy for many of them, but we don't want to see civilians caught up in the crossfire.\nMr Regev said that IDF troops would need to go into the city to take out Hamas fighters from underground tunnels.\nSahar Kalderon, 16, was held by Hamas for over seven weeks, and was today released under the extended ceasefire deal\nErez Kalderon, 12, was today released by Hamas terrorists after being captive for over seven weeks\nHe said he was 'pretty sure' Palestinians who needed to relocate from the city 'won't have to move again' if they headed west, towards the Mediterranean Sea.\nIt is currently unclear when fighting in the Gaza Strip will resume, as Hamas and Israel are currently nearing the end of a since-extended ceasefire.\nThe temporary truce, originally set for Friday, Saturday and Sunday, was extended just hours before the agreement was due to end, suggesting that more hostages will be released from Gaza this week.\nThe terms of the truce agreement, pausing the fighting in the Gaza Strip, say it can be extended beyond its initial four-day term as long as 10 hostages are released for each extra day, with three times as many Palestinians freed in return.\nQatar's foreign ministry said the truce had been extended by two more days, suggesting Hamas intends to release another 20 hostages on top of the 50 that were set to be freed over the first four days.\nEleven more hostages held by Hamas are now back on Israeli soil, after the fourth exchange of hostages and prisoners.\nThe brothers were seen in good spirits wearing earmuffs in a convoy that is currently taking them back to Israel\nDespite the smiles, many of the children released have been forced to leave members of their families behind\nBrothers Tal Goldstein-Almog, 9, and Gal Goldstein-Almog, 11, were seen in the company of 'an elite unit of the IDF', as spokesperson Daniel Hagari described them\nIDF spokesperson Mr Hagari said last night that 'an elite unit of the IDF' accompanied the group, all young children, teenagers and mothers, back to Israel, where they will undergo a medical assessment.\n'Our forces will accompany the returnees until they reach their families in the hospitals.'\nAll 11 hostages, made up of three French citizens, two German citizens and six Argentinian citizens, released were taken by Hamas from Kibbutz Nir Oz, a settlement just a mile-and-a-half away from the Gaza border with a pre-incursion population of around 400.\nThe hostages, almost all of whom are young children and teenagers, have been named as: Yuli Cunio, three, Emma Cunio, three, Sharon Aloni Cunio, 34, Karina Engelbert, 51, Yagil Jacob, 12, Erez Kalderon, 12, Sahar Kalderon, 16, Or Jacob, 16, Yuval Engel, 11, Mika Engel, 18, and Eitan Yahalomi, 12.\nBut fears from earlier last night that Hamas would split up families have seemingly been confirmed, as many of the children released have been forced to leave their loved ones behind.\nAll 11 hostages came from the same settlement, Kibbutz Nir Oz, which lies just a mile-and-a-half away from the Gaza border and had a pre-incursion population of around 400\nDespite the happy scenes, a spokesperson for the hostages families last night told MailOnline: 'Every single child that has been released tonight is being returned while their father is being left in Hamas captivity in Gaza'\nThe Cunio family are still missing their father, David, after they were all taken from Nir Oz during Hamas' incursion.\nTwelve-year-old Eitan will also be missing his father, Ohad, who remains a Hamas prisoner.\nEitan's mother, Bat Sheva, previously revealed that motorcycle riding Hamas militants tried to kidnap her and her children from their Nir Oz home, but she managed to jump off with her two daughters.\nShe added that she was terrified that her Manchester City-supporting son will not be the same following his seven-week stint as a hostage.\nThe Kalderon family, who will soon be reunited with 16-year-old Sahar and 12-year-old Erez, are also missing their father, 53-year-old Oher.\nIt is not currently known whether the hostages released last night ever had contact with other members of their family who were also being held by Hamas.\nA spokesperson for the hostages families last night told MailOnline: 'Every single child that has been released tonight is being returned while their father is being left in Hamas captivity in Gaza. Very hard to swallow.'\nThe Red Cross was waiting for the hostages for the fourth time in as many days\nImages of Hamas handing over the 11 hostages revealed its militants stood in a parade as the civilians walked towards a Red Cross van\nAll 11 hostages came from the same settlement, Kibbutz Nir Oz. The head of the kibbutz, Osnat Peri, last night said in a statement: 'The news this evening brings a sigh of relief to our community.'\nHe said that he and his community are still 'deeply concerned about our loved ones that are still held hostage', adding that of the hostages still left in Gaza, 49 are from Nir Oz.\nThree of the hostages were French, and the country's president Emmanuel Macron last night said in a post to X: 'Three of our young compatriots are part of the group of hostages released today.\n'Extremely happy with this announcement.'\nImages of Hamas handing over the 11 hostages revealed its militants stood in a parade as the civilians walked towards a Red Cross van, which took them back to Israeli officials.\nOne as-yet-unidentified hostage was seen leaving Hamas custody in a wheelchair, while several others were seen in bright pink clothes.\nRaz Asher (left), four, her two-year-old sister Aviv (right) and their mother Doron, 34, reunite with their father and husband Yoni at the Schneider Children's Medical Center\nKeren Munder, 54, and her son Ohad Munder, age 9, with his father and a family member at the Schneider Children's Medical Center. Keren and Ohad were kidnapped by Hamas terrorists on October 7\nA group of Israelis celebrate as a helicopter carrying hostages released from the Gaza Strip lands at the helipad of the Schneider Children's Medical Center in Petah Tikva, Israel\nQatar's foreign ministry last night said in a post to X that 33 Palestinian civilians held in Israeli jails will be freed in exchange, as part of the temporary ceasefire deal that was yesterday extended by two days.\nThe deal is understood to have gone down to a wire and seemed on the verge of unravelling.\nHamas had accused Israel of failing to keep its side of the bargain and Israel was threatening to resume its lethal onslaught on the Gaza Strip.\nBut mediators were able to pull it back from the brink, a feat that involved the first ever public visit by Qatari officials to Israel, according to AP.\nOria Brodutch jumps into the arms of his father, Avihai Brodutch, shortly after they were reunited in Israel on November 26\nIsraeli prime minister Benjamin Netanyahu (C) meets soldiers at an undisclosed location in the Gaza Strip\nIsraeli prime minister Benjamin Netanyahu visits Gaza Strip, during a temporary truce between Hamas and Israel\nIsraeli media yesterday afternoon reported Hamas had amended the hostage list ahead of the exchange, cutting down the number of people it would set free.\nThe government was said to be 'not happy' with the list of hostages due to be released because it is made up of children and elderly women - suggesting yet more families are to be split up because children will not be released with their parents.\nThe European Union's top diplomat Josep Borrell said the extension of the current truce in Gaza is within reach, and that it would allow the international community to work on a political solution to the conflict.\nHe said that the Palestinian Authority needs to regain control of Gaza from Hamas, offering a 'better and viable' alternative to it.\nBut Mr Netanyahu was resolute in his intentions to crush Hamas, declaring his forces would resume its offensive 'with all of our might' once the truce expires, which it is set to do on Tuesday, unless another deal is struck.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Warped Hamas warlords REFUSE to release youngest hostage instead handing TEN-MONTH-OLD Kfir Bibas to separate Palestine terror group operating in southern city expected to be obliterated by IDF when c", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12798063/Warped-Hamas-warlords-REFUSE-release-youngest-hostage-instead-handing-TEN-MONTH-OLD-Kfir-Bibas-separate-Palestine-terror-group-operating-southern-city-expected-obliterated-IDF-ceasefire-ends-Israel-welcomes-11-captives-home.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}