{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:33:48", "date_modify": "None", "date_publish": "2023-11-28 14:11:21", "description": "Officer who reviewed intelligence considered risk of big attack ‘an imaginary scenario’, leak suggests", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F28%2Fisraeli-military-had-warning-of-hamas-training-for-attack-reports-say.json", "image_url": "https://i.guim.co.uk/img/media/debc3165d8f399e23aac32f1b3613ee267fd2a55/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=473c2f08a88d5d60770f337baac92389", "language": "en", "localpath": null, "maintext": "Israel’s military and intelligence officials were given a highly detailed warning that Hamas was actively training to take over kibbutzim on the Gaza border and overrun military posts with the aim of inflicting substantial fatalities, according to reports in the Israeli media.\nThe claim made by Israel’s Channel 12 on Monday evening was based on leaked emails from the Israeli military’s 8200 cyber-intelligence unit discussing the warnings.\nThose emails revealed that a senior officer who reviewed the intelligence considered the danger of a massive surprise attack by Hamas across the Gaza border to be “an imaginary scenario”.\nThe hugely embarrassing leak describes in shocking detail what would turn out to be key elements of Hamas’s planning for its massacre of 1,200 Israelis on 7 October, including that Israel spotters were aware of senior Hamas officials present as observers during training preparations.\nAccording to the leaked emails, Hamas went as far as giving the mocked-up kibbutz used in training a name and even practised raising a flag over its synagogue.\nPlans were also intercepted that discussed overrunning a border military base and killing all of its occupants.\nWhile much of the focus of recent scrutiny for the intelligence failure before the 7 October attack has looked at what information was available to senior political and military figures, including Israel’s prime minister, Benjamin Netanyahu, the new leaks and briefings suggest serious failings within the Israel Defense Forces’ intelligence reporting and distribution system as well.\nThe source of the warning is a highly respected career military intelligence NCO identified in Israeli media reports as V who warned her chain of command during the summer that Hamas was planning a large-scale incursion.\nFurther emails leaked to Channel 12 suggest the initial warning was corroborated a few days later with evidence that other Hamas units were involved in similar training aimed at apparently different targets.\nSome officials appear to have been impressed by the intelligence but a senior intelligence officer who reviewed the material in July was more sceptical and suggested it was necessary to distinguish between what Hamas was doing for “show” and what was “realistically” the purpose of the training.\nIn another subsequent email, a colleague of the soldier who gave the initial warning said they emphatically disagreed with this assessment, while V herself suggested they were seeing a concrete “operational plan without a timetable for implementation” and that Hamas was planning for a “big event”.\nOther very senior officers, including the head of the 8200 unit, have suggested in briefings to Israeli journalists that they were not shown V’s warning, despite the email chain discussing it.\nOne report suggested that when the head of the IDF’s military intelligence directorate, Maj Gen Aharon Haliva, visited V’s unit, the warning was not passed on to him, and Haliva left with an assessment suggesting that “[the Hamas leader] Yahya Sinwar has no intention of causing the situation to deteriorate [and that] Hamas has instructed its operatives on the ground to show restraint”.\nIsraeli media have carried their own versions of stories relating to the warnings of an imminent Hamas attack over the summer.\nHaaretz described the same training exercise on the mocked-up border kibbutz with reference to the 8200 unit email chain, which it said concluded with a Hamas message from those involved in the exercise saying: “We have completed the murder of all of those on the kibbutz.”\nHaaretz described V’s warning six months before 7 October that Hamas had completed training exercises simulating a raid on kibbutzim and IDF outposts on the Israeli side of the border.\n“V concluded that Hamas had completed its preparations, because senior Hamas commanders had turned out to view the exercises – something that was also reported by IDF spotters based on the border. Just like the spotters, her warnings were brushed off dismissively,” it said.\n“While they were distributed to senior officers, to her own unit and to field intelligence, a senior intelligence officer wrote to her in response, praising her work but adding: ‘It sounds imaginary to me,’ almost exactly echoing the language of the leaked 8200 emails.”\nAccording to this telling of events, V’s direct commander backed up her assessment, insisting it was a real exercise and not a display. The warnings were reiterated by the soldiers involved a few weeks before 7 October when an unnamed senior intelligence officer visited their base and the intelligence was presented to him.\nDespite the warnings, however, even of the eve of 7 October, when senior officers discussed the prospect of an imminent Hamas attack, senior officers in the IDF were describing the evidence as “weak”.\nThe Yedioth Ahronoth newspaper reported that on 6 October, hours before Hamas launched its assault, the IDF’s most senior officers were alerted to “weak signs” that something was happening on the Gaza border and that Hamas was preparing for an offensive.\nCommenting on the claims, the IDF said: “These days the IDF is entirely focused on fighting the terrorist organisation Hamas. After the war, the IDF will conduct a thorough, incisive and uncompromising investigation and publish its findings to the public.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli intelligence leak details extent of warnings over Hamas attack", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/28/israeli-military-had-warning-of-hamas-training-for-attack-reports-say"}