{"authors": [], "date_download": "2024-02-05 15:33:58", "date_modify": "None", "date_publish": "2023-11-28 00:00:00", "description": "Since leaving Gaza 10 days ago, Professor Ghassan Abu-Sittah said he has felt an overwhelming sense of guilt for those left behind.", "filename": "https%3A%2F%2Fwww.edinburghnews.scotsman.com%2Fread-this%2Flondon-surgeon-war-gaza-horrors-4426116.json", "image_url": "https://www.edinburghnews.scotsman.com/jpim-static/image/2023/11/28/12/55/Professor%20Ghassan%20Abu-Sittah%20addresses%20journalists%20in%20London.jpg?width=512&auto=webp&quality=75&crop=3:2,smart", "language": "en", "localpath": null, "maintext": "Watch more of our videos on Shots!\nand live on Freeview channel 276 Visit Shots! now\nA British-Palestinian surgeon who has returned to London after 43 days under bombardment in Gaza has warned the “creation of an uninhabitable Gaza strip” has been a military objective of the war.\nSpeaking at a press conference in London, Prof Ghassan Abu-Sittah, a plastic and reconstructive surgeon, described the horrific scenes at Al Ahli and Al Shifa hospitals as they ran out of supplies and ceased to operate.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nSign up for the daily Trending Today. Get the stories the internet is talking about to your inbox. Sign up Thank you for signing up! Did you know with a Digital Subscription to Edinburgh News, you can get unlimited access to the website including our premium content, as well as benefiting from fewer ads, loyalty rewards and much more. Learn More Sorry, there seem to be some issues. Please try again later. Submitting...\n“Having seen this massacre unfold, the creation of an uninhabitable Gaza Strip was the aim and the destruction of all the components of modern life at which the health system lies was the main military objective,” he said.\nIsrael's military operations in Gaza have been under way since the terrorist attacks on October 7 - which left more than 1,200 dead and many others kidnapped - with the stated aim of destroying Hamas. The operations paused last week for the first time to facilitate the release of hostages taken by Hamas and Palestinian prisoners in Israel.\nProf Abu-Sittah, arrived in the territory in the early hours of October 9 to provide medical assistance.\nHe left on November 18 and is now back home in west London, where he lives with his family. Prof Abu-Sittah is an experienced war surgeon and has worked in hospitals in many war zones including Syria, Yemen, Iraq and Lebanon.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nOn Monday the Hamas authority said the death toll in Gaza exceeds 15,000 and includes 6,150 children and 4,000 women. It said some 7,000 people are missing under the rubble, including 4,700 children and women.\nDuring his time in Gaza, Prof Abu-Sittah was based at Al Ahli and Al Shifa hospitals, performing 10 to 12 surgeries a day, with half of his operating list being children. He believes that up to 900 children in Gaza have undergone an amputation on their limbs since the beginning of the war.\nSelfie Professor Ghassan Abu-Sittah took while in Gaza\n40 to 45% of wounded were children\nWhen Prof Abu-Sittah first arrived in Gaza he joined the plastic and reconstructive surgery team at Al Shifa hospital.\n“During my time at Al Shifa hospital it became apparent that 40 to 45% of all the wounded were going to be children, that the primary target of the bombing was people’s residential homes and that we were getting multigenerational patients from the same families in each air raid,” he said.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\n“Most of the injuries initially were blast injuries and these were severe soft tissue traumas, severe facial traumas, multiple fractures and then as time went we saw the introduction of incendiary bombs where the patients would have over 40% of their total body surface area burned with no other injuries. By the time Al Shifa had collapsed there were over 100 of these patients at Al Shifa hospital.”\nHe continued: “We started seeing phosphorus burns. I had treated white phosphorus burns in the Gaza Strip during the 2009 war. It was very familiar with the very characteristic injuries and burns that they make.”\nWhite phosphorus is prohibited in warfare under international law and the Israel Defense Forces IDF has denied the use of such weapons.\nProf Abu-Sittah described his colleagues at Al-Shifa hospital rushing to check for members of their family when the dead and wounded were brought in after each air strike.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\n“They would look at the faces of the wounded and the dead looking to see whether their relatives were there and in many cases their children were amongst the dead and the wounded,” he recalled.\nA picture of damaged buildings taken by Abu-Sittah.\nAttack on Al-Ahli hospital\nOn October 17, an explosion took place in the carpark of the courtyard of Al-Ahli hospital, killing 471 people and injuring 342 according to the Hamas's health ministry.\nProf Abu-Sittah was working at Al-Ahli at the time of the attack and described the horrific scenes. While his team was getting ready to bring a patient into the operating room they heard an “almighty whistling sound” coming towards them and then a huge explosion.\n“It was obvious from the size of the explosion and the damage that it was either at the edge of the hospital or in the hospital,” he recalled. “The full ceiling in the operating hospital fell on top of us. Luckily I wasn’t injured and I walked out of the operating room into a corridor that you could see the forecourt of the hospital. The ambulances were on fire, some of the cars were on fire and the forecourt which had been lit by that fire was full of bodies.”\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nOnce he had assessed the situation he started to assist survivors.\nA mangled wheelchair sits among debris\n“The first patient that I saw was a man in his mid 50s with an amputation at the mid thigh,” he said. “There was blood spurting through the exposed arteries in his stump. I took his belt and tied it as a tourniquet.\n“I moved onto another patient who had received a single shrapnel to his neck and that shrapnel had hit one of the vessels in his neck and blood was spurting from his neck. I put my hand on the wound to try to stop the bleeding and tried to resuscitate the patient.\n“I remember walking past the amputated forearm of a child.”\nProf Abu-Sittah returned home as the last remaining hospital in northern Gaza ceased to operate. In the last days as supplies dwindled he was using store-bought washing up liquid and vinegar to clean patients wounds. Having run out of anaesthetic, morphine and ketamine, he was no longer able to perform surgeries and was only able to dress and clean patients’ wounds.\nEnd goal to clear Gaza of its population\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nSince leaving Gaza 10 days ago, Prof Abu-Sittah told LondonWorld he felt an overwhelming sense of guilt for those left behind and that there will be a difficult process of recovery ahead for him.\nHe has agreed to work with Scotland Yard to provide witness evidence of the “genocidal” war crimes that he claims Israel has committed.\n“There is no doubt in my mind that the end goal is to ethnically cleanse Gaza,” he said. “The UK government has to insist medical staff be allowed into Gaza. It has to ensure a proper investigation of potential war crimes is done.", "source_domain": "www.edinburghnews.scotsman.com", "text": null, "title": "London surgeon Ghassan Abu-Sittah on Gaza war horrors", "title_page": null, "title_rss": null, "url": "https://www.edinburghnews.scotsman.com/read-this/london-surgeon-war-gaza-horrors-4426116"}