{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Richard Luscombe", "Martin Belam", "Adam Fulton"], "date_download": "2024-02-05 15:34:07", "date_modify": "None", "date_publish": "2023-11-28 04:46:51", "description": "This blog has now closed. Follow our new live blog here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F27%2Fisrael-hamas-war-live-updates-gaza-ceasefire-hostages-deal-end-extension-benjamin-netanyahu.json", "image_url": "https://i.guim.co.uk/img/media/f8fa15f8bc3bb082c66a97204078cb50573e02b4/0_86_3246_1949/master/3246.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=b62a7d429fa208f0f29acd4fa372f80f", "language": "en", "localpath": null, "maintext": "From 27 Nov 2023 00.41 CET Thirty Palestinian children and three women released from Israeli jails – reports Thirty-three Palestinian women and children have been released from Israeli jails following the freeing of 11 Israeli hostages from Gaza, various media outlets have reported. Reuters cited Hamas-affiliated as reporting that 30 children and three women were released. AFP said the Israeli prison authority had confirmed the release of 33 prisoners without saying how many were children and how many women. The Hamas-affiliated Quds News Network posted footage on X, formerly known as Twitter, showing Palestinians in the West Bank cheering and clapping as a bus carrying freed prisoners drove through a street. Palestinians warmly welcome the arrival of the fourth batch of freed prisoners as part of the deal with the Israeli occupation state. #Palestine pic.twitter.com/bLm1TjHcl3 — Quds News Network (@QudsNen) November 27, 2023\n28 Nov 2023 05.46 CET Closing summary This blog is closing soon but you can follow our live coverage on our new blog here. In the meantime, here are the key developments: A deal to extend the current ceasefire between Israel and Hamas by two days has been agreed . Hamas said it had agreed to the extension of the four-day truce by 48 hours after the intervention of Qatar and Egypt, the principal mediators for the initial agreement, and with the same conditions. The extension came after a frantic dash by mediators with just over 12 hours remaining before hostilities in Gaza were due to resume.\nIsrael has confirmed the release of 11 hostages from Hamas captivity in the Gaza Strip on Monday. Among those released include three-year-old twins, and all were kidnapped from their homes in the same kibbutz. It brings the number of Israelis freed under the truce to 50 – out of roughly 240 hostages captured on 7 October – along with 19 hostages of other nationalities. Israel has said it would extend the ceasefire by one day for every 10 additional hostages released.\nThirty-three Palestinians detained in Israeli prisons, 30 children and three women, were released late Monday. The release was marred by clashes between the Israeli military and Palestinians awaiting the prisoners outside Ofer prison with one Palestinian killed by Israeli forces, according to the Palestinian health ministry.\nThere are widespread fears that any break in the conflict that has devastated swaths of Gaza and killed many thousands of civilians will only be brief. Yoav Gallant, Israel’s defence minister, told troops on Monday that when fighting recommenced its “strength will be greater, and it will take place throughout the entire strip”. “You now have a few days, we will return to fighting, we will use the same amount of power and more,” Gallant said.\nAid agencies have welcomed the two-day extension of the truce in Gaza but voiced concern that the expected resumption of Israel’s attack on Hamas would lead to an even deeper humanitarian crisis among Palestinians. A particular concern was the impact on people in the crowded south of the strip, where about 2 million people are now living around Khan Younis and elsewhere. Many fled south after Israel demanded they evacuate the northern area around Gaza City last month.\nMore than 14,800 Palestinians have been killed in Gaza since 7 October, including 6,150 children and 4,000 women, the Palestinian ambassador to the UN has said. Thousands more remain under the rubble, he wrote in a letter to the UN security council on Monday.\nThe EU’s top diplomat has said that “Palestinian people cannot pay for the action of Hamas” as he urged for the truce in Gaza to be extended to a permanent one. Josep Borrell, at a press conference on Monday, said “it makes no sense to give food to somebody that will be killed the day after. We need to stop the bombardment.”\nA London surgeon has described witnessing a “massacre unfold” during 43 days spent under bombardment in Gaza, saying the destruction of the Palestinian health system was a military objective of the war. Prof Ghassan Abu-Sittah, a plastic and reconstructive surgeon, told of horrific scenes at al-Ahli Arab and Dar al-Shifa hospitals as they ceased to function and said he witnessed the use of white phosphorus munitions.\nThe Committee to Protect Journalists (CPJ) says 57 journalists have been killed since the start of the Israel-Hamas war . The conflict was already the deadliest on record for journalists.\nA suspect was arrested on Sunday in the shooting of three Palestinian students in Burlington, Vermont, the night before, police said. Hisham Awartani, Kinnan Abdalhamid and Tahseen Ali Ahmed were on their way to Awartani’s grandmother’s house for Thanksgiving dinner when they were fired on. Jason J Eaton, 48, pleaded not guilty at an arraignment hearing on Monday. Joe Biden expressed horror at the shooting and reiterated that “there is no place for violence or hate in America”.\nThe far-right leader Stephen Yaxley-Lennon has been charged after attending a march against antisemitism in London on Sunday. The Metropolitan police said Yaxley-Lennon, who uses the name Tommy Robinson, has been charged with failing to comply with an order excluding him from the area of the march.\n28 Nov 2023 05.13 CET We’re still waiting to hear more from the Israeli hostages released today, but in the meantime their relatives have been speaking to Israeli media. According to Haaretz, Diego Engel-Bert, whose sister Karina Engel-Bert and nieces Mika Engel, 17, and Yuval Engel, 11, were released on Monday, told Channel 12 News: We are all here glued to the screen and full of happiness and longing. It’s good to have a chest to stop the heart from escaping. We’re starting to see a little light in the darkness we are in, waiting for them to come so we can hug. Just hug, no need to talk, everything else will come later. Yaniv Yaakov, whose 17-year-old nephew Or Yaakov and 13-year-old nephew Yagil Yaakov were also released, told Channel 13 News: Even in the difficult bits, everyone wants to be with us, and also in happiness. What excites me the most is my mother, the children’s grandmother, a mother with a smile at last.\n28 Nov 2023 04.48 CET US secretary of defence Lloyd Austin has spoken to his Israeli counterpart Yoav Gallant to get an “update on hostage recovery and the Israel Defense Forces’ operational pause in Gaza,” the Pentagon has said in a statement. Austin gave an update on US security assistance to Israel, “reiterated that humanitarian aid into Gaza must increase; and called for state and non-state actors to avoid expanding the current conflict,” the statement continued. Austin also updated Gallant on US efforts to protect its own forces in the region, it said. The US has been putting pressure on Israel to extend the ceasefire and increase aid into Gaza.\n28 Nov 2023 04.33 CET Death toll of journalists killed in Israel-Hamas war reaches 57, CPJ says The Committee to Protect Journalists (CPJ) says 57 journalists have been killed since the start of the Israel-Hamas war. The first month of the Israel-Gaza war was the deadliest month for journalists since CPJ began documenting journalist fatalities in 1992, the New York-based non-profit said in a statement. It said that as of Monday: 57 journalists and media workers were confirmed dead: 50 Palestinian, 4 Israeli, and 3 Lebanese.\n11 journalists were reported injured.\n3 journalists were reported missing.\n19 journalists were reported arrested.\nMultiple assaults, threats, cyberattacks, censorship, and killings of family members. The CPJ said it was also investigating numerous unconfirmed reports of other journalists “being killed, missing, detained, hurt, or threatened, and of damage to media offices and journalists’ homes”. Sherif Mansour, the organisation’s Middle East and North Africa programme coordinator, said: CPJ emphasizes that journalists are civilians doing important work during times of crisis and must not be targeted by warring parties. Journalists across the region are making great sacrifices to cover this heart-breaking conflict. Those in Gaza, in particular, have paid, and continue to pay, an unprecedented toll and face exponential threats. Many have lost colleagues, families, and media facilities, and have fled seeking safety when there is no safe haven or exit.\n28 Nov 2023 04.13 CET We are now at our fourth group of hostages released in exchange for Palestinian prisoners. Have a look at this video which covers the latest, including footage released by Hamas showing the hostages being handed over to the Red Cross. There’s also pictures of a released Palestinian prisoner being reunited with his mother. 00:02:21 Fourth group of Israeli hostages released as more Palestinians freed after truce extended – video\n28 Nov 2023 03.57 CET Reged Ahmad A survey out of Princeton has been published looking at how Palestinians in Gaza felt about Hamas. Agence France-Presse reports that the survey showed many were hostile to Hamas before the group’s attack in Israel on 7 October “We find in our surveys that 67% of Palestinians in Gaza had little or no trust in Hamas in that period right before the attacks,” said Amaney Jamal, dean of Princeton’s School of Public and International Affairs. “This is especially important because of the (erroneous) argument that all of Gaza supports Hamas, and therefore all of Gaza should be held accountable for the actions, atrocious actions of Hamas.” Jamal is one of the driving forces behind the Arab Barometer which conducts surveys and polling in the region, including in Gaza where fieldwork concluded on the eve of the attacks on Israel. She said that Hamas, which won elections in the Palestinian territories in 2006 and is designated a “terrorist” organisation by Washington and the EU, was seen as “corrupt” and “authoritarian” by many respondents. “Seventy-five per cent said in the previous 30 days, they could not afford to feed their households. So again, this is an impoverished society, a society that is basically saying the Hamas-led government has some levels of corruption,” said Jamal. “When we ask people, who do you blame? … we thought that the number-one culprit was going to be Israel because of the blockade. But most people cited Hamas corruption, more so than they cited the Israel blockade.”\n28 Nov 2023 03.41 CET One of the Palestinian children released from an Israeli prison has told Al Jazeera he was beaten by Israeli guards last week and his hand and finger were broken. Mohammed Nazzal, a teenager originally from Jenin, said he was given no treatment in the prison in the Negev desert despite his injuries and had only had his arm put in a sling after he was released, by the Red Cross. “They gave me nothing,” he said, referring to the Israelis. “I broke my hand, I can’t move my finger.” His mother, who stood next to him as he was interviewed, said she had had no idea of what was happening to him. “There were no calls, no visits, nothing,” she said. View image in fullscreen Mohammed Nazzal hugs his mother after being released from an Israeli jail. Photograph: Kenzo Tribouillard/AFP/Getty Images\n28 Nov 2023 03.18 CET Ahed Tamimi, who rose to global prominence after a video of her slapping an Israeli soldier went viral in 2017, is on a list of Palestinian prisoners who could be freed in exchange for Israeli hostages, the Israeli newspaper Haaretz has reported. Tamimi spent eight months in prison for the 2017 assault. The now 22-year-old was arrested again on 6 November when the Israeli military raided her home in the occupied West Bank, accusing her of inciting violence and calling for terrorist activity in an Instagram post. Her family has denied that she wrote the post, saying she is frequently hacked online. While Haaretz reported that she was on the list of 50 detainees and prisoners Israel is willing to exchange for Israeli hostages held by Hamas, the New York Times reported at the same time that Israel had moved to incarcerate her under administrative detention. Citing her lawyer, Mahmoud Hassan, the Times reported that she now faces indefinite imprisonment, without charges or trial, based on evidence that neither she nor her lawyer are allowed to see. “I’m hopeless to defend her,” Hassan said. View image in fullscreen Ahed Tamimi pictured in 2018 in the Ofer military prison near Jerusalem. Photograph: Ariel Schalit/AP\nUpdated at 03.24 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: 57 journalists killed in conflict, Committee to Protect Journalists says - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/27/israel-hamas-war-live-updates-gaza-ceasefire-hostages-deal-end-extension-benjamin-netanyahu"}