{"authors": ["World News"], "date_download": "2024-02-05 15:15:57", "date_modify": "None", "date_publish": "2024-01-24 10:31:05", "description": "A Russian military transport plane carrying 65 Ukrainian prisoners of war, six crew and three others has crashed in Russia’s Belgorod region near Ukraine, the Kremlin […]", "filename": "https%3A%2F%2Fjerseyeveningpost.com%2Fmorenews%2Fworldnews%2F2024%2F01%2F24%2Frussian-transport-plane-crashes-with-65-ukrainian-pows-on-board%2F.json", "image_url": "https://d3gvyx4eg3tne0.cloudfront.net/wp-content/uploads/2024/01/Img37381669-1.jpg", "language": "en", "localpath": null, "maintext": "A Russian military transport plane carrying 65 Ukrainian prisoners of war, six crew and three others has crashed in Russia’s Belgorod region near Ukraine, the Kremlin said.\nIt was not immediately clear what caused the crash, which took place at around 11am local time (8am GMT). It is not known if anyone survived.\nAuthorities were investigating the cause of the crash, and a special military commission was on the way to the crash site, the Russian defence ministry said.\nRussian state news agency RIA Novosti, citing the ministry, reported that the POWs were being transported to the border region for a prisoner exchange.\nSpeaking on his morning call with reporters, President Vladimir Putin’s spokesperson Dmitry Peskov said he could not comment on the crash as he did not have enough information about it.\nThe Russian air force has suffered a string of crashes that some observers have attributed to a higher number of flights amid the fighting in Ukraine.\nEarlier on Wednesday, Ukrainian President Volodymyr Zelensky said a major Russian missile attack that was apparently devised to overwhelm Ukraine’s air defences had killed 18 people and injured 130.\nToday, Russia launched around forty missiles of various types in an attempt to evade our air defenses. We were able to intercept the majority of them, but there were still some hits. Over 200 different objects were damaged. 130 residential buildings, all ordinary houses. 130… pic.twitter.com/Clep0GALtO — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) January 23, 2024\nUkraine is marking the 700th day since the full-scale invasion by Kremlin’s forces started.\nThe barrage employing more than 40 ballistic, cruise, anti-aircraft and guided missiles early on Tuesday hit 130 residential buildings in three Ukrainian cities, “all ordinary houses”, Mr Zelensky said on X, formerly Twitter.\nRussia’s onslaught, which included targets in the capital Kyiv and second-largest city Kharkiv, was the heaviest in weeks and lent weight to Mr Zelensky’s appeals for Western allies to provide more military aid.\n“This year, the main priority is to strengthen air defense to protect our cities and towns, as well as defend frontline positions,” the Ukrainian leader said on X on Tuesday night.\nWith the 930-mile front line largely static amid icy weather and as both sides seek to replenish their weapons stockpiles, the war recently has focused on long-range strikes.\nAnalysts say Russia stockpiled missiles to pursue a winter campaign of aerial bombardment, while Ukraine has sought to strike inside Russia with new types of drones.\nRussia may have employed decoy missiles in Tuesday’s attack in an effort to open up holes in Ukraine’s air defences, a US think tank said.\nToday is Ukraine’s Foreign Intelligence Service Day. These are the people who assist the state in being aware of the actual situation in each direction. An institution whose effectiveness is essential to many of Ukraine’s achievements. Almost nothing can be said publicly about… pic.twitter.com/3tNzCdgD1b — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) January 24, 2024\nThe Washington-based Institute for the Study of War said Moscow is likely trying to acquire more ballistic missiles from foreign countries, including Iran and North Korea, because they may be more effective in some circumstances.\nA further barrage of Russian S-300 missiles struck residential districts of Kharkiv late on Tuesday, injuring nine people and damaging residential buildings, regional governor Oleh Syniehubov said.\nRussia denies its forces strike civilian areas, although there is substantial evidence to the contrary.\nThe Russian defence ministry said that air defences shot down four Ukrainian drones over the Oryol region of western Russia early on Wednesday.\nUkraine’s allies have promised to keep sending military aid packages, even though their resources are stretched. Help from the United States, by far Ukraine’s single biggest provider, has also hit political snags.\nThe German defence ministry also announced on Wednesday that it plans to send six Sea King Mk41 multi-role helicopters from Bundeswehr stocks to Ukraine.\nSince the beginning of the war military deliveries from Germany have amounted to around six billion euro (£5.13 billion), including substantial anti-aircraft and air defence systems, the government said.", "source_domain": "jerseyeveningpost.com", "text": null, "title": "Russian transport plane crashes with 65 Ukrainian PoWs on board", "title_page": null, "title_rss": null, "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/01/24/russian-transport-plane-crashes-with-65-ukrainian-pows-on-board/"}