{"authors": ["Oliver Salt", "Oliver Salt For Dailymail.Com"], "date_download": "2024-02-05 15:34:09", "date_modify": "None", "date_publish": "2023-11-28 14:00:49", "description": "EXCLUSIVE BY OLIVER SALT: As the A's prepare to trade over half-a-century of history for the bright lights and clunking tills of Las Vegas, a new phoenix team is rising out of its ashes.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fsport%2Fmlb%2Farticle-12784963%2FOakland-Athletics-Ballers-Las-Vegas.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/27/22/78298067-0-image-m-23_1701123647260.jpg", "language": "en", "localpath": null, "maintext": "But not all hope of a professional baseball future in Oakland has been lost\nA's owner John Fisher is set to relocate his franchise 560 miles away in Vegas\nWhile it may lack the beauty and polish of its more progressive counterparts, former A's outfielder Eric Byrnes once perfectly summed up why the archaic Coliseum wobbling tall in Oakland still means so much to the city.\n'It's a giant concrete toilet bowl,' Byrnes said bluntly back in 2018. 'But it’s their toilet bowl.'\nEven the most die-hard Oakland Athletics supporters would struggle to deny that their home stadium is an age behind others across the country. A decaying building with inexcusably low hygiene levels - one recent game was postponed for over three hours while crews pumped four inches of untreated sewage out of the visitors’ dugout - there are few more inferior venues at the top level of American sport.\nYet as Byrnes encapsulated in almost poetic terms, for all the sewage issues, malfunctioning lights and dead mice in soda machines (yes, that happened too), this giant toilet bowl remains part of the fabric of the Oakland A's - the baseball team belonging to California's West Coast port for the last 55 years.\nOf course, that will not ring true for much longer after MLB owners unanimously approved the A's proposed $1.5billion move to Las Vegas, where the much-maligned John Fisher wants to reinvent the organization in 2028 with a new 30,000-seater ballpark at the current site of the Tropicana Las Vegas Casino on the Strip.\nFormer A's outfielder Eric Byrnes once described the Oakland Coliseum as a 'giant toilet bowl'\nBut the giant toilet bowl has remained part of the fabric of the Oakland A's for the last 55 years\nThat will not ring true for much longer after MLB owners unanimously approved their proposed $1.5billion move to Las Vegas, where John Fisher (pictured) wants to reinvent the organization\nThe A's are trading their rich history for the bright lights and clunking tills of Sin City\nFisher's plan is for his team to move 560 miles south east to Nevada, a proposal fans have been protesting against for years\nFisher still requires significant private financing to build the arena despite MLB commissioner Rob Manfred waiving any relocation fees, with Nevada Governor Joe Lombardo's $380m public funding bill falling way below the expected 10-figure cost to prop it up in Sin City.\nRegardless, Oakland is still poised to lose its third sporting franchise to relocation in the span of a decade. Fisher, who claims to have been denied on several occasions in his attempt to build a new stadium in the city, a result of California towns traditionally being unwilling to spend tax revenue on sporting arenas, is determined to upgrade the A's home - wherever it may be.\nThe wheels are therefore in motion for the A's to follow the Raiders - who also packed up in Oakland and headed to Vegas in 2020 - and the now-Golden State Warriors out of the city. It is a cruel, crushing blow for supporters of this beloved team, and another kick in the teeth for the city as a whole.\nBut luckily, not all hope of a baseball future in Oakland is lost.\nAs the A's prepare to trade over half-a-century of history for the bright lights and clunking tills of Las Vegas, a new phoenix team is rising out of the ashes of its destroyed predecessor this week - and with a bold opening statement.\n'There's some folks that are trying to leave town with the baseball legacy,' says Bryan Carmel, co-founder of Oakland's newest professional baseball team, the Oakland Ballers.\n'And we're gonna steal it back.'\nToday, the Oakland B's officially set sail as a sporting lifeboat for fans thrown overboard by the A's on their 560-mile voyage to Vegas.\nA group of supporters, investors, elected officials and influential figures have joined forces to begin a new baseball chapter in Oakland, which promises to cut a significant contrast to Fisher's unpopular reign of the last 18 years.\nIn that time the Gap Inc heir has drawn the ire of supporters for showing virtually no interest in improving the team on the field. Last season alone brought a major-league-worst record of 50-112, the result of several star players being offloaded in recent years, all while the Coliseum has been left to deteriorate to a humiliating extent.\nLuckily, not all hope of a baseball future in Oakland is lost, with phoenix team the Oakland Ballers launching today\nA group of supporters, investors, elected officials and influential figures have joined forces to begin a new baseball chapter in Oakland\nThe B's officially launched in Oakland on Tuesday (Pictured: EVP of Baseball Operations Don Wakamatsu, left, and manager Micah Franklin, right)\nAnd as one final middle finger to the people of Oakland, the heartbeat of his franchise, they will now have to embark on a 90-minute flight just to watch their team play in the flesh.\n'It's been a long time coming,' Carmel says about the A's impending relocation to Vegas. 'It became much, much more real this summer and it was devastating.\n'We all felt like our hearts had been ripped out of our chests. How can you take a team from a community?\n'We believe that the value of a sports team is in the relationship between the fans and the sports team. It's not something that you can really leave town with, and yet Oakland has seen it happen multiple times; the Raiders moved to Las Vegas, the Warriors moved across town to San Francisco, and now the A's are leaving for Las Vegas.\n'We just sort of drew a line in the sand and said this is unacceptable. We refuse to accept what has been said about Oakland, that maybe this isn't a pro-sports city. We fundamentally disputed that idea and decided that we just had to do something about it, and so the Oakland Ballers came about as our attempt to show that Oakland can build something and can rally around a team for the long haul.'\nAlong with Carmel - a veteran writer, producer and showrunner whose work has featured on HBO, MTV, Comedy Central and more - serial entrepreneur and long-time friend Paul Freedman helped ignite this beacon of hope for Oakland's baseball community.\nCarmel and Freedman established a special bond through their love of the A's, attending games together as high-school students while longing for their hometown team to build on its triumph at the 1989 World Series. Almost 35 years on, they are still waiting.\nThough for both men, any future successes for Fisher's organization - while extremely unlikely in the short term - will no longer resonate.\nA's fans Bryan Carmel (left) and Paul Freedman (right) worked together to bring the B's to life\nThey both describe Fisher's decision to relocate to Vegas as 'like our hearts had been ripped out of our chests'\nCarmel and Freedman admit any future A's successes under Fisher will no longer resonate\nBoth men were involved in Tuesday's official launch of the team at Oakland's Laney College\n'If there was a new baseball team in Oakland that had a different value system and were owned by a different owner, I think Bryan and I would be the first to buy tickets,' says Freedman.\nWhile also stressing that it will prove a 'bad business decision' further down the line, the B's co-founder is also struggling to come to terms with the flawed logic of moving a sports team to an entirely new city.\n'If you talk to sports fans that aren't in the United States,' he continues, 'the concept of a team moving from a city... it just doesn't make any sense, because the city and the team are like one of the same thing.\n'We believe in general that the power and the magic of sports is the way that it brings communities together with shared identities, and that is definitely very true for the Oakland A's. It's a 58-year rich baseball tradition in Oakland, it's an electric fanbase and it's a town that really gets behind its baseball.\n'As a huge fan and a huge believer in the city of Oakland, for Bryan and I it was just too much to bear to imagine Oakland without a baseball team - and so we felt the need to do something about it.'\nIn contrast to Fisher's unpopular methods, the B's are entirely committed to building a winning franchise and have invested in baseball operations 'significantly' to give them the best chance of doing so.\nThey will compete in the Pioneer Baseball League, an independent innovation league with teams based in Colorado, Idaho, Utah and Montana, and are thus becoming its first ever West Coast franchise. The organization's primary aim is to put together a championship-winning team that breathes new life into the city.\n'Our intention is to compete from day one,' says Carmel.\nCarmel and Freedman have been working hard behind the scenes for months on end to bring the Oakland Ballers to life. They have consulted leaders from prominent fan groups such as the Oakland Sell Movement, Oakland 68s and Last Dive Bar, as well as key officials and individuals in the city, and brought them on board.\nThe pair have been working with key fan groups who have been protesting against the proposed relocation for several months\nFans have carried out reverse boycotts in order to force him out, packing out the Coliseum in T-shirts reading 'SELL' while chanting the same message\nFurious A's supporters are also now planning a boycott on the first day of the 2024 season\nJorge Leon, founder of the 68s group, has been pleasantly surprised after initially having doubts when the B's duo got in touch.\n'I've been really impressed actually,' Leon says about the Ballers initiative. 'When they reached out to me I was like \"ah, I don't know. I don't want a Harlem Globetrotters type of baseball team, I want something serious.\"\n'And then I researched it and realized they are serious. I think they've shown it and that's what made me kind of think \"alright, I'm all for it.\"'\nAn esteemed Front Office has also been put together; featuring former MLB player and manager Don Wakamatsu (EVP of Baseball Operations), former player and scout Micah Franklin (Manager), and former pitcher Ray King (Pitching coach).\nAnd as they prepare to field their first ever team in May of next year, Carmel and Freedman have already raised $2million in funding from dozens of 'diverse investors'. Fans will also be able to become part-owners in the team through a crowd-funding platform that will launch early next year.\n'It's unfortunate when people in sports forget that their job is to service the hard-working fans in a community,' Carmel stresses. 'We're not here to litigate what happened between the A's and the city of Oakland, but we feel like what we're here to do is start a new chapter for baseball in Oakland and show a new model where a sports franchise and a fanbase can work together to build something.'\nFor many years Fisher has resisted calls to hand the Athletics over to someone willing to stay put in Oakland. Fans have carried out reverse boycotts in order to force him out, packing out the Coliseum in T-shirts reading 'SELL' while chanting the same message, and are now planning a boycott on the first day of the 2024 season. So far he has proven a tough nut to crack.\n'People think this was the exclamation mark on our fan frustration,' Leon warns. 'But if you thought this was crazy, just wait until next year.'\nJorge Leon, founder of the Oakland 68s group, has been pleasantly surprised after holding talks with the Oakland B's\nFisher's defense is that he has tried and failed to relocate the A's in Oakland on three separate occasions, all of which he claims were a result of the city's refusal to drum up public funds for a new stadium in the East Bay.\nVegas, on the other hand, has no such qualms with doing so, and when his plan for a $12bn stadium project on Howard Terminal hit a definitive snag earlier this year, the allure of Sin City proved too enticing.\n'I understand that it is an incredibly difficult day for Oakland fans,' Fisher said after the MLB owners' vote earlier this month. 'And I just want to say we made every effort and did everything we could to try to find a solution there and it was only in the last couple years we began to turn our attention to another market.'\nNevertheless, with huge financing required to fund the stadium, Fisher still has a pretty vast hurdle to overcome before his Vegas dream truly becomes reality.\nAnd even if it materializes as expected, another seismic challenge will be ensuring it proves a smart move business wise. In trading Oakland for Vegas, Fisher and Co are vacating the 10th-largest media market in the US in favor of the 40th. They will be highly dependent on gate receipts, but whether tourists will be rushing to disregard the glitz and glamor of Vegas' famous attractions to watch a team that has lost 214 games over the last two seasons is up for debate.\nThe A's lease at the Coliseum also runs through to 2024, providing Fisher with yet another dilemma as to where they will play games from 2025-27.\nSo what if the one-way trip to Nevada falls by the wayside?\n'There's a chance, there's always a chance,' Leon laughs. 'Especially with Fisher.'\nThe A's will stay at the Coliseum for at least one more year before their lease there expires\nEven so, Carmel and Freedman believe there's enough room for two pro baseball teams in Oakland. And theirs will pride itself on doing things right.\n'What we're gonna be focusing on is building something with the community of Oakland, by the community of Oakland and that will never leave the community of Oakland,' Freedman insists.\n'We've been so inspired by the fans, and if what we're doing can either inspire a new team in Oakland or teams around the country for how they should be operating, it would be a home run for us.'\nFor the next year, the B's will coexist with their A's counterparts in a divided Oakland. It remains to be seen whether the fractured MLB franchise will extend its lease at the Coliseum to fill the gap for even longer until Vegas eventually calls in four years' time.\nYet Freedman doesn't think that would make much difference.\n'The A's might be there in actuality, but they left in spirit a long time ago.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "SPECIAL REPORT: Meet the Oakland A's fans, investors and officials planning to STEAL baseball back with launch of Oakland Ballers phoenix team ahead of Las Vegas relocation", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/sport/mlb/article-12784963/Oakland-Athletics-Ballers-Las-Vegas.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}