{"authors": ["Adrian Horton"], "date_download": "2024-02-05 15:34:10", "date_modify": "None", "date_publish": "2023-11-27 09:24:43", "description": "In the book Deep Care, historian Angela Hume offers lessons from generations of underground activists and clinicians who worked to protect abortion access", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fbooks%2F2023%2Fnov%2F27%2Fdeep-care-book-abortion.json", "image_url": "https://i.guim.co.uk/img/media/f1d1f352dedf856a34c95f53070c2fb4d938c417/0_90_3870_2322/master/3870.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aa3267c1f6f57f384302dd39e394558d", "language": "en", "localpath": null, "maintext": "In the run-up and year following the US supreme court’s reversal of Roe v Wade in June 2022, there emerged a narrative of return: that abortion in states where it was suddenly banned would revert to the underground. It would be a return to 1972, when diffuse, partially anonymous groups such as the Jane Collective, a secret network of abortion providers in Chicago immortalized in the documentary The Janes and in a feature film starring Elizabeth Banks, stood in for legal reproductive healthcare.\nIn reality, the end of Roe didn’t so much send the US back to a pre-1973 landscape of unsafe abortions, but toward a bleak and unprecedented future of criminalized pregnancy. And the abortion underground never disappeared under Roe, anyway. Far from it – in a new book, the feminist historian, critic and poet Angela Hume draws on dozens of interviews with former unlicensed abortion providers, community clinic workers and volunteer clinic defenders who together formed the vibrant, multi-pronged and under-sung radical edge of the abortion defense movement.\nDeep Care: the Radical Activists Who Provided Abortions, Defied the Law and Fought to Keep Clinics Open is, in part, an oral history of the loose collective of activists and clinicians orbiting a single feminist clinic in Oakland, California, over three decades. It is part collage of organization tactics, art and poetry, the creative side of political consciousness. And it is part roadmap for how to practice small-group, community-based, intersectional care, within and outside of the law and often against extreme hostility, even while Roe was technically on the books.\n“This is a story about revolutionary deep care,” Hume writes in the preface. “Community care that transforms and empowers us from the inside out, through practice and over time.”\nHume, who is based in the Bay Area, initially set out to write a book about feminist poets and health advocates, and particularly the work of Pat Parker, a radical Black lesbian feminist and poet who worked at the Oakland Feminist Women’s Health Center (OFWHC) from 1978 until 1988. But speaking to Parker’s former co-worker Linci Comy, the clinic’s director for more than 30 years, Hume began to see OFWHC as a critical community hub, a bastion of reproductive rights activism and linchpin of several overlapping, related movements.\nFirst, the oft-forgotten abortion self-help movement, a west coast-led political movement starting in the 1970s which encouraged lay people – as in, people outside the medical establishment – to learn about and practice gynecology on each other. This encompassed cervical self-exam and “menstrual extraction” (suction abortion), with the goal of opening up the practice within their own communities. Self-help was a group educational practice defined against the clinic’s service for a fee; the idea was that “abortion is normal, and abortion is natural. It’s a normal process and it’s a natural process,” said Hume. “And that small groups of lay people, trained in sterile technique and menstrual extraction, could easily do this.”\nView image in fullscreen Photograph: AK Press\nAfter Roe protected the right to abortion, at least in name, some underground self-helpers shifted to the clinical setting; OFWHC, renamed West Coast Feminist Health Project/Women’s Choice in 1988, was founded in October 1972 by 19-year-old Laura Brown as a self-help clinic that offered pregnancy screenings and abortion referrals as well as workshops on the female body. And many continued to work outside a clinical setting, guided by the certainty that medical tools and knowledge should proliferate outside the long discriminatory system of institutionalized medicine and the practicality that just because abortion was legal didn’t mean it was affordable or accessible. “Self-helpers understood that abortion was legal for many people in name only,” said Hume, particularly after the passage of the Hyde amendment in 1977, which barred federal Medicaid payments for abortion and effectively limited access for poor people.\nThe Hyde amendment was evidence for what many of Hume’s interviewees explain in the book: “We can’t rely on the state to provide care,” Hume summarized. “We couldn’t then, and we can’t now.” The self-help movement “teaches us about how to empower, defend, and care for each other”, she said. “And when we can do this, we can strengthen our community from the inside, and we don’t have to rely on the state.”\nDeep Care proceeds largely chronologically, as abortion defense expanded to include a street movement to defend clinics against escalating attacks by the Christian right, which grew more organized and violent throughout the 1980s and 90s. Hume spoke with several former volunteers and organizers of Bay Area Coalition Against Operation Rescue (later Bay Area Coalition for Our Reproductive Rights), a group organized in the late 80s against a radical anti-abortion group which blocked clinic entrances. She gets into the weeds: how they recruited, how they build and deployed an emergency response network, how and where they stood outside clinics to create literal pathways for access; meeting notes, posters, a street theater wedding mocking the right’s faux piety, which drew on the creative tactics employed by the sister grassroots movement Act Up, to end the Aids crisis.\nThe activists are astute on what drove the right’s dogged focus on abortion, which by the late 80s had become a coalition-building issue: it was always an expression of social and political control. A decade into Roe-era America, Hume writes, citing the insight of a clinic defender named Laura Weide, “the right had figured out how to dog-whistle their racism and build their forces around abortion in a way that enabled their followers to feel moral,” a strategy which has evolved into present-day attacks on healthcare. “Today, the right is recycling the anti-abortion playbook to destroy access to healthcare or even its possibility for trans people. We’re seeing the same information distortion, the harassment, the legislative attacks,” said Hume. “The history teaches us that there will never not be a need for community-based care solutions.”\nWhether in self-help circles, independent clinics or underground networks of clinic defense, small group and community capability is “the heart” of the book, said Hume. “Deep care takes time. It involves learning how to do intimate relationships differently. And it involves acknowledging that we share power by both taking care of each other and taking care of ourselves.”\nHume was finishing the book when the Dobbs decision came down, and it looms; she ends this work of astonishing historical record with notes for the future. Among them: accompany each other, fight to keep clinics open, band against the body cops. And critically, make the referral. “History shows us that a key to safe abortion is the referral to knowledgable, trustworthy care, and the referral has for centuries been a tool of underground abortion workers,” she said. With the spate of recent bans and widespread access to abortion pills by mail, above and underground, via such organizations as AidAccess or Plan C, the referral is “more important than ever before”.\nAnd, crucially, the power of long-term, close-knit, compassion-based work at the local level – assisting with access, for example, or tracing funding for local crisis pregnancy centers that covertly discourage abortion, or combatting misinformation within one’s community. “When small groups of people work closely and securely and dynamically together, they can make revolutionary change,” said Hume. “It can be challenging and it takes a lot of patience and practice, but when you do it successfully, you can really build community power. It’s one of the most important political lessons that there is.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘A story of revolutionary deep care’: revisiting the history of radical abortion defense", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/books/2023/nov/27/deep-care-book-abortion"}