{"authors": [], "date_download": "2024-02-05 15:34:30", "date_modify": "None", "date_publish": "2023-11-26 09:08:44", "description": "11-year-old child among five civilians wounded in bombardment of Ukrainian capital", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fkyiv-drones-russia-ukraine-vitali-klitschko-b2453372.html.json", "image_url": "https://static.independent.co.uk/2023/11/25/13/SEI181517005.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussia has launched its most intense drone attack on Ukraine since its full-scale invasion in 2022, targeting Kyiv.\nMoscow launched around 75 Iranian-made Shahed drones against Ukraine, of which 71 were destroyed by air defense, Ukraine’s armed forces said.\n“Kyiv was the main target,” Ukrainian air force commander Mykola Oleshchuk posted on Telegram.\nThe attack was “the most massive air attack by drones on Kyiv,” said Serhii Popko, head of the Kyiv city administration, noting that air defence shot down more than 60 air targets over the capital throughout the morning.\nEmployees remove debris from a Kyiv kindergarten damaged by Russian drone strikes on Saturday (Reuters)\nThe assault on Kyiv began at 4am on Saturday, continuing in waves for over six hours, and caused power outages in 77 residential buildings and 120 institutions, according to Popko.\nAt least five civilians were wounded in the hours-long drone assault on Kyiv, which saw several buildings damaged, including a kindergarten. The wounded included an 11-year-old child, according to Kyiv mayor Vitali Klitschko.\nFiremen extinguish a blaze at the site of a Russian drone attack in Kyiv on Saturday (AFP)\nIn the city’s Solomiansky district, debris left a crater in the courtyard of a residential area, and the windows of a nearby building were blown out. Residents, most of them elderly, received medical attention at the scene. Others took shelter in a nearby subway station.\nAs people were clearing up debris and broken glass in the neighbourhood, the hum of a fresh wave of drones could be heard nearby.\nResidents immediately began sealing up broken windows using tape and paper to keep out the cold late November winds.\n“Our soldiers shot down most of the drones. Unfortunately, not all,” Ukrainian president Volodymyr Zelensky wrote on Telegram. “But we continue to work to strengthen our air defence and shoot down more,” he said.\nIn addition to Kyiv, the Sumy, Dnipropetrovsk, Zaporizhzhia, Mykolaiv and Kirovohrad regions were also targeted.\nThe attack was carried out on the morning of Holodomor Memorial Day which commemorates the deliberate famine in Soviet Ukraine that killed millions of Ukrainians between 1932 to 1933, and is marked on the fourth Saturday in November.\nMeanwhile, shelling killed one person and wounded three in the southern Kherson region, regional governor Oleksandr Prokudin said on Saturday. According to Prokudin, the region had been shelled 100 times over the previous 24 hours.", "source_domain": "www.independent.co.uk", "text": null, "title": "Kyiv hit by biggest Russian drone attack since war began", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/kyiv-drones-russia-ukraine-vitali-klitschko-b2453372.html"}