{"authors": ["Julian Borger", "Ruth Michaelson"], "date_download": "2024-02-05 15:34:32", "date_modify": "None", "date_publish": "2023-11-26 07:00:13", "description": "Weeks of precarious talks finally led to Friday’s releases of captives. Here’s the inside story", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F26%2Fsurvival-scandal-a-secret-cell-how-the-nail-biting-israel-hamas-hostage-deal-was-done.json", "image_url": "https://i.guim.co.uk/img/media/d5374b71bb0c8b2e46bdaebacb4e4c25ba55c0da/0_124_2553_1532/master/2553.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=656c18f5ac24eef87de037971626249a", "language": "en", "localpath": null, "maintext": "The footage of hostages, many of them teenagers and younger, being seized and driven away crying and pleading with their captors, was as harrowing as the sight of the corpses Hamas left behind.\nThe slaughter of Israeli civilians on 7 October was intended to strike terror into the Israeli psyche and inflict a lasting wound. The hostage-taking was done for other reasons: as a brake on Israeli retaliation and to trade for Palestinian prisoners in Israeli jails. Seven weeks later, it has clearly worked better as a bargaining chip than as a deterrent.\nThe estimated 240 hostages in Gaza did not stop the intense, relentless bombing of Gaza or the ground offensive on 27 October. Only now, almost a month on, has a four-day lull been agreed, arguably when it suits the Israel Defense Forces (IDF). If Saturday’s crisis, which halted the second round of releases, can be overcome, the ceasefire could be expanded by a few days perhaps, but Israel has left little doubt the war will go on.\nThe planned release of as many as 150 Palestinians, on the other hand, is an important gain for the mastermind of the 7 October attack, Yahya Sinwar, who spent more than 23 years in an Israeli prison. It is where he became fluent in Hebrew and acquired an in-depth grasp of Israeli politics and society. It is also where he developed a determination to liberate the thousands of Palestinians held in Israeli jails.\nView image in fullscreen An image grab from a video released by the Hamas Media Office shows a member of its Al-Qassam Brigades leading Yaffa Adar to Red Cross officials in Gaza on 24 November. Photograph: Hamas Media Office\nSinwar was released in 2011, one of 1,000 Palestinians swapped for a single Israeli soldier, Gilad Shalit. The ratio of Palestinians to Israelis this time will be smaller, at three to one, but those freed are mostly women and teenagers from the West Bank, caught in the dragnet of Israeli administrative detention, meaning many have never been charged or tried. The release of the first batch of these prisoners was celebrated with fireworks and street parties across the West Bank, boosting Sinwar’s stature there amid growing discontent with Hamas’ rivals, Mahmoud Abbas and the Palestinian Authority.\nOn the Israeli side, Benjamin Netanyahu tried to stop the voices of the hostages’ families dominating the narrative of the war, largely out of concern it would slow the momentum of the military response to the 7 October attack and the overarching aim of smashing Hamas permanently. The ultimate political survivor, Netanyahu realised the families were a potential political threat. They, like much of Israel, hold him responsible for Israel’s failure to protect its people, and he has been wary of direct encounters with them.\nWhen he finally agreed to meet selected representatives of just five families on 15 October, it caused a scandal. Once the meeting was under way, four other supposed hostage relatives materialised, previously unknown to the families’ organisation. One reportedly urged Netanyahu to “act coolly and decisively” and not to be deflected from the military campaign by the agony of the hostages and their loved ones. His intervention caused uproar in the room as the families claimed they had been ambushed by carefully-staged “politically convenient” theatre.\nView image in fullscreen Thai workers taken hostage by Hamas after their release in Tel Aviv. Photograph: Ministry Of Foreign Affairs Thailand/Reuters\nNetanyahu embraced the relatives in front of the camera, but they emerged even more suspicious of him, and warned that if they were sucked into further stunts, they would ask US president Joe Biden to represent their interests instead.\nBiden had already talked at length to the families of the 10 American citizens still unaccounted for, two days before Netanyahu’s meeting. Presidential aides who were in the Oval Office when he made the Zoom call said it was “one of the most gut-wrenching things” they had experienced. Biden extended the call until every family had had the chance to speak and express their emotions.\nSoon afterwards, when Biden landed in Tel Aviv on a one-day trip on 18 October, he met the families in an even more emotional encounter. Once again, his later meetings with Israeli officials were pushed back to make time for hostages, and US officials said he made the hostages’ plight a central theme of his talks later in the day with Netanyahu.\nBiden prides himself on the personal connection he makes with the public, and his instinctive, emotional response to events. His conversations with the hostage families were a factor in the unconditional nature of support he pledged to Israel, but also fed his insistence that the hostage issue stay at the heart of Israeli war aims.\nBefore Biden even met the families, wheels were already turning in Washington to find a way to dealing with the issue.\nA few days after 7 October, the Qatari ruling family, which has long hosted Hamas representatives in Doha, made contact with the administration to establish a Qatari-US-Israeli working group on the hostage issue. This also required input from the Egyptians, whose spy chief Abbas Kamel has long served as the principal interlocutor with both Hamas and the Palestinian Islamic Jihad inside Gaza. Kamel brokered a ceasefire there two years ago, and relayed critical messages in the closing phase of the deal.\nThe US national security adviser, Jake Sullivan, delegated his Middle East coordinator, Brett McGurk. and the White House deputy counsel, Josh Geltzer, as US representatives to this group whose existence, at the request of the Qataris and Israelis, remained a secret from the rest of the administration.\nEvery morning, McGurk held an early call with the Qatari prime minister, Sheikh Mohammed bin Abdulrahman Al Thani, on Qatari contacts with Hamas. McGurk would then brief Sullivan, who would brief Biden. The president on occasion took part in the calls with the Qataris. “This cell established processes that proved to reach Hamas directly,” a senior US official said.\nThe “secret cell” process was put to the test with the release of two American hostages, Judith Raanan and her teenage daughter, Natalie, on 20 October. As they were led on a potentially perilous journey to the Rafah crossing point, their progress was monitored live by Sullivan and McGurk from the White House. As soon as they were met by a US diplomat on the Egyptian side, Biden phoned Natalie’s father to confirm they were free.\nFour days later, two Israeli hostages were released, and work on a much more ambitious exchange accelerated, now with the Mossad director, David Barnea, as the lead official on the Israeli side, working closely with his US counterpart, CIA chief, William Burns.\nThe contours of the hostage deal had taken shape by 25 October, after Hamas offered to free not just women and children but the elderly and sick too – in return for a five-day ceasefire and the release of a larger number of Palestinians.\nThe Israelis were unconvinced. Hamas produced no list of hostages, nor proof of life. They told negotiators they could not give a complete account of the number of hostages without a ceasefire, as multiple groups including civilians were holding them in different places in Gaza – not even Hamas could locate them all. Netanyahu’s government, determined to make up for the security lapses that allowed the Hamas attack to happen, saw the initial Hamas offer as a ploy to forestall the imminent Israeli ground offensive.\nThe Americans agreed, but argued as a compromise that the assault be carried out in phases, with the idea that it could be paused after each phase if a genuine opportunity arose to exchange prisoners. The first incursions, spearheaded by tanks and infantry, began on 27 October.\nThe ground offensive did not break the flow of hostage negotiations, but they were suspended a few days later after two devastating air strikes on the Jabalia refugee camp outside Gaza City, killing more than 100 people. Hamas negotiators in Qatar, said a source familiar with the talks, briefly walked away from the table, furious at the loss of life.\nWithin a few days, Sinwar was back in contact with the prospect of a better offer, suggesting Hamas was ready to accept a shorter ceasefire in return for 50 women and child hostages. Negotiators attempted a compromise, suggesting the release of 10-15 hostages in return for a shorter ceasefire, in a bid to engender trust between the parties.\nBarnea and Burns flew to Doha on 9 November to talk about details and logistics of the deal, but the sticking point for the Israelis remained the same: the absence of details of who would be released, or proof they were still alive and under Hamas control.\nIn the White House telling of the story, it was Biden who broke the deadlock with a call to the emir of Qatar, Sheikh Tamim bin Hamad Al Thani, on 12 November. According to a senior US official, the president told the monarch “enough was enough” and that without details of the age, gender and nationality of the 50 hostages in question, “there was no basis to move ahead”.\nShortly afterwards, the required list materialised, and a final deal seemed to be at hand. But events on the ground in Gaza again slowed progress in Doha, and Sinwar had gone silent. Israeli tanks and troops surrounded the al-Shifa hospital in Gaza, which they said stood atop an extensive Hamas command bunker, a claim long denied by Hamas. On 15 November, Israeli forces raided the hospital, later discovering a small cache of weapons inside and tunnels underneath the facility.\nView image in fullscreen Yahya Sinwar, head of Hamas in Gaza. Photograph: Adel Hana/AP\nSinwar demanded the IDF leave the complex. The Israelis flatly refused but offered to take steps to keep the hospital open. In Doha, Hamas negotiators were visibly displeased by the escalation happening in Gaza, but remained at the negotiating table. After two days’ silence, Sinwar once again resumed contact with both Kamel, the Egyptian spy chief, and the political branch of Hamas in Qatar, making clear the hostage deal was still on offer.\nIt was Netanyahu’s turn to come under pressure from the Oval Office. By then, the Israeli prime minister was more inclined to come to an agreement. The hostage families’ organisation had emboldened their campaign on the home front, including protesting outside Netanyahu’s residence, and public support was growing. According to the account of a US official, Netanyahu grabbed McGurk’s arm after one meeting in Tel Aviv and told him: “We need this deal.”\nIn the last few days, the decision was in the hands of Netanyahu’s cabinet. The PM could claim the support of Biden, who he gave credit to for improving the bargain in Israel’s favour, and of the Israeli security forces, insisting that a hostage deal would not impinge on their capacity to destroy Hamas.\nThrough their own insensitivity and ineptitude, the most hardline party in the coalition, Otzma Yehudit, led by the national security minister Itamar Ben Gvir, had isolated themselves. On Monday, their leaders could be seen on television haranguing the hostage families during a Knesset committee session, reducing some to tears, with one minister yelling that they didn’t have a “monopoly of pain”.\nThat same evening, family members were left waiting outside government buildings in the cold because prime ministerial aides had misjudged the size of room necessary for a meeting with Netanyahu and his ministers. It enhanced public perception that they were being treated as disposable pawns.\nThe cabinet voted to approve the deal on Wednesday morning, but not before Netanyahu had sprung a final surprise, declaring that the International Committee of the Red Cross (ICRC) would be able to visit the remaining hostages as part of the deal, a statement that came as a surprise to the organisation and possibly to the negotiators.\nDoha formed its own “operations room”, according to Qatari foreign affairs spokesperson Majed Al-Ansari, set up to monitor the situation minute-by-minute through contact with the ICRC, Hamas’ political office, Israeli officials and Egyptian diplomats.\nBy Friday evening, Saudi Arabian channel Al Arabiya broadcast the first pictures of a line of white Red Cross four-wheel-drive vehicles driving out of Gaza, illuminated only by their own headlights. The first 13 Israeli hostages were freed. Meanwhile, Israel transferred 39 prisoners to Ofer prison near Ramallah before their release. This includes 24 women, some convicted of crimes like carrying weapons or attacking Israeli forces – charges they denied – and 15 teenagers jailed for offences as minor as throwing stones. Video flooded the internet of teenagers reuniting with families after years in prison, a son gripping his mother’s hand and weeping.\nThe surprise of the day was that one Filipino and 10 Thai migrant workers were also among the first consignment of hostages. They had been swept up as Hamas rampaged across the villages and kibbutzim of southern Israel on 7 October, and the Thai government had been pursuing its own diplomatic campaign to have them released, involving Thai negotiators visiting Cairo, Doha and Tehran.\nOn Thanksgiving holiday in Nantucket, Biden predicted dozens more hostages would be released and the ceasefire would be extended. The agreement includes a clause allowing for its extension by one day for each extra 10 hostages released. But Hamas has indicated it will not release “military” hostages, which it defines as any potential reservists, setting up a tough discussion about any potential future prisoner exchange.\nThe hope that the hostage deal might lead to broader diplomacy to achieve a more enduring truce looks optimistic, to say the least. Netanyahu only sold the agreement to the cabinet and the security forces on the grounds that Israel would go right back on the attack in its mission to obliterate Hamas.\nThe IDF is poised to enter Shuja’iyya, a densely packed neighbourhood in the north of Gaza with a historically strong presence of different militias. IDF generals then want to move south to Khan Younis in pursuit of the enemy, setting up a fresh humanitarian crisis with millions of civilians sheltering south of the Gaza river after fleeing the north, and more than 14,000 dead and 36,000 injured in the enclave.\nThe pause may have suited the IDF, giving them time to regroup, but they are far from declaring victory. Hamas remains entrenched in its bunkers, and its leadership has retained sufficient coherence to conduct sustained negotiations. It has reason to fight on in the belief the IDF are running out of time, and that the world’s patience is dissipating. The White House has indicated it will not support a southern offensive without completely different IDF rules of engagement when it comes to civilians. It does not want to see Khan Younis flattened the way large parts of northern Gaza have been demolished.\nThe hostage deal has brought a rare burst of joy to a few Israelis and Palestinians, and some days of respite and sustenance to more than two million besieged Gazans, but there is little sign it has brought them salvation or peace.", "source_domain": "www.theguardian.com", "text": null, "title": "Survival, scandal, a secret cell: how the nail-biting Israel-Hamas hostage deal was done", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/26/survival-scandal-a-secret-cell-how-the-nail-biting-israel-hamas-hostage-deal-was-done"}