{"authors": ["Aseel Mousa"], "date_download": "2024-02-05 15:34:33", "date_modify": "None", "date_publish": "2023-11-26 13:26:55", "description": "People trying to escape Israeli bombardment have to cope without the most basic life necessities", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F26%2Fpalestinians-describe-fleeing-northern-gaza.json", "image_url": "https://i.guim.co.uk/img/media/d39f385785fb54352dd26d3731ab395b0d3f6e7a/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=40f6e3073aa8fe042e773e58e177c468", "language": "en", "localpath": null, "maintext": "Dogs biting at a human corpse. An exhausted, heavily pregnant woman carrying a toddler on her back. A seemingly lifeless body pushed on a cart. The sights of the Salah al-Din road, the main highway that runs like a spine through Gaza, remain with those who’ve walked it.\n“What we experienced cannot be seen in horror movies,” said Nahla from Beit Lahia in northern Gaza.\nUnder siege, hungry, thirsty, and encircled by Israeli troops, her family had been determined to stay in their homes. But one night the intense Israeli bombing campaign left their house in ruins. “Miraculously, we escaped death and sought refuge in our neighbours’ house,” she said. At 6am the next morning, Nahla and her four children began the slow walk south.\nIsrael’s war has split the territory of 2.3 million people in two, with the military telling Palestinians to move below the Gaza river to what it calls “safe zones”. Still, it has continued to bomb the entire strip, wiping out families it says are unfortunate causalities in its targeting of militants.\nTo get people to move, the Israel Defense Forces (IDF) have often advertised what they call “humanitarian corridors” along the Salah al-Din Road for four hours a day, which they say is to help civilians to flee. UN rights experts warn, however, that demands for civilians to leave while under bombardment, and with no guarantee of safe return, amount to a forcible population transfer, which is a crime against humanity.\nSpeaking from the al-Maghazi camp in the central Gaza Strip, Nahla described walking past Israeli soldiers, holding up rags of white clothing in the hope they would not be shot. “We were thousands of people, with children crying, women screaming, and many disabled people who could not walk,” she said.\nOne of her daughters, Yara, 16, said soldiers were pointing their guns straight at them. “I saw Israeli tanks for the first time in my life on the ground.” The soldiers told people to raise their hands and hold up their identity documents, which would be inspected at a checkpoint.\nAt one point, Yara’s ID card fell out of her hand. “I bent down to pick it up, and the Israeli soldiers started shooting at my feet. They told me that I was prohibited from picking up anything on the ground.”\nView image in fullscreen People flee following Israeli air strikes on a neighbourhood in the al-Maghazi refugee camp on 6 November. Photograph: AFP/Getty Images\nYoung Palestinian men were singled out from the crowds. Israeli soldiers told them to line up, calling them out using a megaphone, and then detaining and stripping them naked.\nNow living in an abandoned school, the small family are getting cold as winter sets in. They had slept in a tent in the schoolyard, but moved into the corridor once the rain started. “There is no room for us in the classroom,” said Nahla. “My two daughters, Yara and Asmaa, are trembling with fear to this day. They refuse to sleep except next to me.”\nIn the same building, 15-year-old Saja sits beside her injured mother on a worn-out mattress. She made the journey south after being bombed out twice in northern Gaza.\nThe family of six had lived in the Jabalia refugee camp for the past two decades. “We are a peace-loving family that cherishes life,” said Saja.\nThe IDF called her father one day on his phone, telling him their home would be a target. They then moved to her grandfather’s place, but a strike on a neighbour left shrapnel in her mother’s leg.\nThey moved to the Indonesian hospital but it too came under heavy bombardment. “Entire neighbourhoods in Jabalia camp were obliterated,” said Saja. “When we decided to evacuate we joined hundreds of Palestinians … moving in groups, pushing wheelchairs carrying my mother and sister. With us, we only had a minimal supply of canned food and our identification documents.\n“Upon reaching Salah al-Din street, we encountered tanks and occupation soldiers who shouted at us. Some even laughed.\n“We were not allowed to deviate from the prescribed path, constantly holding up our IDs with our right hands,” she added. “As we walked past a soldier, we moved slowly due to my mother and sister’s critical condition. The soldier shouted at us: ‘Run quickly.’”\nSaja's journey map Saja’s journey map\nEventually, they crossed the river, and paid for a donkey cart to take them to Bureij camp. “Our initial attempt to seek shelter at the [UN] school there was met with refusal.” They boarded another donkey cart and headed to Maghazi camp.\n“Upon our arrival, a compassionate displaced woman took pity on our situation and provided a mattress for my injured mother,” said Saja.\nSitting beside her, her leg wrapped with metal poking out of it, Saja’s mother, Maha, spoke in a weak voice: “Here, there are no necessities for life – no food, no treatment, no healthcare, nothing humane,” she said. The days, she said, “resembles life in a forest, where we fight even for water”.\nView image in fullscreen Maha’s leg injury. ‘Here, there are no necessities for life,’ she said. Photograph: Aseel Mousa\nIsrael’s offensive, launched in the wake of Hamas’s 7 October attack that killed 1,200 people, has killed more than 14,000 people, and thousands are still missing. A four-day ceasefire that begun on Friday has allowed more aid to reach Palestinians struggling to survive with shortages of water and other essentials. Aid has also reached northern Gaza for the first time in a month.\nAya Hammad, 23, was at home in the Sabra area of Gaza City in early November when her father and two sisters received calls from the IDF, instructing them to evacuate.\n“We didn’t have the luxury of contemplating the supplies we might need,” she added. “We carried only our identity documents and a small bag containing a single piece of clothing to mitigate the harshness of the impending winter cold.”\nOnce across the Gaza river, her family found shelter in the abandoned house of a friend in the southern city of Khan Younis. “The temporary refuge we currently occupy resembles a ghost town, devoid of any human presence,” she said.\n“There is no electricity, no internet, no water, and no food. Our neighbours provide us with a small amount of water to prevent us from dying of thirst.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘Soldiers started shooting at my feet’: Palestinians describe fleeing northern Gaza", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/26/palestinians-describe-fleeing-northern-gaza"}