{"authors": [], "date_download": "2024-02-05 15:34:34", "date_modify": "None", "date_publish": "2023-11-26 15:54:18", "description": "Israel’s Foreign Ministry says it will summon the Irish ambassador over a tweet celebrating the release of a 9-year-old girl from Hamas captivity", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fisrael-ap-hamas-irish-leo-varadkar-b2453745.html.json", "image_url": "https://static.independent.co.uk/2023/11/26/15/Israel_Palestinians_Thai_Hostages_65644.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIsrael's Foreign Ministry said Sunday that it would summon the Irish ambassador over a tweet celebrating the release of a 9-year-old girl from Hamas captivity, alleging the post didn't adequately condemn the militant group.\nEarlier Sunday, the Irish prime minister lauded the release of Emily Hand, an Israeli-Irish girl whose story has captivated both nations.\n“An innocent child who was lost has now been found and returned, and we breathe a massive sigh of relief. Our prayers have been answered,” Irish Prime Minister Leo Varadkar posted on the X platform, formerly known as Twitter.\nThe girl was initially believed to have been killed in the Oct. 7 assault on southern Israel by Hamas and other militants. A month ago, her father learned that she was actually alive and among about 240 people held hostage by Hamas in Gaza.\nThe Hamas attack, which killed about 1,200 people in Israel, triggered a blistering Israeli air and ground assault on Gaza in which at least 13,300 Palestinians, about two thirds of them women and children, have died.\nEmily was one of 17 hostages released by Hamas on Saturday, the second day of a four-day cease-fire that allowed critical humanitarian aid into Gaza and gave civilians their first respite after seven weeks of war.\nIsraeli government officials criticized Varadkar's tweet, arguing that it cast what happened to Emily as a disappearance rather than a violent abduction by Hamas militants.\n“Mr. Prime Minister, It seems you have lost your moral compass and need a reality check! Emily Hand was not ‘lost,’ she was kidnapped by a terror organization worse than ISIS,” Israeli Foreign Minister Eli Cohen tweeted. He alleged that Varadkar was “trying to legitimize and normalize terror,” and summoned the Irish ambassador to Israel for a reprimand.\nIrish government figures came quickly to the prime minister’s defense. The Irish minister for public expenditure, Paschal Donohoe, said Varadkar has been “unambiguous in condemning the violence of Hamas and also calling for restraint from Israeli military forces.”\nIreland’s foreign affairs department said that the “government has been clear at every stage that all hostages abducted by Hamas should be released immediately and unconditionally.” It said the Irish ambassador was to meet Israeli Foreign Ministry officials on Monday.\nThe summons is the third issued by Israel since the start of the Israel-Hamas war. Israel has also called in the ambassadors of Belgium and Spain after the countries' leaders criticized Israel for the high civilian death toll in Gaza. The Spanish leader also called for European Union recognition of a Palestinian state.\n___\nSylvia Hui contributed to this report from London.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel summons Irish ambassador over tweet it alleges doesn't adequately condemn Hamas", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/europe/israel-ap-hamas-irish-leo-varadkar-b2453745.html"}