{"authors": [], "date_download": "2024-02-05 15:15:58", "date_modify": "None", "date_publish": "2024-01-24 04:12:13", "description": "The U.S. military struck three facilities in Iraq and two anti-ship missiles in Yemen within hours of each other in its continued effort to keep violence from the Israel-Hamas war from spilling over into a wider conflict", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-iraq-yemen-syria-kataib-hezbollah-b2483757.html.json", "image_url": "https://static.independent.co.uk/2024/01/24/04/United_States_Red_Sea_Houthis_00428.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. military struck three facilities in Iraq and two anti-ship missiles in Yemen operated by Iranian-backed militias that have continued to instigate attacks on U.S. personnel and ships in the region as the U.S. continues to try to keep the Israel-Hamas war from spilling over into a wider conflict.\nBoth the strikes in Iraq and Yemen targeted sites that the U.S. has said are involved in the attacks against U.S. forces in Iraq and Syria and were threatening U.S. military and commercial vessels in the Red Sea.\nIn a statement Tuesday, Defense Secretary Lloyd Austin said the strikes in Iraq were at the direction of President Joe Biden and targeted facilities used by the Iranian-backed Kataib Hezbollah militia group and other Iran-affiliated groups in Iraq.\n“These precision strikes are in direct response to a series of escalatory attacks against U.S. and Coalition personnel in Iraq and Syria by Iranian-sponsored militias,\" Austin said. Those strikes hit militia facilities in Jurf al-Sakhar, which is south of Baghdad, al-Qaim and another unnamed site in western Iraq, two U.S. officials said.\nLate Tuesday, U.S. Central Command announced it had also struck two Houthi anti-ship missiles that were aimed into the Southern Red Sea and were prepared to launch.\n“U.S. forces identified the missiles in Houthi-controlled areas of Yemen and determined that they presented an imminent threat to merchant vessels and the U.S. Navy ships in the region,” Central Command said.\nBoth fronts — land attacks in Iraq and Syria, and sea attacks originating from Yemen — have seen a significant uptick in launches and counterstrikes over the last few days. In Iraq, U.S. strikes on the Kataib Hezbollah sites came hours after the U.S. said militants fired two one-way attack drones at al-Asad Air Base, injuring U.S. service members and damaging infrastructure. And they followed the militia's most serious attack this year on the air base, when it launched multiple ballistic missiles on Saturday.\nU.S. Central Command said it targeted Kataib Hezbollah headquarters, storage, and training locations for rocket, missile, and one-way attack drone capabilities.\nIn Tuesday's drone attacks against al-Asad, U.S. defenses were able to intercept the first drone but it crashed on base and the second drone hit the base, U.S. officials said. Injuries, including traumatic brain injuries and smoke inhalation, were reported to be minor. The officials spoke on the condition of anonymity to provide details that had not been announced publicly.\nTuesday's strikes on the Houthi missile launch sites in Yemen follow a joint operation Monday night where the U.S. and U.K. used warship- and submarine-launched Tomahawk missiles and fighter jets to take out Houthi missile storage sites, drones and launchers.\nOn both fronts, the Iranian-backed militias have employed ballistic missiles to target U.S. bases and ships, which marks an escalation, said Behnam Ben Taleblu, a senior fellow at the Foundation for Defense of Democracies who specializes in Iran. The militias have typically used drones and rockets to attack. Tehran supplied Shia militias in Iraq with short-range and close-range ballistic missiles in 2019, Taleblu said, but until November’s attacks they had not been used.\nDuring Saturday’s larger-scale attack, multiple ballistic missiles and rockets launched by Iranian-backed militants targeted al-Asad, but most were intercepted by air defense systems there, Sabrina Singh, Pentagon spokesperson, told reporters on Monday. She said other munitions hit the base.\nAl-Asad is a large air base in western Iraq where U.S. troops have trained Iraqi security forces and now coordinate operations to counter the Islamic State group.\nSingh said Saturday’s attack was a “barrage.” It was the first time since Nov. 20 that Iranian proxy forces in Iraq had fired ballistic missiles at U.S. bases in Iraq.\nA coalition of militias calling itself the Islamic Resistance in Iraq has taken credit for a number of the attacks on U.S. forces. Kataib Hezbollah is one of the groups within that umbrella organization.\nIran has also supplied the Houthis with ballistic missiles, and that group is the first Iranian proxy to fire medium-range ballistic missiles and anti-ship ballistic missiles, Taleblu said.\n“With Yemen, think of it as an intensification of the problem,” Taleblu said.\nSaturday’s ballistic missile attack on al-Asad injured four U.S. service members, all of whom have returned to duty. One Iraqi security forces member was also injured.\nSince the Israel-Hamas war began in early October there have been more than 151 attacks on U.S. facilities in Syria and Iraq. According to the Pentagon, two attacks took place on Monday and included multiple rockets fired at U.S. and coalition troops at Mission Support Site Euphrates in Syria and a single rocket fired at the Rumalyn Landing Zone in Syria. Neither attack resulted in casualties or damage.\nThe U.S. struck back at the militia groups late last month, ordering a round of retaliatory strikes after three U.S. service members were injured in a drone attack in northern Iraq. Kataib Hezbollah claimed credit for the attack, carried out by a one-way attack drone.\nThe U.S., in response, hit three sites, destroying facilities and likely killing a number of Kataib Hezbollah militants, according to the White House at the time.", "source_domain": "www.independent.co.uk", "text": null, "title": "US hits Iraq militia sites and anti-ship missiles in Yemen as fight with Iranian proxies intensifies", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-iraq-yemen-syria-kataib-hezbollah-b2483757.html"}