{"authors": ["Callie Patteson"], "date_download": "2024-02-05 15:34:36", "date_modify": "None", "date_publish": "2023-11-26 16:21:41", "description": "FOUR-year-old Abigail Edan has been released from captivity by Hamas, becoming the first American hostage to return to family amid the temporary truce", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24862254%2Fhamas-first-american-hostage-released%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/ZA-HOSTAGE-OP4.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "FOUR-year-old Abigail Edan has been released from captivity by Hamas, becoming the first American hostage to return to family amid the temporary truce with Israel.\nAbigail's release comes nearly two months after both of her parents were killed during the October 7 Hamas attack on Israel.\n3 Abigail Edan was the first US hostage released by Hamas on Sunday Credit: Tal Edan via AP:Associated Press\n3 Her release comes amid the temporary ceasefire between Israel and Hamas Credit: AP\n3 17 people were released from captivity Sunday Credit: AFP\nPresident Joe Biden confirmed her release Sunday afternoon, saying she was in the hands of Red Cross officials.\n\"She's free and she's in Israel,\" Biden said.\nAbigail's release comes amid a temporary ceasefire between Hamas and Israel.\nBiden told reporters that it is his administration's goal to extend the ceasefire, in order to \"increase the assistance getting in to the Gaza civilians who need help, and to facilitate the release of hostages.\"\n\"That's our goal: to keep this pause going beyond tomorrow,\" Biden said.\nThe Israel Defense Forces revealed that 17 people, including 14 Israelis, were released on Sunday after being held captive for nearly 50 days.\nIn exchange, 39 Palestinian prisoners are also expected to be released on Sunday, Qatar foreign ministry spokesperson Majed Al-Ansari announced on social media.\nIsrael declared war on Hamas in October following the brutal attack that left around 1,200 people dead, according to the Associated Press.\nAt the time, the militant group had taken approximately 240 people hostage.\nWhite House national security adviser Jake Sullivan suggested earlier on Sunday that the US was \"hopeful\" Edan would be one of the hostages released.\n“We are hopeful that Abigail will be released,” Sullivan said.\n“We have a sense of who it is, but I just am not in a position to confirm it because we want to make sure the release goes off as indicated, as we expect.”\nThe Israeli-American girl was first taken hostage after her father Roy Edan and mother Smadar Edan were shot and killed, according to the New York Post.\nHer father was reportedly holding Abigail at the time.\nAbigail's family hoped she would be released earlier in the weekend.\nHer aunt Liz Hirsh Naftali told CNN last week that they hoped she would be returned to family ahead of her birthday on November 24.\n“Friday is her fourth birthday. We need to see Abigail come out, and then we will be able to believe it,\" she said.\nTwo other American woman remain held by Hamas.\nTheir identifies have not been released.\nSunday marks the third day in a row that hostages have been released by the militant group.\nAs part of the temporary truce, at least 50 hostages held by the terror group are expected to be released, according to The Guardian.\nAll of the hostages released will be women and children.\nIn exchange, Israel is expected to release around 150 Palestinian woman and children prisoners.\nOn Saturday, another 13 Israeli hostages were released, alongside four Thai hostages.\nA fourth exchange of hostages is expected to take place on Monday, according to The Associated Press.\nThe temporary truce deal comes after weeks of negotiations with Qatar, the United States and Egypt serving as mediators.", "source_domain": "www.thesun.co.uk", "text": null, "title": "Hamas releases first American hostage since truce as four-year-old Abigail Edan is freed after her parents were killed", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24862254/hamas-first-american-hostage-released/"}