{"authors": ["James Reinl", "Social Affairs Correspondent", "For Dailymail.Com"], "date_download": "2024-02-05 15:34:37", "date_modify": "None", "date_publish": "2023-11-26 12:10:37", "description": "'This entire cottage industry of discrimination under the guise of 'equity' has created substantial liability for countless major corporations,' said activist lawyer Gene Hamilton.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12781607%2FDEI-woke-backlash-Target-Macys-Bud-Light-diversity.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/23/18/77835607-0-Organizers_now_want_people_to_boycott_Macy_s_including_its_flags-a-22_1700764047553.jpg", "language": "en", "localpath": null, "maintext": "It's been a tough year for the diversity, equity, and inclusion (DEI) industry, which seeks to reshape America's colleges and workplaces.\nA Supreme Court ruling effectively stopped college admissions tutors giving applicants a leg-up due to their race. Such big-name brands as Bud Light, Macy's and Target have lost customers and faced legal fights over diversity schemes.\nBut while DEI managers are on the ropes, they're not going away any time soon.\nA survey of DEI professionals last month showed they had been floundering in 2023, but were adjusting their efforts rather than disappearing.\nDEI professionals are concerned, presenting their subject differently, but not changing course\nEdward Blum's Supreme Court defeat of affirmative action changed the game for DEI\nCarolyn Berkowitz, president of the Association of Corporate Citizenship Professionals, which surveyed 112 of its members, said nearly two thirds were 'concerned' about their firm scrapping its diversity goals.\nAlmost all of them said they had started talking about their work differently after the SCOTUS decision.\nAbout two thirds said they were using different language to discuss DEI, another quarter said they were simply talking about it less.\nStill, fewer than one-in-ten members said their firm had actually scaled back its diversity targets.\nFor Berkowitz, a staunch advocate of getting more women and minorities into good jobs and colleges, the change has been 'largely cosmetic.'\nThe 'work continues' despite the 'uncertain environment' in 2023, she added.\nWhile DEI advocates say they bring more black, brown, female, and queer talent into firms and raise morale across the board, critics call them a virtue-signaling exercise that fosters backlash discrimination against straight, white men.\nIn offices and factories nationwide, DEI teams end up butting heads with long-standing employees thanks to their compulsory training in tackling racial bias, microaggressions, and 'white privilege'.\nThey have faced greater scrutiny since the Supreme Court in June ruled against race-conscious admissions programs at two universities, effectively prohibiting affirmative action policies on US campuses.\nTrans influencer Dylan Mulvaney's tie-up with Bud Light sparked a conservative backlash and boycott that cost the beer-maker millions\nThe court's ruling did not cover businesses, many of which launched their own DEI efforts as part of a broader anti-racism push after George Floyd's murder in 2020 by a white Minneapolis cop.\nThey included making it easier for women and minority staff to highlight problems they face or report harassment and abuse.\nOther firms introduced hiring and promotion quotas to get more non-white men into senior roles.\nSome went further still, making diversity and inclusion central to how a company presented itself.\nOn occasion, these public-facing displays of wokery backfired, including with disastrous consequences.\nBud Light's tie-up with transgender influencer Dylan Mulvaney led to a boycott that saw its sales and stock value tank.\nCustomers complained about Target's in-your-face displays of LGBTQ+ gear, including 'tuck' swimsuits for trans women.\nShoppers demolished clothing displays with their bare hands and shared footage on social media.\nTarget's 'Pride' range sparked a similar backlash, with some conservative shoppers demolishing displays with their bare hands\nA protestor outside a Target store in Miami, Florida\nMacy's joined the list this week, with more than 40,000 people signing a petition and some calling for a boycott over the inclusion of two gender non-conforming Broadway performers in the Thanksgiving Day Parade.\nBut perhaps DEI's bigger problem has been in actual courtrooms — not the court of public opinion.\nEdward Blum, the long-time foe of affirmative action who brought the successful Supreme Court suit, has diverted his attention from universities and focussed on diversity hiring in the private sector.\nBlum's group, the American Alliance for Equal Rights, sued the law firms Morrison & Foerster LLP and Perkins Coie LLP over fellowship programs, which were only open to minorities and effectively discriminated against whites.\nBoth firms have since eliminated those diversity rules.\nDrug firm Pfizer nixed race-related requirements from a similar fellowship scheme after a suit challenging it had been dismissed.\nAmerica First Legal (AFL), a legal action group founded by Stephen Miller, a former senior adviser to President Donald Trump, has filed complaints with the US Equal Employment Opportunity Commission over corporate DEI schemes.\nFilings against more than 20 companies, including American Airlines, Macy's, McDonald's, and Salesforce say their efforts to hire and promote more women and non-whites amount to discrimination.\nThere are other signs of setbacks for DEI teams.\nResearch by Revelio Labs, a workforce data company, earlier this year found that Amazon, Applebee's, Twitter, Nike, Wayfair, and other top firms had been scaling back the size of their DEI teams.\nAs the tech industry laid off tens of thousands of workers last summer, DEI teams shed about a third of their staff.\nMacy's was accused of staging a 'trans extravaganza' at its Thanksgiving Day Parade, which has kicked off the holiday season since 1924\nTens of thousands signed a petition against Macy's 'non-binary and transgender extravaganza' on a national holiday\nThe petition took aim at the appearance of Justin David Sullivan, a trans non-binary Broadway performer\nOther departments were only losing a fifth at the same time, researchers said.\nElon Musk reportedly 'brushed aside' diversity goals when he halved Twitter's 7,500 workforce after completing his takeover deal of the social media firm in October 2022.\nAmong those to exit was its Chief People and Diversity Officer, Dalana Brand.\nAnother notable departure from one of Musk's companies was Bobby Berretta-Paris, a five-year Tesla veteran who led the carmaker's LGBTQ+ efforts.\nGoogle's 'Director of Global Mental Health and Well-being,' Kristin Maczko, was also cut.\nThose cuts raised tough questions for 'Diversity Officers,' who have struggled to stay relevant in business, making lackluster gains despite generous budgets, and as memories of George Floyd's murder and the anti-racism protests it sparked recede.\nAt the same time, there are signs of DEI becoming ever-more embedded into US institutions.\nThe Pentagon this week asked for $114 million for its DEIA programs, which also promote 'accessibility.'\nIt was the Defense Department's biggest ever such request, needed, officials said, to meet commitments on diversity in the armed forces.\nThe request drew ire from conservatives, who accuse the military of going soft, focussing on liberal social policies instead of readying for warfare.\n'Abolish DEI, send the money back to taxpayers,' tweeted Chris Rufo, a conservative scholar.\n'Abolish DEI,' says the conservative academic Christopher Rufo\nIt remains unclear whether a muted version of DEI work will continue to reshape workplaces on the quiet, or whether the backlash from legal activists and consumers will end quotas and other targets for good.\nMajor firms with longstanding diversity schemes are more likely to stick with them, industry insiders have said.\nThose that are newer to DEI are more likely to scrap or downgrade them.\nBerkowitz is convinced that only a 'vocal minority' or naysayers are trying to sink DEI, and that growing talented, modern-facing and diverse teams makes businesses richer and more successful.\nBut for Samia Kirmani, a co-leader of the corporate diversity practice for employer law firm Jackson Lewis PC, DEI has become a hot-button issue that must be approached with care, she told Bloomberg.\n'There is a risk of challenge, risk of liability, the risk of reputational harm,' said Kirmani.\nAFL's general counsel, Gene Hamilton, told the outlet that 'countless' firms had exposed themselves to 'substantial liability' and that his group was 'in the right legally and morally' and would continue its crusade against DEI.\n'No American should suffer from race or sex based discrimination,' he said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Corporate America's DEI showdown: The anti-woke backlash against Target, Macy's and Bud Light has rocked the diversity industry, but its policies persist - under the radar", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12781607/DEI-woke-backlash-Target-Macys-Bud-Light-diversity.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}