{"authors": ["Kieren Williams", "Rachel Hagan"], "date_download": "2024-02-05 15:34:41", "date_modify": "None", "date_publish": "2023-11-25 08:16:21", "description": "Abigail Idan, aged just four-years-old, saw her mum and dad gunned down in front of her by Hamas militants who attacked her kibbutz on the October 7 attack", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fisrael-hamas-ceasefire-hostages-live-31524881.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31520177.ece/ALTERNATES/s1200/2_Abigail.jpg", "language": "en", "localpath": null, "maintext": "A four-year-old US national who's parents were killed in front of her, was amongst the hostages released this evening.\nAbigail Idan had her mum and dad gunned down by Hamas militants during the horrific October 7 attack, before she, and the neighbours she fled to for help, were taken hostage.\nShe was amongst the fourteen Israeli and three foreign hostages have been handed over to the Red Cross, Israel and Hamas have confirmed. After a nervy delay to the hostage release yesterday, today's has gone far smoother so far, with the released 17 hostages believed to be on their way to the Rafah Crossing.\nThis comes on the third day of the temporary ceasefire, as many eyes turn to what will take place when fighting breaks out again. But amongst the freed hostages, two of them were US nationals including four-year-old Abigail Idan, who celebrated her most recent birthday on Friday.\nHowever, for now the truce is still holding, meaning innocents continue to get released as back in the UK tens of thousands took place in a march against anti-Semitism. Amongst those present were disgraced former PM Boris Johnson, and a number of other famous faces.\nThe event was threatened to be marred when far-right agitator Tommy Robinson turned up, but he was led away by police. Organisers had repeatedly stressed his presence concerned them. He was spotted arguing with officers for about 10 minutes before being led away. There had been fears in that Robinson, the former leader of the far-right grouping, could disrupt the protest organised by the charity Campaign Against Antisemitism.\nThe Met Police later confirmed today that a 40-year-old man had been arrested close to the Royal Courts of Justice, from where the demonstration began on Sunday afternoon.\nFollow along for the latest developments below", "source_domain": "www.mirror.co.uk", "text": null, "title": "Israel Hamas ceasefire: US girl, 4, freed after Hamas gunned parents down in front of her", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/israel-hamas-ceasefire-hostages-live-31524881"}