{"authors": ["Brett Lackey", "Brett Lackey For Daily Mail Australia", "Australian Associated Press"], "date_download": "2024-02-05 15:34:44", "date_modify": "None", "date_publish": "2023-11-25 07:16:17", "description": "The frigate HMAS Toowoomba - which was involved in an incident with China earlier this month that saw several Australian Navy divers injured - will be sent to patrol the South China Sea.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12789701%2FAustralian-Navy-sonar-Toowoomba-South-China-Sea-Philippines.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/25/07/78096523-0-Several_divers_from_HMAS_Toowoomba_were_in_the_water_off_the_coa-a-10_1700896159976.jpg", "language": "en", "localpath": null, "maintext": "A Navy frigate and maritime suveillance aircraft will be sent\nAustralia will join the Philippines to patrol the South China Sea\nAustralia and the Philippines have commenced regular joint navy and airforce patrols in the South China Sea, as Pacific nations warily eye an increasingly assertive China.\nThe frigate HMAS Toowoomba - which was involved in an incident earlier this month that saw several Australian navy divers injured when a Chinese warship set off sonar pulses - will be sent along with a P8-A maritime surveillance aircraft.\nOn the day of the naval incident Anthony Albanese was posing for pictures with iconic Aussie TV character Bluey but later said he 'knew' China carried out the attack.\nChina denied the allegation but Mr Albanese slapped down that statement when asked if he believed China had carried out the attack.\n'I know they did,' Mr Albanese said.\n'The Australian Defence Force and the Navy, we don't put out a statement like that without checking it all.\n'It was a dangerous thing to happen and it shouldn't have.'\nAustralian frigate HMAS Toowoomba, involved in an incident this month with China that saw several Navy divers injured, will be sent to patrol the South China Sea with the Philippines\nAnthony Albanese was posing for pictures with TV character Bluey on the day of the Navy run-in with China, which already earned him backlash as being 'tone deaf' amid the situation in the Middle East\nThe prime minister, who met with Chinese president Xi Jinping at the APEC summit this month has been eager to improve Australia's relationship with China.\n'They always push back. We've said we'll disagree where we must, and we have a disagreement here,' he said.\nThe divers suffered minor injuries to their ears, despite the Australian ship having warned others they were in the area.\nThe new three-day exercises with the Philippines follow discussions earlier this year on joint patrols to underscore what the countries say is their commitment to closer cooperation and a rules-based order in the region.\nIt also comes days after Manila took similar steps with the United States, concluding patrols that started in waters near Taiwan.\nDefence Minister Richard Marles said the inaugural patrols represent the practical implementation of the strategic partnership signed between the two nations in September.\n'Australia and the Philippines are firmly committed to a peaceful, secure and prosperous region, where sovereignty and agreed rules and norms are respected,' he said in a joint statement with the Philippines' National Defence Secretary Gilberto C Teodoro Jr on Saturday.\n'The first maritime cooperative activity between the Australian Defence Force and Armed Forces of the Philippines demonstrates this important commitment.'\nThe Philippines department of defence spokesperson Arsenio Andolong said the patrols will be carried out in the West Philippine Sea, Manila's term for waters in the South China Sea that fall within its exclusive economic zone.\nThe Philippine military said two of its navy vessels and five surveillance aircraft would participate.\nPhilippines President Ferdinand Marcos Jr hailed the exercises as maintaining a rules-based international order.\n'This inaugural Maritime Cooperative Activity and those that may follow are a practical manifestation of the growing and deepening strategic and defense partnership between our countries,' he said on the social media platform X, formerly known as Twitter.\nDefence Minister Richard Marles said the inaugural patrols represent the practical implementation of the strategic partnership signed between the two nations in September\nChina claims almost the entire South China Sea, a conduit for more than $3 trillion of annual ship-borne commerce, including parts claimed by the Philippines, Vietnam, Indonesia, Malaysia and Brunei.\nThe Permanent Court of Arbitration in 2016 said China's claims had no legal basis.\nThe Philippines is ramping up efforts to counter what it describes as China's 'aggressive activities' in the South China Sea, which has also become a flashpoint for Chinese and US tensions around naval operations.\nChina has accused the Philippines of enlisting 'foreign forces' to patrol the South China Sea. Manila insists the maritime activities are within its rights.\nEarlier this year, Prime Minister Anthony Albanese vowed to take Australia's relationship with the Philippines to the next level, after the two nations signed closer defence and security ties.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Australian warship involved in 'dangerous' incident with China that injured Australian Navy divers is sent to patrol the South China Sea in joint exercise with the Philippines", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12789701/Australian-Navy-sonar-Toowoomba-South-China-Sea-Philippines.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}