{"authors": [], "date_download": "2024-02-05 15:34:45", "date_modify": "None", "date_publish": "2023-11-25 06:28:43", "description": "Richard Marles says two countries committed to a peaceful region where ‘sovereignty and agreed rules and norms are respected’", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F25%2Faustralia-and-philippines-begin-joint-patrols-in-south-china-sea-as-regional-tensions-rise.json", "image_url": "https://i.guim.co.uk/img/media/40f7eced4cf86fd1c800cc58839393189b79d351/363_0_2089_1255/master/2089.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4c2f27eeb2d1569c20b0c95e80905836", "language": "en", "localpath": null, "maintext": "Australia and the Philippines have begun joint sea and air patrols in the South China Sea as Pacific nations warily eye an increasingly assertive China.\nThe three-day exercises follow discussions earlier this year on joint patrols to underscore what the countries say is their commitment to closer cooperation and a rules-based order in the region.\nIt also comes days after Manila took similar steps with the US, concluding patrols that started in waters near Taiwan.\nAustralia’s defence minister, Richard Marles, said the inaugural patrols represent the practical implementation of the strategic partnership signed between the two nations in September.\n“Australia and the Philippines are firmly committed to a peaceful, secure and prosperous region, where sovereignty and agreed rules and norms are respected,” he said on Saturday in a joint statement with the Philippine national defence secretary, Gilberto C Teodoro Jr.\n“The first maritime cooperative activity between the Australian Defence Force and Armed Forces of the Philippines demonstrates this important commitment.”\nThe Philippine defence department spokesperson Arsenio Andolong said the patrols would be carried out in the West Philippine Sea, Manila’s term for waters in the South China Sea that fall within its exclusive economic zone.\nThe Philippine military said two of its navy vessels and five surveillance aircraft would participate.\nAustralia said it would send the frigate HMAS Toowoomba and P8-A maritime surveillance aircraft.\nThe Philippine president, Ferdinand Marcos Jr, hailed the exercises as maintaining a rules-based international order.\n“This inaugural Maritime Cooperative Activity and those that may follow are a practical manifestation of the growing and deepening strategic and defense partnership between our countries,” he said on X, formerly known as Twitter.\nChina claims almost the entire South China Sea, a conduit for more than $3tn of annual ship-borne commerce, including parts claimed by the Philippines, Vietnam, Indonesia, Malaysia and Brunei.\nThe Permanent Court of Arbitration in 2016 said China’s claims had no legal basis.\nThe Philippines is ramping up efforts to counter what it describes as China’s “aggressive activities” in the South China Sea, which has also become a flashpoint for Chinese and US tensions around naval operations.\nChina has accused the Philippines of enlisting “foreign forces” to patrol the South China Sea. Manila insists the maritime activities are within its rights.\nEarlier this year, prime minister Anthony Albanese vowed to take Australia’s relationship with the Philippines to the next level, after the two nations signed closer defence and security ties.", "source_domain": "www.theguardian.com", "text": null, "title": "Australia and Philippines begin joint patrols in South China Sea as regional tensions rise", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/25/australia-and-philippines-begin-joint-patrols-in-south-china-sea-as-regional-tensions-rise"}