{"authors": ["George Styllis", "Abbie Cheeseman", "Beirut", "Earlier"], "date_download": "2024-02-05 15:34:46", "date_modify": "None", "date_publish": "2023-11-25 00:00:00", "description": "Thirteen Israeli and four Thai hostages released by Hamas arrived in Israel on Sunday and were set to be reunited with their families as part of a crucial hostage deal.", "filename": "https%3A%2F%2Fwww.telegraph.co.uk%2Fworld-news%2F2023%2F11%2F25%2Fisrael-palestine-latest-news-ceasefire-hostage-release%2F.json", "image_url": "https://www.telegraph.co.uk/content/dam/world-news/2023/11/25/TELEMMGLPICT000357907028_17009509671280_trans_NvBQzQNjv4BqXATMU8jzX4bP9ai0xtRD5E5SUIIE-vqw3YkAi1D0TzA.jpeg?impolicy=logo-overlay", "language": "en", "localpath": null, "maintext": "Thirteen Israeli and four Thai hostages released by Hamas arrived in Israel on Sunday and were set to be reunited with their families as part of a crucial hostage deal.\nIrish-Israeli girl Emily Hand, 9, was among the eight Israeli children released by the terror group on Saturday in a deal that for a while looked set to collapse due to a dispute over aid supplies.\nHamas and Israel have agreed to a truce, the first since war broke out 50 days ago, on the condition that Israel frees Palestinians prisoners in return for hostages.\nAfter the first smooth exchange on Friday, Hamas accused Israel of reneging on aspects of the deal and refused to comply with the exchange until a last-minute intervention by Egypt and Qatar.\nTelevision footage showed hostages on the Egyptian side of the Rafah border crossing after leaving Gaza, as Hamas handed over the captives to the International Committee of the Red Cross (ICRC) late on Saturday.\nOf the 13 Israelis released, six were women and seven were children and teenagers, according to Prime Minister Benjamin Netanyahu’s office.\n“The released hostages are on their way to hospitals in Israel, where they will reunite with their families,” the Israel Defense Forces (IDF) said in a statement.\nPrison authorities in Israel also announced early on Sunday they had released another 39 Palestinian detainees in exchange for Hamas’s newly released hostages.\nThey are all women and people under the age of 19. The most prominent Palestinian released is Israa Jaabis, 37, who was convicted of detonating a gas cylinder in her car at a checkpoint in 2015, wounding a police officer. She was sentenced to 11 years in prison.", "source_domain": "www.telegraph.co.uk", "text": null, "title": "Israeli military says released hostages have arrived in Israel", "title_page": null, "title_rss": null, "url": "https://www.telegraph.co.uk/world-news/2023/11/25/israel-palestine-latest-news-ceasefire-hostage-release/"}