{"authors": ["Sign In"], "date_download": "2024-02-05 15:34:49", "date_modify": "None", "date_publish": "2023-11-25 11:13:05", "description": "Israel denies preventing trucks from entering northern Gaza and flying drones over southern area in breach of agreement", "filename": "https%3A%2F%2Fwww.scotsman.com%2Fnews%2Fworld%2Fgaza-hostage-release-delay-as-hamas-accuses-israel-of-breaking-truce-4423065.json", "image_url": "https://www.scotsman.com/webimg/b25lY21zOmU2YTZhYWY1LTdjN2YtNGNmMy1hM2IwLTlhY2VlMzMzZjY2OTpmZWViMDMyNC1kMGRlLTQ1YWUtYWViMi05MDczNzU3MWI5ZmM=.jpg?width=1200&auto=webp&quality=75&crop=3:2,smart", "language": "en", "localpath": null, "maintext": "An image from a handout video released by the Hamas Media Office showing members of its Al-Qassam Brigades leading hostages over to officials from the International Committee of the Red Cross in Gaza on Friday. Picture: Hamas Media Office/AFP via Getty Images\nHamas last night delayed plans to release 14 Israeli hostages in exchange for Israel freeing 42 Palestinian prisoners as part of an ongoing swap during a four-day ceasefire.\nAccording to an Egyptian official, mediators in Egypt and Qatar had given Israel a list of those hostages to be released provided by Hamas.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nSign up to our World Explained newsletter – get the latest Scottish news to your inbox Sign up Thank you for signing up! Did you know with a Digital Subscription to The Scotsman, you can get unlimited access to the website including our premium content, as well as benefiting from fewer ads, loyalty rewards and much more. Learn More Sorry, there seem to be some issues. Please try again later. Submitting...\nThe swap on day two of the ceasefire was to have followed Hamas’ release on Friday of 24 of the approximately 240 hostages it took during its attack on Israel on October 7 that triggered the war. In exchange Israel freed 39 Palestinians from prison.\nThose freed from captivity in Gaza were 13 Israelis, 10 Thai nationals and a citizen of the Philippines.\nHowever, last night, Hamas accused Israel of breaching the conditions of the four-day ceasefire by allowing only three out of 100 aid trucks into northern Gaza and flying drones over the southern area. It also claimed Israel Defense Forces killed two Palestinians in Beit Hanoun – an area where Palestinians are allowed to move. Israel denied the claims.\nHamas had been due to release at least 50 Israeli hostages, and Israel was proposing to free 150 Palestinian prisoners.\nIsrael had said the truce could be extended an extra day for every additional 10 hostages freed — something United States President Joe Biden said he hoped would come to pass.\nThe start of the truce on Friday morning brought the first moment of quiet for 2.3 million Palestinians reeling and desperate from relentless Israeli bombardment that has killed thousands, driven three quarters of the population from their homes and levelled residential areas.\nRocket fire from Gaza militants into Israel went silent as well.\nThe United Nations said the pause enabled it to scale up the delivery of food, water and medicine to the largest volume since the resumption of humanitarian aid convoys on October 21.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nIt was also able to deliver 34,078 gallons of fuel – just over 10 per cent of the daily pre-war volume – as well as cooking gas.\nIn the southern city of Khan Younis on Saturday, a long line of people with fuel cans and other containers waited outside a filling station hoping to get some of the newly delivered fuel.\nFor the first time in more than a month, aid reached northern Gaza, the focus of Israel’s ground offensive. A UN convoy delivered flour to two facilities sheltering people displaced by fighting.\nThe UN said it and the Palestinian Red Crescent Society were also able to evacuate 40 patients and family members from a hospital in Gaza City, where much of the fighting has taken place, to a hospital in Khan Younis.\nThe relief brought by the ceasefire has been tempered, however, for both sides – among Israelis by the fact that not all hostages will be freed and among Palestinians by the brevity of the pause. The short truce leaves Gaza mired in a humanitarian crisis and under the threat that fighting could soon resume.\nIsrael has vowed to resume its massive offensive once the truce ends. That has clouded hopes that the deal could eventually help wind down the conflict, which has fuelled a surge of violence in the occupied West Bank.\nAfter nightfall on Friday, a line of ambulances emerged from Gaza through the Rafah Crossing into Egypt carrying the freed hostages. The freed Israelis included nine women and four children aged nine and under.\nThe released hostages were taken to three Israeli hospitals for observation. The Schneider Children’s Medical Centre said it was treating eight Israelis — four children and four women — and that all appeared to be in good physical condition.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nIt said they were also receiving psychological treatment, adding that “these are sensitive moments” for the families.\nAt a plaza dubbed Hostages Square in Tel Aviv, a crowd of Israelis celebrated at the news.\nYael Adar spotted her mother, 85-year-old Yaffa Adar, in a TV broadcast of the release and was cheered to see her walking.\n“That was a huge concern, what would happen to her health during these almost two months,” she told Israel’s Channel 12.\nBut Yael’s 38-year-old son, Tamir Adar, remains in captivity. Both were kidnapped on October 7 from Kibbutz Nir Oz. “Everyone needs to come back. It’s happiness locked up in grief,” she said.\nThe hostages included multiple generations. Nine-year-old Ohad Munder-Zichri was freed along with his mother, Keren Munder, and grandmother, Ruti Munder.\nThe boy was abducted during a holiday visit to his grandparents at the kibbutz where about 80 people — nearly a quarter of all residents of the small community — are believed to have been taken from.\nThe plight of the hostages has raised anger among some families that the government of Prime Minister Benjamin Netanyahu was not doing enough to bring them home.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nHours later, 24 Palestinian women and 15 teenage boys held in Israeli prisons in the occupied West Bank and east Jerusalem were freed. In the West Bank town of Beitunia, hundreds of Palestinians poured out of their homes to celebrate, honking horns and setting off fireworks that lit up the night sky.\nThe teenagers had been jailed for minor offences such as throwing stones. The women included several convicted of trying to stab Israeli soldiers, and others who had been arrested at checkpoints in the West Bank.\n“As a Palestinian, my heart is broken for my brothers in Gaza, so I can’t really celebrate,” said Abdulqader Khatib, a UN worker whose 17-year-old son, Iyas, was freed. “But I am a father. And deep inside, I am very happy.”\nThe war erupted when several thousand Hamas militants stormed into southern Israel, killing some 1,200 people, mostly civilians, and taking scores of hostages, including babies, women and older adults, as well as soldiers.\nMajed al-Ansari, a spokesperson for the Foreign Ministry of Qatar, said the hope is that momentum from the deal will lead to an end to the violence. Qatar served as a mediator along with the US and Egypt.\nBut hours before it came into effect, Israeli defence minister Yoav Gallant told troops that their respite would be short and that the war would resume with intensity for at least two more months.\nMr Netanyahu has also vowed to continue the war to destroy Hamas’s military capabilities, end its 16-year rule in Gaza and return all the hostages.\nThe Israeli offensive has killed more than 13,300 Palestinians, according to the Health Ministry in the Hamas-run Gaza government.\nAdvertisement Hide Ad\nAdvertisement Hide Ad\nWomen and children have consistently made up around two thirds of the dead, though the latest number was not broken down. The figure does not include updated numbers from hospitals in the north, where communications have broken down.\nThe ministry says some 6,000 people have been reported missing, feared buried under rubble. The ministry does not differentiate between civilians and militants in its death tolls.", "source_domain": "www.scotsman.com", "text": null, "title": "Gaza: Hostage release delay as Hamas accuses Israel of breaking truce", "title_page": null, "title_rss": null, "url": "https://www.scotsman.com/news/world/gaza-hostage-release-delay-as-hamas-accuses-israel-of-breaking-truce-4423065"}