{"authors": [], "date_download": "2024-02-05 15:15:58", "date_modify": "None", "date_publish": "2024-01-24 11:22:13", "description": "The crash took place in Russia’s Belgorod region near the border with Ukraine.", "filename": "https%3A%2F%2Fguernseypress.com%2Fnews%2Fworld-news%2F2024%2F01%2F24%2Fall-on-board-killed-as-russian-plane-carrying-ukraine-pows-crashes%2F.json", "image_url": "https://www.guernseypress.com/resizer/47CPEbHkJ5YICsvVTGWDgLIUsTI=/1200x900/cloudfront-us-east-1.images.arcpublishing.com/mna/WMNJOA6KZ5CLFFHCB2DTEMZ76Q.jpg", "language": "en", "localpath": null, "maintext": "A military transport plane that the Kremlin said was carrying 65 Ukrainian prisoners of war has crashed Wednesday in a Russian region near Ukraine.\nAll those on board were killed, according to governor Vyacheslav Gladkov of the Belgorod region, where the plane went down.\nIt was not immediately clear what caused the crash, and Mr Gladkov did not specify how many people were on the plane, or who they were.\nOfficials said everyone on board was killed (UGC video via AP)\nFootage of the crash posted on social media showed a plane falling from the sky in a snowy, rural area, and a massive ball of fire erupting where it apparently hit the ground.\nFirefighters, ambulances and police rushed to the site of the crash in the Korochansky district of Belgorod, state news agency Tass said.\nTwo senior Russian legislators alleged that the plane was brought down by missiles launched by Ukrainian forces.\nShortly before the crash, Mr Gladkov said on his Telegram channel that a “missile alert” had been triggered in the region and warned residents to take shelter.\nThe plane was said to be carrying PoWs ahead of a prisoner exchange (UGC video via AP)\n“We emphasize that the enemy is actively conducting information special operations against Ukraine aimed at destabilising Ukrainian society,” it said in a statement on Telegram.\nA special military commission was on the way to the crash site, according to the Russian defence ministry, which said that, in addition to the prisoners, three people accompanying them and six crew were on board.\nSpeaking on his morning call with reporters, President Vladimir Putin’s spokesperson Dmitry Peskov said he could not comment on the crash as he did not have enough information about it.\nThe plane is designed to airlift troops, cargo, military equipment and weapons. It can carry up to 225 troops, according to Russia’s military export agency.\nThe Russian air force has suffered a string of crashes that some observers have attributed to a higher number of flights amid the fighting in Ukraine.\nEarlier on Wednesday, Ukrainian President Volodymyr Zelensky said a major Russian missile attack that was apparently devised to overwhelm Ukraine’s air defences had killed 18 people and injured 130.\nUkraine is marking the 700th day since the full-scale invasion by Kremlin’s forces started.\nThe barrage employing more than 40 ballistic, cruise, anti-aircraft and guided missiles early on Tuesday hit 130 residential buildings in three Ukrainian cities, “all ordinary houses”, Mr Zelensky said on X, formerly Twitter.\nRussia’s onslaught, which included targets in the capital Kyiv and second-largest city Kharkiv, was the heaviest in weeks and lent weight to Mr Zelensky’s appeals for Western allies to provide more military aid.\n“This year, the main priority is to strengthen air defense to protect our cities and towns, as well as defend frontline positions,” the Ukrainian leader said on X on Tuesday night.\nWith the 930-mile front line largely static amid icy weather and as both sides seek to replenish their weapons stockpiles, the war recently has focused on long-range strikes.\nAnalysts say Russia stockpiled missiles to pursue a winter campaign of aerial bombardment, while Ukraine has sought to strike inside Russia with new types of drones.\nRussia may have employed decoy missiles in Tuesday’s attack in an effort to open up holes in Ukraine’s air defences, a US think tank said.\nThe Washington-based Institute for the Study of War said Moscow is likely trying to acquire more ballistic missiles from foreign countries, including Iran and North Korea, because they may be more effective in some circumstances.\nA further barrage of Russian S-300 missiles struck residential districts of Kharkiv late on Tuesday, injuring nine people and damaging residential buildings, regional governor Oleh Syniehubov said.\nRussia denies its forces strike civilian areas, although there is substantial evidence to the contrary.\nThe Russian defence ministry said that air defences shot down four Ukrainian drones over the Oryol region of western Russia early on Wednesday.\nUkraine’s allies have promised to keep sending military aid packages, even though their resources are stretched. Help from the United States, by far Ukraine’s single biggest provider, has also hit political snags.\nThe German defence ministry also announced on Wednesday that it plans to send six Sea King Mk41 multi-role helicopters from Bundeswehr stocks to Ukraine.\nSince the beginning of the war military deliveries from Germany have amounted to around six billion euro (£5.13 billion), including substantial anti-aircraft and air defence systems, the government said.", "source_domain": "guernseypress.com", "text": null, "title": "‘All on board killed’ as Russian plane carrying Ukraine PoWs crashes", "title_page": null, "title_rss": null, "url": "https://guernseypress.com/news/world-news/2024/01/24/all-on-board-killed-as-russian-plane-carrying-ukraine-pows-crashes/"}