{"authors": ["Alice Scarsi"], "date_download": "2024-02-05 15:35:01", "date_modify": "None", "date_publish": "2023-11-25 12:58:00", "description": "Violence has ramped up in the West Bank in the wake of the war between Israel and Hamas that began on October 7.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1838976%2Fpalestinian-killed-west-bank-hamas-israel-war.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5084911.jpg", "language": "en", "localpath": null, "maintext": "Tulkarm was targeted by an Israeli drone strike, it has been claimed\nTwo Palestinians were brutally executed in the West Bank after being accused of collaborating with Israel, it has been claimed. Gruesome unverified pictures circulating on X, formerly Twitter, show the bodies of two dead men hung on an electricity pole, while other clips show a mob abusing the bodies. While cheering at their deaths, some in the crowd shouted \"traitors\", The Times of Israel reported. The two victims believed to have been murdered in the city of Tulkarm have been identified as Hamza Mubarak, 31, and Azam Juabra, 29. Their bodies were later dumped in the rubbish, the Israeli news outlet wrote.\nREAD MORE: Moment released Palestinian prisoner leads defiant chant in support of Hamas\nTulkarm is part of the West Bank territory\nThe killing is believed to have been carried out by the military wing of Hamas, which published a document detailing the charges against the two Palestinians, Israeli state broadcaster KAN claimed. The Palestinians, who the document said were killed by a firing squad, were accused of collaborating with Israel and providing information to the Israel Defense Forces (IDF) and intelligence about wanted individuals. Also reporting on the alleged murder, British journalist Andrew Neil wrote on X: \"Reports of two Palestinian men executed in West Bank town after being accused of being Israeli informants. \"Murdered by firing squad then hung upside down on electricity pylon, their bodies abused. One then had his legs cut off and his body thrown on a pile of rubbish.\"\nEarlier this week, Tulkarm was targeted by an Israeli drone strike, according to Palestinian news agency WAFA, which killed six people. Hamas has been the governing body in the Gaza Strip since 2007. While the Palestinian Authority maintains administrative control in the West Bank, Hamas also has a presence in this territory, albeit much reduced when compared to that in Gaza. In the wake of the terror attack carried out in Israel by Hamas terrorists on October 7 and the war in Gaza that followed, tensions ramped up also in the West Bank. Since October 7, the IDF has set up checkpoints in some West Bank areas and has been conducting \"operations to apprehend suspects\" and foil terror attacks, as it stated to the CNN. The military force has claimed there has been an uptick in attempted terror plots in the area over the past few weeks.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Palestinians killed by firing squad 'hung upside down' from pylon after 'traitor' chants", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1838976/palestinian-killed-west-bank-hamas-israel-war"}