{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Maya Yang", "Martin Belam"], "date_download": "2024-02-05 15:35:01", "date_modify": "None", "date_publish": "2023-11-24 02:43:22", "description": "This blog has closed. You can follow our live coverage of the Israel-Hamas war here on our new blog", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F23%2Fisrael-hamas-war-live-updates-gaza-ceasefire-hostage-release-friday-israeli-us-officials.json", "image_url": "https://i.guim.co.uk/img/media/f646fdba2489f964438ff3e477eb9ae064c1a3a0/0_224_4065_2440/master/4065.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=a3bfae73e2c7806fca5459a74e4c613e", "language": "en", "localpath": null, "maintext": "From 23 Nov 2023 19.07 CET Israel to continue 'intense' fighting for at least two months after 'short' truce, says defence minister Israel’s defence minister, Yoav Gallant, has said the military will resume fighting against Hamas “with intensity” for at least two more months once the “short” temporary pause ends. Gallant, addressing troops of the Israeli navy special operations unit on Thursday, was quoted by the Times of Israel as saying: What you will see in the coming days is first the release of hostages. This respite will be short. He told troops to “organise, get ready, investigate, resupply arms, and get ready to continue” during the ceasefire, adding: There will be a continuation, because we need to complete the victory and create the impetus for the next groups of hostages, who will only come back as a result of pressure. “At least another two months of fighting is expected,” he added. From the Times of Israel’s Emanuel Fabian: Defense Minister Yoav Gallant to troops of the Navy's Shayetet 13 commando unit: \"This will be a short respite, after which the fighting will continue with intensity, and pressure will be made to bring back more hostages. At least two more months of fighting is expected.\" pic.twitter.com/scMUZWOdlh — Emanuel (Mannie) Fabian (@manniefabian) November 23, 2023\nUpdated at 19.09 CET\n24 Nov 2023 02.36 CET A special flight has evacuated 103 Russian nationals from Gaza, Russia’s emergencies ministry said early on Friday. In a post on Telegram, the ministry said the group flew to Moscow aboard a chartered Ilyushin-76 aircraft, Reuters reported. The post said 101 Russian nationals had been taken from Gaza to Egypt in the past 24 hours, bringing to more than 750 the total number of Russian evacuees. More than 650 had been flown to Russia, including more than 300 children. The Kremlin on Wednesday hailed a ceasefire agreement in Gaza, going into effect on Friday, as the “first good news for a long time” in the Israel-Palestinian conflict. It said humanitarian pauses were the only way to build efforts for a sustainable settlement.\n24 Nov 2023 01.55 CET The director of al-Shifa hospital, Mohammad abu Salmiya, is not under inditement and has not been accused of being a member of Hamas, the Israeli military (IDF) has told the BBC. As we reported earlier, Abu Salmiya and other medics from Gaza’s largest hospital were detained on Thursday and transferred to Israel’s Shin Bet domestic security service for further questioning. The IDF said that al-Shifa “under his direct management, served as a Hamas command and control centre” and that Hamas fighters had sought refuge in the hospital. Meanwhile the medical director of the Indonesian hospital, Dr Marwan Sultan, told the BBC that the facility in northern Gaza was under heavy fire, with Israeli tanks firing every 15 minutes. He told the British broadcaster: We cannot stay in rooms as windows are being hit. We are staying in corridors in the hospital. My office was targeted several times. He said evacuation was not taking place over concerns staff could be detained.\n24 Nov 2023 01.39 CET The number of antisemitic and anti-Muslim hate crimes in Toronto, Canada’s largest city, has spiked significantly since the start of the Gaza conflict between Israel and Hamas on 7 October, authorities have said. Police chief Myron Demkiw said 78 hate crimes had been reported between Oct. 7 and 20 November, compared to 37 in the same time frame in 2022, Reuters reported. The real number was undoubtedly higher since some people were hesitant to come forward, he added. View image in fullscreen Toronto skyline and Lake Ontario . Photograph: RM Nunes/Alamy The number of reported antisemitic hate crimes in this period almost trebled to 38 from 13 last year, while those involving the Muslim, Palestinian and Arab population leapt to 17 from just one in 2022. “The impact of the events in the Middle East on our city are ongoing and have escalated since 7 October,” Demkiw told a televised news conference. Since the Hamas raid and subsequent Israeli retaliation, 25 people have been arrested and 64 charges laid in relation to reported hate incidents. \"(Hate crimes) can traumatize not just victims, but all members of the targeted community and beyond,” said Demkiw. Toronto has temporarily boosted the size of its hate crime unit to 29 from the usual six. With around three million people living in Toronto, it is by far the biggest city in Canada, which has a population of just over 40 million.\n24 Nov 2023 01.14 CET German police have raided the homes of members and supporters of Hamas and another Palestinian organisation which are banned in the country. AFP reports: Around 500 members of the security forces led the operation, with 13 places searched in the capital Berlin, the interior ministry said. Four other regions were targeted to a lesser extent as police seized smartphones, laptops and various writings, the ministry added. “We are carrying out action against radical Islamists,” Interior Minister Nancy Faeser said earlier on Thursday. “By banning Hamas and Samidoun in Germany, we have sent a clear signal that we will not tolerate any apology or support for Hamas’s barbaric terror against Israel. “Islamists and ant-Semites must not feel safe anywhere,” she said. Germany on 2 November banned Hamas and Samidoun. According to official figures, Germany hosts an estimated 450 members of Hamas, proscribed as a “terrorist” organisation by the European Union, the US and Israel. The ministry said that while Hamas members had not staged “violent action” in Germany so far, they had tried to raise funds to help the group overseas and “influence the social and political discourse in Germany”. It said Samidoun on the other hand was “prone to use violence ... and denies the right of Israel to exist”. View image in fullscreen German police officers leave an apartment block during a raid against Hamas supporters in Berlin, Germany on Thursday. Photograph: Fabrizio Bensch/Reuters\n24 Nov 2023 01.03 CET 130,000 litres of diesel to be delivered daily to Gaza during truce, Egypt says Egypt has said 130,000 litres of diesel and four trucks of gas will be delivered daily to Gaza when a four-day truce starts on Friday, according to Reuters. Diaa Rashwan, the head of Egypt’s State Information Service (SIS), also said in a statement early on Friday that 200 trucks of aid would enter Gaza daily. The truce is expected to start at 7am (0500 GMT).\n23 Nov 2023 00.50 CET The Belgian city of Charleroi has condemned antisemitic vandalism after at least 85 Jewish graves in one of its cemeteries were damaged and objects stolen, AFP reports. A gravedigger in a cemetery in the Marcinelle neighbourhood of the southern city discovered the damage in plots for Jewish tombs on Wednesday. An investigation has since been opened. Paul Magnette, the mayor of Charleroi, said: The place chosen and the theft of many stars of David leave little doubt on the antisemitic nature of the intentions. In the name of the city, I fully condemn these abject acts. He said he had asked the city’s administration to notify each family. Only the cemetery’s Jewish section was affected, suggesting the antisemitic nature of the vandalism. Belgium has registered a rise in reported antisemitic acts and comments since the outbreak of the Israel-Hamas war on 7 October. Police are monitoring more closely Jewish schools and places of worship.\n23 Nov 2023 00.35 CET Tens of thousands of Cubans have marched in front of the US embassy in Havana charging Israel was committing “genocide” against Palestinians in Gaza, Reuters reports. The march, led by President Miguel Diaz-Canel, and which moved along Havana”s seaside drive, the Malecon, where the US diplomatic headquarters is located, was the first of its kind in more than a decade. Former Cuban leader Fidel Castro, now deceased, was famous for staging similar, but much larger demonstrations to protest US sanctions and meddling in Cuban affairs. The crowd, sporting Palestinian flags and banners, chanted “free, free Palestine, Israel is genocide” and “up with Palestinian freedom” as it marched by the building and rallied nearby. View image in fullscreen Cuba’s President Miguel Diaz-Canel (C), along other leaders, takes part in a march in support of the Palestinian people in Havana, on Thursday. Photograph: Yamil Lage/AFP/Getty Images Communist-run Cuba has been a strong backer of the Palestinian cause for decades and has trained more than 200 Palestinian doctors. It does not have diplomatic relations with Israel. “We are here and it is no coincidence that we have marched in front of the United States embassy,” Anet Rodríguez, a university professor, said. “The United States is one of the most responsible for supporting the State of Israel ... it is supporting a massacre of the Palestinians and international laws are being violated,” she said.\nUpdated at 00.36 CET\n23 Nov 2023 00.23 CET The Israeli military says it is investigating after a 12-year-old boy was shot dead near the West Bank city of Nablus on Wednesday, the Israeli newspaper Haaretz has reported. The army said in a statement that soldiers had opened fire on “rioters” who threw stones during an “operation” in the town of Beita. “Thereafter, it was reported that a Palestinian minor have been killed. The incident is being investigated,” it said. This is Helen Livingstone taking over from my colleague Léonie Chao-Fong.\n23 Nov 2023 23.40 CET People in Gaza are 'losing hope in humanity', says UNRWA chief in renewed calls for long-standing ceasefire The head of the UN agency for Palestinian refugees (UNRWA) has said a temporary truce in Gaza will allow the agency to reach people in need in northern Gaza, as he renewed a call for a longstanding humanitarian ceasefire. UNRWA commissioner general, Philippe Lazzarini, in statement published today, said he had just returned from his second visit to the Gaza Strip since the war began. He wrote: I bear witness to the unspeakable suffering of people. Since my first visit two weeks ago, the humanitarian situation has already become far worse. He said the UN agency now hosts more than a million displaced Palestinians in its schools and premises across Gaza Strip, adding: People are exhausted and are losing hope in humanity. They need respite, they deserve to sleep without being anxious about whether they will make it through the night. This is the bare minimum anyone should be able to have. The four-day ceasefire in Gaza between Israel and Hamas, set to begin on Friday morning, is “an opportunity to reach people in need including in the north and to start repairing civilian infrastructure”, he said. I have just returned from my second visit to the #GazaStrip since the war began.\nI bear witness to the unspeakable suffering of people.\nAs we all anticipate the beginning of the much-awaited pause, I reiterate my call for a long-standing humanitarian ceasefire. pic.twitter.com/VGZ1C866bT — Philippe Lazzarini (@UNLazzarini) November 23, 2023\nUpdated at 23.46 CET\n23 Nov 2023 23.23 CET Humanitarian agencies preparing to go into Gaza continued to build up stocks of desperately needed aid ahead of a four-day humanitarian pause that is set to begin on Friday. The UN’s World Food Programme (WFP) chief, Cindy McCain, said the agency was “rapidly mobilising to scale up assistance inside Gaza” once safe access is granted. WFP trucks are “waiting at the Rafah crossing, loaded with food slated for families in shelters and homes across Gaza, and wheat flour for bakeries to resume operations”, she said. View image in fullscreen Trucks carrying aid await an opportunity to enter Gaza via the Rafah crossing on 22 November 2023 in Arish, Egypt. Photograph: Ali Moustafa/Getty Images Under the deal reached by Israel and Hamas, Israel will allow up to 300 trucks of humanitarian aid into Gaza after more than six weeks of bombardment, heavy fighting and a crippling blockade of fuel, food, medicine and other essentials. On Thursday, Majed al-Ansari, the spokesperson for the foreign ministry of Qatar, announced the ceasefire would start at 7am local time on Friday (0500 GMT). Increased aid for Palestinians would start to enter “as soon as possible”, Ansari said. Just over 73 truckloads of WFP food aid have made it into Gaza since limited aid deliveries through the Rafah crossing with Egypt resumed on 21 October, the agency said. Speaking on Thursday, McCain expressed hope that more fuel will be let into Gaza “so that our trucks can carry in much-needed supplies and that once again bread will be available as a lifeline to hundreds of thousands of people every day”.\nUpdated at 23.31 CET\n23 Nov 2023 22.50 CET Hamas to release 23 Thai hostages unconditionally after Iran-mediated talks - report Hamas is set to release 23 Thai hostages it is holding in Gaza without any conditions, according to a report by the Al-Araby Al-Jadeed news site. The release of Thai hostages would not be connected to the deal reached by Israel and Hamas over the release of dozens of Israeli hostages held by militants as well as Palestinians imprisoned by Israel, the outlet said. The announcement comes after Iran-mediated talks between the Palestinian militant group and the Thai government, it said. Qatari @alaraby_ar: Hamas is expected to release the 23 Thailand citizens that he took as hostages. The release *Is not connected to the hostage deal*.\nAccording to the report, this was an agreement reached by Iran. — Amichai Stein (@AmichaiStein1) November 23, 2023 The Thai government has reportedly been in talks with Iran to secure the release of its 23 hostages held in Gaza since the 7 October Hamas terror attacks on Israel. It is the largest single group of foreigners held by the militant group, AP reported. At least 32 Thai citizens were killed by Hamas on 7 October, according to Thai government figures.\nUpdated at 22.51 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: Cubans protest in front of US embassy in Havana - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/23/israel-hamas-war-live-updates-gaza-ceasefire-hostage-release-friday-israeli-us-officials"}