{"authors": ["Alessandra Scotto Di Santolo"], "date_download": "2024-02-05 15:35:03", "date_modify": "None", "date_publish": "2023-11-24 06:00:00", "description": "EXCLUSIVE: An expert from the Economist Intelligence Unit (EIU) shed light on the unexpected benefits that the failed Ukrainian counter offensive has brought to Russia and its President, Vladimir Putin.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1838269%2Fukraine-counter-offensive-fail-vladimir-putin-russia.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5081527.jpg", "language": "en", "localpath": null, "maintext": "Putin has benefited at home from Ukraine's failed offensive\nThe stalled progress of Ukraine's counter offensive against Russian forces has become an unexpected boost for Vladimir Putin's Russia, according to experts from the Economist Intelligence Unit (EIU). The revelation comes in the wake of a candid admission from the Commander-in-Chief of the Ukrainian Armed Forces, Valerii Zaluzhnyi, in an interview published by the Economist on November 1. Zaluzhnyi acknowledged that the situation at the front had reached a \"dead end\" revealing a sobering assessment that neither side in the conflict currently possesses the capability to go on the offensive. In a self-critical tone, the Ukrainian military leader admitted to underestimating the resilience of Russian military capabilities, including their potential for mobilisation. Despite five months of counteroffensive efforts, the Ukrainian army only managed to advance 17 kilometres into its positions.\nREAD MORE: Crazy moment Russian soldier with his pants down is blown up by Ukraine drone\nZaluzhnyi drew parallels to trench warfare reminiscent of World War I, pointing out that attempts to break through Russian positions were thwarted by minefields, effective enemy reconnaissance, and the deployment of inexperienced brigades. Speaking to Express.co.uk, EIU's Mario Bikarski argued Ukraine's troops' failure has benefited Vladimir Putin in his military circles where the Russian President's strategy had so far come under huge criticism. According to the EIU analyst, the ultra-nationalist wing in Russia, particularly within the Defense Ministry and the general staff, had been critical of Putin's leadership in the ongoing conflict. However, the lack of substantial progress by the Ukrainian counteroffensive has shifted the dynamics.\nHe said: \"Until now in the war the ultra nationalist wing of in Russia was one of the most critical sites towards Putin's defence leadership. \"So the Defence Minister and the chief of general staff, these ultranationalists, they are pro-war hawks, but at the same time they are quite critical that Russia is actually not achieving enough. \"So they criticise Putin not because the war was actually started but because the war is not being brought to the success that they want to see.\n\"Ukraine's counteroffensive has failed to make big progress on the ground, and Ukraine hasn't been able to liberate a lot of territories. \"I think the movement has been just a few kilometres here and there and that has given Vladimir Putin and the Kremlin and the defence establishment in Russia some sense of security when it comes to what these internationalist circles think when it comes to the war. \"The absence of figures like Yevgeny Prigozhin and Igor Girkin from this political ultra nationalist dialogue has also helped. \"The narrative has always been really important for the Kremlin and it seems that for the first time in a very long time the Kremlin actually has some decent control over the narrative about the war.\"\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nTrending", "source_domain": "www.express.co.uk", "text": null, "title": "Vladimir Putin 'takes back control' after Ukraine's counteroffensive 'fails' its mission", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1838269/ukraine-counter-offensive-fail-vladimir-putin-russia"}