{"authors": ["Nick Pisa", "Nick Pisa In Tel Aviv", "Jon Brady", "Chris Jewers", "Perkin Amalaraj"], "date_download": "2024-02-05 15:35:08", "date_modify": "None", "date_publish": "2023-11-24 14:36:21", "description": "Thirteen Israeli women and children and 11 Thai and Filipino hostages, who were kidnapped and taken into the territory by the terror group in its October 7 attack on Israel, were finally freed today.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12787625%2FFirst-hostages-released-Israel-Hamas-exchange-truce-deal.html.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/24/16/78205463-0-image-a-64_1700844768816.jpg", "language": "en", "localpath": null, "maintext": "Thirteen Israeli hostages kidnapped by Hamas were yesterday freed after a seven-week nightmare – as their country vowed to wipe out the terrorists.\nThe nine women and four children were released after the warring sides signed a Qatari-negotiated, four-day ceasefire which began at 7am local time.\nJust over nine hours later – and with the pause still holding – the first hostages were handed over to the Red Cross at the Rafah crossing in southern Gaza.\nThe exchange happened half an hour later than scheduled, adding to the anxiety of families waiting in Israel for news.\nSadly, for the family of Irish-Israeli Emily Hand, nine, the heartache continued as she was not on the list of 13 hostages, who had all been snatched from the Nir Oz and Nerim kibbutz on October 7.\nAmong those released was Channah Peri, 79, whose British son Nadav Popplewell, 51, is still being held. The others freed were Doron Katz Asher, 34, and her daughters Raz Asher, four, and Aviv Asher, two; Daniele Aloni, 44, and her daughter Emilia Aloni, six.\nMedical staff can be seen walking the hostages into the centre to undergo medical examinations\nA young girl is carried to safety as part of the exchange\nLines of ambulance were seen waiting for the hostages, while the families of kidnapped hostages were seen nervously watching news broadcasts of the vans carrying their loved ones into Egypt\nA nine year old boy, his mother and grandmother are among the first 12 Israeli hostages released by Hamas thugs\nThe 13 Israeli hostages released from Hamas captivity: Margalit Moses, Adina Moshe, Danielle Aloni and her daughter Emilia, Doron Asher and her daughters Raz and Aviv, Hanna Katzir, Keren Munder and her son Ohad, Ruti Munder, Yaffa Adar, and Hannah Perry\nThe hostages being transported to freedom after their release was secured from Hamas\nHamas fighters are seen directing hostages - including Thai and Filipino nationals - to be taken to safety by the International Red Cross\nA total of 13 Israelis were released by the militant terrorist group on Friday as part of an exchange deal negotiated with Israel\nThe Israeli captives released by Hamas were made up of nine women and four children\nAlso named were Ruth Munder, 78, her daughter Keren, 54, and grandson Ohad, nine. The final four were Adina Moshe, 72, Chana Katzir, 76, Margalit Moses, 78, and Yafa Adar, 85.\nIn a cruel psychological ploy last month, the Palestinian Islamic Jihad group - another terror mob based in the occupied territory affiliated with Hamas - said Mrs Katzir had died, while Mrs Moshe was seen on a motorbike being driven to Gaza.\nIn an operation codenamed Heaven's Door by the Israelis, 39 Palestinian prisoners were also freed – again mainly women and children under 18 – who had been convicted mainly of rioting in the West Bank.\nHamas also released 10 Thai nationals and one Filipino after the pause in the fighting, which erupted last month when its heavily armed terrorists launched a bloody massacre across southern Israel.\nMore than 1,200 people were killed, including an estimated 340 at the Nova music festival. Around 240 Israelis, men, women and children were taken hostage.\nAhead of the Israelis being released, defence minister Yoav Gallant vowed to carry on avenging those killed.\nHe said: 'There will be a short pause and then we will continue operating with full military power.\n'We will not stop until we achieve our goals: the destruction of Hamas and bringing home the hostages from Gaza to Israel – there are 240 hostages and it is something we cannot accept and cannot tolerate.'\nMr Gallant and prime minister Benjamin Netanyahu – who has faced criticism for his handing of the situation – watched the release from a bunker in Tel Aviv.\nFootage released by Hamas showed members of the terrorist group dressed in balaclavas and body armour handing the hostages to the International Red Cross.\nThe 13 who were released were kept near Khan Yunis in the south of the Gaza Strip before being taken to the border, driven into Egypt and then to an Israeli air base before being flown on helicopters to hospitals across the country.\nAmong the Palestinians freed was Asraa Jabas, 38, who was sentenced to 11 years in prison after a failed suicide bombing near Jerusalem in 2015.\nShe suffered extensive injuries in the incident and a police officer was also badly hurt. Jabas caused outrage by demanding Israel pay for her plastic surgery.\nIn an interview with Italian newspaper Corriere Della Sera, her brother Suhaib said: 'We have been told by the police not to celebrate her release and not to hand out cakes. There can be no visible sign of a show of support for Hamas.'\nOne of the Palestinian prisoners, Marah Bakeer, said she had been kept in solitary confinement and had 'no idea' about the situation in Gaza.\nShe added: 'The news of the deal was a surprise. This deal comes following the death of many people and this makes us unhappy and uncomfortable.'\nFamilies with loved ones still in Gaza spoke of their emotions at news that hostages had been freed.\nNiva Wenkert, whose son Omer, 22, was kidnapped at the Nova festival while his friend Irish-Israeli Kim Damti was killed, told the Mail: 'I know my son is not on the list, I didn't expect him to be.\n'He is 22 years old, he is not a young child so he is unlikely to be freed now. But he must come home soon, he has colitis, and he needs medicine, we just don't know what condition he is in.\n'We had a phone call from the soldier who has been assigned to look after us and keep us informed and he called and said Omer was not on the list.\n'At the same time, I am joyful for the hostages that have been released and I wish them well, but all I can do is hope and pray that my son will come home soon.\n'It's very difficult and we have so many questions but very few answers, we are a strong family and that is what is keeping us together. We believe in God and that helps the situation, and we believe that God will bring Omer back to us.'\nThe family have not heard anything from Omer since he was snatched at the festival.\nAgonisingly, three hours after the attack, the family were sent a video of Omer tied up in a pick-up truck in his underwear.\nMrs Wenkert said: 'I saw that he is alive in that video and I saw his eyes, he has to come back alive.'\nThe hostages will be debriefed by intelligence officials at a military base, who will want to know as much as possible about where the others are being kept. A further batch of hostages is expected to be released this afternoon.\nThe children were given air defenders by doctors to protect their hearing before getting on board the helicopters. Upon their arrival, each hostage was assigned to a designated soldier, ensuring personalised care and support.\nAn International Red Cross vehicle carrying Israeli hostages crosses the Rafah border checkpoint linking Egypt to Gaza\nSeveral Red Cross vehicles made their way into Egypt for the handover, which saw 13 Israelis returned to home soil after being released by Hamas\nAll of the hostages were taken from Nir Oz, a kibbutz less than two miles from the Israel-Gaza border, apart from Chana Peri - who was snatched from kibbutz Nirim.\nIn a statement the IDF said: 'Special Forces and ISA Forces are currently with the released hostages.\n'The released hostages underwent an initial medical assessment inside Israeli territory.\n'They will continue to be accompanied by IDF soldiers as they make their way to Israeli hospitals, where they will be reunited with their families.\n'The Israel Defense Forces salutes and embraces the released hostages upon their return home.\n'The IDF, together with the entire Israeli security establishment, will continue operating until all the hostages are returned home.\n'The IDF Spokesperson reiterates the importance of demonstrating patience and sensitivity during this time out of respect for the released hostages and their families.'\nWriting on Facebook after the Ashers' release was confirmed Yoni Asher said: 'They're finally here, at home.\n'There will be more time to talk about everything. For now - thank you all. from the bottom of my heart, for the support and the warm hug.\n'There's no victory picture until everyone returns,' adding a heart emoji.\nPictures of the first Red Cross carrying hostages appears to show several elderly people being taken to be treated.\nOne of the elderly hostages was named as Adina Moshe, 72 (pictured)\nLive footage has so far shown three elderly women, wearing blue medical gowns, being walked into a trauma centre at the Rafah Crossing\nBabies and children can be seen being walked onto a white bus, having gone through the medical examinations\nIt is understood that those involved in the deal are under orders to treat the hostages with the utmost sensitivity\nThe families of kidnapped hostages were seen nervously watching news broadcasts of the vans carrying their loved ones into Egypt - but broke into cheers as the transfer was made\nPeople in Tel Aviv applaud as the release of Israeli captives by Hamas is announced\nPeople in Tel Aviv react to live footage as it emerges that one of the released hostages is Hanna Katzir, who had previously been reported to have died\nLive footage has so far shown three elderly women, wearing blue medical gowns, being walked into a trauma centre at the Rafah Crossing.\nMedical staff can be seen walking the hostages into the centre to undergo medical examinations.\nBabies and children can be seen being walked onto a white bus, having gone through the medical examinations.\nOne of the elderly hostages was named as Adina Moshe, 72.\nCorinne Moshe, her daughter-in-law, told the Reuters news agency her husband and his siblings were waiting at a hospital to be reunited with their mother.\nShe said: 'I miss her very, very much, I want her to be back already. I want to have dinner with her and the entire family again.\n'Grandmother is a strong woman. She raised almost all the children of Kibbutz Nir Oz.'\nAnother was named as Margalit Moses, 78. Also named were Daniel Aloni and her six-year-old Emilia.\nMeanwhile, a nine-year-old-boy, his mother and his grandmother are also among the first Israeli hostages released by Hamas thugs.\nOhad Munder, was snatched along with his mother Keren, 54, and grandparents Ruti and Avraham Munder both 78, from a kibbutz at Nir Oz on October 7.As a Red Cross vehicle took them over the border from Rafah crossing into Egypt relatives confirmed to MailOnline they recognised Liverpool fan Ohad.\nA source told MailOnline: 'I definitely recognised Ohad and his mother Keren and his grandmother was with him as well.\n'It's great to see they are looking good but we are worried about Avraham and the rest of the hostages we need them all back now.'\nAround 80 people were kidnapped from Nir Oz during the bloody attacks and among those killed there was Ohad's uncle Roee Munder.\nAnother of the released hostages, Hanna Katzir, was previously reported to have been killed by the Palestinian Islamic Jihad terror group.\nHowever, her family confirmed to the Times of Israel that she was among the 13 Israelis to have been freed on Friday.\n'The prisoners were handed to the Red Cross who will take them to the Egyptians and the Israelis who are due to receive them,' one of the sources said.\nThe second source confirmed the handover, AFP reported.\nReleased Palestinian prisoners wave flags as they are released from the Ofer military prison near Jerusalem\nEmergency services try to clear the way as an International Red Cross bus carrying Palestinian prisoners leaves the prison\nReleased Palestinian prisoner Marah Bakeer (in floral print) embraces her family after returning home\nPrisoners could be seen cheering inside the Red Cross bus as it left the Israeli military jail\nThey erupted with joy upon hearing that the vans had safely made it through the Rafah crossing\nThe agreement entailed a 'complete ceasefire with no attacks from the air or the ground'\nThe hostages were picked up the International Red Cross upon arriving at the Rafah Crossing\nAn Israeli prison transport vehicle leaves the Ofer military prison near Jerusalem, carrying Palestinian prisoners freed by the authorities as part of the exchange deal\nSpeaking after the release, Israel's Prime Minister Benjamin Netanyahu said: 'We have now completed the return of the first of our hostage — children, their mothers and other women. Each and every one of them is an entire world.'\nHe added: 'But I stress to you, the families of the hostages, and to you, the citizens of Israel: We are committed to the return of all our abductees. This is one of the goals of the war and we are committed to achieving all goals of the war.'\nThailand's prime minister, Srettha Thavisin, wrote in a post to X that he had received confirmation of 12 Thai citizens' arrival, adding that embassy officials were going to pick them up.'\nHe said the Thai and Filipino hostages, all adult men, are being taken to Shamir Medical Centre (Assaf Harofeh) south of Tel Aviv in Jerusalem, where they will be kept for at least 48 hours.\nThe Thai and Filipino men were believed to be farm workers working in southern Israel when they were kidnapped, reports Reuters.\nUS President Joe Biden said 'extensive US diplomacy' had helped to secure the deal between Israel and Hamas, alongside Qatari diplomats.\nHe added: 'My expectation and hope is that as we move forward, the rest of the Arab world and the region is also putting pressure on all sides to slow this down, to bring this to an end as quickly as we can.'\nFrench President Emmanuel Macron, meanwhile, has assured the families of French captives still held by Hamas that efforts remain underway to secure their release.\nHe posted on X, formerly Twitter: 'I welcome the release of the first group of hostages... Special thoughts for the French hostages and their families.\n'They can count on our determination. We remain mobilised alongside the mediators to secure the release of all hostages.'\nLines of ambulance were seen waiting for the hostages, while the families of kidnapped hostages were seen nervously watching news broadcasts of the vans carrying their loved ones into Egypt.\nThey erupted with joy upon hearing that the vans had safely made it through the Rafah crossing.\nThe 13 Israelis exchanged on Friday are not the first to be released or freed since the war against Hamas began. IDF soldier Ori Megidish was rescued by troops on October 29 during ground operations in Gaza.\nTwo women, Nurit Cooper and Yocheved Lifschitz, were freed five days before on humanitarian grounds, while October 20 two US hostages Judith Raanan, 59, and daughter Natalie Raanan, 17, were freed for similar reasons on October 20.\nFireworks are set off after Palestinian prisoners were freed from Israeli jails as part of the exchange deal brokered with Hamas\nPalestinian prisoners released by Israel celebrate on board a bus taking them home as a member of the International Committee of the Red Cross looks on\nThe Red Cross later said that 24 hostages were released, instead of the expected 25.\nA spokesperson for Qatar's foreign ministry said that ten Thai citizen and a Filipino citizen have released.\nIt is understood that those involved in the deal are under orders to treat the hostages with the utmost sensitivity. Some of the children held in Gaza since October 7 lost family members in the attack, and their homes in southern Israel destroyed.\nIt is not known whether they have been told this while in captivity, but social workers are expected to break the news to any of the children who have lost loved ones.\nThe fragile four-day truce began at 7am local time (12am ET and 5am GMT), with guns due to be laid down across the region for the first time in almost seven weeks.\nOver the four days of the ceasefire, at least 50 hostages are expected to be freed, leaving an estimated 190 in the hands of Palestinian militants.\nIn exchange, 150 Palestinians prisoners are expected to be released.\nQadura Fares, who heads an advocacy group for prisoners, said 33 prisoners freed in the West Bank were handed to a team from the International Committee of the Red Cross, and the remaining six were being freed from a Jerusalem jail.\nIsraeli prison authorities confirmed 39 inmates had been released, describing them as 'the first group of detainees freed under the plan to bring the hostages home'.\nThe detainees' affairs department of the Palestinian Authority issued a list of 24 women and 15 minors being freed.\nThey included Malak Salman, who was arrested seven years ago on her way to school - when she was 16 - for trying to stab a policeman in Jerusalem.\nNow 23, she was returned to her home in Beit Safafa, in annexed east Jerusalem, under Israeli police escort.\n'The police are in our house and are stopping people coming to see us,' her mother Fatina told AFP.\n'My daughter is weak, she has not eaten since yesterday,' she added.\nIt is not known whether they have been told this while in captivity, but social workers are expected to break the news to any of the children who have lost loved ones\nThe Red Cross said that 24 hostages were released, instead of the expected 25\nPictures of the first Red Cross carrying hostages appears to show several elderly people being taken to be treated\nThe families of kidnapped hostages were seen nervously watching news broadcasts of the vans carrying their loved ones into Egypt\nThe truce, brokered by Qatar, Egypt and the United States, brought the first pause in the war since it began\nLorries carrying aid enter Gaza via the Rafah crossing on the border with Egypt - 137 trucks carrying food, water and medicine made deliveries on Friday according to the UN\nForklift trucks unload aid from a truck in Rafah on Friday after Israel allowed lorries to pass through\nPalestinians inspect the damage done to their homes in Kazaa, Khan Younis, in the south of the Gaza Strip\nIsraeli police have issued orders banning celebrations in Jerusalem for released prisoners. White plumes of smoke were seen as authorities fired tear gas to disperse the crowds.\nThe agreement is also intended to provide additional aid to 2.4 million residents who face shortages of essential goods after Israel tightened a siege of the territory.\nAround 50 trucks with food aid, along with three fuel trucks and four with gas, entered on Friday morning, said Wael Abu Omar, director of communications on the Palestinian side of the Rafah crossing point with Egypt.\nCOGAT, the Israeli Ministry of Defense unit that liaises with Palestinian authorities on civil matters, said in a post on X, formerly Twitter: 'Today, the largest shipment of humanitarian aid since the beginning of the war is being delivered into the Gaza Strip.'\nA spokesperson added in an attached video: 'Our war is with Hamas; not the people of Gaza.'\nA total of 137 trucks carrying food, water, medicine and other essentials have been unloaded in Gaza since the Israel-Hamas truce began on Friday, according to the United Nations.\nIn Khan Younis in southern Gaza, people ventured out of homes and shelters into a landscape of buildings reduced to rubble. Displaced families carried belongings in plastic bags, hoping to return at least temporarily to the homes they had abandoned.\n'I am now very happy, I feel at ease. I am going back to my home, our hearts are rested,' said Ahmad Wael, smiling as he walked carrying a mattress balanced on his head.\n'I am very tired of sitting without any food or water. There (at home) we can live, we drink tea, make bread.'\nThe IDF says it has has 'completed its operational preparations according to the defensive positions of the pause'.\nHamas' leader abroad, Ismail Haniyeh, said that the terror group is committed to abiding by the peace terms, as long as Israel does the same.\nHaniyeh said in a video today: 'Hamas will pursue its effort to halt the Israeli assault on Gaza, complete the prisoner exchange, end the Israeli blockade on the Gaza Strip and attack on the Al-Aqsa Mosque in addition to enabling the Palestinian people to realise their legitimate national right for an independent state with Jerusalem as its capital, self-determination and the return [of Palestinian refugees].'\nIsraeli security service officials were seen setting up privacy screens to greet incoming hostages\nIsraelis wept as they saw their fellow citizens coming home after spending seven weeks as hostages\nSrettha Thavisin, Thailand's Prime Minister, says 12 Thai hostages have been released\nThe Red Cross said it has now begun a 'multi-day operation' to reunite hostages and detainees on both sides of the conflict, adding that it will also be ferrying in medical supplies for hospitals in Gaza.\nThe Geneva-based humanitarian organisation said tonight it had no role in the negotiations and that the parties in the conflict agreed to the details of the operation, including who will be released and when.\n'Our deep desire is for all hostages to be released, and that civilians be shielded from the pain and suffering that armed conflict brings,' said Fabrizio Carboni, the organisation's director for the Near and Middle East.\nDespite the truce this morning, smoke continued to rise across Gaza and journalists said artillery fire from inside the enclave carried on for 18 minutes after the ceasefire begun. However, the deal held, and the first group were exchange.\nThere were no further reports of fighting in the hours after the truce began.\nOfficials have admitted the exchange was 'complicated'.\nThe truce, brokered by Qatar, Egypt and the United States, brought the first pause in the war since it began.\nThe agreement entailed a 'complete ceasefire with no attacks from the air or the ground' and the skies clear of drones to 'allow for the hostage release to happen in a safe environment', the Qatari foreign ministry said.\nDefence Minister Yoav Gallant confirmed that a truce was underway with Hamas in Gaza, but that it was a 'short pause'.\nOnce it ends, Israel will resume the war with full military forces, he said.\n'There will be a short pause and then we will continue operating with full military power. We will not stop until we achieve our goals: the destruction of Hamas and bringing home the hostages from Gaza to Israel there are 240 hostages and it is something we cannot accept and cannot tolerate,' Gallant said.\nThe IDF also said on X that earlier in the day troops had 'destroyed a route of underground terrorist tunnels' and 'tunnel shafts' around the Al-Shifa hospital.\nA spokesman warned in a video that those living in Gaza should know 'the war is not over yet' - before demanding they remain in the south of the strip.\nBut James Elder, spokesperson for the U.N. children's agency UNICEF, said the agency was pleading for the truce to be made permanent.\nHe said: 'We cannot in all decent conscience go from a four or five day pause into killing of children again.'\nMembers of the media and people gather at Rafah border as Hamas militants are expected to release hostages abducted by Hamas during the October 7 attack on Israel as part of a hostages-prisoners swap deal between Hamas and Israel, November 24\nPalestinians, including poeple injured during the bombardment, pass an Israeli tank as they flee the north through the Salaheddine road in the Zeitoun district on the southern outskirts of Gaza City on November 24\nAn Israeli soldier stands guard during preparations to receive the Israeli hostages held by Hamas after their release, in Hatzerim, southern Israel, November 24\nIsraeli border guards take position outside the Ofer military camp between Ramallah and Baytunia in the West Bank city amid preparations for the release of Palestinian prisoners in exchange for Israeli hostages held by Hamas in Gaza, on November 24\nIsraeli military armoured vechiles roll in a convoy near the Salaheddine road on the southern outskirts of Gaza City on November 24\nReleased hostage children will be given ear defenders to protect them from the noise of helicopters taking them to hospital it has emerged.\nOfficials have been worried that the intense shock and experience of travelling on a helicopter may cause anxiety amongst the youngest children set to be freed.\nSome are said to be only three or four years old and medical staff have been discussing travel arrangements with Israeli Defence Forces officials.\nPreparations for their arrival have intensified over the last few days with hospitals, medical staff and trauma specialists remaining on standby.\nThey will also be given a hold-all containing clothes, blankets food, wipes, wash bags and - for the children - colouring books and pencils.\nIn a statement the Israeli Defence Forces said: 'Over the past day, the IDF completed preparations for receiving the hostages released from captivity in the Gaza Strip upon their return to Israel.\n'The IDF, in coordination with government ministries and security authorities, have prepared to quickly receive the released hostages and give them all the necessary support.\nStuffed animals and cushions await the arrival of children who have been held hostage in the Gaza Strip\nPreparations have intensified over the last few days with hospitals and medical staff on standby including trauma specialists. Pictured: colouring books and toys awaiting the arrival of the hostages\nEar defenders waiting on the helicopter for the hostages. The IDF has said that after the initial reception and medical treatment, the released hostages will continue to hospitals, where they will be reunited with their families\nNoise cancelling headphones suitable for children are waiting for the hostages to help them cope with the intense shock and experience of travelling on a helicopter\nIsraeli Yasur military helicopter stands on the tarmac during preparations for the arrival of children who have been held hostage in the Gaza Strip who are due to be released as part of a deal between Israel and Hamas\n'As part of the preparations, the IDF has readied several locations dedicated to the initial reception of the released hostages, including with necessary medical provisions and support.\n'After the initial reception and medical treatment, the released hostages will continue to hospitals, where they will be reunited with their families.'\nIn Gaza nearly 15,000 people, 6,150 of them children, have been killed in the war, officials in the Hamas-run territory said.\nPalestinian authorities paused counting the dead for several days because, they said, the health system's collapse in northern Gaza following Israel's bombardment campaign made it impossible to provide an accurate figure..\nAbout 1,200 people, mostly civilians, were killed in Israel during the October 7 attack and around 240 taken hostage, according to Israeli officials.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Tearful Israeli hostages - including children and grandmother, 77, who terrorists previously claimed had died - take first steps of freedom as they are released by Hamas after 48 days in captivity", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12787625/First-hostages-released-Israel-Hamas-exchange-truce-deal.html"}