{"authors": ["Nick Pisa", "Nick Pisa In Tel Aviv"], "date_download": "2024-02-05 15:35:11", "date_modify": "None", "date_publish": "2023-11-24 11:59:31", "description": "Released hostage children will be given ear defenders to protect them from the noise of helicopters taking them to hospital it has emerged as concerns rise over how they will cope with the trauma.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12787111%2FIsrael-prepares-receive-13-hostages-ceasefire-holds-colouring-books-ear-defenders-children-young-three-doctors-fear-not-able-cope-helicoptered-safety.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/24/11/78195219-0-image-m-35_1700826809809.jpg", "language": "en", "localpath": null, "maintext": "Released hostage children will be given ear defenders to protect them from the noise of helicopters taking them to hospital it has emerged.\nOfficials have been worried that the intense shock and experience of travelling on a helicopter may cause anxiety amongst the youngest children set to be freed.\nSome are said to be only three or four years old and medical staff have been discussing travel arrangements with Israeli Defence Forces officials.\nPreparations for their arrival have intensified over the last few days with hospitals, medical staff and trauma specialists remaining on standby.\nThey will also be given a hold-all containing clothes, blankets food, wipes, wash bags and - for the children - colouring books and pencils.\nStuffed animals and cushions await the arrival of children who have been held hostage in the Gaza Strip\nPreparations have intensified over the last few days with hospitals and medical staff on standby including trauma specialists. Pictured: colouring books and toys awaiting the arrival of the hostages\nEar defenders waiting on the helicopter for the hostages. The IDF has said that after the initial reception and medical treatment, the released hostages will continue to hospitals, where they will be reunited with their families\nNoise cancelling headphones suitable for children are waiting for the hostages to help them cope with the intense shock and experience of travelling on a helicopter\nIsraeli Yasur military helicopter stands on the tarmac during preparations for the arrival of children who have been held hostage in the Gaza Strip who are due to be released as part of a deal between Israel and Hamas\nIn a statement the Israeli Defence Forces said: 'Over the past day, the IDF completed preparations for receiving the hostages released from captivity in the Gaza Strip upon their return to Israel.\n'The IDF, in coordination with government ministries and security authorities, have prepared to quickly receive the released hostages and give them all the necessary support.\n'As part of the preparations, the IDF has readied several locations dedicated to the initial reception of the released hostages, including with necessary medical provisions and support.\n'After the initial reception and medical treatment, the released hostages will continue to hospitals, where they will be reunited with their families.'\nA temporary ceasefire between Israel and Hamas has gone into effect, hours before the first hostage exchange is set to take place.\nThe fragile four-day truce begun at 7am local time (12am ET and 5am GMT), with guns due to be laid down across the region for the first time in almost seven weeks.\nBut smoke continued to rise across Gaza and journalists said artillery fire from inside the enclave carried on for 18 minutes after the ceasefire begun.\nThe Israel Defense Force (IDF) said its military has 'completed its operational preparations according to the defensive positions of the pause'.\nIt said on X that earlier in the day troops had 'destroyed a route of underground terrorist tunnels' and 'tunnel shafts' around the Al-Shifa hospital.\nA spokesman warned in a video that those living in Gaza should know 'the war is not over yet' - before demanding they remain in the south of the strip.\nThe world was bracing on Friday for the expected release of 13 Hamas hostages across the Rafah crossing into Egypt.\nThe women and children, who are being swapped for Palestinian prisoners, were due to be freed in the afternoon local time, but officials admitted it will be 'complicated'.\nAn Israeli soldier is seen on Friday morning leaving Gaza as the ceasefire begins\nIsraeli troops celebrate in their armoured vehicles as the truce came into effect\nAn Israeli soldier beamed as he leaves the Hamas-controlled enclave\nThe two sides agreed to a four-day truce so that 50 hostages in Gaza could be freed\nSmoke is seen billowing above Gaza this morning as the ceasefire comes into effect\nDespite the planned halt, artillery fire from inside the enclave carried on for 18 minutes\nA convoy of Israeli military tanks and Armored Personnel Carriers enter Israel\nUnder the Israel-Hamas deal, the two sides agreed to a four-day truce so that 50 women and children under the age of 19 taken hostage in Gaza could be freed.\nIn return, Israel would release 150 Palestinian women and teenagers from Israeli detention.\nThe 50 hostages, among about 240 taken by Hamas in their October 7 raid on Israel, are expected to be released in batches, probably about a dozen a day, during the four-day ceasefire.\nThe release will be coordinated by the International Committee of the Red Cross (ICRC), and the hostages are expected to be taken out of Gaza by 4pm on Friday and transported through Egypt.\nAn operations room in Doha will monitor the truce and the release of hostages, Qatar's foreign ministry said.\nThe Doha command center has direct lines of communication with Israel, the Hamas political office in Doha and the ICRC.\nThe lists of all civilians that would be released from Gaza has been agreed.\nIt is not publicly known who will be among them, but three-year-old Abigail Mor Erdan, an American-Israeli orphan, is believed likely to be freed. She celebrates her fourth birthday on Friday.\nEmily Hand, nine, an Irish-Israeli citizen, could also be among them. Her father said he will not believe she is free until he sees her with his own eyes.\nSome 30 children are currently believed to be among the 240 captives.\nFamilies of hostages whose names are not on the list of 13 to be freed by Hamas have spoken of their ‘pain and joy’ at the news.\nNiva Wenkert, whose son Omer, 22, kidnapped at the Nova festival while his friend Irish Israeli Kim Damti was killed, is among those told he was not among the 13.\nShe told MailOnline: 'I know my son is not on the list, I didn’t expect him to be he is 22 years old, he is not a young child so he is unlikely to be freed now.\n‘But he must come home soon, he has colitis, and he needs medicine, we just don’t know what condition he is in.\nAbigail's parents were murdered by Hamas. She has been held the terror group since then, but there is hope she will be freed today - her fourth birthday\nEmily Hand, who turned nine in Hamas captivity on November 17, is hoped to be released\n‘We had a phone call from the solider who has been assigned to look after us and keep us informed and he called and said Omer was not on the list.\n‘At the same time, I am joyful for the hostages that have been released and I wish them well but all I can do is hope and pray that my son will come home soon.\n‘I am full of faith and we as a family are keeping strong for him, we are full of belief that he will come home at some point.\nREAD MORE: Palestinian terrorist expected to be swapped for hostages demanded Israel pay for her plastic surgery after explosive she detonated left her with serious burns Advertisement\n‘It’s very difficult and we have some many questions but very few answers, we are a strong family and that is what is keeping us together.\n‘We believe in God and that helps the situation, and we believe that God will bring Omer back to us.’\nThe family have not heard anything from Omer since he was snatched at the Supernova festival rave which saw at least 360 killed.\nAgonisingly, three hours after the attack by Hamas thugs started the family were sent a video of Omer tied up in a flatbed white picked up truck in his underwear.\nMs Wenkert said: 'I saw that he is alive in that video and I saw his eyes, he has to come back alive.’\nWhile Mein Tzin, the mother of sisters Dafna, 15, and Ella, 8, revealed she was also informed her daughters would not be returning.\nShe said on X: 'It’s very difficult for me, I hope for their return.\n‘I feel relief for the other families and hope for the release of all the abductees.’\nIsraeli sources said the 13 who were earmarked for release at 2pm UK time this afternoon had been taken from the same kibbutz and were also held together in Gaza.\nAround Six hospitals have been put on standby across Israel to receive the hostages when they are released and a team of doctors and psychologists are ready to tend to them – with many expected to have severe PTSD.\nOrna Dotan, of the psychological resilience team dealing with the hostages, said: 'We cannot imagine what they went through, and it will be step by step recovery for them.\n'They will each need a tailor-made recovery solution and we hope that they will be able to continue their lives but for some it will never be the same.\n'They will have post-traumatic stress and they will have nightmares as well, and their families will suffer the same way.'\nIsraeli sources said the 13 who were earmarked for release at 2pm UK time this afternoon had been taken from the same kibbutz and were also held together in Gaza\nThe hostages are expected to make their way out of Gaza through the southern Rafah crossing into Egypt before heading into Israel for reunions with their families.\nOlder hostages are then expected to be debriefed by Israeli intelligence officials at a military base, who will want to know as much as possible as to where the others are being kept because as part of the truce a ‘no fly zone’ has been established over Gaza.\nA Ministry of Health official in Tel Aviv told the Mail that it was crucial hostages were ‘not overfed’ when they arrived, comparing it to the infamous scenes of emaciated Holocaust survivors at the end of the Second World War.\nThey said: 'They will not have eaten properly for six weeks so it’s important that what they are given is small and gives them energy, they will get water, some apples sauce and a biscuit initially, that’s it.\n‘Too much food, after not having eaten for days, can be a shock to the system and it will be the bare minimum for the first few days. They must not be overfed.’\nUpon their arrival, each returning hostage will be assigned to a designated soldier, ensuring personalised care and support.\nSpecialised training has been imparted to soldiers, especially in cases involving children, aimed at providing reassurance and companionship throughout the reintegration process.\nThe initial phase post-arrival involves medical screening and reception, and soldiers have also been told not to inform if they are asked if they know anything about loved ones ‘even if they know they are dead’.\nIsrael's tanks and military vehicles are seen driving out of Gaza on Friday morning\nPalestinians are seen driving away from their temporary shelters this morning\nPalestinians who had taken refuge in temporary shelters return to their homes in Khan Yunis\nMark Regev, a senior advisor to Israel's prime minister Benjamin Netanyahu, told CNN on Thursday night they were trying to stay positive about the release of the hostages.\n'Like [US President Joe] Biden, I think Israelis are keeping their fingers crossed that this will, in fact, happen, and we'll see 13 Israelis returned tomorrow,' he said.\n'That's our hope. But we have to wait and see. We know who we're dealing with. Hamas is a brutal, ruthless terrorist organization and we have to be ready for things that are unexpected.'\nAlong with the release of some of the hostages comes a halt in fighting, which promised some relief for Gaza's 2.3million people, who have endured weeks of Israeli bombardment, as well as families in Israel fearful for the fate of loved ones taken captive.\nSmoke was rising over Gaza as the deadline passed, and CNN's correspondent in the Israeli town of Sderot, on the border with Gaza, heard booms coming from the enclave and what he said was the sound of artillery fire. Air raid sirens were also heard in Sderot, CNN reported, although it was unclear whether missiles were fired.\n'We are hearing the sounds of war,' said Jeremy Diamond in the minutes after the ceasefire deadline passed. 'And we are not supposed to be hearing that after the truce.'\nHe reported that after the first 20 minutes of tension, the noise subsided and the truce appeared to be in place.\nThe ceasefire was agreed for 7am local time on Friday, and Israel immediately issued a statement urging Palestinians in Gaza not to return to their homes in the north.\nAvichay Adraee, the IDF spokesman for Arab media, said: 'The war is not over yet. The humanitarian pause is temporary. The northern Gaza Strip is a dangerous war zone and it is forbidden to move north.\n'For your safety, you must remain in the humanitarian zone in the south. It is only possible to move from the north of the Strip to the south via Salah al-Din Road. The movement of residents from the south of the Strip to the north is not allowed and dangerous.'\nA woman carries her cat back to her home in Gaza after staying in a temporary shelter\nPalestinians were on the road, returning to their homes as the ceasefire begun\nMany Palestinians were left displaced by the ongoing fighting between Hamas and Israel\nAn Egyptian official said that 130,000 gallons of diesel would enter Gaza to hep the crisis\nA family is seen leaving their temporary shelter to return home this morning\nIsraeli PM Mr Netanyahu vowed earlier in the week to continue the war after the truce expires, to destroy Hamas' military capabilities, end its 16-year rule in Gaza, and return all the estimated 240 captives held in Gaza by Hamas and other groups.\n'We will continue it until we achieve all our goals,' Mr Netanyahu said, adding that he had delivered the same message in a phone call to Mr Biden.\nWashington has provided extensive military and diplomatic support to Israel since the start of the war.\nIsraeli defense minister Yoav Gallant was quoted as telling troops on Thursday that their respite will be short, and that the war would resume with intensity for at least two more months.\nIn Gaza's city of Khan Younis, Palestinians welcomed the respite of the upcoming ceasefire but said four days would do little to relieve the humanitarian disaster caused by the war.\n'God willing, it becomes a total cease-fire,' said resident Jihan Qanan, speaking to AP.\n'People have had houses brought down on their heads, they've been expelled. There's no homes, no money, no possessions. [Their] whole world is wrecked.'\nAn Egyptian official said that 130,000 gallons of diesel would enter Gaza.\n'Two hundred trucks, loaded with food, medicine and water, will enter daily for the first time since the start of the Israeli war on the strip,' Diaa Rashwan, the chairman of Egypt's State Information Service, said in a statement.\nRashwan said that Egypt would continue to receive groups of injured people from Gaza for treatment, and help foreigners and dual-citizens leave.\nHe also said that for the first time since the start of the conflict, Egypt would allow in Palestinians who wished to enter Gaza through the Rafah border crossing.\nThe first tranche of 13 hostages would be released later today, mediators in Qatar said.\nIn the hours before the ceasefire was due to be enacted, Israel attacked a residential building in Nuseirat refugee camp in central Gaza, carried out airstrikes in northern Gaza, and raided the Indonesian hospital in northern Gaza.\nAn Israeli soldier is seen on Thursday leaving the Gaza Strip and returning to his base\nPalestinians search for bodies and survivors among the rubble of a destroyed house following fresh Israeli airstrikes in Khan Younis, southern Gaza, on Thursday\nPortraits of Israeli hostages held in Gaza since the October 7 attack by Hamas in Tel Aviv\nThe ceasefire and hostage transfer had been expected to begin on Thursday. Regev said he could not discuss the delay.\nThe hostages are from many countries - the majority Israeli and Thai, but with around ten from the United States and others from the UK, Spain, France, Germany, Argentina, the Netherlands and beyond.\nPalestinian officials have provided a list of 300 people they want releasing - most from the Israeli-occupied West Bank and Jerusalem, and held for incidents such as attempted stabbings, hurling stones at Israeli soldiers, making explosives, damaging property and having contacts with hostile organizations. None are accused of murder.\nMany were held under administrative detention, meaning they were held without trial.\nThe released prisoners could be taken by buses to the presidential headquarters of the Palestinian Authority first as in past releases, Reuters reported - even though Palestinian president Mahmoud Abbas had no role in these truce negotiations, a Palestinian official said.\nThose involved in the deal have described the break in hostilities 'a humanitarian pause'.\nThe pause will be extended by a day for each additional batch of ten hostages released, Israel said in a statement.\nHamas said Israel had agreed to halt air traffic over the north of Gaza from 10am until 4pm each day of the truce and to halt all air traffic over the south for the entire period.\nFamilies of hostages and their supporters demanded that Israeli prime minister BenNetanyahu secures the release of Israeli hostages. Protesters in Tel Aviv on November 18\nIsraeli soldiers are seen on November 21 transferring detained Palestinians out of Gaza\nThe group said Israel agreed not to attack or arrest anyone in Gaza, and people can move freely along Salah al-Din Street, the main road along which many Palestinians have fled northern Gaza where Israel launched its ground invasion.\nMohammed Al-Khulaifi, the Qatar's chief negotiator and the minister of state at the foreign ministry, said that under the deal there would be 'no attack, whatsoever. No military movements, no expansion, nothing'.\nAs the hostages are released, aid will enter Gaza, where 2.3million people have been running out of food and many hospitals have shut down in part because they no longer have fuel for their generators.\nThe Hamas armed wing said on Thursday that 200 aid trucks and four fuel trucks would enter Gaza daily.\nThe number of people killed in Gaza from Israeli attacks since October 7 now stands at 14,854, including 5,850 children, according to information from Hamas authorities in the strip.\nHamas killed 1,200 Israelis on October 7 when they stormed communities near the Gaza border.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel prepares to receive 13 hostages as ceasefire holds - with colouring books and ear defenders for children as young as three who doctors fear may not be able to cope as they are helicoptered to s", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12787111/Israel-prepares-receive-13-hostages-ceasefire-holds-colouring-books-ear-defenders-children-young-three-doctors-fear-not-able-cope-helicoptered-safety.html?ns_mchannel=rssns_campaign=1490ito=1490"}