{"authors": ["Bethan Mckernan", "Sufian Taha"], "date_download": "2024-02-05 15:35:12", "date_modify": "None", "date_publish": "2023-11-24 21:41:09", "description": "Families await possible reunion with detained women and children as Israel reportedly releases 39 in ceasefire deal", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F24%2Fpalestinians-gather-outside-israeli-prison-in-hope-of-greeting-freed-prisoners.json", "image_url": "https://i.guim.co.uk/img/media/bc290b31a5865a662d5072eefd822e0c3d421e67/0_71_1566_940/master/1566.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cfa2d20fe4dc79e37c732d17d8ddb50b", "language": "en", "localpath": null, "maintext": "As the sun began to set on Friday, thousands of Palestinians gathered at an Israeli checkpoint north of Jerusalem, next to the notorious Ofer military prison, in the hopes that imprisoned loved ones would return home as part of a ceasefire deal in the seven-week-old war between Israel and Hamas.\nQatari officials said 39 Palestinian women and children held in Israeli jails were released on Friday night. That came in exchange for the safe return of 13 Israelis held in the Gaza Strip as hostages since Hamas attacked communities in the south of the country last month, sparking the deadliest round of fighting in the decades-old Israeli-Palestinian conflict to date.\nFor a handful of the hundreds of thousands of Palestinian families with members in Israeli military prisons, the anxious wait ended on Friday night, as 24 women and 15 children were shuttled into Betunia, a suburb of Ramallah in the occupied West Bank, on two International Committee of Red Cross (ICRC) buses. They were greeted with singing, Palestinian flags, the flags of the militant wings of Hamas and the West Bank’s dominant Fatah party, and the hugs and tears of their mothers, fathers, sons and daughters.\n“This is a happy day but it is also filled with sadness,” said Fairuz Fayez Mahmoud Al-Bu, a 26-year-old from Abu Dis who had been held in administrative detention – without charge or trial – for more than two years. She was arrested for allegedly stabbing an Israeli, an allegation she denies.\n“The war in Gaza is still happening and our people are dying.”\nAfter weeks of frantic diplomatic efforts – brokered by Qatar, Egypt and the US – Israel and Hamas, the Palestinian group in control of Gaza, agreed a four-day ceasefire that went into effect on Friday at 7am (5am GMT), 24 hours later than originally planned.\nFamilies across Israel and the occupied Palestinian territories endured a tense day before it emerged that the pause in hostilities was holding, and the hostage releases could begin. The families of the first group of 13 Israeli children and elderly women to be released were told by Israeli authorities to gather at a hospital complex before their loved ones’ expected arrival, where they were reunited after seven weeks apart with almost no news or signs of life.\nFor the Palestinians, the details remained unclear until the last minute after the Israeli justice ministry published the names of 300 women and children who would be considered for release on Thursday. There was no forthcoming information about when, where or how they would be released before the buses arrived at the Betunia checkpoint on Friday night, where families had gathered in hope.\nFor Najah Awad, 43, the wait continues. Her daughter, now 24, was sentenced to 13 years for stabbing a passerby in Jerusalem in 2015.\n“Noorhan was only 16 years old when she was arrested. Now she is 24, and we haven’t been able to visit her since the war started, we have had no news,” Awad said.\n“I knew from the newspaper when they published the names. I am really happy, but I will not believe it until I see it. We prepared her room for her. I can’t wait for her to be home.”\nThe ceasefire deal includes a clause stipulating that after the initial four-day ceasefire, there will be an additional day in which fighting is paused, up to a total of 10 days. For every 10 Gaza hostages that come home safely, three times as many Palestinians in Israeli jails will be released.\nThe deal on prisoner releases has shone a light on Israeli detention and sentencing practices in the Palestinian territories, where Palestinians are tried in military courts with a more than 98% conviction rate and in which minors are regularly imprisoned.\nAll but four on the list of 300 are from the West Bank and Jerusalem. Israel refused to release anyone sentenced for murder; most are held for stone-throwing, damaging property, having contact with “hostile” organisations, and more serious charges such as attempted murder and manufacturing explosives.\nAbout 1,200 Israelis were killed and 240 taken hostage by Hamas on 7 October, after which Israel declared a war on the Palestinian militant group. More than 14,800 people have been killed in intensive bombings and an unprecedented ground operations, according to the local health ministry.\nThe new war in Gaza – the fifth since Hamas seized control of the strip in 2007 - has destroyed more than 40% of the strip’s housing stock, the UN says, as well as medical infrastructure. The exclave’s population of 2.3 million is facing a severe humanitarian crisis, with inadequate water, food, fuel and medicine.\nThe Israeli campaign has split the territory into two halves, with most of the population now pushed to the south. The Israel Defense Forces has said northern Gaza, where its offensive is currently focused, remains out of bounds, and that displaced Palestinians trying to return to the area will not be allowed to enter.\nIsrael has a history of agreeing to asymmetrical prisoner swaps: in 2011, Gilad Shalit, an Israeli soldier, returned home after five years of captivity in the Gaza Strip in exchange for 1,000 Palestinians in Israeli jails.\nHamas had previously released four hostages unilaterally: Judith Tai Raanan and her 17-year-old daughter, Natalie Raanan, a woman and daughter with dual Israeli-US citizenship, on 20 October, followed by two elderly Israeli women, Yocheved Lifshitz and Nurit Yitzhak, on 23 October. One soldier, a 19-year-old, was rescued by Israeli forces.\nMilitant groups in the strip have claimed that several hostages have been killed by Israeli bombings, but only one death has been confirmed by Israeli authorities.", "source_domain": "www.theguardian.com", "text": null, "title": "‘I won’t believe it until I see it’: Palestinians gather to greet freed prisoners", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/24/palestinians-gather-outside-israeli-prison-in-hope-of-greeting-freed-prisoners"}