{"authors": ["Joe Hutchison", "Joe Hutchison For Dailymail.Com"], "date_download": "2024-02-05 15:14:35", "date_modify": "None", "date_publish": "2024-01-30 14:59:17", "description": "Kennedy Ladon Sanders' family paid tribute to the 24-year-old after she died in an Iranian-backed blast on the base near the Syrian border over the weekend.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13023433%2FIran-military-drone-strike-Syria-Jordan-Soldier.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/30/14/80606655-0-image-m-19_1706625807305.jpg", "language": "en", "localpath": null, "maintext": "The heartbroken family of a US soldier killed in a Jordan airstrike have revealed she died alongside her best friend, after following in her family's footsteps to join the military.\nKennedy Ladon Sanders' family paid tribute to the 24-year-old after she died in an Iranian-backed blast on the base near the Syrian border over the weekend.\nHer parents Shawn and Onedia Sanders have described how Sanders was close with fellow fallen soldier Breonna Moffet, who died in the same attack.\nThe Pentagon on Monday confirmed the pair were likely in their beds when the drone struck their sleeping quarters.\nMom Onedia told Fox News: 'She made a lot of friends during her time in the military, even people who she went through basic training with.\n'Breonna Moffet was one of the ones she grew a close relationship with. Every time she called me or Facetimed me Breonna Moffet was always somewhere nearby.'\nShawn and Onedia Sanders, seen here, have described how Sanders was close with fellow fallen soldier Breonna Moffet, who died in the same attack\nKennedy Ladon Sanders' she died in an Iranian-backed blast on the base near the Syrian border over the weekend\nWhile father Shawn told the outlet: 'She was the life of the party. She enjoyed life.\n'She was very competitive, she was goal-oriented and loved the service and serving our country. I miss her right know, this morning has been tough for me.'\nWhen asked if she joined the army reserves due to her family being involved in the military, Sanders said: 'We have family that has served.\n'I don't know where the influence came from, but she enjoyed her time in the service.\n'Me being prior service, I am always focused on her commitment to the army and understanding the ultimate sacrifice.\n'I came home, her big brother came home. My dad came home. A lot of us don't have the opportunity to come home, and for those who don't we should honor them.\n'I am gracious to be part of it and that so many people are willing to reach out and share their sentiment about her duty to the country.\nOneida added: 'I just want everyone to know that Kennedy was a fun-loving person and lived her life to the fullest and enjoyed life.\n'I encourage everyone to do the same and whenever you think about Kennedy, whether you knew her or not, just think about how joyful of a personality she was.'\nShawn described Sanders, seen here, as being the 'life of the party' and said she had loved her time in the service\nShawn Sanders, seen here during his time in the military, said his father and Kennedy's brother had all be in the service, with his daughter following in their footsteps\nThe drone attack late Saturday night impacted a US outpost located in the northeast part of the country known as Tower 22, near the Syria border, and resulted in at least 34 other injuries\nIt comes after Breonna Moffett's family paid tribute to her after also being killed in the blast over the weekend.\nIn an interview with CNN's Abby Philips, Francine and Bernard Moffett described their late daughter as 'loud,' 'loving,' and 'always there for everybody.'\nThey told how she was 'nervous' for her first foreign deployment, but said she was 'loud, loving and always there for everybody'.\nMoffett's parents described learning of the news of their eldest child's passing on Sunday when military officials knocked on the door. 'It was extremely rough,' said her father.\n'We didn't hear of the attack until after we were notified. We were getting ready for church' when the military arrived 'and let us know that it was our baby.'\nHer mother mentioned that Breonna's decision to enlist came after her mother had spent time in the military.\n'She became the second female in the family to join the military,' said Francine. 'She was very proud of herself. I was always very proud of her.'\nSanders and Moffet died alongside William Rivers during the deadly suicide drone attack on Saturday\nIn an interview with CNN 's Abby Philips, Francine and Bernard Moffett described their late daughter as 'loud,' 'loving,' and 'always there for everybody'\nSpecialist Breonna Moffett, 23, of Savannah, Georgia was identified as one of the soldiers killed in the weeekend drone strike\nThis undated photo provided by the U.S. Army shows Sgt. William Jerome Rivers, 46 who also died in the blast\nThe troops were in their sleeping quarters at the time and the Pentagon confirmed Monday that the victims were likely in bed.\nThe three soldiers were assigned to the 718th Engineer Company, a US Army Reserve unit based out of Fort Moore, Georgia.\nRivers, of Carrollton, Georgia enlisted in the Army Reserve in 2011 was an Interior Electrician.\nHis awards and decorations include the Army Achievement Medal, National Defense Service Medal, Global War on Terrorism Service Medal, Army Service Ribbon, Overseas Service Ribbon, two Army Reserve Component Overseas Training Ribbon, Armed Forces Reserve Medal with 'M' Device and the Inherent Resolve Campaign Medal with Campaign Star.\nChief of Army Reserve, Lt. Gen. Jody J. Daniels, said: 'The loss of Sergeant William J. Rivers, Specialist Breonna A. Moffett and Specialist Kennedy L. Sanders has left an indelible mark on the United States Army Reserve.\nMarines talk to their comrades on the ground during military maneuvers in the Middle Eastern Country, which borders Syria and Iraq\n'On behalf of the U.S. Army Reserve, I share in the sorrow felt by their friends, family, and loved ones. Their service and sacrifice will not be forgotten, and we are committed to supporting those left behind in the wake of this tragedy.'\nOn Monday night the Biden administration was reportedly mulling revenge strikes on Iranian targets across the Middle East.\nIn a statement made over the weekend, President Biden said: 'While we are still gathering the facts of this attack, we know it was carried out by radical Iran-backed militant groups operating in Syria and Iraq.'\n'Jill and I join the families and friends of our fallen - and Americans across the country - in grieving the loss of these warriors in this despicable and wholly unjust attack.'\nHe added that the three fallen soldiers 'embodied the very best of our nation' - them being 'unwavering in their bravery... unflinching in their duty... [and] unbending in their commitment to our country.'\nThey died, he said, 'risking their own safety for the safety of their fellow Americans, and our allies and partners with whom we stand in the fight against terrorism.'\n'It is a fight we will not cease,' Biden, 81, proclaimed.\nWhile he did not identify the militants responsible, the statement confirmed the strike was the work of anti-Western jihadists operating somewhere in the region.\nBoth countries, as of Sunday, boast a bevy of Iran-aligned militias, including Hezbollah and several other Shia militant groups.\nSince the Syrian War in 2011, Iran has also backed multiple Palestinian terror groups based in Gaza, and various terrorist groups in Bahrain and elsewhere across the Middle East.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Heartbroken family of US soldier, 24, killed in Jordan strike reveal she died alongside her best friend, 23, after following in her grandfather and father's footsteps to join the military", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13023433/Iran-military-drone-strike-Syria-Jordan-Soldier.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}