{"authors": ["Will Stewart", "Image", "Social Media"], "date_download": "2024-02-05 15:16:00", "date_modify": "None", "date_publish": "2024-01-24 09:55:28", "description": "According to the Russian Defence Ministry, the plane was carrying 65 Ukrainian POWs, six flight staff, and three escorts when the II-76 military aircraft plummeted to the earth and exploded in a huge fireball", "filename": "https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fworld-news%2Fbreaking-moment-russian-plane-63-31953907.json", "image_url": "https://i2-prod.mirror.co.uk/incoming/article31953922.ece/ALTERNATES/s1200/0_PAY-Russian-Il-76-crash-7-east2west-news.jpg", "language": "en", "localpath": null, "maintext": "According to the Russian Defence Ministry, the plane was carrying 65 Ukrainian POWs, six flight staff, and three escorts when the II-76 military aircraft plummeted to the earth and exploded in a huge fireball\nThis is the moment a Russian military Il-76 aircraft crashed in a ball of fire in Belgorod region, bordering Ukraine, today.\nThe cause of the crash and explosion is so far unconfirmed. The Russian Defense Ministry has now confirmed that it was carrying 65 Ukrainian prisoners of war, six crew, and three escorts on board Il-76 military aircraft that crashed in Korochansky district, Belgorod Oblast.\n‌A video shows the plane out of control and lurching towards the ground, then a huge fireball as it crashed. Some reports suggested it was on fire as it came down, but the cause remains unclear.\nBelgorod governor Vyacheslav Gladkov confirmed an incident without giving full details. “Currently, an investigation team and employees of the Ministry of Emergency Situations are working on the spot,” he said. “I have changed my work schedule and gone to the area. All details later.”\nImage: social media/e2w) social media/e2w)\nStarsche Eddypro-war Telegram channel said: “Judging by the video, the Il-76 military transport aircraft was on fire before the fall. Fire is visible in the area of the left engine.”\nThere were preliminary 63 people on board the crashed Il-76 near Belgorod. Their fate is being determined.. Earlier there had been a missile threat in Belgorod region and claims Russian air defences shot down an aircraft-style drone flown from Ukraine.\nRussian media outlets cited the Russian Defence Ministry claiming there were 65 captured Ukrainian prisoners of war on the stricken Il-76 military transport aircraft. They were due to be exchanged.\nImage: social media/e2w) social media/e2w)\nA statement said: “The Il-76 crashed at about 11.00 [local time] in the Belgorod region. On board the fallen Il-76 there were 65 captured military personnel of the Ukrainian Armed Forces transported to the Belgorod region for exchange, six aircraft crew members and three accompanying persons.\nThe statement - which was run by the Ministry’s own channel Zvezda - means it is a monumental tragedy for Ukraine.\nA Russian Telegram channel alleged the Il-76 was shot down, implying it was by the Ukrainians. “The crew [of the plane flying next to the fallen Il-76] reports a missile hitting the [Il-76].”\nAn audio recording purportedly suggested the plane was hit by a missile. The same channel said: “Ukrainian sources celebrate the crash and say it was their missile that hit it.”\nRybar pro-war channel said: “So far, there are two versions of the downing of the IL-76 near Belgorod - either a shooting down or a technical malfunction. Given the fact that yesterday two IRIS-T SAMs, which Ukrainian formations had dragged to the border near Suzha, were shot down, technical malfunction is hardly believable. The AFU [Ukrainian army] began saturating the border region with surface-to-air missile systems from the beginning of the year. There were 65 Ukrainian prisoners of war on board, who were being prepared to be exchanged today as part of the planned exchange with the Ukrainian side. The exchange was delayed and sabotaged by the Ukrainian side for quite a long time. A total of 192 people were to be exchanged. The Ukrainian side repeatedly sabotaged it and tried to slip in other people. Now the GUR and the SBU [Ukrainian secret services] are certain to use the story of the downed IL-76 to accuse the Russian side of deliberate provocation and disrupting the exchange process.”\nThe crash was close to Krivoy Khutor village in Korochansky district. It is about 57 miles from the border with Ukraine and 40 miles northeast of Belgorod, the regional capital. It is 80 miles from Ukrainian city Kharkiv as bird flies One report suggested that the plane had Ukrainian PoWs on board, who were to be exchanged in a prisoner swap. But this claim from FighterBomber Telegram channel was withdrawn.", "source_domain": "www.mirror.co.uk", "text": null, "title": "Moment Russian plane with 63 onboard explodes into massive fireball on border of Ukraine", "title_page": null, "title_rss": null, "url": "https://www.mirror.co.uk/news/world-news/breaking-moment-russian-plane-63-31953907"}