{"authors": ["Jonathan Freedland"], "date_download": "2024-02-05 15:35:13", "date_modify": "None", "date_publish": "2023-11-24 19:22:29", "description": "Jonathan Freedland talks to survivors, displaced people and senior political and military figures about life in Israel before and after 7 October, and considers the longer-term ramifications", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F24%2Ffrom-a-judicial-coup-to-the-hamas-attack-the-year-that-tore-apart-then-reunited-israel.json", "image_url": "https://i.guim.co.uk/img/media/0b8851171742672acb3b2b0629203fa95733ba1d/0_400_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ded125f444000f2c7744116cb65b4c7b", "language": "en", "localpath": null, "maintext": "The war is paused, but it is not over.\nThere will be relief at the promised four days of quiet between Israel and Hamas, and there will be joy for the families waiting to be reunited with loved ones, thanks to Friday’s exchange of hostages held in Gaza for prisoners held in Israel.\nBut even if the ceasefire is extended, perhaps in return for the release of more Hamas-held captives, this war will not be over anytime soon. If anything, it is likely to intensify.\nIt is too big to stop now, it runs too deep. And it has already turned Israel upside down.\nYou only have to spend a few days in the country to see that. The war is everywhere. In the airport, signs direct you to the nearest bomb shelter in case the siren should sound. Open Google Maps and, unprompted, it shows you where to go to take cover.\nBy the roadside, huge billboards carry patriotic slogans – “We Will Triumph”, “We Are All One Israel” – against the rippling blue and white of the national flag.\nView image in fullscreen A controversial billboard in Tel Aviv, depicting the leaders of Hamas on their knees as prisoners, designed to instil confidence back into Israeli people after the Hamas attack. Photograph: Rick Findler/The Guardian\nUse a taxi-hailing app, and it promises you: “Together we’ll get through this!”. And everywhere, on every lamppost and wall, even on the display screens of the passport machines, are those same images of the hostages’ faces and the ever-present demand, sometimes shouted through hoarse megaphones at traffic intersections, sometimes on T-shirts: “Bring Them Home Now.”\nOn that, and on the war itself, there is a striking unity. Among Jewish Israelis, the internal dissent that greeted the first Lebanon war in 1982 and the second in 2006 is absent.\nThere is next to no opposition, even from those who stood against previous military operations in Gaza. This, they say, is different.\nIt has been seven weeks since an estimated 3,000 Hamas militants with murder on their minds tore down the fence that stood between them and southern Israel.\nThey entered a string of kibbutzim, and stormed an outdoor music festival, to gun down, maim and torture more than 1,200 people, most of them civilians, including the extremely young and the extremely old. Some they shot, some they burned alive in their homes. Those they did not kill, they took back to Gaza as captives – and bargaining chips – including many children and several babies.\n00:01:44 How Hamas attack on music festival in Israel unfolded – video report\nIt was the deadliest single attack in Israel’s 75-year history, the greatest loss of Jewish life since the Holocaust, and though the rest of the world has focused since 7 October on the Israeli response to that attack – a bombardment of Gaza that has so far killed an estimated 14,000 Palestinians, including children and babies – inside Israel the agony of that day remains fresh and sharp.\n“It’s not yet post-traumatic stress disorder,” said one senior military figure. “We’re still in it.” When asked about the colossal death toll in Gaza, a former general candidly admitted that not many Israelis were thinking about that.\n“Because of the cruelty, the butchery [of 7 October] … there is no room for the other side’s pain.”\nNot much more than an hour’s drive south from Tel Aviv, you get a clue why that might be. You are in the Gaza envelope, the area of Israel that neighbours the strip. Much of it is closed off now, as it has been since 7 October.\nEarlier this week – on a trip arranged not through the government or military, but a local kibbutz – the area was all but deserted, the quiet punctuated by the regular thud and boom of Israeli bombardment in northern Gaza.\nYou drive past the Re’im park, where more than 360 young people, dancing at dawn at the Nova festival, were gunned down. The surface of the road is scarred every few metres by black scorch marks, where cars carrying those fleeing for their lives were fired on and exploded into flames.\nSoon you reach Be’eri, where 100 people were killed. Enough buildings still stand to remind you that it is a kibbutz, though now it looks more like a military base, with heavy-duty equipment, a large communications mast and armed personnel everywhere. The houses are charred ruins.\n00:01:54 Israel: bodies recovered from villages infiltrated by Hamas along Gaza border – video report\nYou are told that when the Hamas militants came here, they aimed rocket-propelled grenades at the gas canisters outside each home, hoping to create a fireball that would engulf the house in temperatures exceeding 500C (930F). You are told that what was left took several weeks to identify as human.\nYou see the twisted metal that is all that remains of the classrooms that housed the eight- and nine-year-olds. You see the clinic studded with bullet holes, an abandoned medicine container nearby. You see a child’s bike. You see the burnt vestiges of a mobility scooter.\nMy guide was Benny Hasson, 68, and he was keen that we head before nightfall to his own, smaller kibbutz of Kissufim, which is even closer to Gaza, less than a kilometre away. As we drive, Hasson, whose family were originally refugees from Libya and who has lived on Kissufim all his adult life, looks ruefully at the orange groves, where the fruit lies uncollected on the ground. No one is allowed back to do the picking.\nWe enter the kibbutz, which is now a ghost town: entirely empty. The houses are riddled with bullet holes, sometimes in a pattern.\nView image in fullscreen The remains of a house at Kibbutz Kissufim. Photograph: Bernat Armangué/AP\nHasson wants to go into his own house, to show me the mamad, the reinforced room with a steel door designed as a shelter from rocket fire, where he, his wife and their dog hid for 22 hours, even as Hamas men rained fire on their house, from inside and out. He shows me how he used an ironing board to jam the door handle, so it couldn’t be opened. The intruders tried shooting at it; they tried to fire on the outdoor gas canisters. But somehow they failed; Hasson doesn’t quite understand how.\nInside the room, he and his wife suppressed the urge to go to the bathroom. Perhaps their bodies shut down from fear. “That day babies did not cry, dogs did not bark,” he tells me. It was a kind of miracle.\nOpposite his house are several cabins that were used to house conscript soldiers from the observer unit, mostly women aged 18 or 19. They were charged with monitoring the border, watching camera feeds and the like. (It has since emerged that their warnings of suspicious activity before 7 October were ignored by their superiors.)\nOn that sabbath morning, Hamas seized the lookout posts. Hiding in their safe room, Hasson and his wife could hear the screams of those women as they were tortured and, he believes, raped, hour after hour. He tells me he has not slept since that day seven weeks ago. He is haunted by the screams.\nWe walk out of the room, crunching on broken glass. Hasson’s son, Hen, finds a spent bullet from an AK-47, coated in plaster from one of the walls. And then, as if compelled to do so, Hasson points one by one to the houses of his neighbours.\nThis one belonged to a 91-year-old founder of Kissufim. The Hamas men killed her, attached her body to a rope and then dragged it around the kibbutz behind a motorbike. “Like in a western.”\nThat one was home to a man of 80. His body was found “diced”, cut up by a garden spade.\nThen he shows me the modest house of 85-year-old Shlomo Mansour, with its quirky garden, filled with pottery, an old clock and metal letters spelling out the word “dream”. Mansour is now a hostage in Gaza.\nThe stories keep coming, of how one resident ingeniously diverted Hamas by breaking a window of his house and splashing ketchup close by – tricking the killers into thinking the people inside were already dead. He saved several neighbours that way.\nAnd I learn of the man who ran Kissufim’s dairy, who went back to check on his cows six days after the attack – only to be shot dead by a Hamas man who had been hiding on the kibbutz all that time.\nYou hear all this and it does not take long to understand why Israelis have concluded that Hamas can no longer be in charge just over the fence, less than 1km away; that it can no longer retain the military capacity to repeat what it did on 7 October and which its leaders have vowed to do again and again. That it has, instead, to be defeated.\nI hear the point spelled out when I visit the place where many of the displaced residents of the Gaza envelope now live, temporarily rehoused in hotels by the Dead Sea. I meet Ellie Segal, a resident of Kissufim who is 29 and is helping to run a makeshift kindergarten in a hotel conference room.\nShe tells me she is seeing the events of 7 October acted out in the children’s play: it’s all “soldiers, war and rockets”. Sure, kids have always played war games, she says, but not like this, “with so much killing and dying”. She is clear that Hamas has to be taken out of the picture altogether. “They came to kill us all – and they did a pretty good job.”\nSegal is one of an estimated 250,000 Israelis now internally displaced. It is not just residents from the south, it is also those in the north who live close to the Lebanese border, within range of Hezbollah, whose arsenal dwarfs that of Hamas and whose commitment to the eradication of Israel is scarcely less adamant.\nHundreds of school pupils from the northern town of Kiryat Shmona have been relocated to temporary classrooms on the campus of Tel Aviv University. For decades, Israel has been seen – and has seen itself – as a regional superpower, with a mighty military.\nView image in fullscreen Israelis leaving Kiryat Shmona after they were asked to evacuate voluntarily in October. Photograph: Atef Safadi/EPA\nBut since 7 October, its people feel vulnerable.\nSo the only discussion among politicians and senior soldiers is not whether to inflict a decisive defeat on Hamas, but when and how it can be done. No one thinks it will be easy or quick. Indeed, in a week’s worth of conversations, I heard far more talk of problems than possible solutions.\nOne former minister told me he worries that the Israel Defense Forces are currently operating in the north of Gaza and above ground, when Hamas’s fighters are in the south and below ground, hiding in their tunnel network. Victory will only come when the IDF moves south, he said. But surely that will mean bombarding the very area – the south - where Israel previously told Palestinians to flee for their own safety, and that will lead to many more civilian deaths? He suggested that people in the south could be told to move out of specific places, clearing one “theatre” of operations at a time so the IDF can strike. But if that’s the method, what would Palestinians be returning to exactly? Gaza City in the north has been destroyed, reduced to rubble. If that is the precedent, how much of Gaza will be left?\nOthers talk of needing to clear a buffer zone along Gaza’s boundary with Israel, between 1km and 2km deep – so that never again are the likes of Benny Hasson and Ellie Segal so close to people bent on murdering them. But Gaza is already narrow, just 6km in places. How could it be made narrower? And by that logic, wouldn’t Israel have to do the same along the border with Lebanon – a move that would trigger a war with Hezbollah, making the current conflict look tame by comparison?\nEscalation could come from numerous directions.\nA combination of settler violence and IDF action in the West Bank has killed an estimated 225 people since 7 October, with ultra-nationalists inside and outside the Israeli government apparently determined to ignite an already combustible situation.\nHamas enjoys substantial support there, raising the prospect of a full-blown revolt. And of course there are the Palestinian Arab people who make up a fifth of Israeli citizens.\n“There is not a Palestinian that does not cry three or four times a day at the visuals that come out of Gaza,” the Fatah activist and East Jerusalemite Samer Sinjlawi told me. “It’s there in the heart, the stomach and the mind.” You might not see the reaction now, he says. But it is coming.\nWhich is why hopes that this weekend’s ceasefire might signal the beginning of the end are probably wide of the mark. This may not even be the end of the beginning. Israeli policymakers are braced for a long campaign, even if it is not fought at the intensity of the last seven weeks. And there is some disbelief, as well as disappointment, that the rest of the world focuses on the cost of this effort rather than what Israelis see as its necessity. To Israelis, the high civilian death toll in Gaza is entirely down to Hamas’s strategy of placing military positions in or close to civilian sites: schools, clinics, mosques and hospitals. Hamas, they say, exploited Israel’s wariness of hitting such targets, giving the organisation free rein. No longer, say Israel’s military and political planners. “Once they’re used for military purposes, we’re entitled to treat them as military targets,” says Assaf Orion, a retired brigadier general now with the Washington Institute for Near East Policy. “Sanctuaries lose their sanctity - and still we restrain ourselves.”\nYet if Israelis are currently united in their determination to defeat Hamas, and have become more hawkish, that should not be misunderstood as support for the far-right government of Benjamin Netanyahu. On the contrary, the prime minister is now widely reviled.\nThere is cold fury at his previous strategy of building up Hamas, to undermine Fatah and the Palestinian Authority; the epic security failure of 7 October; and his attempt to weaken the judiciary to expand his own power, a move that split Israelis rancorously down the middle for most of this year.\nWhen I saw the former prime minister Naftali Bennett at his home outside Tel Aviv, he was excoriating on the damage done by what critics called Netanyahu’s judicial coup. “I do think that the past year tore Israel apart, weakened our immune system and invited a war.”\nThere is rage too at the once-revered Israeli army, the way it failed to rescue and defend the residents of the south for so many long, perilous hours.\n“We felt abandoned, and that feeling has not passed,” says Tal Peer-Danino, who is eight months pregnant and hid with her two toddlers from 6.30am until 11pm on 7 October, waiting for the army to come. Of Netanyahu she is even more damning: “He doesn’t see us.”\nThe state’s failure has continued, being all but absent in the recovery effort. It is striking that the evacuees have been equipped, clothed and counselled by volunteers and donors.\nView image in fullscreen An Israeli volunteer working on a farm at the Nir Oz kibbutz, near the Gaza Strip, after foreign workers were killed, abducted or forced to flee during the Hamas attacks. Photograph: Kenzo Tribouillard/AFP/Getty Images\nIn the south, you can see pop-up barbecues by the roadside, feeding the soldiers. Israelis say civil society has stepped into the vacuum left by a government that has rotted thanks to Netanyahu’s habit of appointing useless cronies and hacks to run essential public services. For some, all this is a rare cause for hope.\n“It’s our darkest hour in terms of governmental failure and institutional failure,” says Bennett, Netanyahu’s predecessor. “But it truly is Israel’s finest hour in terms of the courage of ordinary Israeli men and women.”\nPlenty talk of this being a reset moment for Israel, imagining that after this war the country will do what Britain did in 1945 and address a whole range of problems that have festered for decades, from integration of Israel’s Arab and ultra-orthodox Jewish citizens to grappling at last with the question of living alongside the Palestinians.\nThere are some Israelis with lurid fantasies of banishing the Palestinians altogether, just as Hamas and Hezbollah ideologues dream of getting rid of the Jews. But most know that, eventually, something will have to be worked out. The trouble is, no one can even glimpse what that might be or how to get there.\nFor now, such thoughts could not be more distant. Many of the old dreamers of peace were murdered on 7 October: the southern kibbutzim contained more than their fair share of peaceniks, including those who would have demanded Israelis pay attention to the plight of the people of Gaza. Those who are left behind are still reeling from the shock.\nAs we drove away from Kibbutz Kissufim, Hasson – who had been communicating with me in a mixture of English and Hebrew – reached for Google Translate so he could say exactly what he wanted to say. On the screen it said: “All my life, I thought a human being was the most magnificent creation in the world. I didn’t think people could do such things. It doesn’t make sense.”\nHe looks at me, his eyes asking for understanding, asking to see what he has seen. And then his phone rings. It is his grandson. The ringtone is Louis Armstrong, singing his delight that we live in a wonderful world.", "source_domain": "www.theguardian.com", "text": null, "title": "‘It’s not yet post-traumatic stress disorder … we’re still in it’: Israel, a nation at war", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/24/from-a-judicial-coup-to-the-hamas-attack-the-year-that-tore-apart-then-reunited-israel"}