{"authors": [], "date_download": "2024-02-05 15:35:14", "date_modify": "None", "date_publish": "2023-11-24 16:27:00", "description": "The U.S. government has thanked Mexico for arresting a hyper violent, alleged Sinaloa cartel security chief this week", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-sinaloa-cartel-mexico-city-mexico-culiacan-b2453070.html.json", "image_url": "https://static.independent.co.uk/2023/11/24/16/Mexico_Drug_Arrest_22891.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe U.S. government thanked Mexico for arresting a hyper violent alleged Sinaloa cartel security chief, but according to details released Friday, the detention may have been highly personal for the Mexican army.\nDefense Secretary Luis Cresencio Sandoval said Nestor Isidro Pérez Salas, who was arrested Wednesday, had ordered a 2019 attack on an unguarded apartment complex where soldiers’ families lived.\n“He was the one who ordered the attack ... against our dependents, our families,” Sandoval said.\nThe Oct. 17, 2019 attack was a result of a humiliating failed effort to capture Sinaloa cartel leader Ovidio Guzman, one of the sons of imprisoned drug lord Joaquin “El Chapo” Guzman. Pérez Salas served as head of security for Guzman and his brothers, who are collectively known as the “Chapitos.”\nSoldiers caught Guzman but later were ordered to release him to avoid bloodshed.\nIn order to pressure the army to release Guzman, cartel gunmen had surrounded the army families' housing complex in Culiacan, the capital of Sinaloa, and sprayed it with gunfire. They took one soldier hostage, burst into four apartments looking for more potential hostages, and tossed in two hand grenades that failed to explode.\nThe army had apparently relied on an unwritten rule that soldiers' wives and children were not to be targeted. “It was an area that was not even guarded,” Sandoval said.\nIn January, when soldiers finally managed to detain Ovidio Guzman, Pérez Salas also allegedly participated in setting off violence that left 30 people dead, including 10 military personnel.\nThe army was forced to use Black Hawk helicopter gunships against the cartel’s truck-mounted .50-caliber machine guns. Cartel gunmen hit two military aircraft, forcing them to land, and sent gunmen to the city’s airport, where military and civilian aircraft were hit by gunfire.\nSandoval revealed Friday that there had been a special operation that day to get Pérez Salas, but it failed.\nThe army continued to follow his movements, and later tried to detain him a second time, but “he was able to escape,” Sandoval said.\nThe third time was a charm; video posted on social media showed that Pérez Salas was surrounded but managed to climb onto the roof of a house before he was caught Wednesday.\nThe U.S. Drug Enforcement Administration had posted a $3 million reward for the capture of Pérez Salas, though it was unclear if that will be distributed to the army and National Guard forces that caught him this week.\nPresident Joe Biden issued a statement Thursday praising the arrest. U.S. prosecutors have asked that Pérez Salas be extradited — as his boss Ovidio Guzman was in September — to face U.S. drug charges.\n“These arrests are testament to the commitment between the United States and Mexico to secure our communities against violence, counter the cartels, and end the scourge of illicit fentanyl that is hurting so many families,” Biden wrote.\nBut it appears Pérez Salas's arrest was personal for the Mexican army.\n“He was also responsible for a series of attacks against military personnel that caused a significant number of casualties,” Sandoval said.\nPérez Salas is wanted on U.S. charges of conspiracy to import and distribute fentanyl in the United States. But he also allegedly left a trail of killings and torture of police and civilians.\nAn indictment in the Southern District of New York says Pérez Salas allegedly participated in the torture of a Mexican federal agent in 2017. It said he and others tortured the man for two hours, inserting a corkscrew into his muscles, ripping it out and placing hot chiles in the wounds.\nAccording to the indictment, the Ninis — the gang of gunmen led by Pérez Salas and Jorge Figueroa Benitez — carried out other gruesome acts of violence as well.\nThe Ninis would take captured rivals to ranches owned by the Chapitos for execution, it said.\n“While many of these victims were shot, others were fed, dead or alive, to tigers” belonging to the Chapitos, “who raised and kept tigers as pets,” according to the indictment.\nAnd while the Sinaloa cartel does some lab testing on its products, the Ninis conducted more grisly human testing on kidnapped rivals or addicts who are injected until they overdosed.\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america", "source_domain": "www.independent.co.uk", "text": null, "title": "Mexico's arrest of cartel security boss who attacked army families' complex was likely personal", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-sinaloa-cartel-mexico-city-mexico-culiacan-b2453070.html"}