{"authors": ["Martha Williams", "Martha Williams For Dailymail.Com"], "date_download": "2024-02-05 15:35:16", "date_modify": "None", "date_publish": "2023-11-24 15:37:12", "description": "The remains of U.S. Army 2nd Lt. Gene F. Walker of Richmond, Indiana were identified by military scientists.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12787483%2FRemains-Indiana-soldier-identified-WWII-battle.html%3Fns_mchannel%3Drssito%3D1490ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/24/15/78201063-0-image-m-12_1700838561827.jpg", "language": "en", "localpath": null, "maintext": "The DPAA used anthropological analysis, circumstantial evidence and an analysis of mitochondrial DNA to determine the soldier's identity\nA soldier from Indiana killed during battle in Germany during World War II has been identified 79 years after his death.\nU.S. Army 2nd Lt. Gene F. Walker of Richmond, Indiana, has been named by military scientists who have analyzed remains found in Germany.\nWalker was 27 when he died - he commanded an M4 Sherman tank during World War II and battled German forces in Hücheln, an area near the Belgium border.\nHis tank was struck by an anti-tank round and the rest of his crew members managed to escape and survive - but Walker was stuck and his fellow soldiers couldn't rescue him because of ongoing fighting.\nWalker was identified through anthropological analysis, circumstantial evidence and an analysis of mitochondrial DNA after his remains were transported from the Henri-Chapelle U.S. Military Cemetery in Hombourg, Belgium, in August 2021.\nU.S. Army 2nd Lt. Gene F. Walker of Richmond, Indiana , has been named by military scientists who have analyzed remains found in Germany\nWalker was 27 when he died - he commanded an M4 Sherman tank during World War II and battled German forces in Hücheln, an area near the Belgium border\nA historian from the DPAA - Defense POW (prisoner of war) / MIA (missing in action) Accounting Agency - determined Walker's identity and they announced their findings on Wednesday.\n'The hit caused a fire and is believed to have killed Walker instantaneously,' the agency said.\n'The surviving crew bailed out of the tank, but when they regrouped later were unable to remove Walker from the tank due to heavy fighting.'\nHis remains are set to be buried in San Diego, California, at some point in early 2024.\nThe agency shared that Walker's name is recorded on the Walls of the Missing at Netherlands American Cemetery in Margarten, Netherlands, and a rosette will be placed next to his name to indicate he has been accounted for.\n'The poignant moment for me is when you're looking at items that a person had on them when they died,' forensic anthropologist Carrie Brown said.\n'When this life-changing event occurred. Life-changing for him, for his entire family, for generations to come.'\nGovernment figures show that more than 72,000 WWII soldiers are still missing.\nThe DPAA has been able to identify 1,543 missing soldiers since the agency began working in 1973, CBS reported.\nHis tank was struck by an anti-tank round and the rest of his crew members managed to escape and survive - but Walker was stuck and his fellow soldiers couldn't rescue him because of ongoing fighting\nGovernment figures show that more than 72,000 WWII soldiers are still missing - The DPAA has been able to identify 1,543 missing soldiers since the agency began working in 1973\nEarlier in November - a missing US airman's remains were finally found and identified 80 years after his bomber was shot down over Italy during World War Two, which killed all six people on board.\nA team of British scientists from Cranfield University said they had given 2nd Lt Gilbert Haldeen Myers' family 'closure' after discovering his body near Sciacca in Sicily.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Remains of Indiana soldier found in burned-out tank in Germany are finally identified nearly EIGHT DECADES after he was killed in WWII battle", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12787483/Remains-Indiana-soldier-identified-WWII-battle.html?ns_mchannel=rssito=1490ns_campaign=1490"}