{"authors": ["Espn Staff", "Heather Dinich", "Tom Vanhaaren", "Adam Rittenberg", "Chris Low", "Harry Lyles Jr.", "Kalan Hooks", "Dave Wilson", "Espn.Com Staff", "Mark Schlabach"], "date_download": "2024-02-05 15:35:17", "date_modify": "None", "date_publish": "2023-11-24 12:00:00", "description": "It's Rivalry Week and that means conference championship berths, unbeaten records and CFP possibilities are on the line.", "filename": "https%3A%2F%2Fwww.espn.co.uk%2Fcollege-football%2Fstory%2F_%2Fpage%2Fgamedaykickoff112423%2Fcollege-football-preview-week-13-gameday-kickoff-rivalry-week-michigan-ohio-state.json", "image_url": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F1122%2Fr1256794_1296x729_16%2D9.jpg", "language": "en", "localpath": null, "maintext": "Open Extended Reactions\nSick of hearing about Rivalry Week and just waiting for kickoff in Week 13? Too bad.\nHere's another take on a week that for many will decide whether they make their conference championship game, which in turn has a huge say in whether they eventually make the four-team College Football Playoff.\nNext year, when the playoff expands to 12 teams and conference championship games won't be recognizable to those who aren't aware the Big Ten stretches coast to coast and the SEC includes Texas and Oklahoma, many rivalry games just won't have the same meaning (but we'll still watch 'em).\nOur writers break down what's at stake and key positions to watch in this year's Rivalry Week games, as well as notable quotes from the week and conference championship game scenarios in Week 13.\nWeek 13: What's at stake in rivalry games\nNo. 2 Ohio State (11-0) at No. 3 Michigan (11-0)\n(noon ET, Fox)\nThe stakes: No game during Rivalry Week carries more significance, both regionally and nationally. The winner will claim the Big Ten East Division title and advance to next week's league championship game in Indianapolis, where it will be heavily favored against Iowa. A win there would secure a College Football Playoff spot. A loss likely would knock Michigan out of the CFP picture, due to strength of schedule, and also could keep Ohio State outside the top four.\nOhio State wins if: The defense applies the hard lessons from last season and TreVeyon Henderson takes pressure off of Kyle McCord. Veteran defensive coordinator Jim Knowles has done an outstanding job in Year 2, as Ohio State leads the FBS in opponent points per possession and yards per play allowed. \"You've got to take accountability,\" Knowles told me, referring to last year's loss. \"If change is warranted, then you change, because it's really all about the players, it's not about me.\" Henderson has been excellent since returning from injury, rushing for 499 yards and five touchdowns in his past four games.\nMichigan wins if: The defense limits Henderson and Marvin Harrison Jr., and quarterback J.J. McCarthy makes key downfield throws. Michigan hadn't seen a receiver group as talented as Maryland's and had some struggles last week. Ohio State's wideouts, led by Harrison, are even better. McCarthy hurt the Buckeyes with big pass plays last season. While he isn't asked to throw deep balls often, he must come through in key moments after recording only two completions longer than 19 yards over the past two games. \"They definitely keep a lot more in front of them,\" McCarthy said of Ohio State. \"They try to make you earn it, each and every drive.\" -- Adam Rittenberg\nNo. 1 Georgia (11-0) at Georgia Tech (6-5)\n(7:30 p.m. ET, ABC)\nThe stakes: Two-time defending national champion Georgia might make the CFP as long as it defeats Alabama in the SEC title game even with a loss against the Yellow Jackets on the road. But why take any chances? Georgia is attempting to become the first FBS team to win three straight national titles since Minnesota from 1934 to 1936. The Bulldogs are also trying to become the first FBS team to go unbeaten in consecutive seasons since Nebraska in 1994-95. With an upset of the Bulldogs, Georgia Tech will finish the regular season with a winning record, move up the ACC's postseason pecking order and continue to build momentum under first-year coach Brent Key.\nGeorgia wins if: The Bulldogs should continue their recent dominance of the Yellow Jackets -- they've won 18 of the past 21 games in the series -- if they can run the ball and force turnovers. The Yellow Jackets are last in the ACC in run defense, allowing 222.4 yards per game. In Georgia Tech's five losses this season, opponents have run for an average of 254 yards. Ole Miss ran for 299 yards in a 48-23 victory. Boston College piled up 308 yards on the ground in a 38-23 win. Clemson had 260 yards in a 42-28 triumph. Look for the Bulldogs to feed tailbacks Daijun Edwards and Kendall Milton early and often. Georgia ran for more than 200 yards in each of its past five victories against Tech, winning by an average of 33.6 points. Georgia's defense has been better at forcing turnovers lately, and Tech is prone to turning the ball over. The Yellow Jackets had 12 miscues in their five losses, while forcing only three. -- Mark Schlabach\nWashington State (5-6) at No. 4 Washington (11-0)\n(4:30 p.m. ET, Fox)\nThe stakes: For Washington, it's quite simple. A College Football Playoff berth is still on the line and a loss to a team with a losing record would likely end of that pursuit. The game also comes at a unique time in the rivalry's history with the Huskies set to depart for the Big Ten next season, while the Cougars remain without a clear future. It was announced this week that the Apple Cup will remain -- for at least the next five seasons -- and while that's all fine and good, this game won't have the same significance once the schools go their separate ways. There has always been a resources imbalance here that has shaped the competitive balance and it's only going to teeter more in UW's direction. So it stands to reason the Huskies, who already own a 75-33-8 advantage all time, should expect to win at an ever higher clip in the future.\nWashington wins if: The Huskies need to limit the equalizers: turnovers, penalties and mental mistakes. If that happens, Washington will win. The Cougars have been wildly inconsistent this year and their 4-0 start seems like a different season. Still, this was a team that outplayed Oregon State and is coming off a dominant, lopsided win (albeit against Colorado, the worst team in the conference). -- Kyle Bonagura\nNo. 5 Florida State (11-0) at Florida (5-6)\n(7 p.m. ET, ESPN)\nThe stakes: For Florida State to keep its College Football Playoff hopes alive, it has to find a way to win in Gainesville for the first time since 2017 without star quarterback Jordan Travis -- out for the season with a lower-leg injury. It is hard to have higher stakes than that headed into a rivalry game. As for Florida, there are bowl stakes on the line. A win gets the Gators to six and automatic bowl eligibility.\nFlorida State wins if: With a new starting quarterback in Tate Rodemaker, coach Mike Norvell has to call a game that will allow Rodemaker to feel comfortable from the start. Relying on Trey Benson and the run game will be a good start, but it is also important for Rodemaker not to force the issue. Florida State is 11-0 in part because it has protected the football. The Seminoles have lost only five turnovers, fewest in the nation. With the skill players he has around him, all Rodemaker needs is a little time to get the ball where Keon Coleman and Johnny Wilson can get it. Tight end Jaheim Bell could also be instrumental in the passing game. Defensively, Florida State must stop the run -- the strength of the Florida offense. This is an area where the Seminoles have lacked consistency, allowing 4 yards per carry. The Gators have a new starting quarterback, too, in Max Brown, so putting pressure on him will be a must. -- Andrea Adelson\nplay 1:21 Wake coach can't believe Notre Dame's 'love' for Sam Hartman Wake Forest coach Dave Clawson was perplexed by how Notre Dame celebrated Sam Hartman for his one season in South Bend.\nNo. 16 Oregon State (8-3) at No. 6 Oregon (10-1)\n(Friday, 8:30 ET, Fox)\nThe stakes: A trip to the Pac-12 championship is on the line for the Ducks, who secure a rematch with Washington if they win and an opportunity to make it to the College Football Playoff should they prevail in that contest. For the Beavers, it's a chance at beating their in-state rivals for the second year in a row, this time as a send-off to the Big Ten.\nOregon wins if: The Ducks don't fall into playing Oregon State's game. Unlike most of the teams in the Pac-12, the Beavers don't rely on a high-powered offense to win. Their passing game is ranked in the bottom half of the conference and their success comes from the ground game instead, led by Damien Martinez (1,147 rushing yards and nine touchdowns this season). Jonathan Smith's team will surely try to slow the pace and make it a low-scoring affair where running the ball and defense will determine the outcome. In other words, the less time Bo Nix has the ball, the better. The Ducks can play that game too, being that they have the second-best running attack in the conference behind Bucky Irving and rank in the top 3 of rushing and passing defense in the Pac-12. But the margin of error in that kind of game is slimmer, so if Nix can get into a fast rhythm early and put up points like they've done all season, Oregon will be in good shape. -- Paolo Uggetti\nTexas Tech (6-5) at No. 7 Texas (10-1)\n(Friday, 7:30 p.m. ET, ABC)\nThe stakes: The Longhorns clinch a spot in the Big 12 championship game and continue to pound away on the path to the College Football Playoff with a win over the Red Raiders. According to ESPN Analytics, there's just a 1.3% chance that Texas ends up in a three-way tie with Oklahoma and Oklahoma State and misses the Big 12 championship game. That would happen only with a UT loss to Tech, an Oklahoma win over TCU, an Oklahoma State win over BYU and a Kansas State loss to Iowa State. And after last year's loss at Texas Tech, followed by a video where Red Raiders coach Joey McGuire was recorded telling his team, \"I told you they were going to break and they did. ... The country's gonna find out, everything runs through Lubbock,\" the Red Raiders have Texas' attention. Big 12 commissioner Brett Yormark added fuel to the fire before the season when he addressed a fan group in Lubbock and said, \"I'm gonna be in Austin for Thanksgiving, OK? And you'd better take care of business like you did right here in Lubbock last year.\"\nTexas wins if: The Longhorns are a tough matchup for Tech. Red Raiders RB Tahj Brooks is second in rushing in the Big 12 at 122.5 yards per game, while Texas' run-stuffers up front lead the league's best rushing defense, allowing just 82.7 yards per game and six touchdowns all season. If Texas gets a lead and forces Tech to become one-dimensional, the matchup gets even tougher. The Red Raiders have won three straight games, but by one score each. They'll have to come out swinging to hold off Texas' potent offense. -- Dave Wilson\nNo. 8 Alabama (10-1) at Auburn (6-5)\n(3:30 p.m. ET. CBS)\nThe stakes: Alabama has won nine in a row since losing at home to Texas in Week 2. The Crimson Tide (7-0 in the SEC) have already clinched a spot in the SEC championship game against Georgia on Dec. 2 in Atlanta. So while this game doesn't impact Alabama's chances to win an SEC title, a loss would almost certainly knock the Tide out of College Football Playoff contention even if they were to knock off the Bulldogs in two weeks. Winning convincingly wouldn't hurt. Alabama is a two-touchdown favorite, and with several teams trying to make lasting impressions on the playoff committee, the Tide could rack up a few more \"eye test\" points as they prepare for their showdown with the Bulldogs. Even winning its next two games over Auburn and Georgia doesn't ensure Alabama a playoff spot, especially given the earlier loss to Texas, but ruining all chances with a loss to an Auburn team that was blown out at home last week by New Mexico State would fester for a long time in T-Town.\nAlabama wins if: The Tide have won seven of the past nine meetings in the series, but had to escape in four overtimes the last time they visited the Plains. The two trips prior to that, Alabama lost. So Jordan-Hare Stadium hasn't been a fun recently for the Tide, who need to get off to a quick start and take the crowd out of the game. Auburn had been pretty solid on defense until last week. The Tigers' passing game has been a wreck all season. They rank 121st nationally in passing offense. Alabama has 32 sacks in 11 games, and if Auburn finds itself in obvious passing situations, this one could be over early. -- Chris Low\nPositions to watch in rivalry games\nGreg Fiume/Getty Images\nOhio State-Michigan: Quarterbacks J.J. McCarthy (Michigan) and Kyle McCord (Ohio State) enter the spotlight, both carrying some questions. McCarthy hasn't looked as sharp during coach Jim Harbaugh's suspension, comes off of his shakiest performance (52.2% completions at Maryland) and hasn't thrown a touchdown pass since Oct. 21 (four at Michigan State). McCord is playing his best ball of the season, recording eight passing touchdowns and only one interception in his past three games, and four straight games of at least 65% completions. But Mike Sainristil (four interceptions) and the Michigan defense poses a different type of challenge. -- Rittenberg\nGeorgia at Georgia Tech: Both defensive lines will get a test in Atlanta on Saturday. For as good as Georgia's defense has been this season -- the Bulldogs rank fifth in the FBS in scoring defense (15.1 points per game) and ninth in total defense (288.1 yards) -- it hasn't gotten a ton of pressure on opposing quarterbacks. Some of that is because of scheme and design, but the Bulldogs haven't generated a lot of pressure off the edge. Georgia Tech has allowed only 13 sacks, fewest in the ACC. -- Schlabach\nWashington State at Washington: There was a time, early in the season, when quarterbacks Cam Ward and Michael Penix Jr. looked like Heisman candidates, and while Ward is no longer in the picture, his talent certainly remains. These are players with NFL opportunities in their future and, when that's the case, it's hard to look anywhere else on the field. Penix's recent form hasn't been anywhere near his incredible start, so this represents an opportunity to make his case to Heisman voters. -- Bonagura\nFlorida State-Florida: This is an easy one: Quarterback. Both backups will start in this game -- Tate Rodemaker for Florida State and Max Brown for Florida after injuries to starters Jordan Travis and Graham Mertz last weekend. As a fourth-year junior, Rodemaker possess more experience, and last year came into the game at Louisville to lead a comeback victory. Last week in relief of Travis, he went 13-of-23 for 217 yards with two touchdowns. But that was against FCS North Alabama. The challenge Saturday will be far greater. Coach Mike Norvell said the biggest key is for Rodemaker to just be himself. As for Brown, the true freshman nearly led a comeback win last week on the road against Missouri after Mertz got hurt -- going 4-of-5 for 56 yards with 42 yards rushing. He's only played in three games in his career. -- Adelson\nOregon State at Oregon: Running backs. Damien Martinez and Bucky Irving have had standout seasons, and while plenty of the focus will be on Heisman favorite Bo Nix and Clemson transfer DJ Uiagalelei, the ground game could determine the outcome of a crucial rivalry game. Not only are Martinez (1,147, nine TDs) and Irving (1,002, 10 TDs) primed for big performances, Oregon and Oregon State have top-5 rushing defenses in the Pac-12. -- Uggetti\nTexas Tech at Texas: Texas Tech running back Tahj Brooks is closing out a breakthrough season in which he has eight 100-yard games in his past nine, with him running for 98 yards on 17 carries in the other against Kansas State. He's racked up 1,352 yards and nine touchdowns and averages 5.4 yards a carry. Texas lost starter Jonathon Brooks, who had 1,139 yards, for the season with an injury two weeks ago, but got 20 carries for 117 yards from CJ Baxter last week against Iowa State. -- Wilson\nAlabama at Auburn: With so much talk, and rightfully so, about the way Alabama quarterback Jalen Milroe has blossomed, so has Alabama's offensive line. The Tide are playing their best football up front, giving Milroe time to do his thing and also running the ball better. They've averaged 190.5 rushing yards in their past four SEC games. And in their past five contests, the Tide have allowed 12 sacks after giving up 26 in their first six games. True freshman left tackle Kadyn Proctor is settling in at just the right time after some growing pains early. It's obvious he's playing with more confidence. Alabama's offensive line could use another strong showing in this matchup, especially with its toughest test of the season upcoming against Georgia. -- Low\nQuotes of the week", "source_domain": "www.espn.co.uk", "text": null, "title": "College football Week 13 preview: Rivalry Week's high stakes", "title_page": null, "title_rss": null, "url": "https://www.espn.co.uk/college-football/story/_/page/gamedaykickoff112423/college-football-preview-week-13-gameday-kickoff-rivalry-week-michigan-ohio-state"}