{"authors": [], "date_download": "2024-02-05 15:35:19", "date_modify": "None", "date_publish": "2023-11-23 00:06:23", "description": "Negotiations to free the hostages held by Hamas hardly ran smoothly", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fbenjamin-netanyahu-ap-joe-biden-hamas-united-states-b2452100.html.json", "image_url": "https://static.independent.co.uk/2023/11/23/00/Israel_Palestinians_Timeline_43117.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe negotiations hardly ran smoothly. But in the end, persistence paid off.\nSix weeks ago, not long after Hamas killed more than 1,200 Israelis and took scores of others hostage in a surprise assault, the government of Qatar quietly reached out to the United States to discuss how to release those who had been taken captive by the militant group.\nBut the mission demanded extreme sensitivity. It was so secret that U.S. officials established a communications cell to reach Hamas directly, and kept those negotiations tightly guarded throughout the U.S. government. Only a handful of people were aware of the talks, according to a senior White House official.\nFor weeks through the cell, which allowed the small circle of negotiators to speak regularly without additional bureaucracy, U.S. and Israeli officials would scramble to put together a deal that would release dozens of hostages held by Hamas. The White House saw that as the only realistic way to halt the bloody combat that has devastated the region for more than six weeks.\nThe U.S. continuously pushed Hamas, with Qatar and Egypt acting as critical intermediaries. All the while, President Joe Biden and other senior U.S. officials assured distraught family members of hostages through emotional Zooms and in-person meetings that they were doing everything they could to secure their loved ones' release.\nThe U.S. president was still working on the hostage deal as late as Wednesday in phone calls with Israeli Prime Minister Benjamin Netanyahu and other world leaders, stressing the importance of moving from agreement to actual releases. Biden vowed that he would not relent until all American hostages in Gaza were released.\nAnd there was a final hiccup in the agreement both sides apparently had reached. Talks continued, and no hostages were to be released before Friday.\nBiden said the White House had been working tirelessly to secure the release of hostages since the “earliest moments of Hamas’s brutal assault.”\nThis account of how the hostage deal came together was described by the senior White House official and two Egyptian officials who were granted anonymity to discuss the sensitive negotiations, as well as accounts in Israeli media.\nThe cell to communicate with Hamas had been established by Brett McGurk, the National Security Council’s coordinator for the Middle East, and Joshua Geltzer, legal adviser to the National Security Council. McGurk would speak every morning with Mohammed bin Abdulrahman bin Jassim Al Thani, the Qatari prime minister, while Jake Sullivan, the White House national security adviser, communicated daily with his Israeli counterparts, with Biden being briefed throughout. Also critical was CIA Director Bill Burns, who had been talking with David Barnea, the director of Mossad, the Israeli intelligence agency.\nThe final deal that emerged this week — during a four-day cease-fire, Hamas would release 50 hostages in exchange for 150 Palestinian prisoners held by Israel — was an agreement that evolved only through weeks of negotiations.\nOne of the earliest proposals was put forward on Oct. 12, five days after the initial Hamas attack, and it called for releasing all women and children held by Hamas and other Palestinian militants in Gaza, in return for freeing all Palestinian women in Israeli prisons, according to the Egyptian officials.\nThe Israelis rejected that initial proposal, but it “opened the door for more talks,” one of the Egyptian officials said.\nIn repeated conversations in late October between Biden and Netanyahu, the Israeli prime minister underscored his red line: The attacks on Gaza would cease only if there was a hostage release. Biden had his own demand throughout the talks: Humanitarian assistance had to reach Gaza, regardless of a deal.\nEventually, the first two U.S. hostages held by Hamas – Natalie and Judith Raanan – were released. As senior national security officials tracked their release out of Gaza and Biden personally phoned Natalie’s father to tell him of the news, the White House became more confident that the secret cell set up to talk with Hamas would work, and intensified efforts to rescue more hostages.\nShortly after the Raanans’ release – and just before a long-anticipated Israeli ground invasion into Gaza – the U.S. was informed that Hamas had signed off on the contours of a deal that would halt the offensive temporarily while the women and children were released.\nBut there were multiple issues, from Israel’s view: Hamas had offered no proof of life of any of the hostages, nor would it say who precisely was being held until the fighting ceased. That, for Israel, wouldn’t be enough to stop the ground invasion. The U.S., too, was skeptical.\nStill, the negotiations continued.\nIsrael’s ground invasion plans were revised so fighting could be paused if a hostage deal came together. The talks — with messages being routed through Doha or Cairo into Gaza — veered into highly technical details, and proposals flew back and forth. The U.S. repeatedly pushed Hamas, with Doha as the intermediary, to provide identifying information for the women and children being held. The militant group continued to refuse.\nBy Nov. 12, Biden had had enough.\nHe called Qatar’s ruling emir, Sheikh Tamim bin Hamad Al Thani, and demanded specifics from Hamas. For any agreement to go through, Biden insisted, the U.S. needed clear identifications for the estimated 50 hostages who would be freed – ages, gender, where they were from. Otherwise, the deal would not go through.\nShortly after that call, Hamas produced the information the U.S. had sought. Biden called Netanyahu on Nov. 14 and urged the prime minister to take the deal. Netanyahu agreed to move forward. In meetings with McGurk, Netanyahu urged the U.S. to press the Qataris to nail down the final terms.\nDuring this time, the mediators had been swapping more workable drafts of a hostage agreement. One version outlined a five-day cease-fire and the release of somewhere between 200 to 300 Palestinian women and children. Israel had insisted on a two-day cease-fire and the release of about 100 non-Hamas Palestinians.\nBut Hamas then went dark. The militant group stopped talking with the Qataris and Egyptians, threatening to walk from the talks after the Israeli Defense Forces entered Shifa Hospital, the largest and best-equipped medical center in Gaza that Israel insists is being used by Hamas for military purposes.\n“Everything was to fall apart at this stage,” one of the Egyptian officials said. “Hamas was angry. We all were angry.”\nFor three days, Egypt, Qatar and the U.S. pressured the warring sides to reach a compromise: Four-day cease-fire, and three Palestinian prisoners for each hostage. Egypt also insisted on easing Israeli restrictions on the flow of humanitarian aid. Talks resumed last Friday, and in another conversation with the Qatari emir, Biden told him it was the last shot at a hostage deal and he had to close it now.\nMcGurk spent the next several days after that call between Biden and Al Thani hammering out the finer points of the hostage agreement. Officials also crafted a way to try to entice Hamas to release more hostages than the 50 already agreed to. The universe of unresolved issues continued to narrow until Tuesday morning, Nov. 21, when Hamas told Qatari officials they were on board.\nOn Wednesday, Israel’s war cabinet signed off.\n“In recent days, I have spoken with our friend, US President Joe Biden and I requested his intervention in order to improve the outline that will be presented to you,” Netanyahu said as his war cabinet convened. “Indeed, it has been improved to include more hostages and at a lower cost. These talks have been productive. President Biden joined in the effort and I thank him for it.”\n——\nKim reported from Nantucket, Massachusetts, Magdy reported from Cairo and Frankel reported from Jerusalem.", "source_domain": "www.independent.co.uk", "text": null, "title": "How the hostage deal came about: Negotiations stumbled, but persistence finally won out", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/benjamin-netanyahu-ap-joe-biden-hamas-united-states-b2452100.html"}