{"authors": [], "date_download": "2024-02-05 15:35:20", "date_modify": "None", "date_publish": "2023-11-23 11:13:34", "description": "Ukrainian authorities say Russian shelling has killed three civilians in southeastern regions of the country", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fukraine-ap-kyiv-lloyd-austin-kherson-b2452313.html.json", "image_url": "https://static.independent.co.uk/2023/11/23/11/Russia_Ukraine_War_80498.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nRussian shelling killed three civilians in southeastern regions of Ukraine, Kyiv authorities said Thursday, while a Russian television journalist was reported to have died from injuries he sustained in a Ukrainian drone attack.\nSouthern Ukraine's Kherson region received eight nighttime artillery barrages, killing a 42-year-old man in his apartment building and wounding another man, the Ukrainian presidential office said.\nRussian shelling also killed two people in the Donetsk region of eastern Ukraine, the office said.\nIt was not possible to independently verify the reports. Long-range Russian shelling that hits civilian areas has been a hallmark of Moscow's 21-month war in Ukraine.\nMeanwhile, Russian state media reported that TV journalist Boris Maksudov died after being wounded in a drone attack while working in southern Ukraine's Russian-occupied Zaporizhzhia region\nMaksudov, who worked for Russian state television channel Russia 24, was hit Wednesday while working on a story about Ukraine allegedly shelling civilians, according to Russia’s Ministry of Defense. Zaporizhzhia is one of the four Ukrainian regions that Russia illegally annexed last year.\nA stepped-up Russian bombardment of civilian infrastructure has prompted Ukraine and its Western allies to beef up air defense systems. Officials fear the Kremlin’s forces will repeat their aerial attacks on the Ukrainian power grid this winter in an effort to break the country’s will.\nAt a meeting Wednesday of some 50 countries supporting Ukraine’s war effort, U.S. Defense Secretary Lloyd Austin said they were placing extra emphasis on ground-based air defense, with Germany and France leading the European effort to furnish equipment.\nUkrainian President Volodymyr Zelenskyy said in a Telegram post that “Ukraine’s sky shield is getting more powerful literally every month.”\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Ukraine says 3 civilians killed by Russian shelling and Russia says a drone killed a TV journalist", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ukraine-ap-kyiv-lloyd-austin-kherson-b2452313.html"}