{"authors": [], "date_download": "2024-02-05 15:35:21", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The US and its allies expect Ukraine to refill its army ranks with teenagers, the elderly, and women, the SVR has said\r\n\r\n\r\nWashington and Lond", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274040043%2Fwest-wants-younger-blood-in-kievs-army-russian-intelligence.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1700518423.jpg", "language": "en", "localpath": null, "maintext": "The US and its allies expect Ukraine to refill its army ranks with teenagers, the elderly, and women, the SVR has said\nWashington and London want Kiev to further expand its mobilization efforts amid the stalled summer counteroffensive to supposedly demonstrate Russia's \"inability to prevail\" in the Ukrainian conflict, the Russian Foreign Intelligence Service (SVR) said in a statement on Monday. One of the suggestions backed by Western nations supposedly involves altering the draft age in Ukraine to allow Kiev to call teenagers and the elderly to arms.\nThe drastic measures are allegedly needed to substitute the heavy losses the Ukrainian troops have sustained during the largely unsuccessful summer offensive. According to Russian Defense Minister Sergey Shoigu, Ukrainian forces lost more than 90,000 service members over the course of the operation between June and October alone.\n\"The American and British curators recommend that the Ukrainian ... leadership lower the [minimum] draft age to 17 years and increase [the maximum one] to 70 years, as well as call more women to arms,\" the SVR said in the Monday statement, citing \"reliable data\" it had obtained.\nThe statement came the same day that Pentagon chief Lloyd Austin arrived in Kiev on a surprise visit. Austin met the Ukrainian leadership, including President Vladimir Zelensky, and discussed Western military aid to Ukraine, while reiterating the \"steadfast support\" of the US and its allies. No remarks regarding the potential new draft policy were made public.\nThe SVR pointed to a Ukrainian bill proposing an increase in the draft age as an example of potential mobilization policy changes. The legislation mentioned by the Russian intelligence was introduced to the Ukrainian parliament in September and suggests allowing men older than 60 to join the army ranks on a voluntary basis. The elderly volunteers would have to be deemed fit for service by a military medical commission and have prior military experience, as well as be considered sufficiently qualified, the draft bill says.\nUnder the proposed amendments to the existing laws, men would be able to serve as privates up to the age of 65 and as military commanders up to the age of 70 if they met all criteria. The authors of the bill claimed that \"many people [of that age] are willing to join the army ranks.\"\nIn October, Ukrainian Deputy Defense Minister Natalya Kalmykova said that \"tens, hundreds of thousands of people\" were dodging the draft in Ukraine. The Ukrainian media also reported in early November that as many as 8,000 Ukrainians were facing criminal charges for draft evasion.\nKiev is also increasingly relying on women to fill the army ranks, the SVR said in its Monday report, citing \"Western estimates\" suggesting that more than 40,000 women were serving in the country's forces. Earlier, similar figures were mentioned by the Brussels Times, which said that the Ukrainian army had some 40,000 female service members, including 8,000 female officers. More than 5,000 Ukrainian women were taking part in combat operations on the frontlines, the media outlet said, citing Ukrainian general Sergey Naev.\nThe actions of Kiev show that it is \"ready to continue to fight 'till the last Ukrainian' in the name of Western interests,\" the SVR concluded, regarding the developments.\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "West wants younger blood in Kiev's army Russian intelligence", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274040043/west-wants-younger-blood-in-kievs-army-russian-intelligence"}