{"authors": ["Dolores Chang", "Dolores Chang For Dailymail.Com"], "date_download": "2024-02-05 15:35:22", "date_modify": "None", "date_publish": "2023-11-23 07:08:36", "description": "The drones from Hourhi-controlled areas in Yemen were shot down by USS Thomas Hudner, an Arleigh Burke-class guided-missile destroyer on Wednesday morning, officials said,", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12783033%2FNavy-warship-drones-Houthi-rebels-Yemen.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/23/07/78146119-0-image-a-15_1700723273234.jpg", "language": "en", "localpath": null, "maintext": "A US Navy warship shot down multiple one-way attack drones launched by Houthi rebels in Yemen while operating in the Red Sea, officials said.\nThe drones were shot down by USS Thomas Hudner, an Arleigh Burke-class guided-missile destroyer on Wednesday morning.\nThe U.S. Central Command said in a statement that there was no injury sustained by the crew nor damage to the ship.\nThe drone attack follows a wave of drone and missile attacks against US forces stationed in Iraq and Syria, launched by Iran-backed Houthi rebels amid the ongoing Israel-Hamas war.\nIn Yemen, Iran supplies the Houthis, a Shiite faction that has been at war against a Saudi-led Sunni coalition in the country since 2015.\nNavy warship USS Thomas Hudner (pictured in 2021) shot down multiple one-way attack drones launched by Houthi rebels in Yemen while operating in the Red Sea\nThe drone attack follows a wave of drone and missile attacks against US forces stationed in Iraq and Syria , launched by Iran-backed Houthi rebels amid the ongoing Israel-Hamas war\nThe U.S. Central Command said in a statement that there was no injury sustained by the crew nor damage to the ship\nThe Houthis have emerged as a major military force in the Arabian Peninsula, with tens of thousands of fighters and a huge arsenal of ballistic missiles and armed drones.\nOfficials confirmed Wednesday evening that the drone originated from the Houthi-controlled areas in Yemen and was shot down while the U.S. ship was on patrol in the Red Sea.\nIt's unclear whether the drone was armed or how close it came to the ship before being shot down.\nThe attack came days after the Houthis seized an Israel-linked cargo vessel with about 25 crew member on board on Sunday,\nHelicopter-borne troops seized the Galaxy Leader and its 25 international crew days after the Houthis threatened to target Israeli shipping because of the war.\nIran-backed Houthi rebels have warned they could capture more vessels after a video showed fighters jumping from a helicopter in a dramatic Red Sea hijacking.\nThe ship had been chartered by a Japanese group, and was flying the flag of the Bahamas.\nA photographer said the Galaxy Leader was anchored at the rebel-controlled Hodeida port in northwest Yemen and was closely guarded. It was now flying the Yemeni and Palestinian flags.\nThe Whitehouse said on Tuesday it was considering redesignating Yemen's Houthi movement as a terror organization after it hijacked the ship in the Red Sea.\nA pro-Palestinian demonstration is seen in Houthi-dominated Sanaa, Yemen earlier this month\nThe Gerald R. Ford and Dwight D. Eisenhower Carrier Strike Groups are seen conducting joint operations in the Eastern Mediterranean earlier this month in a show of US naval force\nLast week, a Pentagon official told DailyMail.com that the Hudner's crew 'engaged and shot down a drone to ensure the safety of US personnel.'\nThe drone shot down was heading toward the ship, which was operating in international waters.\nThe US has sent a significant amount of naval power to the Middle East in the past month, including two aircraft carrier strike groups and thousands of US troops.\nThe USS Thomas Hudner is part of the Gerald R. Ford Carrier Strike Group and is currently operating in the Middle East after reportedly transiting the Suez Canal over the weekend.\nUS and coalition troops have been attacked by missiles and drones at least 55 times in Iraq and Syria since October 17, injuring 59 personnel, though all have returned to duty, a defense official told DailyMail.com last week.\nThe Iran-backed militant groups claiming responsibility for the attacks have said they are in response to US support for Israel in its war against Hamas in Gaza.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Navy warship USS Thomas Hudner shoots down multiple attack drones over the Red Sea after they were launched by Houthi rebels in Yemen", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12783033/Navy-warship-drones-Houthi-rebels-Yemen.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}