{"authors": ["Ami H. Orkaby"], "date_download": "2024-02-05 15:35:23", "date_modify": "None", "date_publish": "2023-11-23 21:38:27", "description": "AMI H ORKABY: Israel is losing the battle for hearts in large part, to a multimedia campaign based on a combination of fake news, bogus images and a sinister manipulation of social media.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12785455%2Fyoung-people-Hamas-dirty-tricks-propaganda-war-AMI-H-ORKABY.html%3Fns_mchannel%3Drssito%3D1490ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/23/21/78175401-0-image-m-54_1700775312536.jpg", "language": "en", "localpath": null, "maintext": "A week and a half ago, a Hamas rocket fired from Gaza — one of 10,500 launched at Israel since the current conflict began — scored a direct hit on a house less than 300 yards from my own in the outskirts of Tel Aviv.\nFortunately, the inhabitants had headed for their air-raid shelter as soon as the sirens sounded and escaped unscathed. But it was a salutary reminder of our vulnerability.\nLiving, as we do, six miles from Ben Gurion Airport — one of the key targets of the Palestinian terrorists — we have grown accustomed to the daily wail of the air-raid sirens as incoming missiles are detected and the deafening sound of explosions as Israel's Iron Dome air defence system is activated.\nI have three daughters, the youngest of whom is ten, and my wife and I lead them to our shelter — every new house in Israel has to have one by law — once, if not twice, a day.\nApart from the sense of trauma that this creates, they are getting no schooling to speak of as their teachers are called up for reserve duty.\nAn AI-generated image is being shared in relation to the Israel-Hamas conflict, depicting a boy covered in dust and blood standing next to his dead mother\nSeeing my girls put through such an ordeal only fuels my anger about the way so many people in the West, particularly among the younger generation, have taken up the Palestinian cause and view Israel with such unfounded animosity.\nThe situation is all the more tragic because so much of this venom is born of ignorance.\nThis was vividly illustrated recently by an exercise carried out by the Jewish-American comedian Mikey Greenblatt on the streets of New York.\nHe accosted people at random with a request to sign a petition in support of Hamas and freeing Palestine.\nOnce they agreed, he insisted on quoting them the small print, which included the slaughter of every Jew, Christian and non-Muslim in the world, making homosexuality a capital offence, and the implementation of a system of sharia law that would ban women from showing their knees or hair, playing sports in public, or travelling without a man's permission.\nNaturally, all his would-be backers responded by performing abrupt U-turns.\nBut this grotesque level of ignorance about the true nature of Hamas means that many in the West are susceptible to the terrorists' propaganda.\nThe truth is that, for all its economic might and social sophistication, as well as the support of the leaders of the free world, Israel is losing the battle for hearts and minds on the street.\nAnother AI generated image depicts a baby trapped in rubble amid a multimedia campaign based on a combination of fake news and bogus images\nAnd this is down, in large part, to a multimedia campaign based on a combination of fake news, bogus images and a sinister manipulation of social media.\nWhen it comes to propagandising online, Hamas has a massive inbuilt advantage. While the world's Jewish population is 15.3 million — 0.2 per cent of the global total — there are no fewer than 1.9 billion Muslims — 24 per cent.\nClearly, not every Muslim is a supporter of the psychopathic Hamas but many are broadly sympathetic to the Palestinian cause, often because they are not familiar with the history of the conflict.\nThis means that Israeli influencers face an uphill struggle to make headway on sites such as TikTok.\nIn the final week of October, the hashtag #standwithpalestine had 251 million views on the video-hosting site, while #standwithisrael had just 65 million.\nThis is an AI generated image showing a toddler standing in rubble witnessing a fiery explosion from aerial bombing\nNot content with this numerical advantage, Hamas and its proxies, probably funded by Iran, resort to increasingly sophisticated dirty tricks to press home their advantage. Cyber companies are hired to use bots — automated software programs — to bombard pro-Israeli posts with hundreds of pro-Palestinian messages.\nBots are also used to submit fake reports to Facebook, X (formerly Twitter), Instagram and TikTok moderators in a bid to get accounts suspended or deactivated by alleging they are in breach of guidelines relating to anything from hateful or abusive content to suicide or self-harming.\nIf a moderator receives 500 reports in a matter of minutes or hours, they may well take the line of least resistance and suspend the targeted account indefinitely.\nAnother danger of social media is that it is actually designed to be an echo chamber. Users who view or search a particular topic are then offered more of the same sort of content, a process that only serves to confirm their prejudices.\nAnd there is plenty of content out there. Since the advent of the smartphone, everyone is now a photographer and, thanks to Photoshop, a special effects expert too. One digitally doctored picture of a giant Palestinian flag unfurled at a football match has been viewed millions of times.\nIsraeli influencers face an uphill struggle to make headway on sites such as TikTok\nThat said, in the age of AI (artificial intelligence), there is no need to even go to the trouble of taking a photograph. AI tools such as DALL-E, Midjourney, and Stable Diffusion are capable of creating uncannily realistic images based on textual descriptions.\nAs Israel's largest news website reported earlier this month: 'Anyone can write a line such as 'Two Palestinian children covered in blood standing amid the rubble of a building in the Gaza Strip next to their mother's body' and the generator will do whatever they wish.'\nBut the misinformation is not confined to the online world. Mainstream media is also culpable and, yes, BBC I am talking about you.\nHamas's talent for malicious fabrication has rarely been utilised to more malign effect than in the now notorious case of the al-Ahli Arab Hospital bombing.\nIt is now widely acknowledged that the bombing of the al-Ahli Arab Hospital was caused by a rocket launched by Islamic Jihad that fell short\nThe terrorists' claim that the medical facility in Gaza City had been bombed by the Israelis, killing 500 Palestinians, was swallowed whole by the BBC.\nBut it is now widely acknowledged that it was caused by a rocket launched by Islamic Jihad that fell short.\nAnother example of BBC bias came only last week when its international editor, Jeremy Bowen, refused to accept that a cache of Kalashnikovs seized by the Israel Defense Forces (IDF) at Gaza's al-Shifa Hospital amounted to convincing evidence that Hamas had a base there. He even suggested the weapons could belong to the 'security department', an absurd contention that directly echoed the words of a senior Hamas terrorist on Al Jazeera two days earlier.\nThe relentless barrage of anti-Israeli propaganda has had a horrifying effect on environments such as university campuses. When I studied in Britain in the mid-1990s, I was met with nothing but friendliness and had no fear in letting it be known that I was an Israeli.\nBut times have clearly changed. At the end of last month, the Jewish peer Lord Wolfson told the House of Lords that he was more concerned about the safety of his daughter wearing a Star of David in London than that of his son, who is in the IDF.\nBBC's International editor, Jeremy Bowen, refused to accept that a cache of Kalashnikovs seized by the IDF at al-Shifa Hospital amounted to evidence that Hamas had a base there\nA generation of young people has been brainwashed by a specific narrative, which is reinforced by an endless round of demonstrations.\nIn this looking-glass world, where truth and falsehood are increasingly indistinguishable, it's never been more important for media outlets to exercise the utmost rigour in defence of the values and principles treasured by freedom-loving peoples the world over.\nAmi H. Orkaby is a leading lawyer and former senior adviser to the Israeli prime minister's office.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "How worrying numbers of young people are falling for Hamas's dirty tricks in the propaganda war, writes AMI H ORKABY", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12785455/young-people-Hamas-dirty-tricks-propaganda-war-AMI-H-ORKABY.html?ns_mchannel=rssito=1490ns_campaign=1490"}