{"authors": [], "date_download": "2024-02-05 15:16:01", "date_modify": "None", "date_publish": "2024-01-24 10:52:29", "description": "Russia says a military transport plane that was carrying 65 Ukrainian prisoners of war has crashed in a Russian region near Ukraine", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fvladimir-putin-ap-russia-associated-press-kharkiv-b2483923.html.json", "image_url": "https://static.independent.co.uk/2024/01/24/10/Russia_Warplane_Crash_13758.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA military transport plane that Russia said was carrying 65 Ukrainian prisoners of war crashed Wednesday morning in a Russian region near Ukraine.\nIt wasn’t immediately clear what caused the crash in the Belgorod region or if anyone survived. The Associated Press could not confirm who was aboard the plane, and the Ukrainians did not immediately comment.\nA special military commission was on the way to the crash site, the Russian Defense Ministry said.\nRussian state news agency RIA Novosti, citing the ministry, reported that the POWs were being transported to the border region for a prisoner exchange.\nSpeaking on his morning call with reporters, President Vladimir Putin’s spokesperson Dmitry Peskov said he could not comment on the crash as he did not have enough information about it.\nThe Russian air force has suffered a string of crashes that some observers have attributed to a higher number of flights amid the fighting in Ukraine.\nSeven hundred days after the Kremlin's forces rolled into Ukraine, the 1,500-kilometer (930-mile) front line largely static amid icy weather. As both sides seek to replenish their weapons stockpiles, the war recently has focused on long-range strikes.\nEarlier, Ukrainian President Volodymyr Zelenskyy said a major Russian missile attack on Tuesday had killed 18 people and injured 130.\nThe barrage, employing more than 40 ballistic, cruise, anti-aircraft and guided missiles hit 130 residential buildings in three Ukrainian cities, “all ordinary houses,” Zelenskyy said on X, formerly Twitter.\nRussia’s onslaught, which included targets in the capital Kyiv and second-largest city Kharkiv, was the heaviest in weeks and lent weight to Zelenskyy’s appeals for Western allies to provide more military aid.\n“This year, the main priority is to strengthen air defense to protect our cities and towns, as well as defend frontline positions,” Zelenskyy said on X late Tuesday.\nAnalysts say Russia stockpiled missiles to pursue a winter campaign of aerial bombardment, while Ukraine has sought to strike inside Russia with new types of drones.\nRussia may have employed decoy missiles in Tuesday’s attack in an effort to open up holes in Ukraine’s air defenses, a U.S. think tank said.\nThe Washington-based Institute for the Study of War said Moscow is likely trying to acquire more ballistic missiles from foreign countries, including Iran and North Korea, because they may be more effective in some circumstances.\nA further barrage of Russian S-300 missiles struck residential districts of Kharkiv late Tuesday, injuring nine people and damaging residential buildings, regional Gov. Oleh Syniehubov said.\nRussia denies its forces strike civilian areas, although there is substantial evidence to the contrary.\nMeanwhile, the Russian Defense Ministry said that air defenses shot down four Ukrainian drones over the Oryol region of western Russia early Wednesday.\nOryol Mayor Yuri Parakhin said that several drones were downed over the city. He said there were no casualties, but windows were shattered in several apartment buildings in the city.\nAnother Ukrainian drone was downed early Wednesday over the Belgorod border region, according to regional Gov. Vyacheslav Gladkov. He said there were no casualties or damage.\nUkraine’s allies have promised to keep sending military aid packages, even though their resources are stretched. Help from the United States, by far Ukraine’s single biggest provider, has also hit political snags.\nThe German defense ministry announced Wednesday that it plans to send six SEA KING Mk41 multi-role helicopters from Bundeswehr stocks to Ukraine.\nSince the beginning of the war military deliveries from Germany have amounted to around 6 billion euros ($6.52 billion), including substantial anti-aircraft and air defense systems, the government said.\n___\nThis story has been updated to correct that Zelenskyy spoke about the missile strike death toll late Tuesday, not Wednesday.\n___\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine", "source_domain": "www.independent.co.uk", "text": null, "title": "Russia says a transport plane has crashed and that 65 Ukrainian POWs were on board", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/vladimir-putin-ap-russia-associated-press-kharkiv-b2483923.html"}