{"authors": [], "date_download": "2024-02-05 15:35:38", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The BBC cast doubt on Israeli allegations of Hamas military activity in Gaza?s largest hospital\r\n\r\n\r\nIsrael Defense Forces spokesperson Peter L", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274039451%2Fwill-bbc-apologize-israeli-army-spokesman.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1700482421.jpg", "language": "en", "localpath": null, "maintext": "The BBC cast doubt on Israeli allegations of Hamas military activity in Gaza's largest hospital\nIsrael Defense Forces spokesperson Peter Lerner has asked the BBC and its editor Jeremy Bowen to apologize, after they called into question IDF evidence of a Hamas presence at Al-Shifa hospital in Gaza.\nIsraeli soldiers have been in Al-Shifa since early Wednesday, releasing footage from inside the medical complex. Lerner posted CCTV footage from the site on X (formerly Twitter), along with his verbal description of \"weapons, communication equipment, RPGS, [and a] Toyota pickup laden with weapons\" apparently found there. The video also showed men being carried on a gurney, their faces blurred. \"Will BBCWorld apologize? Will BowenBBC say I was wrong?\" he wrote.\nHis post was aimed at Jeremy Bowen, a BBC editor who criticized IDF restrictions on reporting from Al-Shifa in an article on Saturday, saying that \"there is no independent scrutiny inside the hospital; journalists cannot move freely into Gaza, and any who are reporting from the site are working under the aegis of the Israeli military.\"\nAl-Shifa is the largest hospital in Gaza, and has been in the media spotlight for the past six weeks. It was the location of much of the Palestinian Health Ministry's footage of civilians injured by IDF operations. Israel has claimed the hospital is connected to Hamas' extensive network of underground tunnels, and was being used as a part of the militants' infrastructure.\nOn October 7, Hamas launched a coordinated attack on Israel, killing at least 1,200 Israelis and injuring thousands more, as well as capturing more than 200 hostages, according to local authorities.\nWest Jerusalem responded with the \"Swords of Iron\" military operation, including a blockade of Gaza, intensive air strikes on the Palestinian enclave and an eventual ground assault, resulting in at least 12,000 deaths, including 5,000 children, according to the Palestinian Ministry of Health.\nBowen went on to write of the evidence that the IDF has produced thus far, that he did not \"believe [it] to be convincing in terms of the kind of rhetoric Israelis were using.\" He concluded that \"for Israel it's crucial to prove that it had no choice other than to use methods that killed thousands of civilians\" to keep its international allies' support.\nThe growing civilian death toll in the course of the campaign is seemingly producing a change in rhetoric from Israel's staunchest allies. US Secretary of State Antony Blinken, speaking earlier this month, said that \"far too many Palestinians have been killed. Far too many have suffered these past weeks.\"\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Will BBC apologize Israeli army spokesman", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274039451/will-bbc-apologize-israeli-army-spokesman"}