{"authors": ["James Reynolds", "Will Stewart"], "date_download": "2024-02-05 15:35:39", "date_modify": "None", "date_publish": "2023-11-23 15:18:32", "description": "It came as Putin reportedly ordered regional officials and secret services to stamp out anti-war dissent 'at any cost' amid a spike in protests organised by the relatives of soldiers mobilised for Ukraine.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12784317%2Fputin-worried-reelection-protests-relatives-mobilisation.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/23/15/78162025-0-image-a-41_1700752254754.jpg", "language": "en", "localpath": null, "maintext": "Russian president Vladimir Putin is 'inexplicably concerned' about the outcome of the upcoming election next March, according to the Institute for the Study of War.\nThe American research group pointed to comments by the Russian Central Election Commission chair this week that Russians have 'already begun efforts to discredit' the contest, despite Russia maintaining widespread support for Putin.\nThe ISW analysed that the comments suggest Russia will 'continue to intensify censorship efforts under the guise of fighting attempted internal election meddling', implying Putin might not feel totally secure in his position as he seeks re-election.\nIt came as Putin reportedly ordered regional officials and secret services to stamp out anti-war dissent 'at any cost' amid a spike in protests organised by the wives and mothers of forcible mobilised men thrown into his brutal invasion of Ukraine.\nIn defiance of heavily-enforced restrictions on protest within Russia, thousands have signed petitions and rallied on the streets to call for mobilised men to come home.\nOfficials are now being advised to 'extinguish with money' the protests of relatives jaded by the war and not receiving the salaries of their loved ones on the frontlines, independent outlet Verstka reported on Wednesday - potentially 'one of the greatest threats to the beginning of Putin's still unannounced presidential campaign'.\nRussian President Vladimir Putin attends the Collective Security Treaty Organization (CSTO) summit in Minsk, Belarus, November 23, 2023\nWives of mobilised men take to the streets in Moscow to demand Vladimir Putin bring their men home in a rare protest in the Russian capital\nRussian officials are now being told to 'make every effort' to ensure governments issue payments to the relatives of mobilised personnel and address complaints about their treatment on the frontlines, amid mounting protests.\nThey have reportedly been told to 'pay everyone the maximum amount of money' where possible in a desperate bid to curb dissent, Verstka reported on Wednesday.\nRecently there have been limited protests in Moscow, Novosibirsk and Khabarovsk, among other cities, but many have been banned.\nThe authorities in St. Petersburg used anti-Covid restrictions to ban a rally. Mass events have been barred for the rest of the year in Putin's home city.\nOlga Tsukanova, 47, founder of the Council of Wives and Mothers, has been included in the register of 'foreign agents', and faces repression as a criminal prosecution is launched against her.\nOne anti-war protester, beautician Olga Kats, has vowed to challenge Putin after he flatly rejected her petition signed by 100,000 women to allow mobilised men to come home.\nShe began her campaign because she wants her brother Aleksander, 26, back after more than a year on the frontline.\n'We are seeking to establish a maximum service period for mobilisation,' she said.\n'It's high time to bring home the civilian men who fell under partial mobilisation.'\n'The Presidential Administration simply decided not to care about the efforts of 100,000 people,' she said.\nShe was told the men would only come home 'at the end of hostilities'.\nVerstka's report noted that leaders of the Kremlin's internal political bloc gathered local officials for a seminar in the Moscow region and tasked them with holding elections 'as modestly and quietly as possible' so there would be 'no doubts' about the legitimacy of Putin's victory.\nThe Institute of the Study of War also pointed to Putin's comments on November 15, when he said the Russian government would suppress any foreign or domestic election interference.\nProtests in Moscow mount as the wives and relatives of soldiers demand their men are brought home\nA woman in Moscow (right) holds a sign reading 'mobilised it's time to go home'\nUkrainian servicemen fire an artillery during a drill in Chernigiv region on November 11, 2023\nOn paper, Putin still remains the popular candidate for re-election. The ISW noted: 'The Kremlin's apparent concern about Putin's support is odd, given that the Levada Center - an independent Russian polling organisation - found that 82% of Russians approved of Mr Putin's performance as of October this year.'\nPutin was so confident, in fact, that in 2021 he signed a law to allow him to run for presidency twice more in his lifetime, potentially extending his tenure until 2036.\nBut researchers note the difficulty getting reliable and accurate polling data, as many Russians fear repercussions for opposing Putin - and face punishments for criticising the war.\nRussia has steadily increased its monitoring of digital platforms since mass protests were coordinated online in 2011/12. Regulations allowed Russia to block websites, store call records and share information with security services if needed.\nRussia also tried to pressure Google, Apple and Facebook to store user data on Russian servers, to no avail.\nBut since the invasion of Ukraine in February 2022, much more has been done to clamp down on dissent. Online censorship and prosecutions for social media posts and comments spiked so much that it broke all existing records.\nAccording to Net Freedoms, a prominent internet rights group, more than 610,000 web pages were blocked or removed by authorities in 2022 alone, the highest annual total in 15 years.\n779 people faced criminal charges over online comments and posts, also a record.\nPutin's grasp has extended over various industries and includes the tightening of how media reports on the war.\nIn September, an opposition outlet claimed pro-Kremlin media had received a memo issuing guidelines on how to report on speculation Russia might be looking to recruit more reservists to funnel into its invasion.\nRussian Federal Laws No.31-FZ and No.32-FZ, adopted by the State Duma in March 2022, also give provisions for punishing Russians who make statements against the armed forces or call for sanctions.\nDiscrediting the army - or saying their use is not in Russia's best interests - carries punishments of large fines and up to five years' imprisonment.\nThe drone unit of the 108th Territorial Defense Brigade of the Ukrainian Army continues its combat training on November 4, 2023\nThe Ukrainian army is intensively using surveillance and attack drones on the front lines where the war rages on\nState Duma Deputy Anton Gorelkin also said in September that Russia should consider blocking WhatsApp in Russia if the app launches Russian language channels.\nState censor Roskomnadzor added that Russia could block WhatsApp if it disseminates prohibited information as the application prepared to launch a channel feature to feature over 150 countries, likely including Russia.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Is Putin worried he could LOSE next year's Russian election? Kremlin is 'inexplicably concerned' about the outcome and paying close attention anti-war protests", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12784317/putin-worried-reelection-protests-relatives-mobilisation.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}