{"authors": [], "date_download": "2024-02-05 15:35:41", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukraine?s president has fired his head of military medical corps\r\n\r\n\r\nUkrainian President Vladimir Zelensky has insisted on “fundamental&", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274040118%2Fzelensky-demands-rapid-changes.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1700525631.jpg", "language": "en", "localpath": null, "maintext": "Ukraine's president has fired his head of military medical corps\nUkrainian President Vladimir Zelensky has insisted on \"fundamental\" changes to the way the Ukrainian military manages battlefield casualties, after sacking Medical Forces commander Major-General Tatyana Ostashchenko on Sunday evening.\nZelensky's move came after meeting with the recently-appointed defense minister, Rustem Umerov, amid recriminations in Kiev about the failure of its summer counteroffensive against Russia.\n\"There is little time left to wait for results. Quick action is needed for forthcoming changes,\" Zelensky said, adding that the Ukrainian military needs \"a fundamentally new level of medical support.\"\nUmerov, who replaced Aleksey Reznikov in September, has argued in social media posts that tactical medicine needs to be \"digitized\" and that there was \"simply no place for such problems as subpar tourniquets.\"\nAnonymous Ukrainian sources who spoke with the British outlet The Daily Telegraph have complained about \"substandard\" equipment such as field kits Kiev had bought from China. They also claimed that poor training caused combat medics to use tourniquets when there was no need, thereby increasing the number of amputations.\nAccording to Russian estimates, at least 90,000 Ukrainian troops became casualties during the four months of heavy fighting in the south, with little to nothing to show for it. The latest narrative coming out of Kiev was that the \"summer counteroffensive\" was really just a psychological operation and that the real attack is still to take place.\nOstashchenko is a native of Lviv in western Ukraine and was appointed head of the medical branch in 2021 - the first female branch chief and the first woman major-general in the country's history, as Kiev had proudly pointed out. She was replaced by Major-General Anatoly Kazmirchuk, the commander of Kiev's main military hospital.\nOn Monday, Zelensky also purged the leadership of the State Service of Special Communications and Information Protection of Ukraine (SSSCIP), after its head Yury Shchigol and his deputy Viktor Zhora were implicated in a corruption scheme.\n(RT.com)", "source_domain": "www.britainnews.net", "text": null, "title": "Zelensky demands rapid changes", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274040118/zelensky-demands-rapid-changes"}