{"authors": ["Helen Livingstone", "Léonie Chao-Fong", "Martin Belam", "Helen Sullivan"], "date_download": "2024-02-05 15:35:42", "date_modify": "None", "date_publish": "2023-11-23 04:31:59", "description": "This blog has now closed. You can read our full report on the latest news here", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F22%2Fisrael-hamas-war-live-updates-hostage-deal-release-ceasefire-pause-latest-news.json", "image_url": "https://i.guim.co.uk/img/media/a2f1b13d32524ef4d6aada0ec72b885f6c191fe0/0_212_3200_1921/master/3200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=8e7eaf92ba9ce6557630efaba71047d8", "language": "en", "localpath": null, "maintext": "From 22 Nov 2023 23.02 CET No hostages to be released before Friday, says senior Israeli official A senior Israeli official has said that the planned exchange of some Palestinians held in Israeli prisons for Israeli hostages in Hamas has been delayed until at least Friday. In a statement, Benjamin Netanyahu’s national security adviser Tzachi Hanegbi said: The release will begin according to the original agreement between the parties, and not before Friday.\nUpdated at 23.26 CET\n23 Nov 2023 04.55 CET US Central Command says one of its destroyers shot down multiple drones launched from Houthi controlled areas of Yemen early on Thursday. In a post on X, formerly Twitter, central command said the drones were shot down “while the US warship was on patrol in the Red Sea”. No damage or injuries were reported to the ship or its crew. Houthi rebels seized a cargo ship in the Red Sea earlier this week and have previously launched drones that were also shot down by US forces. On the morning (Yemen time) of November 23, the USS Thomas Hudner (DDG 116) shot down multiple one-way attack drones launched from Houthi controlled areas in Yemen. The drones were shot down while the U.S. warship was on patrol in the Red Sea. The ship and crew sustained no… pic.twitter.com/TqXuaKsgwe — U.S. Central Command (@CENTCOM) November 23, 2023\n23 Nov 2023 04.32 CET There’s been a lot of controversy over pro-Palestine marches in the UK. Here’s a piece by Daniel Boffey our chief reporter: No 10 should not implement plans to amend the law on glorifying terrorism after the pro-Palestine marches as it would do “no favours” to police, MI5 or the probation service, a government adviser has said. In a 15-page report submitted to the Home Office, Jonathan Hall KC, the government’s independent reviewer of terrorism legislation, said there was no need to respond to the marches with new terrorism legislation, adding that there was “good reason for caution” given both the risk of unintended consequences and the drain on limited state resources. Ministers have said they want to tighten the law on glorifying terrorism after the conduct of a minority of people on the pro-Palestine demonstrations in recent weeks, including the chanting of the controversial slogan “From the river to the sea, Palestine will be free”, prompted calls for change. Some view the words as antisemitic and as encouraging the destruction of Israel. Adviser warns UK government against tightening laws on glorifying terrorism Read more\n23 Nov 2023 03.48 CET Reged Ahmad Various news agencies have been taken on tours of al-Shifa hospital with the Israel Defence Forces. Since Israel declared war against Hamas following its attack on 7 October, it has repeatedly accused the Islamic militant group of using Gaza’s hospitals as cover. It has paid special attention to al-Shifa, Gaza’s largest hospital, saying Hamas has hidden command centres and bunkers underneath the hospital’s sprawling grounds. Associated Press has described how it was allowed access to Gaza on the condition that its journalist stay with the Israeli military convoy throughout the four-hour tour and submit all material to a military censor ahead of publication. It says there is no other way for foreign journalists to currently access the enclave. The agency wrote that on the reporting trip the Israeli military unveiled what it claimed was a Hamas military facility under al-Shifa, showing to a group of foreign journalists what appears to be a subterranean dormitory. The news agency writes: Dozens of soldiers escorted journalists through a narrow stone tunnel – which the military said stretched 150 meters (164 yards) to a series of underground bunkers beneath Shifa hospital in Gaza City. The living quarters, located at the end of the tunnel, had an air conditioner, kitchen, bathroom and pair of metal cots in a room fashioned from rusty white tile. They appeared to be out of use. Here is a picture from Reuters. The news agency explains that its images were reviewed by the IDF too as part of the conditions of the embed – but no photos were removed. View image in fullscreen An Israeli soldier stands in a room containing a sink inside a tunnel underneath al-Shifa hospital in Gaza City. Photograph: Ronen Zvulun/Reuters This picture from AFP was also taken during a controlled tour in Gaza and edited under the supervision of the Israeli military, according to the news agency. View image in fullscreen A soldier stands in what the Israeli army says is a tunnel dug by Hamas militants inside the al-Shifa hospital complex in Gaza City. Photograph: Ahikam Seri/AFP/Getty Images\nUpdated at 03.49 CET\n23 Nov 2023 02.44 CET Robert Tait A prestigious journal published by Harvard Law School has been accused of censorship after it refused to publish an academic article accusing Israel of committing genocide in Gaza, allegedly because editors feared a backlash. The Harvard Law Review, which is run by the school’s student body, declined the 2,000-word essay – titled The Ongoing Nakba: Towards a Legal Framework for Palestine – by a Palestinian doctoral candidate, Rabea Eghbariah, after it had been edited, fact-checked and initially approved. The article, commissioned after Hamas’s 7 October attack on Israel, followed by an Israeli assault on Gaza, would have been the first by a Palestinian scholar ever published by the review. The Intercept originally broke the story. It argued that events in Gaza – where more than 14,000 Palestinians have been killed since Israel launched its military offensive – met the terms of genocide as defined by the United Nations convention. The article also called for a legally recognised crime of “Nakba” (catastrophe), the Arab word used to describe the forced removal of Palestinians from their homes at the time of Israel’s founding in 1948. Harvard journal accused of censoring article blaming Israel for Gaza genocide Read more\n23 Nov 2023 01.56 CET Lebanon's Hezbollah group confirms son of senior MP killed in Israeli strike Lebanon’s Iran-backed Hezbollah movement has officially confirmed that five of its fighters, including the son of a senior lawmaker, have been killed, amid skirmishes at the Israel-Lebanon border, according to AFP. Abbas Raad, son of the head of Hezbollah’s parliamentary bloc Mohammed Raad, was “martyred on the road to Jerusalem”, the group said in a statement – the phrase it has been using to announce the death of its members due to Israeli fire since the war started on 7 October. It issued separate statements with the identities and photographs of four other fighters who were also killed. As we reported earlier, a source close to the family said that Abbas Raad “was killed with a number of other Hezbollah members” in an Israeli strike Wednesday on a house in south Lebanon’s Beit Yahun. Since the Israel-Hamas war began on October 7, the frontier between Lebanon and Israel has seen escalating exchanges of fire, mainly between Israel and Shiite Muslim movement Hezbollah, but also Palestinian groups, raising fears of a broader conflagration. Israel’s army said in statements Wednesday evening that it had struck a number of Hezbollah targets and sources of fire from Lebanon, including a Hezbollah “terrorist cell” and infrastructure. Since the cross-border exchanges began, 107 people have been killed on the Lebanese side, according to an AFP tally. At least 75 are Hezbollah fighters but the toll also included at least 14 civilians, three of them journalists. Seven Hezbollah fighters have also been killed in Syria. On the Israeli side, six soldiers and three civilians have been killed, according to authorities. The strike came just hours after the four-day truce in Gaza was announced between Israel and Hamas, which is a Hezbollah ally. Iran’s foreign minister Hossein Amir-Abdollahian, who visited Beirut on Wednesday, warned in an interview that if the Hamas-Israel ceasefire begins but “does not continue... the conditions in the region will not remain the same as before the ceasefire and the scope of the war will expand”.\n23 Nov 2023 01.38 CET A bit more on the delay to the ceasefire and hostage release courtesy of Reuters, which notes that neither side had announced time for either event, though an Egyptian security source told the new agency that mediators had sought a start time of 10am on Thursday. Reuters reports further: Israel’s public broadcaster Kan, citing an unidentified Israeli official, reported there was a 24-hour delay because the agreement was not signed by Hamas and mediator Qatar. The official said they were optimistic the agreement would be carried out when it was signed. “No one said there would be a release tomorrow except the media ... We had to make it clear that no release is planned before Friday, because of the uncertainty that hostages’ families are facing,” Kan quoted a source in Israeli prime minister Benjamin Netanyahu’s office as saying.\n22 Nov 2023 00.57 CET US President Joe Biden also spoke with the emir of Qatar, Sheikh Tamim Bin Hamad al-Thani, to thank him for his “personal” role in reaching the hostage and ceasefire agreement, the White House said in a statement. It said: The two leaders committed to remain in close contact to ensure the deal is fully implemented and to ultimately secure the release of all hostages. They reiterated the importance of protecting civilian lives, respecting international humanitarian law, and increasing and sustaining humanitarian assistance to Palestinians in Gaza. Qatar, where the political leadership of Hamas is based, played a key role in the negotiations. For more about its role check out our explainer: Why is Qatar often a mediator and what is its role in Israel-Hamas war? Read more\n22 Nov 2023 00.42 CET US President Joe Biden has said that “under no circumstances will the United States permit the forced relocation of Palestinians from Gaza or the West Bank, or the besiegement of Gaza, or the redrawing of the borders of Gaza,” in a phone call with his Egyptian counterpart Abdel Fattah al-Sisi, the White House said in another statement. It continued: He [Biden] also affirmed that under no circumstances can Gaza remain a sanctuary for Hamas where they can threaten Israel and Palestinians alike and imperil any pathway to a durable peace. The President affirmed his commitment to the establishment of a Palestinian state and recognized Egypt’s essential role in setting the conditions for that outcome.\nUpdated at 00.43 CET\n22 Nov 2023 00.29 CET Ceasefire also delayed, reports say Multiple news media are reporting that the ceasefire will also be delayed, as well as the hostage deal. An Israeli source told Israeli newspaper Haaretz that there would be no halt to the fighting in Gaza as long as there is no finalised timeline for the agreement with Hamas. The BBC also reported that an Israeli government source said there would be a delay to the ceasefire, which had been expected to begin at 10am (0800GMT) on Thursday with the release of hostages expected to begin shortly after. An Israeli official meanwhile told the news agency AFP early Thursday there would be no halt in the fighting between Israel and Hamas “before Friday”. The reports come shortly after Israeli national security adviser Tzachi Hanegbi said late Wednesday that none of the hostages seized in the Hamas attacks on southern Israel on October 7 would be freed before Friday.\n22 Nov 2023 00.12 CET US President Joe Biden “emphasized the importance of maintaining calm along the Lebanese border as well as in the West Bank”, in a phone call with Israeli prime minister Benjamin Netanyahu in which he welcomed the hostage deal, the White House has said. In a statement, the White House said the two leaders discussed the pause in fighting, which “will allow for surging in much needed humanitarian assistance into Gaza”. It continued: The Prime Minister thanked the President for his tireless efforts, and those of his team, to help broker this deal. The two leaders agreed that the work is not yet done and the President assured the Prime Minister that he will continue working to secure the release of all remaining hostages. This is Helen Livingstone taking over from Léonie Chao-Fong.\nUpdated at 00.18 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war: son of senior Hezbollah lawmaker killed in strike on Lebanon border - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/22/israel-hamas-war-live-updates-hostage-deal-release-ceasefire-pause-latest-news"}