{"authors": [], "date_download": "2024-02-05 15:35:44", "date_modify": "None", "date_publish": "2023-11-22 06:48:51", "description": "The United States and the Philippines are conducting joint air and maritime patrols in the South China Sea, which come as the two countries step up cooperation in the face of growingly aggressive Chinese activity in the area", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fap-philippines-chinese-vietnam-malaysia-b2451514.html.json", "image_url": "https://static.independent.co.uk/2023/11/22/06/Philippines_US_Patrols_24426.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States and the Philippines are conducting joint air and maritime patrols in the South China Sea, which come as the two countries step up cooperation in the face of growingly aggressive Chinese activity in the area.\nThe Philippine Air Force said Wednesday its aircraft had taken part in joint patrols on Tuesday in the vicinity of Batanes, the northernmost province of the Philippines, which is only about 200 kilometers (125 miles) from Taiwan, a self-governed island that China claims as its own.\nThe patrols run through Thursday and also include both the U.S. and Philippine navies. They come only days after Philippines President Ferdinand Marcos Jr. called the situation in the South China Sea increasingly “dire” as China seeks to assert its presence in an area where multiple nations have competing territorial claims.\nChina claims virtually the entire South China Sea as its own waters, which has led to disputes not only with the Philippines but also with Vietnam, Malaysia, Taiwan and Brunei. These claims have long been regarded as potential flashpoints in the region, and have fueled U.S.-China rivalry.\nEarlier this month a Chinese coast guard ship blasted a Philippine supply ship with a water cannon in disputed waters, and last month a Chinese coast guard ship and an accompanying vessel rammed a Philippine coast guard ship and a military-run supply boat near a contested shoal, according to Philippine officials.\nSpeaking on Sunday in Honolulu, Marcos said China has been showing interest in atolls and shoals that are “closer and closer” to the coast of the Philippines, with the nearest atoll about 60 nautical miles (111 kilometers) away.\n“Unfortunately, I cannot report that the situation is improving,” Marcos said. “The situation has become more dire than it was before.”\nIn announcing the start of the joint patrols, Marcos said on X, formerly known as Twitter, that they were “testament to our commitment to bolster the interoperability of our military forces.”\n“Through collaborative efforts, we aim to enhance regional security and foster a seamless partnership with the United States in safeguarding our shared interests,” he wrote.\nUnder Marcos, who was elected last year, the Philippines has been deepening its relationship with the U.S. in a shift from his predecessor, Rodrigo Duterte, who had been closer to China and Russia.\nIn February, Marcos approved an expansion of the U.S. military presence in the Philippines to add four new bases from five existing sites under a 2014 Enhanced Defense Cooperation Agreement between the longtime treaty allies.\nThe move, which Marcos said would boost the Philippines’ coastal defense, dovetails with the Biden administration’s efforts to strengthen an arc of military alliances in the Indo-Pacific to better counter China.\nMarcos has also been strengthening ties with others, including Tokyo, signing an agreement earlier in the year to allow Japanese troops to join training exercises.", "source_domain": "www.independent.co.uk", "text": null, "title": "The US and the Philippines conduct joint air, sea patrols in South China Sea not far from Taiwan", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/ap-philippines-chinese-vietnam-malaysia-b2451514.html"}