{"authors": ["Peter Beaumont"], "date_download": "2024-02-05 15:35:45", "date_modify": "None", "date_publish": "2023-11-22 15:37:23", "description": "Israel’s PM facing pressure from all sides as some say ceasefire agreement does not go far enough", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F22%2Fnetanyahu-avoids-political-rebellion-over-hamas-hostage-deal-but-ally-calls-it-immoral.json", "image_url": "https://i.guim.co.uk/img/media/a0e3df39bfa99550b440ad6553ad5149e7888997/0_205_3072_1843/master/3072.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ff8d7d2185bad58e5528cd7708d1c17", "language": "en", "localpath": null, "maintext": "Israel’s prime minister, Benjamin Netanyahu, has managed to avert a wider rebellion over the Gaza deal with Hamas among his far-right coalition partners even as Itamar Ben-Gvir, the firebrand national security minister, called it immoral.\nThree ministers, all from Ben-Gvir’s far-right Jewish Power party, oppose the deal but members of the equally hardline Religious Zionist party were persuaded to support it after heated exchanges in an Israeli cabinet meeting late on Tuesday night.\nThe agreement reached with Hamas will mean 50 women and children who are being held as hostages in Gaza will be released in an exchange for a four-day ceasefire and the release of 150 Palestinian prisoners in Israel, with the possibility of more releases from each side for each further day there is no fighting.\nThe deal was made after weeks in which Netanyahu had been vocal in his opposition to any pause in Israel’s military offensive against Hamas in Gaza, but there has also been mounting political pressure on the prime minister, who has seen his support among voters collapse since the 7 October massacre by Hamas.\nAmid warning signs of political difficulties for Netanyhu, who depends on support from far-right parties to remain in power, Ben-Gvir heavily criticised the deal on Wednesday. “We don’t have the right to agree to separating them and only some of them returning,” he said. “And we definitely cannot accept an outline that sees the release of female and underage terrorists when we don’t get back everyone”, adding that the ceasefire benefited Hamas.\nLeaks from the cabinet meeting suggested that Ben-Gvir had also said that the decision to back the deal threatened “generational damage that will come back to hurt us badly”.\nThe support from Bezalel Smotrich, the finance minister, and his Religious Zionist party, however, represented a victory for Netanyahu and his senior allies.\nSupport for the deal appears to have been clinched with the decision by Yoav Gallant, the defence minister, and by senior officials in the Israel Defense Forces and Shin Bet domestic intelligence agency to back it, even if it meant slowing the pace of the offensive.\n“The Religious Zionist party’s ministers were convinced that this is an achievement that matches and advances the aims of the war and won’t harm them,” the party said in a statement after the vote. “It’s a deal with low prices which is a result of the pressure placed on [Hamas leader Yahya] Sinwar, a deal that will release many women and children, and a move that is limited in time and includes clear mechanisms that will prevent erosion. Immediately afterward, the war will continue until Hamas is destroyed.”\nTalks around the truce in exchange for the release of hostages have seen Netayahu and his cabinet attempt to balance two competing concerns.\nView image in fullscreen Itamar Ben-Gvir, Israel’s national security minister, has been critical of the deal with Hamas. Photograph: Ammar Awad/Reuters\nOn one hand, support for an arrangement to release those held captive by Hamas and other armed Palestinian factions in Gaza enjoys widespread public support, much of which has been galvanised by the campaign waged by the families of the hostages.\nOn the other hand, however, has been the concern that an agreement for a substantial ceasefire could mark the beginning of the end of Israel’s war against Hamas, a concern dismissed by Netanyahu as “nonsense”.\nJustifying his support for a deal he had previously rejected, Netanyahu said: “Let me make clear: we are at war, and we will continue the war until we achieve all our objectives – eradicating Hamas, bringing back all our hostages and MIAs, and guaranteeing that there will be no figure in Gaza that threatens Israel.”\nIsaac Herzog, Israel’s president, however, acknowledged that the deal – while moral – would inspire “understandable, painful and difficult misgivings”.\n“It is a moral and ethical duty that correctly expresses the Jewish and Israeli value of redeeming captives, and I hope that it will be a significant first step for bringing all the captives home,” he said.\nReactions among leading Israeli columnists on Wednesday reflected the continuing political problems that Netanyahu is facing even as he tries to sell the deal, with Nahum Barnea, a journalist for the Yedioth Ahronoth newspaper, suggesting that “Israel has no choice but to pay the price” while linking the agreement with the failures of 7 October.\n“The alternative to forsaking the hostages a second time, after they were first forsaken on October, would have been far worse and far more dangerous. Beyond the price it could end up costing in blood and lives, it would have left an indelible stain on the Israeli government and the IDF.”\nOthers were more damning still. Also writing in Yedioth, Yossi Yehoshua warned that Israel risked missing “an historic opportunity to fundamentally change the Gaza problem, and will not only pay for that in soldiers’ lives but by missing out on a better deal”, adding “we are jeopardising our most important war in recent decades. One man has to own all of this: Binyamin Netanyahu.”\nOn Kan Radio, Gadi Shamni, a former senior military officer, said: “I’m not sure that Netanyahu wants to win this war. This floundering might work for him.\n“Netanyahu already realises that he is going to be remembered in infamy as the man who with his own two hands moulded this crisis. The prime minister delayed the IDF [ground] manoeuvre for weeks – he didn’t believe in the IDF’s capabilities, and he chose to waste his time.\n“What Netanyahu wants, first of all, first and foremost, is to minimise the damage to himself,” he said.", "source_domain": "www.theguardian.com", "text": null, "title": "Netanyahu avoids political rebellion over Hamas hostage deal but ally calls it ‘immoral’", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/22/netanyahu-avoids-political-rebellion-over-hamas-hostage-deal-but-ally-calls-it-immoral"}