{"authors": ["Julian Borger", "Jason Burke", "Ruth Michaelson"], "date_download": "2024-02-05 15:35:51", "date_modify": "None", "date_publish": "2023-11-22 23:10:40", "description": "Increasing pressure from the US and from the families of Israeli hostages were vital in securing agreement for the four-day truce", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F22%2Fsecrecy-public-anger-israel-hamas-ceasefire-deal.json", "image_url": "https://i.guim.co.uk/img/media/b3352216cead1309510bf0f0456a2742245f2c65/0_25_7788_4673/master/7788.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=200f35af1f1de7f6f2dfaeef3b6be94c", "language": "en", "localpath": null, "maintext": "The hostage deal that was finally agreed by the Israeli cabinet in the early hours of Wednesday was very similar in outline to what was on the table a month ago, according to sources familiar with the discussions.\nIn the intervening weeks, a lot has happened to turn the proposal to exchange women and children prisoners during a ceasefire into a near-reality.\nIsrael has mounted a ground offensive, seizing control of much of northern Gaza, and sending Hamas underground. The Israeli Defense Forces are now open to a tactical pause while decisions are made about how to move southwards.\nMeanwhile, the government of Benjamin Netanyahu has been under acute and mounting pincer pressure: from the Biden administration, and internally from the hostages’ families and their sympathisers, who have waged a relentless public campaign to put the captives’ lives first.\nThe first sign that Hamas was interested in a hostage deal came only a few days after its 7 October attack in which its gunmen killed 1,200 Israelis and took about 240 captive. The government in Qatar approached the White House to convey Hamas’s interest in negotiations, and suggested that a dedicated cell be set up involving a handful of US, Qatari and Israeli representatives, according to senior US officials.\nJake Sullivan, the US national security adviser, designated his Middle East coordinator, Brett McGurk, and Josh Geltzer, deputy White House counsel, to set up the cell, which was kept secret from the rest of the administration on Israeli and Qatari insistence.\nBiden and his team were focused in particular on 10 US nationals who had not been accounted for and were presumed to be among the hostages. On 13 October, the US president held a Zoom call with their families. A senior administration official said colleagues on the call described it as “one of the most gut-wrenching things they’ve experienced in their time here”.\nWhen Biden visited Israel five days later, he met the families of hostages in person, and their release was a main focus of his face-to-face meeting with Netanyahu, according to US officials. Three Americans were included in the final deal on Wednesday.\nAlongside Biden’s personal commitment, the White House came to see the hostage issue as the most likely route to persuading the Israeli government to ease its onslaught on Gaza, which had flattened entire residential districts and killed thousands of Palestinian civilians.\nIn a bid to build confidence, Hamas released two American hostages on 20 October and two Israelis four days later. Sullivan, McGurk and Sullivan’s deputy tracked the progress of the two Americans, Judith Raanan and her teenage daughter, Natalie, over several hours. For the Americans it was a “proof of concept” showing that Qatar could deliver the release of hostages as promised through the joint cell.\nAfter the initial hostage release, the Israelis authorised the Mossad director, David Barnea, as their lead negotiator, who worked with his US counterpart, William Burns, on the parameters of a larger deal. On 25 October, the Hamas leader in Gaza, Yahya Sinwar, signalled that he was ready to free all the children, women, elderly and sick among the estimated 240 hostages, in exchange for a greater number of Palestinian prisoners held in Israeli jails as well a five-day ceasefire.\nIsrael was just two days away from unleashing its ground offensive. Hundreds of tanks were massed along Gaza’s borders with 350,000 reservists called up. US and Israeli officials debated whether the assault should be delayed to give the offered deal a chance.\nNetanyahu’s government argued there was not enough substance to the Hamas offer, pointing out there still was no proof of life of any of the hostages. The Americans agreed, but according to US officials, the ground offensive plan was adapted to be carried out in phases so that it could be paused if a deal came together.\nOnce the ground offensive had been launched, Sinwar repeated his offer, even suggesting that he would accept a shorter ceasefire, and publicly voiced his readiness for a deal on 28 October. Netanyahu remained cautious, keenly aware at the time that any deal would split his rightwing coalition and possibly bring down his government, or at least strengthen the hand of centrists who had joined the war effort after the 7 October attack.\nAfter the bombing of the Jabalia refugee camp over three days from 31 October to 2 November caused mass Palestinian casualties, Hamas temporarily cut off talks, but its boycott only lasted a few days. Communications would be cut again after the Israeli raid on al-Shifa hospital. Even when Sinwar was ready to talk, the dialogue was slow, a US official said, because he passed messages on handwritten notes rather than risking electronic communications.\nFrom the beginning of November, splits were clearly widening in the Israeli security establishment. Barnea and Burns visited Doha for a meeting with the Qatari prime minister, Mohammed al-Thani, but the sticking point for the Israelis remained the absence of a list of people whom Hamas claimed to be holding.\nHamas argued it was not able to produce all those details without a lull in the fighting. Many of the hostages, it appeared, were being held by other groups such as Palestinian Islamic Jihad and Gaza’s criminal clans, and were no longer under direct Hamas control.\nThe Qataris and intelligence chiefs also discussed the possibility of fuel shipments into Gaza, long resisted by Israel on the grounds that they would diverted by Hamas, and the idea of piecemeal deals involving the release of 10 to 15 hostages for operational pauses of a few days, but Netanyahu’s government wanted a bigger deal if it was to do a deal at all.\nOn 12 November, Biden called the emir of Qatar, Sheikh Tamim bin Hamad Al Thani, in a bid to break the deadlock, and insisted that some sort of identifying information had to be produced. Shortly after this call, Hamas produced data on the first 50 hostages it said would be freed in the first phase of any deal.\nOver the course of November, Washington steadily built up the pressure on Netanyahu to do a deal, making sure a constant stream of US officials was visiting Tel Aviv. “We are going to keep in their face,” a US diplomat said at the time.\nPublicly, the administration toughened its tone on the humanitarian consequences of the Israeli offensive, broke with Netanyahu by insisting that the Palestinian Authority run Gaza after the war, and declared the imposition of visa bans on Israeli settlers implicated in violence towards Palestinians on the West Bank.\n“What really got everyone’s attention was the signal that there would be potential repercussions for the settlers,” a source familiar with the negotiations said.\nOn Tuesday, the US national security spokesperson, John Kirby, said the administration would not support the extension of the Israeli military campaign to southern Gaza “absent a clearly articulated plan for how they’re going to protect the lives of the hundreds of thousands of people that have now added to the population in the south because they were asked to leave by the Israelis”.\nBy mid-November, the Americans were pushing at an open door, as Netanyahu became more receptive. When the White House Middle East coordinator, Brett McGurk, visited the prime minister on 15 November, a senior US official said, Netanyahu grabbed him by the arm and said: “We need this deal.”\nThe political calculus in Israel had changed as the hostages’ relatives steadily became more vocal and more effective inside Israel, culminating in a televised shouting match with the far-right ministry of national security, Itamar Ben-Gvir, which helped to isolate the extremists, clearing the way for a cabinet vote in favour of the deal on Wednesday morning.\n“I think the families did the heavy lifting,” said Daniel Levy, president of the US/Middle East Project.\n“What went on was that the families over time were convinced that the focus of their action had to be at home, that the place they needed to tip that had the power of decision-making was their own government.”\nThe final text was hammered out in Doha on 18 November between McGurk and prime minister al-Thani, who passed a text on to Hamas. The next day McGurk went to Cairo to meet the Egyptian intelligence chief, Abbas Kamel, to receive Hamas’s response and make last-minute tweaks.\nThe current deal can be extended; an extra day of ceasefire will be added for every 10 further hostages that Hamas releases. US diplomats say they are hopeful that the pause can be used to significantly address the humanitarian catastrophe in Gaza. The Qataris, meanwhile, say they are hopeful that it could lead to a long-term ceasefire.\n“That is probably unrealistic,” said a source who has been in regular contact with Doha. “Everyone else we talk to believes that after this break, it will get a lot worse.”", "source_domain": "www.theguardian.com", "text": null, "title": "Secrecy and public anger: how the Israel/Hamas ceasefire deal came about", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/22/secrecy-public-anger-israel-hamas-ceasefire-deal"}