{"authors": [], "date_download": "2024-02-05 15:35:52", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "A cargo ship with 25 crew members on board was hijacked by Yemen Houthi militia in the Red Sea on Sunday, Israeli and Saudi sources reported. Israel D.....", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274038644%2Fisrael-says-yemens-houthis-hijack-cargo-ship-in-red-sea.json", "image_url": "https://static.themainstreammedia.com/story_logos/newsnet/britain-news.jpg", "language": "en", "localpath": null, "maintext": "JERUSALEM/ADEN, Nov. 19 (Xinhua) -- A cargo ship with 25 crew members on board was hijacked by Yemen's Houthi militia in the Red Sea on Sunday, Israeli and Saudi sources reported.\nIsrael Defense Forces (IDF) confirmed in a statement that the Houthis took control over the cargo ship near Yemen in the southern Red Sea, adding that the vessel was heading from Türkiye to India. The IDF warned that the hijacking was \"a very grave incident of global consequence.\"\nThe ship was identified as the Galaxy Leader, a cargo ship that transports cars, according to a report by the Saudi-based Al Arabiya TV news.\nIsrael's state-owned Kan TV news reported that the ship was operated by a Japanese company, which leased it from a British company co-owned by Rami Ungar, an Israeli shipping mogul and an importer of vehicles.\nIn a statement, Israeli Prime Minister Benjamin Netanyahu's office \"strongly condemned\" the hijacking, saying the ship \"was hijacked at the whim of Iran by the Houthi militia in Yemen.\"\nAccording to the office, onboard the ship were at least 25 crew members of several nationalities, including Ukrainians, Bulgarians, Filipinos and Mexicans. \"No Israelis were present on the ship,\" the statement read.\nEarlier in the day, the Houthi group issued renewed threats to attack any Israeli ships passing through the Red Sea corridor.\nIn a press statement broadcasted by the group's media outlets, the Houthi armed forces declared they \"will target all types of ships carrying the flag of the Zionist entity and ships operated by Israeli companies, as well as ships owned by Israeli companies.\"", "source_domain": "www.britainnews.net", "text": null, "title": "Israel says Yemen's Houthis hijack cargo ship in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274038644/israel-says-yemens-houthis-hijack-cargo-ship-in-red-sea"}