{"authors": ["Neha Dhillon"], "date_download": "2024-02-05 15:35:57", "date_modify": "None", "date_publish": "2023-11-22 17:03:59", "description": "IDF soldiers have been given heartbreakingly clear instructions on how to meet the traumatised children that are freed from Hamas.Tomorrow, Hamas has", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F24822138%2Fheartbreaking-words-traumatised-kids-freed-from-hamas%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2023/11/crop-24822840.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "IDF soldiers have been given heartbreakingly clear instructions on how to meet the traumatised children that are freed from Hamas.\nTomorrow, Hamas has agreed to release 50 women and children back to Israel at the Rafah crossing as part of a ceasefire deal.\n6 IDF soldiers have been given heartbreaking instructions on how to meet the freed children Credit: EPA\n6 Israeli soldiers have been instructed not to answer any questions children may have about where their family members are Credit: Jon Bond\n6 Nine-year-old Emily Hand is one of the hostages expected to be returned tomorrow Credit: AP\nThe Israeli soldiers who have been instructed to meet the freed hostages have been told how to behave around them, how to mediate, and the exact words that they should say.\nThis is: “Helly, my name is (soldier’s name), I am a soldier in the Israel Defense Forces and I am accompanying you so you can go home.\n\"You are in a safe place. I am here to take care of you, you are safe.”\nSecondly, they are to attempt to pair each child with one soldier, in failing that they should try and pair a family unit with one soldier.\nThey have also been told what questions they can ask children, like: \"Are you thirsty?\", \"Are you hot or cold?\"\nAnd if the child is struggling to walk, the soldiers have been told that they should ask whether they can take their hand, or if they can pick them up.\nThe army has published clear instructions not to touch any children without explicit permission.\nIt is still not clear what the children went through whilst in captivity and the IDF fear that any physical touch could prove triggering.\nSoldiers are permitted to offer a hand or a hug, but it has been stressed that this can only be an offer and that outright consent is necessary.\nThey have also been taught how to deal with questions concerning the unknown fate of family members.\nIf the children asks where their parents are, the soldier is under strict instructions not to answer the question - even if they know the answer.\nThe guidance given by the Israeli army states that each question must be answered along the lines of: \"I'm sorry, I don't know.\n\"My job is to bring you to Israel, to a safe place, where people you know will be waiting for you and will answer all of your questions.\"\nThe IDF believe that approximately 40 children have been held captive by the terror group since the October 7 massacre.\nAmong them is Irish-Israeli nine-year-old Emily Hand.\nShe was abducted from bed during a sleepover at a friend's house in Be'eri Kibbutz, almost seven weeks ago.\nHer devastated family threw her an emotional birthday party last week, as her dad broke down in tears and said he's praying for the return of his daughter.\nThe deal has sparked fresh hope for her family, as Israel named Emily as one of the 50 hostages that are set to be released tomorrow.\nThis comes as part of the ceasefire deal that Israel agreed with Hamas.\nIn return for 50 hostages, Israel has agreed to halt the bombing and brutality for four-days. 300 Palestinian women and children could also be freed from Israeli prisons.\nThe Palestinian prisoners on Israel's list are mainly teenagers arrested over the past year for rock-throwing and other minor offences.\nThis is the first major diplomatic breakthrough since the war broke out.\nRetired Brit major general Rupert Jones told the Sun that the truce, set to begin tomorrow, is a \"very good thing\" and \"has to be progress\".\nHowever, Jones stressed that the logistic details of a handover of hostages can impose a few challenges to the IDF as the war is \"far from over\".\n6 Eight-year-old Shoham Nave, one of the 40 children believed to have been taken hostage by Hamas Credit: Ian Whittaker\n6 Two-year-old Aviv Asher Katz also remains captive Credit: Ian Whittaker", "source_domain": "www.thesun.co.uk", "text": null, "title": "Tragic reason IDF troops won’t mention kidnapped kids' parents in first words they'll hear when they're saved from Hamas", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/24822138/heartbreaking-words-traumatised-kids-freed-from-hamas/"}