{"authors": ["Miriam Kuepper", "Nick Pisa In Jerusalem", "Chris Jewers"], "date_download": "2024-02-05 15:36:00", "date_modify": "None", "date_publish": "2023-11-22 01:16:39", "description": "Netanyahu (pictured) said in a statement: 'There is a lot of nonsense out there to the effect that after the pause to return our hostages, we will stop the war.'", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12777869%2FIsraeli-cabinet-approves-hostages-ceasefire-deal-dozens-women-children-kidnapped-Hamas-freed-five-day-truce-Netanyahu-vows-continue-war-destroy-terror-group-after.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/22/01/78090667-0-image-a-8_1700616192673.jpg", "language": "en", "localpath": null, "maintext": "Israel has agreed a deal that will see 50 women and children kidnapped by Hamas gunmen on October 7 freed during a four-day truce, leaving their families with an agonising wait to see if their loved ones are coming home.\nIsrael's Prime Minister Benjamin Netanyahu summoned his war cabinet last night where he demanded they support the temporary pause in fighting - that could begin within 24 hours - after the US and Qatar spent weeks thrashing out the deal.\nUnder the terms of the agreement, Hamas is to free 50 women and children of the around 240 hostages it is holding in the Gaza Strip over a four-day period - extended by an additional day for every 10 hostages released, the Israeli government said.\nHamas is to release 12 Israeli women and children every night for four days. In return, Israel will free 150 Palestinians held in Israeli jails and allow 300 aid trucks into Gaza every day of the ceasefire to get much needed aid to civilians trapped there.\nIt was not immediately clear exactly who will be released from Gaza. Among those waiting for news will be London-based father Thomas Hand, whose nine-year-old Irish-Israeli daughter Emily is among those being held inside the territory.\nIsrael has agreed a deal that will see 50 women and children kidnapped by Hamas gunmen on October 7 freed during a four-day truce. It was not immediately clear exactly who would be released, but among those waiting for news will be London-based father Thomas Hand, whose nine-year-old daughter Emily (pictured) is among those being held inside the territory\nProtesters call for the immediate release of hostages held in Gaza who were seized from southern Israel on October 7 by Hamas gunmen during a deadly attack, in Tel Aviv, Nov. 18\nMr Hand, who has been petitioning the Israeli government to orchestrate her release, will be hoping and praying that she is among the group of 50.\nMeanwhile, the UK government has said it believes three British nationals are still being held hostage in Gaza. No information has been given on whether they could be among those released.\nBritish Foreign Secretary David Cameron hailed the deal as a 'a crucial step towards providing relief to the families of the hostages and addressing the humanitarian crisis in Gaza.' MailOnline has contacted the Foreign Office for further comment.\nIt was also not clear exactly when the truce would go into effect, but a Qatari official said this morning that it will be officially announced within the next 24 hours.\nThe delay is to allow time for Israeli citizens to petition their country's Supreme Court to block the release of any prisoners, a requirement under Israeli law.\nNetanyahu said Israel would resume its offensive to destroy Hamas after the cease-fire expires. He said in a statement: 'There is a lot of nonsense out there to the effect that after the pause to return our hostages, we will stop the war.\n'Then let me make it clear: We are at war – and will continue the war. We will continue the war until we achieve all of our war aims,' he said.\n'To eliminate Hamas, return all of our hostages and our missing, and ensure that there is no element in Gaza that threatens Israel.'\nAnother statement by the PM's office said: 'The Israeli government, the Israeli army and the security forces will continue the war to bring back all those kidnapped, eliminate Hamas and ensure that there is no longer any threat to the State of Israel from Gaza.'\nNetanyahu (pictured) showed his determination to press on with his objective of wiping out Hamas and said in a statement: 'There is a lot of nonsense out there to the effect that after the pause to return our hostages, we will stop the war'\nPeople demonstrate before the hostage deal was announced outside the Kyria defense complex, as Israel's political cabinet held a meeting to discuss it, on November 21\nTens of thousands of people led by the families of the hostages are seen walking along the last stretch of Route 1 to enter Jerusalem on the fifth and final day of the March for the Hostages, November 18. The march called on the Israeli government to negotiate a release deal\nNetanyahu addressed his cabinet to discuss a temporary ceasefire to allow an exchange, as currently the Gaza Strip is under Israeli bombardment (pictured, November 22)\nIsraeli tanks operate in a location given as Gaza, amid the ongoing ground operation of the Israeli army against Hamas, which was now halted for a 'four-day truce'\nQatar confirmed on Wednesday morning that an agreement had been reached.\n'The starting time of the pause will be announced within the next 24 hours and last for four days, subject to extension,' Qatar's foreign ministry said in a statement.\nAt a glance: The Israel-Hamas hostage release deal Israel and Hamas have agreed to a four-day halt in their war in exchange for the release of dozens of hostages. Here are the key elements of the deal: A four-day pause in fighting\nDuring that time, 50 women and children will be released by Hamas\nFor each additional 10 hostages released, pause will extend by a day\nIn exchange, 150 Palestinian women and people under the age of 19 will be released from Israeli prisons\nIsrael will allow humanitarian aid to enter all areas of Gaza in the form of 300 trucks a day, bringing in food, medicine and fuel\nIsrael will stop aerial surveillance in the south of Gaza for the four days\nIt will also stop aerial surveillance in northern Gaza Strip from 10am to 4pm for the four days\nIsrael has committed to not attack or arrest anyone in all areas of Gaza during the four-day truce Advertisement\n'The agreement includes the release of 50 civilian women and children hostages currently held in the Gaza Strip in exchange for the release of a number of Palestinian women and children detained in Israeli prisons. The number of those released will be increased in later stages of implementing the agreement,' it added.\nIsrael's Ministry of Justice published a list of 300 Palestinians who will be released as part of the ceasefire deal with Hamas.\nAmong those released are operatives of Hamas, Islamic Jihad, Fatah and the Popular Front and some were tried in military courts and some in civilian courts.\nHalf will be released in the first stage with the second depending on how the ceasefire and exchange of hostages goes. It is hoped that hostages will be released from Thursday and Friday, but there is no official confirmation yet.\nAccording to Israeli law anyone who opposes the release of a political prisoner can apply to have them kept in jail. The list was mainly people under 18 and women.\nOfficials from the CIA and Israeli intelligence service Mossad were said to have been involved in the talks in Qatar, and ahead of the cabinet meeting Mr Netanyahu had said: 'I hope there will be good news soon.'\nNetanyahu convened his War Cabinet for the vote last night. The meeting stretched well into the early hours today, underscoring the sensitivity of a proposal that would suspend an Israeli offensive against Hamas before it has reached its goals.\nAhead of the vote, Netanyahu sought to assure the government ministers that the break was only tactical, vowing to resume the offensive after the truce expires. Top security officials also attended the meeting.\nSharone Lifschitz and her father Oded Lifshitz are pictured in this undated photo in London. Oded is among the roughly 240 people being held in Gaza by the Hamas terror group\nNoam Sagi, a London-based British Israeli, whose mother is among the hostages held by Hamas in Gaza. His mother, Ada Sagi, was taken from Nir Oz kibbutz on October 7\nThere was speculation last night that Irish-Israeli Emily Hand, who celebrated her ninth birthday in captivity last week, could be among those released. Initially it had been thought Emily was murdered - with her father Thomas (pictured) saying she hoped she has been and then the family was notified she was alive\nPeople walk past a billboard showing photos of people abducted by Hamas, at the Tel Aviv museum in Tel Aviv, Israel, 21 November 2023\nMeanwhile the Palestinian terror group Islamic Jihad has announced the death of one of the Israeli hostages it has held since the October 7 attacks on Israel.\nThey said: 'We previously expressed our willingness to release her for humanitarian reasons, but the enemy was stalling and this led to her death.'\nReports online named the hostage as 76-year-old Katzir Hanna, kidnapped from the Nir Oz kibbutz, and a source close the families said simply: 'She is no longer with us.'\nHamas leader Ismail Haniyeh had said before the cabinet meeting last night: 'We are close to reaching a deal on a truce.'\nSimilarly US President Joe Biden, who alongside Qatar helped broker the deal, commented that he believed a deal was 'now very close'.\nIn his address to the cabinet, Netanyahu said that accepting a deal for the release of hostages was 'a difficult decision but it's a right decision'.\nPresident Biden had helped 'improve the framework being laid out before you... to include more hostages at a lower price', he told his cabinet as it met to vote on the deal. 'The entire security establishment fully supports it.'\nBiden reportedly worked 'hour by hour' on the deal.\nThe hostages' families had demanded that Israel should insist on the return of all those being held, and the Religious Zionist party, which is part of Netanyahu's coalition government, had voiced opposition to the deal, denouncing it as 'bad' for Israel's security, for the hostages and soldiers.\nIsrael has previously argued, in the face of international calls for a ceasefire, that any pause in fighting will give Hamas a chance to regroup.\nBut Netanyahu said the deal 'will allow the IDF to prepare for a continuation of the fight - the war is ongoing, and it will continue until we achieve all of our objectives: destroying Hamas and bringing back all the hostages.'\nAn Israeli tank on its way to Gaza Strip, in southern Israel, yesterday\nSimilarly US President Joe Biden (pictured) commented that he believed a deal was 'now very close'\nThere was speculation last night that Irish-Israeli Emily Hand, who celebrated her ninth birthday in captivity last week, could be among those released.\nInitially it had been thought Emily was murdered - with her father Thomas saying she hoped she has been and then the family was notified she was alive.\nIsrael reportedly named her as among the first handful of hostages earmarked for release but there was no official confirmation.\nBritish-Israeli Sharone Lifschitz, whose mother Yocheved, 85, was released by Hamas late last month but whose father Oded is also still being held said she was 'hopeful' about the deal.\nShe said: 'Everyone is incredibly anxious at the moment, but I think it must be the children who go first and they shouldn't be separated from their mothers.\n'But this is all part of Hamas plan to put us through an impossible situation, its a form of psychological torture.'\nMrs Lifschitz added any exchange would be through the Rafah crossing in the south and she said: 'It usually starts with a small handful to see how things go from that.'\nSpeaking to MailOnline, she said the families were facing an anxious wait, and despite her father being held in Gaza, insisted it must be 'women and children first.'\n'But this is all part of Hamas plan to put us through an impossible situation, it's a form of psychological torture.'\nOn Tuesday night before details of the deal were announced, British Israeli Noam Sagi - whose mother Ada is among the hostages - told Sky News that he was more hopeful now than at any previous point that she could be released.\n'I am more hopeful today than any other day,' he said. 'We’re getting closer.\n'From day one we [have been] engulfed in this psychological torture with lots of ups and downs. The ups are not really ups. The downs are really down,' he said.\n'So I have to hold on to everything I can. What exactly will happen we still don’t know, but at least it’s a start.'\nAbigail Mor Edan, a three-year-old American girl, is also hoped to be among the 50. Her family have said they hope she is home in time for her birthday on Friday.\nInitially the plan would be for women and children to go free first and in exchange, Palestinian prisoners held in Israel would go the other way.\nHowever an Israeli government official said that any prisoner put forward for release could have the decision overturned if families of victims of their crimes opposed it.\nThe spokesman said: 'If any of the these prisoners have blood on their hands, then the families of their victims have 24 hours to oppose their release by applying to the Supreme Court.'\nA picture taken on November 21, 2023 at the new building of the National Library of Israel in Jerusalem, shows people looking at an installation made up of chairs with books and portraits of Israeli hostages taken by Palestinian Hamas militants during the October 7 attack\nThe parents and relatives of children kidnapped on October 7th take part in a demonstration outside the UNICEF headquarters in Tel Aviv to protest over children being held in Gaza\nA woman looks on during a protest calling for the immediate release of hostages held in Gaza, in Tel Aviv, Israel, November 18\nTens of thousands of demonstrators led by families of the hostages enter Jerusalem, Nov. 18\nA picture taken from a position near Sderot along the Israeli border with the Gaza Strip shows smoke billowing during an Israeli bombardment on Gaza\nIDF spokesman Rear Admiral Daniel Hagari suggested that the hostage deal will not impact the military's main goal of eliminating the Hamas terror group.\nHe said: 'The goal of returning the hostages is significant. Even if it results in the reduction of some of the other things, we will know how to restore our operational achievements.'\nHe added the military will 'first update the families of the hostages, and then the public'.\nMeanwhile Hamas sources said that they had lost touch with 'some groups holding hostages' and they wanted the no fly clause so they could carry out searches without being spied on from the skies.\nOpposition parties in Israel voiced fears before the deal that giving too much will see the terrorists gain the upper hand.\nThe far right fear that soldiers, who are not included in any deal, will be kept on for months or possibly years as was the case with Gilad Shalit, held for five years before being released in 2011 in a prisoner swap.\nAhead of the deal in Qatar, foreign ministry spokesman Majed Al-Ansari said 'we're very optimistic, very hopeful' and told reporters before the truce deal was confirmed: 'We are at the closest point we ever had been in reaching an agreement.'\nPresident Biden, who does not support a full ceasefire, had said a temporary truce was 'now very close', adding: 'We could bring some of these hostages home very soon. But I don't want to get into the details of things because nothing is done until it's done.'\nDetails emerge about frantic efforts behind Hamas-Israel truce deal A US official has said a secret cell headed by CIA and Mossad chiefs, and multiple contacts between Biden and leaders of Israel, Qatar, and Egypt, underpinned an 'excruciating' five weeks resulting in the deal between Israel and Hamas. In a detailed account to reporters by the senior US official - speaking on condition of anonymity - a picture has emerged of a tense international effort beset by sudden communication cutoffs with Hamas, disputes over hostage lists, and safety concerns on the ground. The US official said the 'extremely excruciating five-week process' of negotiations began with a call from Qatar to Washington and the Israelis, in a bid to free some of the hostages snatched by Hamas on October 7. Qatar, which brokered the agreement, 'asked that a cell be established to work on the issue very carefully, very secretly, together with the Israelis', the US official said. Qatar hosts a Hamas political office, and has behind-the-scenes diplomatic links with Israel. It is also home to the largest US military base in the region. Biden administration officials were having 'daily, sometimes hourly, senior level of engagement with Qatar, with Egypt and with Israel on the issue of the hostages,' according to the official. The president himself entered the talks, holding Zoom calls with families of victims on October 13, followed by his visit to Israel five days later. The release of two American citizens on October 20 was seen as 'a pilot process' for the overall negotiations, the official said. 'We were able to track, kind of in real time, the (hostages) as they moved from Gaza, ultimately across the border and into freedom,' the American said. Their safe return 'gave us some confidence that... Qatar really could deliver through the cell that we had established.' Soon Mossad director David Barnea and CIA chief William Burns were also deeply involved in the process. A flurry of phone calls between Biden and Israeli Prime Minister Benjamin Netanyahu followed on October 20, 22, 23 and 25. Biden 'was engaged daily as extremely difficult talks and proposals were traded back and forth,' the official said, noting that discussions centered around transportation corridors, surveillance and timeframes. Hamas came under intense pressure to produce a list of hostages. Communication proved difficult as messages had to pass from Doha or Cairo into Gaza and back. Hamas often uses hand-written notes to communicate in order to avoid detection by Israel's advanced spy network. By October 25, Hamas was saying it could guarantee about 50 releases in the first phase, but their formal list came up short: just 10 names. On November 9, the CIA's Burns rushed to Doha to help thrash out a deal text, but the identification of hostages remained a sticking point. Biden called the emir of Qatar, Sheikh Tamim bin Hamad Al-Thani, on November 12 and 'made very clear that where we were was not enough,' the US official said. Shortly afterwards, 'Hamas produced the identifying criteria for the 50 hostages.' As Israel's bombing of Gaza intensified and civilian deaths soared, Biden called Netanyahu on November 14 urging him to 'move forward with this deal,' and the prime minister ultimately agreed, the official said. But suddenly, with a deal in sight that day, 'everything stalled again,' the US official said. Hamas had broken off talks. Biden called the Qatari emir on November 17, according to the official, to make clear the deal 'had to close.' Two days later, the Americans met with Egyptian intelligence chief Abbas Kamel and received assurances from Hamas 'closing the gaps,' the US official said. 'For the first time (they) really see this coming together.' Reporting by AFP Advertisement\nSmoke and flame rise in Gaza seen from Sderot, Israel, as Israeli attacks continue on the 46th day of the war\nPortraits of Israeli hostages held in Gaza since the October 7 attack by Hamas militants in Tel Aviv\nGil Dickmann (left) watches as Hen Avigdori (centre) speaks against the proposed legislation. This comes as hostages' families clashed with Israeli politicians over talk of death penalty\nThe release of hostages seized by Hamas could be approved by the Israeli government within 'hours' of a hostage deal being agreed, a senior adviser to Benjamin Netanyahu has said. Pictured: Israel soldiers transfer detained Palestinians out of the Gaza Strip on November 21\nIsraeli soldiers operate in a location given as Gaza, amid the ongoing ground operation of the Israeli army against Hamas, in this image released on November 21\nSmoke, rising over the destroyed buildings following the Israeli attacks on Gaza, is seen from the southern city of Sderot in Israel on November 21\nPortraits of Israeli children hostages are displayed during a rally outside the Unicef offices in Tel Aviv on November 20, 2023 to demand the release of Israelis held hostage in Gaza\nAlthough a temporary halt may come as a welcome relief it is unlikely that it will mark an end to the conflict which has seen more than 14,000 Palestinians killed and 68 Israeli soldiers lost.\nIsraeli media reported last night that among those killed in Gaza was Jamal Muhammad Haniyeh grandson of Hamas leader in exile in Qatar Ismail Haniyeh.\nHopes of a release deal had been mounting since Qatar on Sunday said only 'minor' practical issues remained.\nSpeculation grew further when the International Committee of the Red Cross, which is often involved in prisoner exchanges and hostage releases, said Monday its president had met Haniyeh in Qatar.\nFighting raged on in Gaza's bloodiest ever war yesterday despite talks of the upcoming temporary truce, sparked by the October 7 attack in which Israel says Hamas gunmen killed around 1,200 people, mostly civilians.\nIn retaliation, Israel launched a relentless bombing campaign and ground offensive in Gaza. According to the Hamas government, the war has killed more than 14,100 people, including nearly 6,000 children and close to 4,000 women.\nSources from Hamas and Islamic Jihad, which also participated in the attacks, said on condition of anonymity that their groups had agreed to the terms of a truce deal last night.\nThe BRICS group of nations including Russia, India and China also called for an 'immediate, durable, and sustained humanitarian truce leading to a cessation of hostilities' in Gaza aimed at drawing up a common response to the conflict.\nRafah resident Hamza Abdel Razeq had said a ceasefire would bring some respite for Gazans who have endured Israel's bombing and expanding ground offensive.\n'The people are really suffering,' he said. 'If they reach a five-day truce deal now, I believe it will pave the way for longer truces or even a total ceasefire.'\nIsrael's Prime Minister has said the country is 'making progress' in the deal that is reportedly being mediated through Qatari officials. Israeli soldiers are seen taking detained Palestinians out of the Gaza Strip, November 21\nSmoke rises after Israeli air strikes in Gaza, as seen from southern Israel, amid the ongoing conflict\nHamas officials are 'close to reaching a truce agreement' with Israel and the group has delivered its response to Qatari mediators, Ismail Haniyeh (right) said in a statement. Pictured with Iran's Foreign Minister Hossein Amir-Abdollahian on 31 October\nParents and relatives of those kidnapped on October 7 protested in Tel Aviv yesterday\nA child injured in the attacks is brought to Nasser Hospital for treatment in Khan Yunis, Gaza, yesterday\nA Palestinian woman is pictured in front of the damage following Israeli strikes on Rafah, on the southern Gaza Strip, on November 20\nAnother resident, Mahmud Abu Najm, added: 'We... pray to God for its success because the people are enduring an unbearable situation.'\nLarge parts of Gaza have been flattened by thousands of air strikes, and the territory is under siege, with minimal food, water and fuel allowed to enter.\nThe Israeli military, meanwhile, said air strikes had hit 'around 250' Hamas targets in the past day, destroying three underground shafts in the Jabalia area, which it said it had fully surrounded. Two soldiers were killed in northern Gaza, it added.\nIn Lebanon, official media said two journalists from Al-Mayadeen television and two other civilians were killed in cross-border shelling in the south. Israel said it was 'looking into the details' of the incident.\nThe Committee to Protect Journalists said 53 journalists and media workers have been killed in the war.\nMeanwhile, the health ministry in the occupied West Bank said the Israeli army killed one Palestinian in Nablus.\nMedics and patients have been increasingly caught up in the fighting, as Israel expanded its operation across northern Gaza.\nThe Hamas-run health ministry said Israel had laid siege to and hit the Indonesian Hospital in Jabalia on Monday, killing dozens, but there was no independent confirmation of the toll.\nThe Israeli army said later its troops had 'directly targeted' the source of fire from within the Indonesian Hospital.\nTwenty-eight premature babies from Gaza's largest hospital, Al-Shifa, were taken to Egypt for treatment on Monday. Three others remained in southern Gaza, the World Health Organization said on Tuesday. Two babies died before the evacuation, it said.\nThe Indonesian Hospital lies near Gaza's largest refugee camp Jabalia, which has been the scene of intense Israeli bombing.\nThe health ministry official said there were still about 400 patients inside the hospital, as well as 2,000 people seeking shelter.\nTwenty-eight premature babies from Gaza's largest hospital, Al-Shifa, were taken to Egypt for treatment on Monday\nPortraits of Israeli hostages posted on a wall in Tel Aviv yesterday as hostages' families the government brings their loved ones home\nThree others remained in southern Gaza, the World Health Organization said on Tuesday. Two babies died before the evacuation, it said. (pictured: Health care officials receive 28 of the 31 babies in Egypt)\nPeople lit candles at a memorial for Hamas hostages in Tel Aviv yesterday\nIsraeli soldiers inspect houses destroyed by Hamas fighters in the Kibbutz Nir Oz in southern Israel\nCivil defence teams and residents make search and rescue efforts following an Israeli attack in Deir al-Balah, Gaza\nPeople are looking for survivors following an air strike yesterday in Deir al-Balah, Gaza\nA Palestinian woman hangs clothes amid debris in Khan Yunis in the southern Gaza Strip yesterday\nAround 200 people were evacuated from the hospital on Monday and bussed to the relative safety of a hospital in Khan Yunis in southern Gaza.\nDoctors Without Borders (MSF) said three doctors, including two it employed, were killed in an Israeli strike on the Al-Awda hospital in Jabalia refugee camp.\nIsrael says Hamas uses medical facilities to hide fighters and as bases for operations, making them legitimate military objectives, while insisting it does everything possible to limit harm to civilians.\nBut criticism of Israel's conduct of the war has grown, from international agencies and some governments, with protests held worldwide.\nThe WHO said it was 'appalled' by the strike on the Indonesian Hospital, calling it just one of 164 documented attacks on health facilities and workers since the war began.\nThe UN children's agency, meanwhile, warned that fuel shortages and worsening sanitation in Gaza were shaping up to be 'a perfect storm for tragedy' through the spread of disease.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Coming home at last: Israel agrees deal that will see 50 women and children hostages released by Hamas during four-day ceasefire - as anguished families wait to learn if their loved ones are among tho", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12777869/Israeli-cabinet-approves-hostages-ceasefire-deal-dozens-women-children-kidnapped-Hamas-freed-five-day-truce-Netanyahu-vows-continue-war-destroy-terror-group-after.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}