{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:36:02", "date_modify": "None", "date_publish": "2023-11-22 18:55:10", "description": "Delegation says west is allowing collective punishment of people of Gaza unless it demands Israel allow more aid into territory", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F22%2Fwest-risks-being-complicit-in-israeli-war-crimes-warn-arab-and-muslim-foreign-ministers.json", "image_url": "https://i.guim.co.uk/img/media/d4fc582868bb2b47e35f8b74d6917e33e691b721/0_0_3825_2295/master/3825.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9df93da321f870b86dabd10c4619a72c", "language": "en", "localpath": null, "maintext": "The western powers on the UN security council face a choice of either demanding Israel lift its stranglehold on humanitarian aid into Gaza or being complicit in Israeli war crimes and collective punishment, foreign ministers from Arab and Muslim countries said on a visit to London on Wednesday.\nThe ministers are lobbying the five permanent members of the security council – China, France, Russia, the UK, and the US – to back a humanitarian resolution instructing Israel to allow UN agencies, and not the Israel Defense Forces, to check aid going through the Rafah crossing from Egypt to Gaza. They say the proposal is in line with practice in Syria, and reflects their concern that Israel is determined to depopulate Gaza slowly by making it uninhabitable.\nThe call came as the head of Unicef, Catherine Russell, told the UN security council that the Gaza Strip was now “the most dangerous place on earth to be a child”, adding that four-day humanitarian pauses were not sufficient to “put a stop to this carnage”. A consortium of aid agencies also questioned what could be delivered to Gaza during the truce, due to start on Thursday.\nThe group of foreign ministers, from Saudi Arabia, Egypt, Jordan, Indonesia, Turkey, Nigeria and Palestine, were in London for talks with the foreign secretary, David Cameron, before seeing the French president, Emmanuel Macron, later on Wednesday. They had already been to Beijing and Moscow.\nAt a briefing in London they also called for the imminent humanitarian pause to be extended to a total and permanent cessation of hostilities.\nThe Saudi foreign minister, Faisal bin Farhan al Saud, said: “It is absolutely necessary. It is in our opinion that we transition from temporary to an extended ceasefire and go from there.”\nPresenting the plan for the UN to take charge of the screening of aid entering Gaza – like the procedure that takes place at Syrian border crossings – Al Saud said: “We are putting a choice in front of members of the security council. Are they going to be complicit in the starvation and deprivation of the people of Gaza or are they willing to enforce the basic principle that civilians must not be affected by a military conflict?”\nHe asked: “Is the security council going to live up to its absolute minimum of responsibilities to ensure the innocent citizens of Gaza get the food, the water, the medical supplies that they need or are they willing to be part of collective punishment?”\nHe said if the west rejected the appeals of 2 billion people in the Middle East it would send a significant message. He added: “I don’t think the international community can afford to alienate the countries of the Arab and Muslim world.”\nThe Jordanian foreign minister, Ayman Safadi, said there was a huge gap between the 200 aid trucks a day to be allowed over the Rafah crossing under the agreement and the 800 a day needed.\nHe said it was imperative that aid was allowed to reach the north of Gaza where there has been no water or food supplied since 7 November, and hospitals and health centres are unable to function.\nThe ministers also conveyed a broader political message to western capitals that unless they do more to restrain Israel, a new generation of extremists could be born.\nThey remain convinced that Israel is planning to funnel the people of Gaza into a small, southern section of the territory, designate it a “safe zone” and then bomb the remainder of the Gaza until Palestinians plead to leave the strip.\nThe UN has said they are against safe zones in principle based on historic experience, but the US envoy, Linda Thomas-Greenfield, told the UN security council that the US hoped Palestinians would move to safer areas.\nThe Egyptian foreign minister, Sameh Shoukry, said: “The conditions are dismal, the displacement of people from north to south, the volume of people, the lack of shelter, sanitation, the risks of disease spreading … and aid cannot be delayed or there will be further displacement – that is the unspoken objective of Israel.”\nHe added that every western statement saying a displacement policy was not acceptable “has to be followed up by actual measures”. The aid agencies at a briefing said Israel was trying to force people in Gaza to go to the southern town of Al-Mawasi.\n“What are we as an international community doing to prevent displacement? If we continue on this road of restricting aid, there will be no recourse other than displacement,” he said.\nHe claimed: “In other conflicts the west has been categorical about what was happening so I do not see why in this instance there is a reluctance to call a spade a spade. There are a lot of statements saying the needs of international law must be respected, but not much evaluation of whether that need is being met or not.”\nAt briefings on Tuesday aid agencies said the four-day window to transport supplies into Gaza would only give them a chance to provide a drop in the ocean to 2 million people in need, but that they would concentrate on delivering medicines, food, water and tents.\nCameron told the Arab foreign ministers it was important that humanitarian organisations were able to transport more fuel into Gaza so they can carry out life-saving work – including powering hospitals or desalination plants, which supply 80% of Gaza’s water. The UK repeated its call, spurned by Israel, for priority to be given to improving land access, including by reopening the Kerem Shalom land crossing, so aid can be transported in at scale.", "source_domain": "www.theguardian.com", "text": null, "title": "West risks being complicit in Israeli war crimes, warn Arab and Muslim foreign ministers", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/22/west-risks-being-complicit-in-israeli-war-crimes-warn-arab-and-muslim-foreign-ministers"}