{"authors": [], "date_download": "2024-02-05 15:36:04", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Yemen Houthi rebels on Sunday confirmed that they have hijacked an Israeli cargo ship in the Red Sea. The Houthis announce the implementation of a mil.....", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274038765%2Fyemens-houthis-claim-seizure-of-israeli-cargo-ship-in-red-sea.json", "image_url": "https://static.themainstreammedia.com/story_logos/newsnet/britain-news.jpg", "language": "en", "localpath": null, "maintext": "SANAA, Nov. 19 (Xinhua) -- Yemen's Houthi rebels on Sunday confirmed that they have hijacked an \"Israeli cargo ship\" in the Red Sea.\n\"The Houthis announce the implementation of a military operation in the Red Sea, the results of which included the seizure of an Israeli ship,\" Houthi military spokesman Yehya Sarea said in a statement aired by the group's al-Masirah TV.\nRenewing the rebel group's threat to target all ships belonging to or dealing with Israel, Sarea called on \"all countries whose citizens work in the Red Sea to stop any activity with Israeli ships or ships rented by Israelis.\"\nThe spokesman reiterated that the group would continue to carry out military operations against Israel until \"its aggression against the Gaza Strip\" stops.\nHours earlier, the Israel Defense Forces (IDF) said in a statement that the Houthis took control of the cargo ship near Yemen in the southern Red Sea, adding that the vessel was heading from Türkiye to India. IDF warned that the hijacking was \"a very grave incident of global consequence.\"\nThe ship was identified as the Galaxy Leader, a cargo ship that transports cars, according to a report by the Saudi-based Al Arabiya TV news.\nIsrael's state-owned Kan TV news reported that the ship was operated by a Japanese company, which leased it from a British company co-owned by Rami Ungar, an Israeli shipping mogul and importer of vehicles.\nMarine Traffic, an online vessel tracking platform, published its last update about the hijacked Galaxy Leader at 13:04 local time (1004 GMT) on Saturday.\nThe Houthi militia controls much of Yemen's north, including the strategic Red Sea port city of Hodeidah since the Yemeni civil war erupted in late 2014.", "source_domain": "www.britainnews.net", "text": null, "title": "Yemen's Houthis claim seizure of \"Israeli cargo ship\" in Red Sea", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274038765/yemens-houthis-claim-seizure-of-israeli-cargo-ship-in-red-sea"}