{"authors": ["Dan Sabbagh", "Ruth Michaelson"], "date_download": "2024-02-05 15:36:06", "date_modify": "None", "date_publish": "2023-11-22 15:02:04", "description": "Houses in centre of strip said to have been targeted, killing 81, with 60 more believed dead in north", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F22%2Fpalestinians-reported-killed-in-gaza-as-attack-continues-despite-ceasefire-deal.json", "image_url": "https://i.guim.co.uk/img/media/dbe30804b6ff754f3650a0a56424510b3a908d04/0_0_3906_2344/master/3906.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=68f191fd2d7b34aa334ba3cbe7ae18be", "language": "en", "localpath": null, "maintext": "More than 100 Palestinians in Gaza – including 50 from one family – were reported killed on Wednesday as Israeli forces continued to attack across the strip from land, sea and air hours after agreement was reached for a ceasefire to begin on Thursday.\nWafa, a Palestinian news agency, said 81 people had been killed since midnight as houses were targeted in the centre of the strip. A further 60 were believed to be dead after bombing in and around the Jabaliya refugee camp in the north.\nRiyad al-Maliki, the Palestinian foreign minister, said during a visit to London that 52 of the victims at Jabaliya were from the same Qadoura family. “I have the list of the names, 52 of them. They were wiped out completely, from grandfather to grandchildren,” he said.\nDeadly bombing was also reported at al-Nuseirat refugee camp, killing nine people. Casualty figures are difficult to verify given the ongoing fighting, although initial reports often turn out to be underestimates until the missing are accounted for.\nThe ceasefire was due to begin on Thursday morning, but it was announced on Wednesday evening neither the truce nor the hostage release would happen before Friday. An initial 150 people are expected to be freed in the four days, in return for the release of 50 hostages held by Hamas and other groups. But there was little sign of a slowdown in the fighting on Wednesday.\nFighting continued around two hospitals in the north of the Gaza Strip, the Indonesia hospital and the Kamal Adwan hospital in Beit Lahiya, amid IDF demands that they be evacuated so that the military can take control.\nMedhat Abass, the director general of the health ministry in Gaza, said: “We fear for the lives of those inside Kamal Adwan, al-Awda and the Indonesian hospitals,” and earlier described the Indonesia hospital as “besieged”.\nView image in fullscreen An airstrike hits Beit Lahiya near the Kamal Adwan hospital on Wednesday Photograph: Mohammad Ahmad/AFP/Getty Images\nAbass distributed a message from Dr Essay Nabhan, the head of the nursing department, who said: “The hospital was transformed from a centre providing medical services into a mass grave. There are corpses in all of the departments, and we lost many lives due to the lack of supplies.”\nSixty corpses lay in front of the morgue, they added. There were plans to bury them inside the grounds of the hospital, as it was unsafe to leave the premises where hundreds sheltered fearfully inside.\nAt the Kamal Adwan hospital in Beit Lahiya, the lone hospital in operation at the northern part of the enclave, the director, Ahmed al-Kahlout, told Al Jazeera that “shelling and bombardment are increasing everywhere in the vicinity of the hospital”.\nThe hospital had received more than 60 bodies with over 200 injured since last night, he added. “The medical teams are very tired. We don’t have a single drop of fuel. We work in the dark using handheld searchlights,” he said.\nIn another message distributed by the health ministry, Kahlout said the hospital was using cooking oil rather than diesel to run the hospital’s generators, and an ambulance targeting the wounded had been struck near the hospital grounds.\nIsrael declined to comment on the fighting around the hospitals. Instead an Israel Defense Forces officer confirmed the military would continue its attacks until the ceasefire took effect.\nLt Col Richard Hecht, the IDF’s international spokesperson, told a briefing at lunchtime: “We still have probably, maybe a day-plus before this thing matures, and things can happen in that day. And I assume today is going to be a day of fighting in Gaza.”\nIsrael’s troops pressed forward on the ground on Wednesday in an effort to gain control of as much territory as possible in northern Gaza before the halt in hostilities. Its forces encircled Jabaliya on Tuesday, where fighting was continuing, and on Wednesday called on residents of its old city and nearby Shuja’iya neighbourhood to evacuate south before 4pm.\nAttacks were coming from the sea as well as by air and land. The IDF released black and white footage showing bombing from air and sea, plus a video of Israeli soldiers operating in a shattered urban landscape, clearing buildings at gunpoint and calling in airstrikes to attack nearby compounds.\nThe IDF has described the ceasefire as an “operational pause”, in line with comments overnight from the Israeli prime minister, Benjamin Netanyahu – a clear attempt to hint that bombing could resume after the hostage exchange is completed. “Our terminology is not ceasefire, our terminology is an operational pause,” Hecht said.\nGaza’s health ministry said it was able to evacuate 320 of the wounded and their families from the Indonesia hospital to southern Gaza on Wednesday using ambulances, while the remaining wounded were also evacuated from al-Shifa hospital.\nThe IDF showed a group of reporters a reinforced shaft linked to a bathroom, kitchen and an air-conditioned meeting room that it said was part of an underground network of Hamas tunnels beneath al-Shifa.\nThe tunnel shaft, about two metres (6.5ft) high, was accessed through an outdoor shaft in the hospital complex grounds.\nIsrael has long accused Hamas of using the hospital complex as a command and control base, an allegation denied by the militant group and hospital officials. The reporters were not taken inside the hospital and were allowed to see only a portion of the tunnel.\nAid agencies meanwhile warned that the humanitarian crisis was so catastrophic as a result of the fighting that a four-day pause in hostilities would do little to alleviate the situation, and called for a permanent ceasefire.\nJoël Weiler, executive director of the medical charity Médecins du Monde, said: “For a medical organisation, four days of pause is … Band-Aid, not healthcare.” Others warned that there were limitations on the amount of aid that could cross the border and the volume of fuel being made available as long as no extra crossing points were being opened beyond the existing Rafah facility on Gaza’s southern border with Egypt.", "source_domain": "www.theguardian.com", "text": null, "title": "Over 100 Palestinians reported killed in Gaza as attack continues despite ceasefire deal", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/22/palestinians-reported-killed-in-gaza-as-attack-continues-despite-ceasefire-deal"}