{"authors": ["Kelly Laco", "Executive Editor Of Politics For Dailymail.Com"], "date_download": "2024-02-05 15:36:12", "date_modify": "None", "date_publish": "2023-11-21 19:27:17", "description": "The U.S. Army is catching heat for attempting to win back favor with soldiers fired for refusing the COVID-19 vaccine as the military struggles with severe recruitment challenges.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12776347%2FArmy-slammed-desperate-attempt-win-favor-soldiers-fired-refusing-COVID-vaccine-military-enters-panic-mode-severe-recruitment-challenges.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/21/19/72725175-0-image-a-23_1700594665204.jpg", "language": "en", "localpath": null, "maintext": "The U.S. Army is catching heat for attempting to win back favor with soldiers fired for refusing the COVID-19 vaccine as the military struggles with severe recruitment challenges.\nLast week, the Army sent out a mass letter to soldiers who were fired after declining the COVID-19 vaccine for religious or medical reasons, offering a 'correction of military records.'\n'As a result of the rescission of all current COVID-19 vaccination requirements, former Soldiers who were involuntarily separated for refusal to receive the COVID-19 vaccination may request a correction of their military records from either or both the Army Discharge Review Board (ADRB) or the Army Board for Correction of Military Records (ABCMR),' the letter reviewed by DailyMail.com states.\nThe letter sparked an outcry of fury at the Defense Department by lawmakers and current and former service members.\nJohn Frankman, a former U.S. Army Captain who voluntarily left the Army on July 1 due to negative career repercussions for refusing the vaccine, told DailyMail.com that the letter will 'not have any effect on bringing service members back' because it doesn't offer a policy change.\n'There has always existed the ability to apply to upgrade one’s discharge status and apply to return to the military,' he explained.\nFrankman added that until there is accountability for the 'failed' vaccine policy and for other disasters such as the botched Afghanistan withdrawal, 'no one will trust the current leaders at the top.'\nThe letter sparked an outcry of fury at the Defense Department by lawmakers and former service members\nRetired Air Force veteran Patrick Fox said the Army has entered 'panic mode' by sending the letter\n'[Secretary of Defense] Lloyd Austin needs to be fired, and service members need to automatically have their discharges upgraded, receive back pay, be given the ability to return if they choose, and there needs to be a very serious and thorough introspection on how such terrible policy decisions were ever able to occur,' he told DailyMail.com.\nFrankman also said the 'crazy recruiting crisis' is crushing military readiness.\nThe Army faced a huge shortage of recruits in fiscal year 2022 at 55,000 - which was 10,000 short of its target for the year.\nSecretary of the Army Christine Wormuth downplayed the shortage, saying the aim for 65,000 new recruits was a 'stretch goal.'\n'The recruiting enterprise in the Army very much understands how important that role is — they don't need us to signal to them to put the pedal to the metal,' she said at the Pentagon in October.\n'We've got a lot of work to do to implement all of these changes, so I would imagine we'll settle on something lower than 65,000 for 2024.'\n'Our dedicated troops should never have been discharged for putting their personal health and safety ahead of an experimental COVID shot,' Rep. Bob Good, R-Va., wrote on X in reaction.\n'They should be unconditionally reinstated and restored with full pay and benefits,' he continued.\nFormer Army officer Brad Miller said the letter does not go far enough to remedy the harm he experienced.\n'Why doesn't the Army ask me if I want my resignation converted into a retirement dated with the release date of this new policy, and along with it offer compensation for the command I was wrongly relieved of, compensation for the remainder of whatever my career might have been, and then offer me my adjusted pension from this month forward? Then offer the same to all others similarly wronged,' he stated.\nHe went on to say the Pentagon can't 'fix itself' and claimed Biden administration officials' loyalty is 'assuredly un-American.'\nRetired Air Force veteran Patrick Fox said the Army has entered 'panic mode' by sending the letter.\n'Given how politically radioactive this decision by the DoD was, how much resentment it generated internally, and how much bad press it generated when it as made - mollifying policy like this indicates Army leadership are feeling the pressure on recruitment numbers,' he wrote on X.\n'To a degree they're willing to eat a little crow on this to alleviate it. If it gets bad enough, and senior leadership are backed into a corner, promises to restore rank & pay are not unthinkable in the future.'\nA current Army officer told DailyMail.com that the Army has 'continued to miss the mark on taking care of its service members and veterans.'\n'For the veterans separated due to the mandate, it seems unnecessary that they should need to submit for a Discharge Characterization Upgrade after being unlawfully discharged,' he continued.\n'I believe the Army needs to make amends with the American People and take the first step in making things right for these former service members: the branch should automatically upgrade the discharge characterizations to Honorable as that was the true reflection of these individual’s service to the Nation. This would also allow for veterans to make forward progression in the new chapter of their lives by being able to utilize their earned GI Bill,' the officer explained.\nDailyMail.com reached out to the Army for a response.\nOver 8,000 service members - many who sought religious exemptions - were fired for refusing to comply with the Pentagon's COVID-19 vaccine mandate enacted in August 2021.\nFollowing outrage over the mandate, the Fiscal Year (FY) 2023 National Defense Authorization Act (NDAA) passed in December 2022 terminated the mandate, but it did not reinstate service members who were fired for not receiving the shot nor provide any other compensation.\nAmendments by Rep. Jim Banks, R-Ind., that passed out of the House Armed Services Committee over the summer were included to 'offer redress' to service members who were 'unjustly discharged' by requiring the Pentagon to set up a reinstatement process and ensuring no negative retaliation.\nBut some current and former troops are saying that the amendments that would go into the FY 2024 NDAA are not strong enough to undo the 'serious harassment' they endured over the last two years.\nFrankman, who was in the Special Forces as part of the Green Berets, said that the 'missed career opportunities' he endured over the last two years could never be undone by any action of Congress.\nMy response to the Army’s recent letter trying to bring back the unvaxxed soldiers it forced out and mistreated.\nFollow the tagged accounts to support DoD accountability. pic.twitter.com/LgYbWTNI8R — John Frankman (@johny_franks) November 20, 2023\nFollowing outrage, the Fiscal Year (FY) 2023 National Defense Authorization Act (NDAA) passed in December 2022 terminated the mandate\nAn active-duty Army officer told DailyMail.com that the fired troops have had 'their lives turned upside down and were betrayed by those charged with protecting them.'\nAnd a formal apology from their service branches would be key to be able to have trust restored, he added.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Army slammed for desperate attempt to win back favor with soldiers fired for refusing the COVID vaccine as the military enters 'panic mode' due to severe recruitment challenges", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12776347/Army-slammed-desperate-attempt-win-favor-soldiers-fired-refusing-COVID-vaccine-military-enters-panic-mode-severe-recruitment-challenges.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}