{"authors": ["Helen Livingstone"], "date_download": "2024-02-05 15:36:13", "date_modify": "None", "date_publish": "2023-11-21 10:51:35", "description": "Gaza health ministry says Israeli forces are ‘laying siege’ to hospital and fear repeat of events at al-Shifa", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F21%2Fwhat-is-gaza-indonesian-hospital-why-israel-targeting-it.json", "image_url": "https://i.guim.co.uk/img/media/c120921816d327b1f365c6f2a93071716c9302bd/0_125_2936_1762/master/2936.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=00b631bf9c7d43cfc6578caf79174249", "language": "en", "localpath": null, "maintext": "A week after Israeli forces stormed Gaza’s main hospital, al-Shifa, they have begun closing in on another, the Indonesian hospital, also in northern Gaza. The territory’s ministry of health said it believed 12 people had been killed in shelling overnight to Monday and that it feared a repeat of what happened at al-Shifa.\nWhat is the Indonesian hospital?\nFunded by Indonesia, the $9m hospital opened in 2016 just outside the territory’s largest refugee camp in Jabaliya, in the north of Gaza City, on approximately 1.4 hectares (3.5 acres) of land.\nThe 140-bed facility, staffed by about 400 Palestinians and some Indonesian volunteers, was treating 250 patients a day when it first opened, according to the Opec Fund for International Development. That makes it significantly smaller than al-Shifa, which had about 700 beds.\nView image in fullscreen The Indonesian hospital on 1 November. Photograph: Bashar Taleb/AFP/Getty Images\nIts services included outpatient clinics, general and orthopaedic surgery, a specialised department for abdominal diseases and one of the only modern CT scanners in the region.\nWhat is happening at the hospital?\nAfter al-Shifa was raided last week, the Indonesian hospital was the only facility in northern Gaza still treating patients, with dozens of those killed and wounded by Israeli attacks flowing in overnight to Monday, according to medics.\nBut since Monday the hospital has been targeted by Israeli forces. Gaza’s health ministry spokesperson, Ashraf al-Qudra, told Agence France-Presse that Israel was “laying siege” to the hospital. “We fear the same thing will happen there as it did in al-Shifa,” he added.\nOne medical worker, Marwan Abdallah, said tanks were clearly visible from the hospital windows, about 200 metres away, and that Israeli snipers could be seen on nearby rooftops. “Women and children are terrified. There are constant sounds of explosions and gunfire,” he said.\nAbdallah and the Hamas-run Gaza health ministry said a shell struck the hospital’s second floor killing 12 people on Monday. Both blamed Israel, which denied shelling the hospital, saying its troops had returned fire on militants who targeted them from inside the compound.\nThe World Health Organization (WHO) cited reports saying patients and their companions were among the dead and that tens of people were also injured, some critically. It also said there were reports that people who attempted to leave were shot at, though none were injured.\nIndonesia’s foreign ministry said it had lost contact with three Indonesian volunteers who are part of the group that set up the facility.\nHow many people are still there?\nThe health ministry spokesperson told AFP about 200 patients had been evacuated and taken by bus to Nasser hospital in the southern town of Khan Younis in coordination with the International Committee of the Red Cross (ICRC).\nHe said there were still about 400 patients at the hospital and that officials were working with the ICRC to evacuate them too. There were also about 2,000 Palestinians sheltering in the hospital grounds, he said.\nMany Palestinians sought refuge in hospitals after Israel launched its offensive on Gaza last month, in the belief that Israeli forces would not target them.\nWhy are Israeli forces targeting the hospital?\nIn a briefing earlier this month, the Israeli military spokesperson R Adm Daniel Hagari, claimed the Israel Defense Forces had intelligence of a tunnel network under the hospital, as well as aerial imagery showing rocket launchers a few dozen metres from the complex.\n“Hamas systematically built the Indonesian hospital to disguise its underground terror infrastructure,” Hagari said, according to the Times of Israel.\nHe also presented recordings of calls between Hamas officials describing their use of fuel reserves that belong to the Indonesian hospital. The Guardian was not able to verify his claims.\nWhat has the international community said?\nIndonesia’s foreign minister, Retno Marsudi, condemned what she called Israel’s “attack” on the hospital.\n“The attack is a clear violation of international humanitarian laws,” she said in a statement. “All countries, especially those that have close relations with Israel, must use all their influence and capabilities to urge Israel to stop its atrocities.”\nThe head of the WHO said he was “appalled” by the attack. “Health workers and civilians should never have to be exposed to such horror, and especially while inside a hospital,” Tedros Adhanom Ghebreyesus said on X.", "source_domain": "www.theguardian.com", "text": null, "title": "What is Gaza’s Indonesian hospital and why is Israel targeting it?", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/21/what-is-gaza-indonesian-hospital-why-israel-targeting-it"}