{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:16:03", "date_modify": "None", "date_publish": "2024-01-24 22:22:03", "description": "Israel’s assault on Gaza’s second-largest city continues as Hamas delegation travels to Egypt for ceasefire and hostage-release talks", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F24%2Fthousands-trapped-in-gaza-hospitals-as-israeli-troops-encircle-khan-younis.json", "image_url": "https://i.guim.co.uk/img/media/b7b3203d5dfe87ce4b1828ad8a2aa46b66cfe0a8/0_102_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ac84c868a7b23089aff4c2684bb055b3", "language": "en", "localpath": null, "maintext": "Thousands of people sheltering in hospitals in Khan Younis are now trapped by Israel’s assault on the Gaza Strip’s second largest city, even as a delegation from Hamas travelled to Egypt for the latest round of talks aimed at another ceasefire and hostage-release deal.\nThe Israeli army said on Wednesday that it had “encircled” the southern city of Khan Younis after two days of heavy fighting, in what Israeli officials have described as the last large ground assault in the three-month-old war before a shift to “lower intensity” operations aimed at eradicating the Palestinian militant group.\nBy Wednesday morning, fierce battles had reached the gates of Khan Younis’s three main hospitals – al-Aqsa, Nasser and al-Amal – making it difficult for civilians to flee, according to Ocha, the UN humanitarian agency.\n00:02:09 Khan Younis hospital reportedly surrounded in Israel's southern Gaza offensive – video report\nA building at a training centre in the city run by the UN’s agency for Palestinian refugees, where about 800 people had sought shelter, was hit by tank shelling on Wednesday, according to the agency’s director, who said on social media that nine people had been killed and 75 injured, with medical teams unable to access the building.\nThe incident drew criticism from the US state department. Spokesman Vedant Patel said: “We deplore today’s attack on the UN’s Khan Younis training centre. Civilians must be protected, and the protected nature of UN facilities must be respected, and humanitarian workers must be protected so that they can continue providing civilians with the life-saving humanitarian assistance that they need.”\nAfter the US criticism, Israel denied that its forces were responsible and suggested Hamas may have launched the shells.\nApproximately 88,000 Palestinians live in Khan Younis, which is also hosting an estimated 425,000 people displaced by fighting elsewhere in the tiny coastal territory.\nAbout 18,000 people were believed to be sheltering in the grounds of Nasser hospital alone, Ocha said, along with 850 patients.\n“No one can enter or exit [Nasser] due to ongoing bombardments,” the agency added, citing medics who also reported that staff were digging graves in the grounds of the facility “due to the large numbers of fatalities anticipated”.\nNasser hospital is one of only two in the southern half of Gaza that can still treat critically ill patients. The siege reports were also confirmed by Doctors Without Borders and the Hamas-run territory’s health ministry.\nIsrael has ordered residents to leave a swath of central Khan Younis that includes the three hospitals as it pushes ahead with the offensive against Hamas, triggered by the group’s unprecedented attack on Israel in which 1,140 people were killed and approximately 240 seized as hostages.\nMore than 25,700 people in Gaza had now been killed in the aerial and ground fighting, local authorities said on Wednesday.\nAbout 85% of the besieged strip’s population of 2.3 million people have been displaced from their homes, and are now dealing with cold, hunger and disease in unsanitary and chaotic makeshift displacement camps.\nIn a video published by ITV News, a man the reporter had just interviewed, one of a group of five with a white flag, was shot dead by Israeli soldiers despite holding his hands above his head.\nThe Israel Defense Forces said in a comment that it “categorically denies any existence of ‘field executions’” and says Hamas using Gaza’s population as human shields is to blame for the operation’s devastating civilian death toll. The group denies the allegation.\nDuring November’s week-long ceasefire, 110 hostages were released in exchange for 240 Palestinian women and children held in Israeli prisons, but multiple rounds of US, Egypt and Qatar-led negotiations, also focused on facilitating aid into Gaza, have since failed.\nA Hamas delegation that travelled to the Egyptian capital on Tuesday night remained there on Wednesday as talks continued, an Egyptian security source said, but Israeli sources told the Hebrew-language press that the parties were still far from agreeing terms.\nThe current deal under review is believed to include a pause in fighting that will last 30 days, in which Israeli hostages are to be freed in several instalments, but Israeli spokesperson Eylon Levy said on Tuesday that the country would not agree to any terms in which Hamas remained in power in Gaza.\nHamas has “absolutely” rejected Israel’s offer to end the war if six senior leaders in the Gaza Strip agree to go into exile, Reuters reported, and has reiterated that Israel must agree to a permanent end to the fighting as part of any hostage deal.\nIsrael’s prime minister, Benjamin Netanyahu, was criticised last week for reiterating his opposition to an independent Palestinian state, a stance at odds with the US, Israel’s most important ally, which says it is determined to restart peace talks aimed at a two-state solution to the decades-old Israeli-Palestinian conflict.\nJoe Biden has expended vast amounts of international and domestic political capital in defending Israel’s war effort, despite global outcry over the conflict’s devastating humanitarian toll.\nSupport for the war remains high among Israelis, but opinion polls show lagging support for Netanyahu and his far-right coalition. Weekly rallies on Saturday nights demanding the release of hostages have been supplemented in recent weeks by growing calls for elections.\nTuesday’s killing of 21 Israeli soldiers who were mining buildings for demolition and were hit by grenade fire – the deadliest single incident for Israeli forces in the conflict to date – has augmented public dissent over the war.\nThe longer the violence in Gaza drags on, the more the risk of regional escalation grows.\nThe fighting has already drawn in Iranian proxy groups in Yemen, Syria and Iraq, and led to retaliatory US airstrikes around the region. A new conflict with the Lebanese group Hezbollah on Israel’s northern border, where clashes that began in October have intensified in recent weeks, is widely viewed as the most dangerous flashpoint.\nOn Tuesday, Hezbollah said it had struck the Israeli air control base on the strategically important Mount Meron for a second time in recent weeks, in response to what it said were Israeli “assassinations” and attacks on civilians.", "source_domain": "www.theguardian.com", "text": null, "title": "Thousands trapped in Gaza hospitals as Israeli troops encircle Khan Younis", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/24/thousands-trapped-in-gaza-hospitals-as-israeli-troops-encircle-khan-younis"}