{"authors": [], "date_download": "2024-02-05 15:36:15", "date_modify": "None", "date_publish": "2023-11-21 07:15:55", "description": "Rafale jets equipped with advanced sensors couldn’t find UFO evidence as airport ops grounded for hours", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fasia%2Findia%2Findia-ufo-sighting-imphal-airport-rafale-jets-b2450811.html.json", "image_url": "https://static.independent.co.uk/2023/11/21/04/newFile.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nIndia’s air force scrambled two fighter jets on Sunday to investigate the sighting of an Unidentified Flying Object (UFO) near an airport.\nAn alert was issued by security forces after the UFO sighting was reported from the northeastern state of Manipur at about 2.30pm local time.\nThe Indian Air Force (IAF) also halted flight operations at state capital Imphal’s Bir Tikendrajit International Airport for several hours.\nThe object “was visible with bare eyes”, an unnamed official from one of India’s federal police agencies reportedly said.\n“IAF activated its Air Defence response mechanism based on visual inputs from Imphal airport,” said a post on X by the IAF. “The small object was not seen thereafter.”\nIndian authorities have not revealed specific details of their investigation of the UFO sighting.\nA video on social media showed a small white dot on the skyline near the airport. The Independent could not verify the authenticity of the video.\nRafale fighter jets were dispatched to investigate the object from the Hashimara airbase in the eastern state of West Bengal.\n“Soon after information about the UFO near the Imphal airport was received, a Rafale fighter aircraft from a nearby airbase was scrambled to go and search for the UFO,” a defence official was quoted as saying by news agency ANI.\nThe jet returned and another one was later sent to investigate.\nReports said the second fighter jet also returned without finding any evidence of a UFO.\nThe fighter jets were equipped with advanced sensors and carried out low-level flying over the suspected area near the airport, but didn’t find anything suspicious.\n“The UFO was visible with bare eyes moving westwards of the airfield [at the Imphal airport] till 4 pm,” an official from India’s Central Industrial Security Force was quoted as saying by news agency PTI.\nInvestigation operations took several hours and flights at the Imphal airport resumed operations only after 5.30pm on Sunday, after authorities received clearance from the IAF.\nTwo flights were diverted from the airport and three departing flights were delayed before operations were allowed to resume.", "source_domain": "www.independent.co.uk", "text": null, "title": "India scrambles fighter jets to investigate UFO sighting as airport halts flights", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/asia/india/india-ufo-sighting-imphal-airport-rafale-jets-b2450811.html"}