{"authors": ["Nick Pisa", "Nick Pisa In Jerusalem", "Miriam Kuepper"], "date_download": "2024-02-05 15:36:15", "date_modify": "None", "date_publish": "2023-11-21 19:47:20", "description": "Officials have been thrashing out a settlement in Qatar for several weeks now, and Israeli PM Benjamin Netanyahu addressed his cabinet tonight to discuss a temporary ceasefire.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12776701%2FIsrael-Hamas-brink-deal-free-dozens-hostages-kidnapped-terrorists-October-7-attack-Netanyahu-summons-cabinet-discuss-five-day-ceasefire-allow-release-50-women-children.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/21/19/78076559-0-image-a-17_1700596028999.jpg", "language": "en", "localpath": null, "maintext": "A deal to release a small group of hostages seized by Hamas terrorists last month appeared to be on the cards tonight.\nOfficials have been thrashing out a settlement in Qatar for several weeks now, and Israeli PM Benjamin Netanyahu addressed his cabinet tonight to discuss a temporary ceasefire to allow an exchange.\nHowever, there was a possible fly in the ointment as Israel's far-right Otzma Yehudit party said it would oppose any release and instead urged the Israel Defense Forces to continue its military pursuit of Hamas.\nOfficials from the CIA and Israeli intelligence service Mossad were said to have been involved in the talks in Qatar, and ahead of the cabinet meeting Mr Netanyahu had said: 'I hope there will be good news soon.'\nMeanwhile the Palestinian terror group Islamic Jihad has announced the death of one of the Israeli hostages it has held since the October 7 attacks on Israel.\nThey said: 'We previously expressed our willingness to release her for humanitarian reasons, but the enemy was stalling and this led to her death.'\nReports online named the hostage as 76-year-old Katzir Hanna, kidnapped from the Nir Oz kibbutz, and a source close the families said simply: 'She is no longer with us.'\nOfficials have been thrashing out a settlement in Qatar for several weeks now, and Israeli PM Benjamin Netanyahu (pictured) addressed his cabinet tonight to discuss a temporary ceasefire to allow an exchange\nThis comes as families of hostages and their supporters demanded that Netanyahu secures the release of Israeli hostages (pictured: protesters in Tel Aviv)\nNetanyahu addressed his cabinet to discuss a temporary ceasefire to allow an exchange, as currently the Gaza Strip is under Israeli bombardment (pictured above in northern Gaza today)\nHamas leader Ismail Haniyeh said: 'We are close to reaching a deal on a truce.' Similarly US President Joe Biden commented that he believed a deal was 'now very close'.\nIn his address to the cabinet, Netanyahu said that accepting a deal for the release of hostages was 'a difficult decision but it's a right decision'.\nPresident Biden had helped 'improve the framework being laid out before you... to include more hostages at a lower price', he told his cabinet as it met to vote on the deal. 'The entire security establishment fully supports it.'\nThe hostages' families have demanded that Israel should insist on the return of all those being held, and the Religious Zionist party, which is part of Netanyahu's coalition government, has voiced opposition to the deal, denouncing it as 'bad' for Israel's security, for the hostages and soldiers.\nSources from Hamas and Islamic Jihad, which also participated in the attacks, said on condition of anonymity that the tentative agreement would include a five-day truce, comprised of a complete ceasefire on the ground and an end to Israeli air operations over Gaza, except in the north, where they would only halt for six hours daily.\nUnder the deal, which the sources said could yet change, between 50 and 100 Israeli and dual-national civilians of the estimated 239 hostages would be released in exchange for some 300 Palestinian women and children currently held in Israeli jails.\n'It will allow the IDF to prepare for a continuation of the fight - the war is ongoing, and it will continue until we achieve all of our objectives: destroying Hamas and bringing back all the hostages,' Netanyahu said.\nThere was speculation tonight that Irish-Israeli Emily Hands, who celebrated her ninth birthday in captivity, would be among those released.\nInitially it had been thought Emily was murdered - with her father Thomas saying she hoped she has been and then the family was notified she was alive.\nIsraeli named her as among the first handful of hostages earmarked for release but there was no official confirmation.\nInitially the plan would be for women and children to go free first and in exchange, Palestinian prisoners held in Israel would go the other way.\nHowever an Israeli government official said that any prisoner put forward for release could have the decision overturned if families of victims of their crimes opposed it.\nThe spokesman said: 'If any of the these prisoners have blood on their hands, then the families of their victims have 24 hours to oppose their release by applying to the Supreme Court.'\nGil Dickmann (left) watches as Hen Avigdori (centre) speaks against the proposed legislation. This comes as hostages' families clashed with Israeli politicians over talk of death penalty\nAn Israeli tank on its way to Gaza Strip, in southern Israel, today\nSimilarly US President Joe Biden (pictured) commented that he believed a deal was 'now very close'\nIt is hoped that hostages will be released from Thursday and Friday and that part of the deal would include a six hour drone blackout by the IDF.\nIDF Spokesman Rear Adm. Daniel Hagari suggested the hostage deal taking shape, will not impact the military's main goal of eliminating the Hamas terror group.\nHe said: 'The goal of returning the hostages is significant. Even if it results in the reduction of some of the other things, we will know how to restore our operational achievements.'\nHe added the military will 'first update the families of the hostages, and then the public'.\nMeanwhile Hamas sources said that they had lost touch with 'some groups holding hostages' and they wanted the no fly clause so they could carry out searches without being spied on from the skies.\nIn return for releasing hostages, Hamas are said to want the return of around 300 Palestinians but opposition parties in Israel fear that giving too much will see the terrorists gain the upper hand.\nThe far right fear that soldiers, who are not included in any deal, will be kept on for months or possibly years as was Gilad Shalit, held for five years before being released in 2011 in a prisoner swap.\nThe parents and relatives of children kidnapped on October 7th take part in a demonstration outside the UNICEF headquarters in Tel Aviv to protest their silence to 40 children held hostage in Gaza\nMail Online reporter Nick Pisa pictured in the Netiv Haasara kibbutz, the closest Israeli settlement to the Gaza Strip, which was attacked on October the 7th. He is standing next to the border wall that separates the kibbutz from the Gaza Strip\nThis is the wall that separates the Netiv Haasara kibbutz, the closest Israeli settlement, from the Gaza Strip\nA picture taken from a position near Sderot along the Israeli border with the Gaza Strip shows smoke billowing during an Israeli bombardment on Gaza\nThe announcements tonight are the most optimistic yet of a potential breakthrough in the conflict, which has raged for more than six weeks and left thousands dead on both sides.\nIn Qatar, foreign ministry spokesman Majed Al-Ansari said 'we're very optimistic, very hopeful' and told reporters: 'We are at the closest point we ever had been in reaching an agreement.'\nIsraeli Prime Minister Benjamin Netanyahu, who has vowed to destroy Hamas, was more circumspect, telling soldiers at a base only that 'we are making progress' on the return of hostages.\nPresident Biden, who does not support a full ceasefire, said a temporary truce was 'now very close', adding: 'We could bring some of these hostages home very soon. But I don't want to get into the details of things because nothing is done until it's done.'\nBritish-Israeli Sharone Lifschitz, whose mother Yocheved, 85, was released by Hamas late last month but whose father is still being held was 'hopeful' of a deal.\nShe said: 'We haven't been informed of anything and we only learn of things from the media.\n'There seems to be a deal and the government will go for it and a small number will be released every day but we don't know who, we assume children and mothers and then it will continue.\n'Everyone is incredibly anxious at the moment, but I think it must be the children who go first and they shouldn't be separated from their mothers.\n'But this is all part of Hamas plan to put us through an impossible situation, its a form of psychological torture.'\nMrs Lifschitz added any exchange would be through the Rafah crossing in the south and she said: 'It usually starts with a small handful to see how things go from that, but the children should come first.'\nBut Ayelet Svatitzky, whose British brother Nadav Popplewell, 51, was among the hostages, was not as hopeful she said: 'We have been here so many times before but I am not going to get my hopes up.\n'I am shutting myself out of this until we get some news, we have been talking about this for days and I know it's more advanced but until I get specific news I am not going to say anything because otherwise I will crash and burn.'\nAlthough a temporary halt may come as a welcome relief it is unlikely that it will mark an end to the conflict which has seen more than 14,000 Palestinians killed and 68 Israeli soldiers lost.\nSmoke and flame rise in Gaza seen from Sderot, Israel, as Israeli attacks continue on the 46th day of the war\nPortraits of Israeli hostages held in Gaza since the October 7 attack by Hamas militants in Tel Aviv\nThe release of hostages seized by Hamas could be approved by the Israeli government within 'hours' of a hostage deal being agreed, a senior adviser to Benjamin Netanyahu has said. Pictured: Israel soldiers transfer detained Palestinians out of the Gaza Strip on November 21\nIsraeli soldiers operate in a location given as Gaza, amid the ongoing ground operation of the Israeli army against Hamas, in this image released on November 21\nSmoke, rising over the destroyed buildings following the Israeli attacks on Gaza, is seen from the southern city of Sderot in Israel on November 21\nPortraits of Israeli children hostages are displayed during a rally outside the Unicef offices in Tel Aviv on November 20, 2023 to demand the release of Israelis held hostage in Gaza\nIsraeli media reported tonight that among those killed in Gaza was Jamal Muhammad Haniyeh grandson of Hamas leader in exile in Qatar Ismail Haniyeh.\nHopes of a release deal have been mounting since Qatar on Sunday said only 'minor' practical issues remained.\nSpeculation grew further when the International Committee of the Red Cross, which is often involved in prisoner exchanges and hostage releases, said Monday its president had met Haniyeh in Qatar.\nDespite talk of a temporary truce, fighting raged on in Gaza's bloodiest ever war, sparked by the October 7 attack in which Israel says Hamas gunmen killed around 1,200 people, mostly civilians.\nIn retaliation, Israel launched a relentless bombing campaign and ground offensive in Gaza. According to the Hamas government, the war has killed more than 14,100 people, including nearly 6,000 children and close to 4,000 women.\nSources from Hamas and Islamic Jihad, which also participated in the attacks, said on condition of anonymity that their groups had agreed to the terms of a truce deal.\nThe tentative agreement would include a five-day truce, comprised of a complete ceasefire on the ground and an end to Israeli air operations over Gaza, except in the north, where they would only halt for six hours daily.\nUnder the deal, which the sources said could yet change, between 50 and 100 Israeli civilian and foreign hostages would be released, but no military personnel.\nIn exchange, some 300 Palestinians would be freed from Israeli jails, among them women and minors.\nBut the Religious Zionist party, part of Netanyahu's coalition government, voiced opposition to the deal, saying 'it is bad' for Israel's security, for the hostages and soldiers.\nThe BRICS group of nations including Russia, India and China called for an 'immediate, durable, and sustained humanitarian truce leading to a cessation of hostilities' in Gaza aimed at drawing up a common response to the conflict.\nRafah resident Hamza Abdel Razeq said a ceasefire would bring some respite for Gazans who have endured Israel's bombing and expanding ground offensive.\n'The people are really suffering,' he said. 'If they reach a five-day truce deal now, I believe it will pave the way for longer truces or even a total ceasefire.'\nAnother resident, Mahmud Abu Najm, added: 'We... pray to God for its success because the people are enduring an unbearable situation.'\nLarge parts of Gaza have been flattened by thousands of air strikes, and the territory is under siege, with minimal food, water and fuel allowed to enter.\nIsrael's Prime Minister has said the country is 'making progress' in the deal that is reportedly being mediated through Qatari officials. Israeli soldiers are seen taking detained Palestinians out of the Gaza Strip, November 21\nSmoke rises after Israeli air strikes in Gaza, as seen from southern Israel, amid the ongoing conflict\nHamas officials are 'close to reaching a truce agreement' with Israel and the group has delivered its response to Qatari mediators, Ismail Haniyeh (right) said in a statement. Pictured with Iran's Foreign Minister Hossein Amir-Abdollahian on 31 October\nParents and relatives of those kidnapped on October 7 protested in Tel Aviv yesterday\nA child injured in the attacks is brought to Nasser Hospital for treatment in Khan Yunis, Gaza, yesterday\nA Palestinian woman is pictured in front of the damage following Israeli strikes on Rafah, on the southern Gaza Strip, on November 20\nAccording to the Hamas and Islamic Jihad sources, the proposed deal would also allow for up to 300 trucks of food and medical aid to enter Gaza.\nIsrael has vowed to press on with its offensive, pledging to crush Hamas and ensure the hostages are released.\nThe Israeli military, meanwhile, said air strikes had hit 'around 250' Hamas targets in the past day, destroying three underground shafts in the Jabalia area, which it said it had fully surrounded.\nTwo soldiers were killed in northern Gaza, it added.\nIn Lebanon, official media said two journalists from Al-Mayadeen television and two other civilians were killed in cross-border shelling in the south. Israel said it was 'looking into the details' of the incident.\nThe Committee to Protect Journalists said 53 journalists and media workers have been killed in the war.\nMeanwhile, the health ministry in the occupied West Bank said the Israeli army killed one Palestinian in Nablus.\nMedics and patients have been increasingly caught up in the fighting, as Israel expanded its operation across northern Gaza.\nThe Hamas-run health ministry said Israel had laid siege to and hit the Indonesian Hospital in Jabalia on Monday, killing dozens, but there was no independent confirmation of the toll.\nThe Israeli army said later its troops had 'directly targeted' the source of fire from within the Indonesian Hospital.\nTwenty-eight premature babies from Gaza's largest hospital, Al-Shifa, were taken to Egypt for treatment on Monday. Three others remained in southern Gaza, the World Health Organization said on Tuesday. Two babies died before the evacuation, it said.\nThe Indonesian Hospital lies near Gaza's largest refugee camp Jabalia, which has been the scene of intense Israeli bombing.\nThe health ministry official said there were still about 400 patients inside the hospital, as well as 2,000 people seeking shelter.\nTwenty-eight premature babies from Gaza's largest hospital, Al-Shifa, were taken to Egypt for treatment on Monday\nPortraits of Israeli hostages posted on a wall in Tel Aviv today as hostages' families the government brings their loved ones home\nThree others remained in southern Gaza, the World Health Organization said on Tuesday. Two babies died before the evacuation, it said. (pictured: Health care officials receive 28 of the 31 babies in Egypt)\nPrior to the meeting, a spokesperson for the families said: 'It's been six weeks and two days that our beloved ones are in Gaza. We don't know how they feel, if they are healthy, if they are alive we have no information, zero information'\nPeople light candles at a memorial for Hamas hostages in Tel Aviv today\nIsraeli soldiers inspect houses destroyed by Hamas fighters in the Kibbutz Nir Oz in southern Israel\nCivil defence teams and residents make search and rescue efforts following an Israeli attack in Deir al-Balah, Gaza\nPeople are looking for survivors following an air strike today in Deir al-Balah, Gaza\nA Palestinian woman hangs clothes amid debris in Khan Yunis in the southern Gaza Strip today\nAround 200 people were evacuated from the hospital on Monday and bussed to the relative safety of a hospital in Khan Yunis in southern Gaza.\nDoctors Without Borders (MSF) said three doctors, including two it employed, were killed in an Israeli strike on the Al-Awda hospital in Jabalia refugee camp.\nIsrael says Hamas uses medical facilities to hide fighters and as bases for operations, making them legitimate military objectives, while insisting it does everything possible to limit harm to civilians.\nBut criticism of Israel's conduct of the war has grown, from international agencies and some governments, with protests held worldwide.\nThe WHO said it was 'appalled' by the strike on the Indonesian Hospital, calling it just one of 164 documented attacks on health facilities and workers since the war began.\nThe UN children's agency, meanwhile, warned that fuel shortages and worsening sanitation in Gaza were shaping up to be 'a perfect storm for tragedy' through the spread of disease.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel and Hamas 'on brink of deal' to free dozens of hostages kidnapped by terrorists during October 7 attack: Netanyahu summons cabinet to discuss 'five-day ceasefire to allow release of 50 women an", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12776701/Israel-Hamas-brink-deal-free-dozens-hostages-kidnapped-terrorists-October-7-attack-Netanyahu-summons-cabinet-discuss-five-day-ceasefire-allow-release-50-women-children.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}