{"authors": ["Laura Parnaby", "Laura Parnafor Dailymail.Com"], "date_download": "2024-02-05 15:36:17", "date_modify": "None", "date_publish": "2023-11-21 15:49:39", "description": "The Pentagon has confirmed the attack by 'Iran-backed militias' early on Tuesday resulted in 'eight injuries and some minor damage to infrastructure'.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12775853%2FU-S-forces-attacked-Iraq-airbase-respond-self-defence-U-S-officials.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/21/16/78069583-0-The_attack_against_Ain_al_Asad_caused_minor_injuries_and_damage_-a-41_1700584301143.jpg", "language": "en", "localpath": null, "maintext": "Several US and allied soldiers have been injured in a close-range ballistic missile attack on Ain al-Asad Airbase west of Baghdad.\nThe Pentagon confirmed the attack by 'Iran-backed militias' early on Tuesday resulted in 'eight injuries and some minor damage to infrastructure'.\nBrigadier General Pat Ryder said US soldiers retaliated by using an AC-130 gunship to defend themselves - killing multiple militiamen.\n'We can confirm an attack last night by Iran-backed militias using a close-range ballistic missile against US and coalition forces at Al-Asad Airbase, which resulted in eight injuries and some minor damage to infrastructure,' Ryder said.\n'Immediately following the attack, a US military AC-130 aircraft in the area conducted a self-defense strike against an Iranian-backed militia vehicle and a number of Iranian-backed militia personnel involved in this attack.\n'This self-defense strike resulted in several enemy KIA (killed in action).'\nSeveral US and allied soldiers have been injured in a close-range ballistic missile attack on Ain al-Asad Airbase west of Baghdad\nThe Pentagon has confirmed the attack by 'Iran-backed militias' early on Tuesday resulted in 'eight injuries and some minor damage to infrastructure'\nSpokesman Brigadier General Pat Ryder said US soldiers retaliated by using an AC-130 to defend themselves - killing multiple militiamen\nThe AC-130 aircraft used to respond was already in the air and struck a vehicle, Pentagon spokesperson Sabrina Singh said.\nShe added that the aircraft was able to determine the point of origin and hit the militants because they could keep an eye on their movements.\nThis is the first public retaliation on Iraqi territory to the recent militant drone and missile attacks on U.S. troops, but Singh said there had been previous responses that had not been announced.\nThe United States had so far limited its response to the 66 attacks against its forces in Iraq and neighboring Syria, claimed by Iran-aligned Iraqi militia groups, to three separate sets of strikes in Syria.\nAt least 62 U.S. personnel have suffered minor injuries or traumatic brain injuries in the attacks.\nThe attacks began on Oct. 17 and have been linked by Iraqi militia groups to U.S. support for Israel in its bombardment of Gaza following attacks by Palestinian militant group Hamas on Israel.\nThe attacks against U.S. targets have ended a year-long unilateral truce that Iraqi factions, some formed in the aftermath of the 2003 U.S. invasion to fight U.S. troops and others in 2014 to fight Islamic State, declared with Washington.\nSocial media accounts linked to Iran-aligned Iraqi militias published a statement in the name of the \"Islamic Resistance in Iraq\" mourning a member who they said had been killed in battle against U.S. forces on Tuesday, without elaborating.\nHis killing is the first reported casualty in Iraq linked to the Gaza war, which has drawn in other factions in Iran's network of regional militias, known as the Axis of Resistance, such as Lebanon's Hezbollah.\nThe United States has 900 troops in Syria and 2,500 in Iraq on a mission it says aims to advise and assist local forces trying to prevent a resurgence of Islamic State, which in 2014 seized large swaths of both countries before being defeated.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "U.S. forces attacked at Iraq airbase, respond in...", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12775853/U-S-forces-attacked-Iraq-airbase-respond-self-defence-U-S-officials.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}