{"authors": [], "date_download": "2024-02-05 15:36:18", "date_modify": "None", "date_publish": "2023-11-21 13:59:17", "description": "Airstrikes hit home of Gaza photojournalist targeted by pro-Israel media group", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-gaza-journalist-honestreporting-b2450776.html.json", "image_url": "https://static.independent.co.uk/2023/11/20/23/06089ca204e14005aa61db3d631e1624.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nDeadly airstrikes reportedly hit the home of a Palestinian photojournalist targeted by a group that monitors media outlets for critical coverage of Israel, days after the group published a speculative report that questioned if he had prior knowledge of the 7 October attack by Hamas.\nYasser Qudih, among photojournalists scrutinised by Israeli media advocacy group HonestReporting, survived the attack, but at least seven family members were killed, according to Reuters.\nThe attack in Gaza on 13 November arrived five days after the HonestReporting report asked whether photojournalists who captured the aftermath of the Hamas attack coordinated with Hamas or were “part of the plan”; HonestReporting later admitted there was no evidence to defend those suggestions and said that the group was merely “raising questions”.\nThose accusations were also aimed at some of the world’s largest news organisations, including Reuters, The New York Times, Associated Press and CNN, which have categorically denied the allegations.\nMr Qudih’s images of the war are published widely across media outlets covering Israel’s seige. In a statement following reports of the attack on his home, Reuters condemned the “baseless accusations” from HonestReporting.\n“Thereafter, numerous threats against his safety circulated online. HonestReporting later accepted that its accusations were unfounded,” according to Reuters.\n“The situation on the ground is dire, and the [Israel Defense Forces’] unwillingness to give assurances about the safety of our staff threatens their ability to deliver news about this conflict without fear of being injured or killed,” the statement added.\nDespite the spurious claims in the HonestReporting report, Israeli Prime Minister Benjamin Netanyahu’s office told news outlets that hired those journalists that they were “participants in this horrifying event”.\nIsrael’s former defence minister Benny Gantz also suggested that if journalists knew of the attack beforehand, they are “no different than terrorists and should be treated as such.” Danny Danon, former Israeli ambassador to the United Nations, promised to “hunt them down together with the terrorists.”\nRepublican US Senator Tom Cotton also called on the US Department of Justice to investigate news outlets for “federal crimes by supporting Hamas terrorists.”\nA letter from general counsel with The New York Times to Mr Cotton said his reliance on “disinformation” and “falsehoods” should “not be abused by a US senator to falsely accuse fellow Americans of crimes.”\nThe company also issued a statement condemning “reckless” allegations that are “putting our journalists on the ground in Israel and Gaza at risk.”\nMr Qudih told Reuters that the four strikes on his two-storey home in Khan Yunis in southern Gaza were seconds apart. He said roughly 20 people were inside during the strike, which left an impact crater in a yard behind the house and destroyed a side of the building.\nHis in-laws, two nieces aged 13 and eight, and an eight-year-old nephew were killed, according to a post shared on his Instagram profile.\nPhotojournalist Belal Khaled captured the burial of his family members.\nA statement from the IDF to Reuters declined to say whether the agency was responsible or whether Mr Qudih was a target.\n“The IDF is currently focused on eliminating the threat from the terrorist organization Hamas. Questions of this kind will be looked into in a later stage,” IDF said in a statement to Reuters.\nPalestinian journalists carried mock coffins of journalists killed during the war at a symbolic funeral in the West Bank on 7 November. (AP)\nGaza’s health ministry has reported more than 13,000 dead since 7 October, including more than 5,500 children. Israel’s ongoing bombardments and military siege in Gaza have marked the deadliest period for journalists in more than 30 years.\nAt least 50 journalists, including 45 Palestinian media workers, have been killed in the aftermath of Hamas attacks last month, as of 20 November. At least four Israeli journalists and one Lebanese reporter also have been killed.\nAt least 11 journalists were injured, three journalists were reported missing, and 18 journalists were arrested, while Palestinian media workers have reported widespread threats and cyberattacks against them, and reported targeted killings of their family members, according to the Committee to Protect Journalists.\nBelal Jadallah, a prominent journalist in Gaza and the director of the nonprofit media group Press House Palestine, was killed and his pharmacist brother-in-law was seriously wounded during an Israeli attack on Sunday, according to his family.\nTor Wennesland, the United Nations’ special coordinator for the Middle East peace process, said he was “shocked and saddened to learn” of the death of Jadallag, a “professional, knowledgeable [and] passionate journalist who dedicated his life for the freedom of journalism [and] protection of journalists.”\nThe Independent’s request for comment to HonestReporting was directed to a statement from 12 November, in which the group said it “stands behind the legitimate questions we raised to media outlets in our recent exposé.”\n“We are proud of the role that we play in holding the media accountable. How journalists frame events in and about Israel affect the safety of Jews worldwide; so we will continue to ensure that anti-Israel bias in mainstream media is exposed,” the statement reads.\n“Despite HonestReporting’s recent backpedaling, it’s a virtual certainty that their irresponsible speculation will be cited to justify past and future violence against the press,” Seth Stern, director of advocacy with the Freedom of the Press Foundation, told The Independent earlier this month.\n“They’ve put journalists’ lives at risk,” he added. “And it’s disgraceful for politicians … to cite the spurious report to call for violence against journalists and baseless investigations of news outlets.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Airstrikes hit home of Gaza photojournalist targeted by pro-Israel media group", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-journalist-honestreporting-b2450776.html"}