{"authors": [], "date_download": "2024-02-05 15:36:33", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "A major Russian drone attack struck infrastructure facilities causing power outages in more than 400 towns and villages throughout the country, Ukrainian", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274038000%2Frussian-drone-attack-targets-energy-facilities-at-onset-of-winter.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700337966.jpg", "language": "en", "localpath": null, "maintext": "A major Russian drone attack struck infrastructure facilities causing power outages in more than 400 towns and villages throughout the country, Ukrainian officials said Saturday.\nUkraine air defenses shot down 29 of 38 Iranian-made Shahed drones launched from Russian territory from 8 p.m. Friday to 4 a.m. Saturday.\nThe energy ministry said 416 settlements in the Odesa region in the south and in the Zaporizhzhia region in the southeast were cut off from electricity after networks were damaged in the strikes. An oil refinery was also hit in the Odesa region.\nAn administrative building was also damaged, and one civilian was wounded in the strike, the south military command said in a statement on the Telegram messaging app.\nIn Ukraine's northern Chernihiv region, on the border with Russia and Belarus, two infrastructure buildings were damaged during the overnight strike, the military said.\nThe energy ministry said six settlements were without power in the Chernihiv region.\nThe drones also targeted Kyiv in the second attack so far this month, officials said, adding that all drones heading to the capital were shot down.\nOfficials have urged residents and businesses to prepare for renewed Russian attacks on the energy infrastructure with the onset of winter.\nGround combat\nOn Saturday, the British Defense Ministry said in its daily intelligence update on Russia's invasion of Ukraine that over the past week there has been intense ground combat in three areas - the Kupiansk axis in Luhansk oblast, Avdiivka in Donetsk oblast, and on the left bank of the Dnipro River in Kherson oblast, where Ukrainian forces have established a bridgehead.\nWhile Russia had 'particularly heavy casualties' around Avdiivka, the report said, neither side has achieved much progress in any of the locations.\nUkraine's military said on social media Friday that it had gained 'a foothold on several bridgeheads' on the eastern bank of the Dnipro River, near the key southern city of Kherson.\nUkrainian troops are trying to push Russian forces away from the Dnipro to stop them from shelling civilian areas on the Ukrainian-held west bank, the general staff of the Ukrainian Armed Forces said in a report Friday.\nRussia conceded that Ukrainian forces had claimed back some territory on the opposing bank.\nMedia crackdown continues\nThe Moscow Times, an online newspaper popular among Russia's expatriates, was added Friday to the list of 'foreign agents' by Russia's Justice Ministry. This was the latest addition in Russia's continuing crackdown on news media and opposition critical of its war in Ukraine.\nThe foreign agent designation subjects individuals and organizations to increased financial scrutiny and requires any of their public material to prominently include notice of being declared a foreign agent. The label aims at undermining the designee's credibility.\nIt was not immediately clear how the move would affect The Moscow Times, which moved its editorial operations out of Russia in 2022 after the passage of a law imposing stiff penalties for material regarded as discrediting the Russian military and its war in Ukraine.\nRussia has methodically targeted people and organizations critical of the Kremlin, branding many as foreign agents and some as 'undesirable' under a 2015 law that makes membership in such organizations a criminal offense.\nThe Moscow Times publishes in English and in Russian, but its Russian-language site was blocked in Russia several months after the Ukraine war began.\nUkraine EU membership\nHungary's Prime Minister Viktor Orban reiterated his government's opposition to Ukraine's EU membership talks. He told a congress of his Fidesz party Saturday, that 'Ukraine is light years away from the EU now,' adding that he would fight off attempts by the EU to settle migrants in Hungary.\nOrban, who has been locked in a dispute with Brussels over EU funds frozen because of his government's democratic backsliding, this week said the EU's strategy of sending money and military aid to Ukraine had failed, and that he opposed starting membership negotiations with Kyiv.\nFor Ukraine, its accession into the EU is a top priority. Membership talks will be on the agenda at an EU summit next month.\nHowever, the membership talks are 'at risk,' a senior official in the EU bloc said on Friday, quoting Hungarian resistance potentially obstructing the unanimity of 27 EU countries as one reason.\nWith Hungary clambering out of an inflation crisis, nationalist Orban has this week started campaigning heavily for European parliamentary elections due next June.\n'We will resist the crazy ideas of Brussels bureaucrats, the migrants' invasion, the gender propaganda, and we will resist the illusions over the war (in Ukraine) and Ukraine's unprepared EU membership,' Orban told his party, which has been in government since 2010.\nThere is also no agreement in the bloc to grant Kyiv a further $54 billion in aid, the senior official, who spoke on the condition of anonymity, said Friday.\nThe proposal by the bloc's executive European Commission to revise its long-term budget to assign the funds for Ukraine through 2027 was also criticized from several sides, said the official.\n'Leaders ... were realizing it's quite expensive,' said the official, who is involved in preparing a December 14-15 summit in Brussels of the 27 EU member states' national leaders. 'How do we pay for this?'\nThe downbeat comments reflect the increasing fatigue and gloomier mood setting in among Kyiv's Western backers as the war drags on.\nSome information in this report came from The Associated Press and Reuters.", "source_domain": "www.theuknews.com", "text": null, "title": "Russian Drone Attack Targets Energy Facilities at Onset of Winter", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274038000/russian-drone-attack-targets-energy-facilities-at-onset-of-winter"}