{"authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "date_download": "2024-02-05 15:36:35", "date_modify": "None", "date_publish": "2023-11-21 22:50:01", "description": "The White House on Tuesday said the Kremlin-backed mercenary Wagner group was preparing to provide air defense support to Tehran-backed Hezbollah forces.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12777025%2FUS-fears-Wagner-mercenaries-preparing-bolster-Hezbollahs-air-defenses-Lebanon-Middle-East-tensions-reach-boiling-point-America-conducted-airstrike-Iraq.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/21/21/78083167-0-image-a-8_1700603646412.jpg", "language": "en", "localpath": null, "maintext": "The White House on Tuesday called out growing military ties between Russia and Iran, and said the Kremlin-backed mercenary Wagner group was preparing to provide air defense support to Tehran-backed Hezbollah forces.\nWhite House national security spokesman John Kirby released the information Tuesday, following repeated warnings by President Biden and top U.S. officials for other actors to avoid exploiting Israel's war on Hamas in Gaza.\nIsrael is hoping to avoid an expanded front in Lebanon while it continues its effort to its efforts in Gaza. At the same time, U.S. forces in the region have reported experiencing dozens of attacks from Iranian-backed proxies.\n'Our information further indicates that Wagner, at the direction of the Russian government, was preparing to provide an air defense capability to either Hezbollah or Iran,' Kirby told reporters Tuesday.\nHe said the U.S. would 'closely monitor for whether Wagner provides military equipment to either Hezbollah or Iran. We're certainly prepared to use our counterterrorism sanctions authorities against Russian individuals or entities that might make these destabilizing transfers,' he said.\nCNN previously reported that Wagner Group, formerly run by the late Putin ally-turned rival Yevgeny Prigozhin, had been told to deliver SA-22 missile defense systems from Syria to Hezbollah forces inside Lebanon.\nThe Tehran-backed group has a robust military presence and tens of thousands of missiles.\nKirby also ran through Iran's military ties with the Kremlin, including a deal to purchase SU-35 fighter jets from Russia, along with efforts to purchase attack helicopters, radars and other materiel.\nNational security spokesman John Kirby made the accusations during a White House press call\nThe White House said Russian Wagner Group mercenaries were prepared to help Hezbollah or Iran\nWagner forces have been among the more effective forces in Russia's Ukraine war\nEarlier this year, Iran announced that it finalized the deal to buy su 35 fighter jets from Russia. Iran is seeking to purchase additional military equipment from Russia including attack helicopters, radars, and combat trainer aircraft. In total, Iran is seeking billions of dollars worth of military equipment from Russia to strengthen its military capabilities.\nMeanwhile, Russia 'has also been helping Iran develop and maintain its satellite collection capabilities and other space based programs,' he said.\nHe leveled the threat of sanctions at the already heavily sanctioned Russian government. Tehran, too, is among the world's most sanctioned regimes.\n'We're certainly prepared to use our counterterrorism sanctions authorities against Russian individuals or entities that might make these destabilizing transfers,' Kirby said.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US fears Wagner mercenaries are preparing to bolster Hezbollah's air defenses in Lebanon as Middle East tensions reach boiling point after America conducted airstrike on Iraq", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12777025/US-fears-Wagner-mercenaries-preparing-bolster-Hezbollahs-air-defenses-Lebanon-Middle-East-tensions-reach-boiling-point-America-conducted-airstrike-Iraq.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}