{"authors": ["Patrick Wintour"], "date_download": "2024-02-05 15:16:04", "date_modify": "None", "date_publish": "2024-01-24 19:17:23", "description": "South Africa’s foreign minister will fly to The Hague for the ruling in a possible sign of Pretoria’s confidence in its case", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2024%2Fjan%2F24%2Ficj-to-deliver-interim-ruling-on-genocide-case-against-israel-on-friday.json", "image_url": "https://i.guim.co.uk/img/media/ed386ffce19e5b465da7ec547cb7fc0a892fcb52/0_173_5197_3118/master/5197.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4f2220e3c076a9a5eaead33c88e7763c", "language": "en", "localpath": null, "maintext": "South Africa’s foreign minister, Naledi Pandor, is flying to The Hague to be present on Friday when the international court of justice (ICJ) delivers its highly anticipated verdict on South Africa’s request for an interim ruling in its genocide case against Israel.\nThe ruling, if granted, would probably take the form of an order to Israel to announce a ceasefire in Gaza and allow more UN humanitarian aid into the country.\nThe announcement of Pandor’s travel plans does not necessarily mean South Africa knows the verdict will be in its favour, but does reflect a confidence in Pretoria that their request is going to be met at least partially.\nA judgment on the merits of the South African claim that Israel is committing genocide under the 1948 Geneva convention is many years off, but the ICJ, the UN’s highest court, has powers to issue the equivalent of an interim injunction.\nIsrael has dismissed South Africa’s claim as a blood libel, but attended the court to mount a defence, potentially making it more difficult for Israel simply to dismiss any negative verdict.\nRepresentatives of both states laid out their legal arguments in The Hague on 11 and 12 January in hearings that were watched worldwide.\nBenjamin Netanyahu also issued a formal statement designed to reassure the court that Israel was acting in self-defence after the 7 October Hamas assaults.\nThe Israeli prime minister also dismissed suggestions that Israel was seeking to expel Palestinians from Gaza. Intent is critical to a court decision on genocide, so it would require the ICJ judges in some way to look past the statements of Netanyahu to other statements by ministers, and the actions of the Israeli Defense Forces, if it was to rule there is a threat of genocide that needs preventing.\nAn immediate ceasefire, or cessation of hostilities, is the prime provisional measure requested by South Africa. In such a scenario, nations and their governments could respond by applying pressure on Israel to comply with the order.\nProvisional measures have recently been provided in cases involving the Russian invasion of Ukraine and the treatment of the Rohingya people in Myanmar.", "source_domain": "www.theguardian.com", "text": null, "title": "ICJ to deliver interim ruling on genocide case against Israel on Friday", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2024/jan/24/icj-to-deliver-interim-ruling-on-genocide-case-against-israel-on-friday"}