{"authors": ["Charlie Bradley"], "date_download": "2024-02-05 15:36:36", "date_modify": "None", "date_publish": "2023-11-21 18:21:00", "description": "Footage showed Israeli soldiers fighting Hamas in a school, alleyways and at night in the Gaza Strip.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1837549%2Fisrael-soldiers-fighting-hamas-footage-gaza.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5078138.jpg", "language": "en", "localpath": null, "maintext": "IDF operating in the Gaza strip\nAn Israeli soldier opening fire\nOther clips show Israeli troops moving through the streets of Gaza, opening fire in tight alleyways and from high buildings. One gunfight even appeared to take place in a classroom at a school. According to the IDF, the unit has located and struck some 70 Hamas targets during the ground offensive, including observation posts, missile launch sites, and terror cells. The IDF's Maglan troops, along with other forces of the Commando Brigade, found weaponry in the home of a Hamas member and raided a school next to which two tunnel shafts were found. Maglan is a unit of the IDF which specializes in operating behind enemy lines and deep in enemy territory.\nIsraeli troops fought Hamas in a school\nWhile the fighting is continuing in Gaza, it could soon come to an end as Israeli Prime Minister Benjamin Netanyahu says a truce could be reached with Hamas soon. A deal could see 50 Israeli hostages released and fighting paused, sources have said. Mr Netanyahu said: “We are making progress. I don’t think it’s worth saying too much, not at even this moment, but I hope there will be good news soon.\" Ismail Haniyeh, the most senior political leader of Hamas, has also indicated that a truce is close.\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nThey also fought in narrow alleyways\nTrending\nIsraeli troops have carried out ground operations", "source_domain": "www.express.co.uk", "text": null, "title": "Israeli soldiers fighting Hamas terrorists in schools and alleys in insane footage", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1837549/israel-soldiers-fighting-hamas-footage-gaza"}