{"authors": ["Shiraz Maher", "Shiraz Maher Is A Contributing Writer To The New Statesman.", "More This Author"], "date_download": "2024-02-05 15:36:37", "date_modify": "None", "date_publish": "2023-11-21 08:00:00", "description": "TikTok and other social media platforms allow distorted narratives to proliferate.", "filename": "https%3A%2F%2Fwww.newstatesman.com%2Fworld%2Fmiddle-east%2F2023%2F11%2Fthe-lessons-of-osama-bin-ladens-viral-letter-to-america.json", "image_url": "https://dl6pgk4f88hky.cloudfront.net/2023/11/20/2PFDBB7-800x418.jpg?1707143798", "language": "en", "localpath": null, "maintext": "Photo by AP Photo via Alamy\nJust as jihadist terror roared back into global consciousness on 7 October, so too, it seems, has Osama bin Laden. A peculiar trend swept TikTok last week when a number of people apparently stumbled across his “Letter to America”, written in November 2002 as justification for the 11 September terrorist attacks that killed 3,000 people in the US the year before.\nA viral compilation of these videos was later pulled together by a journalist, Yashar Ali, on X (formerly Twitter) and has been viewed more than 41 million times since being posted. Its contents are both depressing and predictable. These TikTokers – the majority of whom are likely to have been children, or not even born at the time of the 9/11 attacks – essentially argue that Bin Laden’s warped worldview is not entirely without merit. “I will never look at life the same, this country the same,” said one user, while several others reported experiencing an “existential crisis”.\nThe Guardian also found itself embroiled in this surreal melee because it had carried the full letter on its website, where many were now discovering it. The title’s response was to delete it, stating that “the [letter] published on our website had been widely shared on social media without the full context”. Its predicament brought the tensions surrounding the presence of terrorism content online into sharp relief.\nConsider, for example, how Islamic State (IS) produced highly professional, atmospheric, almost filmic videos of its depraved barbarity. It inspired almost all contemporary jihadist movements to focus their attention on making slicker footage. Most recently this has included Hamas not just filming (or in some cases, livestreaming) its atrocities, but also producing action footage from within Gaza of its fighters assaulting Israeli Defense Forces tanks.\nAlthough it might seem counterintuitive, there are benefits to this kind of material being readily available. The first is that it aids “open source” analysts in both investigating and interrogating accounts of what actually happened on the ground. This can help debunk disinformation and dispel myths. The second is that statements or videos can also form the basis of future prosecutions for war crimes against groups or individuals. Indeed, Germany has recently prosecuted Syrian government officials and IS members, respectively, by in part using this type of evidence.\nSubscribe to the Saturday Read View all newsletters Your new guide to the best writing on ideas, politics, books and culture each weekend – from the New Statesman. Sign up here Select and enter your email address The Saturday Read Your weekly guide to the best writing on ideas, politics, books and culture every Saturday. Sign up directly at saturdayread.substack.com Morning Call The New Statesman's quick and essential guide to the news and politics of the day. Sign up directly at morningcall.substack.com Events and Offers Stay up to date with NS events, subscription offers & updates. The Green Transition Weekly analysis of the shift to a new economy from the New Statesman's Spotlight on Policy team. Your email address Job title Job title\nAdministration / Office\nArts and Culture\nBoard Member\nBusiness / Corporate Services\nClient / Customer Services\nCommunications\nConstruction, Works, Engineering\nEducation, Curriculum and Teaching\nEnvironment, Conservation and NRM\nFacility / Grounds Management and Maintenance\nFinance Management\nHealth - Medical and Nursing Management\nHR, Training and Organisational Development\nInformation and Communications Technology\nInformation Services, Statistics, Records, Archives\nInfrastructure Management - Transport, Utilities\nLegal Officers and Practitioners\nLibrarians and Library Management\nManagement\nMarketing\nOH&S, Risk Management\nOperations Management\nPlanning, Policy, Strategy\nPrinting, Design, Publishing, Web\nProjects, Programs and Advisors\nProperty, Assets and Fleet Management\nPublic Relations and Media\nPurchasing and Procurement\nQuality Management\nScience and Technical Research and Development\nSecurity and Law Enforcement\nService Delivery\nSport and Recreation\nTravel, Accommodation, Tourism\nWellbeing, Community / Social Services Job title Administration / Office Arts and Culture Board Member Business / Corporate Services Client / Customer Services Communications Construction, Works, Engineering Education, Curriculum and Teaching Environment, Conservation and NRM Facility / Grounds Management and Maintenance Finance Management Health - Medical and Nursing Management HR, Training and Organisational Development Information and Communications Technology Information Services, Statistics, Records, Archives Infrastructure Management - Transport, Utilities Legal Officers and Practitioners Librarians and Library Management Management Marketing OH&S, Risk Management Operations Management Planning, Policy, Strategy Printing, Design, Publishing, Web Projects, Programs and Advisors Property, Assets and Fleet Management Public Relations and Media Purchasing and Procurement Quality Management Science and Technical Research and Development Security and Law Enforcement Service Delivery Sport and Recreation Travel, Accommodation, Tourism Wellbeing, Community / Social Services Sign up Visit our privacy Policy for more information about our services, how New Statesman Media Group may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. THANK YOU Close\nYet there are obvious drawbacks to allowing terrorist content to flow across the internet unfiltered. Apart from the prospect of it directly inspiring acts of violence, there is also the danger of such material fuelling highly distorted narratives, such as those expressed in Bin Laden’s letter.\n“I need everyone to stop what they’re doing right now and go read [the letter], it’s literally two pages,” said a TikTok influencer. However, the letter is not two pages long, it’s eight. That might seem like a pedantic observation, but it is worth noting that while earlier passages of Bin Laden’s letter mirror fashionable contemporary rhetoric – employing a highly romanticised vision of “noble resistance” against colonial intrigue, in this case al-Qaeda’s attacks against the US – Bin Laden’s full worldview only becomes apparent towards the end of his diatribe.\nEven at the start of the letter, he begins by portraying himself as an ordinary person standing up for basic rights against America’s supposedly malignant machinations. Yet, this is a wild misrepresentation of the facts. Bin Laden’s principal argument is that the US had somehow “colonised” the Arabian peninsula in 1990 after the Iraqi dictator Saddam Hussein invaded Kuwait. When he then threatened Saudi Arabia, the kingdom entered into a military alliance with America to help protect it against his advances.\nFor Bin Laden this was betrayal and a mark of the House of Saud’s decadence. Having achieved an unlikely and intoxicating victory over the Soviet Union in Afghanistan in 1989, he thought the Arab mujahedin were best-placed to defend the kingdom from Hussein’s aggressive posturing. Nothing else would suffice. “We believe that the US government committed the biggest mistake when it entered a peninsula which no non-Muslim nation has ever entered for 14 centuries despite the presence of imperialist forces in the region,” he told al-Quds al-Arabi, a London-based Arabic newspaper in 1996. “Their [America’s] entry was arbitrary and a reckless action. They have entered into a confrontation with a nation whose population is one billion Muslims.”\nHis contemporaries know this to be untrue. Mohammad al-Massari, who worked with Bin Laden to agitate against the Saudi government during the mid-1990s acknowledged as much in an interview he gave in 2003. “The US did not invade Saudi Arabia. It was invited in by the Saudi royal family,” he said.\nBin Laden’s letter to America is not just a product of the 9/11 attacks, but also of the broader ideological fallout that followed. In February 2002, a group of 60 US public intellectuals wrote a letter making a moral case for the “war on terror”. It began by asserting a series of “fundamental truths that pertain to all people without distinction” of which the first simply stated: “All human beings are born free and equal in dignity and rights.”\nBin Laden’s letter is, in part, a response to this. “What are we calling you to, and what do we want from you?” he asks. He goes on to express the kind of conservative moral panic and righteousness it is hard to believe TikTokers would ever support. “We call you to be a people of manners, principles, honour, and purity; to reject the immoral acts of fornication, homosexuality, intoxicants, gambling, and trading with interest,” he wrote. “You are the worst civilisation witnessed by the history of mankind.”\n[See also: Monster of the mainstream]", "source_domain": "www.newstatesman.com", "text": null, "title": "The lessons of Osama bin Laden’s viral “Letter to America”", "title_page": null, "title_rss": null, "url": "https://www.newstatesman.com/world/middle-east/2023/11/the-lessons-of-osama-bin-ladens-viral-letter-to-america"}