{"authors": [], "date_download": "2024-02-05 15:36:39", "date_modify": "None", "date_publish": "2023-11-21 18:11:29", "description": "Palestinian poet Mosab Abu Toha released by IDF after abrupt arrest", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fmosab-abu-toha-arrest-release-b2451245.html.json", "image_url": "https://static.independent.co.uk/2023/11/21/17/newFile-3.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA prominent Palestinian poet and author whose dispatches in The New Yorker and elsewhere captured daily life in Gaza during Israel’s ongoing siege has been released by Israel Defense Forces after his abrupt arrest and detention over the weekend.\nMosab Abu Toha was fleeing northern Gaza with his wife, brother-in-law and three children, including his three-year-old son, who is an American citizen, when he was arrested at a checkpoint alongside dozens of other people.\nMr Toha and his family received clearance for safe passage through the Rafah border, according to his brother Hamza Abu Toha and Diana Buttu, a Palestinian-Canadian lawyer working with his family. He was reportedly arrested with more than 200 others at a checkpoint, then imprisoned and beaten, according to Ms Buttu.\nMr Toha is the author of the American Book Award-winning poetry collection Things You May Find Hidden in My Ear and the founder of Gaza’s first English-language library. He was a visiting poet and librarian-in-resident at Harvard University in 2020.\nThings You May Find Hidden in My Ear also was named a finalist for the National Book Critics Circle Award in Poetry and the 2022 Walcott Poetry Prize.\nNews outlets, his publishers, free expression groups and press freedom advocates urged his immediate release and protection following news of his disappearance.\nMr Toha was detained “for no evident reason” and questioned somewhere outside Gaza in southern Israel, according to The New Yorker’s web editor Michael Luo, who shared an update from the magazine’s top editor David Remnick on social media on Tuesday.\nOn Monday, Mr Luo said Mr Remnick sent a note to staff about the “worrisome news” surrounding Mr Toha’s disappearance, adding that the publication “learned he was arrested in central Gaza.”\nA spokesperson for The New Yorker on Monday directed The Independent to a statement on its website under the headline “Israeli Forces Reportedly Detain a New Yorker Contributor.”\n“In an essay published here last month, he wrote about Israeli air strikes in his neighborhood. ‘One idea in particular haunts me, and I cannot push it away,’ he wrote. ‘Will I, too, become a statistic on the news?’ Over the weekend, Israeli forces reportedly detained Abu Toha in central Gaza. His whereabouts are now unknown,” the statement said. “The New Yorker joins other organizations in calling for his safe return.”\nAn IDF spokesperson did not respond to requests for comment from The Independent and other news organisations. A statement from the agency on Tuesday claimed that its military intelligence indicated interactions among civilians and a terror group in Gaza. Mr Toha was arrested among those civilians, questioned and released, according to the IDF.\nMosab Abu Toha’s poetry collection ‘Things You May Find Hidden in My Ear’ received a 2023 American Book Award. (Arrowsmith Press)\nMr Toha and his family sought refuge at the Jabalia refugee camp after his home was bombed. Earlier this month, The New Yorker published his account of the attacks at his home and his life inside the camp.\n“I sit in my temporary house in the Jabalia camp, waiting for a ceasefire,” he wrote. “I feel like I am in a cage. I’m being killed every day with my people. The only two things I can do are panic and breathe. There is no hope here.”\nFree expression groups PEN America and PEN International called for Mr Toha’s protection in the wake of his disappearance.\n“We are relieved and grateful at the news that poet Mosab Abu Toha has been released and will be reunited with his family,” PEN America shared in a statement on Tuesday. “Poets and writers must be free to speak truth without fear.”\nJehad Abusalim, who co-edited the anthology Light in Gaza: Writings Born of Fire, which includes a chapter from Mr Toha, said his release is the “direct result of your relentless pressure, a force driven by both outrage and a deep sense of familiarity.”\n“One may wonder why Israel would kidnap a poet,” he wrote in an essay following news of his arrest. “Despite the ongoing war and constant bombardment, Mosab’s words have appeared in many US and international publications. His writings defy – and will continue to defy – the violence surrounding him.”\nGaza’s health ministry has reported more than 13,000 dead, including more than 5,500 children, following Hamas attacks in Israel on 7 October that killed 1,200.\nThe weeks that followed during Israel’s ongoing bombardments and military siege have also marked the deadliest period for journalists in more than 30 years. At least 53 media workers have been killed, including 46 Palestinian, four Israeli, and three Lebanese journalists, as of 21 November, according to the Committee to Protect Journalists.", "source_domain": "www.independent.co.uk", "text": null, "title": "Palestinian poet Mosab Abu Toha released by IDF after abrupt arrest", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/mosab-abu-toha-arrest-release-b2451245.html"}