{"authors": ["Emine Sinmaz"], "date_download": "2024-02-05 15:36:40", "date_modify": "None", "date_publish": "2023-11-21 13:04:11", "description": "Some of the 126,000 people now living in hotels tell of their trauma and how they feel they have nowhere to return to", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F21%2Fisraelis-displaced-from-homes-hamas-attack.json", "image_url": "https://i.guim.co.uk/img/media/374bcc94d28a4d1087dd660f2359879ec647bd1d/42_144_1107_664/master/1107.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea1cdc92e13a7c599d1d49a574b95352", "language": "en", "localpath": null, "maintext": "Yali Shamriz was celebrating her second birthday when Hamas gunmen arrived at the kibbutz where she lived and opened fire.\nFor 22 hours, she sheltered with her father, Jonathan, 33, and mother, Natali, 31, in the safe room at their home while the attackers murdered 63 of the kibbutz’s 700 residents and kidnapped 19 others, including Jonathan’s brother, Alon, 26.\nWhen the family was finally evacuated from Kfar Aza, they left with just the clothes on their backs and a handful of belongings. They are now among the 126,000 displaced Israelis living in hotels across the country in the wake of the 7 October attacks.\n“It’s horrible. It’s a nightmare,” Jonathan Shamriz said. “We still don’t fully understand what happened. We still haven’t fully grieved for everyone.\n“My best friends are dead, my brother is kidnapped, and when you walk through the kibbutz, it’s no place to return to.”\nView image in fullscreen Alon Shamriz, who was kidnapped by Hamas from kibbutz Kfar Aza. Photograph: handout\nThe task of evacuating and finding accommodation for the people of Kfar Aza and 31 other kibbutzim and moshavim close to the Gaza border was coordinated by a local government official, Dikla Katzuni Azerad of the Eshkol regional council. She described it as an “unprecedented and very, very complicated” operation that is costing 5.2m shekels (£1.1m) a week.\nThe council had a pre-existing programme, Mashav Ruach, meaning Breeze, for evacuating the 11 kibbutzim up to 4km (2.5 miles) from the Gaza border, but it quickly became clear it would have to be expanded to include all 32 of the region’s kibbutzim and moshavim.\n“We realised the scale of the massacre,” Azerad said. “The attack surprised everyone. I didn’t have a plan for everyone. I couldn’t just pull hotels out of my pocket.” The council eventually evacuated 13,000 of its 16,000 residents.\nDisplaced Israelis are now residing in 280 guest houses and hotels across the country, including in the Red Sea resort of Eilat, according to the Israeli defence ministry.\nIt added that as well as those in Gaza border communities, it had evacuated 23,000 people from the northern city of Kiryat Shmona and 38,000 from areas nearby. The ministry said a further 49,000 people were moved as part of a “revitalisation programme” for those affected by the war.\nIn Gaza, two-thirds of the population of 2.3 million have been displaced to the south, according to the United Nations, and the death toll from Israeli bombardment has reached 13,000, including 5,500 children, according to the Hamas-run Gaza health ministry.\nAzerad described scenes of chaos as the Israel Defense Forces (IDF) extracted from safe rooms startled families who were desperate to leave “even if they were barefoot and naked”.\n“You see a grown woman wearing SpongeBob SquarePants pyjamas and she’s holding her babies,” she said. “We took mothers and kids in the middle of the night, and all around them were dead bodies and explosions and they don’t know who was alive and who was dead.\n“We put them on armoured buses and took them out without clothes, without bags. So it was a very, very emotional operation but I needed to, for my mental health, to focus on the logistics. We were saving lives. Afterwards we do everything else.”\nView image in fullscreen Lt Col Yaron Buskila, an operation officer of the IDF’s Gaza Division, stands in front of a destroyed home as he revisits kibbutz Kfar Aza, where he was one of the first to arrive on 7 October. Photograph: Amir Cohen/Reuters\nThe Shamriz family were among those rescued. They, along with Jonathan’s parents and two siblings, are now living in a coastal hotel 12 miles north of Tel Aviv.\nThere, the family and 400 other people from Kfar Aza, one of the hardest-hit communities, are provided with three meals a day and handouts from charities and volunteers. Officials have had to visit the hotel to issue evacuees with new passports and ID cards.\n“None of my clothes or shoes are here, or basic things like deodorant or shampoo. Nothing. But I don’t really care for those things as long as my brother is in Gaza,” Shamriz said.\nShamriz, who runs a wood importation business, has asked if he can change the date of his daughter’s birthday, as the family are so haunted by the events of 7 October.\nAs news of Hamas’s attack broke on the kibbutz’s WhatsApp group, the family fled to their safe room with water and a cake they had prepared for Yali’s birthday. They laid her down on a bed and played her YouTube videos to try to drown out the noise of the carnage outside.\n“I tried not to break in front of my wife and daughter, to try to hold myself together, but meanwhile the messages kept coming,” Shamriz said.\nOne such message was from his brother, Alon, who lived alone, saying he was sitting quietly in his safe room before adding: “I can hear them coming, tell everyone.”\nShamriz said: “I realised that I was talking to him maybe for the last time, so I wrote to him that I love him and that he’s strong, and he sent me a love heart emoji. This was the last time we spoke.”\nAs he walked around the hotel, Shamriz spotted a family who the IDF did not rescue for more than 30 hours because their house was so badly burned they assumed they were dead. He also pointed out a bullet-holed Liverpool FC poster in the hotel bar recently retrieved from the bedroom of one of the kibbutz’s residents who was abducted along with his twin brother.\nAt another hotel 15 miles south in Tel Aviv, other families from Kfar Aza had their own devastating stories to tell.\nVarda and David Goldstein, both 73, were on holiday in Bulgaria with others from the kibbutz when they found out about the Hamas attacks in which at least 1,200 people were killed and more than 240 taken hostage.\nThey quickly returned home and learned that their son, Nadav Goldstein Almog, a triathlete, and his oldest daughter, Yam, 20, had been murdered. Nadav’s wife, Chen, 49, and their three younger children, Tal, nine, Gal, 11, and Agam, 17, had been taken hostage.\nView image in fullscreen The Goldstein Almog family, from left to right: Agam, Gal, Nadav, Chen, Tal and Yam.\n“When we landed we had to go to straight to the police station to give DNA samples and then we came here,” Varda Goldstein said in the hotel lobby.\nOmri Almog, Chen’s brother, said his sister’s home was riddled with bullet holes and blood stains. “They shot Nadav in the safe room, and Yam – she probably tried to run away or to do something, we don’t know – but they shot her next to the door.”\nNadav’s parents’ home was completely burned in the carnage. “We don’t have a home to go back to,” his mother said. “It’s not only my house. It’s all the community. So maybe it will take two years until we can go back to our community, to our house, to our kibbutz. And until then, we are like refugees in our land, with just two bags and two T-shirts.”\nView image in fullscreen Omri Almog and Varda Goldstein are staying in a hotel in Tel Aviv.\nShe has dreams of retuning to Kfar Aza, but said: “We will do it as long as I know that there will be no shooting from the Gaza Strip back to us.”\nShamriz returned to the kibbutz recently to take in the scene of his brother’s abduction. “It was very hard,” he said. “You realise that you have nowhere to go back to. I lived there for 30 years, most of my life, so this was the place that I called home. So if I won’t be able to go to my home I don’t really care where I live because nothing will feel like home and I will never go back to Kfar Aza.”\nAzerad, the civil servant, was hopeful that eventually people would return to their homes. But she acknowledged it would cost billions of shekels to rebuild the communities and earn the public’s trust.\n“The concrete is the easy part. The state has already started mapping the houses and sealing the houses so the winter will not harm them, and we’re already talking about budgets to rebuild the houses. But I’m talking about the feeling of being safe. I want to sleep in my bed without my daughter beside me because I’m frightened,” she said.", "source_domain": "www.theguardian.com", "text": null, "title": "‘I’ll never go back’: the Israelis displaced from homes by Hamas attack", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/21/israelis-displaced-from-homes-hamas-attack"}