{"authors": ["Robert Tait"], "date_download": "2024-02-05 15:36:43", "date_modify": "None", "date_publish": "2023-11-21 06:00:17", "description": "The IDF’s offensive in Gaza has killed 48 members of the press and caused a ‘news blackout’, says Committee to Protect Journalists", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F21%2Fisrael-hamas-war-is-deadliest-conflict-on-record-for-reporters-says-watchdog.json", "image_url": "https://i.guim.co.uk/img/media/fc7dc3639eb1956e12ee881b60335cc1800c960d/0_365_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7b450a5f15547c7acbe6cea9b131021c", "language": "en", "localpath": null, "maintext": "Israel’s military offensive in Gaza has produced the deadliest month for journalists since statistics began more than three decades ago, and created a news blackout in the embattled territory, the Committee to Protect Journalists (CPJ) has said.\nThe reporters’ watchdog has recorded the deaths of 48 reporters since Hamas embarked on a murderous killing spree in Israel on 7 October, triggering a concerted Israeli bombardment and ground invasion of Gaza in response.\nThe committee had already labelled the first month after the Hamas attacks as the most lethal suffered by journalists since 1992 before six more Palestinian journalists were killed in Gaza over the weekend.\nFive were killed on Saturday alone, making it the second deadliest of the war apart from the day of Hamas’ attack, when six journalists lost their lives.\nThe spiralling death toll over a six-week period compares with the 42 journalists killed worldwide in the whole of 2022, including 15 who died covering Russia’s invasion of Ukraine, widely considered a highly dangerous conflict for news media.\nThe CPJ says the lethal trend also far outstrips the 30 journalists killed at the height of the Syrian civil war, previously regarded as the deadliest war zone for journalists in recent times.\nNow the organisation has issued an urgent plea to Israel and its western allies to reform the rules of engagement deployed by the Israel Defense Forces (IDF) to prohibit the use of lethal force against journalists bearing press insignia.\nSherif Mansour, the committee’s coordinator for the Middle East and North Africa, said the rising number of media fatalities combined with successive cuts to internet and phone networks, and tightening censorship, were effectively imposing an information blackout on Gaza, a tiny coastal territory that is home to an estimated 2.3 million Palestinians. It meant a dearth of information for a population desperate to know where to obtain food, fuel and clean water, he said.\n“Reporting the conflict has become so much more dangerous because of the exponential risk to local Palestinian journalists who are on the frontline and have no safe haven and no way out,” Mansour said.\n“Also the Israeli army has refused to take any responsibility for the killings, saying to the international media organisations that they cannot guarantee the safety of the media or their employees.\n“We have said, especially after the army targeted communications facilities, that we have reached a news blackout. We also have the problems with censorship, assaults and detentions in the West Bank.”\nNinety percent of the journalists killed have been Palestinians, with the exception of four Israeli reporters killed in the Hamas attacks, and one Lebanese citizen. The majority of the Palestinians killed have been freelancers and photo-journalists.\n“They are the most needed right now but they are also the most vulnerable,” said Mansour.\nAnother nine journalists have been injured and a further three are missing. Thirteen have been arrested as part of what is described as an Israeli “censorship regime” introduced under emergency legislation making it an offence to damage “national morale” or “national security”.\nIt is unclear how many journalists were covering the conflict at the times of their deaths. But the CPJ is investigating each instance to see if reporters were caught in the crossfire while trying to do their jobs, Mansour added.\nThe grim tally has prompted the committee to renew calls initially made before the outbreak of the latest hostilities for Israel to reform its rules of engagement so that clearly identified journalists are protected.\n“Last May, we said the IDF must change their rules of engagement to stop unleashing the use of lethal forces against journalists and media organisations,” said Mansour, who cited a previous CPJ report, Deadly Pattern, which said 13 out 20 journalists killed in Gaza before the current war had been wearing or carrying press markings at the time.\n“We have not seen any indication that this has been done. This time, therefore, we have also called on Israel’s allies, including the United States, Britain and other European countries to pressure it to stop any use of lethal force against journalists.”\nThe call for protective measures follows claims this month by an Israeli media advocacy group, HonestReporting, that some international media outlets knew about Hamas’s 7 October attack in advance, citing the publication of pictures taken by local journalists showing the group storming into Israeli territory.\nHonestReporting subsequently withdrew the accusations in the face of the organisations’ denials but not before the office of Benjamin Netanyahu, the Israeli prime minister, issued a statement calling journalists who had photographed the event accomplices in “crimes against humanity”. Benny Gantz, a member of the Israeli war cabinet, said they should be treated as terrorists and hunted down.\nDays after the report, the home of Yasser Qudih, a freelance photographer who provided pictures of the Hamas attack to Reuters, was struck by four missiles. Qudih survived the strike but eight members of his family were killed. It is unclear whether Israel launched the strike.\nMansour called the HonestReporting claim a “smear campaign” that put Palestinian journalists’ lives in danger and said it was consistent with previous “false narratives” implying that Palestinian reporters were involved in terrorist activity.\n“It doesn’t take hours or a genius in Gaza to know about Israeli army operations or Hamas operations,” he said. “You are talking about a 20-mile-long strip that is six miles wide. There are so many ways journalists could be at the scene – it doesn’t take any inside knowledge to open the window and look at the sky and see where the operation is.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israel-Hamas war is deadliest conflict on record for reporters, says watchdog", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/21/israel-hamas-war-is-deadliest-conflict-on-record-for-reporters-says-watchdog"}