{"authors": ["Rob Crilly", "Senior U.S. Political Reporter", "Miriam Kuepper"], "date_download": "2024-02-05 15:36:43", "date_modify": "None", "date_publish": "2023-11-21 20:29:23", "description": "The White House on Tuesday said it was considering redesignating Yemen's Houthi movement as a a terror organization after it hijacked a ship in the Red Sea.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12776705%2FHouthi-ship-hijacked-terror-organization-White-House.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/21/22/78033209-0-image-a-95_1700606240844.jpg", "language": "en", "localpath": null, "maintext": "The White House on Tuesday said it was considering redesignating Yemen's Houthi movement as a terror organization after it hijacked a ship in the Red Sea.\nNational security spokesman John Kirby said the seizure of the Galaxy Leader, which has ties to Israel, was 'a flagrant violation of international law' and that Iran was involved.\nThe Iran-backed Houthis were declared to be terrorists during the final days of the Trump administration.\nThe designation was lifted by President Joe Biden soon after he took power because it hampered efforts to deliver humanitarian aid to war-torn Yemen.\n'In light of the recent targeting of civilians by the Houthis, and now the piracy of a ship in international waters, we have begun a review of potential terrorist designations and we'll be considering other options together with our allies and partners as well,' Kirby told reporters on Tuesday.\nWhite House national security John Kirby said the US was considering redesignating Yemen's Houthi movement as a a terror organization after it hijacked a ship in the Red Sea\nVideo released on Monday showed how Houthi rebels boarded the Bahaman-flagged Galaxy Leader a day earlier.\n'Iran is complicit to its material support, and its encouragement of the Houthi forces who conducted the seizure — absolutely unacceptable,' Kirby said.\nThe cargo ship is registered under a British company which is part-owned by Israeli tycoon Abraham Unger.\nThe Houthis had earlier promised to destroy Israeli shipping and released a video showing commando units in fast boats and slick graphics of cargo ships burning.\nThe latest video showed how they used a helicopter to approach the Galaxy Leader. Heavily armed gunmen dropped on the deck.\nThey approached the bridge with their weapons drawn as crew members on the bridge can be seen holding up their hands in surrender. One of the fighters was filmed walking through the ship while shouting 'Allahu Akbar'.\nThis comes as the ship's owner, Isle of Man registered Galaxy Maritime Ltd, said that the vessel is now in the Hodeidah port in Yemen.\n'All communications were subsequently lost with the vessel. The company, as a shipping concern, will not be commenting further on the political or geopolitical situation,' the company said in a statement.\nThe Bahamas-flagged Galaxy Leader's crew is made up of nationals from Bulgaria, Ukraine, the Philippines, Mexico and Romania, Galaxy Maritime said. The vessel is chartered by Japan's Nippon Yusen.\nThe Houthis issued a video threatening Israeli shipping in response to the Gaza crisis\nIt featured graphics of burning boats and footage of Houthi commando teams\nA video released Monday included footage filmed by the rebels of them approaching the Bahaman-flagged 'Galaxy Leader' ship in the southern Red Sea via helicopter yesterday, with several heavily-armed fighters being dropped off on deck (pictured above)\nThe cargo ship (pictured) travelled south past the Arabian peninsula on its way to India . It is registered under a British company which is partially owned by Israeli tycoon Abraham Ungar and is currently leased out to a Japanese company, according to reports\nThe Houthi rebels approached the bridge with their guns drawn as crew members on the bridge can be seen holding up their hands in surrender. One of the fighters was filmed walking through the ship while shouting 'Allahu Akbar' (pictured above)\n'Owners and managers believe the seizure of this vessel represents a gross violation of freedom of passage for the world fleet and a serious threat to international trade,' Galaxy Maritime said.\nIt added that the 'key concern at this time is the safety and security of the 25 crew members currently being held by the perpetrators of this criminal act'.\nThe Israeli Defence Forces (IDF) have said there are no citizens from the Jewish state on board and the organisation denied the ship was Israeli, but called it a 'grave incident'.\nAccording to one rebel official and maritime source, the ship was seized by the revels and diverted to a Houthi-controlled coastal area in Yemen.\nIt came after the militia - which has fought a bloody civil war against the Yemeni government since the 1990s - vowed to attack ships in retaliation for Israel's response to the October 7 attacks.\nThe rebel group released a chilling warning that it would strike ships this week - with a slick video presented by rebel leader Abdul-Malik al-Houthi complete with graphics of vessels burning and sinking after being struck by militia fighters.\nMeanwhile two commercial ships that diverted their course in the Red Sea and Gulf of Aden were connected to the same maritime group whose vessel was seized by Yemen's Houthis, according to shipping data and British maritime security company Ambrey.\nA helicopter approached the Galaxy Leader and dropped off several Houthi fighters\nThe ship is registered under a British company partially-owned by Israeli tycoon Abraham Ungar (pictured), who is close to the former head of Mossad, Yossi Cohen (right)\nAccording to the most recent publicly-available tracking data, the ship was last seen to the east of Port Sudan on Saturday\nThe cargo ship had 22 crew members onboard when the rebels took control of the vessel\nThe rebels approached the bridge with weapons drawn\nIsrael on Sunday said the Houthis had seized a British-owned, Japanese-operated cargo ship in the southern Red Sea, describing the incident as an 'Iranian act of terrorism' with consequences for international maritime security.\nThe Houthis, an ally of Tehran, confirmed that they had seized a ship in that area but described it as Israeli.\nJapan's top government spokesperson on Monday confirmed the capture of the Nippon Yusen-operated ship Galaxy Leader, adding that Japan was appealing to the Houthis while seeking the help of Saudi, Omani and Iranian authorities to work toward the swift release of the vessel and its crew.\nTwo other ships also listed as commercially managed by Ray Car Carriers, Glovis Star and Hermes Leader, diverted their sailing routes on Sunday, Ambrey said on Monday.\nThe Hermes Leader had set a course to sail south of Nishtun in Yemen when it diverted its journey.\n'The vessel continued to sail back to where it had come from, providing a new AIS destination as Hambantota, Sri Lanka,' Ambrey said. 'The vessel incurred a minimum four-day business disruption and sailed an additional 1,876 nautical miles.'\nThe Glovis Star drifted for a number of hours in the Red Sea before continuing its journey, AIS ship tracking data showed on Monday.\nIsraeli Defence Forces said the hijacking of the ship was a 'very grave incident of global consequence'\nThe Bahamas-flagged Galaxy Leader's crew is made up of nationals from Bulgaria, Ukraine, the Philippines, Mexico and Romania, Galaxy Maritime said. The vessel is chartered by Japan's Nippon Yusen\nHouthi leadership last week said their forces would make further attacks on Israel and they could target Israeli ships in the Red Sea and the Bab al-Mandeb Strait.\nUS maritime administration MARAD in an advisory said the Galaxy Leader had been hijacked approximately 50 miles west of the Houthi-controlled port of Hodeidah, adding that ships should 'exercise caution when transiting this area.'\n'We saw yesterday a new record - for the first time we saw [an] official announcement of pirates taking over a ship on the high seas, which I think is a major threat to international law and order,' Israeli President Isaac Herzog said in comments on Monday, referring to the Galaxy Leader.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "US is considering designating Yemen's Iran-backed Houthis as a terrorist organization as White House demands rebels return the Galaxy Leader cargo ship they stormed in the Red Sea", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12776705/Houthi-ship-hijacked-terror-organization-White-House.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}