{"authors": ["Léonie Chao-Fong", "Amy Sedghi", "Martin Belam", "Reged Ahmad"], "date_download": "2024-02-05 15:16:05", "date_modify": "None", "date_publish": "2024-01-24 19:05:32", "description": "Ruling on request for provisional measures submitted by South Africa to come this week; White House says one missed and the other two were shot down", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2024%2Fjan%2F24%2Fmiddle-east-crisis-live-updates-us-military-strikes-houthi-rebels-yemen-red-sea-israel-gaza-war-hamas-hostages.json", "image_url": "https://i.guim.co.uk/img/media/615dfebcb5abfb2623d6606468b91a2c760528b0/0_267_4000_2399/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=cd891d7cb5bcb787d860976eb8f61a6c", "language": "en", "localpath": null, "maintext": "From 24 Jan 2024 18.25 CET UN court to deliver ruling in Israel genocide case on Friday The international court of justice in The Hague has said it will deliver its verdict this week on the request for provisional measures submitted by South Africa in the case against Israel. In a statement, the court said the 17-judge panel will hand down its ruling on Friday at 1200 GMT. South Africa is asking the UN court to act urgently “to protect against further, severe and irreparable harm to the rights of the Palestinian people under the genocide convention, which continues to be violated with impunity”. PRESS RELEASE: the #ICJ will deliver its Order on the request for the indication of provisional measures submitted by South Africa in the case #SouthAfrica v. #Israel this Friday, 26 January 2024, at 1 p.m. (The Hague). Watch live on @UNWebTV https://t.co/tikn2TSa8U pic.twitter.com/2csTaDZVZ1 — CIJ_ICJ (@CIJ_ICJ) January 24, 2024\nUpdated at 18.28 CET\n24 Jan 2024 19.12 CET South Africa’s foreign minister will travel to The Hague to attend the ICJ ruling on whether or not to grant emergency measures against Israel, the South African government has said. As we reported earlier, the UN court has said it will issue a decision on Friday on South Africa’s request for interim orders in a genocide case against Israel, including that Israel stop its military campaign in Gaza. In the ruling on Friday, the ICJ will not deal with the main question of whether Israel is committing genocide. The court will only look at possible emergency measures, whereas the full case could take years to decide. South Africa wants the court to issue so-called “provisional measures” – emergency orders to protect Palestinians in Gaza from potential breaches of the UN’s Genocide Convention. But the court is not bound to order exactly what Pretoria asked for. Orders from the ICJ are legally binding and cannot be appealed, but the court has no way to enforce them.\nUpdated at 19.15 CET\n24 Jan 2024 18.57 CET Houthis fired three missiles at ships in Red Sea, says White House Yemen’s Houthi forces fired missiles at ships in the Red Sea on Wednesday, the White House has said. The White House’s national security spokesperson, John Kirby, said the Houthis launched three missiles at two merchant vessels in the southern Red Sea, adding that “one missile missed” and “the other two were shot down by a US Navy destroyer”. Kirby said: It obviously underscores that the Houthis still intend to conduct these attacks, which means we’re obviously still going to have to do what we have to do to protect that shipping. The US Central Command said the missiles were fired “toward the US-flagged, owned, and operated container ship M/V Maersk Detroit,” but did not mention a second vessel being targeted. There were no reports of injuries or damage to the ship, it added.\n24 Jan 2024 18.46 CET Number of killed 'likely higher than nine', says UNRWA chief after shelter struck in Khan Younis The head of the UN agency for Palestinian refugees, UNRWA, has said the number of those killed on Wednesday after a building sheltering thousands of displaced people in southern Gaza was hit is “likely higher” than initially reported. As we reported earlier, UNRWA’s director in Gaza, Thomas White, said nine Palestinians had been killed and 75 injured after what he described as an “attack” on a UN training centre designated as shelter in Khan Younis. UNRWA commissioner general Philippe Lazzarini, posting to social media, said the vocational training centre that was struck is one of the largest UN facilities, sheltering nearly 30,000 displaced people. He said the UN facility is “clearly marked” and that its coordinates were shared with Israeli authorities, adding: Once again a blatant disregard of basic rules of war. Another horrific day in #Gaza. The number of those killed is likely higher.#KhanYounis vocational training centre is one of the largest @UNRWA facilities sheltering nearly 30,000 displaced people.\nThe compound is a clearly marked @UN facility & its coordinates were shared with… https://t.co/XZwK09ondV — Philippe Lazzarini (@UNLazzarini) January 24, 2024\nUpdated at 18.58 CET\n24 Jan 2024 18.25 CET UN court to deliver ruling in Israel genocide case on Friday The international court of justice in The Hague has said it will deliver its verdict this week on the request for provisional measures submitted by South Africa in the case against Israel. In a statement, the court said the 17-judge panel will hand down its ruling on Friday at 1200 GMT. South Africa is asking the UN court to act urgently “to protect against further, severe and irreparable harm to the rights of the Palestinian people under the genocide convention, which continues to be violated with impunity”. PRESS RELEASE: the #ICJ will deliver its Order on the request for the indication of provisional measures submitted by South Africa in the case #SouthAfrica v. #Israel this Friday, 26 January 2024, at 1 p.m. (The Hague). Watch live on @UNWebTV https://t.co/tikn2TSa8U pic.twitter.com/2csTaDZVZ1 — CIJ_ICJ (@CIJ_ICJ) January 24, 2024\nUpdated at 18.28 CET\n24 Jan 2024 18.15 CET International aid groups urge countries to stop sending weapons to Israel and Palestinian armed groups More than a dozen international humanitarian and human rights organisations have issued a joint call urging countries to stop arms transfers to Israel and Palestinian armed groups. In a statement on Wednesday, they called on UN member states to “stop fuelling the crisis in Gaza and avert further humanitarian catastrophe and loss of civilian life”. The 16 signatories include Amnesty International, Oxfam, Save the Children, Christian Aid, the Norwegian Refugee Council, and the Médecins du Monde international network. The statement reads: Israel’s bombardment and siege are depriving the civilian population of the basics to survive and rendering Gaza uninhabitable. Today, the civilian population in Gaza faces a humanitarian crisis of unprecedented severity and scale. It says Israel continues to use explosive weapons and munitions in densely populated areas in Gaza with “massive humanitarian consequences”, is killing people at “unprecedented levels” and destroying a “substantial portion” of Gaza’s homes, schools, hospitals, water infrastructure, shelters, and refugee camps. Gaza’s remaining lifeline – an internationally funded humanitarian aid response – has been paralysed by the intensity of the hostilities, which have included the shooting of aid convoys, recurrent communications blackouts, damaged roads, restrictions on essential supplies, an almost complete ban on commercial supplies, and a bureaucratic process to send aid into Gaza. It says Gaza today is “the most dangerous place to be a child, a journalist, and an aid worker”, where hospitals and schools have become “battlegrounds”. The statement continues: We demand an immediate ceasefire and call on all states to halt the transfer of weapons that can be used to commit violations of international humanitarian and human rights law … All states have an obligation to prevent atrocity crimes and promote adherence to norms that protect civilians.\nUpdated at 18.21 CET\n24 Jan 2024 17.45 CET Italy has announced it will launch an operation to provide hospital treatment for 100 Palestinian children from Gaza. Italy’s defence minister, Guido Crosetto, said on Wednesday that the first 30 children would be transported by plane from Egypt, where they had sought refuge and medical assistance after escaping Israeli bombardment in Gaza. Another 30 children and their families will be transported to Italy at the end of January onboard a military vessel that will depart from the Egyptian port of al-Arish, he said. The children will be treated in hospitals in Bologna, Florence, Genoa and Rome, a statement by Crosetto said. The minister did not clarify when or how the remaining 40 children would be transported, Reuters reported. The move was “a moral duty more than a political one”, he said, adding: One cannot remain indifferent in the face of the serious humanitarian crisis. View image in fullscreen An Egyptian paramedic holds a Palestinian child evacuated from Gaza via the Rafah border crossing with Egypt. Photograph: AFP/Getty Images\nUpdated at 18.12 CET\n24 Jan 2024 17.28 CET The UK foreign secretary, David Cameron, has met Benjamin Netanyahu in Jerusalem as part of his Middle East visit. Cameron, who is on his second visit to the region since returning to government, is expected to press for an immediate humanitarian pause in the fighting and raise “the importance of a two-state solution”, Downing Street said. Prime Minister Benjamin Netanyahu held a private meeting today with UK Foreign Secretary, and former Prime Minister, David Cameron, at the Prime Minister's Office in Jerusalem. pic.twitter.com/XHUNArASv2 — Prime Minister of Israel (@IsraeliPM) January 24, 2024 Speaking as he prepared to travel to Qatar, Cameron said on Tuesday that a sustained ceasefire “would require Hamas to agree to the release of all hostages, Hamas to no longer be in charge of Gaza launching rocket attacks at Israel, and an agreement in place for the Palestinian Authority to return to Gaza in order to provide governance and services and, increasingly, security”. Netanyahu, Israel’s prime minister, has said he is opposed to the Palestinian Authority taking charge of Gaza.\nUpdated at 18.06 CET\n24 Jan 2024 17.14 CET A group of Palestinians in the central Gaza city of Deir al-Balah have protested in support of an immediate ceasefire between Israel and Hamas. The demonstration marked a rare show of protest in the devastated and besieged Palestinian territory, where people are struggling to get by amid the war and humanitarian crisis, AP reported. Demonstrators, mostly women and children, chanted: “People want to end the war” and “We want to go back to the north [of Gaza].” One sign carried by a young girl read: “Yes to returning the prisoners.” The protest was seized on by an Israel Defense Forces (IDF) spokesperson who said it was evidence that Palestinians were demanding Hamas release the hostages taken during the 7 October attacks in order to end the war. However, there was no indication the protesters directed their demonstration at Hamas specifically, AP wrote. A poll published last month showed Palestinian support in Gaza for Hamas had risen since the war erupted.\nUpdated at 17.19 CET\n24 Jan 2024 16.56 CET Two US-flagged vessels transiting the Bab el-Mandeb strait, accompanied by the US navy, turned around after seeing explosions nearby, according to the shipping company Maersk. Both vessels are operated by Maersk’s US subsidiary that carries cargo for the US defence department, state department, US agency for international development (USAid), and other government agencies, Reuters reported. A statement by Maersk read: While en route, both ships reported seeing explosions close by and the US navy accompaniment also intercepted multiple projectiles. The vessels and crew were unharmed and were being escorted back to the Gulf of Aden by the US navy, it said.\nUpdated at 17.02 CET\n24 Jan 2024 16.48 CET Here’s more on the reports that a UN training centre sheltering hundreds of displaced people was hit earlier today in Khan Younis. Nine people have been killed and 75 injured, according to the head of the UN agency for Palestinian refugees (UNRWA) in Gaza. A UNRWA spokesperson told Al Jazeera there had been no warning prior to the building being shelled. He added that a “building has been set on fire” and that “there are many casualties”. He described the situation as “very dangerous”, adding that UNRWA teams had not been able to access the compound in the past two days “because the Israeli tanks actually [were] very close”. He added: People are screaming, crying, asking for help. We hope that we will not find so many people to have been killed and injured.\n24 Jan 2024 16.27 CET Nine killed and dozens injured after UN shelter hit in Khan Younis – reports The director of the UN agency for Palestinian refugees (UNRWA) in Gaza has cited reports as saying that nine Palestinians have been killed and 75 injured after what he described as an “attack” on a UN training centre designated as shelter in Khan Younis. As we reported earlier, Thomas White said there were “mass casualties” and “buildings ablaze” after the training centre was hit, and that people sheltering inside the building were “trapped”. In an update, White said two tank rounds hit the building that was sheltering about 800 displaced people in the southern Gaza Strip. He added that UNRWA and World Health Organization (WHO) teams were trying to reach the centres, but that a route that had been agreed upon with the Israeli army was “blocked with [an] earth bank”. Update - attack on Khan Younis Training Centre this afternoon - two tank rounds hit building that shelters 800 people - reports now 9 dead and 75 injured@UNRWA and @WHO team trying to reach the centre - agreed upon route with Israeli Army blocked with earth bank #Gaza — Thomas White (@TomWhiteGaza) January 24, 2024\nUpdated at 16.49 CET\n24 Jan 2024 16.12 CET Summary of the day so far It’s 5.12pm in Gaza and Tel Aviv and 6.12pm in Sana’a, Yemen. We’ll be handing over to the US shortly to continue our coverage of the Middle East crisis, but first, here are some of the latest developments: The Israeli government spokesperson Ilana Stein ruled out a Gaza ceasefire on Wednesday, despite reports that negotiations on hostage releases were progressing and repeated international calls for Israel to cease its months-long bombardment of the Gaza Strip.\nYemen’s Houthi authorities have ordered US and British staff of the UN and Sana’a-based humanitarian organisations to leave the country within a month. “The ministry … would like to stress that you must inform officials and workers with US and British citizenships to prepare to leave the country within 30 days,” said a letter sent by the Houthi foreign ministry to the UN’s acting humanitarian coordinator in Yemen, Peter Hawkins. The Houthis’ top negotiator, Mohammed Abdulsalam, confirmed the letter’s authenticity to Reuters.\nWitnesses reported fierce gun battles in the west of Khan Younis, where the Israeli military said it had killed “numerous” squads of gunmen “with sniper, tank and aerial fire” , said Reuters. Ashraf al-Qidra, a spokesperson for the Hamas-run Gaza health ministry, said in a statement: “The occupation is isolating hospitals in Khan Younis and carrying out massacres in the western area of the city.” The Palestinian Red Cross Society, which runs al-Amal hospital, said troops had blockaded its staff inside and imposed a curfew in the area, including its local headquarters, where three displaced individuals had been killed.\nIsrael ordered people to leave a swath of downtown Khan Younis that include d Nasser and two smaller hospitals as it pushed ahead with its offensive against Hamas, AP reported.\nThe aid group Doctors Without Borders said its staff were trapped inside Nasser hospital with about 850 patients and thousands of displaced people because the surrounding roads were inaccessible or too dangerous.\nPeople fleeing the vicinity of Nasser hospital have been shot at by Israeli tanks as well as attack drones , said the Al Jazeera journalist Hani Mahmoud, reporting from Rafah, southern Gaza. Mahmoud also said there had been a “surge” in aerial attacks and artillery shelling in the western part of Khan Younis, while the compound of al-Aqsa University, where thousands of people were sheltering, was “effectively under military siege”.\nThe director of the United Nations Relief and Works Agency affairs in Gaza, Thomas White , said its training centre in Khan Younis, which was sheltering displaced Palestinians , resulting in mass casualties and a building ablaze.\nAt least eight people were critically injured after Israeli forces targeted a school in Khan Younis that was sheltering hundreds of displaced Palestinians, reported the Al Jazeera journalist Hani Mahmoud.\nIsrael continues to target health institutions in Gaza, said Ahmed Al-Mandhari, the World Health Organization’s regional director for the eastern Mediterranean , reported Al Jazeera, citing comments made during a press conference on Wednesday about the healthcare system in the Gaza Strip. Mandhari said the situation in the Gaza Strip was catastrophic and that the number of workers in medical institutions had decreased to just 5%.\nDischarged patients are refusing to leave because “they don’t have anywhere to go”, said a health officer working at the European Gaza hospital in Khan Younis . Raneen Wafi, a health officer with the International Committee of the Red Cross (ICRC), said it was one of “our main challenges” and that “there is no space” for patients waiting for a bed.\nThe World Food Programme warned of a “catastrophic food insecurity” in Gaza. “More than half a million people in Gaza are facing catastrophic food insecurity levels and the risk of famine increases each day,” said Abeer Etefa, the WFP’s senior Middle East spokesperson.\nIsraeli troops on Wednesday demolished the home of a Palestinian accused of assisting in the killing of four Israelis near a settlement in the occupied West Bank in June, witnesses told AFP.\n210 Palestinians were killed in Israeli strikes and nearly 400 were injured in the previous 24 hours , according to the latest figures from the Gaza health ministry, which is run by Hamas.\nThe Rafah crossing between Egypt and the Gaza Strip is open “24/7” but the procedures by Israel to allow the entry of aid are obstructing the process , the Egyptian president, Abdel Fatah al-Sisi, said on Wednesday. Sisi said: “This is part of how they exert pressure on the issue of releasing the hostages.”\nAn armed drone targeted a base housing US forces near northern Iraq’s Erbil airport on Wednesday, two sources told Reuters.\nIsraeli forces arrested 35 Palestinians, including a woman and former prisoners, in the occupied West Bank and East Jerusalem , reported Al Jazeera citing data released by the Palestinian prisoners’ affairs authority.\nIran’s president, Ebrahim Raisi, met the Turkish president, Recep Tayyip Erdoğan, on Wednesday for twice-delayed talks aimed at ironing out past differences and halting the spread of the Israel-Hamas war.\nThe British foreign secretary, David Cameron, will travel to Israel on Wednesday where he is expected to raise concerns over the high number of Palestinians killed and push for a “sustainable” ceasefire in the Gaza war.\nGreenpeace activists on Wednesday unveiled an illustration depicting a Palestinian child crying for help, outside the Reina Sofía museum in Madrid, Spain. The illustration was created by the US artist Shepard Fairey, also known as Obey, and was based on a photograph by the Gaza photojournalist Belal Khaled. Activists also tied a yellow banner reading ‘ceasefire now’ to the building.\nPope Francis issued a new plea against all wars as he evoked the horror of the mass killing of Jews and other victims of the Nazis in advance of Saturday’s Holocaust Memorial Day , reported Reuters. He mentioned the Israeli-Palestinian conflict and the bombing of civilians in “martyred Ukraine”. He repeated his assertion that “war is always a defeat” in which “the only winners, so to speak, are weapons manufacturers”.\nAn incident 50 nautical miles south of al-Mukha in Yemen was reported by the UK Maritime Trade Operations (UKMTO) organisation. In an advisory note, reported by Reuters, the UKMTO said the master reported an explosion approximately 100 metres from the vessel. The vessel and crew were safe and no injuries or damage were reported, it added.\nStrikes by the US on Iraqi military positions will lead to “irresponsible escalation” and violate the country’s sovereignty , the Iraqi prime minister’s office said in a statement on Wednesday, Reuters reported.\nIran’s former president Hassan Rouhani said on Wednesday that after 24 years of membership he had been barred from seeking re-election to the body that appoints the country’s supreme leader, AFP reported.\nUpdated at 16.36 CET\n24 Jan 2024 15.46 CET Israeli occupation in Khan Younis is 'isolating hospitals', says Gaza health ministry Witnesses reported fierce gunbattles in the west of Khan Younis, where the Israeli military said it had killed “numerous” squads of gunmen “with sniper, tank and aerial fire”, says Reuters. Ashraf al-Qidra, a spokesperson for the Hamas-run Gaza health ministry, said in a statement: “The occupation is isolating hospitals in Khan Younis and carrying out massacres in the western area of the city … Hundreds of injuries, patients, and childbirth cases face serious complications due to the lack of access to Nasser medical complex.” The Palestinian Red Cross Society, which runs the al-Amal hospital, said troops had blockaded its staff inside and imposed a curfew in the area, including its local headquarters, where three displaced individuals had been killed. Israel says Hamas fighters operate in and around hospitals, which hospital staff and Hamas deny. On Tuesday, the Israeli military ordered the evacuation of the area, which the UN humanitarian office said held 500,000 people, four-fifths of them displaced by fighting in other parts of the coastal strip. However, Israeli tanks advancing eastward down the al-Bahar road towards Nasser hospital blocked the escape route from the city towards the Mediterranean coastal highway, which leads towards Rafah on Gaza’s southern edge bordering Egypt. Some people resorted to dirt roads to try to escape Khan Younis, residents and freelance reporters leaving the area told Reuters.\nUpdated at 16.00 CET\n24 Jan 2024 15.28 CET Israel continues to target health institutions in Gaza, says WHO regional director Ahmed Al-Mandhari, the World Health Organization’s regional director for the eastern Mediterranean, has said Israel is continuing to target health institutions in Gaza, reports Al Jazeera citing comments made during a press conference on Wednesday about the healthcare system in the Gaza Strip. He said attacks on health institutions were a flagrant violation of international humanitarian law and highlighted that 660 attacks were recorded on health institutions, about half of them in northern Gaza. He also spoke of the cutting off of medical supplies and fuel, as well as the WHO’s challenges in accessing hospitals in northern Gaza. Mandhari said the situation in the Gaza Strip was catastrophic and that the number of workers in medical institutions had decreased to just 5%. He said that patients were dying due to lack of medicines and the WHO’s pleas were going unanswered.\nUpdated at 15.43 CET\n24 Jan 2024 14.56 CET 'There will be no ceasefire' – Israeli government rules out suspension of hostilities in Gaza An Israeli government spokesperson has ruled out a Gaza ceasefire on Wednesday, despite reports that negotiations on hostage releases were progressing and repeated international calls for Israel to cease its months-long bombardment of the Gaza Strip. Ilana Stein said in a briefing: Commenting on reported ceasefire agreements, Israel will not give up on the destruction of Hamas, the return of all the hostages, and there will be no security threat from Gaza towards Israel. There will be no ceasefire. In the past there were pauses for humanitarian purposes. That agreement was breached by Hamas.\nUpdated at 15.16 CET\n24 Jan 2024 14.51 CET UNRWA chief says centre for displaced Palestinians hit in Khan Younis, reports mass casualties Thomas White, the director of UNRWA in Gaza, has reported mass casualties and a building ablaze after a training centre was hit in Khan Younis. Fighting is escalating in Khan Younis #Gaza - the @UNRWA Training Centre sheltering 10Ks of displaced people has just been hit - buildings ablaze and mass casualties - safe access to/from the centre has been denied for 2 days - people are trapped. — Thomas White (@TomWhiteGaza) January 24, 2024 More details soon …\nUpdated at 15.19 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Middle East crisis: UN court to deliver Israel genocide ruling on Friday; Houthis fire three missiles at Red Sea ships, says US - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2024/jan/24/middle-east-crisis-live-updates-us-military-strikes-houthi-rebels-yemen-red-sea-israel-gaza-war-hamas-hostages"}