{"authors": [], "date_download": "2024-02-05 15:36:50", "date_modify": "None", "date_publish": "2023-11-20 05:02:39", "description": "When Israeli warplanes swooped over the Gaza Strip following Hamas militants’ brutal attack on southern Israel, Palestinians say a different kind of war took hold in the occupied West Bank", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fisraeli-ap-west-bank-gaza-united-nations-b2450212.html.json", "image_url": "https://static.independent.co.uk/2023/11/20/05/Israel_Palestinians_West_Bank%27s_War_96434.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWhen Israeli warplanes swooped over the Gaza Strip following Hamas militants’ deadly attack on southern Israel, Palestinians say a different kind of war took hold in the occupied West Bank.\nOvernight, the territory was closed off. Towns were raided, curfews imposed, teenagers arrested, detainees beaten, and villages stormed by Jewish vigilantes.\nWith the world’s attention on Gaza and the humanitarian crisis there, the violence of war has also erupted in the West Bank. Israeli settler attacks have surged at an unprecedented rate, according to the United Nations. The escalation has spread fear, deepened despair, and robbed Palestinians of their livelihoods, their homes and, in some cases, their lives.\n“Our lives are hell,” said Sabri Boum, a 52-year-old farmer who fortified his windows with metal grills last week to protect his children from settlers he said threw stun grenades in Qaryout, a northern village. “It's like I'm in a prison.”\nIn six weeks, settlers have killed nine Palestinians, said Palestinian health authorities. They've destroyed 3,000-plus olive trees during the crucial harvest season, said Palestinian Authority official Ghassan Daghlas, wiping out what for some were inheritances passed through generations. And they've harassed herding communities, forcing over 900 people to abandon 15 hamlets they long called home, the U.N. said.\nWhen asked about settler attacks, the Israeli army said only that it aims to defuse conflict and troops “are required to act” if Israel citizens violate the law. The army didn't respond to requests for comment on specific incidents.\nU.S. President Biden and other administration officials have repeatedly condemned settler violence, even as they defended the Israeli campaign in Gaza.\n“It has to stop,” Biden said last month. \"They have to be held accountable.\"\nThat hasn't happened, according to Israeli rights group Yesh Din. Since Oct. 7, one settler has been arrested — over an olive farmer's death — and was released five days later, the group said. Two other settlers were placed in preventive detention without charge, it said.\nNaomi Kahn, of advocacy group Regavim, which lobbies for settler interests, argued that settler attacks weren't nearly as widespread as rights groups report because it's a broad category including self-defense, anti-Palestinian graffiti and other nonviolent provocations.\n“The entire Israeli system works not only to stamp out this violence but to prevent it,” she said.\nBefore the Hamas assault, 2023 already was the deadliest year for Palestinians in the West Bank in over two decades, with 250 Palestinians killed by Israeli fire, most during military operations.\nOver these six weeks of war, Israeli security forces have killed another 206 Palestinians, the Palestinian Health Ministry said, the result of a rise in army raids backed by airstrikes and Palestinian militant attacks. In the deadliest West Bank raid since the second Palestinian intifada, or uprising, of the 2000s, Israeli forces killed 14 Palestinians in the Jenin refugee camp Nov. 9, most of them militants.\nWhile for years settlers enjoyed the support of the Israeli government, they now have vocal proponents at the highest levels of Prime Minister Benjamin Netanyahu's coalition. This month, Netanyahu appointed Zvi Sukkot, a settler temporarily banned from the West Bank in 2012 over alleged assaults targeting Palestinians and Israeli forces, to lead the subcommittee on West Bank issues in parliament.\nPalestinians who've endured hardships of Israeli military rule, in its 57th year, say this war has left them more vulnerable than ever.\n“We’ve become scared of tomorrow,” said Abdelazim Wadi, 50, whose brother and nephew were fatally shot by settlers, according to health authorities.\nConflict has long been part of daily life here, but Palestinians say the war has unleashed a new wave of provocations, disrupting even their grim routine.\nTHE SETTLERS IN FATIGUES\nIsrael captured the West Bank, east Jerusalem and Gaza in the 1967 Mideast war. Settlers claim the West Bank as their biblical birthright. Most of the international community considers the settlements, home to 700,000 Israelis, illegal. Israel considers the West Bank disputed land, and says the settlements' fate should be decided in negotiations. International law says the military, as the occupying power, must protect Palestinian civilians.\nPalestinians say that in nearly six decades of occupation, Israeli soldiers often failed to protect them from settler attacks or even joined in.\nSince the war's start, the line between settlers and soldiers has blurred further.\nIsrael’s wartime mobilization of 300,000-plus reservists included the call-up of settlers for duty and put many in charge of policing their own communities. The military said in some cases, reservists who live in settlements replaced regular West Bank battalions deployed in the war.\nTom Kleiner, a reservist guarding Beit El, a religious settlement near the Palestinian city of Ramallah, said the Oct. 7 Hamas attack's brutality cemented his conviction that Palestinians are determined to “murder us.”\n“We don’t kill Arabs without any reason,” he said. “We kill them because they’re trying to kill us.”\nRights groups say uniforms and assault rifles have inflated settlers' sense of impunity.\n“Imagine that the military supposed to protect you is now made of settlers committing violence against you,” said Ori Givati, of Breaking the Silence, a whistleblower group of former Israeli soldiers.\nBashar al-Qaryoute, a medic from the Palestinian village of Qaryout, said residents from the nearby settlement Shilo, now wearing fatigues, have blocked all but one road out. He said they smashed Qaryout’s water pipeline, forcing residents to truck in water at triple the price.\n“They were the ones always burning olive trees and creating problems,” al-Qaryoute said. “Now they're in charge.”\nTHE CURFEW\n“Close it!” a soldier barked at Imad Abu Shamsiyya when he met the young man's eyes through his open window. Then, he pointed his rifle.\nOver 52 years, Abu Shamsiyya has witnessed crises strike the heart of Hebron, the only place in which Jewish settlers live amid local residents, not in separate communities.\nHe thought life in the maze of barbed wire and security cameras couldn't get worse. Then came the war.\n“This terror, these pressures,” he said, \"are unlike before.\"\nThe Israeli military has barred 750 families in Hebron's Old City — where some 700 radical Jewish settlers live among 34,000 Palestinians under heavy military protection — from stepping outside except for one hour in the morning and one in the evening on Sundays, Tuesdays and Thursday, said residents and Israeli human rights organization B’Tselem.\nSchools have closed. Work has stopped. Sick people have moved in with relatives in the Palestinian-controlled part of town. Israeli settlers often roam at night, taunting Palestinians trapped indoors, according to footage published by B'Tselem.\nCheckpoints instill dread. Soldiers who in the past just glanced at Abu Shamsiyya’s ID now search his phone and social media. They pat him down, he said, gawking and cursing.\n“Hebron is a blatant microcosm of how Israel is exerting control over the Palestinians population,” said Dror Sadot, of B'Tselem.\nThe Israeli military didn't respond to a request for comment on the curfew.\nTHE SETTLER RAID\nThe grinding of a bulldozer's gears. The crack of a gun. With a glance, parents let each other know the drill: Grab the children, lock the doors, keep away from windows.\nPalestinians say settlers storm the northern village of Qusra almost daily, covering olive orchards in cement and dousing cars and homes in gasoline.\nOn Oct. 11, settlers tore through dusty streets, shooting at families in their homes. Within minutes, three Palestinian men were dead.\nIsraeli forces sent to disperse armed settlers and Palestinian stone-throwers fired into the crowd, killing a fourth villager, Palestinian officials said.\nThe next day, settlers heeded social-media calls to ambush a funeral procession the village coordinated with the army. They cut off roads and sprayed bullets at mourners who sprang from cars and sprinted through fields, attendees said.\nIbrahim Wadi, a 62-year-old chemist, and his 26-year-old son Ahmed, a lawyer, were killed. The funeral for four became one for six.\nSettlers’ online posts rejoicing at the deaths, shared with The Associated Press, stung Ibrahim's brother, Abdelazim, almost as much as the loss.\n“The mind breaks down, it stops comprehending,” he said.\nTHE GHOST TOWN\nFinance Minister Bezalel Smotrich said Israel should “wipe out” Palestinian town Hawara after a gunman killed two Israeli brothers in February, sending hundreds of settlers on a deadly rampage.\nAnother far-right religious lawmaker, Zvika Fogel, said he wanted to see the commercial hub “closed, incinerated.\"\nToday, Hawara resembles a ghost town.\nThe army shuttered shops “to maintain public order” after Palestinian militant attacks, it said. Abandoned dogs roam among vandalized storefronts. Posters with a Talmudic justification for killing Palestinians adorn road blocks: “Rise and kill first.\"\nFrom the war's start, much of the West Bank's main north-south highway has been closed to Palestinians, said anti-settlement watchdog Peace Now. Commutes that took 10 to 20 minutes now take hourslong detours on dangerous dirt roads.\nThe restrictions, said Palestinian politician Mustafa Barghouti, “have divided the West Bank into 224 ghettos separated by closed checkpoints.”\nThe 160,000 Palestinian laborers who passed those checkpoints to work in Israel and Israeli settlements before Oct. 7 lost their coveted permits overnight, said Israel's defense agency overseeing Palestinian civil matters. The agency allowed 8,000 essential workers to return to factories and hospitals earlier this month. There's no word on when the rest can.\n“My grandfather relies on me, and now I have nothing,” said Ahmed, a 27-year-old from Hebron who lost his barista job in Haifa, Israel. He declined to give his last name for fear of reprisals.\n“The pressure is building. We expect the West Bank to explode if nothing changes.\"\nTHE OLIVE HARVEST\nPalestinians wait all year for the autumn moment that olives turn from green to black. The two-month harvest is a beloved ritual and income boost.\nViolence has marred the season. Soldiers and settlers blocked villagers from reaching orchards and used bulldozers to remove gnarled roots of centuries-old trees, they say.\nHafeeda al-Khatib, an 80-year-old farmer in Qaryout, said soldiers shot in the air and dragged her from her land when they caught her picking olives last week. It's the first year she can remember not having enough to make oil.\nIn a letter to Netanyahu this month, Smotrich called for a ban on Palestinians harvesting olives near Israeli settlements to reduce friction.\nPalestinians say settlers' efforts have done the opposite.\n“They've declared war on me,” said Mahmoud Hassan, a 63-year-old farmer in Khirbet Sara, a northern community. He said reservist settlers have surrounded it. If he ventures 100 meters (yards) to his grove, he said, soldiers standing sentry scream or fire into the air. He needs permission to leave home and return.\n“There is no room anymore for talking to them or negotiating,\" he said.\nThe military said it “thoroughly reviewed” reports of violence against Palestinians and their property. “Disciplinary actions are implemented accordingly,” it said, without elaborating.\nTHE EVACUATION\nRights groups say the goal of settler violence is to clear Palestinians from land they claim for a future state, making room for Jewish settlements to expand.\nThe Bedouin hamlet of Wadi al-Seeq was pushed to its breaking point by three detained Palestinians' ordeal over nine hours Oct. 12. The harrowing accounts were first reported by Israel’s Haaretz daily. Weeks of vigilante violence had already forced 10 families to flee when masked settlers in army uniforms barreled through that day, slamming a Bedouin resident and two Palestinian activists onto the ground and shoving them into pickups, villagers said.\nOne of the activists, 46-year-old Mohammed Matar, told AP they were bound, beaten, blindfolded, stripped to their underwear and burned by cigarettes.\nMatar said reservist settlers urinated on him, penetrated him anally with a stick, and screamed at him to leave and go to Jordan.\nWhen released, Matar left. So did Wadi al-Seeq’s 30 remaining families. They took their sheep to the creases of the hills east of Ramallah and abandoned everything else.\nThe Israeli military said it fired the commander in charge and was investigating.\nMatar said that to move on, he needs Israel to hold someone accountable.\n“I'd be satisfied with the bare minimum,\" he said, “the tiniest shred of justice.”\n___\nFind AP's full coverage at https://apnews.com/hub/israel-hamas-war", "source_domain": "www.independent.co.uk", "text": null, "title": "With the world's eyes on Gaza, attacks are on the rise in the West Bank, which faces its own war", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/israeli-ap-west-bank-gaza-united-nations-b2450212.html"}