{"authors": [], "date_download": "2024-02-05 15:36:52", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Click to expand Image \"Hostage justice\" survivor event at the Japanese National Diet, November 10, 2023. 2023 Human Rights Watch \"My family was torn apart. I truly cannot stop regretting.\" \"The right to life was taken from my husband. This justice system needs to change.\" Survivors of Japan's so-called \"hostage justice\" system came together recently at the Japanese Diet to share their stories of the long, painful history of abuses under Japan's legal system. Nearly 200 people, including 23 \"hostage justice\" survivors and their families as well as eight Diet members, gathered on November 10 to demand reform of Japan's criminal justice system. Under \"hostage justice,\" authorities coerce suspects to confess through repeated arrests and denial of bail. They are often stripped of their right to remain silent, questioned without a lawyer, and detained for prolonged periods under constant surveillance in police stations. Authorities deny those arrested of their right to presumption of innocence. These abusive practices have resulted in lives and families being torn apart as well as numerous wrongful convictions. There are many victims of \"hostage justice\" in Japan, but it has been difficult for them to speak out due to the stigma attached to arrest, detention, and conviction. The gathering was remarkable in that it was the first time that many survivors and family members were able to courageously speak about their personal experience. Among them was Koki Takatsu (a pseudonym), who was accused of being responsible for the death of his infant child and placed in pretrial detention for more than two years before being acquitted in 2021, and Yoshiko Nakamura, whose husband died in 2019 after being denied adequate medical services while being detained for five months. Diet member Sakura Uchikoshi raised a recent case in which a court in the United Kingdom refused to extradite a British suspect to Japan, citing human rights concerns about possible abuses in Japan's criminal justice system. \"We must bring our criminal justice from the medieval era to a modern international standard,\" she said. The event was hosted by the \"End 'Hostage Justice' in Japan\" project, which is jointly run by Human Rights Watch and Innocence Project Japan, a Japanese nongovernmental group. The Japanese government should listen and undertake wide-ranging reforms, including amending Japan's criminal procedure code, to respect everyone's rights to due process and to a fair trial, and make investigators and prosecutors more accountable.", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274037285%2Fsurvivors-demand-change-to-japan-hostage-justice-system.json", "image_url": "https://cdn.bignewsnetwork.com/MDZhNDQwNmQtZTh.jpg", "language": "en", "localpath": null, "maintext": "\"My family was torn apart. I truly cannot stop regretting.\"\n\"The right to life was taken from my husband. This justice system needs to change.\"\nSurvivors of Japan's so-called \"hostage justice\" system came together recently at the Japanese Diet to share their stories of the long, painful history of abuses under Japan's legal system.\nNearly 200 people, including 23 \"hostage justice\" survivors and their families as well as eight Diet members, gathered on November 10 to demand reform of Japan's criminal justice system.\nUnder \"hostage justice,\" authorities coerce suspects to confess through repeated arrests and denial of bail. They are often stripped of their right to remain silent, questioned without a lawyer, and detained for prolonged periods under constant surveillance in police stations. Authorities deny those arrested of their right to presumption of innocence. These abusive practices have resulted in lives and families being torn apart as well as numerous wrongful convictions.\nThere are many victims of \"hostage justice\" in Japan, but it has been difficult for them to speak out due to the stigma attached to arrest, detention, and conviction. The gathering was remarkable in that it was the first time that many survivors and family members were able to courageously speak about their personal experience.\nAmong them was Koki Takatsu (a pseudonym), who was accused of being responsible for the death of his infant child and placed in pretrial detention for more than two years before being acquitted in 2021, and Yoshiko Nakamura, whose husband died in 2019 after being denied adequate medical services while being detained for five months.\nDiet member Sakura Uchikoshi raised a recent case in which a court in the United Kingdom refused to extradite a British suspect to Japan, citing human rights concerns about possible abuses in Japan's criminal justice system. \"We must bring our criminal justice from the medieval era to a modern international standard,\" she said.\nThe event was hosted by the \"End 'Hostage Justice' in Japan\" project, which is jointly run by Human Rights Watch and Innocence Project Japan, a Japanese nongovernmental group. The Japanese government should listen and undertake wide-ranging reforms, including amending Japan's criminal procedure code, to respect everyone's rights to due process and to a fair trial, and make investigators and prosecutors more accountable.\nSource: Human Rights Watch", "source_domain": "www.theuknews.com", "text": null, "title": "Survivors Demand Change to Japan's 'Hostage Justice' System", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274037285/survivors-demand-change-to-japan-hostage-justice-system"}