{"authors": [], "date_download": "2024-02-05 15:36:53", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The British Defense Ministry said Saturday in its daily intelligence update on Russia’s invasion of Ukraine that over the last week there has been in", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274037615%2Fbritish-defense-ministry-cites-intense-ground-combat-in-ukraine.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700300172.jpg", "language": "en", "localpath": null, "maintext": "The British Defense Ministry said Saturday in its daily intelligence update on Russia's invasion of Ukraine that over the last week there has been intense ground combat in three areas - the Kupiansk axis in Luhansk oblast; Avdiivka in Donetsk oblast; and on the left bank of the Dnipro River in Kherson oblast, where Ukrainian forces have established a bridgehead.\nWhile Russia had 'particularly heavy casualties' around Avdiivka, the report said, neither side has achieved much progress in any of the locations.\nThere are not likely to be any substantial changes in the areas, the British ministry warned, as the Eastern European winter sets in.\nUkrainian President Volodomyr Zelenskyy said Friday in his daily address that Ukraine 'will find resources for the reconstruction of universities damaged by Russian attacks.'\nHe said he visited one of the schools Friday - Mariupol State University, which has relocated to Kyiv. Zelenskyy said the university is 'working' and 'preserves faith in Ukraine, in our people, and in the belief that Ukraine will be free.'\nThe Moscow Times, an online newspaper popular among Russia's expatriates, was added Friday to the list of 'foreign agents' by Russia's Justice Ministry. This was the latest addition in Russia's continuing crackdown on news media and opposition critical of its war in Ukraine.\nThe foreign agent designation subjects individuals and organizations to increased financial scrutiny and requires any of their public material to prominently include notice of being declared a foreign agent. The label aims at undermining the designee's credibility.\nIt was not immediately clear how the move would affect The Moscow Times, which moved its editorial operations out of Russia in 2022 after the passage of a law imposing stiff penalties for material regarded as discrediting the Russian military and its war in Ukraine.\nRussia has methodically targeted people and organizations critical of the Kremlin, branding many as foreign agents and some as 'undesirable' under a 2015 law that makes membership in such organizations a criminal offense.\nThe Moscow Times publishes in English and in Russian, but its Russian-language site was blocked in Russia several months after the Ukraine war began.\nFoothold across the Dnipro\nUkraine's military said on social media Friday that it had gained 'a foothold on several bridgeheads' on the eastern bank of the Dnipro River, near the key southern city of Kherson.\nRussia conceded that Ukrainian forces had claimed back some territory on the opposing bank.\nUkrainian troops are trying to push Russian forces away from the Dnipro to stop them from shelling civilian areas on the Ukrainian-held west bank, the general staff of the Ukrainian Armed Forces said in a report Friday.\nUkraine also said Friday it has destroyed 15 Russian naval vessels and damaged 12 others in the Black Sea since the Russia's invasion began in February 2022.\nUkraine has forced Russia to move its naval forces to positions more difficult for Kyiv's weapons to reach, navy spokesperson Dmytro Pletenchuk said in televised comments.\nRussia is also suffering logistical problems, he said, because it had to move vessels to Novorossiysk and periodically to Tuapse, both ports on the eastern flank of the Black Sea southeast of Crimea and farther from Ukraine.\nThe Associated Press and Reuters could not independently confirm battlefield claims. Russia usually does not acknowledge damage to its military assets and says it repels most Ukrainian attacks.\nMore aid\nMeanwhile, EU membership talks with Ukraine are at risk, and there is no agreement in the bloc to grant Kyiv a further $54 billion in aid, a senior official, who spoke on the condition of anonymity, said Friday.\nThe official said Hungary is potentially obstructing the unanimity necessary for Ukraine's EU membership talks.\nThe proposal by the bloc's executive European Commission to revise its long-term budget to assign the funds for Ukraine through 2027 was also criticized from several sides, said the official.\n'Leaders ... were realizing it's quite expensive,' said the official, who is involved in preparing a Dec. 14-15 summit in Brussels of the 27 EU member states' national leaders. 'How do we pay for this?'\nThe downbeat comments reflect the increasing fatigue and gloomier mood setting in among Kyiv's Western backers as the war drags on.\nThe Dutch government has earmarked $2.2 billion more in military aid for Ukraine in 2024, in what Defense Minister Kajsa Ollongren said Friday was a sign of unwavering support for Kyiv's war against Russia.\nIt is part of a wider package the Netherlands will provide to Ukraine next year that includes an initial $111 million for reconstruction and humanitarian aid that will be increased during the year if needed.\nThe latest package takes the total amount of Dutch support for Ukraine during the conflict to around $8 billion, Ollongren said.\n'What's most critical for me is that we'll be providing an additional 2 billion euros [$2.2 billion] in military aid next year,' Ollongren told Reuters.\nMilitary conference\nUkraine and the United States will hold a military industry conference next month, Zelenskyy said in a Friday evening address.\n'In December of this year, a special conference involving Ukrainian and American industries, government officials and other state actors will take place - everyone involved in organizing our defense,' he said.\nKyiv is ramping up efforts to produce its own weapons amid concerns that supplies from the West might be faltering. It also hopes joint ventures with international armament producers can help revive its domestic industry.\nSome information in this report came from The Associated Press and Reuters.", "source_domain": "www.britainnews.net", "text": null, "title": "British Defense Ministry Cites Intense Ground Combat in Ukraine", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274037615/british-defense-ministry-cites-intense-ground-combat-in-ukraine"}