{"authors": [], "date_download": "2024-02-05 15:36:54", "date_modify": "None", "date_publish": "2023-11-20 13:32:03", "description": "Spanish Prime Minister Pedro Sánchez says women will hold 12 of the 22 posts in his new government", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fpedro-sanchez-ap-cabinet-socialist-spanish-b2450430.html.json", "image_url": "https://static.independent.co.uk/2023/11/20/13/Spain_Politics_13083.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nWomen will hold 12 of the 22 posts in the new government named Monday by Spain’s recently reelected Socialist Prime Minister Pedro Sánchez.\n“The new government is going to have a marked feminist accent with four women deputy prime ministers and more female ministers than male ministers,” Sánchez said.\nThe Cabinet will include nine new ministers while key posts remain unchanged. Nadia Calviño keeps the economy portfolio, José Manuel Albares remains in charge of foreign affairs and Margarita Robles stays at defense.\nSánchez’s Socialist party will hold 17 ministries and its leftist Sumar (Joining Forces) coalition partner will have five portfolios.\nThe outgoing government's former far-left coalition partner, Unidas Podemos (Unite We Can), will have no ministries. The party's former star, Equality Minister Irene Montero, will be replaced by Ana Redondo of the Socialist party.\nSánchez was reelected prime minister on Thursday with backing from 179 lawmakers in Spain's 350-seat parliament. His election was opposed by 171 deputies from the center-right Popular Party and the far-right Vox.\nHis new term has gotten off to a stormy start after he clinched the support in parliament of two Catalan separatist parties in exchange for a controversial amnesty proposal for hundreds of people in legal trouble over the Catalonia region’s failed secession attempt in 2017.\nThe proposal has triggered massive protests called by the Popular Party and Vox. Several held by extreme right-wing groups close to the Socialist party's headquarters in Madrid ended in clashes with police.\nSpeaking Monday, Sánchez promised to “prioritize dialogue and negotiation in a legislature that will be key for the social and territorial cohesion of Spain.”", "source_domain": "www.independent.co.uk", "text": null, "title": "Women make up more than half of ministers in the new Cabinet of Spanish Prime Minister Pedro Sánchez", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/pedro-sanchez-ap-cabinet-socialist-spanish-b2450430.html"}