{"authors": [], "date_download": "2024-02-05 15:36:56", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "LONDON - British author A.S. Byatt, who wove history, myth and a sharp eye for human foibles into books that included the Booker Prize-winning novel Pos", "filename": "https%3A%2F%2Fwww.theuknews.com%2Fnews%2F274037488%2Fas-byatt-who-wrote-bestseller-possession-dies-at-87.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700287581.jpg", "language": "en", "localpath": null, "maintext": "LONDON - British author A.S. Byatt, who wove history, myth and a sharp eye for human foibles into books that included the Booker Prize-winning novel Possession, has died at the age of 87.\nByatt's publisher, Chatto & Windus, said Friday that the author, whose full name was Antonia Byatt, died 'peacefully at home surrounded by close family' on Thursday.\nByatt wrote two dozen books, starting with her first novel, The Shadow of the Sun, in 1964. Her work was translated into 38 languages.\nPossession, published in 1990, follows two young academics investigating the lives of a pair of imaginary Victorian poets. The novel, a double romance which skillfully layers a modern story with mock-Victorian letters and poems, was a huge bestseller and won the prestigious Booker Prize.\nAccepting the prize, Byatt said Possession was about the joy of reading.\n'My book was written on a kind of high about the pleasures of reading,' she said.\n'Possession' was adapted into a 2002 film starring Gwyneth Paltrow and Aaron Eckhart. It was one of several Byatt books to get the film treatment. Morpho Eugenia, a gothic Victorian novella included in the 1992 book Angels and Insects, became a 1995 movie of the same name, starring Mark Rylance and Kristin Scott Thomas.\nHer short story The Djinn in the Nightingale's Eye, which won the 1995 Aga Khan Prize for Fiction, inspired the 2022 fantasy film Three Thousand Years of Longing. Directed by Mad Max filmmaker George Miller, it starred Idris Elba as a genie who spins tales for an academic played by Tilda Swinton.\nByatt's other books include four novels set in 1950s and '60s Britain that together are known as the Frederica Quartet: The Virgin in the Garden, published in 1978, followed by Still Life, Babel Tower and A Whistling Woman. She also wrote the 2009 Booker Prize finalist The Children's Book, a sweeping story of Edwardian England centered on a writer of fairy tales.\nHer most recent book was Medusa's Ankles, a volume of short stories published in 2021.\nByatt's literary agent, Zoe Waldie, said the author 'held readers spellbound' with writing that was 'multilayered, endlessly varied and deeply intellectual, threaded through with myths and metaphysics.'\nClara Farmer, Byatt's publisher at Chatto & Windus - part of Penguin Random House - said the author's books were 'the most wonderful jewel-boxes of stories and ideas.'\n'We mourn her loss, but it's a comfort to know that her penetrating works will dazzle, shine and refract in the minds of readers for generations to come,' Farmer said.\nBorn Antonia Susan Drabble in Sheffield, northern England, in 1936 - her sister is novelist Margaret Drabble - Byatt grew up in a Quaker family, attended Cambridge University and worked for a time as a university lecturer.\nShe married economist Ian Byatt in 1959 and they had a daughter and a son before divorcing. In 1972, her 11-year-old son, Charles, was struck and killed by a car while walking home from school.\nCharles died shortly after Byatt had taken a teaching post at University College London to pay for his private school fees. After his death, she told The Guardian in 2009, she stayed in the job 'as long as he had lived, which was 11 years.' In 1983, she quit to become a full-time writer.\nByatt lived in London with her second husband, Peter Duffy, with whom she had two daughters.\nQueen Elizabeth II made Byatt a dame, the female equivalent of a knight, in 1999 for services to literature, and in 2003 she was made a chevalier (knight) of France's Order of Arts and Letters.\nIn 2014, a species of iridescent beetle was named for her - Euhylaeogena byattae Hespenheide - in honor of her depiction of naturalists in Morpho Eugenia.", "source_domain": "www.theuknews.com", "text": null, "title": "AS Byatt, Who Wrote Bestseller 'Possession, Dies at 87", "title_page": null, "title_rss": null, "url": "https://www.theuknews.com/news/274037488/as-byatt-who-wrote-bestseller-possession-dies-at-87"}