{"authors": [], "date_download": "2024-02-05 15:36:57", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Soldiers searching through Gaza Shifa Hospital have found a laptop containing videos and photographs of hostages, the Israel Defense Forces announced on Thurs", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274035709%2Flaptop-found-in-shifa-hospital-contains-photos-of-hostages.json", "image_url": "https://cdn.bignewsnetwork.com/ani1700163732.jpg", "language": "en", "localpath": null, "maintext": "Tel Aviv [Israel], November 17 (ANI/TPS): Soldiers searching through Gaza's Shifa Hospital have found a laptop containing videos and photographs of hostages, the Israel Defense Forces announced on Thursday.\n\"Already now, after scanning some of the buildings, weapons, intelligence materials, including information related to the events of 7/10, military technologies and military equipment, headquarters, means of communication - all belonging to Hamas - have been located,\" the IDF said in a statement.\n\"In the scans, technological means were located, including computers on which information and documentation related to the abductees was found. The finds were transferred for inspection and investigation,\" the statement added.\nThe announcement was made after the IDF allowed a BBC News crew to see part of the hospital. Inside Shifa's MRI department, IDF Spokesperson Lt.-Col. Jonathan Conricus showed Kalashnikov rifles, bulletproof vests and ammunition. Conricus said other guns and grenades were found before he disclosed the laptop's discovery.\nThe images, he said, were taken after Hamas's October 7 attacks. Conricus added that the laptop also had footage released by the IDF of several Hamas terrorists captured and imprisoned in Israel discussing the atrocities they participated in.\nThe military statement said that the soldiers were moving from building to building in the Shifa complex, searching floor by floor without any harm to Shifa's hundreds of patients, hospital staff or the Israeli soldiers.\n\"We operate with the understanding that there are many more terrorist infrastructures in the area of the complex that are well buried.\nShifa Hospital, located in the North Rimal neighbourhood and boasting 570 beds, is Gaza's largest medical centre, serving the medical needs of hundreds of thousands of Palestinians. It was originally built by the British authorities in 1946. In the 1980s, Israel renovated and expanded Shifa as part of an initiative to improve Gaza living conditions.\nAs far back as 2009, the Israeli Security Agency (Shin Bet) reported during the Gaza war of that year that Hamas operatives were hiding in the hospital and that the basement had become Hamas's headquarters.\nAs the Tazpit Press Service reported, in addition to being used to hide Hamas leaders and hostages, the terror group is known to have launched rockets, tortured suspected collaborators and hoarded a half-million litres of fuel in the hospital compound. (ANI/TPS)", "source_domain": "www.britainnews.net", "text": null, "title": "Laptop found in Shifa hospital contains photos of hostages", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274035709/laptop-found-in-shifa-hospital-contains-photos-of-hostages"}