{"authors": ["Jon Michael Raasch", "Jon Michael Raasch For Dailymail.Com"], "date_download": "2024-02-05 15:16:08", "date_modify": "None", "date_publish": "2024-01-24 18:55:06", "description": "A bipartisan coalition of senators warned Biden that they are concerned over escalating tensions in the Yemen as the administration approved military action without congressional approval.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-13001811%2Fbiden-warned-republican-democrat-senators-not-escalate-strikes-houthis-yemen.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2024/01/24/18/80420999-0-image-m-9_1706120092522.jpg", "language": "en", "localpath": null, "maintext": "A bipartisan coalition of senators sent a letter to Biden questioning the strikes\nThe first U.S. strike in Yemen happened on January 12 in response to Houthi attacks on civilian and military ships in the Red Sea\nThe U.S. and U.K. have conducted several attacks on the Houthis in Yemen\nA bipartisan coalition of senators warned Biden that they are concerned over escalating tensions in the Middle East as the administration unilaterally approved military action in the region without congressional approval.\nThe U.S., in collaboration with U.K. military forces, first deployed cruise missiles into Yemen on Jan. 11 in response to Houthi attacks on civilian and military ships in the Red Sea. The U.S. and U.K. conducted eight further strikes against the Iran-backed terrorist group on Jan. 22.\nAdditionally, the Houthis launched missiles at container shipping vessels today, indicating the Iran-U.S. conflict remains ongoing.\nThe strikes have ignited a debate over whether the U.S. is at war in the Middle East.\n'They're shooting at us. We're shooting at them,' Alabama Sen. Tommy Tuberville said Tuesday. 'I guess you could call it war. I don't know any other way to put it.'\nHowever, when asked on Saturday if the U.S. is at war, the Pentagon was quick to shoot down that notion.\n'We don't think that we are at war,' Pentagon spokesperson Sabrina Singh said.\nFootage shows flames erupting amid a major bombardment of Yemen by UK and US forces on January 11\nIn a letter to President Biden Tuesday obtained by DailyMail.com, two Republicans and two Democrats questioned the president's legal authority and tactical reasoning behind the attacks.\n'As tensions in the region rise, we believe that American participation in another war in the Middle East cannot happen in the absence of authorization by Congress, following an open debate during which the American public can be informed of the benefits, risks, and consequences of such conflict,' the letter to Biden said.\n'While the Houthis and their backers, namely Iran, bear the responsibility for escalation, unless there is a need to repel a sudden attack the Constitution requires that the United States not engage in military action absent a favorable vote of Congress.'\nThe letter was signed by Sens. Tim Kaine of Virginia, Todd Young of Indiana, Chris Murphy of Connecticut and Mike Lee of Utah.\n'The Administration has stated that the strikes on Houthi targets to date have not and will not deter the Houthi attacks, suggesting that we are in the midst of an ongoing regional conflict that carries the risk of escalation,' the senators wrote in the letter.\nThe letter then requested the Biden administration explain their understanding of 'self-defense,' particularly because the strikes 'are not deterring ongoing and future attacks from the Houthis.'\n'We have long advocated for deliberate congressional processes in and authorizations for decisions that put servicemembers into harm's way overseas. There is no current congressional authorization for offensive U.S. military action against the Houthis.'\nA fighter jet takes off from the USS Dwight D Eisenhower on January 12 as the US launches airstrikes against Houthi targets\nBiden has said the U.S. strikes are in response to 'unprecedented Houthi attacks'\nCrew aboard the USS Dwight D. Eisenhower prepare fighter jets for launch\nThe U.K.'s Royal Air Force launched multiple Typhoon fighter jets to assist in the strikes\nThe letter also requests the administration explain when U.S. forces were introduced into hostilities in Yemen and the Red Sea, and to know what the president's legal rationale for the unilateral military action is.\nWarship and submarine-launched Tomahawk missiles, as well as fighter jets, were used to take out Houthi missile storage sites and launchers on Jan. 22, according to U.S. defense officials, who spoke on the condition of anonymity.\nThe U.K.'s Ministry of Defense said four Typhoon fighter jets, supported by a pair of Voyager refueling tankers, flew from Cyprus to join US forces in the airstrikes.\nIn the Jan. 11 barrage, the U.S. used more than 100 precision missiles striking at around 2:30 a.m. local time on over 60 targets at 16 locations, according to the Air Force.\nThe strikes came from fighter jets, Navy destroyers and a submarine, Biden said after the attack.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Biden warned by Republican AND Democrat senators to not escalate tensions after latest strikes on Houthis in Yemen as lawmakers are sharply divided on whether the U.S. is legally at war in the Middle", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-13001811/biden-warned-republican-democrat-senators-not-escalate-strikes-houthis-yemen.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}