{"authors": ["Jo Tweedy", "Jo Tweedy For Mailonline"], "date_download": "2024-02-05 15:37:00", "date_modify": "None", "date_publish": "2023-11-19 15:28:49", "description": "The Swedish royal couple have been in Germany on an official visit this week, with a large plaster spotted on Crown Princess Victoria's wrist as she waved to crowds in Berlin on Sunday.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Ffemail%2Farticle-12767745%2FCrown-Princess-Victoria-Sweden-sporting-dressing-wrist-joins-husband-Prince-Daniel-guests-Germanys-president-wife-mark-National-Day-Mourning-2023-Berlin.html%3Fns_mchannel%3Drss%26ito%3D1490%26ns_campaign%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/19/15/77988251-0-image-m-35_1700407720153.jpg", "language": "en", "localpath": null, "maintext": "Crown Princess Victoria of Sweden joined her husband Prince Daniel in Berlin today - as guests of the German premier and his wife.\nThe royal, 46, who has been sporting a large plaster on her right wrist during the couple's official visit to Germany, waved at crowds gathered as Germany marked Volkstrauertag - a national day of mourning for those lost in conflict and violent oppression.\nThe Swedish royals were hosted by German Federal President Frank-Walter Steinmeier and his wife Elke Buedenbender at Bellvue Palace in the capital.\nThe national commemoration takes place two weeks before Advent and remembers members of the armed forces lost to armed conflicts.\nVictoria, who later delivered a speech at the German parliament Bundestag, donned a stylish but sedate ensemble for the occasion, wearing a black satin pleated A-line dress, with patent black heels.\nThe Swedish royal couple have been in Germany on an official visit this week and greeted crowds in Berlin on Sunday as the country marked National Day of Mourning 2023\nThe Stockholm-based royal wore her hair neatly pinned back with a black sequinned floral headband.\nPrince Daniel, 50, opted for a navy suit and matching tie for the occasion.\nIn her speech, Crown Princess Victoria told those gathered in the Bundestag that it was an 'honour to attend this day of remembrance for the victims of violence and war with you.'\nShe told the German dignitaries gathered: This is an important moment. My strong family ties to Germany and everything German have been an integral part of my life since I was a child. My feelings for Germany are intimate and deep. This is also an important moment for me as Crown Princess and representative of the crown and Sweden.'\nThe Swedish royal couple - and the German president and his wife - later took part in a wreath-laying ceremony at the Neue Wache memorial to the victims of war and tyranny.\nThe large dressing on Crown Princess Victoria's left wrist was visible as she waved to crowds, with Prince Daniel by her side\nOn the red carpet: German Federal President Frank-Walter Steinmeier, far right, his wife Elke Buedenbender, far left, with Crown Princess Victoria, second from right, and Prince Daniel, second from left\nEarlier this week, the mother-of-two made a solo visit to the German branch of the Swedish medical technology company 'Getinge' in Frankfurt.\nVictoria appeared to take interest in a care bed for infants - which featured a lifelike model inside.\nGetinge expertly crafts medical machines aimed to develop and enhance people's lives - with a particular focus on intensive care machines.\nVictoria took a keen interest in the medical developments and seemed to ask plenty of questions.\nThe Swedish royal and the German president were all smiles as they posed for photos at Bellvue Palace\nCrown Princess Victoria of Sweden delivers her speech at the German parliament Bundestag in occasion of the 'Volkstrauertag', Germany's national day of mourning\nThe commemoration day, which was first observed in 1952, is a memorial to members of the armed forces of all nations as well as civilians who died in armed conflicts, as well as victims of violent oppression.\nCrown Princess Victoria and German President Frank-Walter Steinmeier attend a wreath-laying ceremony at the Neue Wache memorial to the victims of war and tyranny\nThe elegant royal took a moment to reflect after laying her wreath to those lost in war\nPrince Daniel and Elke Buedenbender, wife of the German president also laid wreaths at the Neue Wache memorial\nBundeswehr soldiers arrive with wreaths for a commemoration ceremony at the Neue Wache memorial\nGerman Defense Minister Boris Pistorius far left, Aydan Ozuguz, vice-president of the German Bundestag, second from left, Crown Princess Victoria of Sweden and German President Frank-Walter Steinmeier pictured at the wreath-laying ceremony\nIt comes after the Princess was appointed as a Goodwill Ambassador of the United Nations Development Programme at the Royal Palace in Stockholm.\nShe joins 17 prominent figures, including Malaysian actress Michelle Yeoh, Australian singer and actor Cody Simpson, American musician Bob Weir, American actress Connie Britton and Brazilian footballer Marta Vieira da Silva.\nThe royal was positively glowing in a bright orange Zara blazer, layered over a black blouse and flared trousers.\nThe mother-of-two pictured on Friday - with a dressing on her wrist visible - the German branch of the Swedish medical technology company 'Getinge' in Frankfurt\nVictoria took a particular interest in a care bed for infants, which featured a lifelike model inside\nWhile the visit to Getinge was in Frankfurt today, the company was found in Sweden back in 1904\nThe royal mother-of-two appeared to take an interest in the medical equipment on display at Getinge earlier today\nShe first wore the striking shawl collar blazer, costing £79.99, during the Global Child Forum in December 2022.\nGoodwill Ambassadors are appointed by the UNDP to highlight priority development issues, help spread the universal message of human development and accelerate achievement of the Sustainable Development Goals.\nThe mother-of-two elevated her eye-catching ensemble with heeled ankle boots and statement drop earrings.\nMeanwhile, her raven locks were neatly pinned into a chignon.\nPrincess Victoria has been an Advocate of the UN’s Global Sustainable Development Goals - which aim to eradicate poverty, fight inequality and curb climate change by 2030 - since 2016.\nCrown Princess Victoria of Sweden has been appointed as a Goodwill Ambassador of the United Nations Development Programme at the Royal Palace in Stockholm\nThe royal, 46, was positively glowing in a bright orange Zara blazer, layered over a black blouse and flared trousers\nVictoria joins 17 prominent figures, including Malaysian actress Michelle Yeoh , Australian singer and actor Cody Simpson, American musician Bob Weir, American actress Connie Britton and Brazilian footballer Marta Vieira da Silva\nThe mother-of-two elevated her eye-catching ensemble with heeled ankle boots and statement drop earrings\nPrincess Victoria has served as an Advocate for the UN’s Global Sustainable Development Goals - which aim to eradicate poverty, fight inequality and curb climate change by 2030 - since 2016\nIn November 2022, she accompanied fellow Ambassador Crown Prince Haakon of Norway on a trip to Kenya.\nThey met with local United Nations staff and UNDP representatives at the UN building in Nairobi, which serves as the global headquarters of the UN Environment Programme (UNEP).\nThe UNEP and the UN Human Settlements Programme (UN-Habitat) are the forces behind a new report on plastic pollution in Kenya that was issued during the visit.\nThe three-day trip concluded with a focus on Norwegian-Swedish-Kenyan business cooperation.\nThe new appointment comes after Princess Victoria joined a host of European royals at Prince Christian of Denmark's 18th birthday gala.\nThe new appointment comes after she attended Prince Christian's 18th birthday gala alongside her husband Prince Daniel, 50, and her 11-year-old daughter, Princess Estelle\nThe royal, who is heir to her country's throne, appeared radiant in a cream Elie Saab gown with a square neckline that showed off her sparkling diamond necklace.\nAdding a pair of diamond earrings and an eye-catching tiara to finish off her look, the Princess attended the occasion alongside her husband Prince Daniel, 50, and her 11-year-old daughter, Princess Estelle.\nVictoria and Estelle weren't the only glamorous mother and daughter duo at the gala, with Crown Princess Mette-Marit of Norway, 50, and her daughter Princess Ingrid Alexandra, 19, wearing matching blue gowns and sparkling tiaras.\nThey were joined by Princess Catharina-Amalia of the Netherlands, 19, and Princess Elisabeth of Belgium, 21.\nCatharina-Amalia looked stylish in a caped dress from Essentiel Antwerp, with her long hair down and pinned back with a diamond tiara.\nElisabeth, meanwhile, looked every inch the princess in a cream sleeveless gown from Belgian couture brand Natan, which she teamed with matching gloves.\nThe birthday boy's mother, Crown Princess Mary, 51, who is married to Prince Frederik, the heir apparent to the Danish throne, put on a dazzling display in the diamond tiara she wore on her wedding day in 2004.\nNot be outdone by the younger royals, Queen Margrethe II of Denmark, whose half-century reign makes her Europe's longest-serving monarch, commanded attention in a bright red gown and the Pearl Poire Tiara.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Crown Princess Victoria of Sweden - sporting a dressing on her wrist - joins Prince Daniel in Berlin as guests of Germany's president and his wife to mark National Day of Mourning 2023", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/femail/article-12767745/Crown-Princess-Victoria-Sweden-sporting-dressing-wrist-joins-husband-Prince-Daniel-guests-Germanys-president-wife-mark-National-Day-Mourning-2023-Berlin.html?ns_mchannel=rss&ito=1490&ns_campaign=1490"}