{"authors": [], "date_download": "2024-02-05 15:37:04", "date_modify": "None", "date_publish": "2023-11-19 11:03:23", "description": "’No deal yet but we continue to work hard to get a deal,’ says White House", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fmiddle-east%2Fisrael-hamas-deal-white-house-gaza-b2449858.html.json", "image_url": "https://static.independent.co.uk/2023/11/19/03/GettyImages-1800438064.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe United States is engaged in working towards a tentative agreement between Israel and Hamas to free dozens of hostages in Gaza in exchange for a five-day pause in fighting.\nThe hostage release could begin within the next several days, barring last-minute hitches, the Washington Post reported, quoting people familiar with the detailed, six-page agreement.\nUnder the agreement, all parties would freeze combat operations for at least five days while 50 or more hostages are released in groups every 24 hours, the Post reported.\nQatari prime minister Sheikh Mohammed Bin Abdulrahman al-Thani said on Sunday that he had growing confidence that a hostage deal would be reached between Israel and Hamas.\n“The challenges facing the agreement are just practical and logistical,” Sheikh Mohammed said, adding that the challenges that remained were “very minor.”\nHowever, both Israeli prime minister Benjamin Netanyahu and the White House have said no deal has been officially reached yet.\n“No deal yet but we continue to work hard to get a deal,” the White House’s National Security Council spokesperson Adrienne Watson said in a statement.\nMr Netanyahu told a press conference on Saturday evening: “Concerning the hostages, there are many unsubstantiated rumours, many incorrect reports. I would like to make it clear: As of now, there has been no deal. But I want to promise: When there is something to say we will report to you about it.”\nIsraeli defense forces (IDF) are currently carrying out ground operations in Gaza to destroy Hamas after the militant group’s rampage into Israel on 7 October in which its fighters killed 1,200 people and took 240 hostages.\nIsrael also said it is preparing to expand its offensive in the strip.\nA senior aide to Mr Netanyahu urged Palestinian civilians to relocate away from southern Khan Younis, indicating that a ground offensive into the south is imminent.\nIDF said it was fighting militants in the Zeitoun neighbourhood of Gaza City and on the outskirts of Jabaliya, the refugee camp which is home to one of two schools that were allegedly hit by airstrikes on Saturday.\nThe Hamas-run Gazan Health Ministry says the death toll in the Gaza Strip has already increased to 12,300, including 5,000 children.\nMeanwhile, the families of Israeli hostages taken by Hamas and thousands of supporters arrived after a five-day march in Jerusalem on Saturday.\nThe marchers sought to pressure Israel’s government to do everything they could to bring hostages back.\nSome of the marchers have expressed fear that the Israel military offensive endangers their loved ones but government leaders argue that only military pressure on Hamas can lead to some hostage releases.\nSo far of the 240 hostages kidnapped from Israel into Gaza, only five have been released – four via international diplomacy involving Qatar and one rescued by Israeli troops.\nA humanitarian assessment team that visited Al Shifa Hospital in northern Gaza reported seeing signs of shelling and gunfire in what was described as a “death zone” in a “desperate” situation, according to the World Health Organization (WHO).\nPeople search buildings destroyed during airstrikes on November 18, 2023 in Khan Yunis, Gaza. Heavy fighting rages in the northern Gaza Strip as Israel encircles the area, despite increasingly pressing calls for a ceasefire. (Getty Images)\n“Signs of shelling and gunfire were evident. The team saw a mass grave at the entrance of the hospital and were told more than 80 people were buried there,” the WHO said in a statement.\nThe assessment team which included public health experts, logistics officers, and security staff from various UN departments could reportedly spend only an hour inside the hospital due to security concerns.\nTheir visit, while coordinated with the Israeli military, still occurred with heavy fighting near the hospital.\n“WHO and partners are urgently developing plans for the immediate evacuation of the remaining patients, staff and their families,” the UN organisation said.\nThe hospital was not functioning as a medical facility, according to the team, due to a scarcity of clean water, fuel, medicine, and other essentials.\nPalestinians search the rubble of a building for survivors follwoing Israeli bombardment in Khan Yunis in the southern Gaza Strip on 18 November 2023 amid ongoing battles between Israel and the Palestinian militant group Hamas. (AFP via Getty Images)\nThe WHO reiterated its call for an immediate ceasefire and sustained humanitarian assistance.\nThe territory’s Health Ministry said at least 30 premature babies were evacuated from the hospital on Sunday, and will be transferred to facilities in Egypt.\nA spokesperson for the ministry said 32 babies were among the many critically ill patients stranded at the hospital.\nHowever, US president Joe Biden said that “a ceasefire is not peace”.\n“As long as Hamas clings to its ideology of destruction, a ceasefire is not peace,” the president wrote in an op-ed for the Washington Post on Saturday.\n“An outcome that leaves Hamas in control of Gaza would once more perpetuate its hate and deny Palestinian civilians the chance to build something better for themselves,” Mr Biden wrote.\nProtesters march through the city during the national protest to demand a ceasefire in the Israel-Hamas war on 18 November 2023 in Glasgow, United Kingdom. Voices across the world calling for a ceasefire in Gaza continue to grow as the IDF pushes deeper into Gaza warning people to move south and evacuation orders are issued for the al Shifa hospital. (Getty Images)\nA ceasefire he said would give Hamas the opportunity “to rebuild their stockpile of rockets, reposition fighters and restart the killing by attacking innocents again.”\n“If Hamas cared at all for Palestinian lives, it would release all the hostages, give up arms, and surrender the leaders and those responsible” for the 7 October attacks, the US president said.\n“My administration has called for respecting international humanitarian law, minimizing the loss of innocent lives and prioritizing the protection of civilians,” Mr Biden said, adding that the goal should not be “simply to stop the war for today” but to “end the war forever.”\n“There must be no forcible displacement of Palestinians from Gaza, no reoccupation, no siege or blockade, and no reduction in territory,” the US president said.", "source_domain": "www.independent.co.uk", "text": null, "title": "Israel and Hamas working towards ‘five-day humanitarian pause’ in fighting to free hostages", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/middle-east/israel-hamas-deal-white-house-gaza-b2449858.html"}