{"authors": [], "date_download": "2024-02-05 15:37:07", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Latest developments: Israel warns Palestinians to leave four towns in southern Gaza, possibly presaging new Israeli attacks in the area. Israeli forces", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274035548%2Fisrael-tells-palestinians-to-leave-4-southern-gaza-towns.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700157949.jpg", "language": "en", "localpath": null, "maintext": "Latest developments:\nIsrael warns Palestinians to leave four towns in southern Gaza, possibly presaging new Israeli attacks in the area.\nIsraeli forces continue operations around Shifa Hospital in Gaza.\nU.S. President Joe Biden accuses Hamas of operating a command center at Shifa Hospital, which he called a \"war crime.\" Hamas and hospital officials deny that the medical center - Gaza's largest - is being used for that purpose.\nHamas says in a statement that the Biden administration essentially gave Israel Defense Forces a \"green light\" to carry out the raid, which the White House rejects.\nThe head of the World Health Organization calls the raid \"totally unacceptable.\"\nThe U.N. Security Council passes a resolution calling for the immediate release of all hostages held by Hamas and 'urgent and extended humanitarian pauses\" in Gaza. Israel says the resolution is \"detached from the reality on the ground.\"\nIsrael ordered Palestinians to leave four towns in southern Gaza on Thursday, signaling a possible expansion of its war against Hamas militants into areas where Israeli officials had told people it was safe to stay.\nIsrael dropped leaflets from aircraft overnight, telling civilians to leave the towns of Bani Shuhaila, Khuzaa, Abassan and Qarara, on the eastern edge of Khan Younis, the main southern city.\n'The acts of Hamas terrorist group require the defense forces to act against them in the areas of your residence,' the leaflets said, according to residents. 'For your safety, you need to evacuate your places of residence immediately and head to known shelters.'\nResidents in the area said there was a heavy Israeli bombardment overnight.\nThis handout picture released by the Israeli army on Nov. 15, 2023, reportedly shows Israeli soldiers carrying out operations inside Al-Shifa hospital in Gaza City.\nMeanwhile, in Gaza City, in the northern part of the territory along the Mediterranean Sea, Israeli troops continued to search the Shifa Hospital, which it raided on Wednesday in the belief it was a Hamas command center. Israel displayed weapons it said it found at the hospital and Hamas intelligence reports, but Hamas said no arms were found.\nIsrael has yet to release any evidence of the central Hamas command center that Israel has said was concealed beneath the complex. Hamas and staff at the hospital, Gaza's largest, deny the allegations.\nIf Israel expands its military offensive in south Gaza, it threatens to worsen the already severe humanitarian crisis in the besieged territory. More than 1.5 million people have been internally displaced in Gaza, with most having fled, at Israel's directive, to the south, where food, water and electricity are in diminishing supply.\nPalestinian authorities in Gaza say more than 11,000 people - about 40% of them children - have been killed since Israel launched a major air and ground offensive in response to the October 7 attack by Hamas militants on southern Israel that killed 1,200 people.\nThe Israel Defense Forces described its operation at the Shifa Hospital as 'precise and targeted.\" Israel says Hamas used the hospital as a command center, and patients and staff there as human shields, accusations that Hamas and Gaza health officials deny.\nThe head of the World Health Organization, Tedros Adhanom Ghebreyesus, called the IDF raid on Shifa Hospital \"totally unacceptable.\"\nTedros told a press conference in Geneva Wednesday that \"hospitals are not battlegrounds\" and patients and staff in hospitals must be protected even if the facilities are being used for military purposes.\nU.S. President Joe Biden accused Hamas of operating a command center at Shifa Hospital, which he called a \"war crime.\"\n\"You have a circumstance where the first war crime is being committed by Hamas by having their headquarters, their military hidden under a hospital,\" Biden said during a press conference Wednesday in Woodside, California, after meeting with Chinese leader Xi Jinping. \"And that's a fact. That's what's happened.\"\nMeanwhile, the United Nations Security Council late Wednesday adopted a resolution calling for 'urgent and extended humanitarian pauses\" in Gaza. Twelve council members voted in favor, while none voted against and three - the United States, Russia and the United Kingdom - abstained. Israel's deputy permanent representative said the resolution was \"detached from the reality on the ground.\"\nIsrael Rejects UN Call for 'Extended Humanitarian Pauses' for Gaza\nThe resolution that passed also called for \"the immediate release of all hostages held by Hamas.\"\nNegotiations are reportedly under way on a proposed deal under which Hamas would release at least 50 women and children it is holding as hostages in Gaza in exchange for Palestinian women and children held in Israeli prisons.\nHamas took an estimated 240 Israeli and foreign hostages during the surprise attack it carried out in Israel on October 7.\nThe IDF said Wednesday its forces operating at Shifa Hospital consisted of \"medical teams and Arabic speakers, who have undergone specified training to prepare for this complex and sensitive environment, with the intent that no harm is caused to the civilians.'\nThe military also said it has delivered incubators, baby food and medical supplies to the embattled hospital.\nIsraeli Prime Minister Benjamin Netanyahu said in a statement, 'There is no place in Gaza that we cannot reach. There are no hideouts. There is no shelter or refuge for the Hamas murderers.'\n'We will reach and eliminate Hamas, and we will bring back our hostages,\" he said, \"These are two sacred missions.'\nHamas said in a statement that the Biden administration essentially gave the IDF a \"green light\" to carry out the raid and said Biden would be \"fully responsible\" for the operation's results.\nThe White House rejected Hamas' claim. National Security Council spokesman John Kirby told reporters, 'We did not give an OK to their military operations around the hospital.'\nHamas said about 650 patients and 5,000 to 7,000 Palestinian civilians have taken shelter on the hospital grounds.\nAfter the hospital raid, Biden spoke with Netanyahu about the latest developments in the war. The White House said they discussed at length ongoing efforts to secure the release of hostages, including nine Americans and a foreign national with U.S. employment rights.\nBiden said Tuesday he believes hostages being held by Hamas militants in Gaza are going to be released but gave no timetable. He sent a message to the hostages being held: \"Hang in there. We are coming.\"\nAs its military incursion advances, Israel has rejected growing and intense international pressure to impose a cease-fire to allow for the delivery of humanitarian aid to Gaza. It has, however, agreed to four-hour daily humanitarian pauses to allow the opening of two corridors to let Palestinians evacuate northern Gaza.\nUnited Nations correspondent Margaret Besheer and White House bureau chief Patsy Widakuswara contributed to this report. Some information for this article came from The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.britainnews.net", "text": null, "title": "Israel Tells Palestinians to Leave 4 Southern Gaza Towns", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274035548/israel-tells-palestinians-to-leave-4-southern-gaza-towns"}