{"authors": ["Nick Pisa", "Nick Pisa In Jerusalem", "Eirian Jane Prosser"], "date_download": "2024-02-05 15:37:10", "date_modify": "None", "date_publish": "2023-11-19 15:09:10", "description": "The military, who have been carrying out an operation at the medical complex over the last week, said it had found a 55-metre-long underground passage 10 metres below the ground.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12767727%2FIsraeli-soldiers-raid-luxury-homes-Hamas-terrorists-unearth-35-tunnel-shafts-hiding-weapons-psychological-warfare-documents.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/19/18/77992415-0-image-a-13_1700418680546.jpg", "language": "en", "localpath": null, "maintext": "Israel's Defence Forces have released shocking footage tonight revealing what it claims is a huge Hamas tunnel buried deep below the al-Shifa hospital in Gaza City.\nThe military, who have been carrying out an operation at the medical complex over the last week, said it had found a 55-metre-long passage 10-metres below the ground.\nOfficials said it had discovered a deep staircase equipped with 'various defence mechanisms' including a blast-proof door with a firing hole claiming the terror group were using the entrance to block out Israeli forces.\nIsrael has long claimed the hospital - which is the largest in the Palestinian enclave - functions as a command complex for Hamas, with a network of tunnels running deep below used for both ammunition storage and planning.\nPalestinian officials at the hospital have denied the claims and insisted the complex is used solely for medical reasons and in recent days it has become a shelter for refugees.\nAs the war enters its seventh week, the hospital has become a central location in the bloody conflict, with Israeli soldiers storming into the hospital on Wednesday.\nThe forces said it had found the bodies of two hostages - Israeli soldier Noa Marciano, 19, and cancer patient Yehudit Weiss, 65, - in a building next to the hospital. Officials say others were most likely kept there.\nIt comes as US and Israeli officials hinted that negotiations over a potential ceasefire between the IDF and Hamas to allow hostages to leave and more humanitarian aid into Gaza are progressing.\nIsrael's ambassador to the United States, Michael Herzog, said in an interview on ABC's 'This Week' that Israel was hopeful a significant number of hostages could be released by Hamas 'in coming days.'\nIsrael's Defence Force has released shocking footage tonight revealing what it claims is a huge Hamas tunnel buried deep below the al Shifa hospital in Gaza City\nFootage shows Israeli military near to the opening of the alleged tunnel buried deep below the Al-Shifa hospital\nIsraeli soldiers inspect the al-Shifa hospital complex, amid their ground operation against Hamas, in Gaza City, November 15, 2023\nEarlier in the week Israel claimed an entrance to another tunnel shaft had been discovered but tonight marks the first time any video has been made public.\nThe video came just hours after Israeli forces said it found 35 tunnel shafts throughout Gaza and raided the luxury homes of Hamas terrorists, seizing various weapons.\nIn yet another shocking development last night, Israel released CCTV footage that appears to show victims abducted by Hamas during their bloody October 7 massacre being hauled into the medical centre.\nThe surveillance footage shows two people - thought to be Thai and Nepalese migrants kidnapped by Hamas - being rolled into the hospital on gurneys with severe injuries, believed to have been inflicted by Hamas terrorists.\nThe clip showed one man, with his face blurred, being wheeled on a stretcher by a group of men - four of them being armed - while another person tries to resist as they are dragged into a building, seeming to be a hospital.\nMedical staff are seen clearly in the background walking along corridors between 10.56 and 11.01 on October 7 - the day of the deadly massacre which saw more than 1,200 Israelis killed.\nIn a statement the IDF said: 'These findings prove that the Hamas terror organisation used Shifa Hospital on the day of the massacre itself as terror infrastructure.' The IDF says it has notified 'relevant authorities' about the footage.\nOther images released by the military allegedly show Hamas terrorists inside the hospital and waiting outside the rooms of the hostages. Stolen IDF vehicles were also seen near the hospital.\nThe IDF also claimed this evening that it had discovered a white Toyota pickup truck containing 'RPGs, explosives, grenades, AK47s,' inside the hospital compound.\nIt said the vehicles had been 'identical' to those used by Hamas during the October 7 attacks, which saw some Israelis being shot at by the terrorists from the moving cars.\nUncovered CCTV footage appears to show victims abducted by Hamas being hauled into Al-Shifa hospital in Gaza City after the October 7 massacre\nIn the background, doctors can clearly be seen walking along the corridors and the time stamp on the video shows it was filmed at between 10.56 and 11.01 on October 7, the day of the attacks\nProviding an operational update on X, the force said: 'IDF and ISA forces revealed a significant 55-meter-long terrorist tunnel, 10 meters underneath the Shifa Hospital complex during an intelligence-based operation.\n'The tunnel entrance contains various defense mechanisms, such as a blast-proof door and a firing hole, in an attempt by Hamas to block Israeli forces from entering.'\nDaniel Hagari, the IDF's military spokesperson, said the entrance was uncovered when a military bulldozer knocked down the outside wall of the hospital complex.\nSoldiers then found a fortified shaft with a spiral staircase descending deep under the complex before reaching a blast door.\nMr Hagari said his troops are yet to open the door over fears it would be booby trapped.\nIsraeli intelligence, however, suggests that either the tunnel would either split or there would be 'a big room for command and control'. Forces will instead continue to search the area looking for shafts from nearby houses.\nThe Israeli army first entered Al Shifa hospital on Wednesday, claiming 'around 2,000 people were inside'.\nYesterday, hundreds of civilians and health workers were forced to flea the hospital on foot after Israeli troops ordered an evacuation on loudspeakers.\nHealth officials in Gaza said 450 patients had been left inside the hospital after the army was warned many were too sick or wounded too escape.\nTonight Israel released video footage of a tunnel that it claims was under the al Shifa hospital in Gaza City\nDrone footage allegedly shows a shaft leading to a tunnel which the Israeli military says has been used by Hamas terrorists\nIsraeli forces said they had found tunnel shafts last week but this is the first time video footage has been revealed\nEarlier today paratroopers from the Nihal Brigade backed up with tanks, airforce jets and armed with rocket launchers launched a series of raids in the heart of Gaza city.\nSix weeks into the war against Hamas after the attacks left more than 1,200 people dead on October 7, they carried out operations in the Sheikh Ejlin and Rimal neighbourhoods.\nOfficials said the areas were 'upmarket' and where senior figures in the terror group lived and footage released showed soldiers attacking buildings with tanks and rocket propelled grenades.\nFollowing the operation, items seized were put on display and they included guns, ammunition, rockets and lap tops and other documents which were being examined by intelligence chiefs.\nIn addition, 35 tunnel shafts were discovered and a training camp used by Hamas military intelligence was also stormed with 'several terrorists' killed.\nThe Rimal neighbourhood is considered the luxury district of the Gaza Strip, where senior commanders of Hamas lived and used the civilian space for activity and directing terrorism.\nWithin the area there are also military posts and government buildings.\nIDF forces from the Nahal Brigade located a terrorist squad that was about to fire on the troops from the roof of an apartment and a jet was called in to strafe the building.\nA major from the Brigade said: 'During searches of the Rimal area, we located a large number of weapons belonging to Hamas terrorists, including laptops, memory devices and technical documents.\n'Other combat items including uniforms and shirts, knee pads and ammunition.\n'Many of the documents contain details on psychological warfare and information about IDF and how to carry out ambushes.'\nParatroopers from the Nihal Brigade backed up with tanks, airforce jets and armed with rocket launchers launched a series of raids in the heart of Gaza city\nFootage shows tanks rolling in and Israeli soldiers firing at buildings as they continue to pummel Gaza\nSome 35 tunnel shafts were discovered and a training camp used by Hamas military intelligence was also stormed with 'several terrorists' killed\nThe Rimal neighbourhood is considered the luxury district of the Gaza Strip, where senior commanders of Hamas lived and used the civilian space for activity\nIsraeli troops are seen lining up as they continue to carry out attacks in Gaza and raid homes of Hamas terrorists\nIsraeli forces are seen amongst the rubble in Gaza as they carry out raids on the enemy\nIsrael says more than 372 soldiers have been killed since October 7 with 52 dying since the ground operation started last month with the death toll in Gaza more than 12,000\nIDF officials said its forces were working through the northern Gaza Strip and focusing on Jabaliya, Zeytun and Beit Lahia and navy ships were also used to pound the area from the sea.\nIsrael says more than 372 soldiers have been killed since October 7 with 52 dying since the ground operation started last month with the death toll in Gaza more than 12,000.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel releases footage of drone exploring 'huge 55m-long Hamas tunnel under al-Shifa hospital' amid hopes a ceasefire deal to release hostages and allow aid into Gaza could soon be struck", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12767727/Israeli-soldiers-raid-luxury-homes-Hamas-terrorists-unearth-35-tunnel-shafts-hiding-weapons-psychological-warfare-documents.html?ns_mchannel=rssns_campaign=1490ito=1490"}