{"authors": [], "date_download": "2024-02-05 15:16:09", "date_modify": "None", "date_publish": "2024-01-24 04:22:42", "description": "DragonFire has precision equivalent to ‘hitting a £1 coin from a kilometre away’, says MoD", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Ftech%2Flaser-weapon-uk-blasts-drones-b2483750.html.json", "image_url": "https://static.independent.co.uk/2024/01/24/03/Dragonfire_Night_Shot_gov_image_960x640.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nThe UK military demonstrated a “cutting-edge” new high-power laser weapon which it claims can blast drones out of the sky with ultra-high precision.\nThe weapon, dubbed the DragonFire, passed its field first test conducted last week, shooting down its aerial targets, the UK Ministry of Defence (MoD) said in a statement on Friday.\nDragonFire is a laser directed energy weapon (LDEW) system with “pinpoint accuracy” capable of delivering a high power laser over long ranges with a precision equivalent to “hitting a £1 coin from a kilometre away,” the MoD said.\n“This type of cutting-edge weaponry has the potential to revolutionise the battlespace by reducing the reliance on expensive ammunition, while also lowering the risk of collateral damage,” UK defense secretary Grant Shapps said.\nFiring the laser for 10 seconds has the cost equivalent of using a heater for just an hour, “typically less than £10 per shot,” the government said.\nUK’s DragonFire laser directed energy weapon (LDEW) system (Ministry of Defence)\nWhile the weapon’s maximum range is still classified, the military said it can “engage with any visible target”.\n“These trials have seen us take a huge step forward in realising the potential opportunities and understanding the threats posed by directed energy weapons,” Paul Hollinshead, chief of the UK Defence Science and Technology Laboratory, said.\nChandrayaan-3 Vikram lander started serving as a location marker near lunar south pole: NASA\nA number of countries, including the US, Germany, and Israel are exploring the use of laser weapons to take out drones and missiles from the sky.\nThe development of these weapons also come as drones are finding increasing use in warfare, especially since Russia’s invasion of Ukraine.\nUK’s first high-power firing of a laser weapon against aerial targets (Ministry of Defence)\nPutin’s forces have increasingly used Iranian-made “Kamikaze” suicide drones to take out targets in Ukrainian cities while Ukraine has also relied on fleets of similar drones built by amateur engineers to attack invading Russian troops as well as targets withing Russia.\nExperts say laser weapons have the potential to be a long-term low-cost alternative to some tasks missiles currently used to take out targets in the sky with lower risk of collateral damage due to their precision.\nSuch directed energy weapon systems can engage targets at the speed of light, using an intense beam of light to cut through the target, leading to structural failure or more impactful results if the warhead is targeted, the MoD said.", "source_domain": "www.independent.co.uk", "text": null, "title": "UK military unveils ‘cutting edge’ laser weapon that can blast drones out of sky", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/tech/laser-weapon-uk-blasts-drones-b2483750.html"}