{"authors": ["Chris Samuel"], "date_download": "2024-02-05 15:37:12", "date_modify": "None", "date_publish": "2023-11-19 19:55:00", "description": "The General staff of Ukraine's military announced Sunday that Russia had lost 318,570 soldiers and 7,744 artillery systems since February 2022.", "filename": "https%3A%2F%2Fwww.express.co.uk%2Fnews%2Fworld%2F1836765%2Frussia-troops-losses-humiliation-ukraine-repels-dnipro-attack.json", "image_url": "https://cdn.images.express.co.uk/img/dynamic/78/1200x712/5074526.jpg", "language": "en", "localpath": null, "maintext": "Ukrainian soldiers\nRussia has lost 1,190 troops and 18 artillery systems in the past day, Kyiv's military has said, with over 300,000 of Putin’s soldiers reportedly killed since the invasion began. The General staff of Ukraine’s military announced Sunday that Russia had lost 318,570 soldiers and 7,744 artillery systems since February 2022. Battlefield losses cannot be independently verified, and the Kremlin has yet to comment on the Ukrainian figures. Moscow also published an update on Sunday, claiming that 605 Ukrainian soldiers had been killed over the past 24 hours, though it did not provide a Russian estimate of the total Ukrainian losses sustained throughout the conflict. The Russian and Ukrainian ministries of defence have been approached for comment. For all the latest on news, politics, sports, and showbiz from the USA, go to Daily Express US\nUkrainian Infantry near Vuhledar\nIn the update today, Ukraine said its air-defense systems had destroyed 15 out of 20 Iranian-designed Shahed drones used by Russian forces. A total of 38 strike drones were launched overnight on Ukrainian territory, it reported. According to Kyiv, Russia also launched missiles and 76 airstrikes against Ukraine over the previous 24 hours. Since the war began, Moscow kept up a campaign of missile, drone and artillery strikes on the country, but is expected to launch a renewed campaign of missile strikes on Ukrainian targets including its energy infrastructure, as tougher winter conditions influence battle tactics, Newsweek reports. \"As winter approaches, there will be more Russian attempts to make the strikes more powerful,\" Ukrainian President, Volodymyr Zelensky, said in his daily evening address yesterday, adding: \"It is crucial for all of us in Ukraine to be 100 percent effective.\" Ukraine said today that over 150 of its settlements in the north, east and south of the country came under artillery fire over the past day, and that fighting continues around the embattled Donetsk town of Avdiivka, which has spent months on the front lines. \"Our warriors are steadily holding the defense, causing the enemy significant losses,\" the General Staff continued. Russia did not mention the town in its update, but said its southern grouping of forces had stopped six Ukrainian attacks around the town of Marinka in Donetsk and the villages of Klishchiivka and Shumy.\nUkrainian air defense missile troops\nBecome an Express Premium member Support fearless journalism\nSupport fearless journalism Read The Daily Express online, advert free\nRead The Daily Express online, advert free Get super-fast page loading Start 30-day\nFREE trial\nUkrainian forces recorded 22 attacks around Marinka, Kyiv said. Over 100 Ukrainian troops were killed and three armoured vehicles destroyed in Zaporizhzhia in the south of the country, according to Moscow's Defense Ministry. The region has been annexed by the Kremlin, but this is not internationally recognized and Vladimir Putin’s forces do not control the entirety of the territory. Some of the heaviest fighting of Ukraine’s counteroffensive, which began in June, has also been seen in the southern swathe of the country. It comes as the Ukrainian army says it has pushed Russian troops between three to eight kilometres back on the banks of the Dnipro River. If the advance is confirmed, it would represent the first meaningful one Kyiv’s forces have made months into a counteroffensive that has thus far failed to yield major territorial gains. “Preliminary figures vary from three to eight kilometres, depending on the specifics, geography and landscape design of the left bank,” army spokesperson Natalia Gumenyuk told Ukrainian television. She didn’t specify whether the Ukrainian military had complete control of the area or if Russian forces had retreated. Both forces have been entrenched on opposite sides of the huge waterway in southern Kherson for over a year.\nTrending\nUkrainian forces assault Russian trenches near Bakhmut", "source_domain": "www.express.co.uk", "text": null, "title": "Russia 'loses 1,190 troops' after Ukraine repels Dnipro pushback", "title_page": null, "title_rss": null, "url": "https://www.express.co.uk/news/world/1836765/russia-troops-losses-humiliation-ukraine-repels-dnipro-attack"}