{"authors": [], "date_download": "2024-02-05 15:37:13", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Latest Developments: Lack of fuel in Gaza affects coordination of delivery of humanitarian aid. Netanyahu says Israel has not been successful in minimiz", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274036724%2Flack-of-fuel-shuts-down-telecoms-complicates-aid-delivery-in-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700231761.jpg", "language": "en", "localpath": null, "maintext": "Latest Developments:\nLack of fuel in Gaza affects coordination of delivery of humanitarian aid.\nNetanyahu says Israel has not been successful in minimizing civilian casualties\nGaza is facing the \"immediate possibility of starvation,\" according to the World Food Program executive director\nIsrael warns Palestinians to leave four towns in southern Gaza, possibly presaging new attacks in the area.\nIsraeli forces continue operations around Shifa Hospital.\nU.N. Security Council passes a resolution calling for the immediate release of all Hamas hostages and 'urgent and extended humanitarian pauses' in Gaza. Israel calls resolution 'detached from the reality on the ground.'\nU.N. officials say a lack of fuel to power phone networks and vehicles is complicating efforts to deliver humanitarian aid in Gaza, a day after the head of the World Food Program warned the situation in Gaza has grown dire.\nCivilians in Gaza face \"the immediate possibility of starvation,\" according to Cindy McCain, the executive director of the World Food Program.\nA woman cooks, amid shortages of food supplies and fuel, as the conflict between Israel and Palestinian Islamist group Hamas continues, in Khan Younis in the southern Gaza Strip, Nov. 17, 2023.\n\"Supplies of food and water are practically non-existent in Gaza and only a fraction of what is needed is arriving through the borders,\" McCain said in a statement Thursday. \"There is no way to meet current hunger needs with one operational border crossing. The only hope is opening another, safe passage for humanitarian access to bring life-saving food into Gaza.'\nAll telecommunications services in Gaza shut down late Thursday after service providers ran out of fuel needed to run their generators.\nPalestinian authorities in Gaza say more than 11,000 people - about 40% of them children - have been killed since Israel launched a major air and ground offensive in response to the October 7 Hamas attack.\nPalestinians mourn over the bodies of relatives killed in the Israeli bombardment of the Gaza Strip in Rafah, Nov. 17, 2023.\nIsrael imposed a blockade in Gaza shortly after the attack by Hamas that killed more than 1,200 people in southern Israel, according to the government.\nLate Thursday, Israel's military said it had provided 4,000 liters of water and 1,500 ready-made meals to Shifa Hospital.\n\"The well-being of civilians, including patients and staff, remains a priority,\" the Israel Defense Forces posted on X, formerly known as Twitter.\nAlso Friday, the IDF announced that it had found and extracted the body of Corporal Noa Marciano. The military said her body was found \"adjacent to the Shifa Hospital in Gaza.\" She was abducted by Hamas on October 7 during the militants' attack on Israel.\nIn this image taken from a video released by the Israeli Defense Forces, Nov. 15, 2023, Israeli soldiers walk in the area of Al-Shifa hospital in Gaza City.\nIsrael ordered Palestinians to leave four towns in southern Gaza on Thursday, signaling a possible expansion of its war against Hamas militants into areas where Israeli officials had told people it was safe to stay.\nIsraeli Prime Minister Benjamin Netanyahu told CBS News that Israel has not been successful in minimizing civilian casualties. He told CBS that Israel is doing \"everything we can to get civilians out of harm's way,\" but Hamas is doing \"everything to keep them in harm's way.\"\nA child looks on as Palestinians queue to buy bread from a bakery, amid shortages of food supplies and fuel, as the conflict between Israel and Palestinian Islamist group Hamas continues, in Khan Younis in the southern Gaza, Nov. 17, 2023.\nIsrael dropped leaflets from aircraft overnight, telling civilians to leave the towns of Bani Shuhaila, Khuzaa, Abassan and Qarara, on the eastern edge of Khan Younis, the main southern city.\n'For your safety, you need to evacuate your places of residence immediately and head to known shelters,' the leaflets said. 'Anyone near terrorists or their facilities puts their life at risk, and every house used by terrorists will be targeted.\nResidents in the area said there was a heavy Israeli bombardment overnight.\nPalestinians look for survivors after an Israeli strike on Rafah, Gaza Strip, Nov. 17, 2023.\nHours later, the Israeli military said it had recovered the body of Yehudit Weiss, another one of the 240 hostages captured by Hamas in its October 7 attack. The military said it had found her body near the Shifa Hospital in Gaza City.\nThe 65-year-old woman was the mother of five and was abducted from a kibbutz during the Hamas attack. Her husband, Shmulik Weiss, was found dead in the safe room of their home.\nIsraeli troops continued to search the Shifa Hospital facility, which it raided on Wednesday in the belief it was a Hamas command center. Israel displayed weapons it said it found at the hospital, but Hamas said no arms were found.\nIsraeli soldiers rest outside the border with northern Gaza, in Southern Israel, Nov. 17, 2023\nIsrael's army on Thursday released a video of what it said showed a tunnel entrance that Hamas militants used in an outdoor area of Shifa Hospital. The video, which could not be immediately verified, showed a deep hole in the ground surrounded by concrete and sand.\nIn a statement late Thursday, Hamas again denied it was using the hospital for military purposes, calling such claims 'a repetition of a blatantly false narrative, demonstrated by the weak and ridiculous performances of the occupation army spokesman.'\nIf Israel expands its military offensive in south Gaza, it threatens to worsen the already severe humanitarian crisis in the besieged territory. More than 1.5 million people have been forced from their homes in Gaza, with most having fled, at Israel's directive, to the south, where food, water and electricity are in diminishing supply.\nU.S. Secretary of State Antony Blinken spoke with Israeli War Cabinet member Benny Gantz about efforts to increase and speed up the delivery of humanitarian assistance into Gaza, the State Department said Thursday.\nDuring their discussion, Blinken also underscored the need to de-escalate tensions in the West Bank, including by addressing increased extremist settler violence, the State Department added.\nBlinken also spoke with Egyptian Minister of Foreign Affairs Sameh Shoukry about increasing aid to Palestinians in need, the State Department said.\nLack of Fuel Shuts Down Telecoms, Complicates Aid Delivery in Gaza\nNational Security Council spokesperson John Kirby said Thursday that the United States will not share any Israeli intelligence or elaborate on its own intelligence assessment that Hamas used Shifa Hospital as a command center and potentially a storage facility.\nMeanwhile, the United Nations Security Council late Wednesday adopted a resolution calling for 'urgent and extended humanitarian pauses' in Gaza. Twelve council members voted in favor, while none voted against and three - the United States, Russia and the United Kingdom - abstained. Hamas has been designated a terrorist organization by the U.S., U.K, EU and others.\nIsrael's deputy permanent U.N. representative said the resolution was 'detached from the reality on the ground.'\nThe resolution that passed also called for 'the immediate release of all hostages held by Hamas.'\nNegotiations are reportedly under way on a proposed deal under which Hamas would release at least 50 women and children it is holding as hostages in Gaza in exchange for Palestinian women and children held in Israeli prisons.\nHamas said about 650 patients and 5,000 to 7,000 Palestinian civilians have taken shelter on the Shifa hospital grounds.\nEmbed share Gaza's Shifa Hospital Is Focus of International Concern Embed share The code has been copied to your clipboard. width px height px\nThe URL has been copied to your clipboard\nNo media source currently available\n0:00 0:03:19 0:00\nAfter the hospital raid, Biden spoke with Israeli Prime Minister Benjamin Netanyahu about the latest developments in the war. The White House said they discussed at length ongoing efforts to secure the release of hostages, including nine Americans and a foreign national with U.S. employment rights.\nAs its military incursion advances, Israel has rejected growing and intense international pressure to impose a cease-fire to allow for the delivery of humanitarian aid to Gaza. It has, however, agreed to four-hour daily humanitarian pauses to allow the opening of two corridors to let Palestinians evacuate northern Gaza.\nUnited Nations correspondent Margaret Besheer and White House bureau chief Patsy Widakuswara contributed to this report. Some information for this article came from The Associated Press, Reuters and Agence France-Presse.", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Lack of Fuel Shuts Down Telecoms, Complicates Aid Delivery in Gaza", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274036724/lack-of-fuel-shuts-down-telecoms-complicates-aid-delivery-in-gaza"}