{"authors": ["Frankie Elliott", "Emily Jane Davies"], "date_download": "2024-02-05 15:37:14", "date_modify": "None", "date_publish": "2023-11-19 09:51:31", "description": "The Met Police said its officers have arrested more than 400 people at 100 pro-Palestine rallies across Britain as Just Stop Oil gets involved in the sit-in with the pro-Palestine protesters at Waterloo.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12767269%2FMoment-Just-Stop-Oil-activists-carried-away-police-join-sit-pro-Palestine-protesters-Waterloo-station.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/19/08/77982327-0-image-m-19_1700383817191.jpg", "language": "en", "localpath": null, "maintext": "Met Police said it made 10 arrests on another eventful Saturday in the capital\nEnvironmental activists filmed being carried out of ceasefire protest by police\nJust Stop Oil activists staged a mass sit-in at a busy London station yesterday, as McDonald's and Sir Keir Starmer were also targeted during 100 pro-Palestine rallies nationwide.\nAround 200 people staged a sit-in protest at Waterloo Station in London to call for a ceasefire in Gaza in a series of events across Britain.\nJust Stop Oil activists were carried away in droves by police during the sit-in with pro-Palestine protesters, despite a banning order by British Transport Police.\nElsewhere, the protesters were pictured clashing with police outside a Manchester branch of McDonald's and more protesters assembled outside Downing Street as the nationwide 'day of action' threatened to turn ugly.\nAround 1,000 people targeted Sir Keir's constituency office, accusing him of 'supporting genocide' after Labour party declined to back a ceasefire vote.\nThere were 100 similar events staged across the UK, with thousands marching in Newcastle and Glasgow, and rallies held in Bristol, Birmingham and Liverpool.\nThe Metropolitan Police revealed 386 people have been arrested since the October 7 massacre, with 253 of them being nicked at protests.\nAnother 125 were held for community-related incidents and eight were on suspicion of 'terror offences'.\nJust Stop Oil activists were filmed being dragged away by police yesterday during the mass sit-in at Waterloo.\nThe JSO X account posted: 'Sit in protest demanding a ceasefire at Waterloo station. Police have threatened to arrest everyone present. This is Britain in 2023.'\nIn one video, a female activist is carried out by three officers and says to the camera: 'I will not be complicit with a genocidal government. Thousands of children are getting murdered.\n'What are you doing? Why aren't you here sitting down in the station? It's easier then going on a march with a million people. Do something.'\nIn another video, a man in orange jacket is searched by police, whilst saying: 'I was just simply sitting there shouting for something clear and obvious, which is for a ceasefire'\nThe camera holder asks an officer why he has been arrested, to which the cooper claims he doesn't have to say, before asking a group of people to move away.\nIn the same video, another person is dragged out on their knees by police, as fellow protestors say 'thank you ' to them.\nIn a third clip, footage shows a man with glasses being carried out of the station by two police officers, he can be heard saying: 'We demand a ceasefire. We will not let the Palestinians be treated like animals. They are people and they deserve to live.'\nThe group could be heard chanting 'Free, free Palestine'; 'Sit down, join us'; and 'From the river to the sea, Palestine will be free' as they protested in the centre of the station.\nPolice officers surrounded the protesters before they were escorted from the station, with at least two demonstrators carried from the scene.\nBritish Transport Police (BTP) said five protesters were arrested at Waterloo station and no train services were affected.\nThe Met Police said its officers had made 10 arrests - including pro-Palestinian and JSO protesters.\nBTP Assistant Chief Constable Sean O'Callaghan said: 'In line with our strategy, protesters were issued notices and announcements were made over station sound systems before officers moved to the arrest stage.\n'The vast majority of protesters left peacefully, however five arrests were made at a large protest at Waterloo station.'\nThe group could be heard chanting 'Free, free Palestine'; 'Sit down, join us'; and 'From the river to the sea, Palestine will be free' as they protested in the centre of the station\nPolice officers surrounded the protesters before they were escorted from the station, with at least two demonstrators carried from the scene\nBritish Transport Police (BTP) said five protesters were arrested at Waterloo station and no train services were affected\nA group of demonstrators who were removed from the station then made their way to Westminster Bridge where they sat in the road before moving to Parliament Square, the Metropolitan Police said.\nThe force said on X, formerly Twitter: 'We believe the group in Parliament Square is a mix of pro-Palestinian protesters and JSO (Just Stop Oil) activists.\n'We have arrested a prominent JSO activist from within the group. We have a significant number of officers ready to respond if there is further disruption in the road.'\nOn previous weekends thousands of protesters and counter-protesters have converged on the capital.\nHowever, the movement's presence was more muted in London on Saturday, with protesters split across more than 100 smaller rallies around the nation.\nLondon hosted 10 events, including rallies in Islington, Camden and Tower Hamlets.\nPro-Palestine protesters targeted a string of stores across Manchester on Saturday including McDonald's and Starbucks as gatherings in London threatened to turn ugly following a day of more than 100 protests around the UK.\nPhotographs from Manchester showed a line of police officers standing outside McDonald's in Oxford Street as a group of men, some wearing Palestinian keffiyeh scarves, held up a Palestine flag and pushed up against the officers.\nProtesters also targeted a Pret-A-Manger and Starbucks coffee shops, with a sign showing the Starbucks store was shut due to 'unforeseen circumstances'.\nElsewhere, a pro-Palestinian demo assembled outside Downing Street amid an ongoing 'day of action' by pro-Palestinian activists that has seen police issue dispersal orders following unrest on Whitehall.\nBritish Transport Police officers arrested at least five people at a sit-in at London Waterloo after they refused to leave the station despite an order banning public assemblies being enacted.\nPro-Palestine protesters target a Pret coffee shop in Manchester on Saturday\nOfficers stood guard outside a closed Starbucks in Manchester after protesters began targeting chains they claimed support Israel\nPolice stand between protesters and the window of a McDonald's restaurant in Oxford Street, Manchester\nPolice in Manchester have clashed with pro-Palestinian demonstrators outside a McDonald's in the city centre\nPolice offiers detain a pro-Palestinian protester who took part in a sit-in demonstration at London's Waterloo Station calling for a ceasefire in Gaza\nPolice said they arrested five people before the rest of the protesters dispersed\nPolice officers grapple with those protesting in Waterloo on Saturday evening\nOfficers force prevent protesters from re-entering Waterloo station\nThe protestors in Manchester claimed that Pret and Starbucks are supporting Israel by opening outlets in the country. Video taken from this afternoon's march shows protestors shouting 'shame on you' and 'boycott Pret' outside the store.\nOthers pressed carboard banners on the windows of the café at the junction of Oxford Street and Portland Street. Police officers atended the scene and ordered the protestors to move away from the area.\nDemonstrators also shouted 'shame' as they passed a Starbucks on Peter Street. Another branch of Starbucks on Deansgate was closed 'due to unforeseen circumstances', according to a note posted on the front door.\nThe reason for the closure is not yet known.\nThousands of people are estimated to have attended the latest demonstration in the city, which have been held for the past few weeks. Those behind the protest, organised by the Greater Manchester Friends of Palestine, are calling held to call for an immediate ceasefire to the conflict.\nIn London, The Metropolitan Police shared a CCTV image of protesters gathered on Whitehall opposite the entrance to the prime minister's official residence in one of more than 100 demos taking place across the country today.\nOutside Downing Street, videos shared on social media purported to show small scuffles between police officers and protesters, as officers rushed to separate arguing activists.\nThe Met Police said two men in balaclavas were spotted in the area, 'appearing to watch the group of pro-Palestinian protesters' before being 'encouraged to leave'.\nAt 6.40pm, the force issued a Section 35 Dispersal Order until 11pm across Westminster, meaning that anyone who refuses to leave when asked to do so by an officer can be arrested.\nAt Waterloo, the British Transport Police confirmed it had arrested five protesters before dispersing the sit-in to outside the station.\n'A large number of police officers remain in attendance to maintain order,' a statement added.\nThe Met Police said those dispersed from the station made their way to Westminster Bridge where they 'sat in the road', before moving when officers approached to Parliament Square.\nThe force added the group 'is a mix of pro-Palestinian protesters and JSO activists', saying it had arrest one 'prominent' Just Stop Oil member.\nBy 7.30pm, police said all protesters had dispersed. The force added it had arrested six people in relation to pro-Palestine protests and four related to JSO protests throughout the day for offences including breach of bail conditions, public order, racially aggravated public order, inciting racial hatred, affray and obstruction.\nProtesters held signs describing Israel's actions in Gaza as a 'Holocaust' in Glasgow on Saturday\nPeople march demanding a ceasefire in Gaza on Saturday in Glasgow\nProtesters hold flares in central Glasgow on Saturday\nA protester is carried out of Waterloo station by several police officers\nPolice officers detain a pro-Palestinian protester who took part in a sit-in demonstration at London's Waterloo Station\nA Palestine flag is held up against the window of a McDonald's branch in Manchester\nPolice officers line up in rows in Waterloo before the removal of protesters\nPro-Palestinian protesters defied a British Transport Police ban on assemblies in London's train stations to stage sit-ins at London Bridge and Waterloo station (pictured: Waterloo)\nPolice stand by as pro-Palestinian protesters stage a sit-in at Waterloo station\nA man is dragged away at Waterloo station while wearing handcuffs\nA Section 35 Dispersal Order has been authorised until 11pm in the Westminster area\nPolice officers monitor a group of protesters after they left Waterloo station\nRainy weather did not seem to dampen protesters' spirits in Glasgow\nThousands of people march along the road in Manchester on Saturday\nPalestinian flags waved from a Cathedral balustrade at a protest in central Manchester\nHundreds gathered outside the office in Camden, north London as a fresh wave of protests began across the country in a national day of action\nCrowds blocked the road and chanted 'Keir Starmer's a wasteman' and 'What do we want? A ceasefire. When do we want it? Now'\nSeveral hundred people gather to stage a demonstration in support of Palestinians and demand an immediate cease-fire in an area of London\nOthers held up signs saying 'Stop the war on Gaza' as they massed outside the Labour leader's office\nThe packed road was filled with Palestinian flags, with further placards reading: 'save Gaza's kids' and: 'no justice, no peace'\nOther placards accused the Labour leader of enabling genocide - while another included the controversial phrase: 'from the river to the sea'\nSome signs accused Starmer of not upholding Labour values and still more definitively called for a ceasefire\n19 shadow ministers defied the leadership to speak in favour of a ceasefire this week in a SNP amendment to the King's Speech\nLabour was left in chaos this week as MPs faced pressure from members and pro-Palestinian activists to back a vote for a ceasefire in Gaza\nIt comes as protesters held sit-in protests at major UK train stations despite increased policing across railway networks.\nThe BTP deployed enhanced officer patrols in England, Scotland and Wales on Saturday.\nFootage shared on social media showed a small crowd sitting on the floor in Manchester Victoria Station, while the force confirmed another group of around 25 had done the same at Leeds station shortly after 2pm.\nBTP issued Section 14a orders prohibiting protests on Saturday at many of London's main rail stations from 10am to 11pm, but shortly after 2.30pm the force posted on X that a group of approximately 200 protesters had arrived at London Bridge station in the English capital.\nMet Police arrest man, 37, over 'Hamas hate posts' made online ​A 37-year-old man has been arrested on suspicion of encouraging terrorism as the Met Police said they had made more than 380 arrests for offences related to the Israel-Hamas conflict. The man, who was arrested at an address in west London on Friday, was also arrested on suspicion of showing support for a proscribed organisation. In a statement, the Met Police said that the force has made 386 arrests for related offences since the October 7 attacks in Israel. These arrests include 253 during protests and other public gatherings, 125 in communities and mostly related to hate crime, and eight as part of ongoing counter-terrorism investigations. Detective Chief Superintendent Gareth Rees, head of operations in the Met's Counter Terrorism Command, said: 'We are clear that where we identify anyone involved with or committing potential terrorism offences, then they will be investigated, and we will take the necessary action.' Advertisement\nA police cordon was also put in place around London Bridge, but five minutes later they posted again to say the group had left the area and passengers could access the station as usual.\nMcDonald's was targeted by some pro-Palestine protesters on Saturday because its Israeli franchise has been offering free food to soldiers in the Israel Defense Forces (IDF).\nOther Middle Eastern franchised have distanced themselves from the move, while McDonald's global parent company has distanced itself from taking any stance on the Israel-Hamas war.\nIt told the BBC: 'McDonald's Corporation is not funding or supporting any governments involved in this conflict, and any actions from our local developmental licensee business partners were made independently without McDonald's consent or approval.'\nHowever, people have taken extreme measures to express their distaste with the fast food chain, releasing mice painted in the colours of the Palestinian flag into restaurants in the UK.\nThe gatherings came as protesters in north London assembled outside Keir Starmer's parliamentary office and chanted 'Keir Starmer's a wasteman' and 'What do we want? A ceasefire. When do we want it? Now'.\nOthers held up signs saying 'Stop the war on Gaza' as they massed outside the Labour leader's office days after he ordered Labour MPs not to show support for an SNP amendment to the King's Speech calling for a ceasefire in Gaza.\nThe packed road was filled with Palestinian flags, with further placards reading: 'save Gaza's kids' and: 'no justice, no peace.'\nProtesters held signs saying 'Who the f*** doesn't vote for a ceasefire?' and 'Starmer shame on you' as they walked through Camden.\nJohn Rees, national officer for the Stop the War Coalition, told crowds: 'My message to Keir Starmer is this. One, you are a wasteman. Two, get with the programme, demand a ceasefire now.'\nThe crowds also heard from 33-year-old Palestinian Nida Badawi, who told crowds: 'I know we're restless. For the past 40 days, over 40 days, I feel like my heart's been ripped out of my body.\n'I'm just here to remind you while we're standing here, it's not the time to stay quiet. They need to hear our voices.'\nProtesters also gathered outside the office of Harrow East Conservative MP Bob Blackman, who voted against a motion calling for a ceasefire in Gaza earlier this week. Other MPs' offices were targeted in recent days.\nProtesters defied orders by the British Transport Police to stay away from transport hubs and staged protests at both London Bridge and Waterloo stations.\nBTP officers have moved in to disperse protesters, handing them leaflets to inform them that they will be arrested if they refuse to leave.\nShortly after 4.30pm - the deadline given to protesters to leave Waterloo - the force said on X, formerly Twitter: 'Following engagement with protest liaison officers, protestors are refusing to leave Waterloo station as agreed. Therefore we are moving to arrest phase.'\nHundreds of pro-Palestinian protesters have began marching from outside Chalk Farm station in north London as part of the day of national action.\nElsewhere, thousands of protesters marched in Newcastle to call for a ceasefire, while an estimated 18,000 people protested on a rainy day in Glasgow.\nMembers of Scottish Labour, the SNP and the Scottish Greens were among those to address the crowd on Glasgow Green.\nSNP MP Anum Qaisar said: '11,000 people have been massacred in Gaza, almost half of whom are children. Over 1,000 people killed in Israel by the atrocious attack by Hamas.\n'These numbers are rising and they will continue to rise daily unless there's an immediate ceasefire.'\nPolice officers are pictured at Waterloo as they make a handful of arrests\nSeveral dozen people are pictured sitting in Waterloo station before police officers moved in\nPolice officers attempt to explain to Waterloo protesters that the gathering is illegal\nDozens of officers prepared to move in on protesters at Waterloo on Saturday\nPolice officers line up on the concourse after pro-Palestinian protesters took part in a sit-in demonstration at London's Waterloo\nProtesters in Glasgow's Argyle Street as they call for a ceasefire in Gaza. Organisers say 18,000 people attended\nProtesters in Glasgow marching for a ceasefire in Gaza\nProtesters march across the Gateshead Millenium Bridge in Newcastle during a protest in the northern city on Saturday\nThe Newcastle action took in the length of the city centre waterfront, passing beneath the Tyne Bridge\nPolice patrol around the Cenotaph on Whitehall on Saturday ahead of anticipated pro-Palestine protests across the country\nFootage of the incident sparked anger at the police response - with officers simply standing by and watching as one of them politely asked the men to come down\nProtesters have gathered in Harrow outside the office of Harrow East MP Bob Blackman, who voted against a parliamentary motion calling for a ceasefire in Gaza\nThousands protest outside of Parliament to demand that there is a vote for a ceasefire. Pictured at Parliament Square on November 15, 2023\nDolls symbolising children that died during the conflict as healthcare workers and agencies in the UK held a vigil outside Downing Street on Friday\nBut amid scenes earlier this week of police simply standing by as pro-Palestinian activists climbed the Royal Artillery Memorial in Hyde Park, Met Commander Karen Findlay says officers have been told to take stronger action.\nAs well as making 'expectations clear' to police on the ground to take decisive action, she has told protesters who climb memorials that they could be liable for criminal damage charges.\nFootage of the Hyde Park incident on Wednesday sparked anger amid the police response - with officers simply standing by and watching as one of them politely asked a man to come down, making no moves to arrest him.\nCommander Findlay said: 'We have made our expectations clear to officers who will be on duty this weekend.\n'At a minimum they are to intervene decisively when they see behaviour which is obviously disrespectful, using their skills in dealing with the public as they do every day.\n'They will be looking to take positive action, including arrests, as soon as disrespectful behaviour becomes disorderly behaviour of the sort covered by a number of public order offences.\n'They will also intervene where necessary to prevent a breach of the peace.\n'Protesters intent on climbing over memorials and other monuments should also keep in mind that they weren't designed for this purpose, making them prone to damage which will likely constitute a criminal offence.\n'There is clear legislation in place to deal with damage of any sort, even if it is minimal or was caused recklessly and not intentionally.'\nHowever, the Met commander admitted that policing people who climb war memorials would be a 'challenge' for officers - because there is no explicit law that makes the action unlawful.\nShe has called on pro-Palestinian marchers to show respect and to adhere to the law, warning that 'hate crime will not be tolerated'. Met resources will be heavily deployed in areas with large Jewish and Muslim communities.\nCommander Findlay added: 'Regrettably, while the majority of protesters coming out in recent weeks have been peaceful, we have continued to see people taking part in offensive chanting or intentionally carrying placards that cross the line from political statements into racially or religiously aggravated offences.\n'By all means come out and protest to make your voice heard as is your right, but if your aim is to offend, to incite hatred, or to cause fear and intimidation then you should stay away.'\nRather than a huge march in London , as has been seen in recent weeks, dozens of events are due to take place in different parts of the UK today (picture of a protest on Wednesday)\nBritish Transport Police have banned protests on Saturday at many of London's main rail stations\nA vigil was held at Downing Street tonight to mourn the civilians and healthcare workers killed in Israel's bombing of Gaza\nDolls were laid in front of the Prime Minister's residence to highlight the number of children and babies killed in the bloody war\nRather than a huge march in London, as has been seen in recent weeks with thousands of protesters converging on the capital, the Day of Action for Palestine has seen more than 100 events take place in different parts of the UK on Saturday.\nProtests BANNED at London train stations The British Transport Police have issued Section 14a orders prohibiting protests from 10am to 11pm Saturday at the following London stations: Waterloo\nCharing Cross\nKing's Cross\nLondon Bridge\nEuston\nLiverpool Street\nMarylebone\nPaddington\nVictoria\nSt Pancras Advertisement\nMeanwhile, the British Transport Police (BTP) has banned protests on Saturday at many of London's main rail stations, anticipating that demonstrations at the country's busiest transport hubs could cause severe disruption.\nAhead of the protests, a vigil was held at Downing Street on Friday to mourn the civilians and healthcare workers killed in Israel's relentless bombing campaign on the Gaza Strip over recent weeks.\nIsrael began strikes on the enclave after the October 7 atrocities by Palestinian terror group Hamas, which saw 1,200 killed.\nThe Palestinian death toll has surpassed 12,000, including 5,000 children, the Hamas-run Health Ministry said on Friday.\nDolls were laid in front of the Prime Minister's residence to highlight the number of children and babies killed in the bloody war, while protesters also held aloft placards with the names of medics who have lost their lives while trying to save others.\nFurious protesters have been calling for a ceasefire for weeks, and now protests will grip the country as part of a coordinated day of action which will involve trade unionists.\nLabour was left in chaos this week as MPs faced pressure from members and pro-Palestinian activists to back a vote for a ceasefire in Gaza, especially after 19 shadow ministers defied the leadership to speak in favour of a ceasefire.\nIn the end, ten frontbenchers and 46 other Labour MPs sided with the SNP amendment to the King's Speech which demanded an 'immediate ceasefire' in the besieged territory.\nBen Jamal, director of the Palestine Solidarity Campaign, said the rallies were organised to show that 'ordinary people' support a ceasefire.\n'This Saturday, ordinary people across the UK will come out again to show the vast majority of them support a ceasefire,' he said.\n'They will show their solidarity with Palestinians who are suffering unimaginable harm.'\nA spokeswoman for organisers Stop The War Coalition said on Friday: 'Tomorrow is the day of action that we've called for.'\n'Groups around the country are organising local rallies and marches to basically build for the national demonstration that has been called for next Saturday,' she said.\nThe spokeswoman added that most of the rallies will have speakers, and some will still march.\nHundreds of children joined a protest march through Bethnal Green yesterday\nYoungsters and adults carrying Palestinian flags and placards calling for Israel to 'stop the war in Gaza ' clogged up the streets in Bethnal Green\nThe gathering in Barking comes amid warnings for children to stay in school\n'I think most of them have speakers from various organisations that are involved in the main marches, and then trade unionists,' she said.\nThis week, Labour saw a string of frontbench resignations after ten MPs defied Sir Keir Starmer and voted for an end to fighting.\nMPs who did not rebel against the party leader have seen demonstrations in their constituencies, with marchers expected in Emily Thornberry's seat of Highbury and Islington today.\nLast Saturday also saw shocking scenes of violence as far-right football hooligans claiming to be 'protecting the Cenotaph' clashed with police.\nToday, the Campaign Against Antisemitism (CAA) voiced fears that 'genocidal hate chanting and antisemitic rhetoric' would be heard on Britain's streets.\nThe Met said 300,000 people joined a pro-Palestinian march through London on Armistice Day, which saw some displaying antisemitic slogans and sickening support for Hamas.\nMeanwhile, the CAA filmed several protesters comparing Israel to Nazi Germany, with one branding Benjamin Netanyahu 'worse than Hitler'.\nThe Metropolitan Police said that a 'significant' policing operation is planned for the capital this weekend as it plans to crackdown on any hateful behaviour.\nCommander Karen Findlay, who is leading the Met's operation in London, said: 'Whilst there is no single large central protest event on Saturday, our policing priorities remain the same across the local events that are due to take place.\n'We are here to ensure that people can exercise their right to protest but to make sure that is done lawfully, and that unreasonable disruption to the lives of other Londoners is kept to a minimum.\n'Our officers will intervene swiftly where they see offences taking place. In particular, I want to reiterate that there is no place for hate in London. Hate crime will not be tolerated.\nPolice are 'actively seeking' two men pictured wearing Hamas-style headbands at last Saturday's march in London\nA demonstrator last Saturday with a sign showing a Star of David intertwined with a Nazi swastika (left) and another depicting Rishi Sunak and Suella Braverman as 'coconuts'\n'Regrettably, while the majority of protesters coming out in recent weeks have been peaceful, we have continued to see people taking part in offensive chanting or intentionally carrying placards that cross the line from political statements into racially or religiously aggravated offences.'\nThe British Transport Police have issued Section 14a orders prohibiting protests on Saturday at many of London's main rail stations.\nThe orders will be in place between 10am and 11pm at Waterloo, Charing Cross, King's Cross, London Bridge, Euston, Liverpool Street, Marylebone, Paddington, Victoria and St Pancras.\nAssistant Chief Constable Sean O'Callaghan said: 'We have been made aware of several planned demonstrations due to take place on Saturday November 18 across railway stations in London.\n'We fully respect the rights of people to protest lawfully but where we believe this could cause serious disruption to the railway services, we must act.'\nOn Friday, schoolchildren walked out of their classes as part of a coordinated 'school strike for Palestine'.\nIn Bristol, youngsters handed in a petition calling for a ceasefire, while similar events took place in other cities across the UK.\nIt came after hundreds of pupils at a Wimbledon girls' school took part in a banned march in support of Palestine which left Jewish students feeling 'isolated and threatened' on Wednesday.\nFootage posted on TikTok shows how streams of uniformed girls aged 11-16 defied a ban on any political event within the school campus this week - leaving some girls, including some of Jewish backgrounds, feeling unsafe.\nAnd on Thursday, a crowd of pro-Palestinian protesters surrounded the Labour constituency office of MP Rushanara Ali after she abstained from Wednesday's Gaza ceasefire vote in Parliament, following an earlier protest their by schoolchildren in the day.\nThe Department of Education has responded by stressing that children should be in school and not 'missing out on their education'.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Just Stop Oil activists stage sit-ins at busy London station while McDonald's and Sir Keir Starmer targeted during more than 100 Pro-Palestine rallies nationwide", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12767269/Moment-Just-Stop-Oil-activists-carried-away-police-join-sit-pro-Palestine-protesters-Waterloo-station.html?ns_mchannel=rssns_campaign=1490ito=1490"}