{"authors": ["Ruth Michaelson", "Kaamil Ahmed"], "date_download": "2024-02-05 15:37:16", "date_modify": "None", "date_publish": "2023-11-19 05:00:40", "description": "The raid on al-Shifa hospital by Israeli forces forced out thousands of patients and medical staff", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F19%2Fits-basically-hell-on-earth-gaza-city-left-totally-bereft-of-healthcare.json", "image_url": "https://i.guim.co.uk/img/media/6d7b73509a9cf9365ce21b6feb278bd7b00c3230/0_171_3158_1895/master/3158.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=ea9ee6fedce01d2d162c2bcaa5f4e594", "language": "en", "localpath": null, "maintext": "In the early hours of Saturday morning, over piles of concrete and rubble, crowds of doctors and patients walked miles through the destroyed streets of Gaza City, forced to evacuate on foot from what remained of its hospitals. Medics said they feared leaving critically ill patients behind in a city now largely reduced to rubble and overtaken by Israeli forces, where hospitals had been operating without power, fuel, water or food.\n“It’s basically hell on earth,” said William Schomburg, the head of the International Committee of the Red Cross in Gaza, describing what remained of life inside the city.\nFor weeks, tens of thousands of people had hoped that taking refuge in Gaza City’s hospitals would provide the closest thing to safety as the enclave endured intensifying bombardments.\nBut as Israeli forces drew closer to their facilities and then raided Gaza’s largest hospital, Dar al-Shifa last week, thousands were displaced along with medical staff, walking through destroyed streets to the south of the enclave.\nThe Palestinian health ministry in Gaza said Israeli forces demanded the evacuation of al-Shifa hospital on Saturday morning, three days after a raid on the facility. Medics said they were told they had an hour to evacuate the hospital, formerly the centrepiece of Gaza’s medical system.\nAt least 12,000 people have been killed in the Israeli assault on Gaza since Hamas’s 7 October attack, in which 1,200 Israelis were killed and some 240 people taken hostage.\nMedhat Abbas, director general of the Palestinian health ministry in Gaza, recalled a conversation he had with orthopaedics specialist Adnan Al Borsh who left al-Shifa in the early hours of Saturday. He said Al Borsh wept as he described the experience of walking out of the hospital with other medics and displaced people. Israeli soldiers, he said, patrolled the complex, with snipers deployed around the perimeter.\n“We could hear the wounded. We couldn’t help them. People were dying,” Al Borsh said. “We were forced to walk. As we walked out of al-Shifa hospital we saw bodies in the streets. The hospital was destroyed; no water, no oxygen, no medicine and attacks on every building [in the complex].”\nDoctor Abbas also shared footage recorded by Al Jazeera cameraman Hamdan Dahdouh from the emergency room at al-Shifa hospital shortly after the evacuation order, filled with panicked people, some shouting as they tried to assess who they were able to evacuate.\nDozens of wounded people lay sprawled on the tiled floor smeared with blood, some placed on to stretchers while two children sat on the ground as a third man attempted to bandage some of their wounds.\nThe ministry of health said 530 patients were forced to evacuate along with medics, but that five doctors agreed to stay behind with 120 of the worst injured. Thirty of the 39 premature babies evacuated from the neonatal ward last Sunday had survived a week outside their incubators, lined up together for warmth in one of al-Shifa’s operating rooms. Medical staff said they were attempting to find a way to evacuate the babies in cooperation with the International Committee of the Red Cross (ICRC).\n“Many patients cannot leave the hospital as they are in the ICU beds or the baby incubators,” surgeon Ahmed Al Mokhallalati posted on X, formerly Twitter. “I along with five other doctors will stay at al-Shifa hospital with 120 patients, as [they] cannot leave due to their health conditions.”\nA spokesperson for the Israel Defense Forces (IDF) denied that they had ordered an evacuation. Instead, they said, “the director of Shifa hospital requested that the IDF help secure an evacuation route from the hospital. The IDF therefore agreed and assisted evacuation efforts. At no point did the IDF order the evacuation of patients or medical teams and in fact proposed that any request for medical evacuation will be facilitated by the IDF.”\n‘We could hear the wounded. We couldn’t help them. People were dying’ Adnan Al Borsh, orthopaedics specialist\nThe raid on al-Shifa, Gaza’s largest medical facility, began in the hours before dawn on Wednesday, when Israeli tanks entered the complex. For more than 12 hours, commandos roamed the emergency department and the surgical wing.\nAccording to witnesses who spoke to the BBC and Al Jazeera, Israeli forces used loudspeakers to demand every man aged between 16 and 40 enter the courtyard, before strip-searching many and detaining them at an unknown location.\nDoctors inside the hospital later reported that Israeli forces placed facial recognition scanners at the exits.\nAl-Shifa is not the only hospital in Gaza City that has been forced to evacuate. At al-Quds hospital, ambulances operated by the Palestinian Red Crescent Service (PRCS) managed to evacuate some patients and staff early last week after initially turning back because of intense shelling around the hospital.\nThe PCRS shared footage on Thursday of some of the 14,000 people who had sheltered there passing bombed-out buildings and scaling piles of rubble, as they walked almost seven miles, some wheeling a seemingly unconscious man on a hospital bed through the destroyed streets.\nAt al-Ahli Arab hospital in eastern Gaza City, the only facility able to take in new patients for much of last week, doctors said they went from being able to only perform life-saving surgeries to being unable to operate at all, before many were forced to evacuate.\n“Since al-Shifa was surrounded and effectively collapsed as a hospital, all of the wounded were coming to al-Ahli,” said surgeon Ghassan Abu-Sittah, who had left Shifa hospital for al-Ahli early last week.\n“So for that six-day period until the early hours of Thursday morning, we received over 500 wounded and had been operating flat out. Sometimes, certainly in the last night, for 20 hours straight.\n“On Thursday, in the early hours of the morning, we finished the last case and we were told that meant the last of the anaesthetic, and that the operating rooms were no longer capable of providing any kind of surgery.\n“We made the decision to evacuate the hospital on Thursday morning, at least the operating rooms, and to keep the rest of the hospital as a first aid station, since we were no longer able to operate on patients.”\nAseel Baidoun, of Medical Aid for Palestinians, said: “It’s a total collapse of the health system,” pointing to a crisis worsened by the periodic shutdown of the two Palestinian phone companies operating in Gaza because of lack of fuel, leading to repeated communications blackouts.\n“The ambulances can’t communicate with hospitals, and people can’t call ambulances,” she said. “I know people who have walked kilometres to a hospital just to tell the medical crew of the locations of a bombardment.”\nIsraeli officials have long claimed that Hamas operates from underneath medical facilities, including a command centre in bunkers beneath al-Shifa hospital. Both Hamas and Shifa hospital staff denied this. Observers noted that the raid on hospitals produced some evidence of Hamas activity, but fell short of demonstrating al-Shifa was used as a command centre. The BBC also questioned whether weapons were moved before their journalists entered to film inside al-Shifa.\nIsraeli forces released footage of a spokesperson roaming the MRI department of al-Shifa hours after the raid, pulling what he termed “grab bags” of military clothing and guns from behind a machine and showing photos of neatly arranged automatic rifles, grenades, books, military-style clothing, and a large box of dates they had gathered in one room.\nThe IDF later released footage of the opening to a tunnel they said ran underneath the hospital, as well as images of a clutch of automatic weapons and military clothing they said were found inside a car within the hospital complex. They also released images of four automatic rifles, ammunition and equipment such as knives and walkie-talkies they said were discovered in al-Quds hospital.\n“They are piecing different things together, but it’s not the smoking gun,” said Mairav Zonszein of the International Crisis Group.\n“It’s very hard to understand what the IDF is doing, why it built up the issue of al-Shifa so much and then came out with basically nothing convincing. I think it’s very hard for anyone to understand it, and at a basic PR level, it’s just a disaster,” she said.\nAs thousands were forced to flee Gaza’s hospitals on foot, teams from the PRCS pleaded for outside help for their emergency medical teams left behind who they said were “besieged”, at al-Ahli hospital “amidst heavy bombardment and gunfire by Israeli soldiers”, with Israeli tanks in the vicinity.\nAbu-Sittah said that when he and other medics managed to leave al-Ahli, walking south for five hours on Thursday, they could hear Israeli tanks and machine guns.\nAt al-Shifa after the evacuation, just five medics remained to care for 30 premature babies and scores of critically ill patients amid the deserted ruins of Gaza City.", "source_domain": "www.theguardian.com", "text": null, "title": "‘It’s basically hell on earth’: Gaza City left totally bereft of healthcare", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/19/its-basically-hell-on-earth-gaza-city-left-totally-bereft-of-healthcare"}