{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:37:17", "date_modify": "None", "date_publish": "2023-11-19 18:08:30", "description": "Israel says opening was discovered beneath floor of a garage within Gaza medical complex’s walls", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F19%2Fidf-israel-army-footage-claims-hamas-tunnel-al-shifa-hospital-gaza.json", "image_url": "https://i.guim.co.uk/img/media/a714ff4e59105a7832ae512ba1991e4f24a31b25/495_264_3944_2368/master/3944.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ce8c4eaedf8b1cfe7004d86fa844226f", "language": "en", "localpath": null, "maintext": "The Israeli army has published video footage that it says shows the first solid evidence of a sophisticated Hamas tunnel network underneath Gaza City’s Dar al-Shifa hospital complex.\nIn a statement on Sunday, the Israel Defense Forces (IDF) said troops operating near the in-patients building at al-Shifa found a booby-trapped pickup truck in a garage inside the medical complex’s walls. When it was destroyed in a controlled explosion, a tunnel was exposed beneath the floor of the garage, the IDF said, providing photographs.\nIn footage dated 16 and 17 November taken by army robots, a tunnel shaft about 10 metres long is navigated by a rickety circular staircase, before it reaches a 55-metre-long tunnel. The tunnel contains electricity wires and slopes downwards until it ends at a blast-proof door, with a small slot through which to fire weapons. The IDF says it is yet to reach beyond the door.\nIsraeli forces first entered the large al-Shifa complex five days ago, alleging that the militant group Hamas used it as a command centre and identifying it as a key target despite international outcry.\nUntil Sunday, the IDF had displayed what it said were weapons found after searches of the grounds but was yet to produce evidence to back up the claims of a vast tunnel complex located beneath the hospital – allegations denied by both hospital staff and Hamas.\nSearches for weapons, tunnel shafts and other Hamas materiel at al-Shifa were ongoing, the army said. Other findings included what the IDF said it had identified as explosive devices in the physical therapy ward, an interrogation room in the cardiology ward, and weapons and intelligence in the MRI centre. The Guardian could not independently verify the claims, although the IDF provided photo and video evidence.\nAs Israeli forces drew closer to the hospital this week, at least 40 people including eight premature babies died because of a lack of electricity to operate life-saving equipment such as incubators and dialysis machines, the UN said.\nThe desperate struggle to keep the remaining 300 or so vulnerable patients at al-Shifa alive as the UN attempts to evacuate them southwards comes as Israel has said it is expanding its operations to destroy Hamas to areas south of Gaza City, raising fears for the hundreds of thousands of civilians who have sought refuge there after being told by the IDF that it would be safer.", "source_domain": "www.theguardian.com", "text": null, "title": "IDF publishes footage of what it says is Hamas tunnel at al-Shifa hospital", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/19/idf-israel-army-footage-claims-hamas-tunnel-al-shifa-hospital-gaza"}