{"authors": ["Bethan Mckernan"], "date_download": "2024-02-05 15:37:18", "date_modify": "None", "date_publish": "2023-11-19 17:53:31", "description": "UN agency visits al-Shifa hospital after raid by Israeli forces who allege it is used by Hamas as a command centre", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F19%2Fgazas-main-hospital-has-become-a-death-zone-says-who.json", "image_url": "https://i.guim.co.uk/img/media/049cf48d859228e0a11b91b229eab7799dc11f51/0_151_1200_720/master/1200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9471d872b9a9244af2f1abc77ffa3a70", "language": "en", "localpath": null, "maintext": "Dar al-Shifa, the Gaza Strip’s largest hospital, has become a “death zone”, the World Health Organization has said, with a mass grave at the entrance and only 25 staff left to care for 291 seriously ill patients after orders from the Israeli army to evacuate the complex.\nThe WHO managed to access the medical centre in Gaza City on Sunday after it was raided by Israeli forces earlier this week. Israel alleged the militant group Hamas used al-Shifa as a command centre, identifying it as a key target in its military operation despite international outcry.\nThe Israel Defense Forces (IDF) released video footage on Sunday of what it said was a 55-metre tunnel 10 metres underground, which it had uncovered underneath a shed in the hospital complex. It also released footage it said showed one Thai and one Nepalese hostage, dated from the 7 October Hamas massacres, that appeared to be from Shifa’s CCTV system. The identities of the two men were not given.\nAbout 2,500 people, among them many sick and injured, including amputees, walked south from the area of al-Shifa on Saturday after being told to leave, the hospital director said, picking their way through ruined streets and rotting corpses.\nOn Sunday, the WHO and Palestinian Red Crescent started evacuating those who were unable to flee on foot, including 32 babies in extremely critical condition, trauma patients with severely infected wounds due to a lack of antibiotics, and 29 patients with serious spinal injuries.\nThe babies were taken to the south of Gaza “in preparation for their transfer to the Emirates hospital in Rafah” in Egypt, the Palestinian Red Crescent said in a statement, through the Palestinian territory’s only connection to the outside world.\nRegarding the other patients, the WHO warned that facilities in Gaza’s south, which is supposedly safer than Gaza City, were already overwhelmed and an immediate ceasefire was needed given the extreme levels of suffering.\n“Patients and health staff with whom they spoke were terrified for their safety and health, and pleaded for evacuation,” the UN agency said, describing al-Shifa as a “death zone”.\nAs reporters on the ground described seeing ambulances travelling north to Gaza City to assist with the Shifa hospital evacuations on Sunday, news emerged from the international NGO Médecins Sans Frontières (MSF) that one person was killed when a convoy carrying staff and family members came under attack on Saturday while evacuating from its clinic near al-Shifa, despite coordinating its passage with both sides.\nAt least 40 people, including eight premature babies, died this week at al-Shifa because of a lack of electricity to operate life-saving equipment such as incubators and dialysis machines, the UN has said.\nThe desperate struggle on Sunday to keep the rest of al-Shifa’s most vulnerable patients alive as they are evacuated south comes as Israel has said it is expanding its operations to destroy Hamas to areas south of Gaza City, raising fears for the hundreds of thousands of civilians who have sought refuge there after being told by the IDF that it would be safer.\n“With every passing day there are fewer places in which Hamas terrorists can roam about … People who are in the southern Gaza Strip will understand that soon as well,” the Israeli defence minister, Yoav Gallant, said on Saturday night.\nThe humanitarian situation in the southern half of Gaza is little better than the north; 15 Palestinians were killed early on Sunday in Israeli bombardments of central and southern areas, the Palestinian news agency Wafa reported. Thirteen were killed in an attack on a home in Nuseirat camp in central Gaza, while a woman and her child were killed in southern Khan Younis city.\nAnother airstrike outside Khan Younis killed at least 26 people on Saturday. At least 50 people were killed in a separate attack on Saturday on a UN-run school in the north’s Jabalia camp, and a strike on another building there killed 32 members of a single family, 19 of them children, officials from the Hamas-run Gaza health ministry told AFP.\n“The scenes were horrifying. Corpses of women and children were on the ground. Others were screaming for help,” Ahmed Radwan, who was among the wounded, told the Associated Press by phone.\nWitnesses reported heavy fighting overnight on Sunday between Hamas gunmen and Israeli forces trying to advance into Jabalia, the largest of Gaza’s camps, previously home to nearly 100,000 people.\nFor weeks, Israel has urged civilians in and around Gaza City to head south to protect themselves – but last week for the first time the Israeli military urged people to leave areas around Khan Younis. Thousands of people in the town have already been displaced once, crammed into private homes and UN buildings that serve as shelters.\nIt is not clear where civilians can go to escape the fighting if it intensifies in the south. The IDF’s relentless air and ground campaign has already killed 13,000 people, more than 5,000 of them children, according to the Hamas government, which seized control of Gaza in 2007.\nThe UN says more than half of the strip’s population of 2.3 million people have been displaced during the six weeks of fighting, triggered by the 7 October Hamas attacks on Israel that killed 1,200 people, most of them civilians, and in which about 240 people were taken hostage.\nHamas’s armed wing, the al-Qassam brigades, said militants killed six soldiers at close range in the village of Juhr al-Dik, east of Gaza City, overnight, after ambushing them with an anti-personnel missile and closing in with machine guns. A total of 62 Israeli soldiers have died in the conflict, according to the latest army count.\nDiplomacy to secure the release of hostages in exchange for a pause in the Israeli offensive continues.\nIn comments made at a joint press conference with the EU foreign policy chief, Josep Borrell, in Doha on Sunday, the Qatari prime minister, Sheikh Mohammed Bin Abdulrahman al-Thani, said the challenges that remained were “very minor” and were practical and logistical.\nIsrael cut off all fuel imports to Gaza at the start of the war, causing the area’s sole power plant and most water treatment systems to shut down. Under US pressure, Israel permitted a first consignment of fuel to enter late on Friday, allowing telecommunications in the territory to resume after a two-day blackout.\nThe UN said Israel had agreed to allow in 60,000 litres of fuel a day from Saturday, but that this was only about half of what was needed. Food, water and medicines are also in short supply, with just a trickle of aid allowed in from Egypt.\nFrance was preparing to send a second aircraft carrier to the eastern Mediterranean to offer medical assistance in Gaza, the office of the French president said on Sunday.\n“Humanitarian pressure is a legitimate means to increase the chances of seeing the hostages alive. We mustn’t adopt the American narrative that ‘allows’ us to fight only against Hamas guerrillas instead of doing the right thing – fighting against the adversary’s entire establishment, since the collapse of its civilian establishment will end the war more quickly,” Giora Eiland, a former director of Israel’s National Security Council, wrote in the daily newspaper Yedioth Ahronoth on Sunday.\nGaza’s fate after the conflict remains unclear. Joe Biden said in an opinion piece published on Saturday that the coastal territory and the Israeli-occupied West Bank should come under a single “revitalised” Palestinian administration, but the Israeli prime minister, Benjamin Netanyahu, has said the West Bank’s semi-autonomous Palestinian Authority “is not capable of receiving responsibility for Gaza”.", "source_domain": "www.theguardian.com", "text": null, "title": "Gaza’s main hospital has become a ‘death zone’, says WHO", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/19/gazas-main-hospital-has-become-a-death-zone-says-who"}