{"authors": ["Matt Strudwick"], "date_download": "2024-02-05 15:37:21", "date_modify": "None", "date_publish": "2023-11-19 08:58:21", "description": "Qatar had helped broker talks with the aim of freeing some of the 240 taken hostage by the terrorist group during the barbaric October 7 massacre in Israel.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12767251%2FIsrael-Hamas-ceasefire-latest.html%3Fns_mchannel%3Drssns_campaign%3D1490ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/19/09/77982979-0-image-a-9_1700386579384.jpg", "language": "en", "localpath": null, "maintext": "A ceasefire between Israel and Hamas is edging closer today with Qatari mediators saying only 'very minor' details remain before a deal is struck.\nQatar had helped broker talks with the aim of freeing some of the 240 taken hostage by the terrorist group during the barbaric October 7 massacre in Israel in which around 1,200 people were murdered.\nA three-day pause in fighting is being discussed in return of 50 hostages being freed, according to reports.\nIsrael said it is hopeful that a significant number of hostages could be released by Hamas 'in [the] coming days' but Israeli Ambassador to the United States Michael Herzog stopped short of calling any deal a ceasefire.\nQatar's Prime Minister Mohammed bin Abdulrahman Al Thani told a joint press conference with EU foreign policy chief Josep Borrell: 'The challenges that remain in the negotiations are very minor compared to the bigger challenges, they are more logistical, they are more practical.\nPeople mourn as they collect the bodies of Palestinians killed in airstrikes on November 19, in Khan Yunis, Gaza\nFather Jamil Al-Agha cradles his five-year-old son Muhammad who was killed during airstrikes on November 19\n'The deal is going through ups and downs from time to time throughout the last few weeks.\n'I think that I'm now more confident that we are close enough to reach a deal that can bring the people safely back to their homes.'\nMr Herzog told ABC's This Week today: 'We are hopeful we can get a significant amount of hostages free in the coming days but I don't want to go into the details of these talks they are obviously very sensitive. The less we go into the details the better the chances of such a deal.\n'But there are very serious efforts and I'm hopeful that we can have a deal in the coming days.'\nIsrael is against a ceasefire as 'it would allow Hamas to retain power, regroup, rearm, and strike again', Mr Herzog added.\n'We are talking about a pause in the fighting for a few days so we can get the hostages out,' he said.\n'It is not a ceasefire as we will continue to push against Hamas, to dismantle their military infrastructure and their terror infrastructure. We are not going to stop that.'\nWhite House deputy national security adviser Jon Finer said negotiations had reached a 'very sensitive stage'.\n'We are following this minute by minute, hour by hour, and have been over a number of weeks,' he told ABC.\n'What I can say about the state of the talks and the Prime Minister of Qatar has said something similar this morning is that some of the gaps have now narrowed. Some of the issues that were at odds have now been closed out.\n'But we are not finished and there's not a deal in place and I think it would be premature to conclude that this is inevitable given how close we have come in the past.'\nIt comes after the White House this morning poured cold water over the Washington Post's claims a ceasefire had been agreed between Israel and Hamas, amid the World Health Organisation (WHO) branding the situation inside Gaza's largest hospital 'deplorable'.\nReports swirled overnight a deal had been tentatively struck for a five-day pause in fighting in exchange to free dozens of women and children taken hostage in Gaza.\nThe White House said it is working on trying to get a deal done.\nAdrienne Watson, a White House National Security Council spokesperson, said: 'We have not reached a deal yet, but we continue to work hard to get to a deal.'\nWHO called for an immediate ceasefire after it described the Al-Shifa hospital as a 'death zone' following a one hour assessment in which a mass grave was discovered at the entrance holding the remains of 80 people.\nThirty-one 'very sick' premature babies have since been safely transferred in six Palestine Red Crescent ambulances to the Al-Helal Al-Emairati Maternity Hospital in the south Gaza city Rafah. They will then be moved to Egypt.\nSix medics and ten family members were also evacuated.\nEarly on Sunday morning in Israel, Prime Minister Benjamin Netanyahu denied that any such deal for a ceasefire was in place\nA humanitarian assessment team led by WHO visits the Al Shifa hospital in Gaza in which it was described as being a 'death zone'\nA premature baby which was among the 31 evacuated from Al Shifa hospital is fed as it received treatment at an hospital in Rafah\nThis picture taken from southern Israel shows smoke rising above buildings during an Israeli strike on the Gaza Strip\nIsraeli soldiers inspect the al-Shifa hospital complex, amid their ground operation against Hamas, in Gaza City, November 15, 2023\nA makeshift operating theater area is seen inside al-Shifa hospital during Israel's ground operation around the hospital on November 12\nWeapons allegedly found inside the Al Shifa hospital during Israeli raids this week\nMilitary spokesman Rear Admiral Daniel Hagari (pictured) said Israel opened a safe corridor for civilians who were in the hospital to go south, at the request of the hospital director\nReports had emerged that Israel, the United States and Hamas had reached a tentative agreement to free dozens of women and children held hostage in Gaza in exchange for a five-day pause in fighting\nDirector-general of WHO Tedros Adhanom Ghebreyesus wrote on X that further missions are being planned.\n'We’re deeply moved and impressed by the extraordinary bravery and service of the health workers in Gaza, who continue to serve under the most dire and difficult circumstances,' he said.\nIsrael military raided the hospital in recent days having claimed Hamas was using it as its headquarters.\nEvidence of gun fire and shelling was discovered by the United Nations humanitarian assessment teams with medical and solid waste filling the corridors and hospital grounds.\nWHO said: 'Lack of clean water, fuel, medicines, food and other essential aid over the last six weeks have caused Al-Shifa Hospital - once the largest, most advanced, and best equipped referral hospital in Gaza - to essentially stop functioning as a medical facility.\n'The team observed that, due to the security situation, it has been impossible for the staff to carry out effective waste management in the hospital.'\nThere are 291 'terrified' patients - many with amputations, broken bones, infected wounds, and serious spinal injuries - and 25 medics still inside the hospital, with 32 babies said to be in an 'extremely' critical condition.\nAround 2,500 people, mobile patients and medical staff had left the sprawling compound on Saturday morning\nWHO said it was 'urgently' trying to evacuate the remaining patients over the next 24 to 72 hours to the Nasser Medical Complex and European Gaza Hospital in southern Gaza, which themselves are nearly at bursting point.\n'Patients and health staff with whom they spoke were terrified for their safety and health and pleaded for evacuation,' WHO added.\n'Al-Shifa Hospital can no longer admit patients, with the injured and sick now being directed to the seriously overwhelmed and barely functioning Indonesian Hospital.'\nIsrael has long alleged that Hamas maintains a sprawling command post inside and under Shifa.\nIsrael claimed to have found a tunnel near the hospital which they say supports their claims the hospital is sat on top of a Hamas stronghold\nPalestinians evacuating to the southern Gaza Strip, make their way along Salah al-Din Street in Bureij on November 18\nAn IDF soldier directs a tank driver by gesturing near the northern Gaza border on November 17\nCivil defense teams, alongside local residents, conduct search and rescue operation within the debris of the residential buildings after Israeli attacks hit residential buildings at Jabalia Camp in Jabalia, Gaza on November 18\nIt has portrayed the hospital as a key target in its war to end the militants' rule in Gaza following their wide-ranging attack into southern Israel six weeks ago, which triggered the war.\nHamas and hospital staff deny the allegations. Israeli troops who have been based at the hospital and searching its grounds for days say they have found guns and other weapons, and showed reporters the entrance to a tunnel shaft.\nREAD MORE: Thousands of Israelis complete five-day march on Jerusalem to demand a meeting with Prime Minister Benjamin Netanyahu to discuss plans to save hostages captured by Hamas in October 7 attacks Advertisement\nSaturday's mass departure was portrayed by Israel as voluntary, but the WHO said the military had issued evacuation orders, and some of those who left described it as a forced exodus.\n'We left at gunpoint,' Mahmoud Abu Auf told The Associated Press by phone after he and his family left the crowded hospital. 'Tanks and snipers were everywhere inside and outside.' He said he saw Israeli troops detain three men.\nThe Washington Post reported a six-page ceasefire agreement between Israel, Hamas, and America detailed all parties would freeze combat operations for at least five days while 'an initial 50 or more hostages are released in smaller groups every 24 hours'.\nSo far, just four captives have been released the war began.\nThe newspaper said overhead surveillance would monitor ground movement to help police the pause, which also is intended to allow in a significant amount of humanitarian aid.\nBut early on Sunday morning in Israel, Prime Minister Benjamin Netanyahu denied that any such deal was in place.\nNetanyahu said 'as of now' there no deal had yet been reached to secure the release hostages being held by Hamas dismissing 'a lot of incorrect reports' about imminent agreements.\nDuring a press conference he added that if a deal emerges, the Israeli public would be told.\nIsraeli National Security Council head Tzachi Hanegbi has said that a limited cease-fire would only after 'a massive release of our hostages … and it will be limited and short, because after that we will continue to work towards achieving our war goals.'\nThe White House National Security Council's top Middle East official Brett McGurk, confirmed that negotiations were 'intensive and ongoing.'\n'It's reasonable to pause the fighting, release the hostages, the women, the children, the toddlers, the babies, all of them,' McGurk said.\nAccording to the Post, however, it is believed the pause in fighting would allow for a significant increase in the amount of humanitarian assistance, including fuel, to enter from Egypt.\nIt's not known if Americans or other nationalities would be included in the first batch to be released however the hope is if women and children are successfully returned that other groups would follow.\nThe deal is said to be the outcome of weeks of talks in Doha, Qata involving Israel, the United States and Hamas who were represented by Qatari mediators.\nPressure has been increasing on Israeli Prime Minister Benjamin Netanyahu's government with more than 100 countries calling for a full and immediate cease-fire - although, most notably, not the United States.\nHowever, The Post says the White House would back a temporary pause in the fighting.\n'I think we need a pause. A pause means time to get the prisoners out,' Biden said during a campaign event two weeks ago.\nEarlier this week, Biden said the hostages were 'on our mind every single day,' and that he was looking to find a way to 'have a period of time where there's a pause long enough' to let them be released.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hope for Israeli hostages: Qatari mediators say 'very minor' details remain before deal is struck to release dozens of people kidnapped by Hamas in return for a three-day ceasefire", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12767251/Israel-Hamas-ceasefire-latest.html?ns_mchannel=rssns_campaign=1490ito=1490"}