{"authors": [], "date_download": "2024-02-05 15:37:23", "date_modify": "None", "date_publish": "2023-11-19 07:13:45", "description": "A United Nations team says 291 patients were left at Gaza’s largest hospital after Israeli troops had others evacuate", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fgaza-ap-israeli-world-health-organization-khan-younis-b2449893.html.json", "image_url": "https://static.independent.co.uk/2023/11/19/07/APTOPIX_Israel_Palestinians_55441.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nA United Nations team said Sunday that 291 patients were left at Gaza’s largest hospital after Israeli troops had others evacuate. Those left included 32 babies in extremely critical condition, trauma patients with severely infected wounds, and others with spinal injuries who are unable to move.\nThe team was able to tour Shifa Hospital for an hour after about 2,500 displaced people, mobile patients and medical staff left the sprawling compound Saturday morning, said the World Health Organization, which led the mission. It said 25 medical staff remained, along with the patients.\n“Patients and health staff with whom they spoke were terrified for their safety and health, and pleaded for evacuation,” the agency said, describing Shifa as a death zone. It said more teams will attempt to reach Shifa in coming days to try to the evacuate patients to southern Gaza, where hospitals are also overwhelmed.\nIsrael has long alleged that Hamas maintains a sprawling command post inside and under Shifa. It has portrayed the hospital as a key target in its war to end the militants' rule in Gaza following their wide-ranging attack into southern Israel six weeks ago, which triggered the war.\nHamas and hospital staff deny the allegations. Israeli troops who have been based at the hospital and searching its grounds for days say they have found guns and other weapons, and showed reporters the entrance to a tunnel shaft. The AP couldn't independently verify Israel's findings.\nSaturday's mass departure was portrayed by Israel as voluntary, but the WHO said the military had issued evacuation orders, and some of those who left described it as a forced exodus.\n“We left at gunpoint,” Mahmoud Abu Auf told The Associated Press by phone after he and his family left the crowded hospital. “Tanks and snipers were everywhere inside and outside.” He said he saw Israeli troops detain three men.\nSTRIKES IN THE NORTH AND SOUTH\nElsewhere in northern Gaza, dozens of people were killed in the urban Jabaliya refugee camp when what witnesses described as an Israeli airstrike hit a crowded U.N. shelter Saturday. It caused massive destruction in the camp's Fakhoura school, said wounded survivors Ahmed Radwan and Yassin Sharif.\n“The scenes were horrifying. Corpses of women and children were on the ground. Others were screaming for help,” Radwan said by phone. AP photos from a local hospital showed more than 20 bodies wrapped in bloodstained sheets.\nThe Israeli military, which has repeatedly called on Palestinians to leave northern Gaza, said only that its troops were active in the area “with the aim of hitting terrorists.” It rarely comments on individual strikes, saying only that it targets Hamas while trying to minimize civilian harm.\nIn southern Gaza, an Israeli airstrike hit a residential building near the town of Khan Younis on Saturday, killing at least 26 Palestinians, according to a doctor at the hospital where the bodies were taken.\nMore than 11,500 Palestinians have been killed, according to Palestinian health authorities. Another 2,700 have been reported missing, believed buried under rubble. The count does not differentiate between civilians and combatants; Israel says it has killed thousands of militants.\nHOSTAGES AND AID\nAround 1,200 people have been killed on the Israeli side, mainly civilians killed during Hamas' Oct. 7 attack, in which the group also dragged some 240 captives back into Gaza. The military says 52 Israeli soldiers have been killed.\nHamas has released four hostages, Israel has rescued one, and the bodies of two hostages were found near Shifa in an area where there had been heavy fighting.\nIsrael, the United States and the Persian Gulf nation of Qatar, which mediates with Hamas, have been negotiating over a hostage release for weeks. On Saturday, a senior White House official suggested it would need to be completed before the entry of large amounts of desperately needed aid.\n\"A release of large number of hostages would result in a significant pause in fighting … and a massive surge of humanitarian relief,\" Brett McGurk, the White House’s National Security Council coordinator for the Middle East, said at a conference in Bahrain.\nGaza’s main power plant shut down early in the war, and Israel has cut off electricity. That has left local authorities unable to operate water treatment plants, bakeries, hospitals and other critical infrastructure without fuel for generators, which has run low since Israel cut off all imports at the start of the war.\nMore than two thirds of Gaza's population of 2.3 million have fled their homes. The U.N. agency for Palestinian refugees, known as UNRWA, is providing basic services to hundreds of thousands of people sheltering in schools and other facilities.\nOver the weekend, Israel allowed UNRWA to import enough fuel to continue humanitarian operations for another couple of days, and to keep internet and telephone systems running. UNRWA had been forced to put aid operations on hold Friday during a communications blackout.\nGaza has received only 10% of its required food supplies each day in shipments from Egypt, according to the U.N., and the water system shutdown has left most of the population drinking contaminated water.\nA WIDER OFFENSIVE?\nDefense Minister Yoav Gallant said Saturday that Israel's forces were expanding operations in Gaza City. “With every passing day, there are fewer places where Hamas terrorists can operate,” he said, adding that the militants would learn that in southern Gaza “in the coming days.\"\nHis comments were the clearest indication yet that the military plans to expand its offensive to southern Gaza, where Israel had told Palestinian civilians to seek refuge. The evacuation zone is already crammed with displaced civilians, and it was not clear where they would go if the offensive moved closer.\nEven as it warns of a broadening offensive, Israel remains at odds with its main ally, the United States, over what to do with Gaza should it succeed in removing Hamas from power.\nPrime Minister Benjamin Netanyahu said Saturday that the Israeli military would have “full freedom” to operate within the territory after the war, indicating it would at least temporarily reoccupy the territory from which it withdrew soldiers and settlers in 2005.\nIn an op-ed published Saturday in The Washington Post, U.S. President Joe Biden said Gaza and the West Bank should be reunited and governed under a “revitalized Palestinian Authority” while world leaders work toward a solution that would create a Palestinian state alongside Israel.\nNetanyahu's government is strongly opposed to Palestinian statehood. The Palestinian Authority has said it would only return to govern Gaza — where Hamas routed its forces in 2007 — as part of a comprehensive two-state solution to the decades-old conflict.\n___\nMagdy reported from Cairo.\n___\nFull AP coverage at https://apnews.com/hub/israel-hamas-war.", "source_domain": "www.independent.co.uk", "text": null, "title": "UN team says 32 babies are among scores of critically ill patients stranded in Gaza's main hospital", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/gaza-ap-israeli-world-health-organization-khan-younis-b2449893.html"}