{"authors": ["Caroline Peacock"], "date_download": "2024-02-05 15:16:10", "date_modify": "None", "date_publish": "2024-01-24 13:24:22", "description": "WORLD War 3is on the minds of millions as Vladimir Putin continues to invade Ukraine.Secret documents from the German Ministry of Defence sugges", "filename": "https%3A%2F%2Fwww.thesun.co.uk%2Fnews%2F25469878%2Fconscription-age-uk-war-russia%2F.json", "image_url": "https://www.thesun.co.uk/wp-content/uploads/2024/01/2024-london-england-spoke-seeing-872869523.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "language": "en", "localpath": null, "maintext": "call up What age is conscription and will Brits be forced to sign up for military service if the UK goes to war with Russia?\nWORLD War 3 is on the minds of millions as Vladimir Putin continues to invade Ukraine.\nSecret documents from the German Ministry of Defence suggest Russia will escalate the conflict in Ukraine to an all-out war.\n1 Russian President Vladimir Putin has already given multiple signs that he is prepared to breach NATO borders Credit: Reuters\nWhat is the conscription age in the UK?\nThe conscription age varies but traditionally starts at 18.\nThe UK implemented conscription during two distinct periods when World War I and World War II broke out.\nThe system required all men to register within 30 days of their 18th birthday and listed all those who would be potentially subject to the draft.\nHowever, there were some exceptions including those with specific health concerns or job roles.\nPolice officers, medical personnel, prison workers, students, government employees, and ministers of any religion were exempt.\nThose who also had certain physical or mental disorders, such as blindness, were not called up.\nThe conscription policy remained in effect until 1960, at which point the UK government decided to suspend it.\nIt then transitioned to a volunteer-based armed forces system.\nWhat does conscription mean?\nConscription, also known as the military draft, is a compulsory enrollment of individuals into the armed forces.\nIt requires those who are eligible, typically young and fit individuals, to serve a period in the military.\nConscription is often put in force during times of war or when there is a need to grow the manpower of the armed forces.\nIt's a way for governments to ensure there is a decent number of personnel to meet national defense requirements.\nWill I be forced to sign up for military service if the UK goes to war with Russia?\nAs it stands, there is no conscription legislation in the UK\nThis means no one will be legally required to fight in a war if they don't want to.\nHowever, General Sir Patrick Sanders has warned the Government of the need to \"mobilise\" the public if the UK goes to war with Russia.\nThis is because the British military is \"too small\" to handle the conflict on its own.\nCivilians would have to be mobilised in large numbers if war broke out, he told reporters.\nHe said there should be a shift in the public's mindset of who should be willing to defend the UK against foreign adversaries.\nIn addition, Nato bosses have warned allied nations to be prepared to take any actions necessary to fight Vladimir Putin's forces.\nWhile forced conscription is not currently in effect in the UK, Parliament has the authority to enact a law reinstating it in the event of a national crisis.\nWhat was the conscription age in World War II and World War III?\nThe UK has only used conscription twice in the last century.\nThe first conscription period took place during and after the First World War between 1916 and 1920.\nThis imposed conscription on all single men aged between 18 and 40.\nThe law later changed to include married men and the age limit was raised to 51 years old.\nThe second conscription period happened during and after the Second World War between 1939 and 1960.\nInitially, only single men aged between 20 and 22 were liable to be called up.\nHowever, as the war escalated, the age requirement was changed to include all men aged 18 to 41 and later extended to cover men between the ages of 18 and 51.", "source_domain": "www.thesun.co.uk", "text": null, "title": "What age is conscription and will Brits be forced to sign up for military service if the UK goes to war with Russia?", "title_page": null, "title_rss": null, "url": "https://www.thesun.co.uk/news/25469878/conscription-age-uk-war-russia/"}