{"authors": ["Miriam Kuepper"], "date_download": "2024-02-05 15:37:24", "date_modify": "None", "date_publish": "2023-11-19 02:13:53", "description": "Israel prepares to expand its offensive against Hamas to southern Gaza today after warning civilians to relocate after already dropping warning leaflets earlier this week.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12766681%2FIsraels-Defence-Forces-gear-operation-South-Gaza-hundreds-Palestinians-accuse-Tel-Aviv-troops-forcing-wounded-civilians-leave-Al-Shifa-hospital-conduct-search-Hamas-assets.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/19/02/77978119-0-image-a-91_1700359521686.jpg", "language": "en", "localpath": null, "maintext": "Israel's Defence Forces (IDF) are gearing up for their operation into South Gaza as hundreds of Palestinians accused Tel-Aviv troops of forcing wounded civilians to leave Al-Shifa hospital while conducting a search for Hamas assets.\nIsrael prepares to expand its offensive against Hamas to southern Gaza today after warning civilians to relocate after already dropping warning leaflets earlier this week.\nThe country vowed to destroy Hamas after the terror group's October 7 attacks in which its fighters killed 1,200 people and took 240 hostages.\nAs the IDF looked to move southward, Palestinian officials accused the Israeli army of forcibly evacuating most staff, patients and displaced people from Gaza's largest hospital Al-Shifa and abandoning them to perilous journeys southwards on foot.\nHamas-run authorities in Gaza have raised their death toll to 12,300, including 5,000 children, this weekend following further Israeli attacks.\nCivil defense teams, alongside local residents, conduct search and rescue operation within the debris of the residential buildings after Israeli attacks hit residential buildings at Jabalia Camp in Jabalia, Gaza on November 18, 2023\nAn IDF soldier directs a tank driver by gesturing near the northern Gaza border on November 17, 2023\nPeople mourn as they collect the bodies of Palestinians killed in airstrikes on November 18, 2023 in Khan Yunis, Gaza\nMilitary spokesman Rear Admiral Daniel Hagari (pictured) said Israel opened a safe corridor for civilians who were in the hospital to go south, at the request of the hospital director\nIsrael's military has been searching Gaza City's Al-Shifa Hospital for a Hamas command centre that it alleges is located under the facility - a claim Hamas and hospital staff deny.\nThe evacuation, which Israel says was voluntary, left behind only Israeli troops and a small number of health workers to care for those too sick to move.\nMilitary spokesman Rear Admiral Daniel Hagari said Israel opened a safe corridor for civilians who were in the hospital to go south, at the request of the hospital director.\nREAD MORE: Thousands of Israelis complete five-day march on Jerusalem to demand a meeting with Prime Minister Benjamin Netanyahu to discuss plans to save hostages captured by Hamas in October 7 attacks Advertisement\nIsraeli forces seized Al Shifa in their offensive across north Gaza earlier in the week, saying it concealed an underground Hamas command centre.\n'We left at gunpoint,' Mahmoud Abu Auf said after he and his family left the crowded hospital. 'Tanks and snipers were everywhere inside and outside.' He said he saw Israeli troops detain three men.\nWhat led to the Shifa Hospital evacuation wasn't immediately known. Israel's military said it was asked by the hospital's director to help those who would like to leave to do so and that it did not order an evacuation.\nBut Medhat Abbas, a spokesman for the Health Ministry in Hamas-controlled Gaza, said the military ordered the facility cleared and gave the hospital an hour to get people out.\nA Shifa physician, Ahmed Mokhallalati, said on social media that about 120 patients remained, including some in intensive care and premature babies, and that he and five other doctors were staying.\nDefence Minister Yoav Gallant said Israel's forces have begun operating in eastern Gaza City while continuing its mission in western areas.\n'With every passing day, there are fewer places where Hamas terrorists can operate,' he said, adding that the militants would learn that in southern Gaza 'in the coming days.'\nHis comments were the clearest indication yet that the military plans to expand its offensive to southern Gaza, where Israel had told Palestinian civilians to flee early in the war.\nAn IDF soldier positioned on machine guns looks out while on a hummer near the Gaza border on November 17, 2023\nRelatives of Palestinians killed in an overnight airstrike on a house in Southern Gaza\nAn IDF soldier positioned on machine guns look out while on a humvee near the Gaza border on November 17, 2023 in Southern Israel\nPalestinians evacuating to the southern Gaza Strip, make their way along Salah al-Din Street in Bureij, 18 November 2023. More than 11,400 Palestinians and at least 1,200 Israelis have been killed, according to the Israel Defense Forces (IDF) and the Palestinian health authority, since Hamas militants launched an attack against Israel from the Gaza Strip on 07 October, and the Israeli operations in Gaza and the West Bank which followed it\nIsraeli soldiers inspect the al-Shifa hospital complex, amid their ground operation against Hamas, in Gaza City, November 15, 2023\nA makeshift operating theater area is seen inside al-Shifa hospital during Israel's ground operation around the hospital, in Gaza City November 12, 2023\nThe evacuation zone is already crammed with displaced civilians, and it was not clear where they would go if the offensive moves closer.\nAn Israeli offensive in the south could compel hundreds of thousands of Palestinians who fled Gaza City in the north to uproot again, along with residents of Khan Younis, a city of more than 400,000, compounding a dire humanitarian crisis.\nThe conflict has already displaced around two-thirds of Gaza's population of 2.3 million.\nAn advance into southern Gaza may prove more complicated and deadlier than in the north, however, with Hamas militants dug into the Khan Younis region, a senior Israeli source and two top ex-officials said.\nEarly Saturday, an air strike in a busy residential district of Khan Younis killed 26 Palestinians and wounded 23, health officials said.\nEyad Al-Zaeem said he lost his aunt, her children and her grandchildren in the air strike in Khan Younis. They all had evacuated from northern Gaza on Israeli army orders only to die where the army told them they could be safe, he said.\n'All of them were martyred. They had nothing to do with the (Hamas) resistance,' said Zaeem, standing outside the morgue at Nasser Hospital, where the 26 bodies were laid out before they were to be carried by loved ones to burials.\nA few miles to the north, six Palestinians were killed when a house was bombed from the air in the town of Deir Al-Balah, health authorities said.\nPeople search through buildings, destroyed during Israeli raids a day earlier, in the southern Gaza Strip on November 17, 2023\nSmoke rises after an explosion following an air strike on the northern part of the Gaza Strip, as seen from the Israeli city of Sderot, 18 November 2023\nPalestinians evacuating to the southern Gaza Strip, make their way along Salah al-Din Street in Bureij, 18 November 2023\nPalestinians gather as others search for casualties at the site of an Israeli strike, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip November 18, 2023\nA third Israeli air strike on Saturday afternoon killed 15 Palestinians in a house west of Khan Younis, close to a shelter for displaced people, witnesses and medics said.\nIsrael says Hamas typically conceals fighters and weaponry in residential and other civilian buildings, which Hamas denies.\nAn Israeli military statement said only that over the past 24 hours its air force had hit dozens of Gaza targets including militants, command centres, rocket launch sites and munitions factories.\nIsrael said five of its soldiers had been killed in Gaza since Friday, bringing its losses in the territory to 57.\nCommissioner-General Philippe Lazzarini of UNRWA, the UN aid organisation for Palestinian refugees, said on social media platform X that Israel bombarded two agency schools in the north.\nMore than 4,000 civilians were sheltered at one of them, he said.\n'Dozens reported killed including children,' he said. 'Second time in less than 24 hours schools are not spared. Enough, these horrors must stop.'\nA spokesperson for Gaza's Hamas authorities said 200 people had been killed or injured at the school. Israel's military did not comment.\nPalestinian Authority President Mahmoud Abbas, whose government controls parts of the Israeli-occupied West Bank, on Saturday said, 'Hundreds of forcibly displaced people were killed' at the two schools in Gaza.\nAbbas on Saturday made an appeal to US President Joe Biden to intervene to stop the Israeli operation in Gaza.\nIn an address aired by Palestine TV, Abbas said 'hundreds of forcibly displaced people were killed' at the two schools in Gaza and demanded 'that you and world leaders take responsibility to stop this aggression and genocide against our people.'\nBiden, who opposes a ceasefire, was looking to the end of the conflict, saying in a Washington Post opinion article that the Palestinian Authority should ultimately govern both Gaza and the West Bank.\nPalestinians gather as others search for casualties at the site of an Israeli strike, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas\nPalestinians look for survivors inside the remains of a destroyed building following an Israeli airstrike in Khan Younis refugee camp, southern Gaza Strip, Saturday, Nov. 18, 2023\nPalestinians gather as others search for casualties at the site of an Israeli strike, amid the ongoing conflict between Israel and Palestinian Islamist group Hamas, in Khan Younis in the southern Gaza Strip November 18, 2023\nAsked about Biden's proposal, Israeli Prime Minister Benjamin Netanyahu told reporters in Tel Aviv the Palestinian Authority in its current form was not capable of being responsible for Gaza. Israel has not disclosed a strategy for Gaza after the war.\nNetanyahu said Saturday that the Israeli military would have 'full freedom' to operate within the territory after the war. The comments again put him in conflict with US visions for a post-war era in Gaza.\nThe US is providing weapons and intelligence support to Israel in its offensive to root out Hamas.\nElsewhere in northern Gaza, dozens of people were killed in the urban Jabaliya refugee camp when what witnesses described as an Israeli airstrike hit a crowded UN shelter in the main combat zone.\nIt caused massive destruction in the camp's Fakhoura school, said wounded survivors Ahmed Radwan and Yassin Sharif.\n'The scenes were horrifying. Corpses of women and children were on the ground. Others were screaming for help,' Radwan said by phone. Photos from a local hospital showed more than 20 bodies wrapped in bloodstained sheets.\nThe Israeli military, which had warned Jabaliya residents and others in a social media post in Arabic to leave, said only that its troops were active in the area 'with the aim of hitting terrorists.'\nIt rarely comments on individual strikes, saying only that it targets Hamas while trying to minimise civilian harm.\nTwenty-five of Gaza's hospitals aren't functioning due to a lack of fuel, damage and other problems, and the other 11 are only partially operational, according to the World Health Organisation.\nIsrael has said hospitals in northern Gaza were a key target of its ground offensive, claiming they were used as militant command centres and weapons depots, which both Hamas and medical staff deny.\nInternet and phone service were restored Saturday to Gaza, ending a telecommunications outage that had forced the United Nations to shut down critical aid deliveries.\nTents and shelters used by displaced Palestinians stand at the yard of Al Shifa hospital during the Israeli ground operation around the hospital, in Gaza City November 12, 2023\nIsrael claimed to have found a tunnel near the hospital which they say supports their claims the hospital is sat on top of a Hamas stronghold\nFamily members and supporters of some 240 hostages held in Gaza have protested in Jerusalem today over Netanyahu's handling of the war with Hamas and pleaded with the government to do more to bring their loved ones home\nThe march capped a five-day trek from Tel Aviv and represented the largest protest on behalf of the hostages since they were dragged into Gaza by Hamas on October 7 as part of the militants' deadly attack in southern Israel\nIsraeli leaders have set two objectives – to crush Hamas and to bring the hostages home. Some of the hostage families have said they fear that the military offensive endangers their loved ones\nGaza's main power plant shut down early in the war, and Israel has cut off electricity. That makes fuel necessary to power generators needed to run water treatment plants, sanitation facilities, hospitals and other critical infrastructure for Gaza's 2.3 million people.\nUNRWA spokeswoman Juliette Touma said 120,000 liters of fuel arrived, enough for two days, for the UN's use after Israel agreed to the shipment. Israel also is allowing 10,000 liters to keep internet and telephone systems running.\nIt wasn't immediately clear when UNRWA would resume aid that was put on hold Friday during the communications blackout.\nGaza has received only 10 per cent of its required food supplies each day in shipments from Egypt, according to the UN, and the water system shutdown has left most of the population drinking contaminated water.\nDehydration and malnutrition are growing, according to the UN's World Food Program.\nIn Jerusalem, thousands of marchers - including family members and supporters of about 240 hostages held in Gaza by Hamas - arrived on the last leg of a five-day trek from Tel Aviv to plead with the government to do more to bring their loved ones home.", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Israel's Defence Forces gear up for operation into South Gaza as hundreds of Palestinians accuse Tel-Aviv troops of forcing wounded civilians to leave Al-Shifa hospital as they conduct search for Hama", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12766681/Israels-Defence-Forces-gear-operation-South-Gaza-hundreds-Palestinians-accuse-Tel-Aviv-troops-forcing-wounded-civilians-leave-Al-Shifa-hospital-conduct-search-Hamas-assets.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}