{"authors": [], "date_download": "2024-02-05 15:37:27", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "British special forces soldiers reportedly had an ?unofficial policy? of killing unarmed ?fighting-age males? in Afghanistan\r\n\r\n\r\nOne of the UK", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274035572%2Ftop-uk-general-withheld-evidence-of-sas-executions-bbc.json", "image_url": "https://cdn.bignewsnetwork.com/rtc1700158455.jpg", "language": "en", "localpath": null, "maintext": "British special forces soldiers reportedly had an ?unofficial policy? of killing unarmed ?fighting-age males? in Afghanistan\nOne of the UK's most senior generals allegedly withheld evidence of Special Air Service (SAS) soldiers executing handcuffed detainees in Afghanistan instead of disclosing it to military police, the BBC reported on Thursday.\nGeneral Gwyn Jenkins, who is now the second most senior officer in the UK's armed forces, reportedly received detailed written accounts of conversations of soldiers describing extrajudicial killings of Afghans in 2011, the BBC claims, citing an investigation by its Panorama program.\nIn March of that year, Jenkins allegedly received information from an officer in the UK's Special Boat Services that his colleagues were unlawfully killing unarmed people during nighttime raids, the report said. It added that soldiers were routinely killing \"fighting-age males,\" defined as men aged 15 or over, regardless of whether they posed a threat.\n\"In one case, it was mentioned a pillow was put over the head of an individual being killed with a pistol,\" one account in the documents states, per the report.\nIt adds that instead of handing over the evidence to military police as required by law, Jenkins placed the documents in a classified folder and locked it in a safe after briefing his superior, General Jonathan Page, about its contents. The BBC also noted that soldiers supposedly placed weapons close to the bodies of unarmed Afghans in an attempt to justify the killings.\nThe media outlet reported that the failure to disclose the dossier had previously been heard in court, but the identities of Jenkins and Page had been kept secret by the UK's Ministry of Defense. The dossier was locked away, and four years later, a whistleblower notified the Royal Military Police.\nIn his note to Page detailing the evidence, Jenkins wrote that he had been aware \"for some time\" of claims that SAS soldiers had an \"unofficial policy\" of carrying out \"executions of supposed Taliban affiliates,\" adding that he had received further information which \"makes me seriously concerned for the reputation of the [UK Special Forces],\" the BBC said.\nClaims of executions conducted by UK soldiers in Afghanistan are presently the subject of an inquiry at the Royal Courts of Justice in London. Last month, the court heard claims that SAS officials had deleted files related to allegations of extrajudicial killings before investigating authorities could view them.\nThe hearing may lead to a scenario where British troops could be tried for murder, the Daily Mail said on Thursday. Neither Jenkins nor Page responded to a request for comment, the BBC said, while the Ministry of Defense said it was \"not appropriate\" to comment while the inquiry was underway.\n(RT.com)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Top UK general withheld evidence of SAS executions BBC", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274035572/top-uk-general-withheld-evidence-of-sas-executions-bbc"}