{"authors": ["Emine Sinmaz"], "date_download": "2024-02-05 15:37:28", "date_modify": "None", "date_publish": "2023-11-18 19:00:29", "description": "Thousands had marched for five days to demand action by the Israeli prime minister to bring home the 240 people captured by HamasIsrael-Hamas war – live updates", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F18%2Fjust-look-us-in-the-eye-israeli-hostages-families-arrive-at-benjamin-netanyahus-jerusalem-office.json", "image_url": "https://i.guim.co.uk/img/media/b55522f86cc82907122a7a62fc4c98e2b0256877/0_674_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=7f37d2d4f409a658d018bdfcae09e7d4", "language": "en", "localpath": null, "maintext": "“I am wounded and bleeding. Mummy, I think I’m going to die,” were some of the last words Romi Gonen, 23, said to her mother, Meirav Leshem Gonen, after Hamas stormed southern Israeli towns and kibbutzim on 7 October.\nLeshem Gonen, 54, could hear shooting during the frantic 40-minute phone call but tried to comfort her daughter, who was at the Supernova music festival, saying: “Everything will be OK” and “You’ll feel better. You are not alone, you are with me, my darling.”\nThe call, the last 25 minutes of which the family recorded, was cut off at 10.59am. Romi is thought to be one of the 240 hostages taken by Hamas on what some in Israel now refer to as “Black Saturday”.\nView image in fullscreen Romi Gonen, 23, was among those captured by Hamas militants at the Supernova music festival in southern Israel. Photograph: Meirav Leshem Gonen\nHer mother and the relatives of other hostages arrived outside Benjamin Netanyahu’s office in Jerusalem on Saturday at the end of a five-day, 40-mile march from Tel Aviv to demand the release of their loved ones.\nThe families and thousands of their supporters reached the prime minister’s office in the afternoon and chanted the Hebrew word achshav, meaning “now”.\n“We want the government to come and talk to us. It’s been 43 days,” said Leshem Gonen. “Before taking any decision we want them to look in our eyes to make sure they remember who we are.\n“Romi is a wonderful and energetic and loving person. She’s a young girl who has just started her life and we want her back – her and all the others, more than 200 who were kidnapped. This is the only agenda.”\nYarden Gonen, 30, Romi’s sister, said the families feel neglected by the government. “But we have the power to unite every civilian in Israel and all the people that feel like we are their own family,” she said.\n“We want to show the Israeli government and the world that everyone is with us, that all the civilians in Israel are with us.\n00:00:54 Families of Israeli hostages reach Jerusalem after five-day march – video\n“The government in Israel and the world should see it, should know it, that we have the power of the people and we’re not going to back down until the hostages are home.”\nMany blame their government for being blindsided by the Hamas attacks, and relatives and friends of the missing fear they will come to harm in the Israeli military’s assault on Gaza. Hamas has claimed that some of the hostages have been killed in the invasion by Israeli forces.\nThe marchers left Tel Aviv on Tuesday, clutching water bottles and sleeping bags as they prepared to camp each night along the way. More than 3,000 volunteers provided food and set up tents for the group.\nOn Friday, Miki Zohar, a member of Netanyahu’s Likud party, showed up but was largely met by jeers, with the crowd yelling “Shame!” and “Take responsibility!” Yair Lapid, Israel’s opposition leader, also joined the march on Saturday.\nAs thousands of people joined the rally outside Netanyahu’s office, Yuval Haran, who has seven relatives who were taken hostage, told the crowd: “We ask a simple thing – come and talk to us.”\nHaran’s father, Avshalom, 66, and his aunt Lilach Kipnis and uncle Eviatar Kipnis were killed after Hamas stormed the Be’eri kibbutz.\nHis mother, Shoshan, 67, and his sister, Adi Shoham, along with her husband, Tal, their son, Naveh, eight, and daughter Yahel, three, were abducted. His aunt and her 12-year-old daughter were also kidnapped. Haran added: “We have to bring them back today, we can’t lose any more people.”\nYarden said the families were “done waiting” as she described the last 10 minutes of her mother’s phone call with Romi, a waitress who loved travelling. She said her sister had stopped talking and was instead crying quietly. “In the last 10 minutes you can hear the terrorists on her head, screaming,” Yarden said.\nShe added: “We got someone who speaks Arabic and we asked him to translate what they’re saying. They’re saying that she’s alive, and one of them is asking the other not to shoot her and to keep her alive.\nView image in fullscreen Families of Israeli hostages held by Hamas in Gaza march to Knesset in Jerusalem demanding the release of their relatives. Photograph: Anadolu Agency/Anadolu/Getty Images\n“Then they’re debating whether to take her or leave her and one of them said: ‘I don’t want to take her,’ and the other said: ‘No, no, you should take her.’ He replied: ‘OK, OK. I’ll take her with me,’ and then they hung up the phone.”\nAt 2:32pm that day, the family tracked the location of Romi’s mobile phone to Gaza. Since then, the family has been in agony, Yarden said\nIsraeli and Arabic news outlets have reported on negotiations to secure the release of at least some of the hostages, but there has been no confirmation from either side of an imminent deal.\nWhile Netanyahu initially refused to meet the families, Benny Gantz, a former defence minister who sits in Israel’s war cabinet, signalled he would be willing to. So once the rally outside Netanyahu’s office came to an end, the families headed back to Tel Aviv for a meeting with Gantz and Gadi Eisenkot, a former Israel Defense Forces chief.\nBy late on Saturday evening, Netanyahu had appeared to bow to pressure by agreeing to a meeting on Monday with the families.\n“We need to see that they’re doing everything in their power to get the hostages back home,” Yarden said. “And we’re not going to back down. This march ends today, but we’re not going to back down if they’re not here. We’re here, until they’re here.”", "source_domain": "www.theguardian.com", "text": null, "title": "‘Just look us in the eye’: Israeli hostages’ families arrive at Benjamin Netanyahu’s Jerusalem office", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/18/just-look-us-in-the-eye-israeli-hostages-families-arrive-at-benjamin-netanyahus-jerusalem-office"}