{"authors": ["Adam Fulton", "Léonie Chao-Fong", "Richard Luscombe", "Hamish Mackay", "Tom Ambrose", "Mabel Banfield-Nwachi", "Helen Sullivan"], "date_download": "2024-02-05 15:37:29", "date_modify": "None", "date_publish": "2023-11-18 05:04:31", "description": "Daniel Hagari’s comments come amid mounting concerns about Israeli plans to expand military operations where people have sought refuge from fighting", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2Flive%2F2023%2Fnov%2F17%2Fisrael-hamas-war-live-updates-gaza-starvation-idf-raid-jenin-refugee-camp-palestine-ceasefire-calls.json", "image_url": "https://i.guim.co.uk/img/media/6ca2dcfd69999429e678ae64c09b9a816bf90446/0_190_3744_2246/master/3744.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=2c593a7e5e4186d2d8da891ffca87037", "language": "en", "localpath": null, "maintext": "From 17 Nov 2023 22.52 CET Israeli troops to advance 'wherever Hamas exists, including in southern Gaza', says IDF spokesperson Israeli troops will advance to anywhere Hamas exists, including the southern part of the Gaza Strip, Israel Defense Forces (IDF) spokesperson Daniel Hagari has said. Hagari, in his regular briefing on Friday, said: We are determined to advance our operation. It will happen wherever Hamas exists, including in the south of the strip. It will happen at the time, place and conditions that are best for the military. The IDF spokesperson’s comments come amid mounting concerns about Israeli plans to expand military operations in parts of the south where people have sought refuge from fighting. Civilians in parts of south-east Gaza have been told in leaflets dropped by Israeli aircraft to move into a smaller “safe zone” in the coastal town of Mawasi, which covers just 14 sq km (5.4 sq miles).\n18 Nov 2023 05.46 CET The director of the al-Wafa hospital in Gaza City was killed and several doctors were injured in an Israeli airstrike launched against the hospital overnight on Friday, according to the Palestinian news agency Wafa. The director’s name was Midhad Mhaisen, according to reports. Wafa quoted local sources as saying Israeli warplanes launched an air raid against the al-Wafa hospital and home for elderly care in the al-Zahra area.\n18 Nov 2023 05.00 CET Brunei, Indonesia and Malaysia have called for an immediate, durable and sustained humanitarian truce leading to cessation of hostilities in the Gaza Strip, Reuters reports. The countries said they were issuing their statement to give a better and fair reflection of the discussions on the Gaza situation during a meeting of leaders from the Asia-Pacific Economic Cooperation (Apec) in San Francisco.\n18 Nov 2023 04.21 CET Fuel enters Gaza as phone blackout lifts A first consignment of fuel has entered Gaza after Israel bowed to US pressure for limited deliveries to allow wastewater treatment and the resumption of communications after a two-day blackout, Agence France-Press reports. The first delivery arrived from Egypt late on Friday as Israel pressed its offensive, combing the Gaza Strip’s largest hospital, al-Shifa, for the Hamas operations centre it says lies beneath. Israel’s war cabinet unanimously agreed on Friday to allow two fuel tankers a day “to run the wastewater treatment facilities ... which are facing collapse due to the lack of electricity”, national security adviser Tzachi Hanegbi said. The UN agency for Palestinian refugees (UNRWA) said 70% of residents had no access to clean water in south Gaza, where raw sewage has started to flow on the streets. Under the deal, 140,000 litres (37,000 gallons) of fuel will be allowed in every 48 hours, of which 20,000 litres will be earmarked for generators to restore the phone network, a US official said. Communications have been down for two days after fuel ran out, and a first consignment of about 17,000 litres was earmarked for telecommunications company Paltel. The communications blackout hampered aid deliveries, UNRWA said.\n18 Nov 2023 03.52 CET Israeli attack in Khan Yunis kills 26 – Palestinian report About 26 Palestinians, mostly children, were killed in an Israeli bombardment of the city of Khan Yunis in southern Gaza early on Saturday, Reuters reports the Palestinian news agency Wafa as saying.\n18 Nov 2023 03.26 CET A group of pro-Palestinian protesters forced their way into a building on a University of Michigan campus in the US, police said. Video posted on social media showed protesters on Friday pushing past police into an administration building that houses offices for the school president, Associated Press reports. An estimated 200 people then entered the building, university deputy police chief Melissa Overton said. Once inside, protesters chanted, called for the university to divest from Israel and waved Palestinian flags, as seen on the video. About six police agencies, including state police, assisted campus officers. There were no reports of injuries. Officers began removing protesters from the building on the Ann Arbor campus on Friday evening, police said.\n18 Nov 2023 02.51 CET A top United Nations official has renewed calls for a “humanitarian ceasefire” to allow aid to reach the 2.2 million people trapped in the war between Israel and Hamas, saying: “We are not asking for the moon.” “Call it what you will, but the requirement – from a humanitarian point of view – is simple: stop the fighting to allow civilians to move safely,” the UN humanitarian chief, Martin Griffiths, said in an address to the UN general assembly on Friday. Agence France-Presse reports that Griffiths also said: We are not asking for the moon. We are asking for the basic measures required to meet the essential needs of the civilian population and stem the course of this crisis. As well, Griffiths called for the release of all hostages held in Gaza without condition. View image in fullscreen Martin Griffiths at a media call at the UN in Geneva earlier this week. Photograph: Jean-Guy Python/AFP/Getty Images About 240 were taken hostage and 1,200 people killed in Israel when Hamas militants carried out a cross-border attack on 7 October, Israeli officials say. In Gaza, 12,000 people have been killed in Israel’s relentless response, officials in the Hamas-run territory say. Griffiths pleaded: Give the people of Gaza a breather from the terrible, terrible things that have been put on them these last few weeks.\nUpdated at 03.05 CET\n18 Nov 2023 02.23 CET US calls for more fuel to be allowed into Gaza The White House has said fuel should be allowed into the Gaza Strip “on a regular basis and in larger quantities” after Israel agreed to allow in two tanker trucks’ worth a day. Israel’s national security adviser, Tzachi Hanegbi, said on Friday that Israel’s war cabinet had agreed to allow the “very minimal” amount of fuel to enter for Gaza’s communications system and water and sewage services. The White House said later on X (formerly Twitter) that it was “glad Israel agreed to fuel deliveries to Gaza at our strong request”. We believe these deliveries should continue on a regular basis and in larger quantities. We are glad Israel agreed to fuel deliveries to Gaza at our strong request. We believe these deliveries should continue on a regular basis and in larger quantities. — The White House (@WhiteHouse) November 17, 2023 The White House also said: The US is working closely with Israel and our partners in the region to ensure the continued delivery of fuel so lifesaving humanitarian aid can be delivered and essential services in Gaza can be restored. Hanegbi had said the aim of allowing in the two trucks’ worth of fuel was to prevent the spread of disease in Gaza without disrupting Israel’s ability to continue its war against Hamas. Hanegbi said the fuel amounted to roughly 2-4% of the normal quantities of fuel that entered Gaza before the war erupted on 7 October.\nUpdated at 03.02 CET\n18 Nov 2023 01.52 CET Israel has issued a fresh warning to Palestinians in the southern city of Khan Younis to relocate west out of the line of fire and closer to humanitarian aid, Reuters reports. The warning in the latest indication that the Israeli military plans to attack Hamas in southern Gaza after subduing the north. Mark Regev, an aide to Israeli prime minister Benjamin Netanyahu, told MSNBC on Friday: We’re asking people to relocate. I know it’s not easy for many of them, but we don’t want to see civilians caught up in the crossfire. Such a move could compel hundreds of thousands of Palestinians who fled south from the Israeli assault on Gaza City to relocate again, along with residents of the southern city of Khan Younis, worsening a dire humanitarian crisis. View image in fullscreen Palestinians near the site of an Israeli strike on a house in Khan Younis on Friday. Photograph: Ibraheem Abu Mustafa/Reuters Khan Younis has a population of more than 400,000. Israel dropped leaflets over eastern areas of Khan Younis overnight on Thursday telling people to evacuate to shelters, suggesting military operations there were imminent.\nUpdated at 01.55 CET\n18 Nov 2023 01.29 CET There’s more in on the blast at a refugee camp in Nablus on the West Bank: witnesses have told Agence France-Presse that the strike appeared to have come from a drone. There was no immediate confirmation. At least five Palestinians were killed in the blast at a building in the camp, the Palestinian Red Crescent ambulance service has said. The camp’s administration said an aerial strike targeted the local headquarters of the Palestinian group Fatah in the camp. The Israeli military said it was checking on the reports. About 24,000 people live in the Balata refugee camp, in the northern West Bank, and several Palestinian armed groups operate inside, AFP reports. The strike comes a day after the Israeli army said it had killed at least seven militants in two separate confrontations in the West Bank. This is Adam Fulton taking over the live blog. We’ll keep bringing you all the latest developments as they unfold\nUpdated at 01.37 CET", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli forces ‘determined to advance’, says military - as it happened", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/live/2023/nov/17/israel-hamas-war-live-updates-gaza-starvation-idf-raid-jenin-refugee-camp-palestine-ceasefire-calls"}