{"authors": ["Alan Shields"], "date_download": "2024-02-05 15:37:31", "date_modify": "None", "date_publish": "2023-11-18 17:11:13", "description": "Ukraine is carrying out lightning fast raids on Russian troops using jet skis and speedboats.", "filename": "https%3A%2F%2Fmetro.co.uk%2F2023%2F11%2F18%2Fukraine-uses-jet-skis-strike-back-russia-19843537%2F.json", "image_url": "https://metro.co.uk/wp-content/uploads/2023/11/SEC_180744156-0f4b_1700327485.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "language": "en", "localpath": null, "maintext": "Ukrainian soldiers are using recreational watercraft to mount hit-and-run raids (Picture: EAST2WEST NEWS)\nMachine guns, frogmen and jet skis – Ukraine appears to be basing its latest offensive in the war against Russia on scenes straight out of an action film.\nSoldiers have been seen using the high-speed recreational watercraft to carry out lightning-fast attacks as they attempt to hold onto occupied territory.\nAnd Ukraine has said its special forces will continue to use jet-skis and speedboats to attempt to weaken Vladimir Putin’s control of invaded Crimea.\nKyiv’s GUR military intelligence produced the footage showing the ‘preparation and implementation’ of incursions to the annexed peninsula.\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\nThese were ‘carried out by the Stugna and Brotherhood soldiers of the Timur special unit of the Main Intelligence Directorate of the Ministry of Defense of Ukraine’, and demonstrated ‘courage and composure during combat missions’.\nMeanwhile, Ukrainian troops are working to push back Russian forces positioned on the east bank of the Dnieper River, the military said.\nIt comes a day after Kyiv claimed to have secured multiple bridgeheads on that side of the river that divides the country’s partially occupied Kherson region.\nA masked soldier prepares to carry out another attack from the water (Picture: EAST2WEST NEWS)\nThe General Staff of Ukraine’s armed forces said its troops there had repelled 12 attacks by the Russian army between Friday and Saturday.\nThe Ukrainians now are trying to ‘push back Russian army units as far as possible in order to make life easier for the (western) bank of the Kherson region, so that they get shelled less’, said Natalia Humeniuk, spokesperson for Ukraine’s Southern Operational Command.\nIn response, the Russian military used ‘tactical aviation’ – including Iranian-made Shahed exploding drones, to try to pin down Ukraine’s troops, Ms Humeniuk said.\nThe wide river is a natural dividing line along the southern battlefront.\nSince withdrawing from the city of Kherson and retreating across the Dnieper a year ago, Moscow’s forces have regularly shelled communities on the Ukrainian-held side of the river to prevent Kyiv’s soldiers from advancing toward Russia-annexed Crimea.\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\nFor more stories like this, check our news page.", "source_domain": "metro.co.uk", "text": null, "title": "Ukraine uses jet skis to strike back at Russia", "title_page": null, "title_rss": null, "url": "https://metro.co.uk/2023/11/18/ukraine-uses-jet-skis-strike-back-russia-19843537/"}