{"authors": ["Emma Graham-Harrison"], "date_download": "2024-02-05 15:37:32", "date_modify": "None", "date_publish": "2023-11-18 19:41:44", "description": "Fears mount for Gaza refugees as nowhere is deemed safe for civilians in effort to destroy Hamas", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2023%2Fnov%2F18%2Fisraeli-airstrikes-kill-80-in-palestinian-refugee-camp.json", "image_url": "https://i.guim.co.uk/img/media/376e8db8b8c2431faecd3da8a92baa1904a12a09/0_104_4339_2604/master/4339.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=973d05f31cfaff7b34891486ede69805", "language": "en", "localpath": null, "maintext": "Airstrikes on crowded UN shelters in north Gaza’s Jabalia refugee camp killed more than 80 people on Saturday, as Israeli plans to expand operations into south Gaza deepened fears for hundreds of thousands of civilians who have sought refuge there.\nUnderlining the reminder that there is nowhere safe for Gaza’s civilians, an airstrike outside the southern town of Khan Younis killed at least 26 people in the early hours of Saturday morning.\nNorth Gaza’s biggest hospital, al-Shifa, emptied of all but 120 of the most vulnerable patients and five doctors to care for them. As bombs continued to fall, the area had only basic medical resources for new victims.\nAt least 50 people were killed in a dawn attack on a UN-run school in the Jabalia camp, and a strike on another building there killed 32 members of a single family – 19 of them children – officials from the Hamas-run health ministry told AFP.\nMore than 20 bodies lined up and wrapped in bloodstained sheets were shown in photographs taken outside the Indonesian hospital. UN officials condemned the deaths.\n“Shelters are a place for safety. Schools are a place for learning. Tragic news of the children, women and men killed while sheltering at al-Fakhouri school in northern Gaza,” UN humanitarian chief Martin Griffiths said on X. “Civilians cannot and should not have to bear this any longer.”\nThe Israeli military, which had warned Jabalia residents to leave in a social media post in Arabic, declined to comment immediately when asked about the strikes.\nFor weeks, Israel has urged civilians in and around Gaza City to head south to protect themselves, and large numbers complied. Last week, for the first time the Israeli military urged people to leave areas in the south, around Khan Younis town, where residents include many recently displaced from the north.\nA column of medics, patients and refugees trudged out of al-Shifa hospital, the biggest in Gaza, where Israeli troops spent a fourth day searching for evidence of an underground Hamas command node.\nHamas authorities claimed Israel’s military ordered everyone to leave the hospital. A spokesman for the Israeli Defense Forces (IDF) said they facilitated an evacuation requested by medical staff.\nThose walking south under the tense gaze of Israeli troops, through a hellscape of tangled rubble that had been buildings two months ago, along roads shattered by weapons and churned to mud by tanks, had little hope of rest when they reached the south.\nView image in fullscreen Patients and internally displaced people at Al-Shifa hospital in Gaza City earlier this week. Photograph: Ismail Zanoun/AFP/Getty Images\nShelters are crammed, food and water supplies are so low the UN has warned that Palestinians face the “immediate possibility” of starvation, infectious diseases are spreading, and the war there is expected to intensify in coming days.\nWhen Israeli planes hit northern Gaza at the start of the war, and troops prepared to move in, Israeli messages urged civilians to move south of the Wadi Gaza wetlands for their own safety.\nDespite risks on the journey, and severe overcrowding in shelters and private homes, hundreds of thousands followed those orders. About 1.6 million people are displaced, more than two-thirds of the population, the UN said.\nThey found only relative safety. Forty days into the war, 3,676 people had been killed in southern areas that Israel had declared safer. They accounted for a third of all Palestinian deaths in the conflict, according to a UN map using figures from Gaza’s health authorities. Now many of those people have been told to move again, and cram into an even smaller area along the coast, around the town of Mawasi.\n“They asked us, the citizens of Gaza, to go to the south. We went to the south. Now they are asking us to leave. Where do we go?” Atya Abu Jab told Reuters, outside the tent where his family who fled Gaza City live, one of a long row of makeshift homes.\nEarly on Saturday morning, bombs hit a multi-storey block in Hamad City, a middle-class housing development in Khan Younis, killing 26 people and injuring 23 more. A few miles north, six Palestinians were killed in an attack on a house in Deir Al-Balah town.\nEyad al-Zaeem lost his aunt, her children and grandchildren, who he said had left north Gaza on Israeli orders. “All of them were martyred. They had nothing to do with the (Hamas) resistance,” Zaeem said outside the mortuary at Nasser Hospital.\nIsrael’s chief military spokesman, R Adm Daniel Hagari, said on Friday that its troops would attack “wherever Hamas exists, including in the south of the strip”. He said: “We are determined to advance our operation.”\nBenjamin Netanyahu admitted in an interview last week that war was taking a heavy toll on civilians, but blamed Hamas for the deaths. “That’s what we’re trying to do: minimal civilian casualties. But unfortunately, we’re not successful,” he told CBS.\nIt is not clear where civilians might go to escape fighting if it intensifies in the south. Gaza was already densely populated before fighting began, triggered on 7 October by Hamas attacks on Israel that killed 1,200 people, most of them civilians.\nThe territory of 365 square kilometres was home to 2.3 million. Now the north has largely emptied, and most people are in the south, in private homes or overcrowded UN shelters.\nAid agencies say they are unable to provide food, water and medical care to people there because of shortages of fuel, communications problems and blocks on letting humanitarian supplies into Gaza.\nThose problems would be exacerbated if civilians are told to retreat into a smaller area, pushing up the indirect toll of the war. Security officials in Israel have been open that they expect civilian deaths, already at levels unprecedented for decades, to rise as fighting shifts to crowded areas.\n“There will probably be more civilian casualties,” Giora Eiland, a former head of Israel’s National Security Council, told Reuters, adding: “It is not going to deter us or prevent us from moving forward.”\nOn Friday, the toll from Hamas-run health authorities was updated to more than 12,000 dead, including 5,000 children. The UN deems those figures credible, based on verification processes in past conflicts on Gaza.\nSome in Gaza and across the region fear Israel aims to push Palestinians out of their devastated territory, seeking a new Nakba, or catastrophe, the Arabic term for the forcible expulsion of about 750,000 Palestinians from what was previously the former British mandate-controlled Palestine during the creation of Israel in 1948.\nA week ago Avi Dichter, a member of the Israeli security cabinet member and agriculture minister, said in a television interview: “We are now rolling out the Gaza Nakba.” Netanyahu, warned cabinet ministers the next day to choose their words carefully.\nJordan’s foreign minister, Ayman Safadi, was among regional leaders who said at a security summit in Bahrain Israel should not try to push Palestinians out of the territory, saying Jordan would do “whatever it takes to stop” their displacement.“We will never allow that to happen; in addition to it being a war crime, it would be a direct threat to our national security.”", "source_domain": "www.theguardian.com", "text": null, "title": "Israeli airstrikes kill 80 in Palestinian refugee camp", "title_page": null, "title_rss": null, "url": "https://www.theguardian.com/world/2023/nov/18/israeli-airstrikes-kill-80-in-palestinian-refugee-camp"}