{"authors": [], "date_download": "2024-02-05 15:37:34", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Les élections en République démocratique du Congo sont prévues le 20 décembre 2023. La commission électorale du p", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274034279%2Felections-en-rdc--lheritage-de-la-famille-kabila-pegravese-sur-le-scrutin.json", "image_url": "https://cdn.bignewsnetwork.com/cvr1700073591.jpg", "language": "en", "localpath": null, "maintext": "Les elections en Republique democratique du Congo sont prevues le 20 decembre 2023. La commission electorale du pays a annonce que le president Felix Tshisekedi se representerait aux cotes de 23 autres candidats. Parmi eux figurent le laureat du prix Nobel de la paix Denis Mukwege et le candidat arrive deuxième à l'election presidentielle de 2018, Martin Fayulu. Les tribunaux confirmeront la liste finale des candidats. Une personnalite politique cle n'a pas encore fait connaître ses intentions : Joseph Kabila. Il a ete president pendant 18 ans, jusqu'à ce que Tshisekedi prenne le relais en 2019. La Constitution de la RDC prevoit deux mandats de cinq ans, mais il est reste au pouvoir en retardant les elections. Il exerce une influence considerable sur les plans politique, militaire et economique. Jonathan R. Beloff est un politologue qui etudie la politique et la securite de la Republique democratique du Congo, du Rwanda, du Burundi et de l'Ouganda. Nous lui avons pose quelques questions.\nQuelle est la place de la famille Kabila dans la politique de la RDC ?\nJoseph Kabila a ete le quatrième president du pays. Il a pris ses fonctions après l'assassinat de son père, Laurent Kabila, qui a ete tue par son garde du corps en 2001. Joseph a ensuite remporte les elections presidentielles de 2006 et de 2011.\nL'election surprise de Felix Tshisekedi en 2018, qui a pris le pouvoir en janvier 2019, a interrompu plus de deux decennies de règne de la famille Kabila. À l'epoque, la Constitution interdisait à Joseph de se presenter à l'election presidentielle - et il avait dejà depasse son deuxième mandat de plus de trois ans.\nLa famille Kabila est devenue une puissance politique après avoir pris le controle du pays en 1996. Avec l'aide d'autres pays, tels que les voisins ougandais, angolais et rwandais, l'Alliance des forces democratiques pour la liberation du Congo, sous la direction de Laurent Kabila, a renverse le dictateur zaïrois de longue date, Mobutu Sese Seko. C'etait pendant la première guerre du Congo (1996-1997).\nLe mandat de Laurent a ete marque par l'inefficacite et la corruption. En moins de deux ans, il a renvoye son ministre de la Defense, le Rwandais James Kabarebe, et commence à armer les forces anti-rwandaises. Ces forces comprenaient des acteurs ayant participe au genocide de 1994 contre les Tutsi au Rwanda.\nLaurent pretendait que son gouvernement soutenait ces forces uniquement après que la tentative du Rwanda de renverser son regime.\nLa sanglante deuxième guerre du Congo (1998 - 2003) a fait au moins deux millions de morts, dont la plupart etaient dus à la maladie et à l'extrême pauvrete plutot qu'à la guerre elle-même. Bien que la tentative d'invasion de la capitale Kinshasa par Kabarebe en 1998 ait echoue, la vaste RDC a ete divisee en sphères d'influence pour differentes nations et leurs groupes rebelles alignes. Ce statu quo n'a commence à se briser qu'après l'assassinat de Laurent, qui a conduit à l'ascension de son fils Joseph.\nJoseph a appris la strategie militaire, les tactiques et la politique auprès de Kabarebe. Les deux hommes ont travaille ensemble après la deuxième guerre du Congo pour debusquer de nombreuses forces anti-rwandaises. Il s'agissait notamment des Forces democratiques pour la liberation du Rwanda. Ils ont egalement fait campagne ensemble lors de l'election presidentielle de 2011, que Joseph a remportee.\nJoseph s'est d'abord presente comme un reformateur qui mettrait fin à la deuxième guerre du Congo et poursuivrait des politiques visant à stimuler le developpement politique et economique. Cependant, l'instabilite dans l'est du Congo a persiste sous son règne, avec des accusations de corruption massive qui a sape le developpement de la nation.\nQuelle est l'influence de Joseph Kabila aujourd'hui ?\nJoseph Kabila est toujours fortement present au sein des institutions politiques, economiques et militaires du Congo. Il dispose de reseaux solides developpes au cours de 18 ans au pouvoir. Il pourrait utiliser cette influence pour faire basculer le vote en faveur de l'un ou l'autre des candidats.\nSon influence decoule des alliances commerciales et politiques favorables qu'il a creees lorsqu'il etait president. Comme Mobutu, Kabila a utilise ses vastes ressources financières pour s'assurer des relations favorables avec des chefs d'entreprise congolais et etrangers. Une fuite de documents en 2021 a revele que Kabila avait recu plus de 138 millions de dollars US provenant de la corruption et de pots-de-vin. Il y avait des allegations selon lesquelles, l'ancien president avait dans un premier temps convaincu Tshisekedi d'accepter un accord de partage du pouvoir. Selon cet accord, Tshisekedi serait president, tandis que Kabila controlerait les decisions politiques en coulisses. La quasi nomination de Ronsard Malonda au poste de president de l'organe electoral illustre l'influence politique de Kabila. Malonda a occupe des postes à responsabilite lors des elections de 2006, 2011 et 2018. Il a ete accuse d'avoir truque les resultats en faveur de Kabila.\nCes accusations ont profite à la campagne electorale de Tshisekedi. Il s'est presente comme un candidat qui n'est pas lie à la corruption en RDC.\nSi Kabila decide de faire campagne, la dynamique politique au sein d'une grande partie de la societe civile, de l'armee et de l'economie congolaise sera divisee. Les ministres et les fonctionnaires du gouvernement seront contraints de choisir de soutenir soit le president sortant, soit le candidat prefere de Kabila.\nQu'est-ce que Tshisekedi etait cense changer après avoir mis Joseph Kabila en deroute ?\nIl y avait au depart l'espoir que le gouvernement de Tshisekedi favoriserait la paix dans l'est du Congo, etablirait une plus grande unite nationale et aiderait à resoudre les problèmes economiques du pays après des decennies de corruption et de conflit. Cependant, ces problèmes ont persiste.\nInitialement, Amnesty International a salue Tshisekedi pour avoir gracie des prisonniers politiques et permis une plus grande ouverture de l'espace public pour les critiques du gouvernement congolais.\nIl a egalement entame des enquêtes sur les transactions minières passees sous les gouvernements de Kabila. En tant que president de l'Union africaine de 2021 à 2022, il a plaide en faveur d'une plus grande attention à la pandemie de COVID-19 et a promu la zone de libre-echange continentale africaine.\nMalgre les tentatives initiales de promouvoir des relations plus significatives avec le Rwanda, les relations se sont deteriorees en 2022. Cela s'est produit après que le gouvernement congolais a accuse le Rwanda de soutenir les rebelles du M23.\nLe Rwanda a nie ces allegations. Il a egalement accuse le gouvernement de Tshisekedi d'être hostile à la population tutsi congolaise - les Banyamulenge - qui sont historiquement lies aux Rwandais.\nLe departement d'Etat americain a exprime son inquietude quant à la rhetorique anti-Banyamulenge de Tshisekedi, ainsi qu'au caractère democratique et transparent des prochaines elections.\nLa strategie de campagne de Tshisekedi semble se concentrer sur la promotion de la securite dans l'est de la RDC, non seulement en battant le M23, mais aussi en attaquant le Rwanda pour son ingerence dans les affaires congolaises. Cette approche securitaire de la question des Banyamulenge et du Rwanda - la manipulation politique pour attiser la peur du public - a contribue à desamorcer les critiques internes du regime de Tshisekedi.\nLa tenue des elections est autre source de preoccupation. Certains craignent que Tshisekedi retarde ou annule les elections en invoquant des problèmes de securite. Si cela se produit, cela pourrait être percu par les partenaires nationaux et internationaux comme une ingerence politique du regime au pouvoir.\nAuthor: Jonathan Beloff - Postdoctoral Research Associate, King's College London", "source_domain": "www.britainnews.net", "text": null, "title": "Elections en RDC : l'heritage de la famille Kabila pèse sur le scrutin", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274034279/elections-en-rdc--lheritage-de-la-famille-kabila-pegravese-sur-le-scrutin"}