{"authors": [], "date_download": "2024-02-05 15:16:11", "date_modify": "None", "date_publish": "2024-01-24 16:44:54", "description": "Chemical attack on pro-Palestinian protesters at Columbia is a possible hate crime, university says", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Fcrime%2Fcolumbia-palestine-chemical-attack-b2484074.html.json", "image_url": "https://static.independent.co.uk/2023/11/16/16/Israel_Palestinians_Protests_Explainer_57916.jpg?quality=75&width=1200&auto=webp", "language": "en", "localpath": null, "maintext": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\nAn alleged “chemical-weapon” attack on more than a dozen pro-Palestinian protesters during a demonstration at Columbia University against the Israeli-Hamas war is being investigated as a possible hate crime, the university says.\nMembers of the Students for Justice in Palestine group described how two men approached them in an aggressive manner and sprayed their faces and clothes, leaving them with burning eyes, headaches and nausea at the 19 January protest in New York.\nThe NYPD is leading an investigation into the incident alongside federal authorities into “what appear to have been serious crimes, possibly hate crimes”, Columbia University interim provost Dennis Mitchell said in a statement.\nStudents injured in the attack told the Columbia Spectator the chemical was “skunk spray”, a hazardous liquid that is used by the Israeli Defense Forces (IDF) for crowd control in the West Bank.\nDays after the incident, students injured in the incident say they still feel nauseous and are unable to remove the “putrid” smell from their clothing.\n“Almost 96 hours since I was sprayed with skunk on campus: skin is still burning. very dizzy and nauseous,” Layla Saliba, 24, a graduate student at Columbia’s School of Social Work wrote in a post on X.\n“Skunk water sticks to any fabric and cannot be washed out,” she added.\nMs Saliba did not immediately respond to The Independent’s request for comment. She told the Columbia Spectator thatshe had sought medical attention at an urgent care clinic, where doctors diagnosed her with with “exposure to a harmful chemical”.\nstill gathering evidence, does anyone have info about these individuals? I know the campus z*onists & I’ve never seen them before.\nThey didn’t want to be photographed but kept confronting ppl. were wearing fake keffiyehs but took them off. Smell came from behind guy in orange. https://t.co/wHcODyQHiY pic.twitter.com/Lz2sX37IrI — Layla 🪬 (@itslaylas) January 20, 2024\nShe has since been trying to identify the two men who allegedly sprayed the chemical agent.\nA protest group known as Jews for Ceasefire were also targeted in the incident, according to witnesses.\nColumbia University interim provost Dennis Mitchell said in a statement the incident was “deeply troubling” and the alleged perpetrators had been identified and banned from campus.\n“We continue to urge those who have relevant information — including pictures, videos, and clothing — to share that with the Department of Public Safety and NYPD. We are grateful to the members of our community who have done so already,” he wrote.\n“We condemn in the strongest possible terms any threats or acts of violence directed toward anyone in our community. The University is committed to taking urgent action,” Mr Mitchell wrote.\nThe protest had not been sanctioned by the university, which revised its event policies in November in the wake of campus protests sparked by the Israel-Hamas conflict.\nThe university suspended Students for Justice in Palestine and the local chapter of the Jewish Voice for Peace group on 10 November for repeatedly violating the policies.\nIn a joint statement, the two student groups said eight students had been hospitalised and dozens more had sought medical attention.\nPalestinian supporters gather for a protest at Columbia University, on 12 October 2023, (file photo) (AP)\nThe groups also called on Columbia to do more to protect pro-Palestinian voices on campus.\n“This hateful assault came after months of Columbia viciously targeting and repressing Palestinian student advocacy, contributing to a hostile environment that dangerously emboldens violent attacks like these during a time when violent hate crimes against Palestinian, Arab and Muslim Americans are surging,” the statement read.\n“The administration must repair the damage it has done.”\nIn a statement, the NYPD said a 24-year-old woman who attended the demonstration filed an assault complaint on Saturday after she “began to feel nauseated and experienced a burning sensation in her eyes”.\nFive more reports of assault were filed on Sunday, the NYPD said. No arrests have been made.\nAccording to a BBC report, skunk spray has been used by the IDF since 2008 against Palestinian protesters. The chemical has been described as “worse than raw sewage”.\nMistral Security, a company that supplies skunk spray in the United States for crowd control, describes it as a “water based, 100 per cent non-lethal vile smelling liquid”.\nAnti-Muslim and anti-semitic hate crimes have surged across the United States since the 7 October terror attacks, when Hamas militants killed more than 1,200 people and took more than 250 hostage in Israel.\nSince then, more than 25,000 Palestinians have been killed by the IDF, according to the Gaza Health Ministry.", "source_domain": "www.independent.co.uk", "text": null, "title": "‘Chemical attack’ on pro-Palestinian protesters at Columbia possible hate crime, university says", "title_page": null, "title_rss": null, "url": "https://www.independent.co.uk/news/world/americas/crime/columbia-palestine-chemical-attack-b2484074.html"}