{"authors": [], "date_download": "2024-02-05 15:37:41", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "The Russian Defense Ministry has released video footage of a Lancet drone attack on a Ukrainian FH70 howitzer Read Full Article at RT.com", "filename": "https%3A%2F%2Fwww.britainnews.net%2Fnews%2F274035198%2Frussian-kamikaze-drone-obliterates-british-howitzer-video.json", "image_url": "https://cdn.bignewsnetwork.com/ZDFkNThjYmYtYjl.jpg", "language": "en", "localpath": null, "maintext": "Marines used a Lancet drone to strike a woodland-covered FH70 artillery piece used by Ukrainian troops\nA Russian marine unit fighting on the frontline of the Ukraine conflict has used a Lancet loitering munition to destroy a Kiev-operated, British-designed FH70 howitzer. The Russian Defense Ministry identified the targeted gun as it shared footage of the strike on Thursday.\nThe attack was reportedly launched by the 336th Guards Naval Infantry Brigade, part of the Baltic Fleet of the Russian Navy. The clip included footage from the drone's on-board camera and from another aircraft, presumably a reconnaissance drone, which filmed the engagement from above. The hit appeared to detonate artillery shells stored at the site hidden inside a windbreak.\nThe video was circulating on Russian-military-themed social media for several days before the ministry vouched for it. Some outlets suggested that the Lancet was of a newer model, equipped with a night-vision sensor that older variants lacked.\nWestern backers of Ukraine have been sending FH70 155mm towed howitzers since last year. Estonia had pledged its entire stockpile of 24 pieces, while Italy provided an unspecified number of guns, estimated at ten by some defense analysts.\nLancet drones were reportedly one of the primary threats for Ukrainian heavy weapons on the frontline. The Kalashnikov-produced system has a distinctive shape thanks to its two sets of X-wings and comes in two principal versions, with payloads weighing one and three kilograms respectively. Designer Zala Aero is said to be constantly improving its products as it gets feedback from the conflict zone.\nREAD MORE: Russian drone takes out Leopard tank (VIDEO) - RIA\nAleksandr Mikheev, the head of the Russian arms-export agency Rosoboronexport, has claimed a high interest in the Lancet drones from potential foreign buyers.\n\"However, it is not supplied to foreign markets because the Russian armed forces have a high demand for it and there is no export permission for it yet,\" he told TASS on Wednesday on the sidelines of the Dubai Airshow 2023 military expo.", "source_domain": "www.britainnews.net", "text": null, "title": "Russian kamikaze drone obliterates British howitzer (VIDEO)", "title_page": null, "title_rss": null, "url": "https://www.britainnews.net/news/274035198/russian-kamikaze-drone-obliterates-british-howitzer-video"}