{"authors": ["Bill Mcloughlin"], "date_download": "2024-02-05 15:37:43", "date_modify": "None", "date_publish": "2023-11-18 12:26:50", "description": "The evacuation came as Israeli airstrikes targeted southern Gaza", "filename": "https%3A%2F%2Fwww.standard.co.uk%2Fnews%2Fworld%2Fisrael-gaza-al-shifa-hospital-hamas-war-middle-east-news-b1121228.html.json", "image_url": "https://static.standard.co.uk/2023/11/18/12/40/SEI180716524.jpg?width=1200&auto=webp&quality=75", "language": "en", "localpath": null, "maintext": "Earlier in the week, the Israeli defense minister had said troops had completed operations in the west of Gaza City. Attacks also continued in the south of the Gaza Strip, with an Israeli airstrike hitting a building on the outskirts of the town of Khan Younis, killing at least 26 Palestinians, according to a doctor at the hospital where the bodies were taken. Israel's military has been searching Shifa Hospital for traces of a Hamas command center that it alleges was located under the building — a claim Hamas and the hospital staff deny - and urging the several thousand people still there to leave. On Saturday, the military said it had been asked by the hospital's director to help those who would like to leave do so by a secure route. The military said it did not order any evacuation, and that medical personnel were being allowed to remain in the hospital to support patients who cannot be moved. But Medhat Abbas, a spokesman for the Health Ministry in Hamas-controlled Gaza, said the military had ordered the facility cleared, giving the hospital an hour to get people out. After it appeared the evacuation was mostly complete, Dr. Ahmed Mokhallalati, a Shifa physician, said on social media that there were some 120 patients remaining who were unable to leave, including some in intensive care and premature babies, and that he and five other doctors were staying behind to care for them. It was not immediately clear where those who left the hospital had gone, with 25 of Gaza's hospitals non-functional due to lack of fuel, damage and other problems and the other 11 only partially operational, according to the World Health Operation. Israel has said hospitals in northern Gaza were a key target of its ground offensive aimed at crushing Hamas, claiming they were used as militant command centers and weapons depots, which both Hamas and medical staff deny. Israeli troops have encircled or entered several hospitals, while others stopped functioning because of dwindling supplies and loss of electricity. The war, now in its seventh week, was triggered by Hamas' October 7 attack in southern Israel, in which militants killed about 1,200 people, mostly civilians, and abducted some 240 men, women and children. Fifty-two soldiers have been killed since the Israeli offensive began. More than 11,400 Palestinians have been killed in the war, two-thirds of them women and minors, according to Palestinian health authorities.", "source_domain": "www.standard.co.uk", "text": null, "title": "Gaza's largest hospital evacuated as Israeli airstrikes move south", "title_page": null, "title_rss": null, "url": "https://www.standard.co.uk/news/world/israel-gaza-al-shifa-hospital-hamas-war-middle-east-news-b1121228.html"}