{"authors": [], "date_download": "2024-02-05 15:37:44", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "UNITED NATIONS - Latest developments: Israel Defense Forces raid Shifa Hospital in Gaza early Wednesday in hunt for Hamas militants. Palestinian Autho", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274034755%2Fisrael-rejects-un-call-for-extended-humanitarian-pauses-for-gaza.json", "image_url": "https://cdn.bignewsnetwork.com/voa1700114786.jpg", "language": "en", "localpath": null, "maintext": "UNITED NATIONS - Latest developments:\nIsrael Defense Forces raid Shifa Hospital in Gaza early Wednesday in hunt for Hamas militants.\nPalestinian Authority health minister says Israeli raid on Shifa \"new crime against humanity.\"\nNational Security Council spokesperson John Kirby told reporters Hamas and Palestinian Islamic Jihad members operate a command-and-control node from the hospital and use tunnels underneath to support their military operations and hold hostages.\nU.N. Secretary-General Antonio Guterres said Tuesday that he is \"deeply disturbed by the horrible situation and dramatic loss of life in several hospitals in Gaza.'\nU.S. President Joe Biden says he believes Hamas' hostages will be released but gives no timetable.\nThe latest death toll: 1,200 in Israel during the Oct. 7 Hamas attack, and according to the Hamas-run Health Ministry, 11,000 in Gaza, overwhelmingly women and children.\nThe U.N. Security Council overcame weeks of inaction and bickering Wednesday to issue a call for 'extended humanitarian pauses' in the Gaza Strip, especially for the protection of children, only to have Israel immediately reject the measure.\n'This draft resolution we have in front of us today seeks to offer hope in this dark hour,' said Malta's Ambassador Vanessa Frazier, who led the negotiations and drafted the text. 'It aims to ensure a respite from the current nightmare in Gaza and give hope to the families of all victims. It focuses in particular on the plight of children trapped in the warring enclave and those held hostage.'\nThe resolution calls for 'extended humanitarian pauses and corridors\" in Gaza \"for a sufficient number of days' to let aid in, repair damage to critical infrastructure such as hospitals, water wells and bakeries, and to enable medical evacuations, especially of children. It also calls for the 'immediate and unconditional release of all hostages' held by Hamas and other groups - particularly children.\nCouncil resolutions are legally binding, but parties named in them frequently ignore them, with little consequence.\nIsrael's envoy told the council that his government does not need a resolution to remind it to adhere to international law and that Hamas would not 'even bother reading it.'\n'Hence, this resolution does nothing to contribute to the situation on the ground,' said Israel's deputy envoy Brett Jonathan Miller. 'Bringing our hostages home is Israel's top priority, and seeing that Security Council resolutions hold no sway with terrorists, Israel will continue to do whatever it takes to accomplish this goal.'\nPalestinians displaced by the Israeli bombardment of the Gaza Strip prepare bread in a UNDP-provided tent camp in Khan Younis, Nov.15, 2023.\nCivilians die as council bickers\nThis was the council's fifth attempt at adopting a resolution calling for some form of a cease-fire in the 40-day old war. The previous attempts ended with vetoes and in geopolitical acrimony.\nOn Oct. 27, the General Assembly stepped in and adopted its own resolution calling for a humanitarian truce. Proposed by Arab states, the resolution called for an immediate halt to the fighting for the safe provision of aid to Gaza and for the release of all civilians who are being held captive. But the assembly's resolutions are not legally binding, and Israel began its ground war as the vote was being tallied.\nOn Wednesday, 12 Security Council members voted in favor, while three permanent members abstained: Britain, Russia and the United States.\nThe United Arab Emirates represents the Arab regional bloc on the council. Ambassador Lana Nusseibeh said she believes the resolution can save lives.\n'However, I want to emphasize that the adoption of today's resolution only begins our response to this war and to this crisis,' she told her colleagues. 'Too much time has passed, too many people have been killed, and too much destruction has been wrought.'\nThe resolution is brief and stays mostly away from political elements. The text does not refer to Israel by name, and refers to Hamas only once, in connection to the approximately 240 hostages it and other militant groups are holding in Gaza.\n'Ultimately, the United States could not vote 'yes' on a text that did not condemn Hamas or reaffirm the right of all member states to protect their citizens from terrorist attacks,' U.S. Ambassador Linda Thomas-Greenfield said, explaining Washington's abstention. Britain's envoy echoed that stance. Hamas has been designated a terrorist organization the U.S., U.K, EU and others.\nRussia proposed an amendment to the draft adding language adopted in the General Assembly resolution calling 'for an immediate, durable and sustained humanitarian truce leading to a cessation of hostilities.' But that did not have enough council support to be included in Malta's draft, so Russia abstained.\nIn this image taken from a video released by the Israel Defense Forces on Nov. 14, 2023, an Israeli soldier holds a weapon in Gaza City.\nLast week, U.N. Secretary-General Antonio Guterres said Gaza is becoming 'a graveyard for children.'\nMore than 4,500 Palestinian children have been killed and almost 9,000 injured since Hamas' Oct. 7 terror attack inside Israel triggered the war. Scores more children are missing and believed to be among the dead under Gaza's rubble.\nAt least 31 children were killed in Israel during the terror attacks, and about 30 more are reported to be among the hostages abducted to Gaza, including a 3-year-old American child.\nThe head of the U.N. children's agency, UNICEF, visited Gaza on Wednesday.\n'I am here to do whatever I can to advocate for the protection of children,' Executive Director Catherine Russell said. 'I once again call on all parties to ensure that children are protected and assisted, as per international humanitarian law. Only the parties to the conflict can truly stop this horror.'", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "Israel Rejects UN Call for Extended Humanitarian Pauses for Gaza", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274034755/israel-rejects-un-call-for-extended-humanitarian-pauses-for-gaza"}