{"authors": ["James Reynolds"], "date_download": "2024-02-05 15:37:46", "date_modify": "None", "date_publish": "2023-11-18 09:01:42", "description": "Al-Shifa hospital has become the focus of the Israel-Hamas war, now in its seventh week, as Israel closes in on what it says is a façade for a Hamas stronghold - claims the hospital and Hamas deny.", "filename": "https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-12764893%2FHundreds-patients-evacuate-Al-Shifa-hospital-Gaza-foot-450-left-Israel-vows-advance-Hamas-exists.html%3Fns_mchannel%3Drss%26ns_campaign%3D1490%26ito%3D1490.json", "image_url": "https://i.dailymail.co.uk/1s/2023/11/18/09/77958977-0-image-a-12_1700298097297.jpg", "language": "en", "localpath": null, "maintext": "Hundreds of civilians and health workers fled Gaza's largest hospital on foot today as Israeli troops issued the order to evacuate over loudspeakers on Saturday.\nHealth officials in Gaza said 450 patients had been left behind at the al-Shifa hospital following repeat warnings the sick and wounded would not be able to escape.\nThe hospital has become the focus of the Israel-Hamas war, now entering its seventh week, as Israel closes in on what it says is a façade for a Hamas stronghold - claims the hospital and Hamas deny.\nThe order follows claims by Israel made on Wednesday that troops had found weapons in the hospital - evidence, they say, to support their claims.\nHospital director Mohammed Abu Salmiya said Israeli troops had told him to ensure the 'evacuation of patients, wounded, the displaced and medical staff' as they swept through the site.\nBut with the Gaza City devastated by weeks of constant bombardment, the only indication was for civilians to move 'towards the seafront'.\nHundreds of thousands of Palestinians have fled south since Israel's first evacuation order of the north of the Strip on October 13. But unable to pin down Hamas' leaders in Gaza City so far, Israel has now issued the order for residents in the south to flee too, vowing to advance 'wherever Hamas exists'.\nIsraeli soldiers inspect the al-Shifa hospital complex, amid their ground operation against Hamas, in Gaza City, November 15, 2023\nTents and shelters used by displaced Palestinians stand at the yard of Al Shifa hospital during the Israeli ground operation around the hospital, in Gaza City November 12, 2023\nIsrael claimed to have found a tunnel near the hospital which they say supports their claims the hospital is sat on top of a Hamas stronghold\nA makeshift operating theater area is seen inside al-Shifa hospital during Israel's ground operation around the hospital, in Gaza City November 12, 2023\nThe United Nations estimated 2,300 patients, staff and displaced Palestinians were sheltering at al-Shifa before Israeli troops moved in on Wednesday.\nThose left behind in the desperate rush to flee included premature babies, according to the Hamas-run health ministry.\nThe order to evacuate follows claims made by Israel on Wednesday that troops had found assault rifles and military equipment during raids into the facility.\nIt was a dramatic revelation after days spent encircling the facility since November 10.\nBut the Palestinian health ministry in Gaza has announced dozens of deaths as a result of power cuts casued by fuel shortages amid intense combat.\nHamas claimed on November 14 that 650 patients and between 5,000 and 7,000 civilians were trapped inside the hospital's grounds under heavy fire from Israeli snipers and drones.\nAshraf Al-Qidra, Gaza's health ministry spokesman, said: 'The occupation is still besieging the hospital and they are firing into the yards from time to time.'\nQidra said at the time there were about 100 bodies decomposing inside and no way to get them out.\nIsrael has denied its raids on al-Shifa amount to a siege, though the site has been effectively cut off from Gaza City for more than a week.\nIsrael has said for years that Hamas has used the hospital as a cover for their operations - claims Hamas and hospital staff have repeatedly denied.\nOfficials have also suggested that some of the 240 captives seized by Hamas since the October 7 attack might be held under the Gazan hospitals.\nOn November 14, the United States said its intelligence also supported claims Hamas used the hospital and tunnels beneath it as a 'command-and-control node'.\nSince then, Israel has provided what it says is evidence Hamas has been using the facility for military purposes.\nOn November 15, the Israel Defense Forces shared images of Kalashnikov-style assault rifles, tactical gear, a handgun, a knife and magazines.\nA day later, Israeli troops claimed they had found a tunnel shaft used by Hamas at the hospital - along with the bodies of two hostages held in a building close by.\nThe IDF released a video it said showed a tunnel entrance in an outdoor area of al-Shifa hospital, two days after Israeli troops entered its grounds.\nDuring the raid, Israel said its troops found the bodies of Yehudit Weiss, 64, and Israeli soldier Noa Marciano, 19 - from a building adjacent to the hospital.\nIsraeli Prime Minister Benjamin Netanyahu claimed there were 'strong indications' that hostages were held at the hospital but they were no longer there when the facility was raided.\n'We had strong indications that they were held in the Shifa Hospital, which is one of the reasons we entered the hospital,' he told CBS Evening News. 'If they were (there), they were taken out.'\nThe UN has nonetheless maintained its opposition to the raids, stressing that the protection of civilians must outweigh all other concerns.\n'I'm appalled by reports of military raids in al-Shifa hospital in Gaza,' UN humanitarian chief Martin Griffiths said on X, formerly Twitter.\n'The protection of newborns, patients, medical staff and all civilians must override all other concerns.'\nThe International Committee of the Red Cross said it was 'extremely concerned about the impact on sick and wounded people, medical staff and civilians'.\nUsing a hospital as a military base is a war crime. Once used as a military facility, a hospital may lose its the special protection afforded to it.\nThe discovery of small arms taken from wounded combatants would not exempt al-Shifa from its protections.\nIsrael must also take precautions not to involve civilians in the fighting, for instance by giving adequate notice to evacuate and making sure evacuation is possible.\nWeapons allegedly found inside the Al Shifa hospital during Israeli raids this week\nWeapons and equipment which Israel's army says it found at Al Shifa hospital complex in the Gaza Strip, as seen in a handout picture released by the IDF on November 15, 2023\nWeapons and equipment which Israel's army says it found at Al Shifa hospital complex in the Gaza Strip, as seen in a handout picture released by the IDF on November 15, 2023\nOn October 27, Israel said that the hospital was the 'focus' of Hamas' operations in the Strip.\nIsrael maintains that the site has 'several underground complexes' with a 'headquarters' from which leaders command forces and store heavy equipment.\nAccording to Israel, the underground hideout has several floors and space for several hundreds people.\nBut medical professionals working at the hospital say they have seen no evidence of it so far.\nThe IDF has notably only scoured a small part of the expansive compound so far, and the evacuation of the site is expected to take several days.\nThe process will be slowed by fears Hamas might have laid traps for raiding soldiers around the site - Israel sending in robots and dogs instead.\nIsrael will hope that cutting deeper into the facility will bring them closer to locating the masterminds behind the October 7 attack. But progress is steady as troops battle with the challenges of urban warfare.\nIn the north, Israel issued the order to evacuate on October 13, amid sustained airstrikes of the Strip designed to make the terrain easier before entering with troops.\nSome 1.5mn Gazans, of 2.3mn in the Strip, have been displaced from their homes since the conflict began. The Hamas government says that Israeli strikes have killed some 12,000 people, including thousands of women and children.\nBut Gazans living in the south have now also been given the order to flee as Israel scours the beleaguered Strip for Hamas' commanders.\nDaniel Hagari, spokesperson for the IDF, said in his regular Friday briefing: 'We are determined to advance our operation. It will happen wherever Hamas exists, including in the south of the strip.\n'It will happen at the time, place and conditions that are best for the military.'\nCivilians in parts of south-east Gaza have been told in leaflets dropped by Israeli aircraft to move into a 'safe zone' in the coastal town of Mawasi, covering just 5.4 sq miles.\nFleeing south into Egypt is not an option. Gaza's Rafah crossing to Egypt, the only exit not leading to Israel, is firmly shut to everyone except for foreigners or dual citizens and patients in dire need Gaza's hospitals shut down for lack of fuel.\nEgypt and other Arab states - and even many in Gaza - say Palestinians should not leave for fear of repeating the dispossession faced by hundreds of thousands who fled across the border never to return when Israel was created in 1948.\nAn Israeli tank takes position near the border with the Gaza Strip in Southern Israel on November 16, 2023\nSmoke billows following an Israeli strike on Khan Yunis in the southern strip on November 16\nA view of damaged buildings in Gaza,, amid the ongoing conflict between Israel and the Palestinian group Hamas, November 17, 2023\nPeople mourn as they collect the bodies of Palestinians killed in airstrikes on November 18, 2023 in Khan Yunis, Gaza\nPalestinians injured in airstrikes arrive at Nasser Medical Hospital on November 18, 2023 in Khan Yunis, Gaza\nSmoke billows as lightning illuminates the sky during the Israeli military bombardment of the northern Gaza Strip on November 14, 2023\nSmoke billows over Gaza City amid an Israeli bombardment and a storm on November 14,2023\nIn Khan Yunis, 23-year-old Ahmed said that many Hamas fighters - known as the resistance - had survived the onslaught in the north.\n'They (the Israelis) want to come to the south? They can. The resistance will fight back because no one welcomes occupiers,' he said.\nAssessing Israel's gains till now, Eiland said he believed the IDF had dealt with 'something like 50%' of Hamas' military capacity.\nBut Hamas officials outside Gaza - who, given collapsing communications inside the enclave, are now the main voice of the Islamist group - insist that it is far from being a spent force.\n'The resistance still believes that it is at the beginning of operations to confront the occupiers and emphasises the continuation of the confrontation,' Osama Hamdan, a Beirut-based Hamas official, told the Iranian news agency IRNA.\nA senior Israeli security source, who declined to be identified said: 'Khan Yunis will be very hard because a lot of the terrorists fled there and are operational there,' adding the southern campaign was likely to begin in earnest within days and could take a month to arrive at the Egyptian border.\nAs of Thursday, Israel's military figures indicate more than 50 soldiers have been killed since the ground offensive began, compared with the 66 killed in its last major incursion in 2014.\nBut, even if the southern campaign requires a slower pace and three to four weeks to reach the same objectives as in the north, according to Giora Eiland, a former head of Israel's National Security Council, Israel will be undeterred.\n'I'm not sure that all foreigners understand the Israeli mood: Israel will not stop the operation before the hostages are back.'", "source_domain": "www.dailymail.co.uk", "text": null, "title": "Hundreds of patients evacuate Al Shifa hospital in Gaza on foot as 450 are left behind - while Israel vows to advance 'wherever Hamas exists'", "title_page": null, "title_rss": null, "url": "https://www.dailymail.co.uk/news/article-12764893/Hundreds-patients-evacuate-Al-Shifa-hospital-Gaza-foot-450-left-Israel-vows-advance-Hamas-exists.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"}