{"authors": [], "date_download": "2024-02-05 15:37:48", "date_modify": "None", "date_publish": "2024-02-06 00:00:00", "description": "Ukrainian President Volodymyr Zelenskyy on Thursday met UK new Foreign Secretary David Cameron. During the meeting, Cameron reiterated the UK support for Uk", "filename": "https%3A%2F%2Fwww.unitedkingdomnews.net%2Fnews%2F274035031%2Fdavid-cameron-meets-volodymyr-zelenskyy-reiterates-uk-support-for-ukraine.json", "image_url": "https://cdn.bignewsnetwork.com/ani1700131313.jpg", "language": "en", "localpath": null, "maintext": "Kyiv [Ukraine], November 16 (ANI): Ukrainian President Volodymyr Zelenskyy on Thursday met UK's new Foreign Secretary David Cameron. During the meeting, Cameron reiterated the UK's support for Ukraine.\nThe two leaders held a meeting focused on weapons, strengthening air defence and protecting the people of Ukraine and its critical infrastructure. It was David Cameron's first visit to Ukraine as UK's Foreign Secretary.\nTaking to X, Zelenskyy stated, \"Hosted @David_Cameron on his first visit to Ukraine as Foreign Secretary of the UK. We had a good meeting focused on weapons for the frontline, strengthening air defense, and protecting our people and critical infrastructure. I am grateful to the UK for its support!\"In his remarks, Cameron reiterated the UK's support for Ukraine. He stressed that the UK will continue to support Ukraine for \"how long it takes.\" Cameron acknowledged that he had disagreements with former UK Prime Minister Boris Johnson. However, he added that he fully backed Johnson's support for Ukraine.\nDavid Cameron said, \"I admire the strength and determination of the Ukrainian people. And what I want to say by being here is that we will continue to give you the moral support, the diplomatic support, the economic support, but above all, the military support that you need, not just this year and next year, but how long it takes.\"\"I had some disagreements with my friend Boris Johnson, but we've known each other for 40 years and his support was the finest thing that he and his government did. And I back it 100 per cent. And so it's really important to have this meeting to hear what it is emoji to work out how we can work together, how we can get the communications right with all our friends and know to make sure the attention is here in Ukraine,\" he added.\nZelenskyy thanked the UK for its \"unwavering support\" to Ukraine. He praised defence cooperation with the United Kingdom that enables the Armed Forces of Ukraine to effectively defend against Russia, particularly due to long-range weapons, according to Ukrainian President's website.\nZelenskyy said, \"This is very important, especially now that the world is paying attention not only to the situation on the battlefield in Ukraine. We are grateful for the United Kingdom's unwavering support for Ukraine. We are grateful for the warm welcome of Ukrainian citizens in the UK. And we are glad that you have come to Ukraine.\" (ANI)", "source_domain": "www.unitedkingdomnews.net", "text": null, "title": "David Cameron meets Volodymyr Zelenskyy, reiterates UK's support for Ukraine", "title_page": null, "title_rss": null, "url": "https://www.unitedkingdomnews.net/news/274035031/david-cameron-meets-volodymyr-zelenskyy-reiterates-uk-support-for-ukraine"}